[
    "Full Stack Engineer | Full Time | Remote | https://fanmio.com\n\n@Fanmio is looking for a full stack developer to help build and maintain a new greenfield project. The project is an e-commerce system and you will primarily be responsible for the frontend admin portion + \"backend for frontend\" GraphQL API.\n\nFanmio is a platform that allows you to meet your favorite celebrities & heroes in one-on-one personal video meet & greets. The project's tech stack is:\n\n- TypeScript\n\n- Vue.js\n\n- Buefy + Tailwind CSS\n\n- Node + GraphQL (using AWS Amplify)\n\nIf this sounds like something you're interested in and is in your wheelhouse, apply by sending me an email with your GitHub profile, portfolio/project links, and resume to careers@fanmio.com.\n\nLooking forward to talking with you!\n\nreply",
    "DomainTools| Seattle,WA,USA | Senior Python Engineers | Full Time | Remote (US) or Onsite (Seattle)\n\nDomainTools is the leader in domain name, DNS and Internet OSINT-based cyber threat intelligence and cybercrime forensics products and data.\n\nWe are seeking a Senior(5+ years)Backend Engineer (Python, GoLang, AWS, Docker, Kubernetes, My SQL, NoSQL, Hive, Linux/Unix, DevOps) Our team’s vision is to create a self-service, GitOps driven, developer-centric platform that allows for continuous integration and deployment of our world class security applications to our hybrid AWS environment\n\nMORE INFO/APPLY: https://apply.workable.com/domain-tools/j/6AE954A733/\n\nreply",
    "Not A Satellite Labs | Co-Founders (Marketing/Sales + Computer Vision) | Remote (U.S.) | https://notasatellite.com\n\nWe're building the world's first real-time map using a network of cameras aboard 60,000+ daily commercial flights. Our approach lets us gather thousands of times more data at a fraction of the operational cost of building, launching, and maintaining satellite constellations. Our competitors advertise daily revisit rates; we've demonstrated 1,500+ updates on a single coordinate in early tests using only cell phone cameras at an average resolution of 20cm.\n\nI've been building the prototype and handling early-stage product market fit exercises as a solo founder, but now we're actively raising with the help of an excellent advisory team. I'm looking to bring on co-founders who can help run the growth machine and assist me with development of the video ingestion engine in a GTM capacity. We currently have 248 customer commitments running on a negligible burn (~$100/month for feeler ads, ~$400/mo for cloud compute) and have begun the patent filing process.\n\nIf you'd like to hear more about the business concept, current challenges, the product roadmap, or just want to chat about GIS, shoot me an email (chris@notasatellite.com) or check us out @notasatellite.\n\nreply",
    "[deleted]",
    "I think you're in the wrong thread, you want the \"Who wants to be hired\" one at https://news.ycombinator.com/item?id=24651637.\n\nreply",
    "you're correct! My oversight, thanks for the heads up!\n\nreply",
    "Materialize | Engineers | Marketing | NYC and North America Remote | http://materialize.io/careers\n\nMaterialize is a streaming database for real-time applications. Materialize lets you ask questions about your data, and then get low-latency, correct answers, which are kept incrementally updated as the underlying data changes.\n\nMaterialize is built on Timely Dataflow, a low-latency cyclic dataflow computational model, first introduced in the paper \"Naiad: a timely dataflow system\". Materialize is co-founded by Frank McSherry, the primary author of Timely Dataflow (http://timelydataflow.com) and Differential Dataflow (http://differentialdataflow.com), the two open source projects that power Materialize. Materialize itself is source-available and entirely written in Rust: https://github.com/MaterializeInc/materialize\n\nMaterialize is a team of over twenty, primarily based in New York City but also open to remote positions. We are hiring in all engineering positions (eng. manager, engineers from new grad to principal) as well as several non-engineering positions. For the full list, see http://materialize.io/careers\n\nWe are a team of significantly experienced individuals in databases and distributed systems, and looking to add more folks with that interest and/or experience to our team.\n\nreply",
    "I had some genuinely great chats with Arjun last summer, though life got busy and i didn't followup at the time. I have no doubt that its a fantastic group of colleagues to work with though.\n\nreply",
    "How strict are the requirements for the marketing positions? Do you have something suitable for entry-level / recent graduate?\n\nreply",
    "This posting says North America remote, but the site says US Remote. Can you clarify which it is?\n\nreply",
    "Nice! they're using Rust\n\nreply",
    "Should engineers from new grads to senior levels apply under Principal Engineer listing?\n\nreply",
    "I fixed the listing, thanks for pointing that out!\n\nreply",
    "Please do!\n\nreply",
    "Discord | Senior Software Engineer - Audio + Video | San Francisco | Onsite, Remote (USA) | Full-Time | 150k - 250k + equity | https://discord.com\n\nLove Rust? C++ Connoisseur?\n\nJoin us on our journey to build the best cross-platform messaging and communication platform in existence. We've seen tremendous growth the past couple months and are on a vendetta to make the audio and video experience the best it can possibly be for our 100m+ monthly active users.\n\nIn our quest for excellence we've built our own hardware-accelerated video encoding and decoding pipelines from scratch (in Rust!), dug into the guts of Chromium and WebRTC, and worked around some of the most esoteric OS constraints I've ever seen in my career. We'd love to have you join us.\n\nApply at https://discord.com/jobs/4764612002.\n\nEmail is in profile (or jobs@discord.com) - come chat about what we're doing, or if you have questions!\n\nreply",
    "You mention remote, but the job description says the position is based in SF. Is this position only remote temporarily due to COVID, or is this a full-time remote position?\n\nreply",
    "We can do full (permanent) remote.\n\nreply",
    "Worldwide or US-only?\n\nreply",
    "US only at this time, unfortunately.\n\nreply",
    "United States Digital Service | Senior Product Managers, Senior Designers, Senior Software Engineers, Senior Site Reliability Engineers, and more! | Washington, DC | ONSITE required in general, but most of us are 100% REMOTE during COVID-19 | https://www.usds.gov/\n\nWe are looking for empathetic and mission-focused engineers, designers, product managers, government procurement specialists, bureaucracy hackers, and more with 3+ years of experience in the tech industry to work on sometimes ambiguous --sometimes huge-- but always impactful endeavors. We work on some of the biggest issues affecting the American people, including: streamlining immigration, helping veterans get benefits, modernizing health care, reforming hiring, improving school safety, fixing procurement, and more. Come join us in shifting government tech in the right direction -- no government experience required!\n\nCheck out our most recent impact report for examples of what you could be working on:\n\nhttps://www.usds.gov/resources/USDS-Impact-Report-2020.pdf\n\nApply here: https://www.usds.gov/apply\n\nreply",
    "The work we're doing helps everyone from Veterans to medical patients. Making government services responsive, accessible, and transparent is really important right now.\n\nPlease consider applying, or just ask here if you have any additional questions!\n\nreply",
    "Is USDS recruiting focused solely on tech companies? I know some strong folks looking for work, but they're coming out of being digital people in DC nonprofit world, not working at tech startups.\n\nreply",
    "Current USDSer -\n\nWe hire from anywhere. If you have the skill set, battle-scars, and a willingness to dive into hard problems, we want you.\n\nreply",
    "Thank you\n\nreply",
    "As a current federal employee in DC, I've been long interested in working for USDS--in fact I've had a USDS jobs tab open in one of my long-lived browser windows since 2019. The one thing that has dissuaded me from applying is the \"tours\" aspect whereby the position is temporary. I'm not as into the Silicon Valley constant job-hopping thing. I'm more into gaining a depth of knowledge in each project I work on rather than skipping around and not feeling ownership.\n\nreply",
    "Tour of duty model is required due to how they hack the GS pay scale to get folks closer to technologist market rate.\n\nThey are doing meaningful, impactful work, and even if you’re adverse to the short term model, I’d highly recommend considering a conversation with them (might be possible to do a tour with USDS and then roll into a long term role at 18F @ GSA).\n\nreply",
    "I've always been interested in USDS but the requirement to relo to DC is always a non-starter.\n\nreply",
    "If you wanted to try a short tour, now is a very good time; things are quite remote-friendly right now. Then when the COVID situation is better, you'd have better information about whether the DC trade-off is worthwhile.\n\nreply",
    "I would be interested in the senior product type role.\n\nreply",
    "DialogEDU | West Palm Beach, FL | REMOTE US | Ruby on Rails developer | Full-time |\n\nOur team is currently 2 full-stack rails engineers, We're looking to bring 2 more (front-end/back-end focused). MUST have: 3+ years production Ruby on Rails experience. TDD/BDD using Rspec, Capybara. Experience using/implementing RESTful APIs. Experience with code refactoring & optimization.\n\nOur tech: Rails, React, MySQL, AWS Projects to work on in the near future: Update rials from 4 to 6. Improve test suite, increase test coverage. Extract Rails engines into core app. Improve performance. Scale. Develop integrations with 3rd party APIs. Develop next version of API. Make your email subject line 'Dialog SE application <your name>' so we know you've read this.\n\nSend email to jobs at dialogedu.com Include in the email: 1) Resume. 2) Why you'd be a good addition to the team. If possible, links to projects/code samples that highlight your skills.\n\n======================================\n\nDialogEDU | West Palm Beach, FL | REMOTE US | Front End developer | Full-time |\n\nOur team is currently 2 full-stack rails engineers, We're looking to bring 2 more (front-end/back-end focused). Must: 3+ years production React experience, Strong js experience. Testing with Cypress or similar. Bonus: Basic understanding of rails\n\nOur tech: Rails 4. React, Ember 1.8, jQuery. MySQL, AWS Projects to work on in the near future: 1) Convert app dashboard (currently: html, css, jquery, ember, react, tubolinks) into react app. Make your email subject line 'Dialog SE application <your name>' so we know you've read this. 2) Overhaul platform UI/UX Send email to jobs at dialogedu.com Include in the email: 1)Resume. 2) Why you'd be a good addition to the team. 3) If possible, links to projects/code samples that highlight your skills.\n\nreply",
    "Skytap | Full-Time | REMOTE (US/Canada) | Mid/Senior Full Stack Engineer (Ruby/Rails/JS/React)\n\nSkytap, a cloud infrastructure startup based in Seattle, seeks a talented, mid-level or senior Rubyist for a full-time, remote opportunity as a Rails / full-stack engineer, anywhere in the US or Canada.\n\nI’m the hiring manager for this position. My team of 5 (including this new opening) manages a product of our own that sits atop Skytap’s cloud platform and helps to drive one of the most important segments of Skytap’s business. We work closely together, wear lots of hats, operate with a high degree of autonomy, and are generally pretty awesome, if I do say so myself. :)\n\nMore info: https://jobs.lever.co/skytap/0d7943d0-a111-4ac5-a907-5fe0704...\n\nDon't hesitate to reach out if you have questions or would like to chat: my HN username at skytap.com.\n\nreply",
    "Ockam | Remote (US only) | Full-Time, Remote-OK | https://ockam.io\n\nOckam offers tools that help builders create IoT systems they can trust. Ockam's open source developer tools make it simple to send trustful end-to-end encrypted messages between connected devices and/or cloud services.\n\nHere are our open roles:\n\n- Embedded w/ Rust: https://www.ockam.io/team/Senior-Engineer-Embedded-Rust/31b8...\n\n- Distributed systems w/ Elixir: https://www.ockam.io/team/Senior-Engineer-Elixir-Erlang/d93a...\n\nreply",
    "Ockam is up to some incredible things!\n\nIn my first week I've worked on our Rust codebase, cryptographic key generation & storage, trust architecture, and had a masterclass on modern Open Source business. This is a fantastic place to do great work.\n\nreply",
    "Tango | Los Angeles, LA | REMOTE US | Senior Full-Stack Engineer| Full-time | https://tango.us/\n\nTango helps teams share how work gets done. Learning on the job today is a snooze. Training manuals and performance reviews? Terrible. We think better coaching results in more people reaching their full potential. To start, we’re building screen-capture tech and workflow analytics for team members to watch and learn from each other, remotely.\n\nMyself and 2 other co-founders left HBS to build this. Backgrounds at Uber + General Catalyst, and our CTO in blockchain tech.\n\nWe're a team of 7 that have raised seed funding (unannounced) and looking for Senior Full-Stack Engineers who care about helping people be their best at work and having fun while joining on the ground floor.\n\nMore info: https://www.notion.so/Senior-Full-Stack-Engineer-Tango-bd92c...\n\nApply: rebrand.ly/tango-sfse\n\nor reach out dan at tango.us - always excited to share more!\n\nreply",
    "DataCamp | London UK / Leuven BE / Remote | Full-time | https://www.datacamp.com/jobs\n\nDataCamp is building the best platform to learn and teach data skills. We create technology for personalized learning experiences and bring the power of data fluency to millions of people around the world. Our learners get real hands-on experience by completing self-paced, interactive data science courses, practice, and projects from the best instructors in the world, right in the browser.\n\nWe are an international team with backgrounds in education, data science, design, psychology, biology, linguistics, engineering, and more. We are united by our passion for impacting the future of education.\n\nCurrently, we have multiple open positions in our Engineering department.\n\n---\n\n## Engineering Manager\n\nMore information & applications: https://boards.greenhouse.io/datacamp/jobs/2356366\n\n---\n\n## Senior Full Stack software engineer (JS/Typescript)\n\nMore information & applications: https://boards.greenhouse.io/datacamp/jobs/1402346\n\n---\n\n## Senior Front-end software engineer (React/Typescript)\n\nMore information & applications: https://boards.greenhouse.io/datacamp/jobs/2366084\n\nreply",
    "DuckDuckGo - We are looking for candidates that are excited to join us on a mission to raise the standard of trust online. All of our roles are fully-remote, except where specific locations are noted.\n\nDuckDuckGo | Associate General Counsel (US) | REMOTE\n\nDuckDuckGo | Director, Data Scientist | REMOTE\n\nDuckDuckGo | Director, Site Reliability Engineering | REMOTE\n\nDuckDuckGo | Senior C# Developer | REMOTE\n\nDuckDuckGo | Senior macOS Engineer | REMOTE\n\nDuckDuckGo | Director, Windows Application Development | REMOTE\n\nDuckDuckGo | Senior Android Engineer| REMOTE\n\nDuckDuckGo | Senior DevOps Engineer | REMOTE\n\nDuckDuckGo | Senior Product Designer, Mobile | REMOTE\n\nDuckDuckGo | Senior Corporate Counsel (US) | REMOTE\n\nDuckDuckGo | Senior iOS Engineer | REMOTE\n\nDuckDuckGo | Senior Privacy Engineer | REMOTE\n\nhttps://duckduckgo.com/hiring\n\nreply",
    "I applied for the Senior C# Developer role, unfortunately it didn't proceed as my C# experience is largely on the web side rather than the desktop side. I just want to say I felt valued throughout the process and that I felt Prakash really listened to me and spoke honestly. It was refreshing to have such an open and empathetic interaction with a company, so kudos to you folks for operating like this!\n\nreply",
    "It seems like they have a keyword-based non-tech gatekeeper. Your case reminds me about: https://www.reddit.com/r/ProgrammerHumor/comments/4k994j/if_...\n\nreply",
    "Same! I applied for the Senior iOS position and I liked how the whole process was transparent and straightforward.\n\nreply",
    "Why does ddg care much about desktop? Aren't they an online search portal?\n\nreply",
    "They also have browser.\n\nreply",
    "Volocopter | (Senior) Embedded Software Engineer / (Senior) Autonomous Flight Software Engineer | Full-time | ONSITE | Bruchsal, Germany & Munich, Germany | https://volocopter.com/en/\n\nWe at Volocopter are pioneers in the development of electrical air taxis that take off and land vertically (eVTOLs).\n\nWe bring Urban Air Mobility to life, by establishing air taxis in addition to current transportation options in megacities globally. Our aim is to offer affordable on-demand air taxi services and save people time by flying them safely to their destination. In 2011 we performed the first-ever piloted flight of a purely electrical multicopter and have since showcased numerous public flights with our full-scale Volocopter.\n\nWe are looking for software engineers experienced in the development of real-time embedded software applications.\n\nPrior aerospace experience is great, but not a requirement.\n\nJoin us and build software that will literally take off in front of you!\n\nList of all job offers to apply directly: https://careers.smartrecruiters.com/VolocopterGmbH\n\nVideos of flights: https://www.youtube.com/c/Volocopter/videos\n\nIf you have any questions, don't hesitate to drop me an email at manuel.mohr (at) volocopter (dot) com :)\n\nreply",
    "Teller | London, UK | On site preferred but remote worldwide is OK | https://teller.io/\n\nTeller makes banking APIs for developers that provide real time access to live, up-to-date data from their users' accounts and also allow instant payment initiation and transfers on behalf of users.\n\nOur approach is unique in that we don't \"screenscrape\" online banking portals, we reverse engineer the bank's often heavily protected mobile app to discover its private API contract and implement our own API compatible clients.\n\nRoles we are currently hiring for:\n\n- Designer #1\n\nAre you the kind of designer talented enough to walk on to Stripe's design team but want to have the impact of being designer #1 not #100? We would love to talk to you.\n\n- Reverse Engineering (iOS)\n\nWe pop open some of the most well protected mobile apps in the world as a prerequisite to integrating a new bank. If you have a more sophisticated answer than \"MITMProxy\" for the question \"How would you reverse a banking app's API contract?\" please get in touch. We're working on some exciting projects like our own LLDB debugserver undetectable by state-of-the-art anti-RE tools and static decryption of Apple's FairPlay DRM. We strongly believe investing in proprietary tooling is major advantage.\n\n- Erlang/Elixir Engineers\n\nOur application is 100% Elixir. We really mean it. We are 100% all in on Elixir, we've already built a lot of new features on Phoenix LiveView too.\n\n- DevRel/DevX Engineering\n\nDo you think DevRel has jumped the shark and needs a reboot? Same here. This role involves a mixture of core engineering, being a user advocate within the company, creating great content and tooling for the best possible developer experience.\n\nSound interesting? Let's talk: sg@teller.io\n\nreply",
    "That Reverse engineering gig looks good but my RE experience is based on WhatsApp (and more exp in android). Hijacking private APIs to build your product is pretty ballsy. Very cool.\n\nreply",
    "Reforge | Full-time | REMOTE | Full stack Engineer (React + Rails)\n\nHi. I'm Buford. I sometimes tell bad dadjokes at inappropriate times. People ask me if I'm alright, but clearly I'm half right and half left.\n\nReforge is changing the way we do professional education. Our customers are the leading practitioners in the tech world. We want to be the example of world-class education and community product.\n\nBootstrapped we went from 15 to 35 people even during covid. Our eng team is 4 and we're looking to add 5 and 6. Hoping for a product-focused engineer to come think with us.\n\nFounded by Brian Balfour -- 3x successful founder and ex-VP Growth at Hubspot. You'll be working with people who once hailed as VP Engineering at Credit Karma, employee #10 at Eventbrite, AirBnB PMs, Rails core contributors, and seasoned entrepreneurs.\n\nTech stack: latest React, latest Rails, Redis, Heroku, Postgres, some Python\n\nWould you like to know more? buford@reforge Full role details: https://www.reforge.com/careers/senior-software-engineer\n\nreply",
    "Drvn Solutions | Software Engineer | London, UK | REMOTE currently, Covent Garden post Covid | Full time\n\nDrvn Solutions are a startup in Connected Vehicles working alongside European breakdown clubs to process vehicle telemetry data and prevent breakdowns. As a Software Engineer in our team you'll work on streaming services in Java and Python services all hooked into Kafka. Bring your micro service and distributed systems knowledge and apply it to a rapidly growing platform.\n\nThe team are working from home currently. When things return to normal we hope to get back to a day or two in our London office.\n\nThe stack includes: Python, Java, Kafka, KStreams, AWS, Docker\n\nLearn more about the role and apply: https://www.drvnsolutions.com/software-engineer Learn more about Drvn: https://www.drvnsolutions.com/\n\nreply",
    "Rescale | San Francisco | SF & REMOTE | https://jobs.lever.co/rescale\n\nRescale offers a software platform and hardware infrastructure for companies to perform scientific and engineering simulation. (We're an HPC/Supercomputing Cloud Platform) We are a Y Combinator startup with top investors: Jeff Bezos, Sam Altman, Paul Graham, Peter Thiel, & a bunch of others. I think we're now #39 on the Top YC list. We have about 170 employees scattered around the world, with about 30 software developers. The company still feels small and everyone is pretty tight. Work atmosphere is fun & friendly. We just closed Series C so we are in a very strong position to ride out whatever plays out in the economy & are probably a bit more insulated than most companies. We are growing very rapidly--all departments are hiring. It's exciting, a lot of opportunity, interesting technical problems to solve, definitely a good time to join. Devs that come in now will have the opportunity to have a big impact on the future of our company, our code & our culture.\n\nWe're currently looking for: Senior Backend Engineers, Full Stack, Data Engineers, Software Engineers, & a Lead UI/UX Designer\n\nreply",
    "Where did the list of acceptable remote states come from?\n\nreply",
    "Does it work for people in Europe?\n\nreply",
    "The Register (Situation Publishing) | Perl developer | REMOTE / UK/CH/EEC\n\nThe Register: https://www.theregister.com/\n\nEl Reg's small tech team is looking for a full-stack (Perl) software developer. Offering up to 60,000 EUR / 55,000 GBP / 0.00055Pg based on your location and experience.\n\nFully remote. You'll need to be in UK, CH or the European Economic Area though.\n\nAs ElReg's readership grows and revenue streams change, there is a steady flow of work. You will ensure that the website remains performant and that journalists have the tools they need. ElReg needs your help in keeping the business profitable whilst providing great free content to readers.\n\nMore details on: https://www.theregister.com/Page/perldev.html\n\nreply",
    "Offtopic but it's nice to see a perl listing!\n\nreply",
    "Nice to see THE Perl listing!\n\nreply",
    "MobSquad | Calgary, Canada | Toronto, Canada | Vancouver, Canada | Halifax, Canada | Full-Time | Visa |\n\nMobSquad helps foreign national technology professionals in the US that are struggling to secure or renew work visas. The company also has a significant and ever-growing pool of international talent that MobSquad pairs with scaling and innovative technology companies across North America.\n\nWe are currently looking for talented tech enthusiasts to fill roles in Front-End Development, Full-Stack Engineering, Data Engineering, and Machine Learning/Data Science Management. Candidates with US experience are encouraged to apply today!\n\nAdditionally, MobSquad can help with visa sponsorship. Are you currently in your last year of STEM OPT eligibility and are concerned that you will not be successful in the upcoming H-1B work visa lottery? Or are you worried that your current H-1B visa will not be renewed given increasing denial rates? Contact us today to discuss how we can help with these pressing work visa issues.\n\nFind our job postings here: https://mobsquad.io/join-team/ For more information, contact us here: info@mobsquad.io\n\nreply",
    "Flow Labs | Oakland, CA | Software Engineer, Designer | Full-Time\n\nWe’re building the world’s first Autonomous Traffic Management (ATM) platform - a single platform that plugs into connected vehicles and connected infrastructure to optimize city traffic. Our flagship product, Predictive Traffic Control (PTC), is the world’s first pure software solution for traffic signal control with proven capabilities to reduce rush hour travel times in major cities by up to 24%. We’re on a mission to eliminate congestion, improve traffic flow and give back time to everyone.\n\nCurrently hiring for our first Designer (https://angel.co/company/traffic-flow-labs/jobs/991819-produ...) and Software Engineers (https://angel.co/company/traffic-flow-labs/jobs/986260-softw...)\n\nThis is a great opportunity to join an ambitious, mission-driven startup taking on a $1tn+ global problem. We're well-funded and are making significant traction in our market. If you’re interested, apply via AngelList or email me your resume or LinkedIn at jatish@flowlabs.ai\n\nreply",
    "Ambue | Software Engineers | REMOTE (UK only) | https://www.ambue.com\n\nAmbue is an Oxford-based startup developing technology to help people make their homes energy efficient. We've part of an accelerator with the Energy Systems Catapult and we're backed by the UK government.\n\n20% of CO2 emissions come from domestic property and >£65b will need to be spent upgrading properties to meet the UK's Net Zero targets. The government have multiple financial incentives available, but we've got a data problem: people don't know which upgrades to make, they don't know how to access finance, and they don't know how to find trusted tradespeople.\n\nWe help homeowners collect property data and combine it with our own data to create an accurate energy loss model. We identify the best retrofit solutions for their home and help them through the upgrade process.\n\nWe're looking to work with creative software engineers who care about the environment, want to make a difference, and are happy working independently.\n\nWe have two rolls to fill:\n\n- Elixir + Phoenix Liveview (full-stack)\n\n- Unreal Engine or Unity\n\nFor more info and to apply: hn-hiring@ambue.com\n\nreply",
    "GlassDollar | Node.js/React Software Engineer | Remote (Europe) or Berlin | Full-Time | 1 - 2% equity | https://glassdollar.com\n\nGlassDollar is a corporate innovation scouting platform. We help corporates find startups to partner with, and we help startups land their first large customers.\n\nWe are cash-flow positive, with additional funding from a group of influential angel investors in Germany, and we are growing rapidly. We are 100% remote-first, with an office in Berlin, and we also have an office in the Majorcan mountains to escape the cold European winter.\n\nWe promise you an exciting and rewarding experience with a very friendly group of highly-motivated people.\n\nCome join us! Apply at: apply-engineering@glassdollar.com.\n\nreply",
    "Hyperfine | Python Backend and Deep Learning | NYC/CT | ONSITE (eventually...) | Full Time | https://hyperfine.io\n\nHyperfine invented a portable MRI scanner to make MRI available to more people in more situations. We are FDA cleared and shipping to customers now - see recent post on HN [0] for some more information and discussion.\n\nHyperfine is part of the 4Catalyzer accelerator. Our 7 sibling companies (including Butterfly - portable ultrasound) share resources and expertise.\n\nRelevant open positions (https://hyperfine.io/careers/):\n\nSenior Machine Learning Scientist New York City, New York\n\nSr Software Engineer (Deep Learning) New York City, New York\n\nSenior Software Engineer (Python) New York City, New York\n\nI think we will also have a DevOps role open soon...\n\nWe are using Python, Django, Svelte, TensorFlow, and the PyData stack.\n\nApply through our website or contact me (aanderson at hyperfine.io) if you are interested.\n\n[0] https://news.ycombinator.com/item?id=24421331\n\nreply",
    "Pelican Community: The Pelican Community is the Uber of international delivery. Through the Pelican Community, an overseas online shopper can now order from any country's e-commerce store even if they don't ship internationally, and get their items delivered to them in hours to few days compared to current international delivery time ranging from weeks to months. We are achieving that by using the existing daily 22 million international passengers from each to every major city in the world, we use their remaining free luggage space to deliver items heading to the same destination. The result, Passengers make up to $400 per flight while online shoppers get access to any country's e-commerce store and get their items delivered them cheaper and faster than ever! Check us out at www.pelicancommunity.com (Website is currently down for Maintenance)\n\nLocation: Toronto, NYC, Washington DC or Remote North America\n\nPositions: -Looking for an entrepreneurial CTO\n\n(https://angel.co/company/pelican-community/jobs/995234-looki... )\n\n-Entrepreneurial Business Development Manager\n\n(https://angel.co/company/pelican-community/jobs/1006898-entr... )\n\nThis is a great opportunity to join an ambitious, mission-driven startup taking on the $1tn+ logistics Market. We're Pre-revenue and Pre-seed. If you’re interested, apply via the AngelList link or email me your Resume/LinkedIn at info@pelicancommunity.com or naser@pelicancommunity.com\n\nreply",
    "SiteSpect | Front-End Customer Success Developer | REMOTE - Boston | https://www.sitespect.com\n\nSiteSpect is a digital optimization platform that lets you test or target your web traffic without having to change any code on your side. Under the hood, SiteSpect is a reverse proxy. Requests from end users are routed to an appropriate backend and SiteSpect modifies the response based on what tests the user is assigned to and then delivers those changes back to the end user. We're looking to fill a variety of roles, including seeking client facing front-end developers to help our clients use our tools to test and modify their websites, and advise clients on how best to test and optimize their customer experience.\n\nOpen Technical Roles:\n\nFront End Solutions Developer (Customer Success) - http://app.jobvite.com/m?3JgOalwN\n\nreply",
    "Calipsa | Full-time | Remote (be able to work in CET time zone) | Engineering Manager\n\nCalipsa's mission is to make the world a safer place by helping to detect and prevent crime. Calipsa’s AI platform analyses CCTV video in real-time to assess risk, filter out false alarms and automatically notify alarm monitoring services. Our current focus is on detecting burglary and theft and we monitor sites across construction, logistics, industrial, agricultural, retail and residential sectors in 7 different countries.\n\nRole & Responsibilities\n\n  - Responsible for the delivery of the product\n  - Improve the application team’s technical capabilities by establishing best practices, mentoring team members and recruiting new employees\n  - Lead discussion on technology and architecture with the development team\n\nKey Requirements\n\n  - Minimum 3-4 years experience working within engineering teams with team lead/management experience; ideally within fast growing and category-leading companies\n  - Great knowledge in those different technologies node.js / single page application frameworks (vue js/react) / AWS / Kubernetes\n  - Understanding of and experience with large, multi-faceted and complex systems.\n  - Experience working in small teams with a great deal of autonomy\n  - Excellent communication and collaboration skills\n\nSend resume and links to rashid[dot]khan[at]calipsa[dot]io\n\nreply",
    "ABAX - one of the fastest-growing telematics companies in Europe - is opening a new Tech Hub in Gdańsk and are looking for talented Senior Backend, Frontend, Android and System Engineers to join the team ONSITE in Gdańsk (Poland). Current tech stack consists of .NET Core, Vue.js, Google Cloud, Docker, Kubernetes, Swift, Kotlin, TDD, DDD, Linux, Windows, Microservices. Feel free to check out the career website: https://www.abax.com/uk/work-at-abax Or reach out to agata.kmiecik@abax.com for more info\n\nreply",
    "Grouparoo | Senior Full Stack Engineer - Founding Engineer | Full-Time | Remote - USA\n\nGrouparoo (https://www.grouparoo.com/) is a venture-backed software company building the open-source framework for managing, syncing, and syndicating data between your app(s) and all the marketing and operations tools your company needs to run. Do you need to keep your product data (Postgres) in-sync with Hubspot, Marketo and Zendesk? Do you want to limit the PII that leaves your firewall but still build robust email-marketing cohorts to use in Mailchimp? Do you want to enable your Marketing team to experiment with new definitions of what “high LTV customers” are, and try new ways to re-engage them… without you needing to write any code? That’s what Grouparoo does.\n\nAs our first hire, you’ll be a Founding Engineer at Grouparoo. You will be responsible for helping to craft the roadmap, developing features, fixing bugs, and building products that make our customers happy. We are a small team, and so we are looking for generalist engineers who are interested in learning about a wide variety of tools and technologies rather than becoming experts in any one part of the stack. We connect many different APIs, databases, and vendors, so there’s always something new to learn.\n\nLearn more about the position @ https://www.grouparoo.com/jobs\n\nreply",
    "Mount Sinai, School of Medicine | New York, New York | Full-time | Remote-to-onsite (after all this dies down) | Senior Data Engineer (2 Positions available)\n\nStrength Through Diversity Ground breaking science. Advancing medicine. Healing made personal.\n\nThe Mount Sinai COVID Informatics Center (MSCIC) aims to translate and unify data from the Mount Sinai Health System (MSHS) into actionable information and insights that can be mobilized against COVID-19 and ensure that MSHS is ready for similar public health threats in the future.\n\nWe're hiring two senior data engineers:\n\nSenior Data Engineer with a focus on ingestion, QA/QC, and staging: https://careers.mountsinai.org/jobs/2664488?lang=en-us\n\nSenior Data Engineer focusing on modeling/data warehousing: https://careers.mountsinai.org/jobs/2664490?lang=en-us\n\nMore about us: MSCIC is hiring a centralized Engineering Core that will build an Informatics Crisis Response Platform. This platform will include two components: (1) a Critical Informatics Consultation Service that provides MSHS clinicians and researchers easy-to-digest answers to pressing clinical questions (2) a Rapid Clinical Intervention Toolkit that facilitates the practice of evidence-based medicine in the MSHS by feeding insights from data science into the daily workflow via the electronic medical record.\n\nWho we are looking for: MSCIC is looking to hire experienced data engineers who will help build the platform that will enable informaticists, researchers, and clinicians to collaborate in a common environment, bring data into clinical settings in novel ways, and provide practitioners with more information when making diagnoses and treatment plans.\n\nThanks for reading!\n\nTake care,\n\nMark\n\nreply",
    "Alt | SF, NY | Full-Time | Onsite, Remote | https://onlyalt.com\n\nAlt's mission is to increase the transparency and liquidity of alternative assets. Whether it’s sports cards, shoes, watches, or art, Alt will help you manage, insure, and leverage your portfolio. We are backed by First Round Capital, SV Angel, BoxGroup, and other notable angels.\n\nWe are in the building phase and growing quickly so you will be instrumental in laying the foundation at Alt and will have the opportunity to shape the product and culture from the beginning.\n\nOur open positions: https://boards.greenhouse.io/alt\n\n* Software Engineer\n\n* Data Engineer\n\n* Machine Learning Engineer\n\n* Data Scientist\n\n* Product Designer\n\nTech Stack: Python, GraphQL, React, Apollo, Postgres, Airflow, AWS\n\nreply",
    "Symaps.io | Full stack | Paris, France | Full Time | Remote / On Site | Compensation based on profile |\n\nSymaps.io is an application rank and score locations based on the environment : residents, surrounding businesses and infrastructure, footfall. Our data is incuding anonymized movements from 500+ million mobile devices in 180 countries, +100 million businesses, HD census in any country.\n\nWe just closed a 700K seed round and several clients contracts, and are urgently looking for passionate peoples to strengthen our team of 10 people (incl. 4 full time engineers).\n\nEsp. we're hiring 2 full stack engineers. Our stack : Python, React, Scikit-learn, Kubernetes, Elastic, PostgreSQL / PostGIS.\n\nMore details here : https://50-partners.welcomekit.co/companies/symaps-io-1/jobs... https://50-partners.welcomekit.co/companies/symaps-io-1/jobs...\n\nreply",
    "Digi-Key Electronics | Search Product Owner | Full Time | MN (Bloomington or Thief River Falls)\n\nDigi-Key (https://digikey.com) is a distributor of electronics components that supplies over 11 million different parts to Engineers, Manufacturers and Hobbyists around the world.\n\nWe are looking for someone to own the future of our best in class component search. Ideal candidates are passionate about the cross section of electronics and software, but need not be an expert in either. This position will lead agile teams with the goal of making Engineers' lives easier, more efficient, and to help uncover more effective ways to search, filter and understand how to find/choose new hardware technologies.\n\nWe have recently upgraded to Elasticsearch and React, Node, and have quite a bit of .NET C# infrastructure as well.\n\nOnsite at one of two offices in MN is preferred, but remote is possible. The health benefits are amazing and it's a great environment for people with families. Checkout the job listing here. https://digikey.wd5.myworkdayjobs.com/en-US/Digi-Key/job/Thi...\n\nreply",
    "ID.me hiring multiple positions to join our rapidly scaling team. We're keeping up with 60k+ new daily users, about 1MM every 20 days!\n\nROLES: Sr Android Engineer Sr Software Engineers Principal Software Engineers Team Lead Engineers Sr Frontend Engineers 3 Sr Devops Engineers\n\nRemote until mid 2021, then onsite with flexibility in Mclean, VA Direct hire positions, must be eligible for US employment, no visa sponsorship. May provide relocation assistance.\n\nSalaries range from 130-180k+ with equity options\n\nAPPLY HERE: https://workforcenow.adp.com/mascsr/default/mdf/recruitment/...\n\nreply",
    "Allumia | Clean Tech | www.allumia.com | Remote (Seattle-based) | FT | Software Developer\n\nAllumia provides a platform through which utilities can fund, design, install, and maintain energy efficiency upgrades for commercial and industrial buildings. After six years of bootstrapped growth and proven success, several of the nation’s major utilities have now signed on with Allumia.\n\nThis is where you come in. We’re seeking a software engineer to join our small, growing product team and help us build out our customer-facing web platform and metering infrastructure to handle the vast volume of work our utility partners are sending our way.\n\nFor the web piece, our stack is React/Typescript, GraphQL, Rails and PostgreSQL. Our meters use C++, Python, and Node endpoints. Product thinking, decent design sense, and comfort with/interest in data is also key.\n\nYou’ll be working alongside the rest of the tech team, as well as some very sharp minds in a variety of fields, from finance to electrical engineering. We’re a mission focused company and have built a successful business model around saving energy.\n\nIf you’re interested in reducing the output of carbon into the atmosphere, working here is a pretty decent way to maximize your impact.\n\nEmail tech@allumia.com with resumes and inquiries.\n\nreply",
    "Nightwatch.io | Remote | Full-time | Elixir, Rust, Ruby, Go\n\nThis is a fully remote position, full-time or part-time, with flexible working hours and work arrangements.\n\nWe’re looking for an experienced developer who enjoys working with server side technologies and possesses a good mixture of DevOps and application development chops, has been around the block a couple of times, and would like to build forward-thinking and innovative solutions with experienced teammates in a progressive-oriented environment.\n\nAbout the role: You should have plenty of experience in building performant, easy to use, well monitored and well tested APIs, creating and maintaining robust web applications, designing efficient data flows, communicating clearly, usharing knowledge and questioning existing solutions.\n\nIf you are a positive-oriented hacker who does not fit the traditional company structure and resonates with the mindset of programming languages and paradigms being just a tool and not a heavy personal attachment and identification, then this role might be the right fit for you.\n\nAbout the company: We’re a self funded SaaS company that primarily builds forward-thinking tools for internet professionals. We are a bootstrapped company that believes the future belongs to smaller companies that don’t subscribe to the 9-to-5 corporate way of doing things. We believe that the Silicon Valley era is over, and we are building a business that allows us to enjoy the freedom of working remotely where each of us has the autonomy and flexibility to have a high impact on the world with our work.\n\nBack-end Developer (Elixir, Ruby, Rust, Go): https://nightwatch.io/jobs/backend-developer\n\nFront-end Developer (Ember.js transitioning to React): https://nightwatch.io/jobs/frontend-developer\n\nDevops Engineer: https://nightwatch.io/jobs/devops-engineer\n\nProduct Owner: https://nightwatch.io/jobs/product-manager\n\nreply",
    "Hello Community! Glovo is hiring for the Tech team!\n\nCo-Vid 19 has made our Grocery section have a HYPERGROWTH! We need great Tech Team members to provide the best experience and SOLUTION to the world!\n\nWe are super flexible, start dates can be moved and you can start remote to THEN MOVE to Sunny Barcelona Office + New Tech Hub in Warsaw Poland!\n\n(WFH, full flexibility but Fulltime NOT JUST REMOTE, full relocation + Sponsorship)\n\nAt the moment Glovo is the fastest-growing generation 2 (this means that we have our own logistics platform) delivery startup in the world and becoming one of the best Tech Product Start-ups in Spain.\n\nTech Challenges: Project Valkyrie: Related to the number of deployments per day. Project Darwin: Going from a Monolithic to a Microservices architecture. Better efficiency with Machine Learning.\n\nTech Stack: Java , Python, Spring Boot, Redis, Python, NodeJS, AWS (SQS, Kinesis, Aurora,EC2, Lambda,Cloudwatch, Jenkins, Terraform, Ansible, Github Actions, Spinnaker, DataDog Mobile: Java, Kotlin, Swift Frontend: JavaScript, Vue.js, Typescript.\n\nKey SENIOR Job Openings: Staff Software Engineers, Engineering Managers, Tech Leads.\n\nhttps://jobs.glovoapp.com\n\nIf you write to me I will guide you through the process faster!\n\ngianluca.rosania@glovoapp.com\n\nI’m attaching our corporate video: https://youtu.be/1lnZ8xsx9bE ;)\n\nreply",
    "UnifyID | Redwood City, CA | Full-time | Onsite | Competitive | https://unify.id/\n\nUnifyID is building a revolutionary identity platform based on implicit authentication. Our solution allows people to identify themselves in a unique way that is extremely difficult to forge or crack. Best of all, we are doing it in a way that respects user privacy.\n\nLatest Announcements - https://unify.id/press.html - SXSW Security & Privacy 2017 Winner - RSA Innovation Sandbox Unanimous 2017 Winner - TechCrunch Disrupt SF Battlefield 2016 Runner-Up - Stanford StartX S15\n\nRoles: - Senior Full Stack Engineer: https://bit.ly/2ZfoNVE - Machine Learning Engineer: https://bit.ly/3839Uta - Lead iOS Engineer: https://bit.ly/2A46R7N - Senior iOS Engineer: https://bit.ly/2VeshX2 - Lead Android Engineer: https://bit.ly/3ezYks2 - Senior Android Engineer: https://bit.ly/2VkqOhV - Lead DevOps Engineer: https://bit.ly/3ey7hCr - QA Engineer: https://bit.ly/31fD5be\n\nExcellent team, comprehensive benefits, great light-filled office, visa sponsorship, exciting growth, and meaningful impact at this early-stage VC funded startup.\n\nEmail: careers@unify.id\n\nreply",
    "1build (YC W20) | Full-Stack Software Engineer | REMOTE (US time-zones), SF Bay Area | Full-time\n\n1build is building the future of construction. We like to think of buildings as applications. We see the process of turning blueprints into buildings as an algorithm. It's an algorithm we seek to optimize. We're ambitious and relentlessly driven, yet humble and collaborative. You'll join 1build in our first stage of development, in which we build an application to improve the process of converting blueprints into shopping lists and cost estimates. It's a process that's critical yet currently cumbersome for 3.2 million builders in the US alone.\n\nInvestors love us. We're backed by top VC firms including YC, Initialized, Sequoia, and MetaProp. Our core team has experience at Apple, WeWork, Tesla, CloudKitchens, and Hipmunk, with academic backgrounds from Harvard and Princeton. You'll join a culture of excellence at 1build.\n\nTech stack: GraphQL | Postgres | Python | Go | React | TypeScript\n\nhttps://www.workatastartup.com/jobs/16399\n\nreply",
    "SeedFi | Senior React Native Engineer | SF, NYC or Remote (USA) | seedfi.com\n\nSeedFi builds financial products for the 100M Americans who live paycheck to paycheck. Our customers are the most vulnerable members of society and our products tangibly improve their financial health. We're backed by A16Z and our founders have decades of experience in the lending industry.\n\nThere are many fintech startups trying to differentiate themselves, capture customers, and then figure out how to make a profit later. We're proudly starting from the other side... we’re adding the banking after getting the unit economics to work!\n\nMany of the products we're building don't have any existing analogues in the market, so we're looking for engineers with an entrepreneurial bent. Our team experiments frequently, iterates quickly, and we use both data and customer feedback to measure our success.\n\nWe've purposefully kept a low profile, so we'll tell you much more about our products during the interview process!\n\nTo apply, please email your resume to jobs at seedfi dot (most common TLD).\n\nhttps://www.seedfi.com/jobs\n\nYou can also ask me questions via the email on my profile.\n\nreply",
    "SUSE | Software Engineer | REMOTE or ONSITE | Full Time\n\nArm Kernel Software Engineer\n\nWe're looking for an experienced Arm Linux developer to help our team make Linux run on specific Arm machines, implement new features and solve bugs in the kernel and other core software. If you can analyze and fix kernel crashes, have a clue on how to track down mysterious system hangs and like working with open-source communities, then this is the job for you.\n\nRequirements are excellent knowledge of the C programming language, knowledge of the Arm architecture, understanding of the open source development processes and culture, version control with git. Experience with Linux kernel development is appreciated.\n\nHow to apply\n\nPreferably, submit all relevant information in a single PDF file, so that no important detail is lost in transit. Give us some time to process your application. Expect the interview to be done over phone. Form submission for this position at https://jobs.suse.com/us/en/job/71000102/Arm-Kernel-Software...\n\nThis is not the only job opening currently available at SUSE, see suse.com/jobs\n\nreply",
    "Latitude / AI Dungeon | ML Engineer / Applied Scientist | Remote (U.S.) | Full-Time | https://latitude.io\n\nLatitude is revolutionizing how games are made by leveraging advanced AI. Our first product AI Dungeon (https://aidungeon.io) is an AI powered text adventure where literally anything is possible. We're a small team looking for ML Engineers / Applied Scientist to help us continue innovating on how to transform how games are made.\n\nYou can apply by emailing careers+hn@latitude.io\n\nreply",
    "Awesome! Have been following the AI Dungeon story from the start and it's great to see it become a full fledged product. Definitely somebody's dream job ;)\n\nreply",
    "Simplecast (A SiriusXM Company) | Remote (USA) | Full-Time | Senior Back End Engineer & Senior Front End Engineer\n\nEvery year, millions of new listeners are being exposed to podcasting, with hundreds of thousands of new creators meeting this increased listener demand with new content. Individual audio content creators are looking for better tools to immerse their audience in a story.\n\nWe're growing our product development team to shape the future of podcasting by empowering audio creators with the resources they need to connect their shows with a world of listeners.\n\nOur Tech Stack includes:\n\n    Elixir, AWS (Lambda, S3, Aurora Postgres, SNS, CloudFront), Kubernetes,\n    ElasticSearch, Redis, Vue.js, GitLab CI/CD, Git, Node\n\nApply for Back End role here: https://jobs.jobvite.com/siriusxm/job/oOJbdfwF\n\nApply for Front End role here: https://jobs.jobvite.com/siriusxm/job/ooJbdfwf\n\nreply",
    "3Box Labs | Software Engineer, Distributed Systems Engineer | NYC, Berlin, Remote | Full Time Want to build a more interoperable web free of silos? Join us in building Ceramic, the p2p dataweb for open information management.\n\nWe're a small, highly technical team at the center of the web3 ecosystem. We are extremely intentional, impact-driven, community focused (everything we do is open source), and driven by nonstop learning and growth. We have a lot of fun while we work - remote-first, with pods in NYC and Berlin - and travel to amazing places for regular retreats.\n\nWe're looking for engineers on the cutting edge of modern development. If you like to push browsers to the limit, experiment with edge computing, or scale p2p networks then we'd love to talk to you.\n\nLearn more about what we're building at https://www.ceramic.network/ and https://idx.xyz/.\n\nApply at https://jobs.lever.co/3box\n\nreply",
    "Argentinia, Armenia, Austria, Belgium, Brazil, Bulgaria, Canada, China, Costa Rica, France, Germany, India, Ireland, Japan, Korea, Mexico, Netherlands, Poland, Romania, Russian Federation, Spain, Switzerland, UK, USA. ONSITE and REMOTE.\n\nIn Swahili, ‘tanzu’ means the growing branch of a tree. In Japanese, ‘tansu’ refers to a modular form of cabinetry. At VMware, Tanzu represents our growing portfolio of solutions to help you build, run and manage modern apps. We help customers develop cloud-native apps and maintain existing apps side-by-side, on the same enterprise-grade platform.\n\nWork on or with Kubernetes, Spring, Cloud Foundry, RabbitMQ and many other open-source projects: https://tanzu.vmware.com/open-source\n\nPractice Extreme Programming, Lean Product Management, User-Driven Design or Site Reliability Engineering.\n\nWe're hiring for most levels of\n\n  - Software Engineer\n  - Solutions Architect\n  - Solutions Engineer (pre-sales)\n  - Site Reliability Engineer \n  - Open Source Community Relations Engineer\n  - Product Manager\n  - Product Designer\n  - Technical Program Manager\n  - Sales roles\n  - and more\n\nListings are here: https://careers.vmware.com/main/jobs?keywords=tanzu\n\nIf you'd like to get recommended for a position, email me at: a f l e i g at vmware.com.\n\nVMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment.\n\nreply",
    "Sewan | Multiple positions | Full-time | ONSITE (2 WFH days/w) Paris 10eme or Montpellier| https://www.sewan.fr/\n\nSewan is an European (Paris based) tech company providing B2B telco services \"with a twist\" : Become your own telco and build your customer base, deploy services and bill them through a unique white labeled web portal. We take care of all the infrastructure, automation, shipping, billing, ... so you can focus on your customers. Think some hybrid version of AT&T+AWS+Shopify.\n\nOur services are available in France, Spain, Belgium and Germany at the moment and we're in great shape despite the pandemic: 115M€+ expected revenue and a recent 75M€ in funding\n\nWe recently started a spin-off team of about 20 people in charge of rethinking and rebuilding part of our platform and main portal with new techs, and a full-on \"user first\" approach supported by a dedicated UX conception team. Tech stack: SPA ReactJS+Styled-components, GraphQL, SOA (Python/ NodeJS), infra as code on AWS\n\nI'm looking for experienced only :\n\n* Product Owners & Scrum masters\n\n* Backend Engineers (SOA Python/REST API or NodeJS/GraphQL)\n\n* Frontend Engineers (SPA React/GraphQL)\n\n* Devops Engineers (AWS, Terraform, Gitlab)\n\nContact: ricardo.belin AT sewan.fr\n\nThe company also offers a wide array of engineering positions (network, telco, cloud computing, etc.) across multiple teams (R&D, Ops, devs, support...) that you can find and apply for here https://www.sewan.jobs/ (only in French at the moment)\n\nreply",
    "Canexia Health | Vancouver, BC, Canada | On-Site or Remote | Devops Engineer We believe everyone with cancer should have the same fighting chance to survive and thrive.We work in a rapidly evolving field that attracts smart, talented people who are committed to making a difference for cancer patients. But not everyone has access to those advances, which are all too often limited to patients at elite medical institutions or those who know someone who ‘knows someone’ working in our field. People who join us are dedicated to bringing equity and access to critical aspects of cancer care. The DevOps Engineer is a part of the software team that works within a cross functional structure with software developers, bioinformaticians and lab scientists. You are a highly motivated individual with a penchant for automation and a desire to deliver quality software by increasing our DevOps maturity. Our tech is largely open-stack, with a lot of Python, Javascript, Django, AWS EC2, Ansible and Docker. Your work directly helps identify targeted treatments and clinical trials that can benefit cancer patients. If this is you, check out our posting: https://canexiahealth.com/about-canexia/careers/ if you have any questions, email mmchenry@canexiahealthcom\n\nreply",
    "Launch Potato | VueJS Python Django | 100% Remote (US) | Full-Time\n\nLaunch Potato builds valuable companies with smart, fun, passionate people and our proprietary technology stack. As an engineer you can look forward to: Contributing to front-end libraries that drastically speed up building new customer experiences with reusable components utilizing VueJS. Working with Python, SQL, PostgreSQL, Presto, Redshift, Spark, Hive, AWS, and Looker to build and maintain large-scale data pipelines, data warehousing, and data lakes that support a flexible business intelligence ecosystem. Designing, developing, and maintaining modern, scalable web applications in a Unix environment using VueJS/Nuxt, Python Django, GraphQL, PostgreSQL, RabbitMQ, Celery, Kinesis, Docker, AWS.\n\nLead Front End Engineer: https://launch-potato.breezy.hr/p/130a3e5ec20a All other positions: https://launchpotato.com/careers\n\nreply",
    "Heidelbergcement | Frontend, Backend, Devops, UX & Data Engineers | Onsite and Remote | Heidelberg, Germany & Brno, CZ\n\nHeidelbergCement is one of the biggest concrete, cement and aggregates business in the world. Do you like UX-driven applications and construction machinery, then come join us. We are hiring both juniors and seniors. Our stack is React Native, .net, OKD, graphml, Azure, NATS, postgresql, etc\n\n- UX designer https://www.heidelbergcement.com/en/ux-designer-fmd--%282931...\n\n- (Lead) devops https://www.heidelbergcement.com/en/lead-devops-engineer-fmd...\n\n- Service Owner https://www.heidelbergcement.com/en/service-owner-digital-pr...\n\n- Frontend (react) https://www.heidelbergcement.com/en/front-end-engineer-react...\n\n- backend (.net core) https://www.heidelbergcement.com/en/back-end-engineer--net-f...\n\n- QA https://www.heidelbergcement.com/en/quality-assurance-engine...\n\n- Data engineers (Azure, python, etc etc) Ad is not yet up. Send me a PM.\n\nreply",
    "Forward | San Francisco, CA | Frontend, Mobile, Full stack Engineers | ONSITE when safe, REMOTE for now\n\nWant to transform healthcare? Now’s the time. We're hiring for our world-class engineering team at Forward. https://www.youtube.com/watch?v=xkjxo6SdPT8\n\nWe're on a mission to make quality healthcare affordable and accessible to those who need it most around the world. We’re looking for detail-oriented, product-focused, impact-driven teammates to help us realize the mission.\n\nWe're building an entirely new system to empower our doctors with advanced tools (https://goforward.com/technology) to facilitate early detection, continuous improvement and personalized care – supported by data – with a nationwide network of primary care clinics in cities across the country. Video tour here: https://www.youtube.com/watch?v=dnJEsoGmh-8&feature=youtu.be\n\nIf this mission resonates with you, check out our open roles at https://goforward.com/eng, or reach out to me directly at marissa@goforward.com with your resume.\n\nreply",
    "Floom/ FloomX | Full stack engineer | REMOTE or ONSITE, but must be on BST\n\nFloom is a VC-backed startup on a mission to become the leading vertically integrated florist software and ecosystem. Since launching in Feb 2016, we’ve been voted one of the top UK 100 startups three years in a row and created long-lasting relationships with florists across the UK and US.\n\nFloom is looking for a Full Stack engineer to help us build and strengthen our florist SaaS platform.\n\nAs a Full Stack Engineer at Floom you will: * Design, develop, deploy and maintain responsive web solutions, backend services and APIs * Help build and design the infrastructure of our products * Collaborate with a multi disciplinary team to deliver innovative solutions * Ensure best practices, standards and tooling are used\n\nPlease apply here: https://apply.workable.com/floom/j/22C9980030/\n\nreply",
    "Vetspire | Full Stack Software Engineer | Remote | Austin, TX | Full-Time | https://vetspire.com\n\nVetspire is an AI-driven medical records and practice management platform for veterinarians. We’re a startup that builds the technology suite that powers veterinary hospitals, impacting every aspect of patient care from AI assistance in the exam room to managing client communications and clinical analytics.\n\nWe're looking for a full stack engineer to join our small and technical team to continue to bring veterinarians’ dreams into fruition. Your day to day work will consist of learning and understanding veterinarians' needs and bringing them into reality from the front-end to the backend. Some examples of what your weeks may look like:\n\n* building remote tools for pet owners to sign consent forms, pay invoices, and fill in information online so they don't have to walk into the clinics during the pandemic\n\n* creating an emergency room clinical census to monitor patients and alert staff in real-time\n\n* designing the interface and algorithms for intelligent immunization reminders.\n\nYou'll be working directly with the thousands of veterinarians and staff using Vetspire every day, and talking with them often to better understand their needs and iterate on solutions with them. It's an incredibly fulfilling role to be able to make such a drastic difference in the lives of vets, and ultimately, everyone's pets. It's half-part engineering, half-part problem-solving.\n\nOur backend tech stack is a GraphQL Phoenix/Absinthe application written in Elixir, our frontend is using React with the Apollo GraphQL framework, our primary database is PostgreSQL, and it all runs on Google Cloud via Kubernetes.\n\nEmail me if interested at sam@vetspire.com (include \"HN\" in the subject).\n\nreply",
    "Meister | Vienna, Austria | Full-Time, ONSITE, DevOps, Backend Engineer, and others. https://www.meisterlabs.com/jobs/ --- Meister was founded in 2006 and is the company behind MindMeister (mind mapping - https://www.mindmeister.com) and MeisterTask (taks & project management - https://www.meistertask.com). We currently have an engineering department of 35 people and we're working with Ruby, Elixir, React, Redux, Kubernetes, on Google Cloud. We have 2 offices, the main and the biggest one in Vienna, Austria, and the newer, smaller one, in Seattle, WA.\n\nreply",
    "Radix Labs | Software Engineers esp. Front End Engineers | Cambridge, MA, USA (Boston area) | Full Time and Co-Op/INTERNS Biology has talented PhD Biologists spend 5 hours a day on hard to reproduce, unoptimized minutia that isn’t innovative. Radix Labs hopes to accelerate biotech innovation like early compilers did for computing by enabling lab protocols to seamlessly operate and be optimized across physical labs. Our software makes biology reproducible, faster, more efficient, and lets smart biologists focus on the science instead of managing the implementation. We do this by developing a compiler, operating system, scheduler, and device drivers for biology labs and protocols. We have funding from Ycombinator (S18), Firstminute Capital, MIT's The Engine, and Nikesh Arora.\n\nTechnologies: 100% Scala code base but we don't require you know it already. (It's helpful if you have past functional programming experience with Erlang, Ocaml, Prolog, Haskell, or similar.) Other tech: HashiCorp stack (Nomad, Consul, & Terraform), Apache Kafka, Akka, ScalaJS React, Z3, Cats, Bazel w/ rules_scala, (some) AWS.\n\nWe're especially looking for an experienced front end developer to lead developing our front end visual programming language that biologists use to describe their protocols to the rest of our software. Come join our world-class diverse, inclusive, and caring team! You won't be the only woman, trans person, POC, latino, non-US citizen, wearer of silly hats, or parakeet! We will consider remote candidates and those who need visa sponsorship on a case-by-case basis. We offer equity, great salary, unlimited PTO, medical, dental, and vision insurance, mechanical keyboard budget, and flexible work hours. Any questions, send me an email: halie at radix.bio\n\nFT app and job descriptions: https://forms.gle/1d3qE466kVFir8pf9\n\nCo-Op app and job descriptions: https://forms.gle/6qY9Gx4dkVtHSFXf8\n\nTechnical business development, sales, and marketing (biology, manufacturing/operations, or CS competent): https://forms.gle/WWo9A43TWagR2Pp8A\n\nreply",
    "This is a really neat project; I recommend language nerds with an interest in cross-disciplinary work check them out.\n\nreply",
    "Inpher (https://www.inpher.io/) | New York (USA), Lausanne (Switzerland), Paris (France) | Software Engineers | Full-time | Onsite\n\nAt Inpher, we believe that privacy and security are foundational to the future of computing and have built enterprise products to make this vision a reality. We are a small team of veteran founders, world-renowned cryptographers and proven software engineers. We are headquartered in New York City, with satellite offices in San Francisco and Lausanne, Switzerland, and have raised $14M in funding.\n\nApply at https://www.inpher.io/careers\n\nOr email to me directly at $user@inpher.io, where each ascii character of $user can be obtained by solving for x and converting to base-128,\n\nx = 145767 mod 611939, x = 109572 mod 598463\n\nreply",
    "A.Team | REMOTE | Part-Time / Full-Time / Contract | Senior Mobile Developer & Senior Mobile Designer | $100/hr - $120/hr\n\nA.Team is looking for a senior mobile app developer and mobile app designer. iOS experts are what we are looking for. Offering $100/hr - $120/hr based on experience.\n\nThe mission is to build a new mobile fitness app to connect trainers and clients in an engaging way. The platform enables fitness professionals to sell their classes, grow their business, and become part of a fitness community - all remotely. Similar to Mindbody, but for virtual classes, in this COVID era. Project is backed by VC GFC.\n\nThis position is remote, part-time or full-time, flexible with your availability.\n\nPlease send an email to dan@a.team expressing your interest. Please include your linkedin, and apps you have deployed on the iOS app store if applicable.\n\nreply",
    "Relativity Space | Long Beach, CA | Full Time | Onsite, remote during COVID | Equity\n\nRelativity Space is building humanity’s multiplanetary future. We invented a new approach to design, build, and fly our own rockets, starting with Terran 1 – the world’s first entirely 3D printed rocket.\n\nTech stack: C++, Python, C#, SQL\n\nNo aerospace experience required. Looking for full stack and C++ software engineers excited to dive into problems in controls, computer vision, and robust scalable solutions.\n\nYouTube video of how our technology is building the future of humanity in space: https://www.youtube.com/watch?v=rhNnurW48G0\n\nBuild software for our cutting edge 3D printing technology: https://boards.greenhouse.io/relativity/jobs/4902289002?gh_j...\n\nBuild real-time flight control software: https://boards.greenhouse.io/relativity/jobs/4905019002?gh_j...\n\nBuild launch data acquisition and control software: https://boards.greenhouse.io/relativity/jobs/4824690002?gh_j...\n\nreply",
    "Prune AI | New York, NY | Senior Full-Stack Engineers, Senior Backend Engineers | Full Time | Remote (US) or Onsite (NYC)\n\nPrune.ai presents a scientific approach to social media marketing. We are building an AI-powered marketplace to help businesses promote their products with word-of-mouth on social media. We have an MVP in stealth mode and are currently testing in closed beta.\n\nWe are looking for: * Experienced Full-stack/frontend engineer (React, bootstrap, HTML5/CSS, Django)\n\n* Experienced Backend Engineer (Python, Django, PostgreSQL, AWS and/or Azure, Scala and experience with Spark preferred)\n\n* Machine Learning Scientist (Python, Tensorflow or PyTorch, R or Matlab, Docker or Kubernetes, Scala and experience with Spark preferred, Masters+/PhD preferred)\n\nThe engineering team works directly with Machine Learning Scientists, so there is an opportunity for significant technical learning. Our team includes a PhD, ex-Amazon, and people with 10+ years of experience. Our team of 5 is fully remote at the moment, but we'd prefer applicants from the US to maximize time-zone overlap.\n\nMORE INFO: https://www.prune.ai/index.php?utm=hkn APPLY HERE: https://angel.co/company/prune-ai/jobs\n\nreply",
    "Digital Onboarding | Senior Full-stack Engineer | REMOTE (US based) | Full time\n\nDigital Onboarding is a marketing automation platform that helps banks and credit unions modernize their onboarding process and develop mutually beneficial, profitable relationships with their customers and members.\n\nStack: Elixir + Phoenix, React, Lambda (Node), Postgres\n\nRequirements:\n\n  - 8+ years in front end and back end web development  \n  - Committed to building features you're proud of  \n  - Strong understanding of SQL databases  \n  - Strong understanding of functional programming  \n  - Strong communication skills   \n  - Previous Elixir experience\n\nNice-to-haves:\n\n  - Machine learning experience  \n  - Experience working on a remote-first, distributed team   \n  - Love of nachos\n\nSend me an email me at jonathan at digitalonboarding dot com.\n\nreply",
    "Cookpad | Search Engineer, Python Engineer | Bristol, UK | REMOTE currently, relocation assistance available, ONSITE option (post Covid-19) | Full time | Visa sponsorship\n\nCookpad is the world's largest recipe sharing service, with over 100M monthly users globally. This is an opportunity to join the Global division of Cookpad, which is headquartered in Bristol (United Kingdom), and is responsible for 30+ languages, 70+ countries, and over 2M daily search requests.\n\nCookpad is growing its Search Team and is looking for experienced software engineers with a solid Python background who want to help build the next generation of recipe search on top of a modern stack. Particularly of interest are engineers who have previously worked on search and/or recommendation systems.\n\nThe team is working from home currently. Remote welcome, timezone-dependent. Relocation welcome. Relocation assistance available.\n\nThe stack includes: Kubernetes, Elasticsearch, Python, AWS, Kafka, Spark, Docker, Kubeflow\n\nLearn more about the role and apply: https://apply.workable.com/cookpad/j/BB8D0999E3/\n\nLearn more about Cookpad's mission to make everyday cooking fun: https://www.cookpadteam.com/\n\nreply",
    "Luminare | Full-stack Clojure(Script) Engineer | REMOTE (US + Canada timezones) | Full-time\n\nAt Luminare, our mission is to stop the #1 cause of death in hospitals, and help safely reopen America during the COVID-19 pandemic. We accomplish this through our two flagship products, Sagitta[1] and Quickscreen[2].\n\nWe’re looking for another experienced full-stack Clojure(Script) developer to join the team.\n\nOur frontends are built with re-frame. We’re building new Clojure backends (moving from nodejs/Express).\n\nLuminare’s team is distributed across the U.S. and Canada, and we’re hiring in those timezones. Our headquarters office is in Houston, Texas, with the team-members in that region all working remotely due to COVID. This position reports to our CTO.\n\nTo apply, please review the job description[3], then send your resume or C/V to join@luminaremed.com (please reference this post). Please email there with questions.\n\nWe’re looking forward to meeting you!\n\n[1]: https://www.luminaremed.com\n\n[2]: https://quickscreen.luminaremed.com\n\n[3]: https://luminareinc-my.sharepoint.com/:b:/g/personal/adam_fe...\n\nreply",
    "Zoomforth (https://www.zoomforth.com) | Engineering (Product) | US/UK-based REMOTE | Full-time\n\nHey HN readers, we're looking for engineers to join us!\n\nZoomforth is like Squarespace for Enterprise. We help professionals design and manage beautiful microsites. Big companies love us because their sites are consistently branded, accessible by a tightly controlled audience, and we provide great support. Their employees love us because they can use a WYSIWYG editor to create, edit, and publish with ease.\n\nFounded in 2012, we have a stable and growing base of big-name customers who love us. We are currently looking for a product engineer who can:\n\nDesign, implement, and improve our frontend React application, backend Python app, and ancillary systems. Work with the product team to help determine product direction. Manage and maintain an AWS elastic beanstalk environment.\n\nOur stack is AWS/Linux/MySQL/Python/React. We use modern dev tools like Docker, Webpack, and CircleCI.\n\nWe're a small, distributed team—so excellent communication, and a self-motivated work ethic are essential. Bonus if you’re experienced with remote work.\n\nIf this sounds exciting to you, please see our full job posting and apply at: https://share.zoomforth.com/product-engineer-hn\n\nThanks!\n\nreply",
    "Truveris | NYC, US (REMOTE) | Fulltime | www.truveris.com\n\nTruveris develops software that works to improve market access & affordability for prescription drugs.\n\nWe are hiring for a number of roles in data & engineering including: software engineers (various levels of experience), QA engineers, DevOps engineers and data scientists\n\nTech stack: Python (flask), AWS, Linux, Postgresql, React.js, sqlalchemy, spark...\n\nPlease apply on our website (https://jobs.lever.co/truveris) or email Kaitlin directly at kobrien@truveris.com\n\nreply",
    "IOTAS | Portland, OR or Remote | https://www.iotashome.com | Full time | REMOTE | Backend Engineering Manager\n\nAt IOTAS we work directly with apartment buildings to bring smart home technology to renters and property managers. Think smart door locks, lights, thermostats, etc that can be controlled via our mobile app. We are constantly integrating with new IoT devices that make life easier for both residents and property managers. Our backend software runs primarily on AWS (ECS, RDS, API Gateway, Lambda) and we have a fleet of hubs deployed in the field which are installed in each apartment.\n\nWe are looking for a Backend Engineering Manager to lead the IOTAS backend team which is responsible for architecting, designing and building the core of the IOTAS IoT platform.\n\n* Backend Engineering Manager - https://www.iotashome.com/job/backend-team-engineering-manag...\n\nreply",
    "Percona | Multiple roles | Worldwide | Remote | Full Time | https://www.percona.com/\n\nWe Are Unbiased Open Source Database Experts. And we are hiring.\n\nWe are looking for a MySQL Engineer. Location - APAC business hours. https://www.percona.com/about-percona/careers/database-engin...\n\nTechnical Operations Engineer. Location - APAC business hours. https://www.percona.com/about-percona/careers/technical-oper...\n\nA Golang Developer with strong experience with K8s and databases. Location- anywhere. https://www.percona.com/about-percona/careers/golang-softwar...\n\nA Software Engineering Manager. Location - EMEA https://www.percona.com/about-percona/careers/software-engin...\n\nreply",
    "Fueled |NYC / London / Noida| Full-Time | https://fueled.com/jobs\n\n* All roles will be remote until January 2021.\n\n-- Who We Are --\n\nAn award winning mobile app dev agency.\n\n-- Where You Fit In --\n\nYou know how to create jaw-dropping websites and web/mobile applications.\n\n-- Open Roles --\n\nLead Product Designer | NYC | https://grnh.se/f07bd4031us\n\nLead Product Designer | London | https://grnh.se/8f4a1cb31us\n\nSenior Product Designer | London | https://grnh.se/7ced0ea81us\n\nPrincipal Product Designer | London | https://grnh.se/6376da221us\n\nPrincipal Product Designer | NYC | https://grnh.se/0d45def91us\n\nMobile Engineering Manager, Android | London | https://grnh.se/e9dfa3481us\n\nMobile Engineering Manager, Android | Noida | https://grnh.se/e60b0a9c1us\n\nPlease contact Christine Chung, Lead Talent Manager (christine@fueled.com) for more information regarding Fueled positions.\n\nreply",
    "Osmind | Software Engineers II and III | Mountain View, CA | Onsite/Remote Hybrid | Full Time | http://osmind.org/\n\nThere are 22M+ Americans who suffer from treatment-resistant mental health conditions, meaning they’ve failed two or more conventional treatments. Our mission is to further innovative mental treatments (ranging from FDA-approved psychedelic medicine to neuromodulation) for those who are suffering the most. We do this by empowering providers, improving patient care, and accelerating research. Our software is used by mental health doctors and their patients. We analyze multimodal data from the software to help the doctors deliver better care and also offer insights to help research and development of new treatments that actually work. Together, we can usher in the mental health revolution and help solve our world's mental health crisis.\n\nWe are looking for mission-driven, passionate full stack software engineers to join the team. This is an opportunity to be part of a fast-paced, high-growth health tech startup. Our engineers work cross-functionally and have full ownership over their projects. We utilize a React/React Native, NodeJS, and AWS Lambda stack.\n\nWe are a team of Stanford graduates (CS/Engineering, School of Medicine, Graduate School of Business) with deep experience in healthcare and tech (AWS, Verge Genomics, etc.) backed by General Catalyst and Y Combinator.\n\nI'm co-founder/CEO and you can reach me at lucia@osmind.org.\n\nMore info here: https://osmind.breezy.hr/\n\nreply",
    "Openbase | San Francisco, CA | Frontend+Backend+Fullstack Engineers, Developer Advocate | Full Time | https://openbase.io\n\nOpenbase helps developers choose among millions of open-source packages - so they can build amazing products faster.\n\nThe company was founded in 2019 and is backed by Y Combinator and some of the best investors in the industry.\n\nWe're growing fast, currently serving almost 400,000 developers monthly, and are now hiring our 3rd and 4th engineers, as well as our first developer advocate!\n\nOur stack includes AWS, Netlify, PostgreSQL, TypeScript, Node, Apollo GraphQL, React, styled-components, Parcel\n\nWe offer great startup culture and energy, unparalleled impact and autonomy, and the opportunity to build something that helps millions of developers.\n\nTo apply, please visit https://angel.co/company/openbaseio or email careers@openbase.io\n\nreply",
    "Shaper Tools | Full-time | San Francisco, CA | ONSITE | Full Stack Software Engineer\n\nShaper is developing a revolutionary line of computer-augmented power tools, starting with Origin, a handheld CNC router. Origin is the perfect tool for all sorts of woodworking projects, from inlays and signs to fine furniture making. By using computer vision and a corrective range, Origin allows anyone to up their game. This is your opportunity to work directly with hardware products that have an impact.\n\nWe’re looking for a Full Stack Software Engineer to join the Web team to help lead development of our marketing and e-commerce web site. We use a wide variety of technologies including React, Redux, Styled Components with headless CMS for our front-end and Kubernetes, Terraform, NodeJS, and more on the backend.\n\nWe're also hiring for Marketing Lead, Hardware Engineering Technician, Product Design Engineer (Mechanical), UI/UX Designer. If any of this sounds interesting check out the link below and apply today.\n\nhttps://www.shapertools.com/about/careers\n\nreply",
    "Sevendof | Embedded / Front-End / Back-End / Robotics | Trondheim, Norway | ONSITE, VISA, Full-time | https://www.sevendof.com/\n\nSevendof is a Norwegian startup building the drone infrastructure of the future. Our mission is to make drones a safe and positive tool to help solve important problems in a scalable manner.\n\nWe are now hiring several new engineers who wish to help us build the future of industrial drones.\n\nTo apply, please submit your application at https://thehub.io/startups/sevendof or reach out to careers@sevendof.com with your information.\n\nreply",
    "Prisma | Developer Advocate (Working Student: 20h p/w) | REMOTE (UTC -1 to UTC +2 Timezone | €20.00 to €25.00 p/h\n\nWe are looking for someone with some background in the Node.js ecosystem, and an interest in relational databases to join us as a Working Student.\n\nYou will - Create, share, and document sample Prisma apps across a variety of languages. - Write tutorials and technical blog posts. - Speak about Prisma related topics at livestreams and events.\n\nPlease take a look at the job spec, and apply using the link here: https://grnh.se/7d37eba42us\n\nreply",
    "Airteam | Sydney, Australia | Onsite/remote mix | Full time permanent | No visa sponsorship available | Competitive salary\n\nHi everyone.\n\nAirteam is looking for a Senior Javascript Developer to join our team. We are a software design and development company based in Sydney. We are experts in user experience and custom development. We take an idea from concept to a fully developed piece of software.\n\nGreat perks: Work/life balance with flexible hours, paid time off, a mix of remote and some onsite working arrangements (all with COVID safe procedures in place with a preference to WFH as much as possible). Supported learning with an annual personal development budget and time off for training. Be part of a growing company with a friendly, supportive and positive culture.\n\nFull role details and applications to be made through our website: https://www.airteam.com.au/careers\n\nThanks!\n\nreply",
    "NASA ADS | Front-End Developer | Cambridge, MA (US) | Onsite | Full-time | VISA Sponsorship Available\n\nThe NASA/Astrophysics Data System is seeking a talented Front End Developer. Your front-end code will empower astrophysicists around the world to solve the mysteries of the universe.\n\nJob description: https://ui.adsabs.harvard.edu/about/careers/\n\nNASA ADS: https://ui.adsabs.harvard.edu/\n\nDo not hesitate to contact us directly at adshelp@cfa.harvard.edu\n\nreply",
    "Shogun (YC W18) | TypeScript + React Engineer | Full-Time | Remote (US, Canada, UK)\n\n---\n\nShogun is building next generation storefronts for eCommerce stores. We're at the intersection of eCommerce, JAMstack, and low-code/no-code tools. Our fully remote team of 70 is located all around the world.\n\n---\n\nAbout You..\n\n* An experienced TypeScript + React Engineer in the United States, Canada or the UK who will be working directly on one of our client-facing products, helping people build highly performant pages and PWAs for their eCommerce stores.\n\n* You'll be working in an agile team responsible for building UIs and tools for making web apps by utilizing modern technologies and solutions like TypeScript, React, Webpack, GraphQL, etc.\n\n* You'll write well designed, testable, readable and scalable code in accordance to clean code principles and team agreement.\n\n* You'll work closely with design, product management, and development teams to create elegant, interactive and highly performant interfaces.\n\n* You'll take proactive ownership of tasks and see them through to completion, and take responsibility for coding, bug testing, general software deployment, and tracking the product through its lifecycle, along with communicating with other internal teams.\n\n* You'll regularly contribute to discussions and brainstorm high quality ideas that result in adoption and improvements.\n\n* You'll proactively share knowledge and help your team evolve.\n\n---\n\nSounds interesting? Apply here: https://apply.workable.com/getshogun/j/A20FAFA044/\n\nreply",
    "Kubevisor | Remote | Contractors\n\nWe are looking for senior ML engineers on a contract basis for a project starting mid-October.\n\nYou should have a detailed understanding of the ML lifecycle, including:\n\n* 5+ years relevant work experience\n\n* Python to process data for modelling\n\n* Experience working with a wide range of predictive and decision models, including tools (primarily PyTorch)\n\n* ML workflow tools (e.g. Kubeflow/MLflow)\n\n* Developing end-to-end software projects\n\n* Experience using Linux to process large data sets\n\n* Experience with Kubernetes\n\n* Experience with AWS\n\nIdeally you are in the GMT to GMT+4 timezone.\n\nPlease get in touch at jobs@kubevisor.com\n\nreply",
    "I Am Cart | Technical Co-Founder (Senior Engineer / Full-Stack 5+ years) | Remote | Min 20hrs/week | Equity | https://iamcart.io\n\niamcart is a website that let’s people create their own e-commerce websites - think Shopify, Ecwid etc, with a focus on Africa - the untapped tech frontier.\n\nI’ve spent all of 2020 building the site and launched in September 2020 to real paying merchants. I am stretched very thin trying to juggle between enhancing the product and driving growth so I’m looking for a co-founder to handle/lead the tech aspect. I’ve used Python/Django for the back end, and Vuejs for the frontend so far.\n\nI was in the top 10% of applicants to the 2020 Summer batch of YC and was encouraged to apply again. Having a co-founder and demonstrating “startup-like growth” are two ways in which that can improve so if you join me, we can have an even better shot next time around but for now, we build and deliver an amazing product.\n\nEmail cofounder@iamcart.io to learn more/discuss. Thanks.\n\nreply",
    "Potato London | Python / Django Engineer | ONSITE or REMOTE but must be UK based\n\nPotato London is a digital product development agency.\n\nWe're currently on the lookout for a talented Python/Django Engineer based in or around London.\n\nSo if think you’ve got what it takes to build digital products and services that break new ground for some of the biggest brands on the planet, we can’t wait to hear from you.\n\nFor more information, and to apply, head over here: https://p.ota.to/jobs/python-django-engineer-london\n\nreply",
    "Iteratively | Engineers & Designer | Full Time | Remote\n\nIteratively helps teams who rely on data to capture high-quality analytics they can trust.\n\nYou will be working in an early-stage but fast-growing VC backed startup with experienced founders.\n\nTech stack: TypeScript, React, Node.js, GraphQL, Postgres, Redis, AWS.\n\nSenior Software Engineer: https://iterative.ly/careers/senior-software-engineer/\n\nSenior Backend Engineer: https://iterative.ly/careers/senior-backend-engineer/\n\nProduct Design Lead: https://iterative.ly/careers/product-design-lead/\n\nI’m one of the co-founders of Iteratively, feel free to reach out to me at patrick@iterative.ly with any questions.\n\nreply",
    "Kolonial.no / One of Norway's most disruptive tech scale-ups working with online grocery and logistics (end-to-end solutions) / Oslo, Norway / ONSITE\n\n// Some of the roles they are hiring for right now:\n\n- Director of Engineering - Shop Platform\n\n- Software Engineers x20 at least - all teams and future teams\n\n- Android Software Engineer - Shop Platform\n\n- iOS Software Engineer - Shop Platform\n\n- Platform Engineer - Infrastructure & IT\n\n- Reliability Engineer - Infrastructure & IT\n\n- Product Manager - Logistics Platform\n\n- IT Project Manager - Infrastructure & IT\n\n- Data Analyst - Data & Insight\n\n- Service & UX Designer - UX Design\n\n- Digital Designer - UX Design\n\n(OPEN FOR ENGLISH SPEAKERS)\n\n//www.careers.kolonial.no\n\nreply",
    "Intellimize | Senior Back-end / Machine Learning Engineer | ONSITE San Mateo, CA or REMOTE (US or Canada only) | FULL-TIME | https://www.intellimize.com/careers/mle/\n\nIntellimize optimizes websites to generate more revenue. We use machine learning to automatically optimize each buyer’s path to drive more web conversions.\n\nOur unique solution enables experimentation and personalization at an unparalleled scale, and it replaces traditional approaches to optimization such as A/B testing and rules-based personalization. These methods are too slow, require daily attention, and don’t automatically adapt to changes in behavior over time.\n\nThis role: senior level, back-end and some ML engineering. The exact blend is flexible, and we'd be happy to have a great back-end engineer join us even without any ML background.\n\nPrimary technologies: Java, Python, Tensorflow, Spark, Airflow, AWS.\n\nOur team is positive, low ego, and customer focused. Strong communication skills are a must.\n\nWe plan to re-open our San Mateo office once it is safe to do so, and the company will continue embrace remote work (it's going great for us!). This team in particular is remote-first.\n\nYou can apply via email to careers@, or to alex@ if you want to contact me directly. I'm the hiring manager for this position.\n\nreply",
    "Ripcord, Inc. | Fulltime | Currently Remote (due to COVID-19), eventually Onsite (Hayward, CA / SF Bay Area)\n\nRipcord is the world’s leading robotics digitization company, combining hardware and software robotics to process and digitize paper-based records via an Integrated SaaS offering. Focused on smart robotics digitization, smart content management with AI and helping better enable RPA and business processes.\n\nRipcord is transforming the $62 billion records management, RPA, MPS, and ECM space through robots that scan, index and categorize paper records, making them searchable in the cloud and integrated into existing business processes and enabling RPA. Ripcord is based in California and has raised $110 million from leading investors including CDK Global, Kleiner Perkins, GV, Baidu, Lux Capital, Silicon Valley Bank, Steve Wozniak, Legend Star, and Icon Ventures.\n\nWe respect and look after one another at Ripcord. We want everyone to feel supported, safe, free to innovate and take risks that result in breakthroughs that challenge the status quo. Crazy ideas are welcome here! Our team is fun, driven, and energetic. Every day we work with industrial robots, computer vision systems, and a diverse stack of software tools to tie it all together.\n\nApply here: https://www.ripcord.com/careers/\n\nreply",
    "Qualia | Fulltime | SF (but currently remote due to COVID-19) | Full-stack developers\n\nAt Qualia, we’ve built a new class of real estate technology that simplifies home buying and selling into an easy, understandable, and secure process. Our products bring together users from across the real estate ecosystem—homebuyers and sellers, lenders, title and escrow agents, and real estate agents—onto a single shared platform, providing greater clarity and transparency to real estate transactions. Today, over half a million real estate professionals use Qualia to power their closings.\n\nOur engineering team is the core of our company. Fast-paced and product-focused, Qualia engineers work cross functionally with design, product, and our customer-facing teams to imagine and build new experiences for our growing user base.\n\nSoftware Engineer II (New Grads): https://grnh.se/b2c913571us\n\nSenior Software Engineer: https://grnh.se/8e96b6c11us\n\nSenior Software Engineer, Infra: https://grnh.se/6e04192c1us\n\nEngineering Manager: https://grnh.se/6e04192c1us\n\nreply",
    "PrepDD | Remote | Frontend + Fullstack Engineers | Full time | https://www.prepdd.com\n\nPrepDD is a workspace for accounting teams, helping them manage all of their projects in the same place.\n\nWe run in React / TypeScript / Apollo GraphQL / RoR / PostgreSQL, but more importantly we're looking for a good teammate to join our core product team. We build fast because we push each other outside of our comfort zones and we're looking for others to join the mix.\n\nApply here https://angel.co/company/prepdd/jobs or email careers@prepdd.com\n\nreply",
    "NZXT | REMOTE | Senior Software Engineer | Full-time | https://www.nzxt.com/\n\nNZXT CAM is the next generation of desktop software for powering your PC. Whether it’s monitoring performance, customizing your hardware accessories, or overclocking your GPU for those extra frames, NZXT CAM has the solution.\n\nSenior Software Engineer, CAM (Frontend): https://nzxt.bamboohr.com/jobs/view.php?id=244&source=aWQ9MT... We leverage web technologies to build software features for PC hardware (such as controls and visualizations on our recently released Kraken Z series of liquid coolers https://www.nzxt.com/product-overview/kraken-z) and are looking for a senior-level software engineer with experience in full stack web development for our front-end team. Tech stack: TypeScript/JavaScript, Electron, React, MobX.\n\nWe are also looking for software engineers fluent in Rust and development targeting Windows desktop for our back-end team: Senior Software Engineer, CAM: https://nzxt.bamboohr.com/jobs/view.php?id=259&source=aWQ9MT...\n\nLearn more at https://www.nzxt.com/camapp\n\nWe <3 Gamers\n\nreply",
    "Uneeq | New Zealand / Remote | Full-time | Senior ML Engineer & Senior Unreal Engineer | https://digitalhumans.com/careers/\n\nAt Uneeq, we are on a mission to introduce digital humans to the world. We have developed a platform that enables creators to design digital human experiences which have a positive impact on the lives of people, everyday.\n\nWe are looking for a Machine Learning Developer to join the team which builds our digital human platform. You'll be focused on improving the behaviour and awareness of our digital humans.\n\nWe are also looking for a Software Developer experienced with the Unreal Engine to join the team who build our digital human rendering components.\n\nThese roles are key contributors to one of UneeQ's core product teams and will play an important role in helping to develop UneeQ's platform and take it to market.\n\nWe recently launched a self service version of our platform, where you can create, integrate and deploy your own digital human - https://digitalhumans.com/creator/\n\nIf you'd like to know more, here are full role details: https://digitalhumans.com/careers/\n\nreply",
    "EmbraerX Beacon | Senior Front-End Engineer, Senior Back-End Engineer, Senior Test Automation Engineer | 100% REMOTE (but, for legal reasons, US or Brazil only)\n\nEmbraer, the third-largest producer of civil aircraft, is hiring. We’re building https://beacon.works, a tool for airlines and mechanics to manage unscheduled aircraft maintenance. This has the potential to be a very high-value product for the aviation industry and could make air travel much better for everyone.\n\nWe have multiple (functional JS and TS) React and React Native frontends and a GraphQL API backend in Clojure. Our engineering team is small but very experienced, passionate, and kind. We're looking for senior engineers with relevant technical experience as well as a product/project manager.\n\nLocation: Remote (must be able to legally work and reside in the US or Brazil)\n\nTech: React Native, GraphQL, TypeScript, Clojure, Postgres, AWS/GCP\n\nApply: Please email your resume to work@beacon.works (principals only, no recruiters or agencies)\n\nNote: We can only hire legal US or Brazil residents and cannot sponsor visas or relocation. We are also federally regulated and all employees must pass a federal drug test. These restrictions are not within our control so please do not ask for exemptions. Thanks.\n\nreply",
    "I've applied and we had the first interview by phone. The next step would be a technical test. The recruiter ghosted me and I never got to the test. After 20~ days, I sent an e-mail asking for an answer, even if negative. Never got a reply.\n\nreply",
    "Owkin | Software Engineer / DevOps | Paris, France or Nantes, France | REMOTE | Full time |\n\nOwkin was co-founded in 2016 by Thomas Clozel, MD, a clinical research doctor and former assistant professor in clinical hematology, and by Gilles Wainrib, PhD, an academic pioneer in the field of Artificial Intelligence in biology. The company was built on the belief that medical research should be collaborative, inclusive, and privacy-preserving. Today, Owkin is building a global research network — using federated learning — connecting data scientists, clinicians, researchers, and pharma on a research platform that keeps the data secure and preserves privacy. Owkin’s work has been published in Nature Medicine and other top-tier journals. Owkin has raised over $74M from leading VC funds and is now working with the largest cancer centers and pharmaceutical companies in Europe and in the US.\n\nWe're looking for experienced software developers with a desire to help medical research. Our tech stack : Python/Go/React/K8S.\n\nFor more information, check our job page here : https://www.welcometothejungle.com/en/companies/owkin/jobs\n\nreply",
    "Quick feedback: that page does not work in Safari/Mac.\n\nreply",
    "Visible Body | Full-time | Software Developer | Newton, MA | REMOTE (FOR NOW) | https://www.indeed.com/viewjob?jk=55114f7bb2448ce3&tk=1ejkmi...\n\nVisible Body makes learning and teaching anatomy and physiology visual and engaging. We invent apps that advance the way students learn and healthcare professionals practice. Our inspiration comes from the dynamic world of 3D games and mobile devices. Our compelling, interactive, and highly accurate visualizations launch anatomy education far beyond written text, flat images and plastic models.\n\nJob Description:\n\nVisible Body is seeking a highly motivated Software Developer to join our growing team. The Software Developer will work with teammates to create and update our eLearning platform.\n\nRequired:\n\nStrong OOP fundamentals 2-5 years experience in Ruby on Rails 2-5 years experience in DBMS Superior problem solving skills and debugging ability Critical attention to detail and ability to test one’s own code for quality assurance Strong verbal and written communication Bachelor’s degree in Computer Science, Mathematics, or related field\n\nPreferred:\n\nExperience with Unity game engine Agile development experience\n\nreply",
    "Shipyard (https://www.shipyardapp.com) | Growth Marketer | Full Time | REMOTE (USA) or ONSITE (Austin, TX)\n\nShipyard empowers Data Teams to quickly launch, monitor, and share data pipelines without the headaches of managing infrastructure. We're a cloud-native workflow automation platform that's taking the best parts of tools like Airflow, Luigi, and Prefect to create something that's streamlined and easy to use for both technical and business users.\n\nThe Growth Marketer role will focus on spreading the word of Shipyard through content, advertising, PR, and other methods. If you love experimenting, moving quickly, and uncovering the best tactics to scale traffic/interest in a product, we'd love to hear from you. Bonus points if you're passionate about data usage and automation.\n\nThis is the first dedicated marketing role at the company, so you will be given the opportunity to make many of the decisions that directly affect the positioning and trajectory of the product. We're a small, growing team with the financial backing of a larger company, aiming to achieve rapid growth over the next year.\n\nIf you're interested, apply directly through https://apply.workable.com/shipyard/. Feel free to shoot a note to blake@shipyardapp.com as well!\n\nreply",
    "Login.gov | REMOTE or Washington, DC | DevOps/SRE/Software Engineers | Full-Time | https://login.gov\n\nLogin.gov gives the public simple, secure access to multiple US government services through one verified account. We're working to fix online identity for US government services. The Login.gov team operates like a startup within the government, working in the open as a distributed, agile team. The core product is open source, hosted in modern cloud infrastructure, and built for scale. Tens of millions of people have Login.gov accounts, and we aim to be the preferred entrypoint for all government digital services. Our users include people accessing benefits, applying for government jobs, serving in the military, and collecting funds awarded through grant programs.\n\nFind us on Github: https://github.com/18F/identity-idp\n\nThe Login.gov project began as a collaboration between 18F and the U.S. Digital Service (USDS). Today it's part of the Technology Transformation Services (TTS). You'll join other software engineers delivering better public services through modern technology.\n\n* (opening soon!) Site Reliability Engineer: https://join.tts.gsa.gov/join/devops-engineer/\n\nThe above postings open on a revolving basis. If they're not open, just email us at jobs@login.gov or joinTTS@gsa.gov, where we can answer questions and accept your application.\n\nFeel free to reply on thread with any questions.\n\nreply",
    "Hackworth | ONSITE (but WFH for now) | FULLTIME | London | https://www.hackworthltd.uk/\n\nHackworth Ltd is a well-financed, bootstrapped, private limited company based in London. Our purpose is to make programming relevant to children of all backgrounds. We're currently in the prototyping and research phase for our first product: a novel, interactive learning environment for programming, rooted in functional programming principles, with a particular focus on structure editing and the visualization of program execution.\n\nWe're currently hiring for 2 full time roles. These roles are on-site in London, though we're indefinitely in work-from-home mode due to the COVID-19 pandemic. You must be eligible to work in the UK, as unfortunately, we can't sponsor visas to work in the UK at this time.\n\n* UX designer: https://www.hackworthltd.uk/jobs/20200901/\n\n* Front-end web developer: https://www.hackworthltd.uk/jobs/20201001/\n\nWe hope to hear from you! If you have any questions, email careers@hackworthltd.com and it'll come directly to me.\n\nreply",
    "Treasury Prime (YC W18) | San Francisco, CA | Onsite / Remote | https://treasuryprime.com\n\nTreasury Prime is transforming banking for the 21st Century. We partner with banks to build the technology to enable this new wave of fintech startups. Through simple, unified APIs, we are modernizing the economy.\n\nTo learn more about who we are, our culture, and whether this is the right place for you, read our careers page https://treasuryprime.com/careers/\n\nWe are growing rapidly and have many open roles, including:\n\n- Developer Relations Lead: https://treasuryprime.com/jobs/developer_relations_lead/\n\n- Technical Program Manager: https://treasuryprime.com/jobs/program_manager/\n\n- Senior Software Engineer: https://treasuryprime.com/jobs/senior_software_engineer/\n\n- Clojure Software Engineer: https://treasuryprime.com/jobs/clojure_software_engineer/\n\nreply",
    "Phocas Software | Software Development Engineer Who Tests | Christchurch NZ/Remote | FULL-TIME\n\nOur mission is simple – Phocas helps people feel good about data. We help companies turn their data into results. Our award-winning software provides customers insights that help them make more informed, data driven decisions, improving efficiencies and boosting their bottom line.\n\nPhocas ranks #1 in G2 Crowd, has a 4.9/5 rating on Glassdoor, and appears in Deloitte's Fast 50.\n\nThis is NOT a testing role: We are looking for a software engineer that is tired of launching buggy products, where every step forward is dogged by errors and backlog tickets. The ideal person for this role will be one who daily feels “there must be a better way, I’d build it if I had time and resources”.\n\nIn this role, you’ll have that time and those resources. In fact, we’ll pay you well to do it.\n\nApply here: https://apply.workable.com/phocassoftware/j/3EFB612001/\n\nreply",
    "Ashwink | Robotics engineer with strong coding background | India, preferably Jaipur/Delhi |\n\nWe are building automated hematology analysers for point of care diagnosis - think Theranos, but much smaller and legit. We are going to transform the lives of a billion Indians who don't have access to diagnostic services. We use neural networks and computational imaging to generate blood reports and have completed the first prototype. We need people who have worked in image analysis.\n\nI'm a solo founder from IIT Delhi, with an amazing team of IIT Delhi alumni. We also have a distribution network in place, just waiting for the product to materialise.\n\nPlease do mail at hardik@ashwink.co.in if interested!\n\nreply",
    "Seeq | Senior Software Development Engineer - Performance / Backend | REMOTE | FULL-TIME\n\nSeeq is a remote-first startup that makes data analytics software. We also wrote our own virtual office software (https://qube.work) and we have really good GlassDoor reviews: https://www.glassdoor.com/Reviews/Seeq-Reviews-E898633.htm\n\nWe're looking for a backend engineer to help us scale our Java/Kotlin-based calculation engine for processing time series along with our ultra-high-performance data caching layer.\n\nApply here:\n\nPerformance-focused: https://seeq.recruiterbox.com/jobs/fk01bfg?source=HackerNews\n\nGeneral backend: https://seeq.recruiterbox.com/jobs/fk03iwi?source=HackerNews\n\nreply",
    "LightFi | Senior React front-end developer | London, UK | Remote OK (UK only) | www.lightfi.io/jobs\n\nWe are a small London based start-up producing novel IoT sensors for building automation, with a particular focus on reducing energy consumption and environmental impact. Our occupancy sensors can be found controlling buildings used by Heathrow Airport and British Gas.\n\nWe are developing our nascent web front-end to display new sensor data and analysis that will help clients understand, redesign and reopen their buildings with confidence in light of COVID-19 and beyond. We are seeking someone with a strong knowledge of React.js interested in joining our team to take a lead role in front-end development.\n\nAs an integral member of a very small tech team, if interested, you would have the opportunity to gain experience and contribute meaningfully anywhere across our entire stack (sensor hardware/firmware design, embedded linux, python, AWS, data science, fastAPI, React...) and play a key role in the development of new products and technologies.\n\nhttps://www.lightfi.io/jobs or contact me (CTO) directly - matt at lightfi.io\n\nreply",
    "Cookpad | Machine Learning Engineer | Bristol, UK | REMOTE currently, relocation assistance available, ONSITE option (post Covid-19) | Full time | Visa sponsorship\n\nCookpad is the world's largest recipe sharing service, with over 100M monthly users globally. This is an opportunity to join the Global division of Cookpad, which is headquartered in Bristol (United Kingdom), and is responsible for 30+ languages, 70+ countries, and over 2M daily search requests.\n\nWe are looking for an experienced Machine Learning Engineer to join our ML Research team to help take more of our research into production. The role will involve working in collaboration with our ML Infrastructure team to support the deployment of ML based features at scale. We are particularly interested in engineers who have strong hands on deployment experience and broad knowledge across the production ML stack. The team is working from home currently. Remote welcome, timezone-dependent. Relocation welcome. Relocation assistance available.\n\nLearn more about the role and apply: https://apply.workable.com/cookpad/j/379B445315/\n\nLearn more about Cookpad's mission to make everyday cooking fun: https://www.cookpadteam.com/\n\nreply",
    "Gojek | Backend Engineer | Bangalore, India (ONSITE generally. REMOTE during covid) | Full Time\n\nGojek is a Super App. It’s one app for ordering food, commuting, digital payments, shopping, hyper-local delivery, getting a massage and two dozen services. It is Indonesia’s first and fastest growing unicorn building an on-demand empire. It is quite simply the Operating System of Indonesia. For more details about Gojek Tech please visit https://www.gojek.io/\n\nWe are growing rapidly and are looking for Product Engineers with strong experience. You will be joining monetization platform, which builds tools for merchant growth (promotions, ads). You would be working with Elixir, Go, Clojure and other languages. The positions are based in Bangalore.\n\nAs a product engineer you work with your team and product owner, and will be responsible for imagining, building, deploying and running one or more of these products. You will own the future of the product, ensure its quality, and get to see the results of your efforts in people's everyday lives - merchants are involved in various offerings such as food delivery, offline payment acceptance, POS, financial services, deals, and promotions.\n\nIf this sounds interesting, please follow the below steps to apply: Take up the coding challenge at https://gist.github.com/ciju/40afaa21a4b9be998955e84570a057c... and share your solution & CV to our Recruiting partner - rashmi.gowda@go-jek.com\n\nIf shortlisted, you will be invited for technical interviews via zoom.\n\nreply",
    "Saiga | Front-End Developer | Senior Product Manager | Product Designer | Berlin, Germany | On-Site | Full time | Visa sponsorship | https://sai.ga\n\nHi, we are Saiga, a new company working on revolutionising the way people deal with the bureaucracy and administrative issues in their lives. Saiga is founded by an ex-DeepMind researcher and will employ the latest in Machine Learning as part of our offering.\n\nWe are currently looking for a very experienced Product Manager to join our team: https://www.notion.so/getsaiga/Senior-Product-Manager-9457e9...\n\nAlso, we are looking for our first Product Designer: https://www.notion.so/getsaiga/Product-Designer-eb9e11099cbf...\n\nAnd finally, we are still hiring for a front-end developer position to complete our initial engineering team: https://www.notion.so/getsaiga/Front-End-Developer-1277c386c...\n\nFeel free to reach out directly to me at karlmoritz@saiga.co !\n\nreply",
    "Caper | YC W16 | https://www.caper.ai/ | Remote | Fulltime Caper builds smart shopping carts - powered by deep learning and computer vision - to enable a seamless grab-and-go retail experience. We differ from other emerging cashierless technologies like Amazon Go because we are the scalable solution. Caper’s autonomous checkout technology is plug and play, meaning it requires no in-store renovation, no operational overhaul, no heavy computations or endless image labeling. Any retailers can buy the carts and their entire store is upgraded with cashierless capabilities. Caper costs less than 1% of Amazon Go's infrastructure. We are already live in-stores and our customers love us! See here: https://www.washingtonpost.com/technology/2019/10/25/tired-l....\n\nSoftware Engineer: https://recruiterflow.com/caper/jobs/10\n\nAndroid Engineer: https://recruiterflow.com/caper/jobs/11\n\nSr. Computer Vision Engineer: https://recruiterflow.com/caper/jobs/4\n\nReach out directly to me if interested at griffin.kelly at caperlab.com\n\nreply",
    "Outschool (YC W16) | Remote | Full-time | Senior software and infrastructure engineers https://jobs.lever.co/outschool/\n\nSince 2015, we’ve been growing a community marketplace for live classes that inspire kids to love learning. Now we’re scaling it quickly to support distance learning for kids affected by school closures. Our business is growing explosively and as of August, 500,000 learners have taken more than 2M class hours. We just announced our $45M Series B funding round, led by Lightspeed Venture Partners. Our sales have grown 2000% in the past year to reach a run-rate of more than $100M. We're also making $1M of live online classes available for free to families in need and adding thousands of new teachers in weeks.\n\nWe need senior software engineers to build up a complex product for a highly engaged audience. We are also looking for infrastructure engineers to help our systems scale effectively. We have a pragmatic culture that promotes focused collaboration and iterative development.\n\nStack: TypeScript, React, Node/Express, Apollo GraphQL, PostgreSQL, AWS CDK, CloudFormation, AWS Batch, AWS Fargate, SQS.\n\nreply",
    "This is a great company!\n\nreply",
    "Citrine Informatics (citrine.io) | Engineering Manager, Infrastructure, Sr. Backend/Frontend roles |Remote within USA| Full Time|\n\nCitrine Informatics is revolutionizing how raw materials and chemicals are produced by empowering companies to develop them faster and more sustainably. Working at Citrine offers the rare opportunity to collaborate with applied scientists at the leading edge of statistical learning theory and application. Here are a few representative peer-reviewed publications describing research done at Citrine in support of the platform’s AI capabilities:\n\nAssessing the Frontier: Active Learning, Model Accuracy, and Multi-objective Materials Discovery and Optimization (2019). at https://arxiv.org/abs/1911.03224 Can machine learning identify the next high-temperature superconductor? Examining extrapolation performance for materials discovery (2018). at https://doi.org/10.1039/C8ME00012C Overcoming data scarcity with transfer learning. (2017). at https://arxiv.org/abs/1711.05099 High-Dimensional Materials and Process Optimization Using Data-Driven Experimental Design with Well-Calibrated Uncertainty Estimates. (2017). at https://doi.org/10.1007/s40192-017-0098-z\n\nLearn more at: https://jobs.lever.co/citrineinformatics\n\nreply",
    "TalkJS (https://talkjs.com) | REMOTE (Europe) or Eindhoven (the Netherlands)\n\nTalkJS lets developers build the perfect custom chat feature, in hours instead of months. We power communication in online marketplaces, community sites, trading platforms and so on. We're product driven and we care tremendously about quality: We're out to build the tool that every developer worldwide will use to build chat/communication features.\n\nCurrently in the market for:\n\n    * Senior Backend Developer (Elixir)\n    * Senior Fullstack Developer\n    * iOS Developer\n    * Android Developer\n\nOur stack is mainly React, TypeScript, Elixir and PostgreSQL. Nearly the entire company is product people, founders are a designer and a programmer.\n\nTalkJS touches millions of people and we're growing quickly. We're in it for the long run: we combine a hungry ambition for growth with a healthy and flexible work/life balance. We expect a lot from each other and give a lot of support and freedom in return. Sound good?\n\nMore info on all positions, + how to apply: https://talkjs.com/jobs/\n\nNo recruiters / agencies please.\n\nreply",
    "Namebase | Full stack engineer and Backend engineer (Node.js) | REMOTE | https://namebase.io\n\nNamebase is on a mission to enable freedom, security, and ownership on the Internet. We’re doing this by making Handshake — a new decentralized DNS protocol — easy-to-use. You can think of our product as GoDaddy for Handshake.\n\nSince launch six months ago we’ve already processed over $20M in transaction volume and tens of thousands of Handshake name registrations. We work in a highly collaborative environment across a distributed team (currently in US and Australia). Open communication is the standard — strategy discussions occur in slack, not behind closed doors. New initiatives have a single owner to maintain focus while feedback is solicited from everyone.\n\nWe use Node and Go on the backend, React on the frontend. We're a small team of 7 with ample funding — we've raised from Coinbase Ventures, Thrive Capital, Paradigm Capital, Balaji Srinivasan, and count Josh Elman (board member at Discord) amongst our advisors.\n\nWe're on an ambitious mission to fight the trend of the traditional internet becoming balkanized. If this resonates with you send me an email at tieshun at namebase.io.\n\nreply",
    "Chillhop Music | Remote (Netherlands) | Full Time | https://chillhop.com\n\nChillhop music is a music label known for its LoFi Hip Hop YouTube stream and Spotify playlists. Rather than relying on SaaS, we develop a lot of our software in-house in order to accommodate all the needs of our artists and employees.\n\nWe are looking for a Full Time Dev/Ops Full Stack Web Developer.\n\nYour responsibilities would include maintaining our CMS and extending its functionality, writing extensions, maintaining and extending the front/back-end of our website, and creating any other applications as required.\n\nOur tech stack consists of:\n\n    NGINX\n    PHP/Wordpress\n    JS/TS\n    MySQL \n\nWe are looking for the person that fits the character of Chillhop and has the capabilities to join our existing engineering team on a full time basis and take our products to the next level.\n\nWe are open to considering remote workers outside of Rotterdam, The Netherlands.\n\nApply here: https://chillhop.com/jobs/dev-ops-full-stack-developer/\n\nreply",
    "IOMED | Database Developer| Barcelona, Spain | Full Time | Onsite Are you looking for a job with a direct impact on healthcare?\n\n* Problem: Clinical data is messy and makes research slow. * Mission: To structure clinical data and give unified, standardized access to it. * Product: Natural language processing models and a unified SQL data access interface for researchers. * Traction: Validated idea, Validated business model, growing and scaling stage. * Funding: +3y runout and growing. Backed by national and international VCs. * Stack: Database Administration, SQL dialects, open-source relational databases (PostgreSQL, MariaDB),familiarity with distributed SQL databases,PL/SQL and C, C++ or C#.* Values: Methodic, transparent, hard workers with a HUGE emphasis on work-life balance. Join a multidisciplinary team working hard to make clinical research faster, accessible and ubiquitous. Also it's a nice excuse to enjoy Barcelona's vibe and nice weather!\n\nWant to know more? Ping me at julia@iomed.health Check our site for more info https://iomed.health/careers/database-developer/\n\nreply",
    "I work here. Happy to answer any questions.\n\nreply",
    "Immunant | Senior Staff Engineer | REMOTE | Full-time | https://www.immunant.com\n\nImmunant's mission is to make it easier to deploy Rust code alongside or in place of C/C++ at all levels of the stack. We are looking for a fellow systems programming expert to help us harden components used by hundreds of millions of users each day. If you have demonstrable experience with C/C++/Rust, an eye for detail, and plenty of self-motivation, we'd love to talk.\n\nWe are located in Southern California but also encourage strong candidates who wish to work remotely in the US to apply.\n\nMore details: https://www.immunant.com/jobs Code: https://www.github.com/immunant\n\nSend questions and applications to team@immunant.com – please mention HN in subject line.\n\nWe look forward to hearing from you!\n\nreply",
    "Culture Biosciences | Software Engineer | South San Francisco, CA | ONSITE | Fulltime | https://www.culturebiosciences.com/\n\nWrite software to make cells grow in custom made robots! We're a 25 person startup, we build our own hardware in our own lab and we need a great addition to our software team of 4 to help keep the cells, robots, and customers happy.\n\nThis can involve writing software at all levels of the stack. No specific experience required other than writing good software and being curious.\n\nI joined almost 2 years ago and I can not emphasize enough how much fun it has been. The people are kind and trustful, the environment is one of curiosity and exploration, and I always look forward to going to work.\n\nWe're looking for someone with 6+ years of experience shipping software, preferably some of that at company of our stage. Good interface and architecture design, knowing which corners to cut, and which to spend more time on are important.\n\nIf you're interested in chatting send me an email: satshabad@culturebiosciences.com\n\n(Note, we've gotten many candidates so it may take some time to get back to you)\n\nreply",
    "Petal | New York, NY | Software Engineers, VP of Engineering, Engineering Manager (Data), Product Design Lead | Remote (United States)\n\nPetal is a credit card for people with limited credit histories. We use machine learning to analyze cash flow, augmenting traditional credit score-based lending decisions. Our mission is to increase access and fairness in the credit market. We've raised our Series C and are growing dramatically.\n\nSome recent coverage we've received: https://techcrunch.com/2020/09/24/valar-petal-series-c/\n\nTech stack: https://stackshare.io/petal\n\nPlease apply here: https://jobs.lever.co/petalcard/?lever-origin=applied&lever-...\n\nreply",
    "Highstreet Mobile | Backend Engineer | Utrecht (near Amsterdam), The Netherlands | Onsite/Remote (EU) | Full Time\n\nHighstreet Mobile's mission is to connect people to the brands they love. We are a team of makers and we've built a SaaS product for fashion brands. We enable brands to give an amazing shopping experience to their customers. Our customers get a native mobile shopping app for Android and iOS and that app constantly gets better.\n\nYou would be designing and developing API's in our middleware, the beating heart of our product. It connects to different e-commerce and payment providers like Magento, Commerce Cloud, Adyen and many more. You will focus on scale and performance, will deploy to production every week and will work closely with our mobile engineers.\n\nStack: Ruby / Sinatra / Rails / Minitest / Redis / OpenAPI Spec / PostgreSQL / Go / Docker / k8s / GCP / Gitlab CI\n\nhttps://jobs.highstreetmobile.com/backend-engineer/en\n\nApply via the link above or contact me at vincent@highstreetmobile.com if you’d like to know more.\n\nreply",
    "Doctype | Software engineer | Stockholm, Sweden | ONSITE, VISA or REMOTE (worldwide) | Full-time | https://www.doctype.se/ We're a small digital agency based in Stockholm, Sweden. Currently around 15 people. We have an office in the heart of Stockholm, but our employees are free to work from wherever they feel most productive. We've built https://lemondogs.com/, https://www.gothiaecup.com/, https://beta.esportal.se/, amongst other websites. Our largest clients are within the eSports segment.\n\nWe’re currently looking for a software engineer with reverse engineering skills to work with us on client-sided anti-cheat technology. The project you would be working on is a standalone client built in C/C++, Go and x86 Assembly. Our current tech stack is mainly Go, MariaDB and React,\n\nRequirements:\n\n* Good understanding of C and x86-64 assembly\n\n* Good understanding of the Windows NT kernel\n\n* Good grasp of reverse engineering\n\n* Eager to learn\n\nNice to have:\n\n* Experience with reverse engineering malware/cheats/games, the windows NT kernel\n\n* Experience with binary instrumentation\n\n* Experience with hardware-assisted virtualization (such as VT-x and AMD-V), SLAT (Second Level Address Translation) (e.g. EPT, NPT)\n\n* Understanding cryptography primitives\n\nYou’ll be working together with another anti-cheat engineer to combat cheaters in video games. Mail me at: asamy@doctype.se\n\nreply",
    "Asana | San Francisco, New York City, Vancouver [BC] | Onsite | https://asana.com/jobs/engineering#jobs\n\nWe're building the future of teamwork. Over 82K paying organizations around the world rely on Asana to coordinate and manage their work, from daily tasks to strategic initiatives. We believe in using the best tools for the job, and being mindful about how we solve problems so that we’re always thinking about the future, while still doing great things, fast.\n\nWe're hiring for:\n\nSoftware Engineer - Product Lead - in San Francisco: https://asana.com/jobs/apply/2258436/software-engineer--tech... - in New York City: https://asana.com/jobs/apply/2251775/software-engineer--tech...\n\nProduct Engineers - in New York City: https://asana.com/jobs/apply/1163890/software-engineerproduc... - in Vancouver: https://asana.com/jobs/apply/1284781/software-engineerproduc...\n\n* Infrastructure Engineer - in San Francisco: https://asana.com/jobs/apply/721271/software-engineerinfrast...\n\nreply",
    "Ardan Labs | Mid-Level/Senior Go Engineers with Kubernetes experience | REMOTE must be in North America | https://www.ardanlabs.com/\n\nArdan Labs is a software consulting and training firm specializing in Golang, Docker, & Kubernetes. We are a group of passionate engineers and business professionals focused on solving our client’s problems based on core engineering values and community involvement.\n\nWhat our clients are looking for:\n\n  - A working knowledge of Go, standard library, idioms and common guidelines.\n  - Ability to collaborate with team members, flushing out designs to finalizing solutions.\n  - Understanding business requirements and translating that into engineering decisions.\n  - Capable of determining and communicating engineering trade-offs.\n  - Capable of writing documentation and tests.\n\nBenefits:\n\n- As a W2 employee, we offer family medical coverage, life insurance, paid vacation, and technical training.\n\nApply here: https://www.ardanlabs.com/my/careers\n\nreply",
    "Magic Carpet AI | Systems Engineer | London UK, REMOTE during COVID | https://www.magic-carpet.ch/\n\nWe are developing the next-generation of asset management solutions leveraging deep reinforcement learning. We recently launched a cryptocurrencies product and we are now expanding to more traditional asset classes.\n\nWe are a team of 7 researchers and engineers.\n\nWe are looking for an engineer that is comfortable writing fast and robust APIs, clean data pipeline and who has experience in handling cloud infrastructure.\n\nFor more information, please check our job ad: https://apply.workable.com/magic-carpet-ai/j/7AFA85C593/\n\nreply",
    "Remote (Europe) | Full- time & Permanent role\n\nSenior Backend & Data Scientist roles @komoot\n\nRoles: - Senior Backend Developer (Kotlin/Java/Scala) - Senior Backend Developer / Data Scientist (Kotlin/Java/Scala & Python) - Senior Data Scientist (Jupyter, pandas, NumPy etc.)\n\n@komoot - We are building the best outdoor navigation planner and the biggest outdoor community and simply inspire people to explore more of the outdoors.\n\n15million users | 100k 5* reviews\n\nWe are now searching for senior backend engineer and data scientist who would like to take their skills to the next level, love to find simple and smart solutions to complex problems and focuses on delivering impact.\n\nFind out more info here:\n\nSenior Backend Developer https://www.komoot.com/jobs/senior-backend-developer\n\nSenior Backend Developer/ Data Scientist https://www.komoot.com/jobs/senior-backend-developer-data-sc...\n\nSenior Data Scientist https://www.komoot.com/jobs/senior-data-scientist\n\nreply",
    "Chronosphere | Engineering Manager (NYC/Seattle), Platform Engineer, Customer Solutions Engineer | Onsite NYC/Seattle, Onsite Vilnius, Lithuania or Remote | Full-Time | https://chronosphere.io/\n\nChronosphere is a fast growing, early stage startup building an innovative observability platform for cloud native applications. Chronosphere enables customers to develop and operate reliable cloud native applications: with the ability to quickly identify problems and their causes; simply, affordably and at scale. The platform is delivered as a SaaS service that is easy to adopt and scale with customer needs.\n\nWe're hiring a leader - our first Engineering Manager (NYC/Seattle).\n\nWe're hiring software engineers; Platform Engineers & Customer Solutions Engineers.\n\nYou'll be working with Matt Mihic, our Global Head of Engineering, who previously led engineering at Okta, Square, and Uber during their early and hyper growth phases. Read more about our team and career opportunities here: https://chronosphere.io/\n\nreply",
    "Partoo | Lead Developers / Fullstack devs / QA | Paris, France | Full-time | Onsite | https://www.partoo.co/en/\n\nWe keep synchronized and up to date your business information on all major online platforms as Google + Google Maps, Facebook, Apple Maps, Foursquare, etc.. For example, those past weeks we helped tens of thousands of business updating their opening times regarding coronavirus. Like this, we avoided people doing unnecessary trips to a closed business.\n\nWe're looking for :\n\n- Lead developers, to manage a feature team of 3 devs and a PM. Experience in python & webapps required.\n\n- Full stack developers that have a product mindset, all levels welcome :)\n\n- QA, to help us setup a quality process for our app.\n\nOur stack is mostly in Python & React, and we're in AWS. We're growing rapidly while being profitable, and there are plenty of opportunities to leave a mark in the company.\n\nNeed to be able to work in France.\n\nTo know more about us : https://www.welcometothejungle.com/fr/companies/partoo (in French)\n\nIf you're interested, send an email to julie@partoo.fr :)\n\nreply",
    "GRAILED | https://www.grailed.com | SOHO, NYC | Full-time | Onsite | Grailed is a community-driven marketplace for fashion, style, and streetwear. We are 70 people, our engineering team is 26, and we run a rails backend with react front-end.\n\nWe've got a lot of exciting work to be done in the space of recommendations, discovery, and fraud! We place a lot of emphasis on quality of life - this is a truly great place to work :)\n\nOpen roles:\n\n- Sr. Software Engineer (https://boards.greenhouse.io/grailed/jobs/4885598002)\n\n- Sr. iOS Engineer (https://boards.greenhouse.io/grailed/jobs/4890394002)\n\n- Engineering Manager (https://boards.greenhouse.io/grailed/jobs/4883501002)\n\nemail: alec.mckinley@grailed.com\n\nreply",
    "Talend is a leader in cloud data integration and data integrity, with French roots and a US-based HQ. Stack: K8s / Kubernetes, Terraform, Cloud (AWS, Azure, GCP), Microservices, API, Scala, Java, Python and others :)\n\nWe are currently looking for:\n\nApplication Security Engineer | Nantes or Paris, France | Full-Time | Onsite - buzzwords: OWASP, SDLC, CI/CD, Cloud (AWS, Azure), Python, Burpsuite, Acunetix https://bit.ly/3gFiGRl\n\nBackend Developer / Software Engineer | Bonn, Germany | Full-Time | Onsite - buzzwords: Java, Scala, K8s, Docker, Cloud (AWS, Azure, GCP) https://bit.ly/2GiFk5L\n\nTechnical Writer API | Nantes or Paris, France | Full-Time | Onsite - buzzwords: API, SDK, XML, DITA https://bit.ly/33udc8b\n\nFor all positions and further details contact me or have a look here: https://www.talend.com/about-us/careers/\n\nWith the current Covid-19 situation, we interview 100% remotely.\n\nreply",
    "Railway | https://railway.app/ | Engineers (Infra/Full-Stack) | SF & Remote\n\nRailway is collaborative software infrastructure with superpowers. It's as simple as CMD + K -> Postgres to provision whatever containers you need. We also offer cloud environments for all team members, a CLI to route all the container-relevant environment variables to your programs, and plugins like (e.g a logger) with Egress' to your favorite services (e.g DataDog).\n\nOur goal is to offer the fastest experience from zero to production application. We're at about 15 minutes for developers, and we want to get that down to 5 minutes, for anybody.\n\nOur Core Tech: Frontend: TypeScript, React, GraphQL Backend: TypeScript, Node, Golang, Prisma Databases: Postgres Infrastructure: Ansible, Terraform, Docker, CloudFlare Workers\n\nAbout Us: Really small team (3 ATM), all engineers. Backed by some of the biggest names in devtools. Well capitalized and lots of equity in the table if you want to tune the slider either way (Cash or Equity)\n\nIf you're interested, play with the product and shoot me an email jake at railway dot app.\n\nProduct: https://railway.app/invite/y2-r-nkin3F69OMlwpcvR\n\nInfra Eng: https://www.notion.so/railwayapp/Infrastructure-Engineer-3ba...\n\nFull Stack: https://www.notion.so/railwayapp/Full-Stack-Engineer-0c78646...\n\nreply",
    "Core Fitness | https://core.fitness/ | New York, Montreal | Full time | Onsite\n\nCore is an early-stage startup helping fitness instructors thrive in a post-covid digital world. We're building an instructor-first platform that empowers anyone with passion and talent for teaching to easily build a sustainable digital fitness business. We're breaking free from the tired stereotypes and making fitness more accessible, creating a happier, healthier world for every body.\n\nWe're looking for engineers looking to join a very early stage startup to take on broad ownership to architect, build, and collaborate across business/product/design:\n\n- Senior Software Engineer, Backend-Focused (Elixir)\n\n- Senior Software Engineer, Frontend-Focused (Svelte)\n\n- Senior Software Engineer, Mobile (iOS, Swift)\n\nFrontend/designer combos welcome and a big plus.\n\nFullstack a big plus.\n\nPayments experience is a plus (Stripe, in-app payments, platforms/marketplaces).\n\nWe value curiosity, humility, ambition, and empathy.\n\nApply or find out more at: apply@core.fitness\n\nreply",
    "Cookie.AI | Remote | Full time\n\nCookie.AI, Inc. is an early-stage stealth startup headquartered in Silicon Valley, operating with a remote-first mindset - we have teams across US continental states and in Europe. We are building a market category defining data security company for the dynamic world of cybersecurity. We are well-funded (Series-A) and backed by top-tier VCs and CEOs / Security veterans as our angel investors. The founding team consists of serial entrepreneurs and early engineers from startups and veterans from big companies. We are looking for engineers across distributed systems, SaaS, and SRE / CloudOps / DevOps with hands-on experiences with data and cloud-native products. You will play a critical role in building V1/V2 products with early customers, working closely with the founders, and collaborating with senior engineers who have built and shipped $1B+ products. You will gain hands-on experience with cutting-edge technologies (Presto, Kafka, Golang, Docker, K8s, Figma, React.js, etc.) and many others from the open-source world. We are looking for characteristics such as ambition and agility, commitment to build an enduring company, passion to build products, and intellectual curiosity to innovate! Please reach out: hello AT cookie.ai.\n\nreply",
    "Faithlife | Full-Stack, Backend, Team Leads, Project Managers | Bellingham, WA - Chandler, AZ - Puebla, Mexico | Fulltime | Onsite or Remote\n\nThere is a lot that goes into building an Integrated Ministry Platform (https://equip.faithlife.com) and Logos Bible Software (https://logos.com). We are looking for Software Developers who can help us build awesome software. Join us as we make revolutionary technology for administration and discipleship for churches all over the world. The ideal candidate will be able to work on front-end UI, develop the supporting back-end services, and has a passion for building elegant solutions.\n\nTechnologies: C#, .NET, JavaScript, React\n\nWhere we can hire: https://faithlife.com/careers/remote\n\nEngineering Manager (Mexico): https://fl.vu/FdMEngMgr\n\nTeam lead: https://fl.vu/engmgr\n\nSenior Full-Stack (USA): https://fl.vu/srfullstack\n\nSenior Full-Stack (Mexico): https://fl.vu/FdMSrEng\n\nSenior Backend: https://fl.vu/SrBackend\n\nand more … https://faithlife.com/careers\n\nreply",
    "Tulip | https://tulip.co/careers | Boston, MA and Munich, Germany | Full time | Onsite\n\nDo you want to help transform manufacturing? We are building the best team in the industry to bring consumer-grade user experiences to a space dominated by ancient enterprise technology. Our platform enables our customers to create apps without code and to connect their apps to machines, sensors and smart tools. These augmented production lines would otherwise rely on paper to share information.\n\nWe have offices in Somerville, MA and Munich, Germany and have raised $52m from NEA, Vertex, and other leading investors. Our customers include some of the largest manufacturers in the world across numerous verticals of the manufacturing industry.\n\nWe'd love to talk to anyone interested, but in particular we are looking to bring folks on in:\n\n- SRE/DevOps: Kubernetes-admin, scalable monitoring across the firewall, hybrid cloud/on-prem deployment\n\n- SRE/DevOps: Azure cloud architect, ideally with container service/AKS experience\n\n- QA Engineer: build out a robust testing pipeline across all areas of the stack, from Hardware up to UI.\n\n- Web Development: React+Redux frontend, NodeJS+Mongo+Postgres+Redis backend, syncing data with Meteor, delivering useful, real-time experiences in the browser and on Electron\n\n- Data & Pipeline Engineering: planning, implementing, and finding insights with our next generation of process & sensor analytics\n\n- IoT/Embedded Software: delivering a reliable, extensible HW platform across arm and x86, all manner of bus/IO tech\n\nApply at https://tulip.co/careers or email us at jobs@tulip.co\n\nreply",
    "Pipedrive | senior engineers across the stack | Prague, Lisbon, Tallinn | ONSITE, VISA\n\nPipedrive is a SaaS visual sales tool for small to medium businesses. We’ve been backed with $90 million in funding since 2010 and are experiencing rapid growth. Our team is now located in five countries, building the sales tool used by over 90,000 companies.\n\nI am very happy with the maturity of the process here and the autonomy our team is having. We are getting a lot of support from the company while still being able to innovate and fully own our part of the product.\n\nOur stack is mainly TypeScript, Node.js, React, Docker, MySQL, Elastic, ... We expect some experience with that but the main thing is the cultural fit. We are looking for team players.\n\nPlease ping me an email at jakub.kadlubiec@pipedrive.com if you want me to refer you or if you want to learn more about the company. Please include the location where you'd like to work from (onsite only). I am an engineer not a recruiter.\n\nreply",
    "Streamlabs | Multiple Roles| Vancouver/SF/Remote | Visa for CAN Streamlabs is searching for amazing QA, Senior C++ engineer, Front-end engineer, Customer Success\n\nhttps://streamlabs.com/\n\n- What we do today: make tools for live streamers who broadcast on Twitch/YouTube/Mixer (core business today) + expanding to new content verticals (ex. https://oslo.io/)\n\n- Mission: empower creators to do more\n\n- Results: used by 70% of Twitch streamers; paid out $500M to creators since inception. Launched many things - some worked and many didn't, but we learned a lot and we are still building.\n\n- Details on roles, culture, stack and more https://gist.github.com/georgekurdin/042691b608b8e3f8c83ae32...\n\n- Process: take home problem -> chat with hiring manager -> google hangouts with team -> offer (we will move quickly and will do our best to not waste your time). There is a take-home problem for all roles\n\n- Visa: will sponsor for Canada\n\n- Remote: yes\n\n- Contact: careers@streamlabs.com with questions (all welcome) or your application (if interested)\n\nreply",
    "Checkly | Full Stack JS, Lead Open Source | Berlin, REMOTE, EU region | Full time | https://checklyhq.com/jobs\n\nCheckly is the delightful API & E2E monitoring platform for modern developers: programmable, flexible and loving JavaScript. We are a young, well funded and growing developer tooling company run by experienced founders. We build our main SaaS app, a popular open source project called Headless Recorder and the site https://theheadless.dev. You will be working on all of these things.\n\nWe are remote, spread over DK, NL, DE, PL and TR.\n\nWe are hiring for two positions:\n\n- Full Stack JavaScript developer: build, extend and harden our backend and frontend.\n\n- Lead Developer Open Source: lead our open source initiatives with code and communication.\n\nKey tech we use: JavaScript, NodeJS, Vue.js, Heroku, Postgres, AWS.\n\nFor details on the roles and how to apply please visit: https://www.checklyhq.com/jobs\n\nreply",
    "Aiven | Python Backend Engineers, SREs, DevOPs | Berlin, Helsinki, Toronto, Sydney | Full-time, remote/onsite | https://aiven.io/careers/\n\nWe are Aiven — a cloud technology startup launched in 2016. We create managed cloud services from the best open source technologies that take the infrastructure worries away from our customers. Our products are used daily by hundreds of customers across the globe to power their next-gen event streaming and analytics applications with more joining every single day. Backed by Europe's leading investors, we’re now looking for top talent to join us in our headquarters in Helsinki and our new offices in Boston, Berlin, Toronto and Sydney.\n\nAiven develops DBaaS. We are a company, founded by developers, who started coding at a very early age. We want to keep this focus that programming remains an essential core of our company´s culture. We are looking for motivated team members, who will share our vision and passion for software development and will work together with our Team on the development of the Aiven cloud platform.\n\nWe are looking for Python Backend Engineers, SREs, SWE in Support in Berlin, Helsinki, Toronto, Sydney.\n\nRemote options are also available.\n\nIf you’re interested, send us your application along with a link to your GitHub profile.\n\nhttps://aiven.io/careers/\n\nreply",
    "Dell Technologies | Fulltime | Remote (US-based) | https://www.dell.com/\n\nWe’re looking for 4 senior analytics professionals to join our Massachusetts-based Data Science team. The desired candidates will work to enable Dell's Global Business Operations & Sales organizations with data-driven insights that support our game-changing quota planning and business transformation efforts. The roles will be remote - so location in the US is negotiable.\n\n- Machine Learning Lead Engineer: https://lnkd.in/eY3ny-4\n\n- Principal Data Scientist: https://lnkd.in/ecDXgGW\n\n- Senior Data Engineer: https://lnkd.in/ex2UE9V\n\n- Data Science Business Engagement Lead: https://lnkd.in/eJ6Q3nZ\n\nreply",
    "Deedmob | Amsterdam, NL | Remote | Full Time | Lead full stack JS engineer (Typescript, Node, React) We're a small profitable impact startup looking for an engineer who wants responsibility, meaningful work and non crazy work hours.\n\nSee the in-depth description below in which I outline what kind of work you'd probably work on, our story and also reasons you shouldn't join us.\n\nhttps://angel.co/company/deedmob/jobs/900080-remote-lead-eng...\n\nApply above or by emailing me at david@deedmob.com Thanks, David :)\n\nreply",
    "Relay Financial | Toronto, Canada | Frontend/Backend/DevSecOps/QA Engineers | FULL-TIME | REMOTE or ONSITE\n\nRelay Financial is on a mission to increase the success rate of small business. We believe that banking is a growth limiter rather than a growth enabler for business owners, and we’re changing that. We’re building banking designed for growing businesses. With Relay, business owners can open an account in minutes, issue corporate cards in seconds and automate financial management.\n\nWe’re growing quickly and we're looking for engineers who are excited to work on challenging problems and be part of the next wave in banking.\n\nWe're hiring for the following positions - Senior Frontend Developer - Senior Backend Developer - DevSecOps Engineer - Quality Assurance Lead\n\nVisit our career page @ https://relayfi.com/careers for full job descriptions, or reach out to careers@relayfi.com for more details.\n\nreply",
    "Coder|Remote|Full-Time|(www.coder.com)\n\nCoder builds developer tools that power engineers at some of the world’s greatest companies. Coder’s mission is to accelerate the workflow of software engineers by harnessing the power of the cloud.\n\n-Technologies we use: Typescript, Node.js, React, Go, Docker/k8s, PostgreSQL\n\nOpen positions:\n\nTypescript Engineer: https://jobs.lever.co/coder/e40becde-2cbd-4885-9029-e5c7b0a7... Experience with VSCode contributions or VSCode extensions is a HUGE plus!\n\nSolutions Architect: https://jobs.lever.co/coder/eb1d8396-6936-45d4-869c-7f8899c9... Hands on k8s and Docker experience is a requirement.\n\nWe are also hiring for various other roles- check out our careers page for more info.\n\nContact Camilla directly (Head of Recruiting)at clever@coder.com\n\nreply",
    "Your two links are giving 404s.\n\nreply",
    "same here.\n\nreply",
    "What we do: Application complexity is shooting through the roof, and a large part of the reason is obsolescence of underlying data platforms that were built for centralized and simpler workloads. We are building the next generation data fabric for cloud native applications - where data mobility and portability is a central theme. This vision is matched by the passion of the founding team (with experience at Google, Facebook, and other internet scale companies), and we are recruiting our first engineers that will help establish the direction for the platform and establish the culture for the company.\n\nWhat you'll do as a Founding Engineer:\n\nAs a Founding Engineer, you will design, implement, and deploy highly distributed, large-scale services. You will translate complex functional and technical requirements into detailed architecture and design. You will be very hands on, and work with others on the engineering team to manage day-to-day development activities, and participate in designs, design reviews, code reviews, and implementation. Our ideal candidate will be passionate about delivering high quality solutions to complex engineering problems, while working within a team.\n\nRequired Qualifications:\n\n--BS or MS in Computer Science or a similar field (PhD a -plus)\n\n--Track record of successfully shipping systems or infrastructure software\n\n--Experience with lower level systems programming in C or C++\n\nBonus Qualifications:\n\n--Previous experience building distributed databases or storage software\n\n--Experience with cloud-based technologies\n\nWe are also looking for a PM with 5+ years of experience. If you have experience working in a relevant field and are open to new opportunity, please contact me.\n\nIf you're interested in our tech or joining our team, please send your resume to jnguyen@grainite.com (:\n\nreply",
    "Please state the job location and include the keywords REMOTE, INTERNS and/or VISA when the corresponding sort of candidate is welcome. When remote work is not an option, include ONSITE\n\nreply",
    "Kira Systems | Software Development Manager| Canada, Toronto | Remote | https://www.kirasystems.com We’ve built a machine learning software that enlightens the world’s enterprises by enabling them to truly know what’s in their contracts and documents. We’re bold in our decision making, clear on our mission and – most importantly – passionate about pairing the power of human know-how with a powerful product. We are hiring a Software Development Manager to lead a group of high performing developers responsible for one of the most important features - enhancing connectivity of our application with other platforms. The pod is one of our 6 multifunctional teams building and improving our core SaaS application in close cooperation with Product, Design and Quality Engineering. Since our establishment we have gone far and have built a powerful tool relied upon by thousands of users every day. We are now ready to scale, innovate and take the application to the next level. In this role you will leverage your extensive technical expertise as well as leadership skills to lead, motivate and strengthen our team.Apart from strong leadership, you will be responsible for high level architecture and design, code reviews as well as technical mentoring of your team. We follow agile methodology in our delivery, however, as the Software Development Manager you will be responsible for the tasks delegation, orchestration, dependencies and overall product delivery of the pod. At this stage of Kira’s growth, this position will have a huge influence on our direction and success.This role is suitable for a Software Development Manager with Front-End and/or Back-End Development expertise. For more information, visit our careers page https://kirasystems.com/careers/#anchor_careers?gh_jid=47738... or email us at sarka.urbankova@kirasystems.com.\n\nreply",
    "Suade|London|Full-time|Onsite\n\nWe are a FinTech/RegTech company based in London using modern technologies to develop cutting edge software for regulatory reporting and compliance. We’ve had some notable achievements this year including being selected as part of the FinTech 50 for the third year in a row as well as being recognised by the World Economic Forum as a Technology Pioneer which is a huge honour. other notable examples of past Pioneers including Google (2001), Twitter (2009), Palantir Technologies (2010) and Dropbox (2011). We are always looking to hire talented individuals and we currently have the following vacancies: Backend Developer Front-End Picasso Regtech Engineer Linux Orchestrator Please find the links to our job descriptions https://suade.org/journal/#lead To apply, please send your CV to Work@suade.org\n\nreply",
    "Histre | Full-Stack Developer | REMOTE | https://histre.com/\n\nHistre is \"Effortless Knowledge Base\". The core idea is that the signals that users generate as they go about their day on the web can be put to good use for them. Right now it visualizes their research path, save notes and highlights, collaborate with teams, and such things related to creating and maintaining a knowledge base semi-automatically. We have ambitious plans for where we want to take the product.\n\nWe're looking for an experienced full-stack developer. We're specifically looking for extensive Django and JavaScript expertise (4+ years), with skills to build robust systems. Experience with browser extension development, PostgreSQL, and Elastic Stack would be a big bonus.\n\nPlease apply here: https://histre.com/jobs/\n\nreply",
    "RepTrak | REMOTE | Eventual Onsite in Boston\n\nJoin our digital transformation on our journey creating a platform in a profitable business -- all while using the latest tools like Kubernetes, Helm, and AWS\n\nThe Reptrak Company is looking for strong full stack Senior Software Engineers to join the team in building the world's leading reputation management platform for corporations worldwide. You will be joining a fast growing team delivering innovative data products that change the way our customers think about relationships with their customers, employees, competitors, regulators and other key stakeholders. Our work changes the way companies do business for the better.\n\nhttps://boards.greenhouse.io/reptrak/jobs/4024405003\n\nreply",
    "Roblox | San Mateo, CA | Full Time | REMOTE through June 2021 -> ONSITE July 2021\n\nRoblox is ushering in the next generation of entertainment, allowing people to imagine, create, and play together in immersive, user-generated worlds. We are recruiting across multiple teams and positions. We are actively hiring and all interviews are currently done via phone & Zoom.\n\nOur top priority roles are:\n\n- Technical Artist: 5+ years experience; Proficient in C++, Lua, Python and/or JavaScript\n\n- Backend Web Engineer: 5+ years experience; Fluent in C#, C++, Java, or another OOP language\n\n- C++ / Lua Engineer: 3-5 years experience; Proficient in C++; Experience with Lua preferred\n\n- C++ / UI Engineer: 3-5+ years experience; Proficient in C++; Experience with building very complex end user applications\n\n- C++ 3D Modeling Engineer: 3-5+ years experience; Proficient in C++ (and/or Python); focus on 3D APIs\n\n- Software Engineer, Distributed Caching/Infrastructure: 3+ years experience building software to manage infrastructure\n\n- Data Engineer: 3+ years experience; Expert with Java and Go; Custom ETL design, implementation and maintenance\n\n- Tech Lead/ Engineering Manager: 3-5+ years leading projects and/or teams; Proficient in C++ (and/or Python); focus on growing and mentoring teams\n\n- UI Engineer: 2-4+ years experience; Strong Python; Build tools to accelerate the development process for millions of engineers\n\nPlease reach out to \"efife at roblox.com\" and mention this Hacker News post.\n\nOr, to find more information, see our full list of open positions, and apply, please visit:\n\nhttps://corp.roblox.com/careers/\n\nreply",
    "Delibr | Full-stack developer, Product Manager | Stockholm, Sweden | Full-time | ONSITE| jobs.delibr.com\n\nDelibr is a Stockholm-based startup that helps product managers and their teams become better at collaborating in their feature refinement process.\n\nOur product is \"like Google Docs for product managers\", and our customers love how it is adapted for them, with integrations with Jira and Slack, and with features that give them better support for input gathering and decision making related to product development.\n\nWe are continually extending our now 7-person team, with a view to doing a VC round early next year, followed by rapid global expansion.\n\nWe are currently looking for: - Full-stack developer - Product Manager\n\nIf you are interested, go to https://jobs.delibr.com and apply ASAP!\n\nreply",
    "Alasco | Munich, Germany | Senior (Python) Engineer | Lead Engineer Backend Python | Frontend Developer | Senior Product Owner | On-Site | https://www.alasco.de/en/ We are a Munich-based StartUp that helps construction companies complete projects on time and budget. We digitize the processes in construction planning and execution by offering a cloud based workflow platform. Starting from Germany, we want to take on the world. We're looking for Senior Python Engineers, a Tech Lead, Frontend Engineers and Product Owner. More at https://alasco.de/en Our stack: django/python + react/bootstrap on AWS. Our company language is English.\n\nWe're 55 people right now, wanna be the 56th? Reach out to schuon@cs.stanford.edu (Founder) or jobs@alasco.de!\n\nreply",
    "Rubrik| Senior Software Engineer | Full-time | https://www.rubrik.com/en/company/careers/departments/job.22...\n\nWe are looking for software engineers to build a highly-scalable Polaris Cloud Data Management Platform that enables product team engineers to ship/operate features with high quality and velocity. Projects include scaling distributed database by sharding MySQL instances, distributed workflow engine built on top of kubernetes, and scalability and stabilization of tier-0 services.\n\nJoin us to work on GCP/AWS, Kubernetes, Golang, gRPC/GraphQL and more.\n\nreply",
    "Alzion Labs (https://www.alzionlabs.com/) | Frontend Engineer, Backend Engineer | India, REMOTE\n\nAt Alzion Labs, we specialise in technical consulting, designing and developing engineering solutions from scratch. Our client base includes early stage, as well as established startups from global markets.\n\nCurrently, we are in the process of building our team and are looking at hiring for full-time employment, as well as independent contractors. As a part of Alzion, you would be working with a team of talented engineers and collaborating with some of the best startups.\n\nWe are looking for:\n\nFrontend Engineers (React + Redux): https://alzionlabs.freshteam.com/jobs/vOcA9WZrmET7/react-dev...\n\nBackend Engineers (NodeJs, Postgres): https://alzionlabs.freshteam.com/jobs/VTLtlrZvuJjR/nodejs-de...\n\nFor more info, please email neha@alzionlabs.com\n\nreply",
    "Onsite (Germany) | Full- time & Permanent role Embedded Systems / IoT @mc-technologies\n\nRoles: - Embedded Systems Developer (C/C++/RUST) - Microcontroller Developer (C/C++) - UI (HTML/Javascript) - Devops\n\n@mc-technologies - We are builing the next generation of cloud integrated industrial IoT Solutions Location: Hannover, Germany Language: German (optional but basic skills recommended), English (, French, Spanish)\n\nServing the industry for 40year by being agile and adaptive.\n\nWe are exanding our team with\n\n* Embedded Linux development skills with experience in driver and industrial bus technologies. * Javascript/HTML UI development skills - Angular/React or similar. * Devops (docker/python/azure/aws)\n\nFind out more info here:\n\n* karriere@mc-technologies.net * https://www.mc-technologies.net/de/MC-Technologies/Karriere/...\n\nreply",
    "360Player | Senior Full Stack | Stockholm, Sweden | Full-time | Onsite, remote during Covid\n\nWe build a digital platform for development of sporting organizations, teams and players, letting users handle communication, exercise planning, video analysis, content creation and more in one platform. We want to create powerful tools that are easy to use for everyone from grassroot teams to elite clubs, aiming to involve players more in their development. 360Player is a tool for everyone in the organization, not just the coaches.\n\nWe're primarily looking for someone that can work across our entire stack. Pure backend is also of interest.\n\nSome tech: Go, TypeScript, MS SQL, Redis, Docker, Cordova, React\n\nRead more & Apply: https://www.linkedin.com/jobs/cap/view/2166913299\n\nreply",
    "Mattermost | Open source messaging platform (REMOTE)| Mattermost’s mission is to make the world safer and more productive by developing and delivering secure, open source collaboration software that is trusted, flexible and offers fast time-to-value. Mattermost’s first product is a collaboration platform built to accelerate DevOps workflows in high-trust environments by offering secure messaging across web, desktop and native mobile devices. www.mattermost.com We are currently hiring for:\n\n- Sr. Manager of Core Product Engineering\n\n- Lead Site Reliability Engineer\n\n- Lead Engineer - Core Features\n\n- Site Reliability Engineers\n\n- Cloud Security Engineers\n\n- Senior Front End Developers\n\n- Senior React Native Developers\n\n- Full Stack Engineer - Enterprise Features\n\nPlease submit your application here: https://mattermost.com/careers/\n\nor reach out our Manager, Technical Recruiting: teresa@mattermost.com\n\nreply",
    "Onai | | San Jose / New York | FULL TIME, CONTRACTORS, GRADUATE INTERNS, POSTDOCTORAL FELLOWS, REMOTE\n\nWe're tackling exciting difficult challenges and building offerings relevant to interesting real-world problems in a variety of fields. We have particular strengths in dispersed computation, functional programming, cryptography, and deep learning.\n\nWe're currently most interested in engineers with solid experience in Rust, Haskell/Idris, or cryptography. We also have openings for enthusiastic developers or researchers who might lack this precise experience but are eager and able to learn. We welcome internship/fellowship interest from postdoctoral scholars or senior graduate students.\n\nWe do not presently have openings for current/recent undergraduates.\n\nWherever you are in the world, send your resume to info@onai.com and we'll let you know if there's a potential fit.\n\nreply",
    "ML6 | Machine Learning Engineer, Data Engineer | Python, TensorFlow, Google Cloud Platform | Full-time | Amsterdam, Berlin, Ghent (EU)\n\nWe are a Machine Learning consulting company that builds end-to-end Machine Learning solutions. By applying the latest AI research, we keep our clients at the forefront of innovation.\n\nIf you are interested check out: https://ml6.eu/resource/\n\nYou will mostly work with TensorFlow and Python to solve hard Machine Learning tasks and help to put these into production. As Premier Google Cloud Service Partner, ML6 has a very strong relationship with Google, providing you options to collaborate and alpha test a lot of their latest ML tools.\n\nWe are looking for:\n\n• Machine Learning Engineer\n\n• Data Engineer\n\n• Front End Developer\n\n• Customer Engineer\n\n• Customer Experience Manager\n\n• Project Manager\n\n• Business Developer\n\nApply at: https://jobs.ml6.eu\n\nreply",
    "Jupiter | Full-Stack Software Engineer | Full-Time | SF/Remote\n\nAt Jupiter, we’re on an (ambitious) mission to eliminate personal food waste by putting groceries on autopilot. We’re based in San Francisco and backed by Khosla Ventures, NFX, and Y Combinator (S19 batch).\n\nOur goal is to make the experience of buying groceries as seamless as paying for running water. By keeping track of our customers’ consumption habits and product preferences, we aim to play a role in reducing the 8 million tons of food that go to waste every year due to spoilage by building the most personalized, comfortable grocery experience for working families.\n\nJoining as a full-time member of our engineering team, you’ll dive right into our TypeScript/Kotlin stack and have a say in making foundational design, infrasture, and architecture decisions. You should have a strong background in building human-centered products from the ground up. You’ll have the opportunity to marry operations with data to create the most personalized predictive experience for our hundreds of homes in San Francisco.\n\nLearn more here: https://jupiter.co/careers/software-engineer\n\nCheck out our stack here: https://starship.jupiter.co/jupiter-stack/\n\nreply",
    "PayPal | Fulltime | Remote (US-based) | JavaScript -or- Java -or Mobile Engineers!\n\nPayPal's hiring folks across the extended Checkout team, with focus on our Web Application team (JavaScript/React/GraphQL/NodeJS), Java API team (Java/Spring), and Native Checkout teams (Android and/or iOS engineers). We're continuing to see remarkable growth during these times as the e-commerce and fintech sectors a growing substantially. This is a great opportunity to work with a large team, collaborating with other engineers and partners to deliver class leading experiences and capabilities for $100+B in payments volume across 200+ countries.\n\nWe have several openings within my team as well as within other teams--so drop me a line even if my particular opening doesn't sound interesting and I'll help you find the right place! You can contact me at swesthafer at paypal dot com.\n\nJava Backend Engineer: https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Ill...\n\nJavaScript/React/GraphQL Full Stack Engineer: https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Cal...\n\nAndroid Software Engineer: https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Cal...\n\niOS Software Engineer: https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Cal...\n\nreply",
    "Prism | Co-Founders (Python Developers + AWS Developers + ML Developers) | Remote (US)| https://www.getprism.tech\n\nPrism Technology is developing the killer app for brain computer interfaces.\n\nOur application, a video game which helps users reduce stress and achieve peak performance, is built on over 30 years of peer-reviewed research, and combines the best of modern neuroscience hardware with the latest in machine learning technology.\n\nWe have a rock-star team of neuroscientists, game developers, and machine learning engineers which is in the final stages of development of our alpha proof of concept.\n\nWe're looking for a python developer and/or ML developer to help us accelerate our already fast moving development as we shift from proof of concept stage into user testing / fundraising.\n\nAs a bootstrapped team, we have also engaged a best-selling game designer as a team member, gotten several soft commitment purchase agreements from resellers (LOIs within the next month), and received just under 100 signups for our waitlist in a two week trial marketing campaign ($3 CPA).\n\nIf you'd like to hear more about the business concept, current challenges, the product roadmap, or just want to chat about ML/behavioral health/neuroscience, shoot me an email (Ari@getprism.tech).\n\nreply",
    "Software Engineering- Mentor | Bangalore | ONSITE | Full-time employment | 75 paid vacations days | INR100K learning & travel allowance | Competitive compensation | Apply at https://bit.ly/2S9PNVw\n\nIf you've ever thought of sharing your programming skills, we want you. MountBlue Technologies (https://www.mountblue.io) is looking for great software engineers to mentor the next generation of coders. Come, contribute towards making India a nation of coders. You have been saying you want to give back- here is your chance\n\nDesign, plan and implement a 9-12 weeks intensive programming bootcamp in one of the various streams such as Full-Stack Web development, Android, iOS, front-end intensive, backend intensive etc. Be a coach and a cheer leader. Continuously push, nudge and encourage, trainees to produce their best work.\n\nMountBlue vision is to be an alternative to traditional college education. Currently, MountBlue’s business is running coding bootcamps for entry level programmers on most in-demand web and mobile technologies, with a view of finding them rewarding development careers in startups. Our developers are in some of the most well-known startups in India- from bootstrapped software shops to unicorns. If successful, MountBlue will rewrite the technology education paradigm in the country\n\nreply",
    "Seattle Mariners | R&D Analyst | Seattle | Onsite\n\nWe are seeking individuals with a background in statistical analysis and data science for a full-time role on the Research and Development team. This position will work alongside other baseball analysts on a variety of projects, with the ability to impact scouting, player development, and front office decision-making.\n\nProficiency in R or Python required; Proficiency in SQL, git, biomechanical analysis, sports tracking data preferred.\n\nInterested applicants can apply here: https://www.mlb.com/mariners/team/job-opportunities-full-tim... Applicants with questions can email me fdiamond@mariners.com\n\nreply",
    "UP42 | Multiple Roles| Berlin | Onsite | Full time https://up42.com\n\n- What we do: We are creating a developer’s platform for geospatial data and satellite imagery. Think a plug-and-play CI/CD pipeline for geospatial data. We provide the infrastructure and data to users, where they solely have to focus on implementing their models instead of the machinery behind it. The startup is well-funded by Airbus\n\n- Who are we looking for: a whole new product team: Product Manager, Backend, Frontend Engineers\n\n- Remote: no, we work from home now but the role is based in Berlin\n\n- Applications: https://up42gmbh.recruitee.com/#section-123237\n\nreply",
    "Senior Java Backend Engineer & Senior SRE / Devops Engineer | Wizenoze | Full time | Amsterdam | REMOTE GMT+-2 or ONSITE\n\nAre you looking to work on challenging projects, with a diverse and motivated team, while building technology that can change the world? Do you want to join an award winning startup in their scale-up phase? Do you want to give students all over the world access to a prosperous future? Do you want to work with large distributed systems, machine learning, web crawling, and other interesting technology? Then join us in our mission to close the readability gap and make the web readable, relevant, and reliable for students.\n\nWe’re looking for:\n\n- Senior Java Backend Engineer / Architect with 8+ years experience in Java, Spring, REST APIs, Elasticsearch, and other web tech. https://www.wizenoze.com/language/en/senior-java-backend-eng...\n\n- Senior Site Reliability Engineer / Devops Engineer with 8+ years experience in REST APIs, large-scale distributed systems, and the AWS stack. https://www.wizenoze.com/language/en/senior-site-reliability...\n\nBoth positions either remote near the GMT+-2 timezone, or based in our Amsterdam office.\n\nreply",
    "Bedful | Software Engineer | London, UK | REMOTE (UK residents only) | Fulltime | https://bedful.com\n\nWe run one of the most popular camping websites in the UK and help millions of people a year plan and book a great camping and glamping holiday, and the booking system which supports it. We are constantly improving our central booking system - Bedful, along with our sales channels cool camping, glampingly, cool places and others so you’ll be working on exciting new features for partners and guests including integrations with other providers and the internals of the booking system. We're seeing high growth in domestic tourism and are expanding our team.\n\nDue to Coronavirus our office in Shoreditch, London is currently closed, and we're working remotely for the next 6 months at least, but we hope to return to the office next year. We are looking for applicants with UK residency only.\n\nWe deploy new code to production most days and are looking for a software engineer to work at first remotely. Most of our code is written in Go - we’ve been using Go for a few years now and love working with it. Limited experience in Go is not a problem as long as you're keen to learn and self-motivated. Experience with Go in production is a plus.\n\nMore details here: https://bedful.com/careers/software-engineer or send me an email - hello at bedful.com.\n\nreply",
    "Sonder | San Francisco, Vancouver, Montreal, Toronto | Onsite, Remote | Full-time | https://www.sonder.com\n\nSonder is transforming the future of hospitality. We are building the operating system for the future of the hospitality industry. Technology is at the core of powering the platform for the world's first deconstructed hotel and we are the first to do it. We recently raised our Series E at a $1.3B+ valuation. We are growing rapidly and looking for talented engineers to join us on this journey.\n\nWe are hiring Senior and Staff engineers, view all positions at https://grnh.se/cee91ba62us\n\nreply",
    "Vitally.io | Software Engineer | Remote (U.S.) | Full-Time | https://vitally.io\n\nVitally is a powerful and beautiful Customer Success Platform that helps SaaS teams reduce churn. We're a small (8 employees) but fast growing team based in Brooklyn, NY looking to bring on an early engineer to help us continue to scale as we rapidly add more customers.\n\nAs an early team member, you'll have plenty of discretion to make technology and design decisions as we grow, but our current setup is full-stack Typescript: React+Typescript on the frontend and Node+Typescript on the backend, all backed by Postgres and hosted on AWS.\n\nYou can apply by emailing patrick [at] vitally.io\n\nreply",
    "Okay | Android / iOS developer | Skien, Norway | Onsite | Full Time | https://okaythis.com\n\nOkay does Strong Customer Authentication and transaction security for mobile devices. We're looking for people with a strong interest in computer security, who would like to work on securing payments on Android and iOS. Experience programming in Java, Kotlin, Flutter, Swift and Objective C is welcome. You would be expected to work mostly on the front-end, but some back-end knowledge can be useful, as you would eventually be one of the people responsible for managing our SDK releases. Onsite in beautiful Norway is most likely required, as our customers are very security conscious.\n\nYou would be working with a team from all over the world, mostly located in a really nice small town a couple of hours by train south of Oslo, Norway. If you're looking for a change in lifestyle, with decent benefits and salary this might be the job for you. Norway is a place where vacations and reasonable work weeks are not just encouraged, but legally required.\n\nI'm the CTO. More information here: https://okaythis.com/careers\n\nreply",
    "Aclaimant | Remote | Full Stack Developer | Full-time | https://aclaimant.com\n\nAt Aclaimant we are redefining the way companies and employees work together to manage risk.\n\nAclaimant is looking for an experienced Clojure developer to join our team. Our SaaS platform is built using Clojure and ClojureScript. We work remotely from the comfort of our own homes. Pair programming is important to us; it helps us build culture and share knowledge.\n\nWe expect candidates to be located in the US and work core hours.\n\nEmail jobs@aclaimant.com for more information or visit https://www.aclaimant.com/work-with-us\n\nreply",
    "Synopsys | (Senior) Software Engineer, Static Analysis | San Francisco, CA or Ottawa, ON | Full-time | ONSITE (..eventually...)\n\nThe Static Analysis team is looking for an exceptional C/C++ developer to join the Coverity team. The job involves the creation of new code checks, evolving Coverity's state-of-the-art analysis infrastructure, optimizing multi-process and system code, and generally pushing the envelope of static analysis. The perfect candidate will have a strong passion for improving software quality and security-- perhaps some background in programming languages, compilers, or static analysis-- and foremost a strong desire to learn.\n\nThis position is ideal if you: * Enjoy abstract reasoning about software systems. * Want to help find critical security vulnerabilities before they go live. * Have a desire to deconstruct the latest programming languages and frameworks, to help find patterns of vulnerabilities.\n\nYou will work in our China Basin office in San Francisco, with easy access to Muni and Caltrain. This is a chance to dive deep into some challenging engineering problems, with the backing of a solid company and top-notch team of coworkers.\n\nApply at https://sjobs.brassring.com/TGnewUI/Search/Home/Home?partner...\n\nreply",
    "Framer | Senior Backend Engineer | Amsterdam | Onsite/Remote (NL,UK,IE,DE)| Full-time\n\nAbout us: At Framer we build a prototyping tool that allows our users to bring their ideas to life and make their designs interactive, with and without touching code.\n\nRole: Lead projects and implement features from start to finish! You’ll work on many aspects of the tool, incl. Framer Web, Framer Packages, billing systems, email infrastructure, cloud infrastructure, data pipelines. Tech stack: Go, TypeScript, Node.js, AWS\n\nLearn more / apply here: https://www.framer.com/careers/senior-backend-engineer/\n\nreply",
    "Optiwatt | Remote | Frontend/Mobile | https://www.getoptiwatt.com\n\nHere at Optiwatt, we are building the brain between the grid and electric vehicle charging. We offer a free app that automatically schedules electric vehicles to charge during off-peak rates in order to save money and reduce grid load.\n\nWe are a small startup located in San Francisco, California. Our team is made up of software focused environmental enthusiasts who love solving large scale energy problems.\n\nWe are looking for a frontend / mobile developer to help us launch our current web app on mobile.\n\nOur Stack: Python(Django), Postgres, React/Redux\n\nPlease Email: casey@getoptiwatt.com\n\nreply",
    "HotDoc | Engineers, Product, UI/UX, Data Ops | Onsite in Melbourne or Remote (Australia or New Zealand) | https://www.hotdoc.com.au/careers\n\nHotDoc is improving the healthcare experience for everyone in Australia. We're a patient engagement platform used by most the nation's GPs and a quarter of the population. We're growing to tackle other parts of the health system.\n\nWe're an ethics-driven team of around 100 people working mostly out of our office in Melbourne CBD (ex. COVID), though with full-time remote folks everywhere from Perth to New Zealand.\n\nWe value empathetic and pragmatic people, and use mostly Ruby on Rails, Node, and Ember. We have Product Engineering challenges figuring out how to make software that's usable and viable in healthcare, along with data syncing, integration with medical systems, and a consumer-facing hybrid app with a few million monthly users.\n\nreply",
    "FBI | ONSITE | USA | fbijobs.gov\n\nThe FBI consists of more than 35,000 special agents and professional staff who work across the globe to protect the U.S. from terrorism, espionage, cyber attacks, and major criminal threats.\n\nMany FBI career options are traditional to the investigative and intelligence community. Others are similar in nature to careers found in most Fortune 500 companies.\n\n• Senior Advisor Computer Scientist, AI/ML (Quantico, VA) - https://apply.fbijobs.gov/psc/ps/EMPLOYEE/HRMS/c/HRS_HRAM_FL...\n\n• Supervisory Information Technology (Quantico, VA) - https://apply.fbijobs.gov/psc/ps/EMPLOYEE/HRMS/c/HRS_HRAM_FL...\n\n• Supervisory Information Technology Specialist (Washington, DC) - https://apply.fbijobs.gov/psc/ps/EMPLOYEE/HRMS/c/HRS_HRAM_FL...\n\n• Special Agent (Nationwide) - https://apply.fbijobs.gov/psc/ps/EMPLOYEE/HRMS/c/HRS_HRAM_FL...\n\nAdditional positions at https://apply.fbijobs.gov. Please see further details in postings.\n\nreply",
    "Full Stack Engineer | Remote | Full-time | Calipsa - AI Start up\n\nCalipsa is one of the UK's fastest-growing AI companies and is funded by tier 1 VCs. Our mission is to make the world a safer place by detecting and preventing burglaries in commercial properties around the world. Our AI platform analyses CCTV video in real-time and flags anomalies for human review.\n\nInfo - Remote - Job description and link to apply: https://www.calipsa.io/about-us/careers/vacancy/full-stack-e...\n\nreply",
    "Ruby Software Engineer - Perfect Audience (Remote - East Coast) | SharpSpring | Remote, Full-Time: SharpSpring is looking for talented Ruby Software Engineers to join our team for our Perfect Audience platform. This position will give you the chance to work with the latest technologies and come up with creative solutions to problems across a wide range of projects. Ownership of product modules is encouraged, and as a member of our team, your contributions will have a positive impact on thousands of customers spanning the globe. We work in an Agile environment where input from every developer is welcomed and everyone’s voice is heard. SharpSpring compensates based upon merit and skill level with a strong basis on practical skill sets, so existing projects are helpful in establishing experience. Overall, our team is a group of dedicated individuals working to provide the best service possible to our customers using the most innovative solutions. Our engineers tend to be passionate about new technology, have high attention to detail, and generally just enjoy writing code. Questions? --->careers@sharpspring.com\n\nApply here: https://jobs.lever.co/sharpspring/64da94c5-d025-4e17-a2ec-0a...\n\nSoftware Engineer (Remote-EST) | SharpSpring | Remote | Full-Time SharpSpring is seeking talented Software Engineers for our remote team. We're looking for Software Engineers with significant real-world experience working in at least a few areas of our technology stack and a high level of enthusiasm for learning other technology we use. Candidates should be able to demonstrate examples of at least one public-facing or commercial application they have made significant contributions toward developing — ideally an app powered by a modern TypeScript or JavaScript framework with an API backend. We compensate based upon merit and skill level with a strong basis on practical skill sets, so existing projects are helpful in establishing experience. Questions? ---> careers@sharpspring.com\n\nApply here: https://jobs.lever.co/sharpspring/4c80e4a1-150d-46e8-ae3c-0e...\n\nreply",
    "Smartcar | Mountain View | Full-Time | https://smartcar.com The connected car API for developers.\n\nHere are our open roles:\n\n- Back-End Engineer: https://jobs.lever.co/smartcar/5a03899a-8e1a-4cfa-bc5f-65a56...\n\n- Head of Sales: https://jobs.lever.co/smartcar/e005f9ab-c5da-4c5a-a67d-49a53...\n\nFeel free to reach out to our internal recruiter directly!\n\nmathilde@smartcar.com\n\nreply",
    "Mercury | React+Typescript; Haskell Engineer; DevOps | REMOTE (US and Canada) or Onsite (SF/Portland/Toronto) | Full-time\n\nMercury (www.mercury.com) is building a bank for startups. We are currently 50+ employees and are backed by top tier investors (A16Z, CRV, and more).\n\nFrontend: React, Typescript, Redux; Backend: Haskell, Yesod, Persistent; Operations: Nix, Postgres, AWS; Mobile: Swift, Kotlin\n\nWe are hiring frontend, full stack, backend, and devops engineers.\n\nLearn more: https://mercury.com/jobs or email jobs at mercury dot com\n\nThanks!\n\nreply",
    "Elation Health | Software Engineer | REMOTE | https://elationhealth.com\n\nAt Elation we make tools for physicians and their patients that improve the efficiency and fidelity of their relationship, and help to make the delivery of excellent, proactive healthcare possible. We have various openings across the rest of the organization which you can see here: https://www.elationhealth.com/careers/ but specifically I'm focused on growing our engineering team with frontend ReactJS experienced folks. Right now is a particularly challenging time for our healthcare systems and providers -- Elation offers an opportunity to work and innovate in support of those providers and their patients.\n\nElation is headquartered in San Francisco (though remote for at least the rest of 2020), and our engineering team is distributed across PST-EST timezones.\n\nTech stack is AWS/Python/Django/MySQL/ReactJS. We have a great team full of people that really value working closely with product, customer-experience, and users. Lots of interesting problems to solve!\n\nApply on the website if interested, and feel free to reach out to me directly if you have any questions or are curious! You can reach out to me directly at phill.tornroth@elationhealth.com\n\nreply",
    "Shell Hydrogen | Boston or REMOTE (US Only) | Software Architect | Full-time | US Citizen or Green Card Holder Only\n\nShell Hydrogen is at the forefront of decarbonizing industrial and mobility sectors where hydrogen can serve as the energy carrier to improve the business efficiency and customer experience.\n\nThe Product Development Team in Boston has created a digital platform using AWS serverless architecture to embed data and analytics into every part of the decision making process and the nascent supply chain. It is up to us to explore what purpose can data serve for the hydrogen sector, and how it will have an impact on the new energy industry as a whole.\n\nJoin as the first technical hire - Software Architect - as the tech lead for the entire digital platform, and guide the industry with your technical vision. You will be working with a globally distributed system with high-throughput data streams, IoT devices on mobile refueling sites and trucks, as well as setting up social experiments on how to improve the experience for FCEV customers.\n\nA side note: The work-life balance is great with the work being challenging and fun. Shell also offers great retirement packages and other incentives.\n\nTo apply, please send an email to richard.zhang at shell.com AND submit your resume here: https://www.linkedin.com/jobs/view/2157929963/\n\nreply",
    "Metabase | Software Engineer | San Francisco, CA | ONSITE, REMOTE, FULL-TIME | http://www.metabase.com/ We’re a small team building open source business intelligence tools with a strong focus on user experience.\n\nReact frontend, Clojure backend. Most of the work we do is open source. We’re looking to hire strong frontend, backend, or generalist engineers.\n\nIf you love open source, building beautiful products, and working with data, apply at http://www.metabase.com/jobs\n\nreply",
    "Weyerhaeuser | Scientific Programmer | Seattle, WA / Remote | Full Time\n\nWeyerhaeuser Company (www.weyerhaeuser.com) owns and manages approximately 13 million acres of commercial timberlands in the U.S., including a southern ownership that extends from the east coast of North Carolina and Florida to eastern Oklahoma. Weyerhaeuser is committed to sustainable forest management that includes protecting aquatic resources and all ownership is certified under the Sustainable Forestry Initiative (SFI).\n\nWe are looking to hire an aspiring, competent Scientific Programmer to work on our Advanced Forestry technology team.\n\nAs a member of the Advanced Forestry Systems (AFS) team at Weyerhaeuser you will work on a diverse range of projects involving data pipelining, web development, geospatial analysis, and machine learning. The AFS team mission is to ensure the availability of reliable and cost-effective forest information for the optimal management of Weyerhaeuser land and timber. The AFS team is committed to fulfilling this mission by providing world-class data acquisition, analytical technologies, and support.\n\nTechnologies: R, Python, C++, AWS, geospatial libs (GDAL, GIS, LiDAR etc)\n\nI can answer questions if anyone has them (email in profile).\n\nIf you are interested, please submit an application through the company portal here (Req ID:01015158): https://weyerhaeuser.taleo.net/careersection/10000/jobsearch...\n\nreply",
    "Paperspace is a high-performance cloud computing and ML development platform for building, training, and deploying machine learning models. Tens of thousands of individuals, startups and enterprises use Paperspace to iterate faster and collaborate on intelligent, real-time prediction engines. We'd love to connect if you're interested!\n\n• Senior Full-stack Engineer (Go/Kubernetes)\n\n• Senior Full-stack Engineer (node.js/typescript)\n\nWant to learn more? https://www.paperspace.com/careers\n\nreply",
    "Tatari, Product and Eng roles, any location US or Canada.\n\nWe are on a mission to democratize TV advertising, enabling new businesses to grow through that marketing channel and making TV ads more interesting and relevant. We are looking for FE, FS, and Backend engineers to work across on stack of React/Python/and Redshift-centered data engineering.\n\nJob posts here: https://www.tatari.tv/careers\n\nEngineering blog: https://eng.tatari.tv\n\nreply",
    "How strict are the experience requirements for the marketing roles? Do you have anything suitable for entry level / recent marketing graduate?\n\nreply",
    "Hi Scott, I saw you were looking for FE engineers, but see no openings for it in the careers link. Should I still try and send a resume your guys' way? Thanks for your time!\n\nreply",
    "CNS-Solutions - Member of Frequentis | Full Stack Developer, Test Engineer | Vienna, Austria | ONSITE required in general, but mainly REMOTE during COVID-19 | Full-Time CNS-Solutions & Support GmbH is a 100% subsidiary of Frequentis AG based in Vienna and was founded in 2004. Our incident management solution efficiently supports our customers to plan events, prevent service interruptions, analyse situations and restore normal operations. A thorough documentation of all activities, information exchanges and communications helps our customers to ensure a responsible and reliable operational service.\n\nWe are in the process of developing the next major release of our incident management application for different mission critical business domains such as public transport, maritime, defence or national air policing.\n\nWe are recruiting for a full stack developer and a test engineer to join our development team in Vienna. Your focus will be on the development of our frontend as progressive web app and our Java backend. We are enthusiastic about exploring new technologies and architectural styles such as CQRS/EventSourcing and Micro Frontends.\n\nWe use: React, Redux, MaterialUI, Typescript, Mapbox GL/JS (Frontend), Java 8/11, Spring Boot, Cassandra, Elastic (Backend), Docker and many more 3rd party libraries.\n\nIf you are interested in joining our small and passionate team in Vienna and for more information visit : https://cns-solutions.net or drop us an e-Mail: office@cns-solutions.net\n\nreply",
    "CloseCross | Full Time | Remote\n\nBlockchain Engineer / Node.js and Solidity\n\n- Proficient in blockchain technical concepts, cryptography, architecting secure and distributed systems and having the ability to translate the architecture and design into actually working code - Understanding of Layer 2 blockchain concepts, at least one of: State Channel, Payments Channel, Pegged Side Chains or Plasma. Ability to implement these concepts or willingness to quickly learn how. - Self-starter, not afraid to work as a part of bigger team and also alone on some tasks - Happy to be part of the remotely working team of engineers and product development people - Hungry for learning more, being exceptional blockchain technical expert, go-to person - Able to comfortably use English language for communication of technical concepts, both verbally and on writing - Node.js , TypeScript and Solidity experience is a must. Knowledge of Kotlin and/or Java would be beneficial - Paying attention to details, high level of coding standards, focused on producing quality code - Doubtful, you always ask “why” before you start to think “how” - Ability and willingness to see your work in the wider product context\n\nApply via https://angel.co/l/2hh8Wb\n\nreply",
    "Gemini | NYC, Portland OR, Chicago ILL, Remote |\n\nhttps://gemini.com\n\nFounded in 2014 by Cameron & Tyler Winklevoss, Gemini is a digital currency exchange and custodian that allows customers to buy, sell and store digital assets. We seek to build a bridge to the future of money and empower the individual consumer through crypto using a secure and trusted platform that is regulated to the highest standards available on the market. We believe in the future of a digitized economy and people's trust in it which is why we have four key pillars that drive all our product decisions: Security, Licensing, Compliance and Product. These pillars are what help us build trust, both in the market of the future and in Gemini.\n\nTo learn a bit more about who we are and what we do, check out our Medium blog: https://gemini.com/blog\n\nWe're looking for a whole lot of folks across the business, including:\n\n- Engineers on our Security, Trading Systems, Infrastructure, Mobile, Front End, Data & Backend teams. - Product Managers across Credit Products, Exchange Operations, Payments systems, new Asset classes, Retail & Marketing - Technical Program Managers - Sales and Account Managers - Customer Support - Communications\n\nWe're also looking for folks as part of our global expansion into Ireland and APAC!\n\nIf you have any questions or want to submit an application please visit https://gemini.com/careers and/or email careers@gemini.com!\n\nreply",
    "Instruqt.com | Full-time | ONSITE | Amsterdam | Back End, Front End, Full Stack https://instruqt.com\n\nInstruqt is a challenge-driven online learning platform for IT that helps organizations accelerate the adoption of new technologies for employees, partners, and customers. Enterprises use our learning solutions to upskill their employees at scale. Tech companies use our platform to teach real-world usage of their products to drive adoption and increase revenue growth.\n\nApply if you like working on challenging problems, running Instruqt is a complex operation to scale and secure. Supporting all major cloud providers and containerization platforms, is a hard problem. Our core technology is Golang and React+TypeScript, knowledge on cloud automation technology (e.g. Terraform) is a plus.\n\nIt's a great time to join Instruqt, we're a growing product team consisting of 6 full-time people, and we reach students all over the world through our customers like Hashicorp and Google Cloud.\n\nApply via https://instruqt.com/careers/product/full-stack-product-deve... or contact me directly matthisk at instruqt.com\n\nreply",
    "Airbnb | Remote (preferably West Coast) or San Francisco, CA | Senior Staff/Staff Software Engineer | Full-Time | airbnb.com\n\nMy team (Cloud Infrastructure) is hiring for a staff and a senior staff level software engineer to focus on our internal platform as a service built upon Kubernetes. Over the last three years, this has progressed from a pilot project to running almost all of our production services at immense scale.\n\nBesides Kubernetes, we are in the process of rolling Istio out, and use Terraform, AWS and Chef extensively. Our team mostly uses Golang but it helps to have familiarity with (or a lack of fear of) Java and Ruby, which most of our product teams use.\n\nAirbnb has a large number of engineers and users, which creates interesting technical and organisational challenges.\n\nThe job opening for senior staff engineer is here (and a staff posting will follow soon): https://careers.airbnb.com/positions/2245198/\n\nNote that these positions are for highly experienced engineers and it helps if you have 8+ years of experience and/or have acted in a similar capacity in prior roles.\n\nPlease send me a brief note and resume at sunil.shah@airbnb.com or apply online.\n\nreply",
    "NV Access | Brisbane, Australia | Full Time | 100% REMOTE (Australia) | Software Engineer | OPEN SOURCE\n\nUse your Python / C++ skills to empower blind and vision-impaired people globally through technology.\n\nNV Access is a global non-profit organisation, based in Australia with a 100% remote team, dedicated to the ideal that access to technology should not incur an extra cost for blind and vision impaired users. The purpose of NV Access is to lower the economic and social barriers associated with accessing Information Technology for people who are blind or vision impaired. NV Access develops the free, open source NVDA screen reading software for Microsoft Windows, enabling more than 100,000 blind and vision-impaired people across the globe to access computers. We are looking to appoint a full-time Software Engineer to join our small team. Your work will focus on improving our NVDA screen reading software and related online infrastructure, including feature implementation and bug fixing.\n\nTo apply for this position, you must be classed as \"An Australian Resident for tax purposes\".\n\nMore information, requirements, and how to apply: https://www.nvaccess.org/post/nv-access-seeking-software-eng...\n\nreply",
    "Slim.AI | REMOTE or Seattle | Full-time | Linux System and Kernel Developer | https://github.com/slim-ai/engineering\n\nI'm the CTO at the company and I'm looking for someone who likes exploring Linux system internals and who likes building system profiling, debugging, performance monitoring, system security or other fun tools leveraging the low level system capabilities in Linux. Do you know the difference between tracepoints and kprobes in eBPF? If so, I'd love to chat :-)\n\nWe are a funded seed stage startup in the developer tooling and DevOps space empowering developers to build and run their cloud-native applications. The current product is focusing on containers and the friction around them.\n\nWe are building a brand new engineering team. We are developer friendly, low on process with no mind-numbing bureaucracy or micromanagement. We are looking for people who'll be excited to be a part of the engineering team in an early stage startup during its inception phase building modern cloud-native applications the right way.\n\nYou can find out more about the mission, how we work and the roles here: https://github.com/slim-ai/engineering\n\nEmail me at cto@slim.ai if you'd like to learn more.\n\nreply",
    "F-Secure | Front-end, back-end, data science, cybersecurity | Helsinki / Oulu (FI), Poznań PL, London UK, Kuala Lumpur MY, Johannesburg ZA | ON-SITE/work-from-home-locally\n\nF-Secure makes products to protect your digital footprint and make the connected world a safer place. This is all suddenly massively more important now everyone is working from home. We're seeing the effects of that over the last 6 months with unexpected growth rates, and we are growing substantially.\n\nWe've got around 500 technologists across 5 main sites in Europe, Africa and Asia, and positions are opening up rapidly.\n\nOne absolutely key role: for the first time we're hiring an in-house software recruiter to help us grow by bringing people in the door and smoothing out the recruitment path - see https://emp.jobylon.com/jobs/66045-f-secure-software-enginee...\n\nWhoever gets that job will be helping us to fill these open positions and lots more to come...\n\nhttps://www.f-secure.com/en/about-us/careers/job-openings?c=...\n\nPlease apply via the links above.\n\nreply",
    "ATHOS | Redwood City, CA | Remote | Full time | Competitive Salary + Benefits | https://athos.applytojob.com/apply\n\nAt Athos our mission is to build better athletes by helping coaches and athletes personalize their training and make better performance decisions. Our training system is used by many of the best sports programs in the country.\n\nSince we started, Athos has been translating EMG into a simple and powerful training system. From cueing how you use your muscles, evaluating movement progression and monitoring when you are at risk of injury throughout your training. By giving athletes and coaches this unprecedented insight into muscle performance, they better understand what the body is actually doing in the days, weeks, and months of preparation for the performances that matter most. We are helping athletes reach their highest potential and are used by many of the best sports programs in the country.\n\nInterested in joining the team? We're always looking for highly-motivated employees who will help us stay on the cutting edge of creativity and innovation.\n\nWe are hiring for the following position:\n\n-Senior Frontend Engineer (Remote): https://athos.applytojob.com/apply/3g1ZIMJbCy/Senior-Fronten...\n\nreply",
    "Spondool Ltd | Senior Full Stack Developer | Dublin, Ireland | Full-Time | ONSITE\n\nSpondool develop security related software. We're looking for a full stack developer to join a small team. You'll be working on APIs and Interfaces that control and respond to a large distributed system.\n\nWe are looking for:\n\n- Someone with experience in both frontend and backend development, comfortable in moving between each\n\n- Someone with a high level of attention to detail and a strong sense of ownership over their work\n\n- Someone who will set conventions, follow them and get others to follow them\n\nSpecific Skills/Knowledge:\n\n- Python\n\n- Javascript\n\n- Django / Flask\n\n- Relational Database Design\n\n- Vue (nice to have)\n\ndaniel@spondool.com\n\nreply",
    "98point6 | Product Security Engineer, Senior Engineering Manager, Senior TPM, Senior Software Engineer, ML | OnSite Seattle, WA | Full-time | https://98point6.com/careers#open-roles\n\nHi, I’m Thomas and I’m Director of Engineering at 98point6. We’re hiring for a number of roles, like Product Security Engineer, Engineering Manager, and Senior Software Engineer, ML. Our goal is to make access to primary care as easy as googling something, without needing to make a financial tradeoff. We were seeing exciting growth before COVID-19 and that growth has accelerated even more as we help support the response to this global pandemic in the US. Some quick mentions of the technology we’re using: all our infra is in AWS, IaC using CDK (and some Terraform), Typescript, Kotlin, DynamoDB, and PostgreSQL. We are usually ONSITE in the office. During Covid, we are fully remote. Looking forward to hearing from you!\n\nRecent press about our team: * https://www.thestreet.com/investing/walmart-sams-club-teams-... * https://www.geekwire.com/2020/sams-club-partners-seattle-sta...\n\nreply",
    "Shield AI | San Diego, CA | www.shield.ai | Onsite | Remote Considered (For certain roles) | Full-Time\n\nShield AI is an artificial intelligence robotics company building products for the national security sector and first responders. We are searching for people ready to rise to the occasion and join us in developing state-of-the-art technology alongside a mission that matters. Are you up for the challenge?\n\nPositions Open Across Technical Teams: https://jobs.lever.co/shieldai -- Android Developer -- Artificial Intelligence: Senior Software Engineer C++ -- Embedded Software Engineer -- Senior Cloud Data Architect -- Senior Machine Learning Engineer -- Senior Autonomy Engineer -- Core Engineering Services -- Senior DevOps/Software Engineer -- Human-Robot Interaction Staff Engineer -- Robot and Systems Software: Principal Software Engineer -- Product Operations: Technical Product Manager for Autonomy -- Technical Product Manager for Controller and Fleet Management Software -- Technical Program Manager for Autonomous Platforms -- Drupal Front End Developer -- AI Robotics Systems Analysis Engineer -- Senior AI Robotics Product Quality Engineer -- Embedded Software Engineer - Manufacturing Automation\n\nOur team is built of scientists, engineers, and business leaders inspired by our mission; to protect service members and civilians with artificially intelligent systems.\n\nreply",
    "FullStory | Engineering Manager, Platform | Remote or Onsite | Atlanta, GA\n\nFullStory’s mission is to improve user experiences on the web and mobile devices. We’re accomplishing this mission daily by providing a platform that allows developers and product teams to automatically collect ultra high definition analytics from their sites and applications, then make those analytics available through a powerful search engine, pixel-perfect session playback, and machine learning insights.\n\nPlatform engineering is responsible for scaling FullStory on two dimensions: the number and size of our customers, and the number of engineers on the FullStory team. This includes a range of challenges, from providing rock-solid core libraries and tooling to production infrastructure at scale. We’re looking for an engineering manager who will work closely with teams and tech leads to build great software—and to develop an outstanding team.\n\nFullStory is a now-permanently-remote, hyper-growth SaaS company based out of Atlanta. The work environment we've cultivated is aligned around our three watchwords: clarity, empathy, and bionics. We value high-quality/low-ego collaboration and use automation to eliminate toil in daily work. If that sounds good to you, join us!\n\nPlease submit via our jobs page: https://boards.greenhouse.io/fullstory/jobs/4889713002\n\nreply",
    "Skool | React & Go Engineers | Full Time | Remote USA\n\nSkool is a community platform that’s optimized for learning. Our mission is to democratize education by building Earth’s largest online school for everybody. We’re a small team of two software engineers, one product manager, one product designer, and one entrepreneur. We’ve built the initial product. We’re in private beta with select communities to get user feedback and bake the product just right. We're looking to hire:\n\n  * Software Engineer - Product (React)\n  * Software Engineer - Backend (Golang)\n\nOur CTO has 20 years of intense software engineering experience, has high standards for engineering talent, system design, and code quality. Our CEO has 10 years of experience in the e-learning industry building a company from $0 to $36m. He self-funded Skool with $10m of his own money. We’re well funded, have a cool office in LA, a product users love, huge growth potential, a meaningful mission, and a talented team capable of getting it done. Join us! The stars don’t align like this very often, get in while the teams small, and equity is on the table. Above market salary, full employer-paid benefits, catered lunches, and more...\n\nInterested? Check out our job postings here: https://jobs.lever.co/skool Or, email us fun@skool.com\n\nreply",
    "CoinTracker (YC W18) | Remote (Global) | Full Time | Senior Software Engineer | https://www.cointracker.io\n\nCoinTracker is a portfolio manager for cryptocurrency. It is used by 100K users, tracking $1.5B in crypto assets, and enables consumers and businesses to seamlessly track their cryptocurrency portfolio, investment performance, and calculate taxes.\n\nBigger picture, we are building a financial assistant for all financial assets. Our mission is to increase the financial freedom and prosperity of individuals and companies.\n\nWe have a lot of interesting technical problems that need to be solved to make cryptocurrency easier to use for the mainstream. We are a fully distributed, tight-knit team of eight people spread across five countries. All applicants are welcome.\n\nWe are looking for senior software engineers who love building great products and engineering systems, enjoy being in early-stage startups, and are passionate about cryptocurrency or financial services.\n\nTech stack: Python, Postgres, Redis, GraphQL, React, React Native, Heroku, AWS\n\nIf you're interested, please tell us a bit about yourself and apply on https://jobs.lever.co/cointracker/abb7f14c-5ad4-474a-ad5a-53...\n\nIf you have any questions, feel free to email us directly: jon+hn@cointracker.io\n\nreply",
    "Sotheby's | New York (NY) | Onsite (Remote for now) |\n\nOverview\n\nWe need people that can help us drive technical vision, product development, innovate, optimize complex problems and improve efficiency. We’re looking for team players that value opinions other than their own, look to data to support their decisions, take initiative and make things better. Ideal candidates are curious and eager to learn, are comfortable with ambiguity and a fast paced, ever changing environment.\n\nQualifications\n\n5+ years of industry engineering experience with proven track record Must have proven experience writing, deploying, and running distributed systems Must have experience writing microservices with clear separation of concerns Must have expert knowledge and experience with Either Golang or Scala Must have proven experience using data structures and algorithms especially as pertain to web system design and distributed systems Must have expert knowledge of RDBMS such as Postgres or MySQL and writing migrations Working knowledge of GraphQL and GRPC is a big plus Working knowledge and experience writing in Golang is a big plus Working knowledge and experience with Docker and Kubernetes Working knowledge of cloud platforms such as GCP or AWS Working knowledge of messaging queue systems\n\nLink to apply: https://www.linkedin.com/jobs/view/senior-backend-software-e...\n\nreply",
    "Interactive Brokers | Senior Quantitative Developers, Python Developer | Greenwich, CT and NYC | ONSITE required in general, but most of us are 100% REMOTE during COVID-19 | https://boards.greenhouse.io/ibkr\n\nInteractive Brokers (IB) has been at the forefront of the Fintech space for over 40 years and we pride ourselves on being a technology company. All management from the CEO down have direct programming experience at the company. IB offers trading on approximately 100 exchanges in 25 countries and related cashiering to customers from around the world.\n\nTwo \"Senior Quantiative Developer\" positions\n\nDesign, develop, and enhance quantitative models, tools, and reports to monitor customer trading and cashiering activity for signs of money laundering, market manipulation, or other suspicious activity.\n\n- Financial Crimes Analytics [1] -- hands-on AML experience required\n\n- AML and Trade Surveillance [2] -- hands-on trading experience required\n\nPython Developer\n\nDevelop market surveillance infrastructure, implement and enhance algorithms for the detection of market manipulation, and create systems to support the investigation of flagged customer activity by compliance analysts. [3]\n\nDozens of other positions available worldwide [4] (Choose 'Software Development' for the department).\n\n[1] https://boards.greenhouse.io/ibkr/jobs/4737413002\n\n[2] https://boards.greenhouse.io/ibkr/jobs/4737493002\n\n[3] https://boards.greenhouse.io/ibkr/jobs/4897596002\n\n[4] https://boards.greenhouse.io/ibkr\n\nreply",
    "Hi, thanks for this post...do you have an email contact to reach out to discuss and learn more?\n\nreply",
    "ReaQta | Amsterdam | Full-time | Onsite | Visa sponsorship\n\nWe are a cybersecurity company that specialises in endpoint threat response aided with AI. We are looking for a Senior Designer to shape our product design vision. The ideal candidate will lead design efforts to tackle complex problems and produce creative solutions for our users.\n\nJob description here https://reaqta.com/team/join-us, please send your CV to i.rivas [AT] reaqta.com\n\nreply",
    "AmerisourceBergen | Remote in US | Lead UX Engineer | Full-time\n\nWork fully remote at a Fortune 10 company with an extremely chill work/life balance! AmerisourceBergen is a leader in the pharmaceutical logistics space, delivering healthier futures to everyone.\n\nAmerisourceBergen is looking for a passionate, innovative, and experienced Lead UX Engineer to join our growing product design team and lead the next iteration of our design system’s development. Under the direction of the Director of User-Centered Design, and working in conjunction with a blended team, you will be responsible for contributing to the vision, and building out the design system’s components, frameworks, documentation, and tooling which will enable our product teams across the enterprise to rapidly design and build applications providing consistent user experiences.\n\nJob posting: https://abccareers.taleo.net/careersection/2/jobdetail.ftl?j...\n\nReply if interested and I can engage with any questions/referrals. :)\n\nreply",
    "Summery | New Position: CTO | REMOTE | www.summery.ai\n\nWe are pleased to announce the search for Summery's first CTO. As a fast-growth, dedicated-remote company with a 100% virtual offering, we are rapidly expanding our client base. We are especially interested in diverse candidates who share our Summery values. Please apply & forward the open position to talented professionals within your network.\n\nLooking for someone to: • Partner with the CEO to build the business, including overseeing engineering, managing technology partnerships, owning product road maps, representing the organization in the media, industry conferences, and with investors. • Assume role of lead engineer, continuing to enhance existing product suite to direct and build new AI-based products • Make critical technology decisions, including tech design planning, product architecture, development platform enhancements • Manage tech team, including recruiting and hiring additional developer support/consultants as needed • Fortify current QA and product testing systems • Track, analyze and monitor technology performance metrics • Oversee and implement best practices on data & tech security and ethical AI • Take the initiative in thought leadership, innovation and creativity\n\nMore info on the position specifics including core projects for 2020-21, tech stack, and corporate values: https://www.linkedin.com/company/summery/\n\nreply",
    "InnoVint | Wine Production Software | www.innovint.us | Remote (US-based) | FT | Front End Developer\n\nInnoVint is the world's leading SaaS solution for wineries and wine producers. We are and have always been a well-performing, tight knit virtual team that meets several times a year in the real world (usually a wine destination!). About half the team has some wine production experience. If you love the idea of being part of the wine industry, but haven't yet considered combining your experience in SaaS and tech, maybe InnoVint is the perfect company for you. If you are a reformed or aspiring winemaker, that's even better!\n\nWe're seeking a passionate Front End Developer to help build the foundation of a new cutting-edge PWA. You will be working in parallel with our existing front end team to lead the development of this new mobile web platform. You should be excited to learn more about the latest developments in the progressive web app space, including offline data storing, cacheing, and performance optimizations. Our stack is Angular 10/Typescript & Python/Django/PostgreSQL.\n\nIf you're interested in helping us delight our winemaking clients with the wine industry's best software and most passionate team, I'd love to hear from you. Please send it to directly to me (Dan, the CTO) at dan @ innovint.us\n\nreply",
    "JamLabs Data Science Inc. | www.jamlabs.com | Toronto, Canada | Full-Stack Software Developer | Full-time | Remote\n\nWe have an exciting opportunity. JamLabs is a rapidly growing data science firm that works with financial institutions around the world to organize, analyze and monetize their data. We create customized solutions for our clients as well as develop our own in-house products.\n\nYou’ll be one of the first hires who will work with the company founders to form the foundation of a development team. You will have the opportunity to work with a variety of interesting technologies and define the fundamental processes we will use going forward to deliver products to our clients.\n\nYou will:\n\n  - Design and build data solutions on AWS using Lambda, Kinesis, Elastic Map Reduce, Athena and Glue\n  - Create web applications using NodeJS and React\n\nWhat You Will Need To Succeed:\n\n  - 5+ years of full stack development experience.\n  - Expert knowledge of AWS\n  - Extensive experience with SQL, a web technology like React/Angular, REST APIs, WebSockets, JavaScript and Python\n  - Data engineering and ML experience at-scale (nice to have)\n\nIf you're looking to make an impact in the world of data, visit https://jamlabs.com/careers or give us a shout at careers@jamlabs.com\n\nreply",
    "ESI Group | Software development engineer | San Diego, CA | Full-time | Onsite preferred\n\nESI Group is currently seeking a software development engineer to work in our San Diego office. We are a small team with diverse backgrounds focused on developing desktop software applications in the field of vibro-acoustics simulation. Our clients include NASA, Boeing, Airbus, GM, and Ford.\n\nWe are looking for candidates with a Bachelors/Masters degree in the sciences or engineering. We use C++, Python, Qt and CMake to develop our applications. Presently, we are migrating our MFC-based application to Qt. We use GitLab as our version-control platform with continuous-integration, unit testing and package management, via Conan, to complete our DevOps toolkit. Many of our team members are skilled in numerical methods and high performance computing. Our ideal candidate would be familiar with several of these programming languages and development tools.\n\nBeing a small team, you'll enjoy a high level of autonomy and the ability to influence new products and features on several levels. You'll learn from our wealth of pooled knowledge and share your expertise in return.\n\nWe offer a number of flexible work schedules. During Covid, ESI adheres to governmental guidance and public safety measures.\n\nPlease contact Tracy at ext-tracy.sidall@esi-group.com with any questions you may have relating to the position or company. Don't forget to mention HN in the email!\n\nreply",
    "RxRevu | Engineering, DevOps, Data Science, UX/UI, Product | Remote (US Based) | Full-time | https://rxrevu.com\n\nRxRevu is a well-funded digital healthcare startup that offers tools and content for healthcare providers to understand the cost of care for their patients. We've been growing like crazy over the past year and we're now in over 300 hospitals, with hundreds of thousands of doctors performing millions of price transparency transactions per month.\n\nThis is a particularly hard problem in the US Health system and we have great momentum so far. If you like solving difficult problems that translate into a material improvement in someone's quality of life, e.g. access to a medication they wouldn't have otherwise had, then we should probably talk.\n\nWe're cloud centric and use ruby on rails for transactional services, python for data pipeline and other data intense systems. We've been fully distributed since the pandemic struck, most of us were based in the Denver area, but as we've grown in the past half-year we're now open to candidates anywhere inside the USA.\n\nPlease check out our careers page as we have many roles currently open! https://rxrevu.com/join-us/\n\nreply",
    "Flatirons Solutions | Software Engineers (all levels) | Chennai, India | Full-Time | REMOTE currently, ONSITE/REMOTE in the future\n\nJoin us as we employ world-class software engineering practices to solve complex Content Lifecycle Management (CLM) problems in the Aerospace industry. Our solutions are used in a wide range of functions by Airlines & Aerospace OEMs and this includes technical engineering order management, documentation authoring and publishing, flight operations manuals, data archiving, and other workflows, documentation, and maintenance products. Flatirons India is also recognized as one of the best medium-sized companies to work for in 2020 by the Great Place to Work® Institute.\n\nTech Stack: Java, Spring Boot, AngularJS/Angular 10, XML/XSLT, ELK stack.\n\nPrior experience in building products using AWS services would be a plus.\n\nCheck out our careers page to learn more about us and see all open roles: https://www.flatironssolutions.com/about/careers/\n\nPlease send in your resume and/or queries to Saranya.GirivardhanaRao[at]Flatironssolutions.com with 'Hacker News' in the subject line.\n\nreply",
    "Facile.it | Milan/Cagliari, Italy or REMOTE | Multiple positions | Full-time | https://jobs.facile.it/\n\nWe help people find the best offer on insurance, phone/internet/power bills and loans and mortgages by comparing the various offers from various providers.\n\nGiven that our business is strongly local to Italy, please do not apply if you are not fluent in Italian or a native speaker of Italian. This is a strong requirement. E-mails from recruiters or agencies will be ignored as well.\n\nDespite the COVID-19 we are still going strong, growing and hiring!\n\nOur backend has been historically based on PHP (Symfony) and MySQL (both pxc and galera cluster) but we are expanding to Javascript/Typescript, a little Golang, MongoDB, Redis, RabbitMQ and a lot more! We moved most of our workloads on containers (Kubernetes) and we do CI/CD with Gitlab.\n\nWe are currently looking for:\n\n- Devops engineers (experienced, mid-level to senior)\n\n- NodeJs/Typescript Backend Engineer (associate level and up)\n\n- QA Automation engineers (we love RobotFramework!)\n\n- Senior front-end engineer (Typescript/React/Redux/RxJS)\n\n- PHP Backend Developer (we <3 Symfony!)\n\nIf you are interested, send an e-mail to emanuele.santoro@facile.it containing the string \"HNWHOISHIRING\" in the subject.\n\nreply",
    "Ambassador Labs (formerly Datawire) | Software Engineers (mid-level to senior to principal) and Engineering Manager | REMOTE with preference in Montreal Canada, Boston MA, Portland OR | FULL-TIME\n\nAmbassador Labs is a series B tech company solving problems for cloud native developers in the Kubernetes space. We are looking to hire engineers that care as much about empowering developers as we do and have embraced the cloud native phenomenon that is taking over the world.\n\nAs a team, our focus is firmly on products that help users make the shift to the cloud with Kubernetes. We’re most known for our flagship product Ambassador and are investing heavily in other rising stars like Delivery Accelerator, Developer Portal and Service Preview, and Kubernetes Initializer.\n\nYou’ll work in Golang and Python because our products comprise multiple services and those services are written in various languages (the best language for that particular task).\n\nMore specifically, we’re looking for backend engineers that have contributed or are currently contributing to open source projects. We are also looking for engineers that are well adept in devops or have experience working on low level systems development (comfortable fiddling with linux configurations, VPNS, etc). We are also looking for an engineering manager! If interested, please send a resume or linkedin profile directly to carly.sigler@datawire.io.\n\nreply",
    "Sedition | Senior Front-End Developer | Remote (Europe) | https://www.seditionart.com/\n\nSedition is a platform for selling and collecting digital artworks. We've been doing this for the last 10 years and since have become one of the industry leaders. Our artwork collection consists 4000+ artworks including works from artists like Tracey Emin, Shepard Fairey, Yoko Ono and many other well renowned names. Every sold artwork is a limited edition and collectors have the right to resell their collected artworks. Our goal is to create a platform for art collecting in digital space.\n\nThis year we've gained some exciting traction and looking for new people to help improve the product. We're a small team based in Europe, originally in London but since February we ditched our last office and became fully remote.\n\nAs a front-end developer you will be working on improving our website (React / TypeScript) and apps (React Native). Occasionally we would ask you to help with back-end (Ruby on Rails) and possibly other things Tizen OS (Samsung), WebOS (LG), Chromecast.\n\nreply",
    "Reddit | Security Engineers | San Francisco, New York, Dublin, London | ONSITE, REMOTE | Full-time\n\nThese roles are responsible for assessing and assuring the integrity of Reddit’s applications and infrastructure for millions of users. We partner with product and engineering throughout the software development life-cycle to ensure applications and infrastructure are designed and built securely. If you evangelize security and love to train developers and operations engineers to build better, more secure software and networks, one of these positions might be for you.\n\nThere aren't many companies that can offer the chance to have such a large impact in a company that executes at this scale. If you have 5+ years of experience in application, infrastructure, or cloud security this is a rare opportunity.\n\nApplication Security Engineer: https://boards.greenhouse.io/reddit/jobs/2333389\n\nSr. Application Security Engineer: https://boards.greenhouse.io/reddit/jobs/2092047\n\nSr. Software Engineer, Security: https://boards.greenhouse.io/reddit/jobs/2159856\n\nStaff Security Engineer: https://boards.greenhouse.io/reddit/jobs/2329804\n\nreply",
    "Workvivo | Cork, Ireland | REMOTE | Front-end & Full-stack Engineers, Product Owners/Managers | https://www.workvivo.com\n\nWorkvivo is an employee communications platform, designed to bring your workplace culture to life. Think of it as a social network, intranet and employee app solution all streamlined into a modern digital employee experience. Our mission is to help companies drive engagement in their workforce and better align employees with the goals and values of the organisation.\n\nWe're based in Cork, Ireland but are working entirely remotely since the pandemic and hiring internationally for most roles. Our team of 30 are currently spread across Ireland and the Bay Area. We raised a $16m Series A earlier this year, and are currently hiring across product management, engineering, marketing, customer experience and sales. For product and engineering roles we are looking for mid to senior level experience at this time.\n\nTech Stack: AWS, Laravel, PHP, MySQL, Redis, Elasticsearch, React, React Native, GitHub\n\nReach out to me directly if interested - my email is my first name at workvivo.com.\n\nreply",
    "Home | Full Stack Engineer | Toronto, ON | ONSITE, REMOTE | https://joinhome.com/\n\nHome is building a new path for first-time homebuyers. We automate ways for you to save, and combine it with personalized advice to make buying a home painless and approachable. Home helps you understand where you are today, create your optimal plan, and help you become a homeowner faster.\n\nOur team comes from early roles at Uber, Shopify, Opendoor, Betterment, Compass, and more. Our investors have built or backed some of the biggest names in our space including Plaid, Wealthfront, Monzo, Intuit, Tally, Roofstock, and Petal. And many of them are still in the trenches building the next wave, as founders of companies like Wave, Ada, Properly, and Pillar.\n\nYou'll be responsible for driving projects from concept to completion in an environment of autonomy and creativity. And since we're early, you'll have an opportunity to shape not just our product, but our culture: who you work with, and how we all work together.\n\nFull job description: https://angel.co/company/homehq/jobs/914373-full-stack-engin...\n\nSubmit your application to gaurav@joinhome.com\n\nTech stack: Ruby/Rails 6, Stimulus JS, ViewComponent, React/React Native, PostgreSQL\n\nreply",
    "Love the idea. Encouraging and helping folks save for a home purchase is critical.\n\nreply",
    "Thanks Robert, we think so too!\n\nreply",
    "Fishtown Analytics | https://fishtownanalytics.com/ | Full Time | Remote, anywhere in the United States\n\nAt Fishtown Analytics, our mission is to empower analysts to create and disseminate organizational knowledge.\n\nOver the course of the past several years we've built a community of 6,000+ people and 2,500 companies who are using our ideas, products, and workflows to conduct analytics, including Lyft, Monzo, GitLab, Snowflake, the ACLU, Amazon, JetBlue, and RentTheRunway. Our product, dbt (https://www.getdbt.com/), has come to be synonymous with the practice of analytics engineering, defining an entire industry.\n\nOur team is growing fast as well. We're hiring for a number of roles across Engineering and Sales. If this mission sounds like something you'd like to be a part of, let's talk!\n\nYou can find our open jobs here: https://www.fishtownanalytics.com/jobs/\n\nAt Fishtown Analytics, we’re committed to building an inclusive team that welcomes a diversity of perspectives, people, and backgrounds. Whether or not your experience exactly fits the job description above, your passion and skills will stand out and set you apart even if your career has taken some twists and turns. If you are on the fence about whether you meet our requirements, we encourage you to apply anyway!\n\nreply",
    "Archipelago | PM, PMM | San Francisco or REMOTE (US only) | Fulltime\n\nArchipelago is a Silicon Valley start-up working to change how risk is insured. Our platform enables large real estate owners, managers, brokers & insurance carriers to efficiently map their portfolio, manage their risks, and underwrite them, through a mix of machine learning and human intelligence. Our founders are tech & finance entrepreneurs with several IPOs and acquisitions under their belts. We are headquartered in San Francisco, have raised several rounds of VC funding, and currently employ over fifty people across the US & Europe.\n\nWe're currently hiring for the following roles:\n\n- Senior Product Manager: help manage design & delivery of our enterprise software platform https://archipelago.breezy.hr/p/a533667e883801-senior-produc...\n\n- Head of Product Marketing: define & execute our messaging, packaging & collateral https://archipelago.breezy.hr/p/d4441f66df3b01-head-of-produ...\n\nIf you want to apply, it's better to do it directly through the links above, but if you have any questions don't hesitate to reach out to me directly tim@onarchipelago.com!\n\nreply",
    "SearchPilot | Django & React Developer | UK, Primarily Remote | https://www.searchpilot.com/\n\nSearchPilot is a profitable and growing startup currently made up of 12 people in the UK and US. We are building an SEO A/B testing platform, allowing large companies to make data driven SEO + CRO decisions. For 5 years we were a startup inside an agency (Distilled), but we spun out of Distilled in early 2020, with the whole software team becoming part of the new company.\n\nAt SearchPilot we are passionate about our team, and we want that to be more than just words. We want to continue to build a team of people who can thrive and succeed, as well as feel valued and welcomed, at all levels.\n\nWe are looking for a UK-based developer with experience working with Django and React. You will be working on the customer facing parts of our platform which will be used by a wide range of customers, from startups through to large enterprises. The backend of the application is written in Django and uses React on the client.\n\nJob listing: https://www.searchpilot.com/jobs/\n\nreply",
    "DroneDeploy (https://www.dronedeploy.com) | FULL-TIME | REMOTE\n\nDroneDeploy is the enterprise-grade drone data platform for managing complex job sites. Trusted by brands globally, our software automates everything from flight to insight, making the power of aerial data accessible and productive for everyone. We’re transforming data collection across a variety of industries, including agriculture, oil & gas, construction, solar, and utilities, so teams can survey large areas and make informed decisions quickly, safely, and accurately. We are the leading drone software company with over 5,000 customers across 200 countries. Our team is comprised of passionate, tech-driven enthusiasts. Voted the #1 Best Place to Work in the Bay Area, we welcome talented professionals looking to make an impact.\n\nWe have several open positions: https://www.dronedeploy.com/about/careers/ I am hiring for a senior backend engineer: https://jobs.lever.co/dronedeploy/b4c9277a-f993-45f3-9566-ef...\n\nSome of our tech stack: Python, Angular, Kubernetes, GCP, Cloudflare Workers\n\nreply",
    "Onja.org | Front End Engineer (multiple positions) | Madagascar, Africa | onsite\n\nLooking for a meaningful and intrepid change? Join our social enterprise that trains capable, low-income youth into world class software developers and provides them with life-changing remote work.\n\nWe’ve spent the last two years training an inspirational group of students to become strong front end web developers and are now looking for two front end developers to help us progress onto the next stages.\n\nWe’re looking for:\n\n1) Front end Teacher: Develop and deliver a second-year front end web development course that will allow students to extend their knowledge and prepare them for their future careers. For more details: https://onja.org/frontenddev/\n\n2) Techlead/Mentor: Lead graduates to career success - help our graduates take their first steps into professional work. They’ll need you to guide them on the technical aspects of front end development, coach them on communication and help them navigate the day to day challenges they will face. For more details: https://onja.org/techlead/\n\nWe’ll sponsor your visa and you’ll join our beautiful team in Mahanoro - a peaceful beach town on Madagascar's East Coast.\n\nFeel free to contact me, Sam, at team@onja.org for a chat / more information.\n\nreply",
    "Role: Product Engineer (Full Stack, Ruby on Rails)\n\nHack Club (https://hackclub.com) is seeking a full stack product engineer to own the product development of Hack Club Bank (https://hackclub.com/bank/), our nonprofit fiscal sponsorship service for teenagers (https://en.wikipedia.org/wiki/Fiscal_sponsorship).\n\nThis is a senior role. You will be expected to work independently and manage direct reports, including 2 people running backend operations and 2 part-time engineers.\n\nWe are a small, but growing nonprofit building the program we wish we had when we were 15. We have a core team of 5 right now. In April 2020, Elon Musk endorsed Hack Club: https://hackclub.com/elon/.\n\nCompensation: $80k/year + healthcare. Remote friendly, but with a regular travel expectation. Our HQ is in Burlington, Vermont.\n\nRequirements: 10 years of engineering experience with prior experience managing direct reports. Strong eye for product.\n\nIf interested, please email me at zach@hackclub.com and CC tina@hackclub.com. Include \"Hacker News HCB\" in the email subject line.\n\nreply",
    "Strateos(YC W15) | Front End, Back End and Full Stack Software Engineers, Product Managers | Menlo Park, CA | https://strateos.com | FULL TIME; ONSITE/VIRTUAL\n\nStrateos is turning life science into an information technology by creating a fully automated cloud wet lab. Scientists anywhere can define and (reproducibly!) run experiments over the internet on-demand and without investing up-front in a lab facility.\n\nThe Strateos Common Lab Environment (SCLE) takes Autoprotocol (http://autoprotocol.org/), a high-level JSON description of a biological protocol, and executes it on our custom-built robotic workcells. The protocols we handle routinely involve solving constraint programming models with thousands of variables and constraints in order to find the best plan that fulfills the scientist's biological intent.\n\nScientists manage their experiments through our web application or via our API. We provide a single platform that controls scientific devices from many vendors in a unified way, and an interface to control our automated labs.\n\nTech stack includes: Linux, Scala, RabbitMQ, Rails, Typescript, React, Ansible, Postgres\n\nBenefits include: full medical/dental/vision insurance; catered lunch and dinner when in office, and a fully stocked kitchen; flexible vacation policy; 401(k) with matching; gym and commuter reimbursement; and education reimbursement up to $3,000/year.\n\nreply",
    "Moesif API Analytics is an early stage, high growth start up to understand customer API usage and drive more business value.\n\nWe have multiple roles open in San Francisco and remote:\n\nSenior Software Engineer https://apply.workable.com/moesif/j/86483B715B/\n\nEnterprise Sales Development Representative https://apply.workable.com/moesif/j/5E13A09868/\n\nreply",
    "SevenFifty | Technical Lead (Rails/React) | Remote USA | Full-time\n\nSevenFifty is an end-to-end supply chain and communications platform (B2B SaaS) connecting U.S. alcohol retailers, wholesalers, and producers/importers.\n\nWe're looking for an experienced full-stack developer to join our 15-person engineering team and lead development for a small squad. The squad you’ll be joining is currently two other engineers and a project manager working with stakeholders across the business, and a cross-team designer as needed. They work in two related Rails apps, with a combination of classic server-rendered Rails functionality, and React components on top of Rails. We use Solr for search, Postgres on Amazon RDS for data, and run our web apps on Heroku.\n\nThis role entails a mix of hands-on development and technical leadership. You'll be the technical representative for your squad of engineers, taking the lead on architectural decisions and quality development practices across the team. We expect you to be team-oriented and be comfortable mentoring, but we do not expect you to directly manage other engineers.\n\nyitz at sevenfifty dot com (hiring manager)\n\nMore info and link to apply at: https://www.builtinnyc.com/job/engineer/technical-lead-web-d...\n\nreply",
    "Reapit | Senior Full Stack TypeScript Engineers | Contract | UK Only, Fully Remote\n\nReapit are the UK’s market leading prop-tech CRM platform. Last November we launched an early Alpha of our new ‘Foundations’ PaaS, Developer Portal and Marketplace that allows third parties to extend our core desktop product with web technologies https://youtu.be/y-Fhlg2jrYo. The product has come a long way since then. We are in the process of rolling out to our customer base and now comprises multiple web apps, NPM packages, micro services, web components, an interactive style guide and other tooling. The code, as well as our Kanban and project milestones are all open source and on Github here: https://github.com/reapit/foundations\n\nWe are looking for skilled JS contractors to join the team to build new features, services and web apps. Ideal candidates will have 5+ years commercial JavaScript development experience and will be comfortable working with our tech stack; TypeScript, React, Redux, Node, Jest, GraphQL, Svelte, AWS and tooling. They will have an attention to detail, particularly for UI, testing and code quality, be comfortable working independently as well as contributing ideas both technically and on a product level. If this is you, would love to hear from you! Email your Github profile with a brief resume / LinkedIn to Will McVay wmcvay@reapit.com for details. Direct hires only, no recruiters thankyou.\n\nreply",
    "Mediasmart| Senior Backend Developer | Madrid | REMOTE ok for candidates in Spain\n\nWe are a tech advertising company specialized in mobile advertising, now part of the Affle group, public under the India exchange as NSE:AFFLE\n\nWe are looking for a team leader/senior backend developer for our mediasmart bidder product.\n\nThis is not the typical code glueing position. Our product is a distributed software that evaluates millions of impressions per second, computing the price our clients would pay employing machine learning and advanced maths. Performance, algorithms and data structures are real concerns and in fact we develop our own algorithms, middleware and custom databases.\n\nThe candidate will code and provide expertise and guidance to the rest of the team. The position is 100% remote. Our stack is NODE.JS and GOLANG. We require 5-10 years of experience as a coder, preferable on startups or adtech companies. This is not a project manager position. Compensation range €30K-€50K.\n\nMore info here:\n\nhttps://blog.mediasmart.io/we-are-looking-for-a-backend-engi...\n\nTo apply send us your CV, github profile and cover letter to jobs@mediasmart.io (EU candidates living in Spain)\n\nreply",
    "Duolingo | Product Management | Pittsburgh, New York City, Bellevue/Seattle\n\nWe're changing how people around the world learn new languages. We're a multilingual, diverse group of people who work in small, cross-functional teams to help change the world, one word at a time. We're learners first, and we specialize in making learning fun.\n\nWe have several roles open - check out all of them here: duolingo.com/careers\n\nDirector of Product Management (PGH): https://boards.greenhouse.io/duolingo/jobs/4667773002\n\nSenior Product Manager, Schools (NYC): https://boards.greenhouse.io/duolingo/jobs/4853375002\n\nSenior Product Manager, Events (Bellevue/Seattle): https://boards.greenhouse.io/duolingo/jobs/4903346002\n\nReach out to priyeta@duolingo.com if you have questions or want to talk to a human!\n\nWatch what happened at Duocon: https://www.duolingo.com/duocon\n\nUniversity Students can learn more at https://university.duolingo.com/\n\nreply",
    "Apify | Marketing & Growth, Product, ... | Prague | Full-time ONSITE | https://apify.com/jobs\n\nApify builds software technology and infrastructure that helps anyone leverage the full potential of the largest source of information ever created in the history of humankind - the Web. Our mission is to let people automate mundane tasks on the web and spend their time on things that matter. We strive to keep the web open as a public good and a basic right for everyone, regardless of the way you want to use it, as its creators intended.\n\nJoin Apify and help us make the web more programmable!\n\nreply",
    "Sqreen | YC W18 | Product Security Engineer | Paris | Full-Time | Remote |\n\nSqreen | YC W18 | Data Engineer | Paris | Full-Time | Remote |\n\nSqreen | YC W18 | Agent Principal Engineer | Paris | Full-Time | Remote |\n\nSqreen | YC W18 | Principal Engineer, Platform Squad | Paris | Full-Time | Remote|\n\nSqreen (YC W18) is an application security platform made for both engineering and security teams. We use dynamic instrumentation libraries that monitor web applications internals to detect security anomalies and block triggered vulnerabilities at runtime. What Application Performance Management tools (like New Relic) do, but for security.\n\nWe are currently looking to fill a few critical roles in a European friendly timezone (+/- 2 hours) for our Product & Engineering team:\n\nProduct Security Engineer - a software engineer with a security focus who will help to secure our products for our customers.\n\nData Engineer - a backend engineer who is passionate about all things data processing, platform availability & performance and scalability.\n\nAgent Principal Engineer - a technical lead who will be responsible for driving the overall technical vision across our entire agent library (7 languages and counting!).\n\nPrincipal Engineer, Platform Squad - a technical lead who loves technical strategy, mentoring and anything architecture related.\n\nAll of these roles are open to full remote with a European compatible time zone.\n\nYou can find more details on our careers site:\n\nhttps://www.sqreen.com/company#jobs\n\nreply",
    "Jane | Santa Cruz, CA | Onsite | https://www.iheartjane.com\n\nJane Technologies, Inc. has developed the cannabis industry's first real-time marketplace, where consumers can discover and order cannabis online. We believe in the cannabis industry's ability to bring well-being, health, and love into this world, and it is our mission to bring confidence to the cannabis shopping experience.\n\nTo learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/jane\n\nHere are our open roles:\n\n- Senior Full Stack Engineer: https://boards.greenhouse.io/janetechnologies/jobs/471672000...\n\n- Technical Lead: https://boards.greenhouse.io/janetechnologies/jobs/469587900...\n\n- Senior Product Visual Designer: https://boards.greenhouse.io/janetechnologies/jobs/469964100...\n\nTech Stack: Backend: Ruby on Rails. Frontend: ReactJS + Typescript.\n\nreply",
    "Helm.ai | Various Engineers | Full-Time | REMOTE & ONSITE (covid WFH) | Bay Area\n\nHelm.ai is a rapidly growing seed-stage autonomous vehicle startup. Our deep learning approach to self-driving is uniquely data- and capital-efficient, allowing us to get to market quickly. Our team consists of researchers from top schools like Harvard, MIT, Stanford, and Caltech and engineers from companies like Google, Stripe, Quora, and more.\n\n* Autonomous Vehicle Engineer - https://tinyurl.com/HelmAVE\n\n* Software Engineer - https://tinyurl.com/HelmSWE\n\n* Research Engineer (Perception) - https://tinyurl.com/HelmRE\n\n* Systems Engineer - https://tinyurl.com/HelmSYSE\n\nYou can read recent articles published about Helm.ai below:\n\n* Forbes, \"Android of Self Driving Cars\" - https://tinyurl.com/HelmForbes\n\n* Medium, \"Helm.ai Pioneers Breakthrough 'Deep Teaching' of Neural Nets\" - https://tinyurl.com/HelmMedium\n\nreply",
    "Ladder | San Francisco, CA | Full-time | Senior Software Engineer https://withladder.com/company/jobs/4057701003\n\n----\n\nLadder creates upward mobility for American job seekers and simplifies hiring for employers. Right now, we're helping job seekers attend 3-14 week classes to become certified nursing assistants (CNAs), financing their tuition and placing them with employers immediately upon completion. For many, Ladder represents a new lifeline to economic stability and a better chance at a fulfilling career.\n\nThis is engineering role #3 at a 10+ person company with some phenomenal talent and great culture. We're hiring for both front-end and back-end roles, with a focus on the front-end role and someone who has had 2+ years of experience working in React, TypeScript, and front-end JavaScript frameworks. We are optionally WFH thru the end of 2020.\n\nIn my time in tech I have never come across a company that is as mission-oriented as ours — while still very much focused on building a successful business. We are backed by USV and some of the best VCs/angels in the business. It's a great opportunity to join an early-stage company.\n\nYou can apply here and mention HN, or email me directly (brandon@ the below domain name):\n\nhttps://withladder.com/company/jobs/4057701003\n\nreply",
    "Alameda Research | Full Time | Hong Kong | ONSITE + visa sponsorship | 175-200k USD base + bonus https://www.alameda-research.com/\n\nAlameda Research is a quantitative cryptocurrency trading firm based in Hong Kong. We trade between ~600 million to 1 billion dollars a day, making markets across 1000 coins using one of the most sophisticated trading systems in the industry. We have a strong history of success through varied market conditions, are rapidly growing, and are excited to add new members to our team.\n\nWe're looking for:\n\n- Blockchain engineers - we are a major partner of Project Serum (https://projectserum.com/) and contribute to the project\n\n- Backend and database engineers to work on the infrastructure and databases backing our trading and research platform\n\n- Engineers with a background in high performance computing and/or low latency trading and networking\n\n- Quantitative researcher/developers with a background in electronic trading\n\nDevelopers at Alameda don't necessarily specialize into a single role so don't feel like you have to fit into a single slot.\n\nIf you're interested, send an application via this form: https://www.alameda-research.com/join-alameda.\n\nreply",
    "Theorem LLC | Theorem.co | REMOTE | Full-time | Experienced Back End, Front End and QA Engineers, Product Managers\n\nTheorem is Hiring! We are a Remote first technology consulting company with a focus on how we do the work as a means to achieve great results.\n\nBackend - C# .NETCore: https://bit.ly/30vVa3S Backend - Java: https://bit.ly/3iwqqGF Full Stack / Polyglot Engineer: https://bit.ly/2Dd20mn Frontend - React: https://bit.ly/3keVqMQ QA/SDET : https://bit.ly/33nhRZL\n\nVisit Theorem.co/careers to learn more about our team and all open opportunities in UX and Product, Engagement and Engineering Management.\n\nThank you so much for taking the time to learn about Theorem. Have an awesome day! Please email me directly with any questions Kristen.Williams@Theorem.co\n\nreply",
    "Cleary | Full Stack Engineer | San Francisco, CA | ONSITE, REMOTE | https://www.gocleary.com/ Cleary is building an ‘operating system of the office’ based on the kind of internal tools that companies like Airbnb, Twitter, Dropbox, Google, Uber, etc build for their own employees. We're seeing great traction - we're working with companies like Square, Flexport and LendingHome, and just raised a large seed round from top tier investors. We're assembling an A+ team - currently just 7 people with backgrounds from Twitter, Microsoft, Cornell, Carnegie Melon, YC, etc.\n\nYou’ll get to work directly with our experienced entrepreneurial team, which includes three second-time founders with two prior exits. In this role you will wear multiple hats, reporting directly to the CTO, and will have an opportunity to take on a leadership position (if desired) as we scale.\n\nFull Job Description: https://docs.google.com/document/d/1k9wl1zztDOlqE5sVdaTAAslA...\n\nSubmit resumes to ryan@gocleary.com\n\nTech Stack: Ruby/Rails, React, Redux, Postgresql, ElasticSearch, AWS\n\nreply",
    "Udacity | Mountain View, San Francisco, UK, REMOTE | https://www.udacity.com\n\nUdacity's mission is to train the world’s workforce in the skills of tomorrow. We're an immersive online learning platform offering hands-on training in fields such as artificial intelligence, machine learning, data science, autonomous systems, cloud computing, and more. We are backed by some of the best-known investors: Andreessen Horowitz, Charles River Ventures, Bertelsmann and Drive Capital, among other leading firms.\n\nFocused on self-empowerment through education, Udacity has the potential to transform the world by providing lifelong learners with the chance to skill up in cutting-edge technology while creating meaningful impact. We also partner with the enterprise market to bridge the talent shortage and skills gaps during their digital transformation journey. As their partner of choice, we are providing a powerful and differentiated solution to address their needs.\n\nTech: Docker/PostgreSQL with Golang, TypeScript/Node.js, React, Python, or Ruby depending on team. Run your preferred OS.\n\nOpen positions in Engineering, Content, Marketing, Customer Success, and Enterprise Sales: https://grnh.se/cuagoq2\n\nreply",
    "Singularity 6 | Software Engineers, Artists, Designers | Los Angeles, CA | Full-Time, Remote\n\nCOVID NOTE: For the duration of the health crisis, we've transitioned into a fully remote, work-at-home environment. We can interview, hire and onboard you now. We're stable, with money in the bank and we're not going anywhere. While we have a preference to eventually return to an office, most software engineering roles can be remote (in North America) indefinitely.\n\nWho are we?\n\nWe're a VC funded (a16z) game studio in the westside of LA building virtual worlds with deep gameplay (not just a hangout space!) that foster vibrant online communities. This first game world emphasizes adventure, co-op, and creative gameplay.\n\nI love working in the game industry and proving we can deliver incredible player experiences without burnout and crunch. Massive online games offer a unique intersection of technical and creative fields, ranging from graphics, animation, AI, cloud native computing, big data and more.\n\nI'm am still growing my launch team! All positions are senior+ levels:\n\n- Game Engineer, gameplay focus with a background in Unreal Engine 4 preferred (will require eventual relocation to LA)\n\n- Software Engineer, backend platform, microservices, Java/Kotlin (remote ok)\n\n- Software Engineer, Cloud infrastructure, container clusters (remote ok)\n\n- Software Engineer, Data & analytics, growth engineering (remote ok)\n\nTo learn more, check out our website and feel free to connect to me directly on LinkedIn (please mention Hacker News!):\n\nhttps://www.singularity6.com/careers\n\nhttps://www.linkedin.com/in/jaaronfarr/\n\nreply",
    "Clerk is building developer tools for user management. You can think of us as Stripe Checkout for Sign up, Sign in, and Profile management. A recent demo can be seen here (5m22):\n\nhttps://www.youtube.com/watch?v=60qhpmQHlCU\n\nWe're hiring a frontend engineer to lead the development of our dashboard, the modules deployed on our customers' websites, and our NPM packages. We develop with Typescript and React, but our modules can be deployed in any stack.\n\nClerk is still a small company. You'll be joining a team of 5 and working most closely with our lead backend engineer (who is responsible for the apis you'll interface with) and our product designer (who is responsible for the user experience and design).\n\nWe are well-funded by founders and early engineers of Stripe, Segment, PagerDuty, and Facebook, and plan to launch before the end of the year.\n\nPlease reach out to colin@clerk.dev\n\nreply",
    "Refersion | New York, NY | Various Roles | Full-time | Onsite/ Remote\n\nWe are a nimble, smart, and curious team of technologists that takes pride in our entrepreneurial approach and collaborative culture.\n\nCurrently Refersion is seeking exceptional talent for the following roles:\n\n* Front-end Developer\n\n* Product Manager\n\n* Product Marketing Manager\n\n* Customer Success Manager\n\nAbout Refersion\n\nRefersion is a high-growth technology company helping brands and merchants in every industry transform the way they manage marketing partners; from affiliates and bloggers to influencers and brand ambassadors. Having processed $9.93B in orders in 2019, our performance marketing SaaS platform has a large and growing client base ranging from enterprise retailers to small and emerging businesses.\n\nFounded in 2015, Refersion is headquartered in New York City, with a satellite office in Miami.\n\nJOB DESCRIPTIONS & TO APPLY:\n\nInterested in joining us?\n\nGo to: https://apply.workable.com/refersion/\n\nAny questions, email Alan at alan@refersion.com\n\nreply",
    "Zalora | Singapore | Backend Software Engineer | Full-time | Onsite (When Singapore opens up) or Remote (Singapore Time).\n\nWe're the largest fashion e-commerce in South East Asia with remarkable traffic and interesting scaling challenges. We are looking for Go (Golang) engineers among other things to work on our distributed Mobile API.\n\nApply at: https://careers.zalora.com/jobs/software-engineer-golang/k2x... and mention HN somewhere in your application.\n\nP.S: Our interview is tailored to be painless (i.e. we don't have take home problems or elaborate algorithm interviews). If you'd like to learn more about the interview process before you apply or if you have any questions at all, email me at: sudarsan.reddy@zalora.com.\n\nreply",
    "ByteFederal | Full Stack Developer | Sarasota, FL | Full Time, Onsite | www.bytefederal.com\n\nFast growing FinTech startup developing hardware and software for a fleet of kiosks, made in the US. We also operate a network of \"bank in a box\" ATMs across the US. Our mission is to bring banking services to the unbanked and crypto to \"Main Street\". We are looking for an experienced engineer who enjoys pushing the boundaries. US citizenship / green card required.\n\nLanguages include: PHP, Python, JS, C++, SQL. This position requires solid understanding of consumer facing front-end design as well as serious Linux and Python skills. Join us on the Florida Suncoast with lovely beaches, perfect for family life plus a very competitive salary. Flat management, no cubicles and a laser focus on innovation defines our highly professional spirit.\n\nApply at jobs@bytefederal.com\n\nreply",
    "Spacelift | Backend and frontend roles | Warsaw, PL | ONSITE OR REMOTE (CET) | Fulltime | $50-120k per annum | https://spacelift.io/\n\nWe are building an automation platform for infrastructure-as-code and policy-as-code and are looking to onboard a single senior frontend developer as well as multiple backend developers.\n\nOn the frontend, we have a standard modern React app (only functional components) interacting with a GraphQL API using Apollo Client.\n\nOn the backend, we're mainly using Go with a bunch of cloud APIs and AWS primitives. Perfect backend candidates will have a strong interest in DevTools, DevOps and infrastructure. Previous working experience with Terraform (ideally), Ansible, CloudFormation or SaltStack more than welcome.\n\nApply at marcinw at spacelift dot io.\n\nreply",
    "StatsBomb | DevOps/Software Engineers/Customer Success | UK/Egypt | Remote for now, forever if you like\n\nWe're a football analytics startup (both the soccer and American varieties!) We sell data products as well as analysis tools to sports organisations, with a tech stack that includes computer vision, machine learning, stream processing, and web-based dataviz. We're hiring devops engineers, and front-end, back-end or full-stack software engineers to build out product teams across our fast growing business. We count many of the biggest names in football as customers, and your work will have a direct impact on our ability to deliver insights to those customers, driving success on the field.\n\nMore details at https://statsbomb.com/careers/, apply via careers@statsbomb.com.\n\nreply",
    "Foresight Data Machines | Machine Learning Scientists & Software Engineers | London, UK | Onsite | Fulltime\n\nAll the info: https://www.foresightdatamachines.com/jobs\n\nCertain essential industrial processes use large amounts of power. We create predictive control software that massively increases the efficiency these processes. Our solution uses cutting edge machine learning combined with physics principles. Our customers include one of the world's largest industrial companies.\n\nWe are turning our proof of concept into a scalable product, and looking to make first hires to help us.\n\nRoles: roles are fluid but we loosely define two areas.\n\nscientific machine learning research\n\nCreate and implement cutting edge machine learning technology for control of real physics and engineering processes. Relevant topics: Continuous depth neural networks (neural ODEs and related methods); reinforcement learning; model predictive control; physics informed machine learning; bayesian machine learning.\n\nsoftware engineering (full-stack)\n\nEngineer software solutions that implement cutting edge machine learning models and control algorithms in a demanding industrial environment. Full spectrum of tasks, including: design, development, deployment and maintenance of front and backend software solution.\n\nApplicants should be excited by the prospect of hands-on building in a minimal team, with the opportunity to build their team and assume a leadership roles when we grow. Appropriate salary and stock options available.\n\nWe are open to a range of experience/qualifications, however, all applicants should have evidence of exceptional achievement in a relevant discipline. See the jobs page for more info.\n\nEmail us: info [at] foresightdatamachines [dot] com\n\nreply",
    "Compute Software | Senior Software Engineer | Mountain View, CA | Remote\n\nKenny here at Compute Software. We're looking to hire a Senior Software Engineer with 3-5 years of Clojure experience and 5-8 years of SaaS application development experience. We are an early stage cloud decisions SaaS startup that helps enterprises run optimally on the cloud. You are ideally an all-around athlete and looking to be a part of a startup. Our backend is all Clojure and frontend is all ClojureScript. Data is all stored in Datomic and InfluxDB. Everything is deployed to AWS using Pulumi. We're based in Mountain View, California and open to someone working remotely in the U.S. Send an email to jobs@computesoftware.com.\n\nhttps://www.computesoftware.com/careers/senior-software-engi...\n\nreply",
    "Leadr| Lead Mobile Developer| Plano, TX or Remote| Full Time| http://leadr.com\n\nOur platform is a people management tool built for the next generation focused on empowering managers with the tools they need to develop leaders at all levels of the organization, primarily serving the faith market. Whereas other companies in the space offer employee engagement tools focused on daily surveys, performance management, etc., our focus takes it one step further by placing a focus on developing the workplace by helping managers become coaches.\n\nC#/.NetCore/React/AWS with a React Native mobile application, open to native developers too.\n\nLead Mobile Developer- https://apply.workable.com/leadr-inc-1/j/45B7996A76/\n\nreply",
    "Even Financial | NYC / Remote (USA) | https://evenfinancial.com/\n\nEven Financial is building an API for financial product acquisition. We work on the infrastructure that allows companies to connect their users to the right loan, credit card, insurance, etc across the major financial institutions. Think of us like a Kayak/ITA software for financial products.\n\nWe're looking for a javascript tech lead who's comfortable working full-stack from react to terraform to lead the team and help us build beautiful, configurable, and performant consumer experiences for our millions of users.\n\nhttps://jobs.lever.co/evenfinancial/0f55408b-fb1f-4ba4-81d1-...\n\nor email me david.kim at evenfinancial com\n\nreply",
    "ClearVoice | Senior Software Engineer | REMOTE in (AZ, CA, MA, MI, MN, TX, WA) | https://www.clearvoice.com/ | Full Time\n\nClearVoice is the first and only Teamlancing platform enabling expert freelancers to work with Fortune 1000 companies without having to deal with the issues that come with it. We believe a clear voice is the most powerful voice.\n\nClearVoice was acquired by Fiverr in February 2019 and IPO'd 4 months later. We've been in growth mode ever since. Join a unicorn public company while retaining the autonomy and empowerment of working in a startup-like environment! We're looking for thoughtful and intelligent individuals with a strong product sense that get stuff done :)\n\nStack:\n\n- Ruby on Rails\n\n- MySQL\n\n- Redis\n\n- Elasticsearch\n\n- Terraform\n\n- AWS\n\nRoles:\n\n- Senior Software Engineer - https://apply.workable.com/clearvoice/j/B7D8055339/\n\nBenefits:\n\n- Health/Dental/etc\n\n- FVRR RSUs\n\n- 401k\n\nreply",
    "Circadian Risk | REMOTE (USA/Canada only)\n\n* Mid-level & Senior Software Engineers - Candidates should generally have some speciality (Backend/Frontend/DevOps) but should be full-stack capable\n\n* UI/UX Designer\n\n* IT Administrator - Compliance\n\n---\n\nMission: Circadian Risk aims to improve enterprise security and physical risk mitigation.\n\n---\n\nTech stack (searchable buzzwords): TypeScript, NestJS, Hasura, Swagger, Postgres, AWS, Infrastructure as Code, Pulumi, GitHub Actions, Docker, Redis, React, React Native, Material UI\n\n---\n\nMore info available here: https://docs.google.com/document/d/1e1SXIs8xbghKBM1oIDlwQsaW...\n\nIf you’d like to apply, please send something representative of your capabilities and work experience (resume, GitHub, LinkedIn, portfolio, et al) to pmestemaker + hn (at) circadian risk dot com.\n\nreply",
    "Alteryx Innovation Labs | Engineering | Boston, MA or Remote | Full-time | https://www.alteryx.com/innovation-labs\n\nThe Alteryx Innovation Labs creates next generation technologies, tools, and products to unleash the full potential of machine learning.\n\nWe’re building automation technology to make machine learning easier to use. We work on many unique and important machine learning challenges with a focus on making sure machine learning isn’t just a theoretical endeavor but has a real-world impact.\n\nCurrently, our stack is mostly Python, Scala, and React. We use AWS and docker for deployment. Above all, we prioritize the ability to choose the right approach to solve a problem.\n\nApply at https://www.alteryx.com/innovation-labs/careers\n\nreply",
    "SpotDraft | https://www.spotdraft.com | Engineering & Product | Bangalore, India\n\nSpotDraft is an AI-driven, end-to-end contract automation platform that helps organizations create, analyze, negotiate, sign, store & manage contracts seamlessly, and get automated reminders about upcoming actions.\n\nOur Core tech includes - Backend (& Other Services) - Python, Django, C# (.NET Core). Frontend - Angular (9), TypeScript, Redux. (Although, previous Angular experience is not a hard requirement as long as you are open to learning)\n\nWe are looking for different roles - https://spotdraft.applytojob.com/apply\n\nIf you are interested, shoot me an email at anirudh at spotdraft dot com\n\nreply",
    "Substack (W18) | Full stack engineer | San Francisco | Onsite | https://substack.com\n\nSubstack lets writers start their own subscription publication - think paid blog/newsletter - where writers' and readers' incentives are aligned.\n\nOver 250k people pay to subscribe to publications, and top writers are making six figures.\n\nWe use Node, Express, and Postgres on top of Heroku. React for frontend. Simple & effective so we can focus on solving problems for users.\n\nWe are 17 people. We raised a series A from a16z last summer and are thoughtfully building our early team. Two of our three founders are technical (the other is a writer) and we're looking for folks to work along side us, shipping things that touch thousands of writers and millions of readers.\n\nCome join us! https://substack.com/jobs\n\nreply",
    "Mavrck | Software Engineering Manager, Software Engineers, Designer | Boston, Denver, Remote (USA) | https://www.mavrck.co\n\nView all of our open positions at https://boards.greenhouse.io/mavrck\n\nMavrck is a SaaS platform for enterprise brands running social media campaigns with creators at scale.\n\nOur tech stack is Javascript/Typescript, Kotlin, MySQL, Elasticsearch and AWS.\n\nWe're looking for a hands-on engineering manager/tech lead, multiple software engineers, and a product designer as we scale our product team.\n\nWe have offices in Boston and Denver, though we are remote friendly/flexible and are interested in candidates from throughout the USA.\n\nWe're a ~50 person company with 6 software engineers looking to increase the size of our team to take on new projects and challenges.\n\nreply",
    "Nimble | Bangkok, Thailand | Fulltime | ONSITE | Visa/Work Permit + Relocation assistance | https://nimblehq.co/\n\nWe are a team of designers, software developers and product owners building outstanding web and mobile applications for companies of all sizes, from 1-person startups to Fortune 500 companies. We take a product development approach, creating custom software that people will love to use and empowering our clients to do what they do best - better.\n\nEngineering Lead-Web: https://jobs.nimblehq.co/o/engineering-lead-web-4\n\nSenior Web Developer: https://jobs.nimblehq.co/o/senior-web-developer-30\n\nSenior Android Developer: https://jobs.nimblehq.co/o/senior-android-developer-28\n\nSenior iOS Developer: https://jobs.nimblehq.co/o/senior-ios-developer-27\n\nTechnical Product Owner: https://jobs.nimblehq.co/o/technical-product-owner-24\n\nWe keep our recruitment process practical and straightforward: https://github.com/nimblehq/our-team/blob/master/join-us/our...\n\nDue to COVID-19 and international travel restriction, we are able to process candidates who are currently residing in Thailand only. If you are living outside of Thailand, we will get in touch with you once the travel ban is lifted.\n\nreply",
    "Arena | Lead Machine Learning Scientist + Deep Learning Scientist | Full-time | Remote / NYC — We founded Arena a little over a year ago, to bring advanced ML techniques out of the lab (lots of active learning, for instance), and apply them at scale, for large enterprises where we can measurably prove impact. We're profitable, with multiple large scale Fortune 500 customers in pilots & in production.\n\nThere are 8 of us on the team, almost entirely technical – a mix of Machine Learning Engineers and Scientists with deep academic background and experience. The team includes 3 former founders. Co-founder and CEO founded Kimono Labs (YC W14, acquired by Palantir).\n\nCompetitive compensation, with material equity ownership for the right fit. — Apply by sending us an email: careers@arena-ai.com | https://arena-ai.com\n\nreply",
    "Geneva | Full Time | Senior Web Engineer, Senior Android Engineer, Senior Product Designer | NYC and REMOTE | https://www.genevachat.com/\n\nGeneva is an early-stage startup based in NYC building a new kind of social network — where privacy is respected and ads are a thing of the past. We unite the best features of group messaging apps and social platforms, creating a modern digital space where you can have conversations with all the groups you care about. We are an intellectually curious, driven, and results-oriented team with a track record of building successful businesses, backed by proven investors.\n\nTechnologies that we use: TypeScript, React, GQL, Redux-Saga, Cypress, Enzyme, Kotlin, Dagger\n\nTo apply: https://boards.greenhouse.io/geneva\n\nreply",
    "Kraken Digital Asset Exchange | Engineers | Product Managers | Onsite or Remote | https://www.kraken.com/en-us/careers\n\nKraken was founded in 2011, being a pioneer exchange in the crypto market. Kraken is in rapid expansion of its development and Product teams. At Kraken we have a remote global team, allowing our employees to have more freedom in choosing how to organize their routine and balance work and personal life.\n\nOctober Highlight:\n\nSenior Full Stack Engineer - Rust\n\nWe’re also hiring software engineers with the following skillsets: Backend (Rust/Go/Typescript/PHP), Frontend (React/Flux/Redux/Sass/Less/PHP) and many more.\n\nPlease apply directly on our Lever careers page at https://jobs.lever.co/kraken.\n\nreply",
    "IP Fabric | Senior Backend Developer | Prague, CZ | ONSITE\n\nWe're looking for experienced developers with passion for quality readable code, reducing technical debt, large scale systems, databases and api.\n\nOur stack\n\n  * Node.js, RabbitMQ, ArangoDB, ElasticSearch, Redis\n\n  * React.js, Websockets, Redux\n\n  * Typescript, Webpack, Babel\n\nWho we are\n\n  * IP Fabric, Inc. is headquartered in New York, with offices in Prague, Czech Republic, and is a leading solutions provider of network assurance and intent-based network analytics for hybrid and large-scale networks. Its proven automated network assurance platform serves as a single source of truth for the network infrastructure, enabling policy standardization, continuous compliance, and incident prevention.\n\nEmail me at pavel@ipfabric.io\n\nreply",
    "Luminide | Technical Lead | Full Time | REMOTE (preferably West Coast) or San Francisco Bay Area\n\nLuminide is an early stage startup aimed at changing the way data scientists build next-gen AI technology. Luminide automates and accelerates the most challenging AI development tasks, also known as \"Augmented AI Development.\"\n\nWe're looking for a FrontEnd or FullStack Technical Lead. Ideal candidates will have expertise with popular JavaScript technologies such as Node.js/React/TypeScript as well as online IDEs like JupyterLab/vscode/Theia.\n\nJoin an early stage startup and build something amazing! https://www.luminide.com\n\nreply",
    "Yonder | Sr. Full Stack Engineer | Full Time | Austin, TX or Remote (US only) | yonder-ai.com/careers\n\nYonder is an information integrity company on a mission to bring authenticity to the Internet. We use artificial intelligence and machine learning to identify the groups that drive online conversations.\n\nWe're looking for a Sr. Full Stack Engineer with 5 or more years of experience building web apps in a full stack capacity, ideally on data-intensive applications. This role will report to the CTO and will be part of a small, fun, collaborative team!\n\nFull Job Description and application at: https://www.yonder-ai.com/careers/?jobId=fHWPUuLppN7q&ft_sou...\n\nTechnologies we use: Python, React, TypeScript, Postgres, Snowflake, Kafka\n\nreply",
    "FIVETRAN (https://www.fivetran.com) | OAKLAND, CA | FULL-TIME | ONSITE (remote during shelter-in-place)\n\nFivetran replicates all applications, databases, events, and files into a high-performance data warehouse. Our data connectors free companies to focus on insights instead of fixing data leaks. Now more than ever, companies rely on data to get to critical decisions; Fivetran makes this happen. We recently announced our Series C of $100M in June! Our core values make us who we are: https://fivetran.com/culture\n\nHiring for different positions: https://fivetran.com/careers\n\nPrincipal Software Engineer\n\nStaff Software Engineer\n\nSenior Software Engineers (product - backend dev)\n\nSREs\n\nSDETs\n\nProduct Managers\n\nSome of our stack: Java, Postgres, Kubernetes, AWS, GCP, CircleCI\n\nreply",
    "Blue Ridge Labs @ Robin Hood Foundation | Engineers | Design | Product Manager | Remote | https://labs.robinhood.org/fellowship\n\nA startup studio focused on building technology that fights poverty. Alumni include Upsolve (YC W19), FreshEBT (a18z funded), Justfix.nyc (Chan Zuckerberg funded), and more.\n\nBlue Ridge Labs is place where technologists and communities work together to explore and build new solutions for New Yorkers. We provide space, funding, and resources to help launch and grow tech platforms that address economic inequality in NYC.\n\nWe're looking for experienced full stack engineers, designers, product managers and topic area experts to join us this summer for a paid 4 month intensive R&D program to develop tech products that tackle issues faced by low income folks.\n\nWe’ve had fellows join us from Google, Facebook, Twitter, NASA, and more. They’ve founded organizations that have raised millions of dollars and helped millions of people.\n\nhttps://nytimes.com/2018/12/04/nyregion/nyc-landlord-databas...\n\nhttps://www.forbes.com/sites/jeffkauflin/2020/04/03/fintech-...\n\nhttps://techcrunch.com/2019/01/16/upsolve-bankruptcy/\n\nFind out more & apply: https://labs.robinhood.org/fellowship\n\nreply",
    "Tutorful.co.uk | Full-time | REMOTE whenever there is a pandemic, ONSITE with lots of flexibility when not | SHEFFIELD UK | Full Stack\n\nWe make tutoring affordable and accessible to all. We have over 10,000 tutors across the UK delivering over 13,000 lessons per week, both in person and online. We're growing fast, we like to stay lean but we need more developers!\n\nRoll up your sleeves for some Vue, TypeScript, Nuxt, PHP, Laravel, Swift, Kotlin, AWS infra-as-code.\n\nWe have a strong engineering culture of Kanban, fast feedback, automated testing, infra-as-code and continuous delivery.\n\nApply at https://careers.tutorful.co.uk/jobs/960563-software-engineer\n\nreply"
]