[
    {
        "position": "Campus Undergraduate - 2021 American Express National Bank Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20009181?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-15T20:40:12.315Z",
        "location": {
            "city": "N/A",
            "state": "Not Available",
            "country": "Sandy, Utah"
        },
        "description": "\n      <p style=\"font-family:Arial\">American Express National Bank (“AENB”) is American Express’ chartered national bank. Headquartered in Utah, AENB is the single largest entity within American Express’ business, currently representing more than 50 percent of the company’s Card Member Spending, nearly 90 percent of its lending and more than 60 percent its of revenues. AENB provides its customers with access to consistent payments, financing and savings products in three ways, including: </p>\n\n<ul>\n\t<li>Issuing and servicing charge and credit cards for our consumer and small business segments;&nbsp; </li>\n\t<li>Offering commercial loans to small and midsized merchants, as well as installment loans to consumers; and </li>\n\t<li>Maintaining a Personal Savings program consisting of high-yield savings accounts and certificate of deposit products.</li>\n</ul>\n\n<p style=\"font-family:Arial\">AENB is also home to <a href=\"https://square.americanexpress.com/community/aenb/center-for-community-development\">The Center for Community Development</a> (“CCD”) for American Express. The CCD is charged with the implementation and execution of the Community Reinvestment Act (“CRA”), which requires banks, like AENB, to meet community credit needs, particularly those of low- and moderate-income individuals and communities.</p>\n\n<p style=\"font-family:Arial\">We are passionate about our commitment to drive AENB’s goals of growth and progress by creating a culture of awareness and proactivity around regulatory matters, and by partnering closely with affiliates across the enterprise to ensure we deliver maximum value to our shareholders and our customers efficiently and effectively. AENB is dedicated to building diversity and inclusive leadership across all levels of the organization.</p>\n\n<p style=\"font-family:Arial\">Within AENB&nbsp;<a>the Vendor and Operational Risk team is responsible for managing AENB’s affiliate and third party vendor risk programs, leading the company’s intercompany agreement center of excellence, and executing the AENB’s operational risk framework within the 1<sup>st</sup> line of defense.</a></p>\n\n<p style=\"font-family:Arial\">This position will be based in Sandy, Utah. </p><h4>Minimum Qualifications</h4><p style=\"font-family:Arial\"><b>Required Qualifications:</b></p>\n\n<ul>\n\t<li>Inclusive mind-set and behaviors across all levels of organization</li>\n\t<li>Demonstrated experience building, sustaining and leveraging relationships </li>\n\t<li>Strong work ethic, organizational skills and attention to detail with excellent follow-up skills</li>\n\t<li>Demonstrated willingness to take initiative and act decisively</li>\n\t<li>Ability to think strategically and influence teammates on multiple, cross-functional teams</li>\n\t<li>Positive, can-do attitude embracing growth mindset</li>\n\t<li>Project management skills with the ability to prioritize and multitask</li>\n\t<li>Currently enrolled in full-time undergraduate degree program in business, economics, risk analysis or other quantitative fields&nbsp; </li>\n\t<li>Students must have a graduation date between December 2021 and June 2022</li>\n\t<li>Strong written and oral communication skills</li>\n\t<li>Ability to organize, manage, analyze, and interpret large amounts of data to identify trends and themes</li>\n\t<li>Proven ability to translate highly technical and complex information into easily understandable terms</li>\n</ul>\n\n<p style=\"font-family:Arial\"><b>Preferred Additional:</b></p>\n\n<ul>\n\t<li>Strong understanding and knowledge of core banking concepts</li>\n\t<li>Strong analytical skills; familiarity with statistical/analytical software packages a plus</li>\n\t<li>Knowledge of relevant laws and regulations relating to regulated financial institutions a plus</li>\n\t<li>Experience in a related discipline including audit, compliance, risk, regulatory management, law, marketing and product management, finance, technologies or control related functions </li>\n</ul>\n\n<div style=\"border-bottom:solid windowtext 1.0pt; padding:0in 0in 1.0pt 0in\">\n<p style=\"border:none; font-family:Arial; padding:0in\"><b>About Us</b></p>\n</div>\n\n<p style=\"font-family:Arial\">American Express’ heritage was built on service and has been sustained by innovation. Through our evolution from an express mail business in 1850, to one of the world’s largest card issuers by purchasing volume and a digital innovator, we’ve never been afraid to explore new possibilities and embrace the changing marketplace.</p>\n\n<p style=\"font-family:Arial\">From our high employee Satisfaction ratings to our many workplace awards, American Express is consistently recognized as a great place to work by people around the world. We offer talented individuals challenging work with purpose by embracing both innovation and tradition. &nbsp;As our company has grown and evolved, sometimes reinventing our business outright, we have never strayed from the customer-service ethos and values on which the company was built –trust, security, integrity, quality, good citizenship, respect and customer commitment. </p>\n\n<p style=\"font-family:Arial\">Learn more about Risk at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\" style=\"color:blue; text-decoration:underline\">https://careers.americanexpress.com/students/</a>.</p>\n\n<p style=\"font-family:Arial\"><b><u>With a job at American Express, almost anything is possible. Apply now!</u></b></p>\n\n<p style=\"font-family:Arial\">Our team will review completed applications on a rolling basis. We appreciate your patience while we consider your application and will be in contact with you by April 30<sup>th</sup>.<i> </i><br>\n<br>\nEmployment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.</p>\n\n<p style=\"font-family:Arial\">US reqs -&nbsp;<span style=\"unicode-bidi:embed\"><span style=\"word-break:normal\">USUndergrad, Handshake UNV-12520</span></span></p>\n\n<div style=\" background-color: rgb(255, 255, 255); color: rgb(0, 0, 0); font-size: 12px; font-style: normal; font-variant-caps: normal; font-variant-ligatures: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-decoration-color: initial; text-decoration-style: initial; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;\">\n<p style=\"font-family:Arial\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</p>\n</div><br>Tags: USUndergrad, Handshake UNV-12520<br>ReqID: 20009181<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Jan 19, 2021, 10:46:08 AM\n    ",
        "index": 1,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Campus Undergraduate - 2021 Associate Product Owner Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006495?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-15T20:40:15.010Z",
        "location": {
            "city": "N/A",
            "state": "Not Available",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">Become part of the digital transformation and\nhelp revolutionize the financial services industry.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">At American Express, we provide customers with\naccess to products, insights and experiences that enrich lives and build\nbusiness success. Our customers include our Cardmembers as well as the small\nbusinesses, merchants, corporations, and bank partners that are all members of\nthe dynamic American Express network. As a Product intern, you have the\nopportunity to make your mark on technology and life at American Express.\nYou’ll be challenged every day as we build products to meet the customers of\ntomorrow.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The Product internship at American Express is an\nexciting opportunity for someone who wants to help shape experiences for one of\nthe world’s top brands. We seek a thought-leader and a problem-solver who can\nblend business, technical, and industry best practices – sweating every fine\ndetail when it comes to developing the most effective technology led solutions\nto improve our customer’s experiences.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do at\nAmerican Express?</b></p>\n\n<div>&nbsp;</div>\n\n<ul><li>Be responsible for the development and execution of new and\nemerging products, services and/or technology platforms, following a User\nCentered Design approach</li><li>Manage projects from concept through production partnering with the\nnecessary teams to shape a rich and engaging customer experience</li><li>Be a\npassionate advocate for the customer, grounding ideas in data driven solutions\nby partnering with our customer research team to incorporate user insights and\nprinciples throughout the process</li><li>Assist\nin the Agile product development process including writing user stories,\ndefining support documents, and conducting usability testing</li><li>Collaborate\nwith internal and external partners and as part of a cross-functional team</li></ul>\n\n\n\n\n\n\n\n\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b>We have the know-how, creative platform and\nglobal reach to make nearly any idea a reality. Do these describe you?</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<div><b><u>Skills/Experience</u></b></div>\n\n<ul><li>Proven\ninterest in technologies and customer-driven design</li><li>Independent\nthinker who’s organized, has great attention to detail, and can multi-task</li><li>Strong\nanalytical, problem-solving/quantitative skills</li><li>Willing\nto take risks, experiment, and share fresh perspectives</li><li>Proficient\nin analytical and presentation tools, including Excel and PowerPoint</li><li>Excellent\nwritten and verbal communication skills, and ability to present ideas clearly</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b><u>Educational\nRequirements</u></b></p>\n\n<ul><li>Currently enrolled in full-time undergraduate degree program</li><li>Students must have a graduation date between December 2021 and\nJune 2022</li></ul>\n\n<div><b>Why American Express?</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a difference between having\na job and making a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express has been making a\ndifference in people’s lives for over 160 years, backing them in moments big\nand small, granting access, tools, and resources to take on their biggest\nchallenges and reap the greatest rewards. We’ve also made a difference in the\nlives of our people, providing a culture of learning and collaboration, and\nhelping them with what they need to succeed and thrive. <a name=\"_Hlk29297924\">W\ne’re right there with them, giving them the guidance and momentum into the best\nfuture they envision.</a></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we\nbelieve that the best way to back our customers is to back our people.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The powerful\nbacking of American Express.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Don’t make a\ndifference without it.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Don’t live life\nwithout it.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Learn more about\nour groups at American Express by visiting: <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a>.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>With a job at\nAmerican Express, almost anything is possible. Apply now!</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will\nreview completed applications on a rolling basis. We appreciate your patience\nwhile we consider your application.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Employment\neligibility to work with American Express in the U.S. is required as the\ncompany will not pursue visa sponsorship for these positions.</p>\n\n<div>&nbsp;</div><div><div>\n\n</div>\n\n</div>\n<br><br>Tags: Handshake UNV-12520, CFE-12801<br>ReqID: 20006495<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Oct  2, 2020, 12:07:35 PM\n    ",
        "index": 2,
        "skills": [
            "project management",
            "networks",
            "machine learning",
            "virtual reality",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Campus Recruitment- 2021 Technology Software Engineer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006515?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-15T20:40:17.264Z",
        "location": {
            "city": "N/A",
            "state": "Not Available",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">American\nExpress is going through an exciting time of change. This diverse and creative</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">organization\nhas the power to shape our technology and product roadmap. If you</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">have\nan interest in improving your skills in a tech environment while meeting\ninnovative</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">problem\nsolvers and serving our customers across physical and digital spaces, come and</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">join\nour team!</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Interns\nwill work building global scale software with a host of tools and frameworks. Internship\nproject areas range from Machine Learning to Big Data to Mobile to AppDev to\nArtificial Intelligence. You’ll work across our software products, like Spring\nCloud and Webflux for reactive Java services, or Node.js driving React web\napplications and even polyglot microservices. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’re\noften experimenting with new technology; it’s all about picking the right tool\nfor the right job!</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We\nare looking for Interns to join our 10-week Summer Internship Program, which\ngives</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">you\nreal, on-the-job work experience whilst allowing you to choose from a number of</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">potential\nroles within our scrum teams; giving you the skills and experience to help you\naccelerate in your studies and future career.</p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Join the\nteam and make an impact right away:</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nIdentify exciting opportunities for adopting new technologies to solve</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">existing\nneeds and predict future challenges</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nDevelop software applications as part of a scrum team</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nLearn technical skills, write code, conduct code reviews and testing</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nWork with Product Managers to prioritize features for new products and</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">manage\na list of requirements based on industry trends and new</p>\n\n<div>technologies</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nDesign work, such as user experience or graphic design</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nBespoke learning and development program, e.g. technical, leadership,</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">networking\nand soft skills</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nTake part in social activities, community service events and projects with</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">other\nInterns and Graduates</p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>We have\nthe know-how, technology and global reach to make nearly any idea a</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>reality.\nAll that's missing is you!</b></p>\n<div><div><br></div></div><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b>Do you meet\nthe below requirements?</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nCreative, collaborative and having the desire to learn</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nEye for driving innovation and change</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nAbility to effectively connect with non-technical business partners</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nCapable of working well and contributing meaningfully in a team environment</p>\n\n<div>&nbsp;</div>\n\n<div>&nbsp;</div>\n\n<div><b>A bonus if you have these:</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">● Experience in\ndeveloping products or projects either in an academic,</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">professional\nor personal setting</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nSome entry level software development experience, or design or creative</p>\n\n<div>experience</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nA technical background is beneficial but not required; we are looking for</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">passionate, quick learners\nwilling to take on new challenges</p>\n\n<div><b><br></b></div><div><b>Educational Requirements</b></div>\n\n<ul><li>Currently enrolled in a\nBachelors or Masters degree program in Computer Science, Computer Engineering,\nor other technical discipline</li><li>Students must have a\ngraduation date between December 2021 and June 2023</li></ul>\n\n\n\n<div><b>About Us</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express’ heritage was built on service and\nhas been sustained by innovation. Through our evolution from an express mail\nbusiness in 1850, to one of the world’s largest card issuers by purchasing\nvolume and a digital innovator, we’ve never been afraid to explore new\npossibilities and embrace the changing marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">From our high employee Satisfaction ratings to our many\nworkplace awards, American Express is consistently recognized as a great place\nto work by people around the world. We offer talented individuals challenging\nwork with purpose by embracing both innovation and tradition. &nbsp;As our\ncompany has grown and evolved, sometimes reinventing our business outright, we\nhave never strayed from the customer-service ethos and values on which the\ncompany was built –trust, security, integrity, quality, good citizenship,\nrespect and customer commitment. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Learn more about our Technology group at American\nExpress by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</p>\n\n<div>&nbsp;</div>\n\n<div>Why American Express?</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a difference between having a job and\nmaking a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express has been making a difference in\npeople’s lives for over 160 years, backing them in moments big and small,\ngranting access, tools, and resources to take on their biggest challenges and\nreap the greatest rewards.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’ve also made a difference in the lives of our\npeople, providing a culture of learning and collaboration, and helping them\nwith what they need to succeed and thrive. We have their backs as they grow\ntheir skills, conquer new challenges, or even take time to spend with their\nfamily or community. And when they’re ready to take on a new career path, we’re\nright there with them, giving them the guidance and momentum into the best\nfuture they envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we believe that the best way to back our\ncustomers is to back our people.</p>\n\n<div>&nbsp;</div>\n\n<div>The powerful backing of American Express.</div>\n\n<div>Don’t make a difference without it.</div>\n\n<div>Don’t live life without it.</div><div><br></div>\n<p style=\"margin-top:0px;margin-bottom:0px\">Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.</p><div><br></div><br>Tags: CFE-11160, CFE-12801, Handshake UNV-12520<br>ReqID: 20006515<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Jan 28, 2021,  3:57:36 PM\n    ",
        "index": 3,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "java",
            "networks",
            "virtual reality"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Campus Recruitment - 2021 Information Security Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006392?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-15T20:40:19.254Z",
        "location": {
            "city": "N/A",
            "state": "Not Available",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">This\nposition is a 10 week summer internship opportunity to demonstrate knowledge\ngained and apply it in a dynamic, high-performing Technology Risk &amp;\nInformation Security team. Responsible for assisting with activities designed\nto systematically run information security, such as security investigations,\nintelligence, assurance, and/or other project oversight, including developing\nstandard methodologies for information security standards and handling IT\ncontrols and compliance with regulatory guidance.</p><p style=\"margin-top:0px;margin-bottom:0px\"><br></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do in Information\nSecurity at American Express?</b></p>\n\n<ul type=\"disc\"><li>Security\n     Incident Response/Threat Intelligence</li><ul type=\"circle\"><li>Act as the front line of defense at American Express\n      protecting the brand, employees, assets and card members across the globe\n      against threats 24/7/365</li><li>Minimize risk of cyber attacks and focus on detection\n      and response of threats</li><li>Monitor, detect, and respond to security events and\n      incidents that affect AXP globally</li></ul><li>Infrastructure,\n     Application, and Network Security</li><ul type=\"circle\"><li>Drive risk reduction through the rapid identification\n      and remediation of vulnerabilities across the enterprise </li><li>Deliver secure network solutions that enable secure\n      operations and highly available products and services for our customers</li><li>Safeguard AXP data, customers, and brand through\n      continuous monitoring and testing of production application environments</li></ul><li>Data\n     Loss Prevention</li><ul type=\"circle\"><li>Protect our customers, partners, and colleagues from\n      the loss of sensitive information through normal business processes\n      and/or malicious actors</li><li>Monitor and block sensitive data loss where legally\n      permissible</li></ul><li>Identity\n     and Access Management/Authentication</li><ul type=\"circle\"><li>Deliver centralized Enterprise Identity and Access\n      Management products</li><li>Provide authentication, authorization, and full\n      lifecycle management capabilities</li><li>Reduce, manage, and monitor risk associated with\n      identity and access to AXP resources</li></ul><li>Cryptography/Encryption\n     Services</li><ul type=\"circle\"><li>Protect all forms of sensitive information, on all\n      platforms, resulting in protection of the Brand and information assets,\n      and regulatory compliance</li><li>Deliver cryptographic and key management solutions,\n      and manage and operate secure cryptographic platforms</li><li>Drive continuous enhancement to data protection </li></ul><li>Governance,\n     Risk, Compliance</li><ul type=\"circle\"><li>Bridge traditional boundaries between cyber and IT\n      risk and expanding partnerships with IT and the business to drive risk\n      reduction in the enterprise</li><li>Innovate Risk Management through enhancements in\n      tooling and automation of processes; expand the capabilities of\n      technology risk management</li><li>Extend risk management and control expertise beyond\n      the information security domains into IT development organizations and\n      the business</li></ul></ul>\n<br><h4>Minimum Qualifications</h4><p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>Here are the skills and experience we are looking for.&nbsp; Do these describe you?</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<div><u>Skills/Experience Needed</u></div>\n\n<ul>\n\t<li>Cyber Security education and/or experience preferred</li>\n\t<li>Strong verbal and written communication skills</li>\n\t<li>Knowledge or awareness in information security, compliance, assurance, and/or other security best practices and principles</li>\n</ul>\n\n<div>&nbsp;</div>\n\n<div><u>Educational Requirements</u></div>\n\n<ul>\n\t<li>Bachelor’s or Master's Degree in Cyber Security, Computer Science, Software Engineering, Information Systems, or other related field preferred</li>\n\t<li>Students must have a graduation date between December 2021 and June 2023</li>\n</ul>\n\n<div><b>&nbsp;</b></div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>About Us</b></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">American Express’ heritage was built on service and has been sustained by innovation. Through our evolution from an express mail business in 1850, to one of the world’s largest card issuers by purchasing volume and a digital innovator, we’ve never been afraid to explore new possibilities and embrace the changing marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">From our high employee Satisfaction ratings to our many workplace awards, American Express is consistently recognized as a great place to work by people around the world. We offer talented individuals challenging work with purpose by embracing both innovation and tradition. &nbsp;As our company has grown and evolved, sometimes reinventing our business outright, we have never strayed from the customer-service ethos and values on which the company was built –trust, security, integrity, quality, good citizenship, respect and customer commitment. </p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Learn more about our Information Security group at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>Apply now!</b></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Learn more about American Express by visiting <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">With a job at American Express, almost anything is possible.&nbsp; Apply now!</p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">&nbsp;</p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Our application deadline is&nbsp;November 15th and our team will review completed applications on a rolling basis. We appreciate your patience while we consider your application and will be in contact with you by April 30<sup>th</sup>.&nbsp; </p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorships for these positions.</p><br>Tags: CFE-11160, USTech, Handshake UNV-12520, CFE-12801<br>ReqID: 20006392<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 18, 2020, 11:28:01 AM\n    ",
        "index": 4,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "networks",
            "machine learning"
        ],
        "due": "2021-11-15T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Campus Recruitment – 2021 Infrastructure Engineer Summer Internship, Global Infrastructure & Digital Workplace Technology – Mainframe Systems",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006827?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-15T20:40:21.142Z",
        "location": {
            "city": "N/A",
            "state": "Not Available",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top: 0px; margin-bottom: 0px;\"><b>Don’t\nJust Build Tech. Change Tech</b>,</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Innovation is at the heart of\neverything we do. Every day, our technologists enable our customers around the\nglobe to achieve their goals. They design and deliver American Express\ninfrastructure and applications across all markets and business units. To meet\nthese demands, we’re looking for problem solvers who can drive results through\nprecise analysis and programming methodologies, individuals with a strong\nintellectual curiosity and a passion for innovation, and team players who can\nconvert their ideas into execution.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><b>Technology opportunities are available\nin</b></p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Ft.\nLauderdale, FL </p>\n\n<div>&nbsp;</div>\n\n<div><b>Description</b></div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Global Infrastructure &amp; Digital\nWorkplace Technology – Mainframe Systems is responsible for enterprise\ntechnology infrastructure including mainframe, enterprise utilities, security\ninfrastructure, database operations, and 3rd party hosting.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">The Infrastructure Engineer\nwill assist with the engineering and design of critical American Express\nmainframe applications and infrastructure in conjunction with troubleshooting,\ntuning and debugging of applications and databases utilizing the mainframe\nplatform. The Infrastructure Engineer will report directly to the Global\nInfrastructure &amp; Digital Workplace Technology – Mainframe Systems Director\nof Architecture and Engineering, or the Director of Mainframe Infrastructure\nOperations, or the Director of Mainframe Application Services.</p>\n\n<div>&nbsp;</div>\n\n<div><u>Responsibilities</u></div>\n\n<ul><li>Assist with\nengineering of large/complex projects with a variety of components and\nintegration points </li><li>Actively\nmodernize platforms and applications using current agile practices (dev/ops)</li><li>Interact\nwith business and vendor partners to better understand their objectives,\ntechnical landscape and/or how to identify and solve complex problems/issues </li><li>Interact\nwith Infrastructure and Application Engineers and Architects to exploit modern\nmainframe technologies such as, Java, Encryption, Sysplex, Hybrid Cloud, High\nAvailability, Active/Active and mainframe networking</li><li>Partner with\nEngineers to define solution requirements, perform coding and/or hands-on\ntechnical implementation</li><li>Assist with infrastructure\nperformance and security assessments</li><li>Assist with\ninternal analysis and support to ensure proper escalation during outages or\nperiods of degraded system performance</li><li>Participate\nin brainstorming and discovery exercises to determine new technologies based on\nresearch, proof of concept efforts and independent investigation</li><li>Ensure\nengineering is consistent with enterprise engineering standards, guidelines and\nprinciples</li><li>Participate\nin team architecture and engineering discussions and forums</li><li>Employ\ntechnical expertise to help team members overcome technical problems during\nproduction outages and solution delivery</li><li>Ensure compliance\nwith technical, architectural, regulatory, and strategic standards, policies,\nand procedures</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\"><u>Qualifications</u></p>\n\n<ul>\n\t<li>Must earn a Bachelor’s or Master’s degree in Computer Science, Computer Engineering, or related field between December 2021 and June 2022</li>\n\t<li>Knowledge or willingness to learn modern mainframe technologies on z-platforms such as Java, Encryption, Sysplex, Hybrid Cloud, High Availability, Active/Active and Mainframe Networking </li>\n\t<li>Excellent verbal and written communication skills with the ability to adapt a message to the appropriate audience</li>\n\t<li>Strong strategic thinking, problem solving, data analysis, and decision-making skills</li>\n\t<li>Experience with design and implementation strategies of mainframe and distributed applications</li>\n</ul>\n\n<div>&nbsp;</div>\n\n<h3><b>Life at American Express</b></h3>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">American Express is known for backing our customers to help them achieve their goals and dreams, both big and small. At American Express, we’re changing the way people live and work through meaningful projects with real-world impact. When you join our team you can make a difference by improving the everyday lives of customers around the world. </p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Growing great leaders is one of the things that sets American Express apart. Every employee has the opportunity—and is encouraged—to take their personal leadership to the next level through a wide variety of leadership and learning programs.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Our employees and their families feel supported at every stage of their lives. We provide resources and benefits that help support their physical, financial and emotional well-being, such as our award-winning global corporate wellness program, Healthy Living, and many others including: 20 weeks of Paid Parental Leave (to be eligible, employees must complete at least one year of continuous service immediately prior to the birth or placement of the child), Health (dental and vision) and Life Insurance, Tuition Reimbursement, 401k with match. Some of our roles even offer flexible work arrangements so you can work how it makes sense for you.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Creating an inclusive culture is both a part of who we are and what we do together. We value and embrace the diversity of thought, backgrounds and experiences of all our employees. Through our 15 Colleague Networks, participants can broaden their associations with other employees while expanding their knowledge of the business. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\"><b>Why American Express?</b></p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">There’s a difference between having a job and making a difference.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">American Express has been making a difference in people’s lives for over 160 years, backing them in moments big and small, granting access, tools, and resources to take on their biggest challenges and reap the greatest rewards.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">We’ve also made a difference in the lives of our people, providing a culture of learning and collaboration, and helping them with what they need to succeed and thrive. We have their backs as they grow their skills, conquer new challenges, or even take time to spend with their family or community. And when they’re ready to take on a new career path, we’re right there with them, giving them guidance and support.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Because we believe that the best way to back our customers is to back our people.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">The powerful backing of American Express.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Don’t make a difference without it.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Don’t live life without it.</p>\n\n<div>&nbsp;</div>\n\n<div><span style=\"line-height: 107%;      \">Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.</span></div>\n\n<div>&nbsp;\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">&nbsp;</p>\n </div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">Learn more about our opportunities at American Express by visiting <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a>.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family: Arial\">&nbsp;</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">&nbsp;</p>\n\n<p style=\"font-family: Arial\">&nbsp;</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;font-family: Arial\">&nbsp;</p>\n<br>Tags: USTech, Handshake UNV-12520<br>ReqID: 20006827<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Dec  3, 2020,  8:55:04 AM\n    ",
        "index": 5,
        "skills": [
            "java",
            "information technology",
            "networks",
            "software engineering",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]