[
    {
        "url": "https://jobs.apple.com/en-us/details/200180413/software-engineering-internship?team=STDNT",
        "position": "Software Engineering Internship",
        "posted": "Jul 17, 2020",
        "lastScraped": "2020-10-12T01:56:54.313Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"176\">Backend Development - You will be making the features that our users love (like Siri) work by communicating data to the user-facing applications. Backend development opportunities are available for students in the following areas: \n\nSiri, iCloud, Apple Maps, Core OS, OS X, Frameworks and Applications, Interactive Media Group, Audio/Video Software Integration and Localization, Advanced Computation, iLife, iWorks, Aperture, Pro Apps, iTunes, Security, Site Reliability Engineering (SRE) and Platform Infrastructure Engineering (PIE)\n\nCore OS - You want to be at the heart of Apple's Software organization. The Core OS team is responsible for the design and development of core technologies that are deployed across all Apple product areas including the iPhone, iPad, Watch, MacBook, iMac, Apple TV, and audio accessories. (Yes, that's pretty much everything.)\n\nSpecifically, the opportunity in CoreOS is in the sensor technology area. By integrating motion, optical, and other sophisticated sensing hardware to Apple's products, we are now able to build innovative features that are truly adaptive to the user and environment. \n\nWeb Development - You will help build web-based tools and applications to improve our products and do more for our customers. Our developers are responsible for crafting the direction of our products by considering the architecture, performance, testing, design, and implementation. And of course we look for engineers that use our products. \n\nEngineers here work on both UI level and lower-level implementation details. The successful intern candidate will be amenable to working in a dynamic, collaborative environment. The person filling this position must be a hands-on, enthusiastic, self-motivated developer with strong initiative and desire to succeed in a challenging environment. You will have a real passion for extraordinary user experiences and an eye for details. Those applying for the Web Development intern position should include a link to a web portfolio.</span>",
        "skills": [
            "software engineering",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180404/hardware-technology-internship?team=STDNT",
        "position": "Hardware Technology Internship",
        "posted": "Oct 7, 2020",
        "lastScraped": "2020-10-12T01:56:55.506Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"162\">As an intern, you will work on real challenges the team faces as well as upcoming products. To be successful in this position, you have a strong technical foundation, are able to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. You are motivated and prepared to work independently.</span>",
        "skills": [
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180397/product-design-internship?team=STDNT",
        "position": "Product Design Internship",
        "posted": "Jul 17, 2020",
        "lastScraped": "2020-10-12T01:56:57.148Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"182\">As a member of a multi-functional design team at Apple, you will help to create the next generation of the world's finest hardware devices. You will conceive, design, and bring into production products that will re-define user experience. You will work closely with many different multi-functional teams including Industrial Design, Packaging, Safety, Hardware Engineering, EMC, and Marketing.</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180414/engineering-program-management-internship?team=STDNT",
        "position": "Engineering Program Management Internship",
        "posted": "Jul 17, 2020",
        "lastScraped": "2020-10-12T01:56:59.035Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">-  Define project plans and schedules. Drive project execution.\n\n-  Lead internal and external multi-functional teams in engineering and validation activities\n\n-  Ensure tight inter-team coordination and communication\n\n-  Strong presentation and communication skills required\n\n-  Understand and communicate sophisticated, technical/Engineering issues\n\n-  Identify and resolve conflicts, inter-dependencies and program issues quickly and efficiently\n\n-  Lead development budgets and engineering builds</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180409/machine-learning-ai-internship?team=STDNT",
        "position": "Machine Learning / AI Internship",
        "posted": "Oct 7, 2020",
        "lastScraped": "2020-10-12T01:57:00.025Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"172\">You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>",
        "skills": [
            "artificial intelligence",
            "machine learning"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180420/business-marketing-and-g-a-internships?team=STDNT",
        "position": "Business, Marketing, and G&A Internships",
        "posted": "Jul 17, 2020",
        "lastScraped": "2020-10-12T01:57:01.233Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"168\">Within Apple, these teams support various lines of business with a mixture of non-technical and technical roles. The people here are a unique mix of backgrounds, experiences, and skills. The teams here are full of dynamic and full of incredibly smart, hardworking, and fun people passionate about technology, digital media, arts and entertainment.\n\nIf you're excited to join one of the most successful companies in the world, then we'd love to hear from you. Let’s do our best work together.\n\nAs an intern, you will learn, grow, and contribute to Apple’s business while working on exciting projects alongside top professionals. \n\nWe truly believe that at Apple, you will do your life’s best work.\n\nInternships are based in SCV and Culver City. \n\nINTERNSHIP OPPORTUNITIES ARE AVAILABLE WITHIN THE FOLLOWING AREAS:\n-  Finance\n\n-  Legal\n\n-  Wellness\n\n-  Environment, Policy, &amp; Social Initiatives\n\n-  Marketing\n\n-  Business \n\n-  Creative</span>",
        "skills": [
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180406/operations-manufacturing-design-engineer-internship?team=STDNT",
        "position": "Operations, Manufacturing Design Engineer Internship",
        "posted": "Jul 10, 2020",
        "lastScraped": "2020-10-12T01:57:02.798Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"170\">Areas of expertise within Manufacturing Design include:\n\n\nMANUFACTURING DESIGN ENGINEER\nAs an MDE, you will handle selection, implementation &amp; optimization of manufacturing processes for mechanical enclosure subassemblies for our legendary products. \n\n-  Utilize Mechanical Engineering experience and work cross functionally with Product Design Engineering and Industrial Design \n\n-  Assess product features for manufacturability, and recommend capable processes and equipment.\n\n-  Developing new manufacturing processes to enable future product design and conducting DOEs to validate process capability. \n\n-  Work with Global Supplier Managers to identify capable suppliers, assess their secondary processes for capacity, quality and cost.\n\n-  Work with suppliers to define and refine mechanical tooling, fixtures and establish capability / readiness. \n\n-  Audit supplier processes and assembly processes and support product phase builds from EVT, DVT PVT and ramp. \n\n-  Assist post production quality / cost improvement activity related to fixtures and processes.\n\n\nMANUFACTURING QUALITY ENGINEER\nAs an MQE, you will utilize Engineering, Factory Management &amp; Supply Chain skills in developing and implementing high efficiency inspection equipment, groundbreaking quality systems and ultimately the best products available.\n\n-  Help lead the creation of state of the art inspection &amp; measurement equipment for Apple product.\n\n-  Apply your understanding of quality control and manufacturing concepts to lead the development of specific Product Quality Plans (PQP) appropriate to program and commodity.\n\n-  Provide technical direction and mentorship to other Quality Engineers supporting the implementation of the PQP.\n\n-  Identify and direct studies to implement improvements in measuring method where appropriate.\n\n-  Coordinate Quality Engineering functions for multiple programs in the product category. \n\n-  Collaborate with internal and external groups to ensure accurate definition of quality expectations and appropriate assurance techniques are used for the product.\n\n-  Supplier Quality Management - Assist in supplier selection process for new products and sourcing activities. Assess supplier production control and quality programs, identify shortfalls to expectations, and directly secure agreement to correct. Supervise each supplier's performance through measurement of production line statistics, company inspections, and audits.\n\n\nSUBJECT MATTER AUTHORITY\nOur SME's investigate and develop solutions to overcome difficult technical challenges that require non-standard manufacturing approaches. Apply your engineering skills to develop an in depth understanding of the process drivers that will drive successful implementation of significant improvements to mechanical enclosures. \n\nThe following activities fall within the scope of responsibilities:\n\n-  Assess mechanical designs and relate design goals to process, equipment, and material requirements to evaluate a set of options to tackle difficult manufacturing problems.\n\n-  Research manufacturing processes and evaluate them for potential to achieve technical goals. \n\n-  Plan and execute development trials to test feasibility, optimize process inputs, and validate capabilities of process options. \n\n-  Present analysis to key decision makers used to make significant commercial and design commitments.</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200191482/mba-internships-summer-2021?team=STDNT",
        "position": "MBA Internships - Summer 2021",
        "posted": "Oct 7, 2020",
        "lastScraped": "2020-10-12T01:57:03.828Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"168\">APPLECARE\nContact Center Operations: Optimizes the latest technologies and strategies to support the business and operational needs with tactical support to provide Apple customers. Monitor service level and contact center volumes as well as direct strategic Apple care business goals.\n\nField Service Channel Manager: Ensures high customer satisfaction and lowers operational cost by reengineering processes and policies. Influence Apple Authorized Service Providers and mobile carriers to craft premium service programs that support business objectives and Apple’s customers worldwide. \n\nGlobal Repair Center: Lead the operations of the growing network of Apple repair centers around the world in the rapidly growing AppleCare reverse supply chain to handle complex repairs.\n\nOnline/Digital Support &amp; Service: Crafts compelling digital content solutions to improve the Apple customer experience, support the Advisor population to develop solutions to answer customer questions, inspire learning, and connect customers to the repair with assisted support. Brings innovative self-solve learning solutions to customers on the web, through an application on a device, on social platforms, search optimization, and machine learning. \n\nProcurement: Manages AppleCare’s OEM supplier’s relationship, sourcing optimization, early engagement for repair strategy development, post-production planning including costs, continuity of supply, and capacity planning activities. \n\nReporting &amp; Analytics: Harnesses the vast amount of data relating to AppleCare’s business to make strategic recommendations and share insights about ongoing operations. Translating business needs into analytical requirements using advanced quantitative analysis. \n\nSupply Chain Management: Build and run AppleCare’s Global Reverse Supply Chains, through optimization of forecasting. Analyze and calculate new buy planning, repair planning, inventory management, purchasing, warranty redemption, and project management. \n\n\nPRODUCT OPERATIONS/MANUFACTURING DESIGN\n\nOperations Program Manager: \nAs an OPM, you will work with our New Product Introduction (\"NPI\") or Sustaining Operations teams on component &amp; ramp readiness, product launch &amp; ramp, or sustaining operations through ‘end of life’ programs. Run the product manufacturability, testability, and supply chain responsiveness in pursuit of low cost and maximum flexibility while stewarding the highest standards of product quality expected of Apple's products.\n\nA successful OPM excels in program/project management; communicates with ease at all levels; is adept at facilitating actions and resolving conflicts; manages through relationships and influence; and brings calm and control to even the highest-intensity projects. \n\nManufacturing Design - Global Supply Manager:\nResponsible for the commercial relationship with our enclosure manufacturing partners and for cost negotiations, risk management, driving operational and cost efficiencies through process or design change, as well overall project execution. You sit at the intersection of Apple's business activities and engineering communities, and optimally and effectively balance the needs of both groups to ensure successful product launches.\n\nEnclosure components (such as the housing, cover glass, and buttons) define the look, feel, and expression of Apple’s globally-recognized industrial and product design. GSMs work in concert with operations supply quality and base engineers as well as Apple’s Product Design and Industrial Design teams. Together, these teams execute and scale both new and existing manufacturing processes, materials, technologies, finishes, and form factors.\n\n\nSTRATEGIC SOURCING\n\nGlobal Supply Manager: \nYou will interface between Apple and the industries that supply core component technologies. In this role, you are responsible for developing and executing sourcing strategies as well as recommending product innovations based on improving technology. This position requires an interest in market dynamics and competitive behavior, negotiation and pricing, manufacturing processes, and risk mitigation. \n\n\nSUPPLY CHAIN OPERATIONS\n\nSupply Demand Management (role: Supply Demand Planner): \nIn SDM, you will hold a critical role in Apple's multi-billion dollar supply chain decisions by forecasting product demand, analyzing production needs, allocating global supply across all channels of distribution and influencing quarterly sales projections used in guidance to Wall Street. Your job will require you to collaborate and influence across many key groups within Apple (Marketing, Sales, Finance, Procurement, Ops, Materials), all in an effort to both set the strategy and drive the execution of products across Apple’s global supply chain.\n\nBusiness Process Re-engineering (role: BPR Project Manager): \nIn BPR, you will lead complex, global initiatives to define, build, and roll out innovative technology and business process solutions that increase efficiencies, improve customer satisfaction, and challenge the status quo. You will define and build capabilities that provide deep business insight, enable rapid decision-making, and drive automation of evolving business processes.\n\n\nPRODUCT MARKETING\n\nAs a member of our Product Marketing group, you’ll shepherd a product’s positioning from concept through development and launch, to give it the best chance of success in the market. You’ll apply customer insights to help infuse ideas for groundbreaking features into our product-development process. Together with our team, you’ll work to craft groundbreaking ideas into tangible products that excite the world. \n\nAt Apple, we combine product development and product marketing responsibilities into a single, cross functional Product Management role that collaborates with design, engineering, finance, legal, marketing communications, public relations, market research, sales and support for maximum impact across the organization.\n\n\nCORPORATE RETAIL\n\nAre you passionate about the customer experience? The Apple Retail corporate team cares deeply about building and delivering the best customer experience in the world. We are one of the largest retailers with a global e-commerce footprint in 36 countries and more than 450 Apple Retail Store locations in 17 countries. We craft the strategies, drive the initiatives, execute the programs, and develop the technologies that bring Apple products to more than 4.5 million visitors every single day. A few extraordinary interns will get to help plan what's next.\n\nTarget Areas\n-  Central Operations\n-  E-Commerce\n-  Marketing\n-  Merchandising\n-  Planning &amp; Technology\n-  Sales &amp; Service\n-  User Experience</span>",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200172751/finance-development-program-fdp-internship?team=STDNT",
        "position": "Finance Development Program (FDP) Internship",
        "posted": "Jul 2, 2020",
        "lastScraped": "2020-10-12T01:57:05.312Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"164\">As a Finance intern, you’ll support a specific area of Apple’s business, such as: \nAppleCare, Financial Services, Internet Software &amp; Services, Marketing, Operations, R&amp;D, Retail, Sales, Worldwide Financial Planning &amp; Analysis, and more. \n\nDuring the summer, you could: \nAnalyze financial performance by highlighting trends and anomalies\nStreamline reporting through the use of databases such as Tableau or with Excel macros\nPartner with cross functional groups and business partners to analyze the business\nProvide insights and recommendations for operational improvements and innovations\nAssist with close procedures\n\nAfter completing a summer internship in Cupertino, successful Finance interns will be eligible for an offer into Apple’s highly desirable Finance Development Program (FDP). The FDP is a two-year rotational program providing entry-level talent with an opportunity to gain breadth through typically six to eight diverse experiences in Apple Finance in Cupertino, CA. Upon completion, FDPs move into non-rotating Financial Analyst roles within Apple.</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200180400/hardware-hardware-products-hardware-engineering-internship?team=STDNT",
        "position": "Hardware, Hardware Products, Hardware Engineering Internship",
        "posted": "Jul 17, 2020",
        "lastScraped": "2020-10-12T01:57:06.275Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"172\">Some responsibilities in Hardware Engineering may include: \n\n-  Engineering Program Management: Identifying, evaluating and driving engineering/quality improvements/new supplier qualifications)\n\n-  Touch/Displays Engineering: Optics, Flat Panel/HW, Touch Mechanical Design. Design &amp; Execute experiments validating new materials (optical, mechanical); Optimize design for performance and reliability\n\n-  Wireless Technologies: Antenna Design, RF System Level Validation, Automated Software/Tool Dev, Optimization of RF Automated Systems, RF Sys Analysis\n\n-  ASIC / VLSI: RTL Design &amp; Implementation, Verification, Integration, Validation, Emulation, Power/Tech &amp; Circuits, CAD, STA, Physical Design, Low Power Design, Signal Integrity, Analog/Mixed Signal, LDV/HDV, DFT\n\n-  Embedded/Systems Development: Electrical System Design and Integration, System-Level Testing Support, Schematic Capture, Bug Resolution\n\n-  Audio/Acoustics/Optical Production Testing and Mechanical Test Design\n\n-  Human Interface Devices: Firmware Eng, Low-Level Microcontroller Code Dev, Prototyping concepts, design verification (FPGA), Streamline Electrical Design\n\n-  Firmware Development: Writing/Debugging Low level firmware, drivers, protocols and other firmware code, developing embedded firmware solutions</span>",
        "skills": [
            "software engineering",
            "information technology",
            "cybersecurity"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200181450/machine-learning-ai-engineering-research-internship-interspeech-2020?team=MLAI",
        "position": "Machine Learning / AI - Engineering & Research Internship (Interspeech 2020)",
        "posted": "Oct 8, 2020",
        "lastScraped": "2020-10-12T01:57:07.228Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"170\">You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>",
        "skills": [
            "artificial intelligence",
            "machine learning",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200189275/ios-application-developer-contacts?team=SFTWR",
        "position": "iOS Application Developer- Contacts",
        "posted": "Sep 4, 2020",
        "lastScraped": "2020-10-12T01:57:08.688Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">Contacts is a critical building block for applications used by millions of consumers to organize their time and their communication. The Contacts team offers engineers a chance to work on network synchronization, data consistency, and building new APIs used by thousands of other applications. \n\nWe would love to find candidates with experience directly relating to software for contacts, but our top priority is finding good engineers with passion and dedication to creating great applications. You will join a hands-on development team that fosters creativity and generates novel solutions to deliver engineering excellence. We partner with a variety of cross and multi-functional team members from a diverse array of groups across the company \n\nAre you deeply accountable for your work? Your passion for product ownership and track record of product development will prove critical to your success on our team. You will prioritize tasks with rapid development cycles, remain flexible and calm in the face of uncertainty, and drive vendors to deliver excellent results for time-critical issues. \n\nBe ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. \n\nYou should join the Apple Contacts Team if you want to help deliver the next amazing Apple product. You have excellent judgment and integrity with the ability to make timely and sound decisions Excellent writing and interpersonal skills Thorough knowledge of macOS and iOS is helpful Ability to stay focused and prioritize a heavy workload while achieving exceptional quality You are upbeat, adaptable, and results oriented with a positive attitude You bring passion and dedication to your job and are committed to our vision and supporting the developer community</span>",
        "skills": [
            "software engineering",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193053/hardware-engineer-entry-level-san-diego?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (San Diego)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:09.632Z",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200186228/hardware-engineer-entry-level-cupertino?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Cupertino)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:10.934Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200012993/chip-level-vlsi-pd-cad-engineer?team=HRDWR",
        "position": "Chip Level VLSI PD CAD Engineer",
        "posted": "Jun 18, 2020",
        "lastScraped": "2020-10-12T01:57:11.928Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"164\">-  Provide innovative solutions to improve area, power, performance of chip level VLSI designs. \n-  Develop algorithm and GUI that uniquely addresses design challenges at Apple. \n-  Provide documentation, training and new user support. \n-  Responsible for flow regression, and code release for multiple projects/sites.</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200007574/apple-industrial-design-accepting-portfolios?team=DESGN",
        "position": "Apple Industrial Design Accepting Portfolios",
        "posted": "Feb 26, 2020",
        "lastScraped": "2020-10-12T01:57:13.328Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"170\">To apply, please direct a CV and concise PDF portfolio to:  idportfolios@apple.com</span>",
        "skills": [],
        "company": "N/A",
        "contact": "idportfolios@apple.com",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200187307/ai-ml-residency-program?team=MLAI",
        "position": "AI/ML Residency Program",
        "posted": "Aug 27, 2020",
        "lastScraped": "2020-10-12T01:57:14.286Z",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "description": "<span data-reactid=\"156\">Apple’s AI/ML residency is a year long program inviting experts in various fields to apply their own domain expertise to build revolutionary machine learning and AI empowered products and experiences. The residency will begin with several weeks of coursework focused on machine learning and deep learning, followed by a project with one of our global machine learning teams. Apple AI/ML residents will be matched with a machine learning research/engineering mentor, and will contribute to their team’s research, product design, and development. Some residents may also have the opportunity to publish and present their work at premiere academic conferences.</span>",
        "skills": [
            "machine learning",
            "artificial intelligence",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193056/hardware-engineer-entry-level-florida-orlando-melbourne?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Florida - Orlando / Melbourne)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:15.213Z",
        "location": {
            "city": "Orlando",
            "state": "Florida"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193302/manufacturing-quality-engineer-intern-acoustic-thermal-modules?team=OPMFG",
        "position": "Manufacturing Quality Engineer Intern - Acoustic/Thermal Modules",
        "posted": "Oct 8, 2020",
        "lastScraped": "2020-10-12T01:57:16.234Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"168\">-  Work on innovation projects which can take the quality of Apple products to the next level\n\n-  Develop data dashboards for visualizing key manufacturing data using software programming skills\n\n-  Utilize Digital Signal Processing tools to analyze Noise and Vibration data to setup quality control screening \n\n-  Review 2-dimensional engineering drawings and collaborate with product design team to ensure dimensional callous are per GD&amp;T standards and are measurement feasible\n\n-  Review tolerance stack-up analysis with product design team\n\n-  Develop metrology for dimensions/cosmetics/electrical test, design gauges, measurement fixtures and drive their qualifications through MSA\n\n-  Drive FAI/Cpk data collection with vendors and verify the data integrity \n\n-  Conduct yield gap analysis and lead review with cross-functional teams on development of their corrective actions via process improvements, design or tolerance changes or screening parts with statistical analysis and data driven approach\n\n-  Develop reliability test method on part level and ensure the test/design objectives are met\n\n-  Develop IQC, IPQC, OQC plan and ensure parts ship per Quality/Product Design/Industrial Design requirement for both dimensional and cosmetic criteria for each NPI engineering build and in MP\n\n-  Lead IQC and OQC alignment and ensure measurement correlation between vendors \n\n-  Responsible for driving failure analysis and corrective actions on quality issues\n\n-  Drive vendor and work with cross functional team to meet yield targets in engineering builds and in ramp \n\n-  Provide technical direction and guidance to vendor quality engineer, develops supplier capability (including necessary training), establish proper reporting of in-process and final inspection, test results, yields and top issues results to Apple\n\n-  Present/update to operations and design team executives on top issues and progress on yield targets on regular basis\n\n-  International Travel may be required</span>",
        "skills": [
            "software engineering",
            "data visualization"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193055/hardware-engineer-entry-level-boston?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Boston)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:17.256Z",
        "location": {
            "city": "Boston",
            "state": "Massachusetts"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193051/hardware-engineer-entry-level-portland?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Portland)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:19.874Z",
        "location": {
            "city": "Portland",
            "state": "Oregon"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193049/hardware-engineer-entry-level-austin?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Austin)",
        "posted": "Sep 20, 2020",
        "lastScraped": "2020-10-12T01:57:20.953Z",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "description": "<span data-reactid=\"160\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "skills": [
            "software engineering",
            "python",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200175569/ai-ml-residency-program?team=MLAI",
        "position": "AI/ML Residency Program",
        "posted": "Aug 27, 2020",
        "lastScraped": "2020-10-12T01:57:21.875Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"156\">Apple’s AI/ML residency is a year long program inviting experts in various fields to apply their own domain expertise to build revolutionary machine learning and AI empowered products and experiences. The residency will begin with several weeks of coursework focused on machine learning and deep learning, followed by a project with one of our global machine learning teams. Apple AI/ML residents will be matched with a machine learning research/engineering mentor, and will contribute to their team’s research, product design, and development. Some residents may also have the opportunity to publish and present their work at premiere academic conferences.</span>",
        "skills": [
            "machine learning",
            "artificial intelligence",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200191221/product-design-engineer-interconnect?team=HRDWR",
        "position": "Product Design Engineer - Interconnect",
        "posted": "Sep 14, 2020",
        "lastScraped": "2020-10-12T01:57:23.279Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"174\">The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple TV, as well as the first three generations of Apple Watch. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us to help deliver the next groundbreaking Apple product.</span>",
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200197695/subject-matter-expert-intern-automation?team=OPMFG",
        "position": "Subject Matter Expert Intern - Automation",
        "posted": "Oct 7, 2020",
        "lastScraped": "2020-10-12T01:57:24.395Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"168\">Drive automation activities for stringent enclosure and module manufacturing processes as part of Manufacturing Design’s Automation SME team. Work with integrators, suppliers, contract manufacturers, and internal partners to develop advanced automation capabilities and implement them in the supply chain to exacting standards on aggressive project timelines.</span>",
        "skills": [],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200197366/physical-chemical-vapor-deposition-pvd-intern?team=OPMFG",
        "position": "Physical/Chemical Vapor Deposition (PVD) Intern",
        "posted": "Oct 7, 2020",
        "lastScraped": "2020-10-12T01:57:25.341Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"166\">-  Work with Apple’s Industrial Design and Product Design teams to build working specifications related to coating processes\n\n-  Collaborate with premier equipment and process manufacturing partners to create next-generation processes and test limits of process capabilities\n\n-  Determine feasibility to achieve aggressive goals evaluating manufacturing processes at early stages of product development\n\n-  Plan and execute studies to confirm process capability to achieve technical goals for high volume programs\n\n-  Present analysis to key decision makers that will be used to make commercial and design commitments \n\n-  Work directly with overseas manufacturers implementing solutions meeting high-volume commercial goals</span>",
        "skills": [],
        "company": "N/A",
        "remote": false
    }
]