[
    {
        "url": "https://www.coolworks.com/san-juan-island-outfitters/highlighted-job/38369-expedition-guide",
        "position": "Expedition Guide",
        "company": "SAN JUAN ISLAND OUTFITTERS",
        "contact": "emily@sanjuanislandoutfitters.com",
        "posted": "DEC 04, 2020",
        "lastScraped": "2020-12-07T03:45:08.464Z",
        "location": {
            "city": "Friday Harbor",
            "state": "Washington"
        },
        "description": "<p>San Juan Outfitters&nbsp;is a family-owned and operated&nbsp;company based in Friday Harbor, Washington&nbsp;on beautiful San Juan Island.&nbsp;&nbsp;We specialize&nbsp;in guided sea kayaking&nbsp;expeditions, multi-day bicycling and multi-sport trips,&nbsp;wilderness&nbsp;backpacking trips, and guided hiking and camping tours.&nbsp;On all tours, an emphasis is always placed on safety, guest service, and respecting the environment. Our goal is to provide a personal, inspiring and educational experience to each of our guests to foster a sense of connection with&nbsp;our unique&nbsp;Pacific Northwest&nbsp;ecosystems. Our hope is that our guests will return home with lifelong memories and a new appreciation for the environment.&nbsp;</p>\n\n<p>Guides can expect to&nbsp;lead&nbsp;trips in the Olympic Peninsula, the Cascade Mountains, Mt. Rainier, San Juan Islands, and the Canadian&nbsp;Gulf Islands.&nbsp; Our paid training&nbsp;will help you get acquainted with these areas as well as&nbsp;operational goals on&nbsp;various itineraries.&nbsp;&nbsp;From&nbsp;3hr kayak trips to 7-day biking expeditions, you could be backpacking the Olympic Mountains&nbsp;one week and leading an outer island kayak trip the next.&nbsp; Our season runs from mid-late May to mid-September 2021.</p>\n\n<p>Expedition guides are expected to lead&nbsp;professional,&nbsp;informative&nbsp;tours in a variety of environments in potentially challenging conditions. Guides are involved in all expedition logistics including route planning, food preparation&nbsp;and&nbsp;equipment in addition to educating guests about local flora/fauna, geology, and natural history.&nbsp;Guides must be outgoing, with excellent communication skills, solid risk management and decision-making skills,&nbsp;and be able to thrive in group environments&nbsp;and&nbsp;exhibit a&nbsp;positive attitude.&nbsp;&nbsp;</p>\n\n<p><strong>Qualifications:&nbsp;</strong></p>\n\n<ul>\n\t<li>First Aid &amp; CPR/AED&nbsp;or higher - prefer WFA or WFR Certifications</li>\n\t<li>Washington State Food Handler’s Card&nbsp;(available online)&nbsp;</li>\n\t<li>Must be on&nbsp;San Juan&nbsp;Island no later than first training date TBD in mid-late May</li>\n\t<li>Working cell phone</li>\n</ul>\n\n<p><strong>Preferred Skills:&nbsp;</strong></p>\n\n<ul>\n\t<li>Education background: outdoor education, environmental education, recreation, biology, natural resource management, earth sciences or related field&nbsp;</li>\n\t<li>The confidence/ability to teach one or more of our activities (kayaking, backpacking, natural history, biking, camping)&nbsp;</li>\n\t<li>Catering/restaurant/kitchen experience&nbsp;</li>\n\t<li>Experience driving&nbsp;fifteen-passenger vans and/or trailers&nbsp;</li>\n\t<li>Ability to communicate clearly and effectively to guests and co-workers&nbsp;</li>\n\t<li>Good physical fitness: ability to lift 50lbs comfortably&nbsp;and walk on uneven terrain&nbsp;</li>\n\t<li>Leadership experience&nbsp;</li>\n</ul>\n\n<p><strong>Compensation:&nbsp;</strong></p>\n\n<ul>\n\t<li>\n\t<p>Competitive wage DOE&nbsp;</p>\n\t</li>\n</ul>\n\n<p><strong>Training:&nbsp;</strong></p>\n\n<ul>\n\t<li>\n\t<p>Provided training exceeds industry standards&nbsp;</p>\n\t</li>\n</ul>\n\n<p><strong>Benefits:&nbsp;</strong></p>\n\n<ul>\n\t<li>Opportunity to use the equipment and attend tours&nbsp;on an available basis&nbsp;</li>\n\t<li>Pro-deal access&nbsp;</li>\n\t<li>Opportunity to expand skill-sets across disciplines and a multitude of ecosystem types&nbsp;</li>\n\t<li>Assistance in securing housing&nbsp;</li>\n\t<li>A like-minded, fun, dynamic workplace with the best office views in the world&nbsp;</li>\n</ul>",
        "index": 1,
        "skills": [
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "url": "https://www.coolworks.com/great-basin-institute/highlighted-job/38356-restoration-crew-member-northern-nv",
        "position": "Restoration Crew Member (Northern NV)",
        "company": "GREAT BASIN INSTITUTE",
        "contact": "chughes@thegreatbasininstitute.org",
        "posted": "DEC 03, 2020",
        "lastScraped": "2020-12-07T03:45:09.433Z",
        "location": {
            "city": "Reno",
            "state": "Nevada"
        },
        "description": "<p><strong>The Service Experience:&nbsp;</strong><br>\nSpend a season or more working and camping outside at some of Nevada’s premier natural areas. Serve alongside volunteers from across the country while making a lasting contribution to Nevada’s natural resources and heritage. Gain valuable field experience while working on habitat improvement, restoration, and recreation projects with the U.S. Forest Service, Bureau of Land Management, National Park Service, and many other federal and state agencies. Learn firsthand from federal employees and specialists about natural resources and conservation careers.&nbsp;Projects during the spring field season will focus on restoration around Northern Nevada and may include invasive plant removal, habitat restoration, native species planting, fencing construction, and trail maintenance.&nbsp;&nbsp;<strong><a href=\"https://www.thegreatbasininstitute.org/programs/nevada-conservation-corps/ncc-services/\" class=\"popup\">Find more information on projects here!</a></strong></p>\n\n<p><strong>Essential Duties:</strong><br>\n• Camping up to seven nights in a wilderness setting without formal restroom facilities or running water;<br>\n• Maintaining a positive and professional attitude at all times while providing service;<br>\n• Communicating effectively with crew members, crew leaders, NCC staff and agency project staff;<br>\n• Complying with both production and quality work standards established by NCC&nbsp;<br>\nadministration, crew supervisors and project partners;<br>\n• Contributing to basic duties at the campsite including cooking, cleaning and organizing crew equipment;<br>\n• Showing respect when interacting with other members, leaders, staff, project sponsors and community members;<br>\n• Participating in in-field education sessions;<br>\n• Percentage of time spent on labor– 70%, traveling– 20%, hiking– 10%;<br>\n• Lifting 25lbs continuously and 50lbs occasionally.<br>\n<br>\nContract Timeline:</p>\n\n<p>This is a 675 hour AmeriCorps position.<br>\nMarch 29, 2021 - August 13, 2021<br>\n<br>\nStart dates may be flexible. Please reach out to Cassandra Hughes at <a href=\"mailto:chughes@thegreatbasininstitute.org?subject=Position%20on%20CoolWorks\">chughes@thegreatbasininstitute.org</a> to discuss your options.<br>\n<br>\nLocation: Reno, NV<br>\n<br>\nCrew members will be assigned to serve from the Reno Field Office and will serve and camp in the field on 4-day tours, 8-day tours, or a mixture of the two. Schedules will be dictated by the project site and distance from the field station. Camping locations are provided during the workweek. We will not provide housing nor sign leases, but we can help assist with identifying housing options.<br>\n<br>\nCompensation and Benefits:</p>\n\n<p>This is an AmeriCorps position; candidates will receive a living allowance dependent on their length of service. The living allowance is a fixed amount, not an hourly wage or a salary. The living allowance is paid to members in bi-weekly installments throughout their term of service. Upon completion of AmeriCorps service members shall receive an additional education award also dependent on the length of service that can be used for paying off student loans or paying tuition for a Title IV accredited college.<br>\n<br>\n•Living Allowance: approximately $680 every two weeks before taxes<br>\n•Education Award: $2,360.00<br>\n•Per Diem:$7.25/day spent in the field. This is in addition to your Living Allowance and on average is $58.00 biweekly. Crews typically combine per diem funds and shop/prepare meals as a team.<br>\n•Housing Stipend: max $450 total; this is in addition to your Living Allowance and on average is $50.00 biweekly.<br>\n<br>\n•Insurance:<br>\nLimited Health, Dental and Vision Insurance will be completely paid for at no cost to you by the Great Basin Institute.<br>\n<br>\n•Student Loan Forbearance:<br>\nIf you are currently paying on any federal student loans you have the option to put those loans into forbearance during your time as an AmeriCorps volunteer, which will allow you to cease payments while serving.<br>\n<br>\n•Interest Accrual Repayment:<br>\nAs an AmeriCorps alum, you are eligible to have the National Service Trust pay all or a portion of the interest that accumulated on your qualified student loan(s) during your term of service. These payments are made in addition to the Education Award and are not deducted from your Education Award balance. To be eligible to have accrued interest paid: The loan must have been placed in forbearance for the service period, and you must have successfully completed a term of service and received an Education Award.<br>\n<br>\n•Supplemental Nutrition Assistance Program Eligibility:<br>\nAmeriCorps Volunteers qualify for the Supplemental Nutrition Assistance Program (SNAP). The Nevada Conservation Corps will provide you documentation in proving that you qualify for SNAP.<br>\n<br>\n•Educational Affiliation Agreements (College Credit):<br>\nThe Nevada Conservation Corps will take part in Affiliation Agreements with your university in order to allow you to receive college credit hours for your term of service.<br>\n<br>\nOptional Training &amp; Education we will provide include:<br>\n• Defensive Driving Certification<br>\n• Off-Road Driving Class<br>\n• Resume Building Workshop<br>\n• Interview Skills Workshop<br>\n• Native Plant Identification<br>\n• Invasive Plant Identification<br>\n• GPS Unit Training<br>\n• Introduction to Geographic Information Systems (GIS)<br>\n<br>\nJob Qualifications:</p>\n\n<p>•Must maintain a positive and professional attitude at all times while providing service.<br>\n•Be able to communicate effectively with members, crew leaders, NCC staff, and project partners.<br>\n•Possess the willingness and ability to work and camp up to seven nights in a row, in a wilderness setting, in all weather conditions, without formal restroom facilities or running water.<br>\n•Be able to lift 25lbs continuously and 50lbs occasionally<br>\n•Be at least 17 years of age<br>\n•Be a US citizen<br>\n•Must possess a high school diploma or GED<br>\n•Must be eligible to receive an AmeriCorps Education Award (limit of four in a lifetime or the equivalent of two full-time education awards).*<br>\n•All position offers are conditional upon completion of an acceptable check of the National Sex Offender Public Registry and federal criminal background check.</p>\n\n<p>Other Job Information:</p>\n\n<p>Make a difference on the landscape, and in your life with the Nevada Conservation Corps!<br>\n<br>\nLearn from your experience like this member, who said: \"Being out here and overcoming obstacles has taught me that my limits were further than I thought. From suddenly changing plans, to long weeks of hard work, to dust and baking in the sun, to sawing with wet feet and gloves in the snow, I learned that pushing my limits wasn't as impossible as I thought, that I was capable of more. Regularly conquering what was a hardship before gave me perspective and self-confidence. I knew how I would have reacted to situations before the NCC, and I am proud to know how far I've come in a short time.\"<br>\n<br>\nAre you following Great Basin Institute on social media?&nbsp;<br>\n&nbsp;<a href=\"https://www.instagram.com/gbinstitute/?hl=en\" class=\"popup\">@gbinstitute</a>&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;<a href=\"https://www.facebook.com/GreatBasinInstitute/\" class=\"popup\">@GreatBasinInstitute&nbsp;</a>&nbsp; |&nbsp;&nbsp;&nbsp;<a href=\"https://twitter.com/gbinstitute?lang=en\" class=\"popup\">@GBInstitute</a></p>\n\n<p>EEO Statement</p>\n\n<p>We conform to all the laws, statutes, and regulations concerning equal employment opportunities and affirmative action. We strongly encourage women, minorities, individuals with disabilities and veterans to apply to all of our job openings. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, or national origin, age, disability status, Genetic Information &amp; Testing, Family &amp; Medical Leave, protected veteran status, or any other characteristic protected by law. We prohibit Retaliation against individuals who bring forth any complaint, orally or in writing, to the employer or the government, or against any individuals who assist or participate in the investigation of any complaint or otherwise oppose discrimination.</p>",
        "index": 2,
        "skills": [
            "machine learning",
            "information technology",
            "react"
        ],
        "compensation": "paid",
        "start": "2021-08-13T10:00:00.000Z",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "url": "https://www.coolworks.com/islandwood/highlighted-job/38246-graduate-student-in-education-for-environment-and-",
        "position": "Graduate Student In Education For Environment & Community",
        "company": "ISLANDWOOD",
        "contact": "kathieb@islandwood.org",
        "posted": "NOV 20, 2020",
        "lastScraped": "2020-12-07T03:45:10.310Z",
        "location": {
            "city": "Bainbridge Island",
            "state": "Washington"
        },
        "description": "<p>IslandWood's foundational graduate program in&nbsp;<a href=\"https://islandwood.org/graduate-program/\" class=\"popup\"><strong>Education for Environment &amp; Community</strong></a>, offered in partnership with the <a href=\"https://education.uw.edu/curriculum-instruction/islandwood-residency\" class=\"popup\"><em><strong>University of Washington's nationally-ranked College of Education</strong></em></a> is a 10-month teaching residency preparing culturally responsive educators capable of catalyzing community and environmental stewardship.</p>\n\n<p>Through coursework in environmental education and inclusive instruction, regular field-teaching experiences, and one-on-one mentoring, students will:</p>\n\n<ul>\n\t<li>Learn best practices in integrated, experiential, and student-centered learning</li>\n\t<li>Develop culturally responsive teaching and curriculum development skills</li>\n\t<li>Deepen an understanding of the systems and theories behind educational practices</li>\n</ul>\n\n<p>We are now accepting applications for the <strong>2021-2022</strong>&nbsp;academic year, which runs from August 17, 2021, to June 11, 2022.&nbsp; Financial aid including scholarships, service awards, and a monthly stipend are available.&nbsp; Visit our <a href=\"https://islandwood.org/graduate-program/\" class=\"popup\">website</a> to learn more.</p>",
        "index": 3,
        "skills": [
            "machine learning"
        ],
        "due": "2021-08-17T10:00:00.000Z",
        "remote": false
    },
    {
        "url": "https://www.coolworks.com/odiyan-buddhist-retreat-center/highlighted-job/38230-vegetable-gardeners",
        "position": "Vegetable Gardeners",
        "company": "ODIYAN BUDDHIST CENTER",
        "contact": "volunteer@odiyan.org",
        "posted": "NOV 17, 2020",
        "lastScraped": "2020-12-07T03:45:11.152Z",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "description": "<p><strong>Learn new skills in gardening and farming, live in a community of like-minded people, eat great&nbsp;homegrown vegetarian food, help out with cooking, landscaping and sacred art projects. You can take advantage of classes on Buddhism and yoga, participate in meditation and chanting and live in one of the most beautiful Buddhist centers in the world.&nbsp;</strong></p>\n\n<p>Seeking&nbsp;resident volunteers for a minimum of six months to work in&nbsp;vegetable gardens. You need to be strong and physically able to work with your body all day, often for long hours - lifting, bending, being on your knees, on your feet, using&nbsp;hand tools and small machines.&nbsp;The ideal garden volunteer follows the lead of&nbsp;our experienced gardeners and is also&nbsp;a self-starter who can take initiative and learn by doing.</p>\n\n<p>Includes:</p>\n\n<ul>\n\t<li>Free home-cooked vegetarian meals and beverages</li>\n\t<li>Free housing in a large room with a balcony</li>\n\t<li>Free WI-FI and domestic phone calls</li>\n\t<li>Free skill training in a wide range of trades and traditional arts</li>\n\t<li>Access to a healthy setting of nature, hiking trails, swimming, wide-open spaces, sacred beauty, fresh air, clean water, and nutritious food</li>\n\t<li>Free Classes on Development of Mind &amp; Spirit: Tibetan yoga, Skillful Means, Buddhist study and more.</li>\n\t<li>Living allowance of $150 per month.</li>\n</ul>\n\n<p><strong>You will have the opportunity to:&nbsp;</strong></p>\n\n<p><strong>Learn and share your own knowledge in all aspects of the gardening process from seeding and greenhouse work, soil prep, planting, cultivating, harvesting, preserving and cooking your homegrown food.&nbsp; Like all Odiyan residents, you will also participate in kitchen work, chores and helping with other community projects such as sacred art and construction projects.</strong></p>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n\t<li>You must be strong, physically able for manual work for hours each day, including lifting, bending, kneeling</li>\n\t<li>Minimum commitment is six months.</li>\n\t<li>Couples welcome to apply.</li>\n\t<li>We cannot accept children or animal companions.</li>\n\t<li>We are a smoke and drug-free community.</li>\n</ul>\n\n<p><strong>If you have a passion for the physically active lifestyle, self-knowledge and giving to a greater vision, Odiyan may be the place for you! The community life, classes, and on-going work projects are directed to the benefit of yourself and all humanity.</strong></p>\n\n<p>Visit&nbsp;<a href=\"http://www.volunteer.odiyan.org/\" title=\"Volunteer Odiyan Retreat Center\" class=\"popup\">www.</a><a href=\"http://www.odiyan.org/volunteer\" class=\"popup\">odiyan.org/volunteer</a></p>\n\n<p>For a more 'inside' view of Odiyan see our photos&nbsp;on Facebook:&nbsp;<a href=\"http://www.facebook.com/OdiyanBuddhistRetreatCenter\" class=\"popup\">OdiyanBuddhistRetreatCenter</a>.</p>\n\n<p>Follow us on Instagram for great stories!&nbsp;<a href=\"https://www.instagram.com/odiyan_mandala/\" class=\"popup\">https://www.instagram.com/odiyan_mandala/</a></p>",
        "index": 4,
        "skills": [
            "machine learning"
        ],
        "remote": false
    },
    {
        "url": "https://www.coolworks.com/nyingma-buddhist-centers-work-study/highlighted-job/38173-make-buddhist-books-develop-your-spiritual-path",
        "position": "Make Buddhist Books, Develop Your Spiritual Path.",
        "company": "RATNA LING WORK STUDY VOLUNTEER PROGRAM",
        "contact": "volunteer@ratnaling.org",
        "posted": "NOV 14, 2020",
        "lastScraped": "2020-12-07T03:45:12.032Z",
        "location": {
            "city": "Cazadero",
            "state": "California"
        },
        "description": "<p><strong>Yeshe De Sacred Test Preservation Project seeks full-time volunteers for residential work-study program.</strong></p>\n\n<p><em>Beautiful, rural&nbsp;northern California location</em></p>\n\n<p>Live and work in a spiritually oriented community while making a tangible contribution to Buddhist culture. Our all-volunteer&nbsp;book bindery crew helps produce Buddhist books that are given away for free to Buddhist centers&nbsp;and communities throughout Asia. You will be helping to preserve ancient enlightened knowledge for all humanity.&nbsp;</p>\n\n<p><em><strong>Since 1983, our community has produced and given away over 6 million sacred Tibetan texts and other Buddhist texts at an annual event in India called the Monlam Chenmo or World Peace Ceremony.</strong></em></p>\n\n<p>For 2021, we are seeking participants to:</p>\n\n<ul>\n\t<li>work in our professionally equipped book bindery&nbsp;</li>\n\t<li>help with infrastructure projects which may include</li>\n\t<li>installing solar power</li>\n\t<li>improving our book storage spaces</li>\n\t<li>shipping stored books</li>\n\t<li>wildfire risk mitigation&nbsp;and more.</li>\n</ul>\n\n<p>Our weekly schedule is rigorous and rewarding - 6 days per week from 8 AM to 5 PM plus onsite classes. Our work and practice curriculum is founded on the principles of “Skillful Means\" an applied method&nbsp;of Buddhist philosophy designed to help&nbsp;develop creative, effective&nbsp;ways to approach our working lives - expanding concentration, awareness and energy.</p>\n\n<p>Desired Qualifications:</p>\n\n<ul>\n\t<li>A volunteer spirit with enthusiasm for humanitarian efforts</li>\n\t<li>Comfortable in our open warehouse with bindery machinery, forklifts and other machinery needed to make books.</li>\n\t<li>Willingness to develop an open and joyous attitude towards work</li>\n\t<li>We will train you in everything you need to know!</li>\n</ul>\n\n<p><strong>We ask for a 6 month commitment to participate in our work-study program.&nbsp; In turn we offer:</strong></p>\n\n<ul>\n\t<li>Valuable work experience and skills development</li>\n\t<li>Free housing and vegetarian meals</li>\n\t<li>A beautiful, inspiring location&nbsp;</li>\n\t<li>Classes on Buddhist studies, meditation, and yoga</li>\n\t<li>Covid protocol to&nbsp;help keep each other safe</li>\n\t<li>Skills development</li>\n\t<li>Free wi-fi&nbsp;</li>\n\t<li>Small monthly living allowance</li>\n\t<li>Positive, community living environment</li>\n</ul>\n\n<p>&nbsp;</p>",
        "index": 5,
        "skills": [
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "url": "https://www.coolworks.com/conservation-corps-of-minnesota-and-iowa/highlighted-job/38165-youth-outdoors-leader",
        "position": "Youth Outdoors Leader",
        "company": "CONSERVATION CORPS OF MINNESOTA AND IOWA",
        "contact": "adrienne.amell@conservationcorps.org",
        "posted": "NOV 11, 2020",
        "lastScraped": "2020-12-07T03:45:13.065Z",
        "location": {
            "city": "Saint Paul",
            "state": "Minnesota"
        },
        "description": "<p>Youth Outdoors AmeriCorps members serve February-December leading crews of Saint Paul and Minneapolis youth in environmental education and community service projects after-school and on Saturdays.&nbsp; In addition to completing environmental restoration projects, education curriculum is taught that helps youth build practical skills, connect to the natural environment, become active citizens and prepare for meaningful careers. The program focuses on youth development and job training, with environmental conservation as a learning vehicle.</p>\n\n<p>While not leading youth, members will be part of an AmeriCorps field crew that involves physically-challenging, team-oriented outdoor service projects while learning about the environment and networking with natural resource professionals. Projects sites are located throughout the state, including urban settings and extreme wilderness. Service work is performed almost exclusively outdoors and may involve camping for several days at a time.&nbsp;</p>\n\n<p>Corpsmembers receive training in youth leadership, civic engagement, natural resource management and personal development skills.&nbsp;Corpsmembers also receive training and complete various conservation projects such as tree planting, prairie restoration, streambank stabilization, wildlife surveys,&nbsp;carpentry/construction, timber stand improvement, lakeshore restoration, erosion control, trail construction and maintenance, exotic species management and wildlife habitat improvement</p>",
        "index": 6,
        "skills": [
            "machine learning"
        ],
        "remote": false
    }
]