[
    {
        "position": "Database Administration Intern",
        "company": "National Association for College Admission Counseling",
        "location": {
            "state": "Unknown"
        },
        "posted": "2019-09-08T02:35:29.829Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/f12eebd6d6cb4108a5b93b261b1f4558-database-administration-intern-national-association-for-college-admission-counseling-arlington",
        "lastScraped": "2020-10-02T02:35:29.833Z",
        "description": "<p>The National Association for College Admission Counseling (NACAC) has an opening for the position of Database Administration Intern. The database administrator intern will work directly with the executive director of information systems to manage list data, provide excellent customer service in monitoring and fulfilling list orders, and assist in process design and automation.</p><p>&nbsp;</p><p>NACAC is the largest association in the world supporting professionals who serve students as they make choices about pursuing postsecondary education. The association works to expand access to higher education through policy, advocacy, convening, education, and training. It has a membership of nearly 14,000 comprised of postsecondary admissions professionals, high&nbsp;school counselors, independent educational consultants, and&nbsp;others based throughout the United States and, increasingly, around the world. NACAC is fortunate to partner with 23 state and regionally-based affiliate organizations that share a common mission to serve and support the needs of admission and counseling professionals.</p><p>In addition, the organization cultivates special interest groups (SIGs). These “micro communities” nurture the growing diversity of interests across the association.</p><p>&nbsp;</p><p>NACAC is in the process of reinventing itself during a time of disruption for both the college admissions profession and associations. A new strategic vision, mission, and values ensure the organization will become a cutting-edge influencer, leading and supporting the transformation of the college admissions profession.</p><p>&nbsp;</p><p>NACAC commits to:</p><ul><li>Leading important initiatives resulting in a more diverse and inclusive student population</li><li>Boldly influencing higher education policy</li><li>Serving as a clearinghouse for readily accessible knowledge sharing, transformative professional development opportunities, and cutting-edge research</li><li>Creating a membership that is reflective of the changing demographics among students</li></ul><p>&nbsp;</p><p>To ensure the organization’s success, NACAC is committed to being innovative, nimble, and meeting the moment—working at the speed of light to stay ahead of the curve and to lead meaningful and impactful change.</p><p>&nbsp;</p><p><br></p><p><strong>Tasks and Learning Opportunities Will Include:</strong></p><p><br></p><p><strong>Core Tasks</strong></p><ul><li>Monitor list orders and verify required signatures and payments.</li><li>Filter and select the appropriate list and create a download link.</li><li>Email the link to the customer.</li><li>Answer any customer questions and troubleshoot problems.</li><li>Manage the list data including de-duping and updates.</li><li>Manage the list update process for previously purchased lists.</li><li>Filter data list to support projects across the organization.</li></ul><p><br></p><p><strong>Additional Possible Tasks/Stretch Opportunities</strong></p><ul><li>Continuously improve the list fulfillment process including increasing the process automation.</li><li>Create a standard operating process (SOP) document for training of future interns.</li><li>Develop a phase 2 product which would include a dynamic list selection and pricing tool that would enable colleges to target only the students in their target demographics.&nbsp;</li><li>Develop an automated and secure process for creating and distributing the phase 2 list product.</li><li>Other duties as assigned.</li></ul><p><br></p><p><br></p><p><strong>REQUIRED QUALIFICATIONS:</strong></p><p><br></p><p><strong>Education:</strong>&nbsp;Current enrollment in an undergraduate degree program with coursework in computer science, database administration or related area.</p><p><br></p><p><strong>Experience:</strong>&nbsp;None required.</p><p><br></p><p><strong>Knowledge, Skills and Abilities:</strong></p><ul><li>Impeccable attention to detail</li><li>Basic data privacy and security awareness</li><li>Excellent Excel and cloud data sharing skills</li><li>Strong report writing skills with SQL or SoQL queries</li><li>Excellent customer service skills.</li></ul><p><br></p><p><strong>PREFERRED QUALIFICATIONS:</strong></p><ul><li>Experience with Salesforce</li><li>Web programming skills to support creation of an interactive list selection tool for the phase 2 product.</li></ul><p><br></p><p><br></p><p><strong>LENGTH OF INTERNSHIP:</strong>&nbsp;</p><p>October-December with the possibility of extending until June; flexible start date</p><p>Monday-Friday, flexible hours totaling approximately 20 hours/week during the hours of 8 a.m.-5 p.m.</p><p>&nbsp;</p>",
        "skills": [
            "machine learning",
            "information technology",
            "cloud computing"
        ],
        "start": "2020-12-01T10:00:00.000Z"
    },
    {
        "position": "Fall/Winter Internship Opportunity",
        "company": "Garrison Institute",
        "location": {
            "state": "Unknown"
        },
        "posted": "2019-04-11T02:35:30.569Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/01f217183a0e47bcab90217ae0eaf986-fallwinter-internship-opportunity-garrison-institute-philipstown",
        "lastScraped": "2020-10-02T02:35:30.574Z",
        "description": "<p>The Garrison Institute, a non-profit, non-sectarian organization located in the Hudson River Valley is currently seeking a part-time intern to support our Communications and Program areas.&nbsp;&nbsp;This is a great opportunity to gain valuable work experience if enrolled in college, are a recent graduate or looking to transition into the not-for-profit sector.&nbsp;&nbsp;</p><p>As an intern at the Garrison Institute you will be part of fulfilling our mission to apply the wisdom that arises from contemplation and insights derived from science to today’s pressing social and environmental issues to create a more compassionate, resilient future for all.&nbsp;&nbsp;You will work alongside an&nbsp;energized and motivated team of colleagues within a supportive work culture.&nbsp;&nbsp;</p><p>Our intern will participate and assist with the following tasks:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Writing, editing and proofreading including contributing to our blogs, website and communications materials&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Supporting our social media presence using such outlets as Facebook, Twitter, Instagram</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assisting with marketing efforts to expand our audience outreach</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Entering and tracking various forms of data&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Organizing and creating catalogs of files such as photos, videos and other media files</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other general duties and tasks to support Communications and Programmatic Initiative areas&nbsp;</p><p>Successful intern candidates will have outstanding interpersonal, oral and especially written communications skills; proven expertise in proofreading and editing documents; computer literacy with experience in using MS-Office, databases, social media sites; some experience in Communications or Marketing work is most desired. Candidates should also possess a strong desire to learn about and support the Garrison Institute’s mission and have a keen interest in contemplative and mindfulness practices as well as interest in our programmatic areas focused in caregiving and social/human services, social justice, planetary health, and education.&nbsp;</p><p>Candidates currently enrolled in an undergraduate or graduate program are encouraged to apply as well as recent graduates and those looking to transition into the non-profit field. This opportunity offers a flexible schedule, paid part-time hours, virtually based internship with some on-site work if so desired at our beautiful, former monastery set on 90 wooded acres overlooking the Hudson River.&nbsp;&nbsp;</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>",
        "skills": [
            "machine learning"
        ],
        "compensation": "paid"
    },
    {
        "position": "REMOTE PUBLIC POLICY/JOURNALISM INTERNSHIP",
        "company": "Citizens Union",
        "location": {
            "state": "Unknown"
        },
        "posted": "2019-02-10T02:35:32.082Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/57361cd724d84324a42fdb2a32fff8a6-remote-public-policyjournalism-internship-citizens-union-new-york",
        "lastScraped": "2020-10-02T02:35:32.085Z",
        "description": "<p>Our interns play a vital role in Citizens Union’s success.&nbsp;We are looking for interns with an interest in research and journalism for the fall semester. The following are some of the responsibilities of Citizens Union’s policy interns for fall 2020:</p><ul><li>Conducting research on candidates running for local office, including biographical and policy research;</li><li>Identifying all candidates in a particular race using news reports, campaign material, and public documents;</li><li>Liaising and scheduling interviews with candidates and elected officials;</li><li>Conducting research on public policy issues of importance, including civics education, campaign finance, felony disfranchisement, ethics, as well as other issues of good governance; and</li><li>Researching for, writing, and editing issue summaries, analyses and reports, policy briefings, memos of support, organizational position statements, and correspondence to public officials.</li><li>The ideal intern will be a college graduate, postgraduate, or undergraduate with:</li><li>Experience in journalism;</li><li>&nbsp;A background or interest in government, political science, public administration, history, law, or a related field;</li><li>&nbsp;Excellent written communication skills;</li><li>Online research skills, including mining media reports and social media platforms, and basic computer proficiency;</li><li>Public policy research experience;</li><li>Comfort making cold calls; and</li><li>The availability to commit a minimum of 15 hours per week.</li></ul><p>If you have some, but not all, of these qualifications and feel you would make a positive contribution to the team, we encourage you to apply. In light of the COVID-19 pandemic, the internship will take place entirely remotely for the foreseeable future. As such, candidates can apply from anywhere in the United States. We are willing to work with your academic institution if you are interested in receiving credit. Priority will be given to candidates that can begin immediately.</p><p>Citizens Union is an Equal Opportunity Employer and encourages applicants of all backgrounds and experiences to apply.</p>",
        "skills": [],
        "remote": true
    },
    {
        "position": "Rule of Law Internship",
        "company": "World Justice Project",
        "location": {
            "state": "Unknown"
        },
        "posted": "2020-10-02T02:35:33.358Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/cc367f90c6ea4e4b942644080ba5c1a6-rule-of-law-internship-world-justice-project-washington",
        "lastScraped": "2020-10-02T02:35:33.362Z",
        "description": "<p>The WJP's Index team is seeking a full-time, paid intern for a four to six months position, with the possibility of extension up to one year. Pending social distancing recommendations, the intern will work remotely until the WJP's Washington, DC office is able to open safely. Candidates that are able to transition to full-time work based in WJP's DC office will be given preference.</p><p>Candidates selected for this position must have access to a computer with videoconferencing abilities (i.e. Skype) and a reliable internet connection.</p><p><strong>Responsibilities:&nbsp;</strong>As part of a small team, interns will provide crucial support to the Index team and will assist with data collection efforts and report production for WJP's various projects, including the&nbsp;<em>WJP Rule of Law Index 2021,&nbsp;</em>graphical country reports, and other thematic and country-specific projects. The main responsibilities of this position include, but are not limited to:</p><ul><li>Support the primary data collection process for the Qualified Respondents Questionnaire (QRQ) expert surveys or the General Population Poll (GPP) administered in 128 countries for the annual&nbsp;<em>WJP Rule of Law Index</em>&nbsp;This includes survey design and maintenance, survey administration, data collection, management of expert contributor and polling partners, and management of online data collection platforms and CRM databases;</li><li>Contribute to the data analysis, research, writing, editing, and design of the&nbsp;<em>WJP Rule of Law Index&nbsp;</em>annual report series;</li><li>Support the production of the&nbsp;<em>World Justice Project Rule of Law Index's&nbsp;</em>graphical country reports and other WJP publications;</li><li>Support projects and activities related to alternative data collection efforts, data presentation, and data visualization;</li><li>Conduct qualitative research on rule of law developments around the world;</li><li>Assist with preparations for meetings and presentations, including producing drafts of Microsoft PowerPoint presentations and handouts, and preparing and assembling outreach materials for external distribution;</li><li>Provide general programmatic and administrative support, including research, editing and proofreading documents and presentations, assisting with Index calendar management, and coordinating logistics for travel and meetings;</li><li>Undertake rule of law research and analysis as necessary.</li></ul><p><strong>Qualifications:&nbsp;</strong>This position is open to graduates (Bachelor's degree) with excellent attention to detail and research skills. International experience and foreign language skills are preferred. The ideal candidate will have completed coursework in international affairs, social sciences, journalism, economics, policy studies, regional studies, law, or related field. They will be bright, highly dependable, and motivated with a strong academic record and an enthusiastic interest in the rule of law.</p><p>The successful candidate will demonstrate the following skills and qualifications:</p><ul><li>Preferably at least one year of professional experience, including internships;</li><li>Knowledge of Microsoft Office (especially Excel), with preference given to those with prior experience/proven ability managing large databases;</li><li>Ability to communicate clearly and efficiently, and ability to give and receive feedback;</li><li>Ability to work independently as well as in group settings, the ability to manage his or her own workload, and the ability to prioritize multiple tasks and work under deadline pressure;</li><li>Excellent written and oral communication skills, excellent problem solving skills, and attention to detail;</li><li>Proficiency in a foreign language (especially French, Spanish, Arabic, Russian, or Portuguese) is preferred;</li><li>Applicants must be authorized to work in the United States;</li><li>Commitment to the WJP's mission and principles (<a href=\"http://www.worldjusticeproject.org/\" target=\"_blank\"><strong>worldjusticeproject.org</strong></a>).</li></ul><p><strong>How to Apply:&nbsp;</strong>The World Justice Project is an equal opportunity employer committed to diversity and inclusion. To apply, please visit WJP's employment portal:&nbsp;<a href=\"https://worldjusticeproject.isolvedhire.com/jobs\" target=\"_blank\"><strong>https://worldjusticeproject.isolvedhire.com/jobs</strong></a>. Please include the following documents along with your application&nbsp;<strong>(in one PDF file</strong>):</p><ul><li>Cover letter</li><li>Resume</li><li>Writing sample (five pages maximum)</li><li>Contact information for three references (past supervisors and employers preferred)</li></ul><p>Applications will be reviewed on a rolling basis. This position will remain open until&nbsp;<strong>November 2, 2020.&nbsp;</strong>Due to the high volume of applications received, we are only able to follow up directly with candidates selected for interviews. No phone calls please.</p><p><br></p>",
        "skills": [
            "data visualization",
            "information technology"
        ],
        "compensation": "paid",
        "due": "2020-11-02T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    }
]