[
    {
        "position": "2020 Technology Internship (Computer Science)",
        "company": "T Mobile Club",
        "location": {
            "city": "Bellevue",
            "state": "Washington"
        },
        "posted": "2020-11-16T02:59:38.829Z",
        "url": "https://www.linkedin.com/jobs/view/2020-technology-internship-computer-science-at-t-mobile-club-2324715947?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=UloIJ%2BMIMBQyv%2FbeLoEI5w%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:38.829Z",
        "description": "Are you ready for a challenge that could launch your career? T-Mobile is revolutionizing the wireless industry for millions of customers nationwide. Working here means rolling up your sleeves and disrupting the status quo with a team that has your back every step of the way.<br><br>You're invited to be an Intern with our Technology Team.<br><br>This is a 12-week paid learning experience with our army of project managers, web developers, and engineers, all working like a well-oiled machine to keep our network running and our customers connected.<br><br>The amazing technology that powers everything we do. The code that makes it all run smoothly. Mobile changes by the minute, and as the leaders in our industry, we're setting the pace. This is teamwork at its best with technical warriors bravely pushing the edges of the wireless frontier. If the cutting edge of technology sounds like the place for you, then you're in the right place.<br><br>And all of this awesome work doesn't just take place just at our headquarters campus in Bellevue, WA and surrounding cities of Bothell and Snoqualmie. Our tech teams are also located nationwide in cities such as Atlanta, GA, Dallas, TX, Concord, CA, Parsippany, NJ and many more field locations.<br><br><strong><u>Responsibilities<br><br></u></strong>Working as an Intern on our Technology Team means everything from reporting, data and process analysis, partnering with the market engineering site development team in building/upgrading wireless sites, real time subscriber services and integrating services onto T-Mobile's IP network to engineering design, device performance testing, radio access network evolution, security infrastructure and network support (just to name a few).<br><br>You'll contribute your creativity and great ideas, working alongside innovative colleagues and mentors who will push you to be your very best. We'll give you hands-on projects and the chance to make an immediate impact. Here are some of the roles you could have as a Computer Science focused Intern with our Technology Team...<br><ul> <li>Project/Program Management</li> <li>Software Development</li> <li>Software Testing</li> <li>Systems Design</li> <li>Systems Architecture</li> <li>Software Engineer</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>You're currently enrolled in college and pursuing a Bachelor's, Master's, or MBA degree with a Business, Computer Science, Electrical Engineering, Information Security, Information Technology, Mathematics, Project Management, Statistics or Telecommunications focus.</li> <li>You're a self-starter with a passion for learning who is not afraid to ask questions.</li> <li>Things change and move pretty fast on this team and your ability to quickly adapt, change direction and think on your feet without missing a beat is essential.</li> <li>You share our Un-carrier® spirit. This is about breaking rules, paving our own path and making things better for our customers - and each other.</li> <br></ul><strong>Being an Intern<br><br></strong>Our Internship Program takes place over the summer running 12 weeks from May/June to August/September. As an Intern, you'll receive competitive pay, relocation benefits (if eligible), a world class learning experience, and the support of a team that believes in your potential. You'll also have plenty of opportunities to meet and network with other interns, fellow team members, and top leaders from all business functions across the company as you make connections that will last your career.<br><br>A big part of our culture is about embracing our Magenta spirit. And we'll ask you to do the same. Check out #BeMagenta and #UofMagenta to see how we work together to take care of our customers and each other every day.<br><br><strong>Recruiting Timeline<br><br></strong>Recruiting for the 2020 internship program takes place from September 2019 through March 2020. We'll be visiting campuses across the country and attending national recruiting conferences in September through November. We'll be connecting with candidates and begin screening in January. If we think you're a good fit for one of our roles, we'll contact you directly to discuss next steps. Interviews will start to take place in late January and all internships will be filled by the end of March.<br><br><strong>Application Process<br><br></strong>Select the job posting that best matches your interests, education and experience and click apply. We'll then review your application. If we think you're a good fit for one of our roles, we'll contact you directly to discuss next steps.<br><br><strong><u>Minimum Qualifications<br></u></strong><ul> <li>At least 18 years of age.</li> <li>Legally authorized to work in the United States.</li> <li>High School Diploma or GED.</li> <li>Pre-employment background screen.</li> <br><br></ul><strong><u>Company Profile<br><br></u></strong>As America's Un-carrier, T-Mobile USA, Inc. (NASDAQ: \"TMUS\") is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The company's advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile USA. Inc. provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com<br><br><strong>EOE Statement<br><br></strong>We Take Equal Opportunity Seriously - By Choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law.",
        "index": 1,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-03T02:59:39.515Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=ueJnCO5VuM8KjPl21IawCw%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:39.515Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
        "index": 2,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "java",
            "C and C++",
            "machine learning"
        ],
        "contact": "accommodations@linkedin.com",
        "remote": false
    },
    {
        "position": "Data Science Internship",
        "company": "Blizzard Entertainment",
        "location": {
            "city": "Irvine",
            "state": "California"
        },
        "posted": "2020-12-05T02:59:39.913Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-internship-at-blizzard-entertainment-2314550022?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=rA0ot%2BRUURN8l5zSnpG%2FYA%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:39.913Z",
        "description": "<strong><u>Job Title<br><br></u></strong>Data Science Internship<br><br><strong><u>Requisition ID<br><br></u></strong>R003193<br><br><strong><u>Job Description<br><br></u></strong><strong>DATA SCIENCE INTERN - GAME FRANCHISE ANALYTICS<br><br></strong>Greetings, students! We’re geared up here to offer another round of epic internship experiences in summer 2021. The internship program offers the opportunity to pause your studies for one summer and work side-by-side with Blizzard Entertainment employees in your area of interest, doing real work that oftentimes ends up in production. As such, we hold you to the same high standards as anybody else in the company.<br><br>Just like our gameplay experiences, Blizzard internships are a fully immersive experience. We want interns who are enthusiastic about what they want to do for a living and excited to come in every day to learn and contribute in this hyper-creative atmosphere. Being fully engaged with our team also means communicating effectively and maintaining an open mind - one that is receptive to feedback and able to adapt and grow. Your hobbies and interests can also play in your favor. Passion for technology, gaming, game development, and an in-depth knowledge of Blizzard games, products, and services will always be a plus with us, regardless of the position you’re applying for. Be passionate about who you are, be into our industry, and be willing to go all-in and embrace this opportunity to the fullest!<br><br><strong>QUEST OBJECTIVES<br><br></strong>We’re seeking post-graduate students to help us analyze and build data-powered products and services for Blizzard. Interns will follow the full end-to-end project model used by data scientists at Blizzard and have the opportunity to share their results with game and product teams. Intern projects are tailored to candidate strengths and fit to ongoing opportunities across game teams and Blizzard-wide services.<br><br>What’s life like as a data scientist and what can you expect? Whether working with game teams (e.g., Hearthstone, Overwatch, or WoW) or support teams (e.g., Battle.net or marketing) we regularly meet stakeholders to define and refine our project goals. From these goals we build and iterate on analytical models: pulling data, analyzing and testing assumptions, building models, and vetting the model conclusions. As we refine these models, services, or products we present the results to stakeholders, ultimately augmenting stakeholder decision-making (e.g., segmenting our player base) or delivering automated models (e.g., a matchmaking algorithm).<br><br>This position is a unique opportunity to work closely with game and product teams (designers, engineers, and analysts) to take your data science knowledge and turn it into analyses, products, or services impacting the games you love!<br><br><strong><u>Quest Requirements<br></u></strong><ul><li> Currently enrolled in a college or university</li><li> Returning for at least one more semester or quarter following the Summer 2021 internship</li><li> Able to work fulltime hours for 11 – 12 weeks at the Blizzard office indicated in this job posting between May 2021 – August 2021 or June 2021 – September 2021 (group dates depend on when you get out of school)</li><li> Authorized to work in the US<br></li></ul><strong><u>Level Requirements<br></u></strong><ul><li> Pursuing a Masters or PhD in computer science, statistics, math, or related quantitative fields (e.g., economics, physics, psychology)</li><li> Experience building and evaluating machine learning or statistical models</li><li> Passion for gaming!</li><li> Proficient in R, Python, or related programming languages</li><li> Strong written and spoken communication skills<br></li></ul><strong>RECOMMENDED TALENTS<br></strong><ul><li> Database querying (e.g., SQL, HiveQL)</li><li> Data visualization (e.g., R plotting, matplotlib, Tableau)</li><li> Accomplished in Blizzard games (e.g., 12 wins in Hearthstone arena, Diamond rank in Overwatch, or max-level in WoW)<br></li></ul><strong>QUEST ITEMS<br></strong><ul><li> Resume</li><li> Cover Letter<br></li></ul><strong>WARNING! Applications that do not include all of the required materials will not be considered. We’re serious about this – due to the volume of applications we receive, we only have time to consider complete submittals.<br><br></strong>Blizzard Entertainment is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veteran status, or any other basis protected by applicable law, and will not be discriminated against on the basis of disability.<br><br>Blizzard Entertainment is a global company committed to growing our employees along with the business. We offer generous benefits and perks with an eye on providing true work / life balance. We’ve worked hard to foster a deeply collaborative and creative environment, a diverse and inclusive employee culture, and training and opportunity for professional growth. Our people are everything. Our core values are real, and our mission has never changed. We are dedicated to creating the most epic entertainment experiences…ever. Join us!",
        "index": 3,
        "skills": [
            "machine learning",
            "information technology",
            "python",
            "data visualization",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Programmer - Intern",
        "company": "Cognizant",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-11-23T02:59:40.220Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-intern-at-cognizant-2316135014?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=Epqqc5uGPPy731GZAccEyg%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:40.220Z",
        "description": "Cognizant Softvision seeks an intern with experience in software design, coding and debugging. The intern will gain exciting real-world software engineering experience at a thriving company.<br><br>We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Document and test new software applications</li><li> Assess new application ideas</li><li> Develop applications (coding, programming)</li><li> Test and release applications<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Computer Science/Network Engineering, Engineering, or Mathematics major</li><li> Excellent analytical and mathematics skills</li><li> Ability to work in teams</li><li> Experience programming in Javascript, HTML, CSS, React.js<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Practical experience with a wide variety of software engineering tasks</li><li> Collaborating hand-in-hand with skilled teams of software engineers</li><li> Shadowing, mentoring, and training opportunities with seasoned professionals</li><li> Opportunity to participate in networking events and company meetings</li><li> Flexible schedule for students</li><li> Compensation available<br></li></ul>Employee Status : Full Time Employee<br><br>Shift : Day Job<br><br>Job Posting : Dec 05 2020<br><br><strong><u>About Cognizant<br><br></u></strong>Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.<br><br>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.<br><br>Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br><br>If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "index": 4,
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "machine learning",
            "web development",
            "react"
        ],
        "contact": "CareersNA2@cognizant.com",
        "remote": false
    },
    {
        "position": "Software Engineering Intern (multiple openings)",
        "company": "MicroStrategy",
        "location": {
            "city": "Tysons Corner",
            "state": "Virginia"
        },
        "posted": "2020-11-23T02:59:40.883Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-multiple-openings-at-microstrategy-2313472104?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=uaXD1jTPA9ycwqHjIE0apQ%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:40.883Z",
        "description": "<strong><u>Company Description<br><br></u></strong>MicroStrategy transforms organizations into intelligent enterprises through data-driven innovation. We match smart people to dynamic projects and technologies that truly challenge their talents. Curious and creative in outlook, our success is built on the talent and energy of smart and driven people. MicroStrategy (Nasdaq: MSTR) is a worldwide leader in enterprise analytics and mobility software. A pioneer in the BI and analytics space, MicroStrategy delivers innovative software that empowers people to make better decisions and transform the way they do business. We provide our enterprise customers with world-class software and expert services so they can deploy unique intelligence applications.<br><br><strong><u>Job Description<br><br></u></strong>As a Software Engineer Intern at MicroStrategy, you’ll be part of an agile software development team, providing our customers with the most powerful, scalable, and user-friendly platforms for analytics, mobility, and security. You’ll play a key role in enabling MicroStrategy products to be best-in-breed and optimized for leading organizations to analyze Big Data and distribute actionable business insight across their enterprise.<br><br>Our 12-week paid summer internship offers mentorship, networking events, and professional development within our Technology team.<br><br><strong><u>You’ll have the opportunity to join one of the exciting teams below</u>:<br><br></strong><strong>Clients<br><br></strong>The Clients team is delivering rich, modern, intuitive interfaces that serve content subsecond and enable instant insight and actions for business users through the tools they use every day.<br><br><strong>Tools<br><br></strong>The Tools team is building the next generation of analytics authoring, environment management, and system monitoring tools to empower all MicroStrategy users. Users will leverage best-in-class tools to configure, monitor, and automate enterprise BI and Security applications.<br><br><strong>Platforms<br><br></strong>The Platforms team enables customers to quickly realize value from their MicroStrategy investment by providing a comprehensive Platform of Analytics, Mobility, and Security services that rapidly deploy on Windows, Red Hat Linux, and Amazon Linux in the Cloud and On-Premise.<br><br><strong>Server<br><br></strong>The Server team is the heart and brain of the MicroStrategy Platform by enabling the next generation of Analytic and Mobile applications leveraging every available Enterprise Asset, by providing a rich set of powerful, easy to use, metadata-driven Services, which can be deployed On-Premise or in the Cloud.<br><br><strong><u>Technologies You Could Use<br><br></u></strong>Java, C++, C#, JavaScript, Swift, Objective C, Shell scripting (ksh, bash), Python, HTML5, CSS, Windows Server, Linux, Mac, iOS, Android, Cocoa, J2EE, Angular, Spring, MapReduce, Play, React, Node.js, Eclipse IDE, Visual Studio, Git, Maven, Junit<strong>, </strong>SQL server, Oracle, DB 2, MySQL, , Redshift, Hive, Impala, Teradata, Presto, Spark, MongoDB<strong>, </strong>REST, JDBC, ODBC, ORM, Redis, Kafka, Zookeeper<br><br><strong><u>Qualifications<br><br></u></strong><strong><u>You should bring the following skills and experience:<br></u></strong><ul><li>Currently pursing Bachelors in Computer Science or related field (targeting December 2021 or May 2022 graduates)</li><li>Strong verbal and written communication skills</li><li>Creative analytical and problem solving skills</li><li>Process oriented and ability to pay close attention to detail</li><li>Team oriented individual<br><br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines.",
        "index": 5,
        "skills": [
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern Data Science /Analytics",
        "company": "FedEx Services",
        "location": {
            "city": "Memphis",
            "state": "Tennessee"
        },
        "posted": "2020-11-23T02:59:41.264Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-analytics-at-fedex-services-2204986583?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=5HvkS3IRp5SmOowY3mwnFQ%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:41.264Z",
        "description": "<strong>Company:</strong> FedEx Services<br><strong>Job Title:</strong> Intern Data Science /Analytics<br><strong>Job Requisition Number:</strong> RC286540<br><strong>Category:</strong> Intern<br><strong>Pay Type:</strong> Non-exempt<br><strong>Locations:<br></strong>Memphis, Tennessee 38116<br>United States<br><br>This is a 10-week assignment for students pursuing a college degree. Assignments are directly related to intern's academic degree. Under direct supervision, performs duties as assigned. Student participates in a number of organized events providing visibility into the overall operations of FedEx.<br><br>Full-time internship opportunity available in multiple locations across the US from June 2021 to August 2021.<br><br><strong><u>The Intern May Assist With<br><br></u></strong>Under close supervision, the successful candidate may assist with project management, process mapping, data analysis, workflow documentation, and report automation. The project may relate to developing customer profiles based on data attributes, or analyzing package data attributes to optimize customer satisfaction.<br><ul><li>Conducting data analytics, customer profiles, report development, and/or research.</li><li>Interacting with business partners and/or staff to gather, interpret, and document customer and operational behavior for data analysis. </li><li>Documenting systems functions and business process flows.<br>The ideal candidate will possess the following skills and experience:</li></ul><ul><li>Strong analytical/quantitative, project/program management, organizational, leadership, presentation, and verbal and written communication skills.</li><li>Ability to manage multiple tasks, set priorities and monitor ongoing results.</li><li>Ability to synthesize big data (quantitative and qualitative); Report design/development.</li><li>Knowledge or experience with one or more of the following: data analytics, forecasting/modeling, strategy planning, engineering planning, operations, economics, process mapping, database query creation, web development, and project management.</li><li>Basic knowledge of one or more of the following: the software development process, systems applications and architecture, Query Languages, “R,” MATLAB, Python, C++, objective-C, and SQL.</li><li>Experience with Big Data technologies like Hadoop, Spark, Hive, Kafka, Hbase, etc.</li><li>Use of one or more analytic software tools or languages such as. Scala, R, Python, SAS</li><li>Demonstrated expertise in developing data pipelines with industrial datasets to enable descriptive, applied, and predictive analytics</li><li>Information technology data collection, organization, integration, data cleansing, data quality assessment, and using analytics for data assessment</li><li>Knowledge of PowerPoint, Keynote or Prezi and the Microsoft Office suite.<br><br></li></ul><strong><u>The Following Are Considered a Plus<br></u></strong><ul><li>Enrollment as undergraduate at junior year or above or graduate student in Engineering, Industrial Engineering, Operations Engineering, Software Engineering, Computer Engineering, Computer Science, Information Systems, Process Analysis, Systems Analysis and Design, Decision Science, Data Science, Statistics, Applied Statistics, Quality Improvement Analytics, Informatics, Mathematics, Business, Management, Finance, Accounting, Economics, Industrial Psychology, or other related major.</li></ul><ul><li>Ideally, plans to graduate within 12 months of completing the internship and begin full-time employment.<br><br></li></ul><strong><u>Resume Should Include The Following Information<br></u></strong><ul><li>College address and permanent home address.</li><li>Email address.</li><li>Telephone number.</li><li>The following regarding the degree you are currently pursuing:<br><ul><li>Name of college/university.</li><li>Degree (For example, bachelor’s degree, master’s degree, or doctorate).</li><li>Major and/or minor.</li><li>Overall GPA.</li><li>Major GPA.</li><li>Date of intended graduation (Month and year).</li></ul></li></ul><u>Domicile Location</u><u>:<br></u>Multiple locations across the US.<br>Relocation assistance not available.<br><br>FedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.<br><br>FedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com.",
        "index": 6,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "matlab",
            "scala",
            "C and C++"
        ],
        "contact": "recruitmentsupport@fedex.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "Unity Technologies",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:41.577Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-unity-technologies-2298618106?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=pRnjLcsIKT7CE9Lk5eWILQ%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:41.577Z",
        "description": "We are looking for a Data Science Intern to join our data science team for the summer! Data is the foundation of our business in Monetization@Unity, and we harness it to solve business problems for multiple teams and products. We analyze large volumes of data, applying statistical techniques to extract insights and to inform decisions. We develop and implement machine learning models into production and intuitively make decisions around what approaches to take in solving hard problems.<br><br>Among some of the problems we solve are fraud prevention and detection, increasing Unity advertiser retention, improving supply quality, and working with our partners to quickly respond to rapidly evolving threats!<br><br><strong><u>Responsibilities<br><br></u></strong><ul> <li>Develop machine learning models to solve important business problems</li> <li>Work with Data Scientists and Engineers to deploy models to a production environment</li> <li>Think creatively and to be able to test out and iterate new ideas rapidly</li> <li>Effectively communicate technical concepts and analyses to stakeholders</li> <br><br></ul><strong><u>Requirements<br><br></u></strong><ul> <li>Working towards a degree in Data Science, Analytics, Statistics, Computer Science or other quantitative discipline</li> <li>Python, SQL, and scikit learn </li> <li>Understanding of machine learning concepts and applying them</li> <br></ul><strong>Bonus points<br></strong><ul> <li>Experience with Tensorflow or Pytorch</li> <li>Experience with big data (Spark)</li> <br><br></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>",
        "index": 7,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "python",
            "deep learning"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "Blend",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:41.884Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-blend-2149558194?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=F3DnxQDdnnAPaGLiTP0mQA%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:41.884Z",
        "description": "Blend helps lenders maximize their digital agility. Our digital lending platform is used by Wells Fargo, U.S. Bank, and other leading financial institutions to increase customer acquisition, improve productivity, and accelerate the delivery of any banking product across every channel. We process more than $3.5 billion in mortgages and consumer loans daily, helping millions of consumers get into homes and gain access to the capital they need to lead better lives.<br><br>As an intern, you will work within our core engineering team on one or more projects that contribute both to our product and to your learning goals.<br><br>We’re looking for talented software engineering interns to join our diverse and fast-growing engineering team. As a software engineering intern, you’ll work throughout the stack, from large-scale data processing to web UI. Specifically, you will be responsible for building new features and functionality enabling our company to deliver mission-critical software to major mortgage lenders. If you have a strong understanding of CS fundamentals, and are excited by a fast-paced, collaborative work environment, we want to hear from you!<br><br><strong><u>Who You Are<br></u></strong><ul><ul><li>Excellent coding, problem solving, and debugging skills</li><li>Proven understanding of computer science fundamentals </li><li>Excellent communication skills</li><li>Expected graduation date by June 2022<br><br></li></ul></ul>Blend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable law, including the San Francisco Fair Chance Ordinance.<br><br>Notice at Collection for California Applicants",
        "index": 8,
        "skills": [
            "software engineering",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Summer IT & Data Science Internships",
        "company": "Tapestry",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-11-16T02:59:42.265Z",
        "url": "https://www.linkedin.com/jobs/view/summer-it-data-science-internships-at-tapestry-2304647360?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=f%2BfNFrexLjE%2F6Hf8o89KnQ%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:42.265Z",
        "description": "Explore the possibilities across our global house of brands.<br><br>Defined by inclusivity rather than exclusivity, Tapestry embraces the exploration of individuality and invests in helping you grow personally and professionally. Every individual in our global house has the opportunity to make an impact, learn and be part of our growing and unique story.<br><br>At Tapestry, we have the freedom to express ourselves and run with our best ideas across Coach, Kate Spade New York, and Stuart Weitzman. We share a profound belief in both our individual and collective potential, and know that with hard work and dedication, anything is possible.<br><br><strong>Tapestry will be offering internship opportunities which will provide interns the opportunity to develop critical skillsets and gain hands-on experience at our house of modern luxury lifestyle brands.<br><br></strong><strong>The 2021 program will run from June 1st - August 6th. Paid internship opportunities will be available at each of our brands (Coach, kate spade, Stuart Weitzman) and within Tapestry functional groups. <br><br></strong><strong>Here’s what you can expect from our internship recruitment process:<br><br></strong><ul><li><u>Application Deadline</u> - January 11th. </li><li><u>Video Submissions</u> - Should your application be selected for further consideration, you will receive an email prompt for the video submission portion of the application in mid to late-January.</li><li><u>Final Interviews</u> - Our teams will be selecting final candidates for phone or video interviews in early to mid-February depending on candidate availability.</li><li><u>Internship Offers</u> - Delivered in early March. <br><br></li></ul><strong>Job Title: </strong>Summer IT &amp; Data Science Internships<br><br><strong>Primary Purpose:</strong> The successful individual will leverage their proficiency in IT, Data Science and/or Analytics to work within the Tapestry corporate team.*<br><br><li>Our Internship recruiting team will be selecting candidates based on relevant skillsets that could be applicable to internship opportunities within the following departments: Information Security, eCommerce Solutions, Commerce Solutions, Tech Services, Data Labs/Analytics.<br><br></li><strong>The accomplished individual may possess... <br><br></strong><ul><li>Excellent written and oral communication skills</li><li>The path to a BA/BS degree with a focus in Computer Science, Cyber Security, or related field. </li><li>The path to a BA/BS degree in Media Science, Economics, Statistics, Engineering, Math or other quantitative field (or equivalent practical experience).</li><li>Familiarity with analytics (media industry, social, digital marketing).</li><li>In-depth knowledge of Windows, Mac and Linux operating systems </li><li>Strong proficiency in LAN/WAN and WiFi/mobile technology </li><li>Understanding of networking hierarchy and protocols </li><li>Basic concepts of computer triage and forensics <br><br></li></ul><strong>An outstanding professional may have... <br><br></strong><ul><li>Experience with HTML/CSS, Javascript/JQuery, Git/Github</li><li>Routing, Switching, Firewalling knowledge </li><li>Knowledge of WiFi networks, security measures, threat countermeasures</li><li>In-depth understanding of how the Internet works (DNS, TCP/IP, etc.)</li><li>In-depth understanding of secure Internet communication (IPSEC, VPN, encryption, etc.)</li><li>Strong understanding of transport technologies (T1, T3, MPLS, Fiber, Ethernet, DSL, 4G, etc.)<br></li></ul><strong>Our Competencies for All Employees<br><br></strong><ul><li><strong>Drive for Results:</strong> Can be counted on to exceed goals successfully; is constantly and consistently one of the top performers; very bottom-line oriented; steadfastly pushes self and others for results.</li><li><strong>Customer Focus:</strong> Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</li><li><strong>Creativity</strong>: Comes up with a lot of new and unique ideas; easily makes connections among previously unrelated notions; tends to be seen as original and value-added in brainstorming settings.</li><li><strong>Interpersonal Savvy</strong>: Relates well to all kinds of people, up, down, and sideways, inside and outside the organization; builds appropriate rapport; builds constructive and effective relationships; uses diplomacy and tact; can diffuse even high-tension situations comfortably.</li><li><strong>Learning on the Fly:</strong> Learns quickly when facing new problems; a relentless and versatile learner; open to change; analyzes both successes and failures for clues to improvement; experiments and will try anything to find solutions; enjoys the challenge of unfamiliar tasks; quickly grasps the essence and the underlying structure of anything.</li><li><strong>Perseverance</strong>: Pursues everything with energy, drive, and a need to finish; seldom gives up before finishing, especially in the face of resistance or setbacks.</li><li><strong>Dealing with Ambiguity</strong>: Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; isn’t upset when things are up in the air; doesn’t have to finish things before moving on; can comfortably handle risk and uncertainty.<br></li></ul><strong>Our Competencies for All People Managers<br><br></strong><ul><li><strong>Strategic Agility</strong>: Sees ahead clearly; can anticipate future consequences and trends accurately; has broad knowledge and perspective; is future oriented; can articulately paint credible pictures and visions of possibilities and likelihoods; can create competitive and breakthrough strategies and plans.</li><li><strong>Building Effective Teams</strong>: Blends people into teams when needed; creates strong morale and spirit in their team; shares wins and successes; fosters open dialogue; lets people finish and be responsible for their work; defines success in terms of the whole team; creates a feeling of belonging in the team.</li><li><strong>Managerial Courage</strong>: Doesn’t hold back anything that needs to be said; provides current, direct, complete, and “actionable” positive and corrective feedback to others; lets people know where they stand; faces up to people problems on any person or situation (not including direct reports) quickly and directly; is not afraid to take negative action when necessary.<br><br></li></ul>Tapestry, Inc. is an equal opportunity and affirmative action employer and we pride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring, promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’s qualifications as they relate to the requirements of the position under consideration. These decisions are made without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. Visit Tapestry, Inc. at http://www.tapestry.com/<br><br>",
        "index": 9,
        "skills": [
            "information technology",
            "javascript",
            "machine learning",
            "software engineering",
            "web development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "AppFolio, Inc.",
        "location": {
            "city": "Santa Barbara",
            "state": "California"
        },
        "posted": "2020-12-02T02:59:42.561Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-appfolio-inc-2317675833?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=%2B0sCPnQoZDi%2B%2FADdejH3yw%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:42.561Z",
        "description": "<strong>Hi, We’re AppFolio.<br><br></strong>We’re innovators, changemakers, and collaborators. We’re more than just a software company — we’re a cloud-based powerhouse that creates products to make our customers’ lives easier. We’re revolutionizing the way people do business, and we want your ideas, your enthusiasm, and your passion to help us keep on innovating.<br><br><strong>We love where we work, and you can, too.<br><br></strong>To find out more about what AppFolio has to offer, check out <strong>appfolioinc.com/careers</strong>.<br><br>We are hiring a Full Stack Software Engineering Intern for Spring or Summer of 2020 to contribute to our rapid product development pace. We work collaboratively to set the technical direction for our SaaS products, developing easy-to-use solutions for our customers. Our engineers find a deep satisfaction in building things that customers actually need. We focus on delivering value to customers and understand that this often means delivering code that isn't perfect, but meets customer needs.<br><br>This is an ideal opportunity for someone who has a passion for building leading edge software and is driven to help build a successful SaaS product used by thousands of happy businesses. We foster an environment that empowers small teams to collaboratively set the technical direction of our solutions.<br><br>This opening is on our <strong>AppFolio Property Manager </strong>product development team.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Develop scalable, robust, and simple web-based solutions to solve complex business problems</li><li>Formulate, implement, and evaluate algorithms and database queries to support SaaS scalability and stability.</li><li>Implement new features and optimize existing ones to drive maximum performance</li><li>Use test-driven development, code reviews and continuous integration to deliver high quality software, and rapidly fix bugs as they come up.</li><li>Work closely with, and incorporate feedback from other engineering team members, QA, and product owners, and our APM customers</li><li>Leveraging agile practices, encourage collaboration, prioritization, and urgency to develop at a rapid pace</li><li>Research, share, and recommend new technologies and trends<br></li></ul><strong>You know you’re the right fit if…<br></strong><ul><li>You’ve heard of Ruby and Rails, and have some experience working with a language like Ruby, Java, or Python. You may even know enough about Javascript to have opinions about how frequently \"the new hot thing\" changes.</li><li>You love learning about new technologies, but understand the value of continuing to use something old if it still does everything you need it to do.</li><li>You care about the long-term maintainability of the codebase and will learn to advocate for refactoring and clean-ups where appropriate.</li><li>You care about work life balance and want your company to care about it to; you'll put in the extra hour when needed but won't let it become a habit.<br><br></li></ul><strong><u>Additional Skills And Knowledge<br></u></strong><ul><li>Currently pursuing BS, MS, or Ph.D in Computer Science or related technical discipline</li><li>Hands-on work/internship experience developing web-based applications, preferably in a SaaS environment</li><li>Creativity, ability to solve complex problems without a roadmap<br><br></li></ul><strong><u>Nice To Have<br></u></strong><ul><li>Experience working across all levels of the development stack</li><li>Experience with some areas of our tech like Ruby on Rails, React, Redux, AWS, SOA</li><li>Familiarity with Agile software development processes: Scrum or Kanban</li><li>Familiarity with Test-Driven-Development<br></li></ul>If you are interested in creating exceptional SaaS products, and contributing to a successful company, apply today!<br><br><em>We gladly accept applicants who meet only a few of these requirements. If AppFolio sounds like a place you'd fit, we’d love to hear from you. Talented engineers come from varied experience backgrounds!<br><br></em><strong>Our Story<br><br></strong>AppFolio (NASDAQ: APPF) was founded in 2006 with the mission to revolutionize vertical industry businesses by providing great software and service. Our easy-to-use, cloud-based software helps our customers more effectively market, manage, and grow their businesses. Today our software solutions exist in two verticals including the real estate (AppFolio Property Manager, AppFolio Property Manager PLUS, and AppFolio Investment Manager) and legal (MyCase) industries.<br><br>To find out more about what AppFolio has to offer, check out <strong>appfolioinc.com/careers</strong>.",
        "index": 10,
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "machine learning",
            "information technology",
            "react"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Braze",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-12-03T02:59:42.931Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-braze-2188758428?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=ozGL6760hY9C%2FLjuHIp39Q%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:42.931Z",
        "description": "<strong><u>Who We Are<br><br></u></strong>Braze delivers customer experiences across email, mobile, SMS, and web. Customers, including Seamless, HBO, Disney, Urban Outfitters, and Venmo, use the Braze platform to facilitate real-time experiences between brands and consumers in a more authentic and human way. And we do it at scale – each month, tens of billions of messages are sent to a network of over 2 billion active users through Braze.<br><br>Need more proof? Braze was named a Leader in the Gartner Magic Quadrant for Mobile Marketing Platforms in 2019. The company has also been named on the Forbes Cloud 100, Inc. Magazine’s 2019 Best Places to Work, and Crain's 2019 Best Places to Work in NYC lists.<br><br><strong><u>What You'll Do<br><br></u></strong>You'll work with a team of skilled engineers and a dedicated mentor on real-world product features (maybe even sold to customers while you're here!) on a wide range of sophisticated problems in everything from API and web design to systems engineering and data infrastructure. Summer 2021 internship.<br><br><strong><u>Who You Are<br></u></strong><ul> <li>Pursuing a degree in Computer Science, or equivalent</li> <li>Intellectually curious, passionate, and inventive</li> <br><br></ul><strong><u>What We Offer<br></u></strong><ul> <li>Competitive compensation </li> <li>Free daily lunch in the office, including snacks and beverages </li> <li>Collaborative, transparent, and fun loving office culture</li> <br></ul><em>If you are a California resident subject to the California Consumer Privacy Act, click here to understand how Braze processes your personal information and how you can exercise your rights.<br><br></em><strong><u>What We Offer<br></u></strong><ul> <li>Competitive compensation </li> <li>Free daily lunch in the office, including snacks and beverages </li> <li>Collaborative, transparent, and fun loving office culture</li> <br></ul><em>If you are a California resident subject to the California Consumer Privacy Act, click here to understand how Braze processes your personal information and how you can exercise your rights.</em>",
        "index": 11,
        "skills": [
            "information technology",
            "software engineering",
            "cloud computing"
        ],
        "remote": false
    },
    {
        "position": "2021 Summer Internship - IT and Computer Science",
        "company": "Barrick Gold Corporation",
        "location": {
            "city": "Elko",
            "state": "Nevada"
        },
        "posted": "2020-11-23T02:59:43.305Z",
        "url": "https://www.linkedin.com/jobs/view/2021-summer-internship-it-and-computer-science-at-barrick-gold-corporation-2329190608?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=O0Id3mvF4QQHp0ayTQoefw%3D%3D&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:43.305Z",
        "description": "<strong><u>Position Description<br><br></u></strong>At Nevada Gold Mines, our vision is to be the world’s most valued gold mining business by finding, developing and operating the best assets with the best people. At Nevada Gold Mines we are committed to a safe work environment sending every person home safe and healthy every day and leaving a sustainable legacy on our host communities. We will be notifying candidates of our selections starting Jan 2021<br><br><strong><u>Responsibilities<br><br></u></strong>Our interns will have an opportunity to complete challenging and rewarding projects in their field of study, working side by side with our professionals in the field. By applying for an internship opportunity, you may be considered for an internship at any one of our Nevada Gold Mines locations.<br><br><strong><u>Qualifications<br></u></strong><ul> <li>Must be able to complete an internship lasting a minimum of ten (10) weeks between May 1 and September 1, 2021.</li> <li>Must be enrolled in school for the Fall 2021 semester (proof of enrollment required).</li> <li>Must have a cumulative GPA of 3.0 or higher (transcripts required).</li> <li>Must be able to pass Nevada Gold Mines’ pre-employment physical, which includes drug and alcohol testing as well as metals testing (where applicable).</li> <br><br></ul><strong><u>What We Can Offer You<br></u></strong><ul> <li>Ability to make a difference and lasting impact</li> <li>Work in a dynamic, collaborative, progressive, and high-performing team</li> <li>An Opportunity to transform Traditional Mining into the future of Digital Mining</li> <li>Opportunities to grow and learn with the industry colleagues are endless</li> <li>Access to a variety of career opportunities across Nevada Gold Mine locations</li> <li>Nevada Gold Mines is committed to creating a diverse environment and is proud to be an equal opportunity employer</li> <br><br></ul><strong><u>About Nevada Gold Mines<br><br></u></strong>Nevada Gold Mines is a joint venture between Barrick Gold Corporation (61.5%) and Newmont Goldcorp Corporation (38.5%), combining their significant assets across Nevada to create the single largest gold-producing complex in the world and realize the full potential of these mines through synergies and best-in-class operational improvements.<br><br>The massive mining operation comprises 8 mines along with their associated infrastructure and processing facilities that produced an estimated 4 million ounces of gold in 2018. Three of these assets are Tier One gold mines: Barrick’s Cortez; the combination of Barrick’s Goldstrike and Newmont Goldcorp’s Carlin; and the combination of Barrick’s Turquoise Ridge and Newmont Goldcorp’s Twin Creeks. In addition, Barrick’s Goldrush-Fourmile project has the potential to become the fourth Tier One asset in this portfolio. The new JV is expected to generate around $5 billion in cost savings over the next five years. Nevada Gold Mines is operated by Barrick.<br><br><em>Thank you for your application, however, only those selected for an interview will be contacted.</em>",
        "index": 12,
        "skills": [
            "machine learning"
        ],
        "start": "2021-01-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Summer IT Computer Science Internship - Buffalo, NY",
        "company": "Moog Inc.",
        "location": {
            "city": "East Aurora",
            "state": "New York"
        },
        "posted": "2020-11-23T02:59:43.675Z",
        "url": "https://www.linkedin.com/jobs/view/summer-it-computer-science-internship-buffalo-ny-at-moog-inc-2315727920?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=ir5YaENTZdWT84TjXY3M5A%3D%3D&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:43.675Z",
        "description": "<strong><em>This is not work experience, this is an opportunity to experience work.<br><br></em></strong>An Intern is an investment in Moog’s future. The intern relationship provides a three-way benefit between the student, university, and Moog. It is an opportunity for the student to incorporate classroom learning into professional, real world situations. The student brings new ideas to Moog on how to tackle projects and challenges, while Moog benefits from fresh perspectives from the brightest students in their respective fields of study. By having the students work on actual programs, we also work towards solving our customers’ most difficult technical challenges<em>.<br><br></em><strong>Moog’s Corporate Group, in the Buffalo, NY area, is seeking IT and Computer Science students for Summer Internships &amp; Co-Ops!<br><br></strong>As part of the Moog U.S. Internship Program, this position provides strategic and tactical support to programmers, analysts, project leaders, and end-users on application development. Information Technology (IT) work is carried out in support of Moog's engineering, manufacturing, business, and e-business activities.<br><br>The student will contribute to their respective departments with the application of standard techniques, procedures, and criteria in carrying out a variety of tasks.<br><br>The student will work on discipline-focused projects and tasks to enhance their collegiate learning experience, while providing meaningful contributions to the Moog IT Team(s).<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Contribute to the preparation and execution of key IT projects at Moog.</li> <li>Provide input on project processes, strategies, and execution.</li> <li>Operate as a multidisciplinary member of the team of creative, independent individuals.</li> <li>Represent Moog in a manner consistent with its technical and professional reputation.</li> <li>Work experience may include (but is not limited to) database administration, network administration, configuration management, SharePoint Administration, and operations.</li> <li>Application development activities could include research, requirements definition, analysis, design, coding, testing and documentation. </li> <li>The student may also be given opportunities to explore newer technologies or apply course training at Moog.</li> <br><br></ul><strong><u>Basic Requirements<br></u></strong><ul> <li>Enrollment in Bachelor's or Master's curriculum in Information Technology, or Computer Science, from an accredited university</li> <li>GPA of <u>at least</u> 3.0</li> <li>This position requires access to U.S. export-controlled information.</li> <li>Due to the current and changing COVID-19 restrictions, relocation may not be possible for certain assignments.</li> <br><br></ul><strong>Students within the Moog U.S. Internship Program are expected to have a professional disposition, with effective communication skills, a strong desire to learn, a positive attitude, and the ability to work in a team environment.<br><br></strong><li>Please note this requisition is for sourcing purposes and will be used to fill individual openings as they become available.<br><br></li>EOE/AA Minority/Female/Disability/Veteran/Sexual Orientation/Gender Identity",
        "index": 13,
        "skills": [
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "CACI International Inc",
        "location": {
            "city": "Dulles",
            "state": "Virginia"
        },
        "posted": "2020-12-05T02:59:43.985Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-summer-2021-at-caci-international-inc-2323130081?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=QiKcR0AjZ66IT6PJcProIg%3D%3D&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:43.985Z",
        "description": "<strong><u>Job Description<br><br></u></strong>We are seeking candidates for our National &amp; Cyber Solutions (NCS) Summer Internship Program on various software and hardware development teams. CACI's National and Cyber Solutions (NCS) business group is comprised of over 1,300 engineering, data science, cyber security and signals intelligence experts. We are contributors to every step of the intelligence lifecycle and leverage an agile development methodology that provides rapid prototyping, quick reaction, operational support and solutions to a diverse customer base.<br><br><strong><u>What You’ll Get To Do<br></u></strong><ul><li>You will work on a team responsible for design and development of cutting edge space-based precision timing system and user interface features that provide real time indications and warnings to the warfighter for a complex and rapidly evolving mission. </li><li>You will get to be part of a team of fun and energized engineers working within a product family to field tactical SIGINT collection systems to the DoD.</li><li>You will support some of our nation's most pressing mission objectives through:</li><li>Innovative design, development, and deployment of technical solutions and services to support the Intelligence, Homeland Security, and Defense community.</li><li>Command, Control, Communications, Computers, Intelligence Surveillance and Reconnaissance (C4ISR).</li><li>Cyber technology including emerging Cyber/RF spectrum operations, active defense solutions, and platform resilience against cyber attacks.</li><li>Mission tool development, including enterprise situational awareness, intelligence analysis, and advanced visualization applications.</li><li>Rapid Research and Development (R&amp;D), prototyping, integration, and testing.<br><br></li></ul><strong><u>You’ll Bring These Qualifications<br></u></strong><ul><li>Strong communication skills</li><li>Microsoft Office Proficiency</li><li>Ability to grasp basic engineering fundamentals</li><li>Basic understanding of software fundamentals</li><li>Must currently be enrolled in High School OR a full-time Undergraduate, Graduate, or</li><li>Doctorate student</li><li>Must be able to obtain and maintain security clearance (if applicable to position)<br><br></li></ul><strong><u>These Qualifications Would Be Nice To Have<br></u></strong><ul><li>Basic understanding of Java.</li><li>If Undergraduate or Graduate, pursing a degree in computer science or related field is preferred, not required.</li><li>Minimum GPA of 3.0 or higher is preferred, not required.</li><li>Previous internship/co-op or other work experience, leadership and teamwork capabilities, interpersonal communication skills, and activities(professional/community/extracurricular)<br><br></li></ul><strong><u>What We Can Offer You<br></u></strong><ul><li>We’ve been named a Best Place to Work by the Washington Post.</li><li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li><li>We offer competitive benefits and learning and development opportunities.</li><li>We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.</li><li>For over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success.<br></li></ul>INRN2<br><br><strong>Job Location<br><br></strong>US-Dulles-VA-VIRGINIA SUBURBAN<br><br>CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities.",
        "index": 14,
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "data visualization",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern, Front End",
        "company": "Wing",
        "location": {
            "city": "Palo Alto",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:44.261Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-front-end-at-wing-2315390275?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=AKmPMgNkL4fXlGBWZJbX9g%3D%3D&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:44.261Z",
        "description": "<strong>About Wing: <br><br></strong>Wing is reshaping the future of delivery. We are an on-demand drone delivery service that can deliver food, medicine or other items within minutes. We've also developed an unmanned traffic management platform to safely route drones through the sky. Our service is faster, safer and produces far less pollution than traditional delivery. Originally created in 2012 within X, the Moonshot Factory, Wing is now an Alphabet company.<br><br><strong>About the Program: <br><br></strong>Wing's Summer 2021 internship will take place virtually in the United States. This 12 week program is for students in their graduating year of school. We will review applications and interview candidates on a rolling basis until March 2021.<br><br>Students from all schools, and students who identify with a group that is historically underrepresented in the technology industry are encouraged to apply. This includes but is not limited to: Black/African American, Latinx/Hispanic, Native American, students with disabilities, veterans, and non-binary people.<br><br><strong>About the Role: <br><br></strong>Wing is looking for an intern to join the Human Drone Interaction team! This intern will work with OpenSky, Wing's Unmanned Traffic Management system to enhance the user interface application layer.<br><br><strong>What You'll Need: <br><br></strong><ul> <li>Proficiency in JavaScript or TypeScript</li> <li>Knowledge of HTML, CSS</li> <li>Currently pursuing a Bachelor's, Masters or PhD degree in Computer Science or related field, with an anticipated graduation date after December 2021</li> <li>Strong examples of hands-on engineering experience from university programs, internships, or student organizations</li> <br></ul><strong>Bonus: <br><br></strong><ul> <li>Passion for aviation, drones, or related technologies</li> <li>Experience developing your own side projects with ideas you're passionate about</li> <br></ul><strong>Note: <br><br></strong>Participation in the internship program requires that you are located in the United States for the duration of the internship program. Individuals applying for this position will not be eligible for immigration sponsorship.",
        "index": 15,
        "skills": [
            "javascript",
            "software engineering",
            "information technology",
            "web development"
        ],
        "due": "2021-03-01T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "URBN: Summer 2021 IT Internships: Software Engineering",
        "company": "URBN (Urban Outfitters, Anthropologie Group, Free People & Nuuly)",
        "location": {
            "city": "Philadelphia",
            "state": "Pennsylvania"
        },
        "posted": "2020-12-07T02:59:44.651Z",
        "url": "https://www.linkedin.com/jobs/view/urbn-summer-2021-it-internships-software-engineering-at-urbn-urban-outfitters-anthropologie-group-free-people-nuuly-2318301182?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=ie%2FTtCHJn01J%2FvhNUo8H%2BA%3D%3D&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:44.651Z",
        "description": "At URBN, we pride ourselves on more than just our unique products and successful portfolio of brands. We source the best of the best talent to drive our business forward, and our Interns are a crucial part of that equation. Our Interns have the unique opportunity to gain valuable hands-on experience across a range of departments and brands with exposure to company leaders, engaging workshops/excursions and our creative &amp; entrepreneurial culture.<br><br>URBN is a portfolio of global consumer brands comprised of Urban Outfitters, Anthropologie, Free People, BHLDN, Terrain, Nuuly and URBN Food &amp; Beverage. We create unique retail experiences with an eye toward creativity and a singular focus on pleasing our customer.<br><br>The 2021 Program dates are to be determined. Our Summer Internships typically run from June to August.<br><br><strong>Title<br><br></strong><strong>Software Engineer Intern<br><br></strong><strong><u>Overview<br><br></u></strong>The Software Engineer Intern will be an integral part of each phase of the software development lifecycle including design, development, deployment, testing and maintenance. The primary focus will be on enhancing our Ecommerce platforms supporting the online shopping experience for our brands including Anthropologie.com, UrbanOutfitters.com, FreePeople.com.<br><br><strong><u>What To Expect<br></u></strong><ul> <li>Develop new product features and advance the design of existing code for the Ecommerce applications</li> <li>Opportunity to use programming languages like python, Golang, Javascript, HTML &amp; CSS</li> <li>Opportunity to use databases like MongoDB &amp; Oracle</li> <li>Participate in full software development lifecycle</li> <li>Work on a scrum team with other software engineers, QA and Business Analysts</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Understanding of OO principles and design patterns</li> <li>Enjoys working in a collaborative team setting</li> <li>Self-starter, ready to learn new concepts and technologies. Willing to take on responsibility for new features and develop them from inception to completion</li> <li>Currently pursuing a Bachelor’s Degree in Computer Science or a related field</li> <br><br></ul><strong>Location<br><br></strong>Philadelphia, PA<br><br><strong><u>Application Process<br><br></u></strong><li>Submit a completed application via our careers website<strong>. </strong></li> <li><strong>Complete HireVue: Within 2 weeks of submitting applications, candidates will receive an email with a link to complete a HireVue Video Interview. Candidates will have 2 days to complete this portion of the application once the email is received.</strong></li>",
        "index": 16,
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "machine learning",
            "information technology",
            "web development"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern, SW Engineering",
        "company": "Mercedes-Benz Research & Development North America, Inc.",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-03T02:59:44.947Z",
        "url": "https://www.linkedin.com/jobs/view/intern-sw-engineering-at-mercedes-benz-research-development-north-america-inc-2320477829?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=1nmg2lNyGa2CYrDcPEqIqg%3D%3D&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:44.947Z",
        "description": "Embedded in a worldwide network Mercedes-Benz Research &amp; Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.<br><br>During your internship you will be supporting engineering projects for voice applications in Daimler ecosystems and vehicles. You will be responsible for prototype software and contribute to feature and functional specifications.<br><br><strong><u>Key Tasks &amp; Responsibilities<br></u></strong><ul><ul><li>Software Development and testing of progressive and regressive features for the Digital Voice Assistants (Amazon Alexa, Google Assistant Mercedes me integration)</li><li>Conceptualize, develop and write software architectures and implementations for IoT technologies</li><li>Document technical software solutions or specifications</li><li>Coordinate and participate testing, validation, debugging of software and system architecture</li><li>Collaborate with other engineers, designers and user experience experts to find solutions software implementation and integration tasks</li><li>Develop new software prototypes and mass production frameworks</li><li>Integrate and test software in prototyping cars or demonstration hardware</li><li>Actively demonstrate cross-functional collaboration with other engineers, designers, user experience experts and researchers<br><br></li></ul></ul><strong>Minimum level of education required and required field of study:<br></strong><ul><ul><li>Enrolled in a Bachelor’s degree in Software/Computer Engineering or Engineering and Natural Science with additional Computer Science knowledge (or equivalent)<br><br></li></ul></ul><strong><u>Minimum Skills Required<br></u></strong><ul><ul><li>Strong understanding of operating systems and computer architecture fundamentals. Java or JavaScript / NodeJS, RESTful API, MySQL, NoSQL. </li><li>Experience in iOS or Android apps development. </li><li>Experience integrating 3rd party API/SDK in iOS/Android Apps. </li><li>Ability to analyze complex problems, recognizes and explains connections between cause-and-effect understandably and develops concrete, viable solutions taking risks and obstacles into account. </li><li>Ability to work in inter-cultural, inter-disciplinary teams across multiple time zones. </li><li>Able to learn quickly and willing to share knowledge. </li><li>Attention to detail, Strong Team player. </li><li>Open to international travel, for approximately 10% of the time.</li><li>Will accept equivalent work experience in lieu of formal education: No</li><li>Minimum years of experience required (Non-exempt positions only): 0 years</li><li>Combination of Degree and Years of experience acceptable (minimum) : Associates</li><li>Other licenses or certifications required : Valid US Driver License<br><br></li></ul></ul><strong><u>Preferred Qualifications<br></u></strong><ul><ul><li>Good Knowledge about Digital Voice Assistants (Google Assistant, Amazon Alexa, Apple Siri and others)</li><li>Understanding of design patterns and software architecture</li><li>Multiple apps published in Apple and Google app stores</li><li>Java, C/C++, JavaScript, Python, Swift, Objective-C</li><li>Experience with location based services</li><li>Knowledge in Backend and embedded car system technologies<br><br></li></ul></ul><strong>Why should you apply?<br><br></strong>Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.<br><br>MBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.<br><br>MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.<br><br><em>Thank you for your interest in Mercedes-Benz Research &amp; Development North America. Please be aware the impact of COVID-19 could increase the amount of time it takes our HR and Hiring Team to process your application. We apologize for any inconvenience this may cause. We are dedicated to the health and safety of our employees and candidates. We appreciate your patience during this time.<br><br></em>Mercedes-Benz Research and Development North America, Inc.<br><br><strong>PRIVACY AGREEMENT FOR JOB APPLICANTS (Lever)<br><br></strong><u>Information on the processing and use of your data in the context of <br><br></u><u>submitting an application for employment.<br><br></u>This Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.<br><br>The Daimler Company and its affiliates that have advertised the vacancy <u>is responsible</u> for data processing. You will find the details in the job advertisement.<br><br>The <u>categories of data</u> that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for <u>special categories of personal data</u> (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.<br><br>We process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the <u>purpose</u> of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).<br><br>The <u>recipients</u> of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software.<br><br><strong><u>As An Applicant, You Have The Right<br><br></u></strong>To request information from the company your personal data it has stored.<br><br>To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.<br><br>To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.<br><br>To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.<br><br>To complain to the company if you believe that the processing of your personal data violates the law.<br><br><strong><u>Therefore, We Regularly Delete Your Personal Data As Follows<br><br></u></strong>The company limits the <u>storage</u> of your data to the period of time required by applicable law.<br><br>The application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months [MB1] .<br><br>You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.<br><br>Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.<br><br>The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.<br><br>A cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.<br><br>A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.<br><br>We collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.<br><br>We do not respond to browser \"do not track\" signals at this time.<br><br>If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship.<br><br><u><strong>PRIVACY NOTICE FOR CALIFORNIA RESIDENTS<br><br></strong></u><strong><u>Category Of Personal Information<br><br></u></strong>When you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:<br><br>identifiers<br><br><strong><u>Source(s)<br><br></u></strong>Directly from you<br><br><strong><u>Purpose(s)<br><br></u></strong>Determining eligibility for employment<br><br>Contacting you about future job opportunities<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Personal information categories listed in the California Customer Records statute (Cal. Civ. Code <li>1798.80(e))<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Geolocation data<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Professional or employment-related information<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong>Access</strong> : You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to <strong>‘Privacy Agreement for Job Applicants (Lever)’</strong> in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions.<br><br><u><strong>Changes to our Privacy Agreement<br><br></strong></u>Our business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.<br><br>This Privacy Agreement is effective on January 1, 2020.</li>",
        "index": 17,
        "skills": [
            "machine learning",
            "software engineering",
            "information technology",
            "javascript",
            "python",
            "java"
        ],
        "contact": "mbrdna@daimler.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Internship Opportunities - Software & Data Engineering",
        "company": "SeatGeek",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-11-16T02:59:45.240Z",
        "url": "https://www.linkedin.com/jobs/view/internship-opportunities-software-data-engineering-at-seatgeek-2241583133?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=1mZ9Ygbi8b%2BIuXYAtTNNZg%3D%3D&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:45.240Z",
        "description": "The ticketing industry is messy, complex, and makes attending live events more difficult than it needs to be; we believe a thoughtful application of software can fix that.<br><br>We’re looking for bright, curious engineers who want to help millions of people experience the thrill of live entertainment. SeatGeek is a product-centric organization that deploys code into production multiple times per day. As our product continues to grow, so does the scale of our technical challenges, and their impact on our customers. We want to ensure that we continue to build delightful experiences for fans all over the world.<br><br>With live events across the globe currently locked down or limited, the ticketing industry has never had more challenges to face or complexity to unravel — socially distanced seating, timed event entry, mass reschedulings, and more. But while the majority of live events are on pause, we’re working hard to make sure SeatGeek is positioned to help people get together and experience more live as things open back up… come help us build the software that powers it all!<br><br><strong><u>We Are Looking For People Who<br></u></strong><ul> <li>Plan to graduate no later than Spring 2022 (rising Seniors) with a degree in Computer Science or a related field</li> <li>Have relevant experience pushing code to production</li> <li>Are excited by understanding software and figuring out how it should work</li> <li>Enjoy working with a diverse group of people with different experiences and take pride in mentoring and learning from others</li> <br></ul>To see the Internship roles we currently have available, take a look at the descriptions below. In your application, you’ll have the chance to specify up to 3 roles that you’re most interested in.<br><br><strong>Backend<br><br></strong>SeatGeek has an ever-evolving product that's reshaping the way the ticketing industry works. We're looking for an engineer who wants to make it easier for millions of people experience the thrill of live entertainment with the thoughtful application of software. We use Python, C#/.NET Core, and Go although specific knowledge of those is not a prerequisite.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Create custom solutions to rather unique ticketing problems, including venue mapping, inventory tracking, and event matching.</li> <li>Collaborate with frontend developers on a full stack team to develop new features and products</li> <li>Work with product managers and internal stakeholders to bring ideas to life</li> <br></ul><strong>Frontend<br><br></strong>We're looking for an engineer who's focused on building beautiful, performant, and inclusive user interfaces. You are an engineer who cares as much about the elegance of UIs as you do about the code and architecture that powers them. We use TypeScript and React to create our user interfaces, although specific knowledge of those is not a prerequisite<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Build interactive, thoughtful, and inclusive UIs in React</li> <li>Create components and APIs for SeatGeek's frontend libraries</li> <li>Work with backend developers on a full-stack team to develop new features and products</li> <li>Collaborate with the SeatGeek design team and product managers to bring ideas to life</li> <br></ul><strong>iOS<br><br></strong>SeatGeek is focused on significantly improving the experience of going to live events using our best-in-class mobile applications. We’re looking for an engineer who is ready to dive into all aspects of our iOS app — from user interfaces and animations to networking and business logic. We use a mix of Swift &amp; Objective-C.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Own the development of new features, from conception, through design and development, to release</li> <li>Collaborate with designers to craft pixel-perfect UI and animations</li> <li>Use tools such as Jenkins and Fastlane to improve our continuous integration and continuous development pipeline</li> <li>Partner with iOS engineers to explore new Apple tools like SwiftUI and Combine</li> <br></ul><strong>Android<br><br></strong>SeatGeek’s mission is to help the world experience more live—concerts, sports, theater, and more—and these days we expect to use our phones to do just about everything, so our Android app is essential to fulfilling that vision. The Android engineering team at SeatGeek features active members of the Android community working to provide second-to-none mobile experiences. We use Kotlin, Jetpack, MVI and more, and follow best practices and Google guidelines to build a modern and scalable application.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Work with a team of developers that are passionate about building applications for the Android platform</li> <li>Collaborate with backend engineers, design &amp; product teams to build an experience that stands out among the best applications on Android</li> <li>Ensure the Android team is always on the forefront of adopting new tools, technologies and processes to make our development as pragmatic &amp; efficient as possible</li> <br></ul><strong>Data Platform<br><br></strong>SeatGeek’s product, clients, and internal teams are always hungry for data to help make decisions and measure performance. That’s where you come in. The Data Platform team ensures that SeatGeek’s analysts, data scientists, business stakeholders, and clients can make productive use of data, and we’re looking to add engineers who are passionate about all manner of software that makes data easier to work with, develop on, and interpret. We use Python, Scala, Spark, and Flink among other frameworks, but specific experience is not required.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Build internal tools to enhance the usability, observability, or performance of our ETL systems, including our open-source SQL ETL tool, Druzhba</li> <li>Work on systems that stream data in real-time from the ticket market into algorithms and databases that power our product</li> <li>Implement algorithms for transforming raw data into usable information, such as sessionization and identifier stitching</li> <br></ul><strong>Perks<br></strong><ul> <li>Equity stake in a well-funded growth stage company</li> <li>A superb benefits package that supports health/dental/vision. We also provide annual subscriptions to Headspace, Ginger.io, and One Medical</li> <li>A focus on transparency. We have regular company meetings and Q&amp;A panels where employees can chat openly with teams across SeatGeek, our co-founders, and external guests from the industry</li> <li>Although this perk is currently on pause, we can’t help but talk about it. SeatGeek employees receive a monthly ticket-purchase stipend, and we cannot wait to get back to safely attending the live events that we so dearly miss</li> <li><strong>Covid-19 Response:</strong> We’re not expecting employees to return to the office until July 2021 at the earliest. Once it’s again safe to do so, we look forward to welcoming people back to our offices. In the meantime, we’re offering a $1000 reimbursement to create your ideal workspace at home</li> <br></ul><em>SeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!</em>",
        "index": 18,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "scala",
            "C and C++",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Intern Bachelors Software Engineer",
        "company": "Honeywell",
        "location": {
            "city": "Atlanta",
            "state": "Georgia"
        },
        "posted": "2020-12-03T02:59:45.531Z",
        "url": "https://www.linkedin.com/jobs/view/intern-bachelors-software-engineer-at-honeywell-2330594230?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=qYs3hMYkkbtm1LXFDY4mhQ%3D%3D&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:45.531Z",
        "description": "Design solutions to drive safe living and quality of life<br><br>The future is what you make it.<br><br>When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all our employees enjoy access to dynamic career opportunities across different fields and industries.<br><br>Are you ready to help us make the future?<br><br>Join a team that designs, develops and integrates highly complex software applications within Honeywell. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.<br><br>Use your skill set to provide value added software features to our products for our customers.<br>Accelerate innovation and growth, teaming with the world's most talented engineers.<br><br>We invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for!<br><br><strong>YOU MUST HAVE<br><br></strong><li> Currently pursuing a Bachelor’s or Master’s degree from an accredited college or university in Software Engineering or Computer Science</li><li> Must graduate after December 2021</li><li> Must continue enrollment in degree program upon completion of the internship<br><br></li><strong>WE VALUE<br><br></strong><li> Understanding various software development lifecycle</li><li> Demonstrate the ability to develop efficient and high-quality software</li><li> Knowledge of software configuration management and change management practices</li><li> Diverse and global teaming and collaboration</li><li> Excellent oral and written communication skills</li><li> Effective communicator</li><li> Can quickly analyze, incorporate and apply new information and concepts</li><li> Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness</li><li> Validated academic excellence (3.0 GPA and higher)<br><br></li>Additional Information<br><br><ul><li><strong>JOB ID: </strong>req241710</li><li><strong>Category: </strong>Engineering</li><li><strong>Location: </strong>715 Peachtree Street, N.E.,Atlanta,Georgia,30308,United States</li><li>Nonexempt<br></li></ul>Engineering (GLOBAL)<br><br>Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
        "index": 19,
        "skills": [
            "software engineering",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Computer Science Engineering Internship",
        "company": "Musco Lighting",
        "location": {
            "city": "Oskaloosa",
            "state": "Iowa"
        },
        "posted": "2020-11-23T02:59:45.838Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-engineering-internship-at-musco-lighting-2325965402?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=%2B9DVB4KFct%2Fx3R%2FfnPlbSQ%3D%3D&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:45.838Z",
        "description": "Musco Lighting, the leader in the sports lighting industry, has internship opportunities for people who want to work with a team that is large enough to provide world-class opportunities, small enough for each intern to make a difference. Our company is seeking an energetic, responsible Computer Science student to join our growing internship program. In this position, you will be working with our Research &amp; Development teams in Oskaloosa, Iowa. This position is for the summer of 2020.<br><br><strong><u>Database Development<br><br></u></strong><strong>Intern Duties and Responsibilities:<br></strong><ul> <li>Develop SQL applications, query development, implementation of SQL server triggers</li> <br><br></ul><strong><u>Test Data Analysis<br></u></strong><ul> <li>Develop custom code to automate the data analysis process utilizing specialized controls in the software developers kit (SDK) provided by the manufacturer.</li> <br><br></ul><strong><u>Intern Requirements And Qualifications<br></u></strong><ul> <li>High school degree or equivalent; must be enrolled in an accredited university/college program</li> <li>Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)</li> <li>Must be 18 years of age</li> <li>Excellent written and verbal communication skills</li> <li>Self-directed and able to work without supervision</li> <li>Energetic and eager to tackle new projects and ideas </li> <br></ul><strong>Behaviors<br><br></strong><strong><u>Preferred<br></u></strong><ul> <li>Innovative: Consistently introduces new ideas and demonstrates original thinking</li> <li>Enthusiastic: Shows intense and eager enjoyment and interest</li> <li>Detail Oriented: Capable of carrying out a given task with all details necessary to get the task done well</li> <br></ul><strong>Motivations<br><br></strong><strong><u>Preferred<br></u></strong><ul> <li>Self-Starter: Inspired to perform without outside help</li> <li>Goal Completion: Inspired to perform well by the completion of tasks</li> <br></ul>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br><br>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)",
        "index": 20,
        "skills": [
            "C and C++",
            "software engineering",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "HashiCorp",
        "location": {
            "city": "Oakland",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:46.122Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-hashicorp-2232889276?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=9ZY2zFZQ1UHLVeEsxktpdg%3D%3D&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:46.122Z",
        "description": "<strong>Software Engineer Intern<br><br></strong><strong><u>About HashiCorp<br><br></u></strong>HashiCorp is a fast-growing startup that solves development, operations, and security challenges in infrastructure so organizations can focus on business-critical tasks. We build products to give organizations a consistent way to manage their move to cloud-based IT infrastructures for running their applications. Our products enable companies large and small to mix and match AWS, Microsoft Azure, Google Cloud, and other clouds as well as on-premises environments, easing their ability to deliver new applications for their business.<br><br><strong><u>About The Role<br><br></u></strong>At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.<br><br>Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.<br><br>This role is for a Software Engineering Intern on one of the Vault, Terraform, or Cloud teams at HashiCorp. Each of these teams works on both open source and enterprise versions of each tool, programming primarily in Go with a focus on stability, reliability, performance, and security. Our infrastructure tools are used in critical environments and operated by a range of organizations and individuals to solve infrastructure management problems.<br><br>This role provides an opportunity to help design, prototype, and implement core features while ensuring the stability of the product across a range of use-cases. Our teams work can be viewed on GitHub in the products (for Vault, Terraform, or Consul) or in libraries our teams depend on, like raft, memberlist, and go-plugin.<br><br><strong>In this role, you can expect to learn how to...<br></strong><ul> <li>Contribute to the HashiCorp community by providing code review, and support to HashiCorp employees, community members, and partners</li> <li>Advocate and support improvements to product APIs and core to improve development and integration of tools and plugins</li> <li>Build and architect systems for managing extremely large-scale global fleets of resources</li> <li>Work on issues and improvements critical to the success of HashiCorp customers and the broader community</li> <li>Own the full lifecycle of feature development from design through testing and release</li> <li>Program in Golang, learning from and contributing to a team committed to continually improving their skills</li> <br></ul><strong>You may be a good fit for our team if you...<br></strong><ul> <li>Are currently pursuing a bachelor's degree in Engineering, Computer Science or equivalent training in the United States</li> <li>Have academic or some professional experience working in a professional environment is preferred</li> <li>Have some proficiency in Go, Python, Java, or C++</li> <li>Have fundamental knowledge in security, distributed systems, service oriented architectures or schedulers</li> <li>Have excellent analytical and problem-solving skills</li> <li>Have the ability to work in a fast paced, team-based environment</li> <li>Exhibit ownership in your work, including research and understanding of the problem space, collaborating with the team to come up with solutions, proactively communicating your progress to the team, and shipping the feature over the finish line</li> <li>Have strong written and verbal communication skills</li> <li>Are well-organized, excellent work ethic, attention to detail, self-starting, and an ability to learn</li> <li>Are creative thinkers who also understand real-world products </li> <li>Have the constant desire to grow, learn, and explore new things</li> <li>Emulate the HashiCorp principles</li> <br></ul>Please submit a cover letter that demonstrates your writing skills and tells us about your interest in being part of the HashiCorp story.<br><br>At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you meet our requirements, please apply anyway! If you are interested in working on a specific tool or product, please note it in your cover letter. Candidates participate with hiring managers in team selection to ensure the right fit.",
        "index": 21,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "java",
            "C and C++",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Backend Software Engineering Intern",
        "company": "Confluent",
        "location": {
            "city": "Mountain View",
            "state": "California"
        },
        "posted": "2020-12-05T02:59:46.436Z",
        "url": "https://www.linkedin.com/jobs/view/backend-software-engineering-intern-at-confluent-2200187600?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=z2rYMI3LFeESycfgSowpLQ%3D%3D&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:46.436Z",
        "description": "Dubbed an \"open-source unicorn\" by Forbes, Confluent is the fastest-growing enterprise subscription company our investors have ever seen. And how are we growing so fast? By pioneering a new technology category with an event streaming platform, which enables companies to leverage their data as a continually updating stream of events, not as static snapshots. This innovation has led Coatue Management, Altimeter Capital and Franklin Templeton to join earlier investors Sequoia Capital, Benchmark, and Index Ventures in the recent Series E financing of a combined $250 million at a $4.5B valuation. Our product has been adopted by Fortune 100 customers across all industries, and we’re being led by the best in the space—our founders were the original creators of Apache Kafka®. We’re looking for talented and amazing team players who want to accelerate our growth, while doing some of the best work of their careers. Join us as we build the next transformative technology platform!<br><br><strong><u>About The Role<br><br></u></strong>As a Backend Software Engineering Intern, you will work on our suite of cloud and on-premise software running on Apache Kafka, which powers hundreds of trillions of events per day day at top companies like Netflix, LinkedIn, and Uber. If you love building cutting edge systems and software that are mission critical to how enterprises work with data, or are passionate about open source, then you will fit right in.<br><br><strong><u>What We're Looking For<br></u></strong><ul><ul><li>Strong CS fundamentals gained through current pursuit of Bachelors, Master's or PhD in computer science, math, or related field </li><li>Strong Data Structures or Algorithms knowledge</li><li>Experience with Java, C/ C++, Go, Python<br><br></li></ul></ul><strong>Come As You Are<br><br></strong>At Confluent, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. The more diverse we are, the richer our community and the broader our impact.<br><br>Click here to review our <em>California Candidate Privacy Notice</em> , which describes how and when Confluent, Inc., and its group companies, collects, uses, and shares certain personal information of California job applicants and prospective employees.",
        "index": 22,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "java",
            "C and C++"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Graduate Research Intern - Winter 2020",
        "company": "Fujitsu",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-11-16T02:59:46.726Z",
        "url": "https://www.linkedin.com/jobs/view/graduate-research-intern-winter-2020-at-fujitsu-2208498242?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=gv2%2BpCQbeXsyAQHvmLf55A%3D%3D&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:46.726Z",
        "description": "<strong>Description<br><br></strong><strong>Fujitsu Laboratories of America (FLA)</strong> is a wholly owned subsidiary of Fujitsu Laboratories Ltd., Fujitsu's Research and Development Division. Our corporate headquarters is in Sunnyvale, California. We innovate and develop real-world technologies that impact a broad range of industries, and our visionary scientists work to create and unfold new and improved technologies.<br><br>Globally, Fujitsu Laboratories has a rich history spanning over 50 years in cutting-edge innovation and research, supporting the global Fujitsu Group’s brand promise, “Shaping tomorrow with you.” From the first relay-based mainframe to the prototype of Fugaku, one of the fastest supercomputers (developed with RIKEN), Fujitsu has led the way in advanced information and communications technology (ICT) research. Our future R&amp;D strategy and vision center around co-creation with our customers to solve their Digital Transformation (DX) challenges by applying our ground-breaking digital technologies.<br><br>At FLA, our research areas cover a range of topics including artificial intelligence, software engineering, cyber security, blockchain, and next-generation computer systems. We leverage our presence in the Silicon Valley” to collaborate closely with universities and other research institutes.<br><br>FLA contributes to the world of research communities through joint research projects with universities and research organizations, and through the free exchange of ideas at technical conferences. According to ifiClaims, Fujitsu Ltd is one of the innovative company with 1,008 granted patents in 2019.<br><br><strong>Qualifications<br><br></strong><strong>Job Description <br><br></strong><strong>Candidate Will Work On<br></strong><ul> <li>A project associated with designing, developing, prototyping, and testing advanced research topics of Software Engineering and Natural Language Processing (NLP).<br></li> <li>Publish technical papers and file patent applications<br></li> <br><br></ul><strong>Qualifications<br><br></strong>PhD/Master’s degree student in Computer Science, Electrical Engineering or any other relevant disciplines with a background in full-stack software development, deep learning for Natural Language Processing and code generation;<br><ul> <li>Experience and specialized in information extraction, classification, and semantic NLP tools/libraries;<br></li> </ul><ul> <li>Experience in relevant Python and JavaScript web-frameworks.<br></li> <li>Proficient in Python and deep learning frameworks including Tensorflow, PyTorch, and Keras is a plus;<br></li> <li>Experience in Transformers, BERT, GPT including training from scratch, fine-tuning classifier, Encoder/Decoder is a plus;<br></li> <li>Contribution to NLP community through paper publications;<br></li> <li>Contribution to open-source community (e.g., Github public project) is a plus;<br></li> <li>Experience in quick prototyping and scientific research methods;<br></li> </ul><ul> <li>Strong math and programming skills.<br></li> <br><br></ul><strong>Job Type</strong>  Internship<br><br><strong>Job</strong>  IT Specialization<br><br><strong>Primary Location</strong>  CA-Sunnyvale<br><br><strong>Travel</strong>  No",
        "index": 23,
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "python",
            "deep learning",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer in Test (Intern)",
        "company": "ASML",
        "location": {
            "city": "San Jose",
            "state": "California"
        },
        "posted": "2020-11-16T02:59:47.058Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-in-test-intern-at-asml-2316169867?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=MBDdjdEk4Dh%2BcRWpmh7IRA%3D%3D&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:47.058Z",
        "description": "<strong>Introduction<br></strong>ASML US brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Chandler Arizona, San Jose and San Diego California, Wilton Connecticut, and Hillsboro Oregon.<br><strong>Job Mission<br></strong>We are looking for a highly talented individual to join our software quality assurance team.<br><br><strong><u>Job Description<br><br></u></strong>In this position, you will be participating the project involving test design, test execution and test report and learn the test methodologies and test automation for the ASML world-class products. You will have the opportunity to work with software developers, hardware engineers and the application engineering organization on a regular basis.<br><br><strong>Education<br></strong>Student pursuing advanced degree in Computer Science, Electrical Engineering, Mathematics, Applied Mathematics, Physics, Applied Physics, or any related engineering or equivalent experiences.<br><br><strong><u>Experience<br></u></strong><ul><li>Knowledge of operating system, relational database, concurrent computing,<br></li></ul>client/server architecture, network protocols, and file system management.<br><ul><li>Knowledge of software lifecycle and quality engineering methodology</li><li>Good numerical analysis and logic thinking skills</li><li>Familiar with programming languages Python, C/C++,Java, Perl or shell scripting<br></li></ul><strong><u>Personal Skills<br></u></strong><ul><li>Excellent problem solving and trouble shooting skills</li><li>Ability to excel in cross functional, team environment<br></li></ul><strong>Context of the position<br></strong>This position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings. The physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described.<br><br><strong><u>Other Information<br><br></u></strong>EOE AA M/F/Veteran/Disability<br><br>",
        "index": 24,
        "skills": [
            "machine learning",
            "software engineering",
            "information technology",
            "java",
            "python",
            "C and C++"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "Centauri",
        "location": {
            "city": "Chantilly",
            "state": "Virginia"
        },
        "posted": "2020-12-01T02:59:47.368Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-centauri-2311443612?refId=e6108139-5e16-41d6-a1d4-dc8f2aa3b7ee&trackingId=SPKfZwSPHdKVF5S6%2F0TqpQ%3D%3D&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:47.368Z",
        "description": "Centauri is a software and system engineering company headquartered in Chantilly, Virginia with offices Nationwide. Centauri has been selected as one of the best companies to work for in America by The Great Place to Work Institute and as one of the top employers in the DC Metro area by the Washingtonian Magazine. We are always looking for bright, innovative and talented people to join our team of highly skilled professionals. Centauri offers challenging work, competitive salaries, an incentive bonus program and top notch health and welfare benefits for you and your family.<br><br>This position is for that of an Intern level Software Engineer contributing to a application-server style project in support of a local pharmaceutical company. A successful candidate will step into a fully operational Agile software team, participating in every facet: from planning, to execution, to retrospectives. The engineer will interact with our customers to help derive requirements and develop features that satisfy those requirements. This position also involves building testing suites that automate testing of our software and ensure that those tests accurately cover the design requirements of our customers.<br><br><strong><u>Qualifications<br></u></strong><ul> <li> Bachelor’s Degree (in the works) in Computer Science, Software Engineering, Computer Engineering, or any other scientific/engineering/technical degree with appropriate experience. </li> <li> Experience with Python, Javascript/jQuery, HTML,CSS, Django, Bootstrap, and Datatables is preferable. </li> <br></ul><strong>Security Requirements:</strong> Must be eligible for a government security clearance",
        "index": 25,
        "skills": [
            "software engineering",
            "javascript",
            "python"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Littleton",
            "state": "Colorado"
        },
        "posted": "2020-12-03T02:59:47.636Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-lockheed-martin-2317017809?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=XOo%2FA0OMsMrdBoRh7E%2BqtQ%3D%3D&position=1&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:47.636Z",
        "description": "<strong>Description:</strong>Going to space is just the beginning. It’s what you do when you get there that matters. Lockheed Martin builds the satellites and spacecraft that do amazing things in space for government and commercial customers. Connecting people. Advancing discovery. And protecting what matters most. Lockheed Martin-built satellites give earlier warning of severe weather, connect troops on the battlefield, and deliver GPS directions to a billion people worldwide.<br>As we look to the future, we’re driving innovations to help our customers do even more in orbit. That’s why we’re crafting smarter satellites that operate like smartphones in the sky, with apps that can be updated in orbit so they can adapt as mission needs on the ground change. Your mission is ours. And as that mission evolves, we’ll be ready. Will you?<br>What does this role look like?<br>You will participate in engineering tasks supporting a systems engineering team. Working with experienced engineers, you will perform work in all systems engineering phases that could include requirements definition, allocation and maintenance. This position supports various system analyses in support of mission planning and execution.<br><br><strong><u>Basic Qualifications<br><br></u></strong>Actively enrolled in a Computer Science, Aerospace Engineering or other related degree program from an accredited college/university. This position requires special access to support the program and requires the selected candidate to be a US Citizen.<br><br><strong><u>Desired Skills<br><br></u></strong>Game engine experience (Unity, Unreal, Cryengine)<br>3D CAD Modelling (CREO, Solidworks)<br>3D Modelling (3DSMax, Blender)<br>Coding language proficiencies (C# preferred, C++, Python)<br>Industry experience (Satellite Operations, ATLO, Robotics)<br>Basic / mandatory: coding experience, design patterns, excellent communicator, etc.<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern",
        "index": 26,
        "skills": [
            "python",
            "software engineering",
            "robotics",
            "C and C++",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Internship, Summer 2021",
        "company": "Rubrik, Inc.",
        "location": {
            "city": "Palo Alto",
            "state": "California"
        },
        "posted": "2020-11-30T02:59:47.914Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-summer-2021-at-rubrik-inc-2311495411?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=%2FEiD%2BAC%2FCiWATkf7WMIVrg%3D%3D&position=2&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:47.914Z",
        "description": "Interested in our Remote Software Engineering Internship?<br><br>Work on the next-generation of technology that will change how businesses around the world manage and unlock value from their data. Rubrik is the leader in the cloud data management space. We're revolutionizing how businesses protect, search, secure, and analyze all of their data with simple and scalable solutions. As cloud infrastructure continues to grow at an astounding rate, we’ll be solving some of it’s most interesting challenges while building a product unlike anything seen before. This is an exciting challenge with opportunities in search, analytics, scalable systems and much more! We’re just getting started so there is a lot of opportunity for personal growth and contribution.<br><br>Rubrik partners with universities around the world to offer the next class of interns an opportunity to make an impact from day one! This is a full-time (40-hrs per week) internship during the summer of 2021 running approximately 12 weeks from early June thru early September. You will work on real projects and be mentored by our senior team members to support your career development and experience.<br><br>We're looking for interns who are curious, who want to be entrusted with real responsibility and <strong>embrace the opportunity to write code that will ship</strong>. You'll be a full member of the engineering team and learn from our incredible engineers while making a measurable impact. Our Engineering teams are building and maintaining multiple products at Rubrik. These teams have clear ownership over features &amp; products ensuring they have all the context to make impactful decisions. Some product teams are full stack, while others are specialized either in back-end, or front-end. Teams are utilizing code reviews, pair programming and tech talks for ensuring engineering growth, collaboration and mentoring. Check out our engineering blog to learn more about what our engineers are working on and to see where you could fit in.<br><br><strong><u>Desired Requirements<br></u></strong><ul> <li>Currently pursuing a BS, MS, or PhD in Computer Science or a related field</li> <li>Strong understanding of computer science fundamentals, algorithms, best practices, and logical skills</li> <li>Strong coding capability</li> <li>Good team player and exceptional communicator</li> <li>Ability to thrive in a fast-paced environment</li> <li>Ability to research, learn and become proficient in new technologies</li> <br><br></ul><strong><u>What You Will Do<br></u></strong><ul> <li>Experience first hand working at a market leading cloud data management company</li> <li>Work closely with a mentor on a specific project important to Rubrik’s overall goals</li> <li>Be part of a team of engineers that share and learn from each other</li> <li>Show off your work with a presentation on your project at the end of your internship</li> <li>Have a great time and make relationships with people that will last your entire career!</li> <br><br></ul><strong><u>About Rubrik<br><br></u></strong>Rubrik is one of the fastest growing companies in Silicon Valley, revolutionizing data protection and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup.<br><br><em>Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em>",
        "index": 27,
        "skills": [
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Software Engineer, Summer 2021 Intern",
        "company": "Convoy Inc",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "posted": "2020-11-23T02:59:48.209Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-2021-intern-at-convoy-inc-2314560585?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=WkGqLQ5Ea1nQKOdGmM3oJQ%3D%3D&position=3&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:48.209Z",
        "description": "Convoy is transforming the $800 billion trucking industry. Our mission is to transport the world with endless capacity and zero waste. The industry is huge and so is the opportunity to change the way freight moves.<br><br>The next time you’re out driving and see an 18-wheeler on the road, that truck is empty <em>35% of the time.</em> When big trucks drive empty, they throw unnecessary CO2 into the atmosphere. In fact, empty trucks generate more than 76 million metric tons of wasted carbon emissions every year. At Convoy, our digital freight network helps reduce those empty miles and cut carbon waste by nearly half.<br><br>This is your opportunity to collaborate with an incredible group of people and help transform the freight industry. Join Convoy and help move the world forward.<br><br><strong><u>About You<br><br></u></strong>Convoy is building a team of diverse, talented, and creative engineers to automate the logistics industry. We’re developing cutting-edge software that makes trucking more efficient and sustainable, all while providing a world-class shipper and carrier experience. We’re looking for people who pride themselves on their ability to create innovative products, balancing urgency with intentionality. You approach every problem, process, and system with a collaborative, open mind and are eager to continue growing your skillset.<br><br><strong><u>You Will<br></u></strong><ul><ul><li>Immediately be paired with a vertically focused team and be indoctrinated into the product they support.</li><li>Ship code your first week- we expect our interns to contribute in meaningful ways right off the bat. </li><li>Have excellent mentorship. Each intern will be paired with an engineering mentor to help guide them through the summer.</li><li>Get the chance to own large, complex projects and see them through to the finish.</li><li>Earn competitive pay and perks.<br><br></li></ul></ul><strong><u>We're Looking For Someone Who Has<br></u></strong><ul><ul><li>A degree in Computer Science I<strong>N PROGRESS</strong> with a graduation date in 2022.</li><li>Experience with an object oriented language like Java, C++, Ruby, Python, etc.</li><li>Working knowledge of data structures and algorithms.</li><li>Strong communication skills and ability to fluently express ideas to business stakeholders.<br><br></li></ul></ul><strong><u>Nice To Haves<br></u></strong><ul><ul><li>Previous internship experience is strongly preferred.<br><br></li></ul></ul>Convoy is an equal-opportunity employer and we welcome applicants from all backgrounds. If you’re a passionate team player who wants to have an outsized impact on a diverse and dynamic team, we’d love to hear from you!",
        "index": 28,
        "skills": [
            "software engineering",
            "python",
            "java",
            "C and C++"
        ],
        "remote": false
    },
    {
        "position": "Computer Science: Data Analyst Intern (Summer 2021)",
        "company": "SPX Corporation",
        "location": {
            "city": "East Stroudsburg",
            "state": "Pennsylvania"
        },
        "posted": "2020-11-23T02:59:48.564Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-data-analyst-intern-summer-2021-at-spx-corporation-2247968702?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=nBfw0hvOLt5PES0S20ukiA%3D%3D&position=4&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:48.564Z",
        "description": "<strong><u>Job Summary<br><br></u></strong>Assist the Engineering department in successfully achieving manufacturing goals and contribute to continuous improvement efforts. This position offers a variety of opportunities including basic engineering tasks related to design, analysis, test, integration and systems engineering. Opportunities can vary from performing analysis on existing hardware, assisting in the design and development of future hardware, performing analysis for both completed and future equipment, test, systems engineering, quality assurance, system safety, and production operations.<br><br><strong><u>Essential Duties And Responsibilities<br></u></strong><ul> <li> Improve material handling methods. </li> <li> Develop quoting tools that allows the calculation of pricing based on a set of input dimensions as specified by an end user. </li> <li> Perform work station/cell analyses to improve productivity and quality. </li> <li> Provide input for manufacturing fixtures and tooling. </li> <li> Assist with plant layout and work station design. </li> <li> Develop computer programs to help manipulate data for use. </li> <li> Learn and use ERP manufacturing software. </li> <li> Create documentation for new product launches. </li> <li> All other duties or projects as assigned. </li> <br></ul>Interns will typically support one or more experienced engineers in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of engineering.<br><br><strong><u>Basic Qualifications<br></u></strong><ul> <li> Student working towards a Bachelor’s degree in Computer Science, Manufacturing, Industrial, and Mechanical, or other related Engineering field. </li> <li> Candidates must have completed their second year of engineering studies. </li> <li> Cumulative GPA of 3.0 or above. </li> <li> Must be a US Citizen or have legal US working status. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li> Working knowledge or exposure to 3D software (CREO Preferred) </li> <li> Working knowledge or exposure to ERP systems </li> <li> Experience in Visual Studio and .Net </li> <li> Exposure to Lean and 5S concepts. </li> <li> Background in manipulating data </li> <li> Experience in C++ </li> <li> Experience in Visual Basic </li> <li> Experience with Data Analytics </li> <li> Experience in SQL </li> <br></ul>For more than 140 years, Patterson-Kelley has proudly served the commercial heating industry with the most respected heating solutions in the field. Our commercial boilers and hot water heaters are designed and built in the USA and distributed throughout North America. Even more, our products are backed by the highest level of technical and application support. Each piece of equipment we build is the direct result of knowledge cultivated from generations of experience, expertise, and customer input.<br><br>SPX is an equal opportunity employer and makes employment decisions without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, genetic information, disability, protected veteran status, or any other reason prohibited by applicable law.<br><br>Thank you for your interest in our company.",
        "index": 29,
        "skills": [
            "software engineering",
            "data visualization",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Masters Summer Internship - Data Science",
        "company": "Gap Inc.",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:48.844Z",
        "url": "https://www.linkedin.com/jobs/view/masters-summer-internship-data-science-at-gap-inc-2295939893?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=EA9DN9fl9VhcKg2oTH2xDw%3D%3D&position=5&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:48.844Z",
        "description": "<strong><u>About Gap Inc.<br><br></u></strong>Our brands bridge the gaps we see in the world. Old Navy democratizes style to ensure everyone has access to quality fashion at every price point. Athleta unleashes the potential of every woman, regardless of body size, age or ethnicity. Banana Republic believes in sustainable luxury for all. And Gap inspires the world to bring individuality to modern, responsibly made essentials.    <br><br>This simple idea—that we all deserve to belong, and on our own terms—is core to who we are as a company and how we make decisions. Our team is made up of thousands of people across the globe who take risks, think big, and do good for our customers, communities, and the planet. Ready to  learn fast, create with audacity and lead boldly? Join our team.<br><br><strong><u>About The Role<br><br></u></strong>The Data Science Team at Gap Inc. is a research team that applies techniques from operations research and machine learning to drive business benefits for Gap Inc. and its brands. The team’s focus is creating analytical capabilities to support product operations at Gap Inc. Areas of expertise include: demand forecasting, inventory replenishment, inventory and supply chain optimization, pricing, product testing, product attributes, flexible inventory and supply chain initiatives.<br><br>What you'll do<br><ul><li>Provide quantitative research (Operations Research/Machine Learning), analysis and support for identifying business opportunities/issues and form hypotheses</li><li>Synthesize findings, prepare presentations and assist in presenting findings to all levels of management</li><li>Identify and track the metrics to measure the success of a specific business opportunity</li><li>Participate in the Gap Inc. Summer Internship Program and share insights with the team<br><br></li></ul>Who you are<br><ul><li>Master's degree in progress with one year left to graduate in Operations Research, Data Science, Industrial Engineering, Statistics, Computer Science, Machine Learning or related degree - accepting students that graduate in December 2021 through Spring 2022</li><li>Hands-on experience with data analysis, statistical, optimization and simulation packages (SQL, Python, etc.)</li><li>Experience with data visualization using tools, such as Tableau or D3</li><li>Demonstrated ability to think strategically and approach new and complex issues using data and analytics</li><li>An ability to think abstractly and work cross functionally</li><li>Strong communication and presentation skills</li><li>A desire to evolve excellent problem solving skills; meticulous and methodical<br></li></ul>Benefits at Gap Inc.<br><ul> <li>Merchandise discount for our brands: 50% off regular-priced merchandise at Gap, Banana Republic and Old Navy, 30% off at Outlet and 25% off at Athleta for all employees.</li> <li>One of the most competitive Paid Time Off plans in the industry.*</li> <li>Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.*</li> <li>Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.*</li> <li>Employee stock purchase plan.*</li> <li>Medical, dental, vision and life insurance.*</li> <li>See more of the benefits we offer.</li> <br></ul><em><li>For eligible employees</li></em>",
        "index": 30,
        "skills": [
            "machine learning",
            "python",
            "data visualization",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Data Analytics Intern (Summer 2021)",
        "company": "Poshmark",
        "location": {
            "city": "Redwood City",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:49.318Z",
        "url": "https://www.linkedin.com/jobs/view/data-analytics-intern-summer-2021-at-poshmark-2316153245?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=NvtsdryJ%2Fbc3Pb%2B7xeGGgA%3D%3D&position=6&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:49.318Z",
        "description": "Poshmark is seeking <strong>Data Analytics Interns for Summer 2021</strong>. We are a rapidly growing multi-platform social fashion marketplace and working on interesting data science problems to improve user experiences. The role will be dynamic and varied, requiring a versatile self-starter willing to dive in to multiple initiatives. Over the next 10 weeks the intern can expect to become deeply involved in exploring and implementing analytics solutions that may run in production.<br><br>Our goal is to give the intern exposure to a range of data analysis/data science techniques and current big data technologies, through the experience of applying them to the multi-platform social marketplace dynamics. This role will provide an excellent opportunity to implement solutions that may run in production, at scale.<br><br><strong><u>What You’ll Potentially Be Working On<br></u></strong><ul> <li>Focus on data analytics and modeling problems aimed to grow &amp; optimize performance in one of these areas: Growth, Marketplace Operations, Product, Community Service etc. </li> <li>Sample problems:</li></ul><ul> <li>Product engagement &amp; conversion optimization, customer lifetime value modeling, spend &amp; campaign optimization</li> <li>Marketplace demand &amp; supply analysis </li> <li>New business opportunity &amp; feasibility analysis</li> <li>Applying a range of analytic approaches including clustering, segmentation and regression</li> </ul> <br><br><strong><u>What To Expect<br></u></strong><ul> <li>Exposure: Being a rapidly growing social fashion marketplace gives employees the opportunity to work in a Start-Up environment and focus on deeply interesting work that you wouldn’t get to do anywhere else. Prepare to make a large scale impact in a short amount of time.</li> <li>Professional Development: Participate in weekly team meetings, an opportunity to find a good balance of working independently and in teams formed across multiple business units, develop knowledge of multiple areas of social marketplace, interact with leadership team;</li> <li>Mentorship: Look forward to one-on-one time with dedicated managers and mentors to facilitate your growth throughout the summer internship experience.</li> <li>Have fun: Virtual team events </li> <br><br></ul><strong><u>What We’re Looking For<br></u></strong><ul> <li>Currently enrolled in an MS or PhD program in Computer Science, Software Engineering, Math, Statistics or a related field</li> <li>Intermediate to advanced SQL coding skills. Working level skills in Python and/or R. Need to be able to pull your own big volume data, process it and create visualizations and reports. </li> <li>Sound understanding of applied math topics such as probability and statistics, linear algebra, hypotheses testing and basic optimization techniques. </li> <li>Working knowledge of algorithms, machine learning, data mining, statistics, applied mathematics or similar field. </li> <li>Strong communication and collaboration skills; Being a team player is a must</li> <li>Passion for consumer experience, a desire to go into uncharted territory with bold new ideas, and a willingness to go the last mile on execution</li></ul>",
        "index": 31,
        "skills": [
            "machine learning",
            "software engineering",
            "python",
            "data visualization",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Internship",
        "company": "Northwestern Mutual",
        "location": {
            "city": "Milwaukee",
            "state": "Wisconsin"
        },
        "posted": "2020-11-23T02:59:49.669Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-at-northwestern-mutual-2223257192?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=1j4AS7ZdtANLcovBA%2BqbuQ%3D%3D&position=7&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:49.669Z",
        "description": "<strong><strong>At Northwestern Mutual, we are strong, innovative and growing. We invest in our people. We care and make a positive difference.</strong> <br><br></strong><strong> At Northwestern Mutual, we are strong, innovative and growing. We invest in our people. We care and make a positive difference. <br><br></strong><strong> What's the role? <br><br></strong>Interns may be involved in providing day-to-day support as needed including problem resolution, metrics reporting,<br><br><strong><u>Responsibilities Of The Intern May Include<br><br></u></strong>documentation, project assistance and various other activities including attending and participating in various meetings as part of the team.<br><ul><li> Code, test, and implement complex programs from user specifications </li></ul><ul><li> Assist with developing appropriate programs and systems documentation </li><li> Supporting and troubleshooting production systems as required to optimize performance, resolving production problems and providing timely follow-up on problem </li><li> Provide support to team on process improvement projects </li><li> Excellent verbal and written communication, analytical and problem-solving skills, time management and customer service skills </li><li> Previous work or classroom experience in one of the following: Java, C++, PL/SQL, VB.Net, CSS, PHP, JavaScript, HTML, or database development (Oracle, MS SQL, or MySQL </li></ul><ul><li> General database knowledge, basic SQL and Object-oriented design (OOD) skills </li><li> Ability to troubleshoot network, software and hardware issues </li><li> Knowledge of SharePoint administration a plus <br><br></li></ul>Bring Your Best! What this role needs:<br><br>Active student pursuing a Bachelor’s or Master’s degree in Computer Science, Computer Engineering, Management Information Systems or related field. A cumulative grade point average of 3.0 or higher with a minimum of 6-9 credits in Computer Science or Management Information Systems courses.<br><br><strong><strong>Build a strong career foundation with a best-in-class company that puts our client’s interests at the center of all we do. Get started now! <br></strong></strong><em> We are an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, sexual orientation, national origin, disability, age or status as a protected veteran, or any other characteristic protected by law.</em>",
        "index": 32,
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "C and C++",
            "information technology",
            "web development"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Summer Intern",
        "company": "Gecko Robotics, Inc.",
        "location": {
            "city": "Pittsburgh",
            "state": "Pennsylvania"
        },
        "posted": "2020-12-05T02:59:49.974Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-summer-intern-at-gecko-robotics-inc-2303393992?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=Yvp7mMF5lxksLUxS8fTkBw%3D%3D&position=8&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:49.974Z",
        "description": "<strong>Job At A Glance <br><br></strong>As a member of the technical staff, the software engineer intern is responsible for the design of new software products up to functional releases to customers. This includes specification reviews, development program timelines and reports, design reviews, documentation packages, and transfers to production. This engineer will also be responsible for technical support of some software products and tools currently released to customers. We will be accepting applications for Summer 2021 internships until January 15, 2021.<br><br><strong><u>What You Will Do<br></u></strong><ul> <li>Designs and develops software including: data analysis, graphical user interfaces, and motion control software for our products.</li> <li>Conducts tests to verify the implementation of new features and the proper operation of products.</li> <li>Uses critical thinking skills to debug problems and develop solutions to these problems.</li> <li>Interacts with other engineers in a team environment.</li> <li>Provides and reviews technical documentation.</li> <li>Operates robots at customer locations to test and improve designs.</li> <br><br></ul><strong><u>What Gecko Is Looking For<br></u></strong><ul> <li>Working towards B.S., M.S, or M.S.E. in Computer Science, Software Engineering, Electrical or Computer Engineering, or related technical field.</li> <li>Thorough knowledge of at least one object-oriented language.</li> <li>Experience in at least one of the following categories: signal and image processing, motion control, real-time software, machine learning, or UI design.</li> <li>Thorough knowledge of Python programming.</li> <li>Robotics experience.</li> <li>Detail-oriented personality with solid documentation and reporting skills.</li> <li>Experience in rapid prototyping.</li> <li>Strong references/recommendations are required.</li> <br><br></ul><strong><u>Who We Are<br><br></u></strong><strong> Gecko Robotics (Gecko) is focused on protecting and maintaining civilizations' most critical infrastructure, with machines and platforms. <br><br></strong><strong> Traditional manual maintenance is dangerous, slow and reactive. Gecko’s solutions improve safety and speed (10x) while gathering more data (1000x) to predict infrastructure failures before they happen. <br><br></strong><strong> Gecko services customers across the USA and internationally primarily in the Oil &amp; Gas, Power Generation and Pulp &amp; Paper markets.</strong>",
        "index": 33,
        "skills": [
            "machine learning",
            "software engineering",
            "python",
            "robotics"
        ],
        "due": "2021-01-15T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Summer Engineering Internship",
        "company": "edX",
        "location": {
            "city": "Cambridge",
            "state": "Massachusetts"
        },
        "posted": "2020-11-16T02:59:50.264Z",
        "url": "https://www.linkedin.com/jobs/view/summer-engineering-internship-at-edx-2325344931?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=09kxcF2EWC%2BT0oOe%2FikeMw%3D%3D&position=9&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:50.264Z",
        "description": "<br><br><strong>Software Engineering Internship - Summer 2021<br><br></strong><strong>Your Impact <br><br></strong>This is an amazing opportunity to participate in an internship with a transformative, educational, e-commerce, start-up whose mission is to reinvent the way people learn. As an intern for edX, you will work with an amazing group of innovators who are focused on the mission of offering interactive online courses and Massive Open Online Courses (MOOCs) from the world's best universities and corporations.<br><br><strong>Your Team<br><br></strong>Interns will join edX as a member of a \"squad\" dedicated to one of edX's key business initiatives, whether its product or platform-based. These squads complete work that's crucial to edX's product roadmap and success! There will be opportunities to collaborate with folks within your own team, with other interns, and with key stakeholders across the organization.<br><br><strong>You Will<br><br></strong><ul> <li>Work up to 40-hours a week gaining real, full lifecycle software development skills on one of our engineering teams.</li> <li>Learn about and use technologies such as: Python, Django, React, Javascript, HTML and CSS.</li> <li>Projects will be based on the work that the engineering teams are currently working on.</li> <li>Develop code, test your code, build software features, participate in software design, work on live tickets, and more!</li> <li>Work closely with a mentor who will offer guidance and support for anything -- this could be for help with coding projects or small tips like how to add an emoji in Slack </li> <br><br></ul><strong>You are:<br><br></strong><ul> <li><strong>An undergraduate rising senior</strong> working towards a Bachelor's degree in Computer Science, Engineering, Mathematics, or related field of study.</li> <li>Organized, reliable, collaborative, intellectually curious, and deadline oriented.</li> <li>A great communicator, with strong written and verbal communication skills.</li> <li>Experienced in software design, coding, and debugging. It is great if you have worked on programming projects outside of the classroom, whether during a hackathon, with a CS club, or in your own spare time.</li> <li>Familiarity with our stack: Python/Django, MySQL, and/or AWS</li> <li>Comfortable working in a remote setting, with excellent organizational skills. </li> <br><br></ul>We understand that applying for a job can be intimidating. Applicants rarely meet every single job requirement, and we know there are many skills and backgrounds that will contribute to success in this role.<br><br><strong>That's why we provide new employees with:<br><br></strong><ul> <li>Employee onboarding and training sessions</li> <li>Personalized 30/60/90+ day plans</li> <br><br></ul>And much more to support you in your personal journey at edX! That said, if this role looks like a great next step for you, please apply… even if you can't \"check every box.\" We'd love to hear from you!<br><br><strong>edX </strong>is the education movement for restless learners. Together with our founding partners Harvard and MIT, we've brought together over 30 million learners, the majority of top-ranked universities in the world, and industry-leading companies onto one online learning platform that supports learners at every stage. And we're not stopping there—as a global nonprofit, we're relentlessly pursuing our vision of a world where every learner can access education to unlock their potential, without the barriers of cost or location.",
        "index": 34,
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "machine learning",
            "information technology",
            "web development",
            "react"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Software Engineer, Summer Intern 2021",
        "company": "Pocket Gems",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-05T02:59:50.720Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-intern-2021-at-pocket-gems-2175443997?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=2L%2BXepb0z97BrBM8JilnnA%3D%3D&position=10&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:50.720Z",
        "description": "Pocket Gems seeks to build the greatest games and most compelling interactive entertainment in the world. That’s the mission our founders began with in an apartment above a pizza shop back in 2009 and it continues to inspire us today. Since then, we’ve grown to over 200 people in San Francisco, and with $155 million in backing from Sequoia Capital and Tencent, we’re constantly breaking new ground in mobile entertainment.<br><br>Our products have been downloaded over 450 million times by players around the world. In recent years, we’ve launched Episode, a mobile storytelling network and platform, and War Dragons, a visually stunning 3D real-time strategy game.<br><br>As our community of players continues to grow, we’re committed to building diverse and inclusive environments across our teams, and in our games.<br><br>As a summer <strong>Software</strong> <strong>Engineer Intern</strong>, you will be a part of a small intern cohort, paired with an experienced software engineering mentor, collaborating cross-functionally with teams including other software engineers, product managers, artists, and designers to define our next generation of mobile games. During our <strong>10</strong><strong>-week program</strong>, our interns are meaningful contributors to our live products, leaving the summer having made a tangible impact on their team while gaining technical and professional skills to set them up for future success!<br><br><strong>Note: To be considered, you must be willing to work remotely out of one of the following states through the duration of the 10 week internship program: California, Washington, Colorado, or Texas<br><br></strong><strong><u>What You’ll Do<br></u></strong><ul> <li>Develop and code innovative features using groundbreaking technologies</li> <li>Enjoy the freedom of writing native applications while exploring the latest cross-platform technologies</li> <li>Participate in all aspects of the project life-cycle, from ideation to specification to release</li> <li>Design and implement scalable, reliable and maintainable technologies for our iOS and Android gaming platforms</li> <li>Work with innovative, great, fun people!</li> <br><br></ul><strong><u>What You Bring To The Engineering Team<br></u></strong><ul> <li>Working toward a BA, BS, or MS in Computer Science or related technical discipline</li> <li>Solid foundation in computer science, with strong competencies in data structures, algorithms, software design and OOP</li> <li>Passion and excitement for solving interesting problems and building great products!</li> <br><br></ul><strong><u>Extra Gems For<br></u></strong><ul> <li>Programming experience in one or more of the following: C/C++, C#, Objective-C, Java, Python, JavaScript, Mobile Software Development (iOS, Android)</li> <br><br></ul><strong><u>Other Internship Perks<br></u></strong><ul> <li>An amazing summer packed with mentorship, networking opportunities, learning &amp; development roundtables, fun intern events (escape room, intern olympics, jackbox), and of course projects with real business impact.</li> <li><strong>Read more about what we’ve been up to </strong><strong>here</strong><strong>! </strong></li> <br><br></ul><strong><u>Please Note<br></u></strong><ul> <li>We are looking for students going to U.S. universities, <strong>graduating in Winter 2021 or Spring 2022</strong></li> <li>Prior mobile/gaming experience is <strong>NOT</strong> required</li> <br></ul><em>Pocket Gems is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status. <br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em>",
        "index": 35,
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "data visualization",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Intern (Summer 2021)",
        "company": "DICK'S Sporting Goods",
        "location": {
            "city": "Pittsburgh",
            "state": "Pennsylvania"
        },
        "posted": "2020-11-16T02:59:51.061Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-summer-2021-at-dick-s-sporting-goods-2321147859?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=TqIUvji8JmO4D%2BSE8ngYSQ%3D%3D&position=11&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:51.061Z",
        "description": "At DICK’S Sporting Goods, interns have the opportunity to work with and learn from the leaders of a growing Fortune 400 company. &nbsp;DICK’S Sporting Goods is returning to campus this year; to recruit, train and develop top collegiate talent to help fuel the Digital Transformation of a multi-billion dollar omni-channel business.<br>During the 11-week summer experience, interns will embark on a meaningful journey and make tangible contributions to &nbsp;the organization’s success. This structured and well-organized program provides on-the-job training, mentorship, classroom instruction, cross-functional departmental exposure and an end-of-program project presentation<br>The Software Engineer Intern will be placed on a product team and contribute to the software design, software development, and overall product lifecycle for a product that our users love. The engineering process is highly collaborative. Interns will have the opportunity to pair on as they work through user stories and support products as they evolve. &nbsp;&nbsp;In addition, interns may be involved in product configuration, performance tuning and testing as well as production monitoring. &nbsp;As a Software Engineer Intern, you will be part of a team with more experienced engineers to help build and grow your skills while you create, support, and deploy production applications. &nbsp;Potential placements include product teams in eCommerce, Fulfillment, Infrastructure, Technology Management, and Data Engineering.<br>Day to Day Responsibilities:<br>- Collaborates and pairs with other product team members (UX, engineering, and product management) to create secure, reliable, scalable software solutions&nbsp;<br>- Writes custom code or scripts to automate infrastructure, monitoring services, and test cases&nbsp;<br>- Writes custom code or scripts to do “destructive testing” to ensure adequate resiliency in production&nbsp;<br>- Configures commercial off the shelf solutions to align with evolving business needs&nbsp;<br>- Creates meaningful dashboards, logging, alerting, and responses to ensure that issues are captured and addressed proactively<br>- Monitors tools and participates in conversations to encourage collaboration across product teams&nbsp;<br>- Reviews and discusses code from more senior engineers to understand best practices and design patterns<br>- Increases business acumen by learning about other parts of the business<br>Some of your experiences will include:<br>- Multi day intern orientation to introduce you to the company, the program, Pittsburgh, and your classmates<br>- Professional development workshops designed to increase your knowledge of the company and the retail industry, as well as develop their business acumen and office professionalism<br>- Extensive exposure to our senior leadership through our exclusive intern only Executive Speaker Series which includes a private meet &amp; greet with our CTO &amp; CEO&nbsp;<br>- Opportunities to “live the brand” and experience summer fun outside the office through various events<br>- Fully furnished summer housing is provided for interns who reside outside of the Metro Pittsburgh area or stipend for local interns<br>- Working a 40 hour work week, Monday – Friday",
        "index": 36,
        "skills": [
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Data Analyst Intern",
        "company": "HG Insights",
        "location": {
            "city": "Santa Barbara",
            "state": "California"
        },
        "posted": "2020-11-23T02:59:51.341Z",
        "url": "https://www.linkedin.com/jobs/view/data-analyst-intern-at-hg-insights-2332538705?refId=60a7f14c-47f0-4d4d-812f-ef3fc4ea5d9b&trackingId=0JSMmS5he0SPo%2FTAOhGbfQ%3D%3D&position=12&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-07T02:59:51.341Z",
        "description": "<strong>About Us:<br><br></strong>Headquartered in beautiful Santa Barbara, HG Insights is the global leader in technology intelligence. HG Insights uses advanced data science methodologies to help the world's largest technology firms and the fastest growing companies accelerate their sales, marketing, and strategy efforts.<br><br>We offer a competitive salary, 401K, growth potential, great benefits, and a casual yet professional environment. Get your sweat on at one of our fitness classes or go for a run along the beach which is two blocks away. You can find employees riding bikes to lunch in the funk zone or hanging out in one of our collaboration spaces. We are passionate about our jobs with a get-it-done attitude, yet we don't take ourselves too seriously. While we work very hard, we also enjoy all that the Santa Barbara coast has to offer.<br><br><strong>What You'll Do: <br><br></strong>HG Insights is experiencing significant growth and in need of a Data Analyst Intern to work directly with our customers on their utilization of our data solutions. This role will challenge you to think creatively and ask questions about data leading to better solutions for our customers and enhancements to our internal processes that create the data. We're looking for someone who is passionate about data and can analyze and translate technical concepts to a sales and marketing audience.<br><br>This is an excellent opportunity for a recent grad or rising junior or senior college student to gain hands-on experience with all facets of Data in a supportive small business environment.<br><br>This is a paid internship opportunity for someone who wants 'on the job' experience and/or a future career as a Data Analyst and can ideally make a commitment of at least three months. Our Data Analyst Intern would be required to work two- three days per week, with flexible scheduling for current students to help work around academic commitments. Come work in our fast-paced, yet super supportive environment where all ideas are welcome!<br><br><strong>What You'll Be Responsible For:<br><br></strong><ul> <li>Perform triage, root cause analysis, and corrections to data issues reported by customers or exception reports.</li> <li>Support the sales and Customer Success teams' data requests.</li> <li>Explain best practices associated with HG Insights points to customers via Email and phone.</li> <li>Prep and Deliver data to customers.</li> <li>Become a resident expert on HG Insights's data sets, products, and markets - including Big Data, Data-as-a-Service, Predictive and Analytical Markets.</li> <li>Explore additional ways in which HG can activate data sets for customers. </li> <br></ul><strong>What You'll Need: <br><br></strong><ul> <li>SQL Experience</li> <li>Proficient in Excel - Vlookups, Pivot Tables</li> <li>Experience with a BI tool like Tableau desired</li> <li>Excellent listener and problem solver capable of recommending solutions to customer requests and technical issues.</li> <li>0 to 3 years professional experience.</li> <li>Completed or working towards a BA/BS in Computer Science, Electrical Engineering, Mathematics, Statistics, or a related technical field.</li> <br></ul><strong>Due to Covid-19, We've transitioned to a work-from-home model and we're continuing to interview and hire during this time. This role is expected to begin as a remote position. Normally, you'll be working in Santa Barbara two blocks from the beach!<br><br></strong><em>HG Insights Company is an Equal Opportunity Employer <br><br></em><em>Please note that HG Insights does not accept unsolicited resumes from recruiters or employment agencies. In the event of a recruiter or agency submitting a resume or candidate without a signed agreement being in place, we explicitly reserve the right to pursue and hire such candidates without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted directly to hiring managers, are deemed to be the property of HG Insights</em>",
        "index": 37,
        "skills": [
            "information technology",
            "software engineering",
            "SQL"
        ],
        "compensation": "paid",
        "remote": true
    }
]