[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-30T03:45:54.685Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=oPSXGRZTJodQrIeTD91UqA%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:54.685Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
        "index": 1,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "c and c++",
            "machine learning",
            "python"
        ],
        "contact": "accommodations@linkedin.com",
        "remote": false
    },
    {
        "position": "Software - Applications Engineering Internship (Fall 2021)",
        "company": "Tesla",
        "location": {
            "city": "Fremont",
            "state": "California"
        },
        "posted": "2021-01-06T03:45:55.070Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-fall-2021-at-tesla-2348468331?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=nKh1WqZhsw85NkNnaPOb1g%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:55.070Z",
        "description": "<em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br><br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br><br></u></strong><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li>",
        "index": 2,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "javascript",
            "java",
            "devops"
        ],
        "start": "2021-08-01T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "California ISO",
        "location": {
            "city": "Folsom",
            "state": "California"
        },
        "posted": "2020-12-09T03:45:55.843Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-summer-2021-at-california-iso-2356424057?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=Q5Toh39OuZw0mapefzwlUw%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:55.843Z",
        "description": "<strong><u>Job Description<br><br></u></strong><strong>What's In it for You<br><br></strong>Our purpose is to lead the way to tomorrow's energy network. Your work as an intern can impact millions of people who depend on electricity for their everyday lives.<br><ul><li>You will get \"real world\" experience to begin or further your career pursuits in the energy industry. This is a paid intern position for 10 -12 weeks during summer 2021.</li><li>You get to work on interesting and challenging assignments that will help grow your skill set.</li><li>You will work in an extremely collaborative environment inside our LEED certified Folsom, California campus.</li><li>Opportunities to interact with the CEO and the Executive team of the ISO</li><li>Invitations to seminars on the latest energy industry topics such as renewables, electric cars and micro grids.</li><li>Potential field trips.</li><li>Social activities with other interns such as barbecues and movie nights.</li><li>You get to work on our \"green\" LEED certified Folsom, California campus with some of the brightest people in the industry.<br><br></li></ul><strong><u>What You Will Be Doing<br><br></u></strong><em>Past Assignments have included work such as:<br></em><ul><li>Building new software tools in support of the reliable operation of the Grid and the energy markets we facilitate. You will learn more about smart grid technology, renewable resources, forecasting and the latest developments in energy industry. You will see ow the work you do this summer contributes directly to the success of the California Grid</li><li>Data validation and user acceptance testing (UAT), schedule and monitor processes necessary for calculation and publication of energy market settlement statements and invoices.</li><li>Development of enterprise-wide systems integration mapping, with database that links to interface specification. Interface with IT Architects, UML Modelers, and QA Leads to understand how to best depict these system-to-system interfaces to meet specific use cases.</li><li>Provide technical content and sample code for the ISO's developer.caiso.com website.</li><li>Document archiving solutions for new technologies as well as development of automation solutions.</li><li>Oracle Database/Storage task queue maintenance, documentation, create automation scripts for Oracle database admin tasks/storage procurement and document, create automated reports of daily DBA/Storage procedures, create standard monitoring scripts, generate capacity reports.</li><li>Projects to develop work products that will reduce processing time, enhance transparency or enhance capabilities in departments across the organization.<br><br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Level of Education and Discipline<br></strong><ul><li>Currently in a Bachelor's degree (BS) or Masters degree (MS) program in Computer Science, MIS or related field.</li><li>Graduating December of 2021 or later.<br><br></li></ul><strong><u>Amount Of Experience<br></u></strong><ul><li>Previous internships, research or work experience using economic analysis is desired.</li><li>Research and or studies in energy industry highly desired.<br><br></li></ul><strong><u>Type Of Experience<br></u></strong><ul><li>Proficient in Microsoft office suite.</li><li>Good presentation, oral and written communication skills highly desirable. </li><li>Must be able to work effectively in a team environment. </li><li>Excellent analytical and problems solving skills required. <br><br></li></ul><strong><u>Additional Skills And Abilities<br></u></strong><ul><li>Strong quantitative skills.</li><li>Competence in software such as R, Python, SQL, and Java desired but not required.<br><br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines.",
        "index": 3,
        "skills": [
            "information technology",
            "sql",
            "java",
            "networks",
            "python",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Datadog",
        "location": {
            "city": "Boston",
            "state": "Massachusetts"
        },
        "posted": "2021-01-05T03:45:56.098Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-datadog-2368885162?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=3kVcICWxWhjGJu2dGDyAxA%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:56.098Z",
        "description": "<strong><u>About Datadog<br><br></u></strong>At Datadog, we're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.<br><br>We are looking for students to join us for an internship to help us collect, aggregate, visualize, and analyze extremely high-scale metrics, logs, and application data.<br><br><strong><u>The Opportunity<br><br></u></strong>We're looking for talented developers to join our teams and start making an impact from day one. You'll join one of Datadog's software teams and work alongside other engineers to help solve challenging problems. Whether you are writing a new integration, building data pipelines, or working with the open source community, our interns are key contributors to our product. We ideally intend for you to be in the New York or Boston office! However, our top priority is your health and safety, so all current and future Datadog employees will be working remotely until then.<br><br><strong><u>Your Skills And Qualifications<br></u></strong><ul> <li>You are in the process of receiving a degree in computer science, software engineering, or a related discipline</li> <li>You are comfortable coding in one or more languages</li> <li>You value code simplicity and performance</li> <li>You have worked as a software engineering intern or have related industry/academic experience</li> <li>You want to work in a fast, high-growth environment that values its employees and customers</li> <li>You are a self-starter who enjoys collaborating with other engineers and solving difficult problems</li> <br><br></ul><strong><u>Bonus Points<br></u></strong><ul> <li>You are fluent in Python, Go, Java, or Javascript</li> <li>You have some specialized skills like data visualization, distributed systems, or production engineering</li> <li>You’ve used Datadog or have written your own monitoring tools before</li> <br><br></ul><strong><u>Eligibility<br><br></u></strong>We are only offering the summer co-op term at this time. You must be available for 16 weeks and able to start in May 2021.<br><br><strong><u>Equal Opportunity At Datadog<br><br></u></strong>Datadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br><br><strong><u>Your Privacy<br><br></u></strong>For more information on how we maintain the privacy of the information you submit as part of your application, please refer to our Applicant and Candidate Privacy Notice.",
        "index": 4,
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "data visualization",
            "python",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Software Development Engineer Intern - 2021",
        "company": "Apptio",
        "location": {
            "city": "Bellevue",
            "state": "Washington"
        },
        "posted": "2021-01-05T03:45:56.740Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-engineer-intern-2021-at-apptio-2354196836?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=arKKdu%2F08CQkwXB%2Btqgjig%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:56.740Z",
        "description": "<strong>You</strong>: You’re a student who wants to truly make an impact on an organization with your computer science background. You love to learn hands on and thrive in fast-paced environments that provide the opportunity for ongoing collaboration. <br><br><strong>Us</strong>: We are a high performance, customer-obsessed engineering team with a passion for innovation. We love to solve problems and find ways to advance the technology within our products every single day. Here at Apptio, we love to teach, develop our talent, and find ways to improve as a collective team.<br><br><strong><u>What We Want You To Do<br></u></strong><ul> <li>Participate in a 12-week long internship program beginning in May or June. </li> <li>Help to solve real business problems alongside our products &amp; engineering teams. </li> </ul><ul> <li>Partner with experienced software developers to complete and present a project. </li> <li>Foster professional development through mentorships, training activities, and opportunities to engage with company leadership. </li> <br><br></ul><strong><u>Basic Qualifications<br></u></strong><ul> <li>Pursuing or achieved BS or MS in Computer Science (or related technical discipline). </li> <li>Experience with object-oriented design and coding skills (Java and/or C/C++). </li> </ul><ul> <li>Experience in systems software or algorithms. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Experience with UI design and web-dev technologies. </li> <li>Experience working in a collaborative and fast paced environment. </li> <li>Desire and ability to pick up new technologies quickly and innovate. </li> </ul><ul> <li>Local to WA state candidate preferred.</li></ul>",
        "index": 5,
        "skills": [
            "software engineering",
            "java",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Internship Summer 2021 (Software Engineering / Data Science)",
        "company": "Amobee",
        "location": {
            "city": "Redwood City",
            "state": "California"
        },
        "posted": "2020-12-23T03:45:57.116Z",
        "url": "https://www.linkedin.com/jobs/view/internship-summer-2021-software-engineering-data-science-at-amobee-2321946500?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=PKMYkdhkJPrVtO9Y5WJUeA%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:57.116Z",
        "description": "The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing, and has been named a Leader in Gartner’s Magic Quadrant. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation. Explore all of our notable Amobee Awards . We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee .<br><br><strong><u>Position Summary<br><br></u></strong>Amobee’s ACE (Amobee Career Exploration) Internship Program offers Technical Interns hands-on exposure to different areas of our business, specifically in the fields of Software Development, Data Science, DevOps Engineering, Technical Solutions Engineering, or Data Systems Engineering. We are currently seeking Technical Interns at our Redwood City location. As an ACE Intern you will be paired with an Advocate within the Engineering team who will oversee your professional development and project delivery. The Amobee ACE Internship will provide you with real-world, applied experience with a technology product company, tackling unique challenges that will position you well for your career ahead.<br><br><strong><u>Requirements<br></u></strong><ul><ul><li>Current student pursuing a Bachelor's, Master’s, or PhD degree in Computer Science, Data Science, Mathematics, Engineering or related field.</li><li>Minimum 3.0 GPA</li><li>Ability to work well in teams</li><li>Excellent understanding of Computer Science fundamentals</li><li>Core knowledge of at least one programming language (Java or Python preferred)Passionate about web-based applications</li><li>Excited by working in a fast-paced, collaborative environment<br><br></li></ul></ul><strong><u>Benefits Of Our Program<br></u></strong><ul><ul><li>Ability to observe and work with other team members, including leadership</li><li>Direct mentorship from an assigned Advocate</li><li>Endless opportunities to learn</li><li>Challenging work assignments</li><li>Potential Career opportunities upon graduation</li><li>Formal Training Programs, Social Events, and Community Outreach Programs<br><br></li></ul></ul><strong><u>About Amobee<br><br></u></strong>The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation, see all Amobee Awards. We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee<br><br>In addition to our great environment, we offer a competitive base salary, employee development programs and other comprehensive benefits. Please send a cover letter along with your resume when applying to the position of interest located at Amobee.com . We are an Equal Opportunity Employer. No phone calls and no recruiting agencies, please.<br><br>",
        "index": 6,
        "skills": [
            "data science",
            "information technology",
            "software engineering",
            "java",
            "devops",
            "python",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "2021 Data Science Intern",
        "company": "Merck",
        "location": {
            "city": "Upper Gwynedd",
            "state": "Pennsylvania"
        },
        "posted": "2021-01-06T03:45:57.384Z",
        "url": "https://www.linkedin.com/jobs/view/2021-data-science-intern-at-merck-2350954737?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=Byfm%2FT5nmMU1%2BHBIqmr3iQ%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:57.384Z",
        "description": "<strong><u>Job Description<br><br></u></strong>The Future Talent Program features internships that last up to 12 weeks and will include one or more projects. These opportunities in our Research Labs can provide you with great development and a chance to see if we are the right company for your long-term goals.<br><br>Safety Assessment and Laboratory Animals Resources (SALAR) helps advance high quality drug candidates into development by defining the non–clinical safety and selectivity of lead compounds. SALAR employees evaluate Lead Op candidates and preclinical toxicity of drug development candidates, provide mechanistic understanding of drug-induced toxicity, and assess implications for human safety. SALAR provides collaborative research in animal model development, veterinary medical and animal care, and research facility management. Safety Assessment also responds to regulatory questions in support of drug registration.<br><br><strong><u>Required Education And Experience<br></u></strong><ul><li>Candidates must currently be enrolled in a minimum of a BS/BA in: applied math, computer science, chemistry, physics, computer engineering, biomedical engineering, or related disciplines.</li><li>Candidates must be available to work full-time for up to (12) weeks beginning in June of 2021.<br><br></li></ul><strong><u>Preferred Experience And Skills<br></u></strong><ul><li>Candidates should have a G.P.A of 3.0 or higher.</li><li>Candidates should have strong analytical and communication skills.</li><li>Candidates should have demonstrated ability to learn new technologies.</li><li>Candidates should have familiarity in one of the following scientific computation environments: Python (preferred), Javascript, Matlab, or R.</li><li>Candidates should have hands-on analysis experience with biological data types, such as those used in genomics, proteomics, biological chemistry, or spectroscopy.</li><li>Candidates should have familiarity with XML, json, REST, and/or SOAP .</li><li>Candidates should have experience with structured and un-structured data sources, such as SQL, postgres, mongoDB, or Big Table.</li><li>Candidates should have familiarity with statistics, discrete math, and probabilistic modeling.</li><li>Candidates should be familiar with statistical learning methods, such as supervised and unsupervised modeling.<br><br></li></ul>We are a research-driven biopharmaceutical company. Our mission is built on the simple premise that if we “follow the science” and that great medicines can make a significant impact to our world. And we believe that a research-driven enterprise dedicated to world-class science can succeed by inventing medicine and vaccine innovations that make a difference for patients across the globe.<br><br><strong><u>Who We Are …<br><br></u></strong>Merck &amp; Co., Inc., Kenilworth, New Jersey, USA is known as “Merck” in the United States, Canada &amp; Puerto Rico. We are known as “MSD” in Europe, Middle East, Africa, Latin America &amp; Asia Pacific. We are a global biopharmaceutical leader with a diverse portfolio of prescription medicines, oncology, vaccines and animal health products.<br><br>We are driven by our purpose to develop and deliver innovative products that save and improve lives. With 69,000 employees operating in more than 140 countries, we offer state of the art laboratories, plants and offices that are designed to Inspire our employees as we learn, develop and grow in our careers. We are proud of our 125 years of service to humanity and continue to be one of the world’s biggest investors in Research &amp; Development.<br><br><strong><u>What We Look For …<br><br></u></strong>In a world of rapid innovation, we seek brave Inventors who want to make an Impact in all aspects of our business, enabling breakthroughs that will affect generations to come. We encourage you to bring your disruptive thinking, collaborative spirit and diverse perspective to our organization. Together we will continue <strong>Inventing For Life, Impacting Lives</strong> while <strong>Inspiring Your Career Growth</strong>.<br><br><strong>INVENT.<br><br></strong><strong>IMPACT.<br><br></strong><strong>INSPIRE.<br><br></strong>FTP2021<br><br><strong><u>US And Puerto Rico Residents Only<br><br></u></strong>If you need an accommodation for the application process please email us at staffingaadar@msd.com<br>For more information about personal rights under Equal Employment Opportunity, visit:<br><br>EEOC Poster<br><br>EEOC GINA Supplement<br><br>OFCCP EEO Supplement<br><br>OFCCP Pay Transparency Rule<br><br>We are an equal opportunity employer, Minority/Female/Disability/Veteran – proudly embracing diversity in all of its manifestations.<br><br><strong>Search Firm Representatives Please Read Carefully <br></strong>Merck &amp; Co., Inc., Kenilworth, NJ, USA, also known as Merck Sharp &amp; Dohme Corp., Kenilworth, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.<br><br><strong><u>Employee Status<br><br></u></strong>Intern/Co-op (Fixed Term)<br><br><strong>Relocation:<br></strong>No relocation<br><br><strong><u>VISA Sponsorship<br><br></u></strong>No<br><br><strong><u>Travel Requirements<br><br></u></strong>No Travel Required<br><br><strong><u>Flexible Work Arrangements<br><br></u></strong>Not Specified<br><br><strong><u>Shift<br><br></u></strong>1st - Day<br><br><strong><u>Valid Driving License<br><br></u></strong>No<br><br><strong><u>Number Of Openings<br><br></u></strong><strong>Hazardous Material(s):<br><br></strong>2<br><br><strong>Requisition ID:</strong>R72491",
        "index": 7,
        "skills": [
            "data science",
            "project management",
            "information technology",
            "sql",
            "javascript",
            "matlab",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "contact": "staffingaadar@msd.com",
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Omnicell",
        "location": {
            "city": "Cranberry",
            "state": "Pennsylvania"
        },
        "posted": "2020-12-09T03:45:57.722Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-omnicell-2354179818?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=LeixEbVk1Yl%2F4%2FdOgZH9PA%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:57.722Z",
        "description": "Do you want to make a meaningful difference in the quality of healthcare? Omnicell is empowering health systems and pharmacies to radically transform the way they manage medications, so they can achieve the vision of the Autonomous Pharmacy. Thousands of hospitals, pharmacies, skilled nursing facilities and care homes trust Omnicell to provide continuous innovation. They need us to deliver solutions to meet the ever-evolving challenges of the healthcare landscape. We encourage creative problem solving and outside-the-box thinking that only a diverse, well-rounded workforce can bring.<br><br>Join us as we build on our powerful combination of advanced automation, predictive intelligence, and expert services to create a safer future for patients—one where medication errors are a thing of the past. You’ll be joining an organization whose culture encourages individual development, rewards intellectual curiosity, and embraces an inclusive environment. Join our growing company and help shape the future at Omnicell!<br><br>Software Engineer Intern<br><br>Omnicell is looking for exceptional people with great ideas, skills and passion for technology. As an intern for an Omnicell engineering team, you will be an active participant and contributor.<br><br>Omnicell’s mission is to improve healthcare for everyone. This means our customers range from clinicians in large hospitals to individuals managing their own medication regiment from home. Omnicell envisions a future where unnecessary manual processes are reduced or eliminated, patients are supported, and clinicians are able to spend more time helping people.<br><br><strong><u>Join Us And Help Us Build The Autonomous Pharmacy<br><br></u></strong><strong>Things you’ll do during your internship:<br></strong><ul> <li> Work with an Assigned Mentor and Agile Team to understand requirements, implement creative system solutions, and verify the results through automated test cases. </li> <li> At the end of your internship, you will present your project to Omnicell product development leadership. </li> <li> Contribute to the development of new features using .NET Core, containers. Angular, PostgreSQL and AWS </li> <li> Resolve defects/bugs to gain better understanding of real-world issues/challenge </li> <li> Understand the nuances of working in a cloud native development environment </li> <li> Learn how to work effectively with a cross functional team. </li> <li> Deliver meaningful business results. </li> <br><br></ul><strong><u>Required Knowledge And Skills<br></u></strong><ul> <li> A working knowledge of C++, C#, or Angular along with basic SQL skills or similiar programming language. </li> <br><br></ul><strong><u>Basic Qualifications<br></u></strong><ul> <li> must have a cumulative 3.2 GPA or above </li> <li> must have completed at least 1 year towards a bachelor’s degree </li> <li> must be currently enrolled in either a bachelors or master’s program </li> <li> must be enrolled in a degree field that is relevant to or within the field of study towards the internship positions function (Computer Science, Math, Information Systems or similar field with focus on application development.) </li> <li> must be authorized to legally work in the US without Omnicell sponsorship </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li> Strong communication, presentation, analytical and problem-solving skill. </li> <li> Attention to detail is a must. </li> <li> Interest in the healthcare industry. </li> <br><br></ul><strong><u>Work Conditions<br></u></strong><ul> <li> Office Environment. (Remote due to Covid) </li> <br><br></ul>Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.<br><br>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.<br><br>Omnicell will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information.<br><br>Share",
        "index": 8,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "angular",
            "c and c++",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Data Science Intern",
        "company": "Rapid7",
        "location": {
            "city": "Boston",
            "state": "Massachusetts"
        },
        "posted": "2020-12-30T03:45:58.010Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-rapid7-2334187648?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=sIu8rS5jcpCM8XTI2XrhoA%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:58.010Z",
        "description": "<strong>We are looking for a highly motivated data science intern to drive insight for key business stakeholders, across our internal functional areas. This role will be integral in building our data science toolset. Working in tandem with our BI Analysts &amp; Operations teams, this position will work to build scalable tooling that provides proactive impact analysis and adds automation to our data science stack.<br><br></strong><strong>The ideal candidate is a self-starter with a strong interest in business and an affinity for how organizational goals and data come together to support a growing company. Bring your data science skills and come help us solve some of our most challenging and important business problems. <br><br></strong><strong><u>Essential Responsibilities<br></u></strong><ul><li><strong>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business decisions &amp; business process optimization. </strong></li><li><strong>Act as a key contributor in providing advanced analytics (predictive and prescriptive) and recommendations to our business stakeholders, with a core focus on improving our ability to systematically determine key drivers of a complex business.</strong></li><li><strong>Use predictive modeling to increase and optimize customer experiences, revenue generation, marketing spend and other business outcomes.</strong></li><li><strong>Develop processes and tools to monitor and analyze model performance and data accuracy.</strong></li><li><strong>Provide clear visualizations and present analyses to management and executive-level stakeholders, using Business Intelligence tools and predictive analytics to drive key decisions</strong></li><li><strong>Provide recommendations to Business Intelligence leadership on best practices and the continual improvement in advanced analytics at Rapid7<br><br></strong></li></ul><strong><strong>Job Requirements<br></strong></strong><ul><li><strong>In pursuit of a Bachelor's or Master's degree candidate in Computer Science, Business Analytics, Data Science or related technical field (min. GPA of 3.0) with prior technical internship or data science experience.</strong></li><li><strong>Experience using R, Python, and SQL to manipulate data and draw insights from large, diverse data sets.</strong></li><li><strong>Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.</strong></li><li><strong>Experience visualizing/presenting data using: matplotlib, ggplot, rShiny, Tableau, etc.</strong></li><li><strong>Must be a fast learner with high attention to detail and possess a passion for data, data quality &amp; business analytics</strong></li><li><strong>Must have excellent communication &amp; interpersonal skills, utilizing data to tell a story</strong></li><li><strong>Self-motivated and accountable; able to take direction and manage prioritization of work</strong></li><li><strong>Results-oriented and collaborative; able to work independently as well as part of a team</strong></li></ul>",
        "index": 9,
        "skills": [
            "data science",
            "machine learning",
            "sql",
            "data visualization",
            "networks",
            "project management",
            "python"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "SpineZone",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2021-01-04T03:45:58.767Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-spinezone-2338895253?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=wJKHZR47%2Fi7fsvfJbOSBhg%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:58.767Z",
        "description": "SpineZone is looking for a Data Science Intern to work with our Product Director on a variety of mission-critical projects related to our online platform and other proprietary technology and systems. We are looking for somebody who can work well independently, and somebody well-versed in the modern data science tools and technology.<br><br>This internship will be remote and temporary with the possibility of turning into a full-time role.<br><br><u><em><strong>What You Will Do:<br><br></strong></em></u><ul><li>Work under the guidance of Product Director to write data pipelines, perform ad hoc analytics, operationalize model pipelines, and communicate results back to team.</li><li>Use techniques from statistical analysis and predictive modeling to help decipher user behavior models.</li><li>Query and analyze data in support of existing apps and other products in commercial use.</li><li>Work with team under agile development methods.</li><li>Organize and interpret raw data into analysis-ready data sets.</li><li>Assist in requirements definition, project scoping, timeline management, and results documentation to ensure professional relationship management.</li><li>Perform high quality research in collaboration with other functional teams into the patterns and properties of meaningful data from the individual to population scale to inform product, digital services and business development.</li><li>Document code in shared repositories and communicates project results to department on completion of program.</li><li>Assist in executing projects that further the improvement and efficiency of the department.<br><br></li></ul><u><em><strong>You Should Have:<br><br></strong></em></u><ul><li>Familiarity working with databases and distributed computing platforms and their query interfaces.</li><li>Familiarity working with computer programming languages, and/or excel, SQL techniques.</li><li>Familiarity with statistical inference, data mining, pattern recognition or machine learning.</li><li>Familiarity with algorithms and the mathematical methods used to extract information from data.</li><li>Familiarity provisioning compute resources with tools and software for exploratory data science discovery work.</li><li>Familiarity with visualization software and techniques.</li><li>Excellent written and verbal communications skills, with a proven ability to translate complex methodologies and analytical results to business insights.<br><br></li></ul><u><em><strong>You Should be:<br><br></strong></em></u><ul><li>A team player with demonstrated track record of collaboration.</li><li>Capable of conducting independent research, motivated by hard technical challenges.</li><li>Results-driven, self-motivated, and a self-starter.<br><br></li></ul><em><strong><u>Bonus Points if you have:<br><br></u></strong></em><ul><li>Experience working with Python or Java.</li><li>Working knowledge of enterprise cloud tools for big data analysis such as Google Cloud, AWS, and Azure</li><li>Familiarity working with column store and NoSQL databases</li><li>Familiarity with queuing systems and ability to work efficiently in a shared compute environment.</li><li>Ability to prepare high quality technical figures for publication in industry and scientific journals.</li><li>Familiarity working cross functionally with teams deployed across the US and internationally.</li><li>Entrepreneurial experience at start-ups and academic labs.<br></li></ul>Powered by JazzHR<br><br>PgQ3y29uTe",
        "index": 10,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "sql",
            "java",
            "data visualization",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Software Engineer Internship",
        "company": "Clever Inc.",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-09T03:45:59.112Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-at-clever-inc-2318765243?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=h81sB46zOBwWzdd8CHBN2g%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:59.112Z",
        "description": "<p><strong>The Problem</strong></p><p>At its core, education has a fundamental data problem: schools run on legacy infrastructure that's impossible for developers to build on top of. We're on a mission to replace the terrible things that engineers have to do to build classroom software (think nightly CSV FTP transfers) with an API that feels more like Facebook's or Stripe's. On the school-facing side, we're looking to become a single place where schools can discover, integrate, and evaluate the dozens of in-class applications they're using.</p><p><br></p><p>When we started seven years ago, four schools used Clever. Today, Clever is used by over 78,000 schools, making it the fastest-growing company in education. We're looking for talented engineers who want to help us build Clever into something every school, student, and teacher relies on.</p><p><br></p><p><strong>A Day in the Life</strong></p><p><br></p><p>Interns at Clever work alongside full-time engineers, improving existing products and creating apps that live on top of Clever. Our very first intern wrote an iPhone app on the Clever platform that spread to over a thousand schools on the day it was released. Another intern wrote an app that let schools provision Google accounts, which now manages over 2 million student and teacher accounts.&nbsp;</p><p>Clever is mostly written in Typescript, Javascript, Node.js, and Go.</p><p>This is&nbsp;<em>exclusively&nbsp;</em>a summer 2021 (May - August / June - September) opportunity.&nbsp;</p><p><br></p><p><strong>Requirements</strong></p><p><br></p><ul><li><strong>Must be graduating in or before June 2022.</strong>&nbsp;Why is this? Clever only offers internships to college students who will be graduating within 9 months of their internship’s completion because we view internships as a path to a full-time offer. The internship program lets us identify and mentor future engineers, while offering the the intern a chance to see what it's like to be part of the Clever team.&nbsp;At the end of the internship, we hope to be able to build on a great summer by extending our interns an offer to come back and join us!</li><li>Relevant coursework in computer science.</li><li>Past projects demonstrating strong coding ability.</li><li>A desire to grow as an engineer through collaboration, code reviews, and learning new languages/technologies.</li><li>Excellent communication skills</li><li>A desire to work in a diverse, highly collaborative team environment</li></ul>",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "javascript",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Programmer - Intern",
        "company": "Cognizant",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-01-06T03:45:59.410Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-intern-at-cognizant-2323009493?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=FqnwkRkhMnIoz7CuGl6Ffg%3D%3D&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:59.410Z",
        "description": "Cognizant Softvision seeks an intern with experience in software design, coding and debugging. The intern will gain exciting real-world software engineering experience at a thriving company.<br><br>We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Document and test new software applications</li><li> Assess new application ideas</li><li> Develop applications (coding, programming)</li><li> Test and release applications<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Computer Science/Network Engineering, Engineering, or Mathematics major</li><li> Excellent analytical and mathematics skills</li><li> Ability to work in teams</li><li> Experience programming in Javascript, HTML, CSS, React.js<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Practical experience with a wide variety of software engineering tasks</li><li> Collaborating hand-in-hand with skilled teams of software engineers</li><li> Shadowing, mentoring, and training opportunities with seasoned professionals</li><li> Opportunity to participate in networking events and company meetings</li><li> Flexible schedule for students</li><li> Compensation available<br></li></ul>Employee Status : Full Time Employee<br><br>Shift : Day Job<br><br>Job Posting : Dec 09 2020<br><br><strong><u>About Cognizant<br><br></u></strong>Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.<br><br>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.<br><br>Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br><br>If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "index": 12,
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "networks",
            "machine learning",
            "web development",
            "react"
        ],
        "contact": "CareersNA2@cognizant.com",
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "ASML",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2020-12-16T03:45:59.687Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-asml-2346289869?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=%2FfP1Kdnaybwy1VmtGjbPXA%3D%3D&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:59.687Z",
        "description": "<strong>Introduction<br></strong>ASML US, including its affiliates and subsidiaries, bring together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, Netherlands, and we have 18 office locations around the United States including main offices in Chandler, Arizona, San Jose and San Diego, California, Wilton, Connecticut, and Hillsboro, Oregon.<br><strong>Job Mission<br></strong>We are looking for software interns who have a passion for designing and coding software for a distributed control system.Join Cymer/ASML and you will be joining a team that operates in a fast-paced, uniquely innovative and challenging environment to create new-to-industry solutions with rapid productization to support an aggressive commercialization plan for the EUV technology within ASML.<br><br>You will work with software architects and control system engineers as you develop software in response to the software and controls requirement and design documents. You will get to participate in designing for excellence, keeping in mind all the –cities and –abilities like reusability, modularity, simplicity, maintainability, …You will get to use UML to capture your design, you will also get to lead projects of small to medium size where you can analyze complex issues, determine the best test methodologies, and contribute in all aspects of the software development, build, test and release cycle.<br><br>Your universe will not just be the software team in San Diego, or even the controls team in San Diego, it will be your colleagues in all the functional teams in San Diego and Veldhoven, and as we try to meet our resource and budget challenges you will also work with our partners near-site, off-site as well as offshore.<br><br>And you may ask, what does the control system software do?Well, the control loops involve data exchange at speeds up to 100 kHz while data collection for diagnostics purposes is done at up to 1Khz rate. There is interaction between control loops running on quad core boards and platform software that runs on IBM Bladecenter. Data is stored on board in Postgres Databases and is shipped via the fab network to data servers in San Diego. And our graphical user interface developed using Qt serves a complex set of users - operators, engineers, scientists and customers. And we don't forget safety, the control system has a Siemens PLC to ensure both human safety is ensured and machine damage is prevented.<br><br>Come and join our journey and you will be challenged and rewarded as you work alongside a group of talented, passionate and fun-loving engineers. You can tell your friends –I work on semiconductor lithography machines that allow the printing offiner features for the next generation of chips that power the innovations in the worldtoday.<br><br>This position may require access to controlled technology, as defined in the Export Administration Regulations (15 C.F.R. <li>730, et seq.). Qualified candidates must be legally authorized to access such controlled technology prior to beginning work. Business demands may require the Company to proceed with candidates who are immediately eligible to access controlled technology.<br><br><strong><u>Job Description<br></u></strong><ul><li>Understandthe software response to system and controls requirements, develop software based on software requirements.</li><li>Design and create Test Specification Documents, and deliver software solutions of highest quality.</li><li>Work in hard and soft real time domain with complex hardware interfaces and various communication protocols (TCP/IP) </li><li>Ability to develop code for a distributed control system. The coding will require programming in different languages (C++, Python) on different OS environments (VxWorks, Linux).</li><li>Conform to the approved Software Development Process and the Program Development Process, and be an active champion of process improvement.</li><li>Utilize knowledge to design software for large complex multi-processor systems.</li><li>Articulate (verbal and written) the design decisions and implementations made to management at Cymer /ASML, its development partners and the customer.</li></ul> <strong>Education<br></strong><ul><li>Requires a minimum of at least 3 years (Junior level) completed in pursuit of BS in Computer Science, or other related Engineering or Science fields.Pursuit of a MS or Ph.D. in Computer Science or related Engineering or Science field is a plus.</li></ul> <strong>Experience<br></strong><ul><li>Previous experience in a Technical Development role is a plus </li><li>Experience in leadership or designing software for a complex multi-processor distributed control system is a plus.</li><li>Requires experience programming in different languages (C++, Python) on different OS environments (VxWorks, Linux).</li><li>Knowledge of working in hard and soft real time domain with complex hardware interfaces and various communication protocols (TCP/IP) </li></ul> <strong>Personal skills<br></strong><ul><li>Can observe and respond to people and situations and interact with others encountered in the course of work.</li><li>Can learn and apply new information or skills. </li><li>Must be able to read and interpret data, information, and documents.</li><li>Strong customer focus and commitment to customer satisfaction through prioritization, quality, efficiency and professionalism.</li><li>Ability to complete assignments with attention to detail and high degree of accuracy. </li><li>Proven ability to perform effectively in a demanding environment with changing workloads. </li><li>Result driven-demonstrate ownership and accountability.</li><li>Identifies bottlenecks and drives improvements.</li><li>Work independently or as part of a team and follow through on assignments with minimal supervision. </li><li>Demonstrate open, clear, concise and professional communication.</li><li>Ability to establish and maintain cooperative working relationships with co-workers and customer. </li><li>Work according to a strict set of procedures within the provided timelines.</li></ul><strong>Other information<br></strong><ul><li>Routinely required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch. Occasionally required to move around the campus.</li><li>Occasionally lift and/or move up to 20 pounds.</li><li>May require travel (specify domestic and/or international) dependent on business needs – specify percentage of travel.</li><li>Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.</li><li>Can observe and respond to people and situations and interact with others encountered in the course of work.</li><li>Can learn and apply new information or skills. </li><li>Must be able to read and interpret data, information, and documents.</li><li>Strong customer focus and commitment to customer satisfaction through prioritization, quality, efficiency and professionalism.</li><li>Ability to complete assignments with attention to detail and high degree of accuracy. </li><li>Proven ability to perform effectively in a demanding environment with changing workloads and deadlines. </li><li>Result driven-demonstrate ownership and accountability.</li><li>Identifies bottlenecks and drives improvements.</li><li>Work independently or as part of a team and follow through on assignments with minimal supervision. </li><li>Demonstrate open, clear, concise and professional communication.</li><li>Ability to establish and maintain cooperative working relationships with manager, co-workers and customer. </li><li>Work according to a strict set of procedures within the provided timelines. <br></li></ul>EOE AA M/F/Veteran/Disability<br><br></li>",
        "index": 13,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "hardware",
            "networks",
            "c and c++",
            "python"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern (Chandler, AZ - Summer 2021)",
        "company": "Garmin",
        "location": {
            "city": "Chandler",
            "state": "Arizona"
        },
        "posted": "2020-12-23T03:45:59.993Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-chandler-az-summer-2021-at-garmin-2367592598?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=DoUR%2Bjn1IUsb%2BYErf4k4Eg%3D%3D&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:45:59.993Z",
        "description": "We are looking for a full time Software Engineer Intern to develop embedded or application software for products at our Chandler, Arizona office. They will test software, perform software releases, quality assurance activities and performance maintenance activities on real Garmin products.<br><br><strong><u>Essential Functions And Responsibilities In This Role Include<br></u></strong><ul><li>New product design and development</li><li>Troubleshooting basic issue reports &amp; implementing software solutions</li><li>Communicating status of work &amp; providing visibility to supervisor</li><li>Learning how to use &amp; apply various engineering tools as needed for the role</li><li>Planning technical work to meet team objectives</li><li>Applying design standards and procedures to implement basic designs</li><li>Thoroughly documenting work in an organized manner</li><li>Working collaboratively in a team environment to achieve individual &amp; team goals<br></li></ul>Qualified candidates for this role will have completed coursework in Computer Science, Electrical Engineering, Computer Engineering, or a field relevant to perform the essential functions of this job description with a minimum cumulative GPA greater than or equal to 3.0.<br><br><strong><u>Other Requirements Include<br></u></strong><ul><li>Demonstrated strong and effective verbal, written, and interpersonal communication skills</li><li>Must demonstrate relevant experience and/or training in a low, mid, or high-level language such as C, C++, C#, Java, or other selected languages</li><li>Must possess relevant experience and/or training in data structures or object-oriented design methodology relevant to Garmin’s business need</li><li>A cumulative GPA greater than or equal to 3.0 and previous experience working in a team environment is highly preferred!<br><br></li></ul><strong><u>Garmin Intern Perks<br></u></strong><ul><li>Social activities and service opportunities planned for interns</li><li>Paid time off</li><li>Paid holidays</li><li>Test cutting-edge Garmin products before they are released</li><li>No formal dress code</li><li>Assigned mentor to answer your questions and help you grow in your technical skillsets</li><li>Associate discount on consumer products</li><li>Paid, coordinated housing or stipend option for interns whose permanent address is located more than 50 miles from Garmin HQ</li><li>Housing stipend option for those at field locations (non-Olathe) whose permanent address is located more than 50 miles from the field location</li><li>If you join us full-time, your time as an intern counts towards becoming fully vested with your 401K</li><li>Waived registration fees for Garmin-approved races<br></li></ul>As part of our ongoing commitment to helping associates maintain a healthy balance between work and life, we sponsor company-wide and individual wellness initiatives, as well as world-class sporting events—and even some of the participating athletes. In each of the communities in which we do business, Garmin has a strong philanthropic and civic presence.<br><ul><li>Applicants will be considered for all U.S. locations; this excludes Salem, Oregon.</li><li>Applicants will also be considered for all SWE internship positions open at Garmin, excluding Salem, Oregon. </li><li>Applicants will be considered for all Garmin business segments (i.e., Aviation, Fitness, Marine, Outdoor, Auto OEM, Consumer Automotive, etc.).<br></li></ul><em>Garmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.</em>",
        "index": 14,
        "skills": [
            "software engineering",
            "java",
            "c and c++",
            "machine learning"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-16T03:46:00.256Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-lockheed-martin-2347163039?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=L0Qka1xRd2ocPHSOCDPwaA%3D%3D&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:00.256Z",
        "description": "<strong>Description:</strong>Going to space is just the beginning. It’s what you do when you get there that matters. Lockheed Martin builds the satellites and spacecraft that do amazing things in space for government and commercial customers. Connecting people. Advancing discovery. And protecting what matters most. Lockheed Martin-built satellites give earlier warning of severe weather, connect troops on the battlefield, and deliver GPS directions to a billion people worldwide.<br>As we look to the future, we’re driving innovations to help our customers do even more in orbit. That’s why we’re crafting smarter satellites that operate like smartphones in the sky, with apps that can be updated in orbit so they can adapt as mission needs on the ground change. Your mission is ours. And as that mission evolves, we’ll be ready. Will you?<br>What does this role look like?<br>You will participate in engineering tasks supporting a systems engineering team. Working with experienced engineers, you will perform work in all systems engineering phases that could include requirements definition, allocation and maintenance. This position supports various system analyses in support of mission planning and execution.<br><br><strong><u>Basic Qualifications<br><br></u></strong>Actively enrolled in a Computer Science, Aerospace Engineering or other related degree program from an accredited college/university. This position requires special access to support the program and requires the selected candidate to be a US Citizen.<br><br><strong><u>Desired Skills<br><br></u></strong>Familiarity with real-time development environments and languages (C, C++). Experience with MATLAB, Simulink. Experience or classroom knowledge with embedded software/hardware. Proficiency in Microsoft Office applications.<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern",
        "index": 15,
        "skills": [
            "software engineering",
            "matlab",
            "hardware",
            "c and c++",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "TeleTracking",
        "location": {
            "city": "Pittsburgh",
            "state": "Pennsylvania"
        },
        "posted": "2020-12-16T03:46:00.570Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-teletracking-2356423979?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=FrU8%2BPO8VSwubkmy%2Btrf8w%3D%3D&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:00.570Z",
        "description": "<strong><u>Description<br><br></u></strong>“TO ENSURE THAT NO ONE WILL EVER WAIT FOR CARE”<br><br>Software Engineer Intern<br><br>TeleTracking, Technologies is looking f or exceptional talent with great ideas, cutting edge skills, and a passion for technology and healthcare. We’re not your average IT shop, and this isn’t your average internship. In your 1 2 weeks with TeleTracking, you’ll have a voice in t he room, be pushed to and challenged , and play a critical role in innovative projects that are transforming healthcare technology. Ready to get started?<br><br>What’s in it for you?<br><br>A typical employee spends eight hours a day at work…we think you should spend that time doing something that you love-not just earning a paycheck. As a TeleTracking Intern, you will get to meet and interact with our senior leadership team and complete meaningful work. You will work on individual and group projects that you will present to not only the Senior Leadership Team, but all kinds of TeleTracking employees. You will have an assigned mentor that will be there for you and coach you through your time here at TeleTracking. You will learn that we work hard, but we play hard too. We invite you to participate in events, such as team-building , lots of good food and of course giving back to our community.<br><br>Here’s what you will do all summer!<br><br>The Software Engineer Intern assists in the development and delivery of software solutions for the IQ Platform. The development of these solutions would include collaborating, researching, designing, documenting and developing new software. As an intern, you will get the opportunity to write, debug, and test (unit, functional, and performance) code in all application layers, including front end (Web), middle layer (Service), and data access layer (Data) in a microservices architecture.<br><br>Here’s what you need to get the work done:<br><ul><li> Undergraduate or graduate student with one year or less left to graduate in Computer Science, Software Engineering, Management Information Systems, or similar field of study </li><li> Cumulative GPA of 3.0 or higher </li><li> Experience with at least one programming language ( Python, C#, Java, JavaScript, Go, Scala, etc.) </li><li> An ability to think abstractly and work across different areas of the company </li><li> Strong communication and presentation skills </li><li> Availability to participate in the Internship Program full-time <br></li></ul>Depending on your interests, you will get hands on experience working with many of the following technologies:<br><ul><li> Experience with web service technology (REST, GraphQL ) and knowledge of microservices architecture </li><li> Experience with modern browser technology such as HTML5 and CSS3 </li><li> Experience with JavaScript frameworks (AngularJS, Knockout.js, React, etc.) </li><li> Experience with mobile development frameworks (Ionic, Xamarin, React Native) </li><li> The use of relational databases (Microsoft SQL Server), SQL, Object Relational Mapping technology (Microsoft Entity Framework, Hibernate, etc.) and NoSQL databases (MongoDB, Cassandra, etc.) </li><li> Understanding of Agile and Scrum methodologies </li><li> Knowledge of cloud-based computing/environments (Microsoft Azure, Amazon Web Services) </li><li> Knowledge of Big Data technologies such as Apache NiFi / MiNiFi , Apache Kafka, Apache Spark, Amazon EMR, Apache AirFlow , Amazon Redshift, etc </li><li> Good software development and analytical skills with the ability to work within the team to transform ideas into solutions <br><br></li></ul><strong><u>Once You Apply-here’s What You Can Expect<br><br></u></strong>December 1 4 - January 31 Applications Accepted<br><br>February I nterviews Conducted<br><br>March 1 Deadline to E xtended Offers<br><br>May 2 4 First D ay and O rientation<br><br>The i nternship t imeframe will run from May 2 4 , 20 21 through August 13 , 20 21 .<br><br>We can’t wait to meet you—apply today!<br><br>WORK ENVIRONMENT AND TRAVEL<br><br>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions. The term \"qualified individual with a disability\" means an individual with a disability who, with or without reasonable accommodation, can perform the essential functions of the position. While performing the duties of this job, the employee is regularly required to communicate professionally in person, over the telephone, through email and other electronic means, move about the office, handle various types of media and equipment, and visually or otherwise identify observe and assess. The employee is occasionally required to lift up to 10 pounds unless otherwise specified in the job description.<br><br>TeleTracking is committed to a policy of non-discrimination in all employment practices, including recruitment, hiring, training, education, tuition assistance, social and recreational programs, compensation, discipline, promotion, benefits, termination of employment and all other terms and conditions of employment. TeleTracking strictly prohibits and does not tolerate discrimination against employees, applicants or any other covered persons because of race, color, religion, creed, national origin or ancestry, ethnicity, sex (including pregnancy), gender (including gender nonconformity and status as a transgender or transsexual individual), age (40 and over), physical or mental disability, non-job related handicap or disability, citizenship, past, current or prospective service in the uniformed services, genetic information, use of a guide or support animal because of blindness, deafness or physical handicap, or any other characteristic protected under applicable federal, state or local law.",
        "index": 16,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "javascript",
            "java",
            "data visualization",
            "scala"
        ],
        "due": "2021-01-31T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Computer Science/Computer Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "Ohio"
        },
        "posted": "2021-01-01T03:46:00.849Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-computer-engineering-intern-at-applied-optimization-2351182822?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=ojhJ8lVIZTbYsHXCu6fgdg%3D%3D&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:00.849Z",
        "description": "<strong><u>Applied Optimization (AO) Job Description<br><br></u></strong>Job Title: Computer Science/Computer Engineering Intern<br>Reports to: Principal Scientist<br>FLSA Status: Part-Time (Non-Exempt)<br><br><strong><u>Position Objective<br><br></u></strong>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms in the areas of mechanical engineering or space science<br><br><strong><u>Essential Functions<br><br></u></strong>Aid in designing, building, testing, and implementing software applications for space science applications<br>Provide technical support for object modeling and algorithm development for new generation science applications<br>Perform verification, documentation, and quality assurance for new and existing software<br>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work<br>Other related duties as assigned<br><br><strong><u>Required Qualifications<br><br></u></strong>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record<br>General understanding of software development and knowledge of various coding languages<br>Attention to detail and effective time and schedule management skills<br>Effective organizing, planning, debugging, and problem-solving skills<br>Ability to adapt within a small team to support evolving customer requirements<br>Ability to execute instructions and communication in written, oral, and diagram form<br>Demonstrated strong writing, fact-gathering, and analytical skills<br>Basic computer and software skills including, but not necessarily limited to, Microsoft Office products (e.g., Outlook, Word, Excel, and Power Point)<br><br><strong><u>Preferred Qualifications<br><br></u></strong>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher<br>Minor or dual degree in mathematics, engineering, or physics/astronomy<br>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages<br>Knowledge or experience in CSS, Django, D3-data visualization, and Linux<br>Knowledge of computer operating systems<br>Ability to occasionally work 2nd shift<br><br><strong><u>Citizenship/Security Clearance Requirements<br><br></u></strong>U.S. Citizen or Green Card Holder<br>May be required to obtain and maintain U.S. Government Security Clearance<br><br><strong><u>About Our Internships<br><br></u></strong>Hours: The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the student’s class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.<br>About Us: Applied Optimization is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.<br><br><strong><u>Please Contact<br><br></u></strong>This job description is subject to change.<br><br>hr@appliedo.com",
        "index": 17,
        "skills": [
            "project management",
            "software engineering",
            "java",
            "data visualization",
            "matlab",
            "c and c++",
            "python",
            "web development"
        ],
        "compensation": "paid",
        "contact": "hr@appliedo.com",
        "remote": false
    },
    {
        "position": "Backend Software Engineering Intern",
        "company": "Confluent",
        "location": {
            "city": "Mountain View",
            "state": "California"
        },
        "posted": "2021-01-01T03:46:01.170Z",
        "url": "https://www.linkedin.com/jobs/view/backend-software-engineering-intern-at-confluent-2200187600?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=1dU9Nu%2FUJSCMpQ1Pk1PdGA%3D%3D&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:01.170Z",
        "description": "At Confluent, we’re creating a category that transforms how every company manages and streams data. Have you ever found a new favorite series on Netflix, picked up groceries curbside at Walmart, or paid for something using Square? That’s Confluent in action—giving our customers instant access to massive amounts of real-time data, enabling them to thrive in an ever-changing digital world. As one of the fastest-growing enterprise companies in history, and with Fortune 100 customers across major industries, we have a tremendous opportunity in front of us. We also have experience on our side. Our leaders have taken companies of our size to major success before and include some of the original creators of Apache Kafka®.<br><br>We’re looking for self-motivated team members who crave a challenge and feel energized to roll up their sleeves and help realize Confluent’s unlimited potential. Chart your own path and take healthy risks with the backing and support of our #OneTeam culture. Be part of inclusive initiatives like Employee Resource Groups and development programs, and take advantage of benefits that support our diverse global teams. Grow as we grow—whether you’re just starting out or managing a large team, you’ll be amazed at the magnitude of your impact.<br><br><strong><u>About The Role<br><br></u></strong>As a Backend Software Engineering Intern, you will work on our suite of cloud and on-premise software running on Apache Kafka, which powers hundreds of trillions of events per day day at top companies like Netflix, LinkedIn, and Uber. If you love building cutting edge systems and software that are mission critical to how enterprises work with data, or are passionate about open source, then you will fit right in.<br><br><strong><u>What We're Looking For<br></u></strong><ul><ul><li>Strong CS fundamentals gained through current pursuit of Bachelors, Master's or PhD in computer science, math, or related field </li><li>Strong Data Structures or Algorithms knowledge</li><li>Experience with Java, C/ C++, Go, Python<br><br></li></ul></ul><strong>Come As You Are<br><br></strong>At Confluent, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. The more diverse we are, the richer our community and the broader our impact.<br><br>Click here to review our <em> California Candidate Privacy Notice </em> , which describes how and when Confluent, Inc., and its group companies, collects, uses, and shares certain personal information of California job applicants and prospective employees.",
        "index": 18,
        "skills": [
            "software engineering",
            "java",
            "python",
            "c and c++",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Development Intern",
        "company": "Synopsys Inc",
        "location": {
            "city": "Pasadena",
            "state": "California"
        },
        "posted": "2020-12-16T03:46:01.433Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-intern-at-synopsys-inc-2332274483?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=JLAjKQOoILEmr3NPRFt5iw%3D%3D&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:01.433Z",
        "description": "<strong>Title: Software Developer Intern<br></strong>Position: Synopsys has an opening for a Software Developer Intern within the Optical Solutions Group (OSG) working in our Pasadena California office. We are looking for a motivated individual with passion for programming and software development who wants to contribute to a world leading software for optical design and analysis. The position requires good software development skills with working knowledge of C++.<strong>Job Responsibilities:</strong><li> Work with the stakeholders to turn technical requirements into actionable tasks<br><ul><li> Develop C++ code to implement required software features</li><li> Make sure the new code is covered by adequate automated tests in the internal testing environment</li><li> Demonstrate the developed capabilities to our marketing team for feedback</li><li> Work with developers, testers and customer representatives in an agile environment to create illumination software solutions to tackle cutting edge problems<strong>Job Requirements</strong></li><li> Current academic pursuit of a degree in Computer Science or similar technical field</li><li> Accomplishments in the field of Computer Science and/or Software Engineering</li><li> Hands-on experience creating C++ software, specifically Microsoft Visual C++ for Windows</li><li> Strong communication skills for working in team as well as the ability to read scholarly journals<br></li><strong><u>Optional But Desired Qualifications<br></u></strong><ul><li> Experience with mathematics, physics and optics</li><li> Experience in development of commercial software</li><li> Experience with simulation or CAD software</li><li> Keen sense of balancing the best solution versus time constraints</li><li> Experience with Software testing<br></li></ul><strong>Why come to work for the OSG R&amp;D Group?<br></strong><ul><li> Gain the real world experience in commercial software development</li><li> Work on an Agile self-directed team supported by management who provides broad but clear goals</li><li> Provide software solutions to world leading companies that design most of the consumer electronics products we use every day</li><li> Experience a team responsibility process that focuses on win-win solutions as the norm and not the exception</li><li> Work with some of the brightest engineers in both the Software and Optics fields who support each other in a multi-disciplined environment</li><li> Leverage the best of the world’s leading Electronic Design Automation software company with the world’s leading Computer Aided Optical Design software company to solve problems that have never been solved before<br></li></ul><strong><u>Company<br><br></u></strong>Synopsys OSG has been the leader in making high-quality optical software for 40 years. We are a team of internally motivated individuals dedicating ourselves to produce the best optical imaging, illumination, and photonics solutions for our customer’s applications. Our software is used to design optical systems in the automotive, display, technical lighting, medical, and aerospace.</ul></li>",
        "index": 19,
        "skills": [
            "software engineering",
            "data visualization",
            "c and c++",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern - ShopStyle",
        "company": "Rakuten Rewards",
        "location": {
            "city": "San Mateo",
            "state": "California"
        },
        "posted": "2020-12-30T03:46:01.756Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-shopstyle-at-rakuten-rewards-2333412580?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=yj6wrDEReZU44ZHxbjx8Zg%3D%3D&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:01.756Z",
        "description": "<p><strong>ROLE SUMMARY&nbsp;</strong></p><p>ShopStyle Collective is looking for a dynamic Data Science intern. You will be responsible for building and owning the next generation of search and content recommendation as well as other algorithms/systems that will make the experience for our many influencers and their followers personalized and unique. You’ll have the opportunity get to work closely with BI and our business partners to analyze business engagement content data to drive informed decisions and build predictive models on large-scale datasets to address various business problems through applying advanced statistical modeling, machine learning, or deep learning techniques. The role provides access to multiple functional areas to develop a deep understanding of the business and a great opportunity to make an impact on the company’s success in the short and long-term.</p><p><br></p><p><strong>KEY RESPONSIBILITIES</strong> </p><ul><li>Make sense of text and image content data using NLP and deep learning approaches</li><li>Research and develop state-of-the-art ML solutions to address web Bot fraud</li><li>Research technologies and define architectural improvements. Build prototypes or core features</li><li>Research and implement algorithms to optimize customer marketing experience using approaches such as reinforcement learning, HMM and/or deep learning</li><li>Build predictive models on large-scale datasets to address various business problems through applying advanced statistical modeling, machine learning, or deep learning techniques</li></ul><p><br></p><p><strong>MINIMUM REQUIREMENTS</strong> (Knowledge, Skills, Abilities) </p><p>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>Deep understanding of statistical modeling and machine learning concepts</li><li>Familiar with one or more machine learning or statistical modeling tools such as R, SciKitLearn, SparkMLib, Tensorflow</li><li>Experience using Python or R; SQL a plus</li><li>Excellent communication skills and the ability to tell a complete narrative using data to a variety of audiences</li></ul><p><br></p><p><strong>QUALIFICATIONS &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong></p><ul><li>Currently enrolled in a Master's or PhD program in Computer Science, Electrical Engineering, Statistics, or equivalent</li><li>Graduation date between December 2021 and June 2022</li><li>Relevant major/area of study</li><li>Minimum GPA of 3.2</li><li>Relevant prior internship experience (preferred)&nbsp;</li></ul><p><br></p><p><strong>RAKUTEN SHUGI PRINCIPLES</strong></p><p>Our worldwide practices describe specific behaviors that make Rakuten unique and united across the world. We expect Rakuten employees to model these 5 Shugi Principles of Success.</p><p>·&nbsp;<strong>Always improve, always advance.</strong> Only be satisfied with complete success - Kaizen.</p><p>·&nbsp;<strong>Be passionately professional.</strong> Take an uncompromising approach to your work and be determined to be the best.</p><p>·&nbsp;<strong>Hypothesize - Practice - Validate - Shikumika.</strong> Use the Rakuten Cycle to success in unknown territory.</p><p>·&nbsp;<strong>Maximize Customer Satisfaction.</strong> The greatest satisfaction for workers in a service industry is to see their customers smile.</p><p>·&nbsp;<strong>Speed!! Speed!! Speed!! </strong>Always be conscious of time. Take charge, set clear goals, and engage your team.</p>",
        "index": 20,
        "skills": [
            "data science",
            "machine learning",
            "information technology",
            "sql",
            "python",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Computer Science/Information Technology Intern",
        "company": "Black Knight",
        "location": {
            "city": "Jacksonville",
            "state": "Florida"
        },
        "posted": "2020-12-23T03:46:02.099Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-information-technology-intern-at-black-knight-2351005217?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=qAZKt441rRUAwmBqTZuaXw%3D%3D&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:02.099Z",
        "description": "<p>Black Knight is the premier provider of integrated technology, services, data and analytics that lenders and servicers look to first to help successfully manage the entire loan life cycle. Our deep understanding of regulatory and compliance issues complements the knowledge, technology and solutions we offer to help our clients achieve their business goals. Black Knight offers leading software systems; data and analytics offerings; and information solutions that facilitate and automate many of the business processes across the mortgage life cycle.<br> <br> <strong>JOB FAMILY DESCRIPTION<br></strong> <br> Benefits from on the job training and mentoring along with participation in team projects, community service events, social outings, and professional development seminars. Receives the opportunity to build professional relationships and enhance their interpersonal skills.<br> <br> <strong>GENERAL DUTIES &amp; RESPONSIBILITIES<br></strong> <br><br></p><ul><li>Contribute individually and/or as a team member to support a designated functional area, analyze business processes, and work towards goals and objectives assigned by an experienced manager.</li><li>Interact with, support business partners, and participate in projects that directly impact business value.</li><li>Build professional relationships and enhance interpersonal skills.</li><li>Performs other related duties as assigned.</li></ul><p><strong>EDUCATIONAL GUIDELINES<br></strong> <br> A high school diploma or GED is required for this role.<br> <br> <strong>GENERAL KNOWLEDGE, SKILLS &amp; ABILITIES<br></strong> <br><br></p><ul><li>Applicant must be currently enrolled in collegiate coursework at an accredited university</li><li>Displays good written and oral communication skills</li><li>Demonstrates strong computer skills including a good working knowledge of MS Office</li><li>Additional skills, knowledge, and experience may be required based on the type of functions the incumbent will perform</li><li>Declared degree in a related field</li><li>Minimum Cumulative GPA Requirement: 3.0</li></ul><p><strong>Intern<br></strong> <br> Entry-level role. Basic skills with moderate level of proficiency. Generally performs single-function tasks that tend to be of small to moderate size and scope. Works under close supervision with limited latitude for independent judgment. Consults with senior peers on non-complex projects to learn through experience. Typically does not require prior related experience.<br> <br> Black Knight is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, and protected veteran or military family status. Our employees' diversity is our strength, and when we embrace our differences, it makes us better and brighter. Black Knight's commitment to inclusion is at the core of who we are, and motivates us in how we do business each and every day.<br></p>",
        "index": 21,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Internship, Summer 2021",
        "company": "Rubrik, Inc.",
        "location": {
            "city": "Palo Alto",
            "state": "California"
        },
        "posted": "2020-12-23T03:46:02.474Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-summer-2021-at-rubrik-inc-2311495411?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=d0mjoRs1Qn92WPF5tBWgaw%3D%3D&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:46:02.474Z",
        "description": "Interested in our Remote Software Engineering Internship?<br><br>Work on the next-generation of technology that will change how businesses around the world manage and unlock value from their data. Rubrik is the leader in the cloud data management space. We're revolutionizing how businesses protect, search, secure, and analyze all of their data with simple and scalable solutions. As cloud infrastructure continues to grow at an astounding rate, we’ll be solving some of it’s most interesting challenges while building a product unlike anything seen before. This is an exciting challenge with opportunities in search, analytics, scalable systems and much more! We’re just getting started so there is a lot of opportunity for personal growth and contribution.<br><br>Rubrik partners with universities around the world to offer the next class of interns an opportunity to make an impact from day one! This is a full-time (40-hrs per week) internship during the summer of 2021 running approximately 12 weeks from early June thru early September. You will work on real projects and be mentored by our senior team members to support your career development and experience.<br><br>We're looking for interns who are curious, who want to be entrusted with real responsibility and <strong>embrace the opportunity to write code that will ship</strong>. You'll be a full member of the engineering team and learn from our incredible engineers while making a measurable impact. Our Engineering teams are building and maintaining multiple products at Rubrik. These teams have clear ownership over features &amp; products ensuring they have all the context to make impactful decisions. Some product teams are full stack, while others are specialized either in back-end, or front-end. Teams are utilizing code reviews, pair programming and tech talks for ensuring engineering growth, collaboration and mentoring. Check out our engineering blog to learn more about what our engineers are working on and to see where you could fit in.<br><br><strong><u>Desired Requirements<br></u></strong><ul> <li>Currently pursuing a BS, MS, or PhD in Computer Science or a related field</li> <li>Strong understanding of computer science fundamentals, algorithms, best practices, and logical skills</li> <li>Strong coding capability</li> <li>Good team player and exceptional communicator</li> <li>Ability to thrive in a fast-paced environment</li> <li>Ability to research, learn and become proficient in new technologies</li> <br><br></ul><strong><u>What You Will Do<br></u></strong><ul> <li>Experience first hand working at a market leading cloud data management company</li> <li>Work closely with a mentor on a specific project important to Rubrik’s overall goals</li> <li>Be part of a team of engineers that share and learn from each other</li> <li>Show off your work with a presentation on your project at the end of your internship</li> <li>Have a great time and make relationships with people that will last your entire career!</li> <br><br></ul><strong><u>About Rubrik<br><br></u></strong>Rubrik is one of the fastest growing companies in Silicon Valley, revolutionizing data protection and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup.<br><br><em>Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em>",
        "index": 22,
        "skills": [
            "project management",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Pinterest Labs Research Intern",
        "company": "Pinterest",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-16T03:47:02.939Z",
        "url": "https://ca.linkedin.com/jobs/view/pinterest-labs-research-intern-at-pinterest-2193870375?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=HlHbXHU6uOtd4NA5deBLQQ%3D%3D&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:02.939Z",
        "description": "<strong>PLEASE ONLY APPLY FOR THIS POSITION ONCE. Location preferences are specified within the application. Multiple applications may delay our recruitment process.<br><br></strong>As a research intern at Pinterest Labs, you'll work on tackling new challenges in machine learning and artificial intelligence. You'll conduct research that can be applied across Pinterest engineering teams and engage in external collaborations and mentoring, while also performing research in any of the following areas: image recognition, user modeling, recommender systems, natural language processing, and big data analytics. We offer a 12-week summer internship program in our San Francisco, Palo Alto, Seattle and Toronto offices.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li>Participate in cutting-edge research in machine learning and artificial intelligence</li> <li>Contribute research that can be applied to Pinterest problems</li> <li>Collect, analyze, and synthesize findings from data and build intelligent data-driven model</li> <li>Write clean, efficient, and sustainable code</li> <li>Use machine learning, natural language processing, and graph analysis to solve modeling and ranking problems across discovery, ads and search</li> <br><br></ul><strong><u>What We’re Looking For<br></u></strong><ul> <li>Working towards a PhD in Computer Science, ML, NLP, Statistics, Information Sciences or related field</li> <li>Mastery of at least one systems languages (Java, C++, Python) or one ML framework (Tensorflow, Pytorch, MLFlow)</li> <li>Experience in research and in solving analytical problems</li> <li>Strong communicator and team player. Being able to find solutions for open-ended problems</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Publications in machine learning, AI, data science, data analytics, statistics, or related technical fields</li> <li>Strong passion for research and for answering hard questions with research</li> <li>Passion for applied ML and the Pinterest product</li></ul>",
        "index": 23,
        "skills": [
            "machine learning",
            "java",
            "deep learning",
            "c and c++",
            "python",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Data Engineering Intern (Summer 2021)",
        "company": "CrowdStrike",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2020-12-09T03:47:03.280Z",
        "url": "https://www.linkedin.com/jobs/view/data-engineering-intern-summer-2021-at-crowdstrike-2347369251?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=2s3nE6u%2B767%2FosjcJphQlA%3D%3D&position=1&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:03.280Z",
        "description": "At CrowdStrike we’re on a mission - to stop breaches. Our groundbreaking technology, services delivery, and intelligence gathering together with our innovations in machine learning and behavioral-based detection, allow our customers to not only defend themselves, but do so in a future-proof manner. We’ve earned numerous honors and top rankings for our technology, organization and people – clearly confirming our industry leadership and our special culture driving it. We also offer flexible work arrangements to help our people manage their personal and professional lives in a way that works for them. So if you’re ready to work on unrivaled technology where your desire to be part of a collaborative team is met with a laser-focused mission to stop breaches and protect people globally, let’s talk.<br><br><strong><u>About The Role<br><br></u></strong>The eCommerce Data Engineer is responsible for building and maintaining the data foundation of the eCommerce business unit, automating and aggregating data from internal systems as well as external vendors and agencies. As a key member of the eCommerce Analytics team, the Data Engineer collaborates with analysts and eCommerce leadership to create data models that power business intelligence and analytics across business planning, cohort analysis, paid media optimization, web analytics, trial experience, and store engagement.<br><br><strong>Potential Projects<br></strong><ul><li>Design, develop, and implement a data model to deliver insightful analytics while ensuring the highest standards in data integrity</li><li>Implement a data pipeline and to bring in new data to an existing project, and develop a report to demonstrate its effectiveness</li><li>Assist in the definition and QA of new metrics and KPIs for eCommerce and Marketing Analysts<br><br></li></ul><strong><u>What You’ll Need<br></u></strong><ul><li>Undergraduate student (preferably Juniors or Seniors) pursuing an Engineering, Math, or Computer Science Degree</li><li>Proficiency with RDBMS technologies and SQL</li><li>Proficiency with a programming language – ideally Python</li><li>Proactive. Excellent writing skills and verbal communication.</li><li>Problem solving skills. Research technical issues and make recommendations based on findings as issues arise.<br><br></li></ul><strong>Bonus Points<br><br></strong><li> Exposure to or interest in web analytics, digital marketing, and data visualization</li><li> Expierence with a major BI Platform (Domo, Power BI, Tableau, etc…)<br><br></li><strong><u>Benefits Of Working At CrowdStrike<br></u></strong><ul><li>Market leader in compensation and equity awards</li><li>Competitive vacation policy</li><li>Comprehensive health benefits + 401k plan </li><li>Paid parental leave, including adoption</li><li>Flexible work environment</li><li>Wellness programs</li><li>Stocked fridges, coffee, soda, and lots of treats<br><br></li></ul>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives and ways of solving problems so we strive to attract and retain talent from all backgrounds and create workplaces where everyone feels empowered to bring their full, authentic selves to work.<br><br>CrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.<br><br>CrowdStrike participates in the E-Verify program.<br><br>Notice of E-Verify Participation<br><br>Right to Work<br><br>",
        "index": 24,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "sql",
            "data visualization",
            "python",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Summer IT & Data Science Internships",
        "company": "Tapestry",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-01-01T03:47:03.564Z",
        "url": "https://www.linkedin.com/jobs/view/summer-it-data-science-internships-at-tapestry-2304647360?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=3vVtQQsf0GL6ZWNP1hcghw%3D%3D&position=2&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:03.564Z",
        "description": "Explore the possibilities across our global house of brands.<br><br>Defined by inclusivity rather than exclusivity, Tapestry embraces the exploration of individuality and invests in helping you grow personally and professionally. Every individual in our global house has the opportunity to make an impact, learn and be part of our growing and unique story.<br><br>At Tapestry, we have the freedom to express ourselves and run with our best ideas across Coach, Kate Spade New York, and Stuart Weitzman. We share a profound belief in both our individual and collective potential, and know that with hard work and dedication, anything is possible.<br><br><strong>Tapestry will be offering internship opportunities which will provide interns the opportunity to develop critical skillsets and gain hands-on experience at our house of modern luxury lifestyle brands.<br><br></strong><strong>The 2021 program will run from June 1st - August 6th. Paid internship opportunities will be available at each of our brands (Coach, kate spade, Stuart Weitzman) and within Tapestry functional groups. <br><br></strong><strong>Here’s what you can expect from our internship recruitment process:<br><br></strong><ul><li><u>Application Deadline</u> - January 11th. </li><li><u>Video Submissions</u> - Should your application be selected for further consideration, you will receive an email prompt for the video submission portion of the application in mid to late-January.</li><li><u>Final Interviews</u> - Our teams will be selecting final candidates for phone or video interviews in early to mid-February depending on candidate availability.</li><li><u>Internship Offers</u> - Delivered in early March. <br><br></li></ul><strong>Job Title: </strong>Summer IT &amp; Data Science Internships<br><br><strong>Primary Purpose:</strong> The successful individual will leverage their proficiency in IT, Data Science and/or Analytics to work within the Tapestry corporate team.*<br><br><li>Our Internship recruiting team will be selecting candidates based on relevant skillsets that could be applicable to internship opportunities within the following departments: Information Security, eCommerce Solutions, Commerce Solutions, Tech Services, Data Labs/Analytics.<br><br></li><strong>The accomplished individual may possess... <br><br></strong><ul><li>Excellent written and oral communication skills</li><li>The path to a BA/BS degree with a focus in Computer Science, Cyber Security, or related field. </li><li>The path to a BA/BS degree in Media Science, Economics, Statistics, Engineering, Math or other quantitative field (or equivalent practical experience).</li><li>Familiarity with analytics (media industry, social, digital marketing).</li><li>In-depth knowledge of Windows, Mac and Linux operating systems </li><li>Strong proficiency in LAN/WAN and WiFi/mobile technology </li><li>Understanding of networking hierarchy and protocols </li><li>Basic concepts of computer triage and forensics <br><br></li></ul><strong>An outstanding professional may have... <br><br></strong><ul><li>Experience with HTML/CSS, Javascript/JQuery, Git/Github</li><li>Routing, Switching, Firewalling knowledge </li><li>Knowledge of WiFi networks, security measures, threat countermeasures</li><li>In-depth understanding of how the Internet works (DNS, TCP/IP, etc.)</li><li>In-depth understanding of secure Internet communication (IPSEC, VPN, encryption, etc.)</li><li>Strong understanding of transport technologies (T1, T3, MPLS, Fiber, Ethernet, DSL, 4G, etc.)<br></li></ul><strong>Our Competencies for All Employees<br><br></strong><ul><li><strong>Drive for Results:</strong> Can be counted on to exceed goals successfully; is constantly and consistently one of the top performers; very bottom-line oriented; steadfastly pushes self and others for results.</li><li><strong>Customer Focus:</strong> Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</li><li><strong>Creativity</strong>: Comes up with a lot of new and unique ideas; easily makes connections among previously unrelated notions; tends to be seen as original and value-added in brainstorming settings.</li><li><strong>Interpersonal Savvy</strong>: Relates well to all kinds of people, up, down, and sideways, inside and outside the organization; builds appropriate rapport; builds constructive and effective relationships; uses diplomacy and tact; can diffuse even high-tension situations comfortably.</li><li><strong>Learning on the Fly:</strong> Learns quickly when facing new problems; a relentless and versatile learner; open to change; analyzes both successes and failures for clues to improvement; experiments and will try anything to find solutions; enjoys the challenge of unfamiliar tasks; quickly grasps the essence and the underlying structure of anything.</li><li><strong>Perseverance</strong>: Pursues everything with energy, drive, and a need to finish; seldom gives up before finishing, especially in the face of resistance or setbacks.</li><li><strong>Dealing with Ambiguity</strong>: Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; isn’t upset when things are up in the air; doesn’t have to finish things before moving on; can comfortably handle risk and uncertainty.<br></li></ul><strong>Our Competencies for All People Managers<br><br></strong><ul><li><strong>Strategic Agility</strong>: Sees ahead clearly; can anticipate future consequences and trends accurately; has broad knowledge and perspective; is future oriented; can articulately paint credible pictures and visions of possibilities and likelihoods; can create competitive and breakthrough strategies and plans.</li><li><strong>Building Effective Teams</strong>: Blends people into teams when needed; creates strong morale and spirit in their team; shares wins and successes; fosters open dialogue; lets people finish and be responsible for their work; defines success in terms of the whole team; creates a feeling of belonging in the team.</li><li><strong>Managerial Courage</strong>: Doesn’t hold back anything that needs to be said; provides current, direct, complete, and “actionable” positive and corrective feedback to others; lets people know where they stand; faces up to people problems on any person or situation (not including direct reports) quickly and directly; is not afraid to take negative action when necessary.<br><br></li></ul>Tapestry, Inc. is an equal opportunity and affirmative action employer and we pride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring, promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’s qualifications as they relate to the requirements of the position under consideration. These decisions are made without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. Visit Tapestry, Inc. at http://www.tapestry.com/<br><br>",
        "index": 25,
        "skills": [
            "data science",
            "information technology",
            "javascript",
            "networks",
            "machine learning",
            "project management",
            "software engineering",
            "web development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Software Engineer in Test Intern",
        "company": "Sony Interactive Entertainment America LLC",
        "location": {
            "city": "San Mateo",
            "state": "California"
        },
        "posted": "2020-12-16T03:47:03.856Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-in-test-intern-at-sony-interactive-entertainment-america-llc-2366303309?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=pQkHui%2FMctJ4vj1UpO1GBQ%3D%3D&position=3&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:03.856Z",
        "description": "PlayStation isn't just the Best Place to Play -it's also the Best Place to Work. We've thrilled gamers since 1994, when we launched the original PlayStation. Today, we're recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. This internship is for Summer 2021. Software Engineer in Test Intern San Mateo, CA As a Software Engineer in Test Intern, you will learn PlayStation technology hands-on: by developing tests, tools, and infrastructure to better analyze PlayStation console software. Come join us and work closely with your team to improve the test infrastructure for PlayStation SDK projects!Responsibilities<li>Learn and understand testing methodologies and tools for PlayStation SDK development.</li><li>Design and develop test cases for PlayStation SDK libraries using C++ and Python. For candidates with an interest in computer graphics, this may include testing modern shader technology.</li><li>Building and improving test infrastructure, simplifying deployment of building, testing, or demonstrating PlayStation sample applications. Typically this infrastructure will be built using Python.</li><li>Develop, maintain, and improve the testing tools and frameworks used for ensuring high quality PlayStation SDK components.</li><li>Research new tools for building and analyzing PlayStation software. Tools and Technology used and learned in this internship include</li><li>Visual Studio</li><li>Continuous integration and containerization tools such as Jenkins and Docker.</li><li>For those with graphics interest: PlayStation graphics libraries and technology. Qualifications</li><li>Pursuing a Bachelor's or Master's degree in Computer Science (or related field), and/or within 1 year of their post-graduation date</li><li>Proficient in C++ programming.</li><li>Experienced in Python programming. Should have been used in at least one academic project.</li><li>Experience building and running software in both Windows and Linux environments. Nice to Have skills - having one or more of these skills will help get you started with intern projects at SIE but are by no means required. (This internship will be a learning experience!)</li><li>Knowledge of software engineering best practices.</li><li>Writing unit and integration tests. Knowledge of fuzz testing is a plus.</li><li>Exposure to continuous integration systems.</li><li>Interest in computer graphics is a plus. Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category. We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond. We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation. SCEA provides equal employment opportunity for all applicants and employees. SCEA does not unlawfully discriminate on the basis of race, color, religion, gender, gender identity, marital status, age, disability, veteran status, sexual orientation, national origin, or any other category protected by applicable federal and state law. SCEA also makes reasonable accommodations for disabled applicants and employees.</li>",
        "index": 26,
        "skills": [
            "information technology",
            "software engineering",
            "data visualization",
            "c and c++",
            "python",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Remote Global IT & Computer Science Internship Program",
        "company": "The Intern Group",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2020-12-23T03:47:04.140Z",
        "url": "https://www.linkedin.com/jobs/view/remote-global-it-computer-science-internship-program-at-the-intern-group-2368808572?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=f%2FvDkcEWAOKhLxqbxz0rcw%3D%3D&position=4&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:04.140Z",
        "description": "The Intern Group is the leading provider of global internship programs and is regularly featured in the world’s top media including CNN, Forbes, Financial Times and Bloomberg amongst other publications. Our virtual internships provide you with the opportunity to gain invaluable professional experience, grow your network and make your resume shine, wherever you are.<br><br><strong><u>You Choose<br><br></u></strong>Realize your potential with an <strong>IT &amp; Computer Science</strong> virtual internship program. This is a flexible opportunity to fit your schedule.<br><ul><li>Between 10, 20, 30 or 40 hours of a remote <strong>IT &amp; Computer Science</strong> internship per week</li><li>The duration of your internship – from 4 to 24 weeks</li><li>The start date – we offer internship start dates every month, all-year-round<br></li></ul>Whether you’re a prospective or current university student, recent graduate or professional looking to upgrade your career, a virtual <strong>IT &amp; Computer Science </strong>internship could offer the perfect next step.<br><br><strong>What’s included in the program?<br></strong><ul><li><strong>A 10, 20, 30 or 40 hour per week professional internship in IT &amp; Computer Science<br></strong><ul><li>We have placed interns with some of the most prestigious organizations in the world, through to small and medium-sized businesses and entrepreneurial start-ups, including SONY Music, KPMG, Aflac, Quintessentially, Grant Thornton and more.</li></ul></li><li><strong>Best-in-class career advancement training. <br></strong><ul><li>You will build the skills to thrive. Our training focuses on developing in you the 8 key competencies essential to succeed in the 21st century world of work.</li></ul></li><li><strong>Keynote career talks from global business leaders.<br></strong><ul><li>You will learn from the best. Our program gives you 6 months access to exclusive, real-time talks from leading speakers. A small sample includes:<br><ul><li>Nick Jellicoe, the global head of marketing and PR at Rolex for 10 years.</li><li>Federico Vega, one of Latin America’s highest-profile entrepreneurs.</li><li>Lord Stevenson, British politician and businessman.</li></ul></li></ul></li></ul>",
        "index": 27,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Software Engineer Summer Intern",
        "company": "GoHealth",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2020-12-09T03:47:04.511Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-intern-at-gohealth-2286353865?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=Tz3YF1RJfIhVpLtcEMTS3g%3D%3D&position=5&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:04.511Z",
        "description": "GoHealth is looking for Software Engineer interns to join us in the summer of 2021. You will receive projects and daily work providing both challenging and fulfilling experiences in helping shape your skill development. At GoHealth, you’ll solve problems to create an impact for consumers across the country. We promote a comprehensive learning environment fostered by senior engineers who will encourage you to think outside the box and share new ideas every day. You’ll be given the opportunity to work with modern technologies and experience first-hand what a career with us looks like!<br><br><strong>Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. GoHealth encourages you to break that statistic and to apply. No one ever meets 100% of the qualifications. We look forward to your application.<br><br></strong><strong><u>Responsibilities<br></u></strong><ul> <li>Partner with software engineers to assist developing web-based software solutions</li> <li>Work with partners to design complex solutions from creation to production</li> <li>Develop solutions using the latest technologies to meet needs</li> <li>Learn coding best practices and participate in coding reviews</li> <li>Help debug common components within several GoHealth platforms</li> <li>Participate in technical discussions related to engineering/product work</li> <li>Compile accurate documentation and reports</li> <li>Work with departments outside of software engineering on several projects </li> <br><br></ul><strong><u>Skills And Experience<br></u></strong><ul> <li>Junior or Master’s student pursuing a degree in computer science, computer engineering or related field</li> <li>Desire to enhance programming skills in TypeScript, React.js, Java, Go, and Python</li> <li>A passion for solving complex technical problems</li> <li>Advanced knowledge on computer science fundamentals</li> <li>Ability to communicate effectively in a collaborative, fast-paced technical environment</li> <li>Excellent verbal and written communication skills</li> <li>Academic performance (minimum GPA = 3.5/4.0)</li> <br><br></ul><strong><u>Benefits And Perks<br></u></strong><ul> <li>10-week paid internship <em>(starting June 2021)</em> in the trendy River North Neighborhood in downtown Chicago<em>. </em>Subject to change remotely pending status of COVID-19</li> <li>Casual work environment - we’re a friendly group, we have fun with each other and have a respectful workplace</li> <li>Rotational days to shadow other areas of the business</li> <li>Interactive Lunch &amp; Learns with C-Suite</li> <li>Continued training opportunities through GoHealth E-Learning series</li> <li>Casual dress-code</li> <li>GoHealth is an Equal Opportunity Employer</li> <br></ul><strong><em>GoHealth will conduct all interviews for our internships remotely. While we intend to have the internship program (beginning June 2021) at our Chicago Headquarters, we are prepared to move this program virtual following the guidance of local health authorities’ and the CDC.</em></strong>",
        "index": 28,
        "skills": [
            "software engineering",
            "java",
            "c and c++",
            "machine learning",
            "python",
            "project management",
            "virtual reality",
            "information technology",
            "react"
        ],
        "compensation": "paid",
        "start": "2021-06-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Internship Opportunities - Software & Data Engineering",
        "company": "SeatGeek",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-12-23T03:47:04.790Z",
        "url": "https://www.linkedin.com/jobs/view/internship-opportunities-software-data-engineering-at-seatgeek-2344693347?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=CeBC5yuCqsZXvI8fP1ny9g%3D%3D&position=6&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:04.790Z",
        "description": "The ticketing industry is messy, complex, and makes attending live events more difficult than it needs to be; we believe a thoughtful application of software can fix that.<br><br>We’re looking for bright, curious engineers who want to help millions of people experience the thrill of live entertainment. SeatGeek is a product-centric organization that deploys code into production multiple times per day. As our product continues to grow, so does the scale of our technical challenges, and their impact on our customers. We want to ensure that we continue to build delightful experiences for fans all over the world.<br><br>With live events across the globe currently locked down or limited, the ticketing industry has never had more challenges to face or complexity to unravel — socially distanced seating, timed event entry, mass reschedulings, and more. But while the majority of live events are on pause, we’re working hard to make sure SeatGeek is positioned to help people get together and experience more live as things open back up… come help us build the software that powers it all!<br><br><strong><u>We Are Looking For People Who<br></u></strong><ul> <li>Plan to graduate no later than Spring 2022 (rising Seniors) with a degree in Computer Science or a related field</li> <li>Have relevant experience pushing code to production</li> <li>Are excited by understanding software and figuring out how it should work</li> <li>Enjoy working with a diverse group of people with different experiences and take pride in mentoring and learning from others</li> <br></ul>To see the Internship roles we currently have available, take a look at the descriptions below. In your application, you’ll have the chance to specify up to 3 roles that you’re most interested in.<br><br><strong>Backend<br><br></strong>SeatGeek has an ever-evolving product that's reshaping the way the ticketing industry works. We're looking for an engineer who wants to make it easier for millions of people experience the thrill of live entertainment with the thoughtful application of software. We use Python, C#/.NET Core, and Go although specific knowledge of those is not a prerequisite.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Create custom solutions to rather unique ticketing problems, including venue mapping, inventory tracking, and event matching.</li> <li>Collaborate with frontend developers on a full stack team to develop new features and products</li> <li>Work with product managers and internal stakeholders to bring ideas to life</li> <br></ul><strong>Frontend<br><br></strong>We're looking for an engineer who's focused on building beautiful, performant, and inclusive user interfaces. You are an engineer who cares as much about the elegance of UIs as you do about the code and architecture that powers them. We use TypeScript and React to create our user interfaces, although specific knowledge of those is not a prerequisite<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Build interactive, thoughtful, and inclusive UIs in React</li> <li>Create components and APIs for SeatGeek's frontend libraries</li> <li>Work with backend developers on a full-stack team to develop new features and products</li> <li>Collaborate with the SeatGeek design team and product managers to bring ideas to life</li> <br></ul><strong>iOS<br><br></strong>SeatGeek is focused on significantly improving the experience of going to live events using our best-in-class mobile applications. We’re looking for an engineer who is ready to dive into all aspects of our iOS app — from user interfaces and animations to networking and business logic. We use a mix of Swift &amp; Objective-C.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Own the development of new features, from conception, through design and development, to release</li> <li>Collaborate with designers to craft pixel-perfect UI and animations</li> <li>Use tools such as Jenkins and Fastlane to improve our continuous integration and continuous development pipeline</li> <li>Partner with iOS engineers to explore new Apple tools like SwiftUI and Combine</li> <br></ul><strong>Android<br><br></strong>SeatGeek’s mission is to help the world experience more live—concerts, sports, theater, and more—and these days we expect to use our phones to do just about everything, so our Android app is essential to fulfilling that vision. The Android engineering team at SeatGeek features active members of the Android community working to provide second-to-none mobile experiences. We use Kotlin, Jetpack, MVI and more, and follow best practices and Google guidelines to build a modern and scalable application.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Work with a team of developers that are passionate about building applications for the Android platform</li> <li>Collaborate with backend engineers, design &amp; product teams to build an experience that stands out among the best applications on Android</li> <li>Ensure the Android team is always on the forefront of adopting new tools, technologies and processes to make our development as pragmatic &amp; efficient as possible</li> <br></ul><strong>Data Platform<br><br></strong>SeatGeek’s product, clients, and internal teams are always hungry for data to help make decisions and measure performance. That’s where you come in. The Data Platform team ensures that SeatGeek’s analysts, data scientists, business stakeholders, and clients can make productive use of data, and we’re looking to add engineers who are passionate about all manner of software that makes data easier to work with, develop on, and interpret. We use Python, Scala, Spark, and Flink among other frameworks, but specific experience is not required.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Build internal tools to enhance the usability, observability, or performance of our ETL systems, including our open-source SQL ETL tool, Druzhba</li> <li>Work on systems that stream data in real-time from the ticket market into algorithms and databases that power our product</li> <li>Implement algorithms for transforming raw data into usable information, such as sessionization and identifier stitching</li> <br></ul><strong>Perks<br></strong><ul> <li>Equity stake in a well-funded growth stage company</li> <li>A superb benefits package that supports health/dental/vision. We also provide annual subscriptions to Headspace, Ginger.io, and One Medical</li> <li>A focus on transparency. We have regular company meetings and Q&amp;A panels where employees can chat openly with teams across SeatGeek, our co-founders, and external guests from the industry</li> <li>Although this perk is currently on pause, we can’t help but talk about it. SeatGeek employees receive a monthly ticket-purchase stipend, and we cannot wait to get back to safely attending the live events that we so dearly miss</li> <li><strong>Covid-19 Response:</strong> We’re not expecting employees to return to the office until July 2021 at the earliest. Once it’s again safe to do so, we look forward to welcoming people back to our offices. </li> <br><br></ul><em>SeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!</em>",
        "index": 29,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "scala",
            "networks",
            "c and c++",
            "project management",
            "machine learning",
            "python"
        ],
        "remote": false
    },
    {
        "position": "Backend Engineer - Intern (Summer 2021)",
        "company": "Wealthfront",
        "location": {
            "city": "Palo Alto",
            "state": "California"
        },
        "posted": "2020-12-23T03:47:05.134Z",
        "url": "https://www.linkedin.com/jobs/view/backend-engineer-intern-summer-2021-at-wealthfront-2176665924?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=%2FVdNh1quqmFrgjWt%2FHzgvg%3D%3D&position=7&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:05.134Z",
        "description": "Wealthfront is building a financial system that favors people not institutions. Our employees enable our clients to achieve their financial goals by developing sophisticated algorithms and investment strategies, intuitive user experiences, and scalable infrastructure to continuously deploy mission-critical code. Join us as we help clients create their roadmap to financial freedom!<br><br><strong><u>Responsibilities<br></u></strong><ul><ul><li>Design, implement, test and maintain logic and components anywhere in the stack</li><li>Design and build systems with automated instrumentation and monitoring</li><li>Live and breathe resiliency and uptime</li><li>Consistently improve maintainability and stability of the codebase<br><br></li></ul></ul><strong><u>Requirements<br></u></strong><ul><ul><li>Must graduate in June 2022 or Fall 2021</li><li>Expertise in Java or similar language (such as C++ or C#)</li><li>Experience with online data stores (preferably MySQL / MariaDB)</li><li>Experience with at least one scripting language</li><li>Passion for agile, test-driven development</li><li>Solid understanding of distributed systems and functional programming paradigms</li><li>Pursuing BS, MS, or PhD in computer science or related field<br><br></li></ul></ul>Everyone across the financial spectrum deserves to live secure and rewarding lives. In order to successfully serve clients across the United States, the Wealthfront team is focused on hiring team members with a diverse range of backgrounds, experiences and perspectives. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong><u>About Wealthfront<br><br></u></strong>Wealthfront is a nextgen banking service. We help you manage your money for both your short-term and long-term goals by providing a cash account with a top-of-market APY, best-in-class automated investment management, and free financial advice, anytime you want it.<br><br>Our ultimate vision is to optimize and automate all of our clients’ finances and build what we call Self-Driving Money™️. We want clients to be able to automatically deposit their paycheck into their Wealthfront account, and let us take care of the rest — paying their bills, topping off their emergency fund or 401(k), and investing the rest based on their specific goals and lifestyle. To get there, we’ll be focusing the bulk of our 2020 efforts on creating a better alternative to what the banking industry provides. Join us so you can help us turn this industry on its head and build a service that our clients don't just like, they love.",
        "index": 30,
        "skills": [
            "java",
            "software engineering",
            "c and c++",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "CBORD",
        "location": {
            "city": "Waco",
            "state": "Texas"
        },
        "posted": "2021-01-06T03:47:05.398Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-cbord-2364913842?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=qPO%2Bc%2BAf1tkp%2FwUVaJ1v5A%3D%3D&position=8&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:05.398Z",
        "description": "<strong>Job Details<br><br></strong><strong><u>Description<br><br></u></strong>CBORD and Horizon are the world’s leading providers of integrated technology solutions powering housing, access, foodservice, nutrition, eCommerce, and card systems for K-12 and higher education, acute care, senior living, and business campuses. Our success and growth is directly attributed to our DREAMteam. Our culture is built on integrity, respect for our people, and continuous personal development. We maintain an entrepreneurial spirit, where creativity, innovative problem solving, and learning agility drive our day-to-day actions.<br><br><strong> DREAMteam (how we refer to all of us)</strong> You’re engaged and self-motivated. You think like an entrepreneur, constantly driving improvement and innovation. You act as a change agent. You’re a team player contributing to a collaborative and diverse work environment. We question the status quo and so should you. You are accountable and focused and take smart risks. You’re an extension of our talent acquisition team – always scouting top talent to join our team.<br><br>The Software Engineer Intern assists the Development team with tasks related to testing including writing test plans, software code, and testing scripts. This individual is actively involved in all phases of the software development life cycle and must communicate proactively and effectively with team members on issues.<br><br><strong><u>What You’ll Be Doing<br><br></u></strong>This position is responsible for translating business and user requirements into system tests; executing manual Functional tests; maintaining system test strategies; executing and programming software tests; and conducting technical discussions with internal development partners to understand their designs and intended output.<br><br>Software Engineer Intern include the following. This position has no management responsibilities. The candidate may be required to perform other related duties as assigned.<br><ul><li> Individual may be given tasks/requirements in all areas of software development and support based upon project and scheduling requirements.</li> <li> Assignments will be defined specifically with the intention of allowing the individual to develop independent software engineering skills in the area of software maintenance and new development.</li> <li> Where possible, assignments will become more complex as the individual demonstrates the ability to accept increasingly complex tasks.</li> <li> Tools Used: PHP, Javascript, JQuery, XCode (iOS) Android OS, C/C++, Cloud/VM, VB Net, C#, Visual Basic, Windows, Oracle, Perl, Linux, PHP.</li> <li> Actively participate in product planning and other requirements gathering</li> <li> Participate in special or customer-specific projects as assigned</li> <li> Research and develop an understanding of the marketing requirements for the product, including how the product is actually used by CBORD customers<br></li></ul><strong><u>Education Preferred<br><br></u></strong><strong> What You’ll Bring to the Table<br></strong><ul><li> Actively enrolled in a Bachelor's Degree program in one of the following disciplines: Software Engineering or Engineering, Computer Science, or a Business Major with a Technical Minor.<br></li></ul><strong><u>Experience Desired<br></u></strong><ul><li> Less than 18 months of experience in development, research, and product testing<br></li></ul>Competencies<br><ul><li> Basic communication skills with the ability to work effectively in a team</li> <li> Ability to work from own initiative, learn and adapt quickly, and be highly productive</li> <li> Ability to create multiple “what-if” scenarios putting yourself in customer’s shoes and apply all the scenarios in the workflow of the application</li> <li> Proven knowledge of the software development life cycle and solid understanding of quality software</li> <li> Basic programing and scripting skills, preferably in an object oriented programming language</li> <li> Ability to apply basic test strategy knowledge and methodologies to design, develop, and execute general software tests</li> <li> Analytical and problem solving skills with the ability to manage and prioritize multiple projects under general supervision</li> <li> Awareness of business issues as they impact overall project plans<br></li></ul>This description is intended to be generic in nature. It is not intended to determine all specific duties and responsibilities of any particular position. Essential functions and overtime eligibility may vary on the specific tasks assigned to the position.",
        "index": 31,
        "skills": [
            "project management",
            "software engineering",
            "javascript",
            "data visualization",
            "c and c++",
            "machine learning",
            "information technology",
            "mobile development"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Intern",
        "company": "Barkback",
        "location": {
            "city": "Santa Barbara",
            "state": "California"
        },
        "posted": "2020-12-16T03:47:05.990Z",
        "url": "https://www.linkedin.com/jobs/view/software-intern-at-barkback-2359094457?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=QqMDQiM4nsaOXDj0bntkXg%3D%3D&position=9&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:05.990Z",
        "description": "<strong><u>Company Description<br><br></u></strong>barkback is a fast growing start-up focused on helping small businesses and their customers. barkback extends the customer experience beyond the storefront. From private feedback to exclusive promotions, we deepen the relationship between a business and its customers, allowing customers to freely express themselves while providing the business with new insights. Together we foster a new level of connection which improves both the business and the customer experience.<br><br><strong><u>Job Description<br><br></u></strong>barkback is seeking a software intern to join our awesome team for the summer and possibly beyond. Amazing opportunity to be a part of a mobile-consumer venture that is changing the way customers interact with businesses. Looking for a killer programmer and/or web developer to help us solve exciting problems. As a software intern, you will work in areas such as developing tools for the barkback teams to get even more done, developing new functionality for the barkback website and apps, and enhancing barkback's backend systems and databases. You'll get to work closely with our web developers and product teams to bring new product features to life as well as make the existing product even more amazing.<br><br>Being extremely intelligent doesn't hurt.<br><br><strong><u>Qualifications<br></u></strong><ul><li>Currently pursuing a BS, MS, or Ph.D in Computer Science or related technical discipline.</li><li>Experience developing web-based applications.</li><li>Proficiency in a modern programming language.</li><li>Experience working with a MVC framework, and more specifically Ruby on Rails, is a plus.</li><li>Experience using AJAX/JSON and creating robust APIs is heavily encouraged, but not required.</li><li>You must be able to work from our amazing office located in downtown Santa Barbara.<br><br></li></ul><strong><u>Additional Information<br><br></u></strong>Web: http://www.barkback.com<br><br>Check out our IOS and Android apps.<br><br>SDL2019-64",
        "index": 32,
        "skills": [
            "information technology",
            "software engineering",
            "mobile development"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "Blend",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-30T03:47:06.468Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-blend-2149558194?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=bT%2BP6UBx1vu%2FHoXgFuhT3w%3D%3D&position=10&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:06.468Z",
        "description": "Blend helps lenders maximize their digital agility. Our digital lending platform is used by Wells Fargo, U.S. Bank, and other leading financial institutions to increase customer acquisition, improve productivity, and accelerate the delivery of any banking product across every channel. We process more than $3.5 billion in mortgages and consumer loans daily, helping millions of consumers get into homes and gain access to the capital they need to lead better lives.<br><br>As an intern, you will work within our core engineering team on one or more projects that contribute both to our product and to your learning goals.<br><br>We’re looking for talented software engineering interns to join our diverse and fast-growing engineering team. As a software engineering intern, you’ll work throughout the stack, from large-scale data processing to web UI. Specifically, you will be responsible for building new features and functionality enabling our company to deliver mission-critical software to major mortgage lenders. If you have a strong understanding of CS fundamentals, and are excited by a fast-paced, collaborative work environment, we want to hear from you!<br><br><strong><u>Who You Are<br></u></strong><ul><ul><li>Excellent coding, problem solving, and debugging skills</li><li>Proven understanding of computer science fundamentals </li><li>Excellent communication skills</li><li>Expected graduation date by June 2022<br><br></li></ul></ul>Blend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable law, including the San Francisco Fair Chance Ordinance.<br><br>Notice at Collection for California Applicants",
        "index": 33,
        "skills": [
            "software engineering",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Engineering Intern",
        "company": "Corsair",
        "location": {
            "city": "Fremont",
            "state": "California"
        },
        "posted": "2020-12-09T03:47:06.821Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-intern-at-corsair-2320784324?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=GUHhzwKJUhA8KtviVSONwg%3D%3D&position=11&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:06.821Z",
        "description": "CORSAIR is looking for an Engineering Intern that will help the Systems Desktop R&amp;D department develop, validate, and launch high performance gaming PCs. This opportunity will be both educational and practical. The ideal candidate will have a strong interest in developing consumer electronic products.<br><br><strong><u>You Will<br></u></strong><ul> <li> Collaborate with R&amp;D product development operations </li> <li> Build system prototypes, test, and gather data </li> <li> Assist with product life cycle management </li> <li> Assist on other duties as assigned </li> <br><br></ul><strong><u>You Are<br></u></strong><ul> <li> Seeking a degree in Engineering, Computer Science, or a technical discipline </li> <li> Excellent analytical and creative problem-solving skills </li> <li> Good communicator, written and verbal </li> <li> Passionate about the gaming and/or PC industry a plus </li> <br><br></ul><strong><u>Who We Are<br><br></u></strong>CORSAIR (NASDAQ: CRSR) is a leading global developer and manufacturer of high-performance gear and technology for gamers, content creators, and PC enthusiasts. From award-winning PC components and peripherals, to premium streaming equipment and smart ambient lighting, CORSAIR delivers a full ecosystem of products that work together to enable everyone, from casual gamers to committed professionals, to perform at their very best.<br><br>CORSAIR also includes subsidiary brands Elgato, which provides premium studio equipment and accessories for content creators, SCUF Gaming, which builds custom-designed controllers for competitive gamers, and ORIGIN PC, a builder of custom gaming and workstation desktop PCs and laptops<br><br>We will have two cohort tracks that you may choose from that span a 12-week period:<br><ul> <li> May 26 th to August 18 th , 2021 </li> <li> June 16 th to September 8 th , 2021 </li> <br><br></ul><strong><u>Internship Requirements<br></u></strong><ul> <li> You are actively enrolled as a full-time student in an accredited institution and have completed at least one year of education. </li> <li> You are pursuing either an Associate’s, Bachelor’s, Master’s, or Doctorate Degree, and returning for at least a final term following the summer internship. </li> <li> You are able to fully commit to one of the two 12-week (40 hours per week) internship cohort tracks. </li> <li> You must be at least 18+ years of age at the start of the internship. </li> <br></ul>We have many intern openings in a variety of departments, check them all out to see which suits your interests and professional development the best at corsair.com/careers.",
        "index": 34,
        "skills": [
            "project management",
            "software engineering",
            "game design",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer, Summer Intern 2021",
        "company": "Pocket Gems",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-30T03:47:07.283Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-intern-2021-at-pocket-gems-2175443997?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=HCI%2FkTh%2Bf%2FkHDwn2hffT8A%3D%3D&position=12&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:07.283Z",
        "description": "Pocket Gems seeks to build the greatest games and most compelling interactive entertainment in the world. That’s the mission our founders began with in an apartment above a pizza shop back in 2009 and it continues to inspire us today. Since then, we’ve grown to over 200 people in San Francisco, and with $155 million in backing from Sequoia Capital and Tencent, we’re constantly breaking new ground in mobile entertainment.<br><br>Our products have been downloaded over 450 million times by players around the world. In recent years, we’ve launched Episode, a mobile storytelling network and platform, and War Dragons, a visually stunning 3D real-time strategy game.<br><br>As our community of players continues to grow, we’re committed to building diverse and inclusive environments across our teams, and in our games.<br><br>As a summer <strong>Software</strong> <strong>Engineer Intern</strong>, you will be a part of a small intern cohort, paired with an experienced software engineering mentor, collaborating cross-functionally with teams including other software engineers, product managers, artists, and designers to define our next generation of mobile games. During our <strong>10</strong><strong>-week program</strong>, our interns are meaningful contributors to our live products, leaving the summer having made a tangible impact on their team while gaining technical and professional skills to set them up for future success!<br><br><strong>Note: To be considered, you must be willing to work remotely out of one of the following states through the duration of the 10 week internship program: California, Washington, Colorado, or Texas<br><br></strong><strong><u>What You’ll Do<br></u></strong><ul> <li>Develop and code innovative features using groundbreaking technologies</li> <li>Enjoy the freedom of writing native applications while exploring the latest cross-platform technologies</li> <li>Participate in all aspects of the project life-cycle, from ideation to specification to release</li> <li>Design and implement scalable, reliable and maintainable technologies for our iOS and Android gaming platforms</li> <li>Work with innovative, great, fun people!</li> <br><br></ul><strong><u>What You Bring To The Engineering Team<br></u></strong><ul> <li>Working toward a BA, BS, or MS in Computer Science or related technical discipline</li> <li>Solid foundation in computer science, with strong competencies in data structures, algorithms, software design and OOP</li> <li>Passion and excitement for solving interesting problems and building great products!</li> <br><br></ul><strong><u>Extra Gems For<br></u></strong><ul> <li>Programming experience in one or more of the following: C/C++, C#, Objective-C, Java, Python, JavaScript, Mobile Software Development (iOS, Android)</li> <br><br></ul><strong><u>Other Internship Perks<br></u></strong><ul> <li>An amazing summer packed with mentorship, networking opportunities, learning &amp; development roundtables, fun intern events (escape room, intern olympics, jackbox), and of course projects with real business impact.</li> <li><strong>Read more about what we’ve been up to </strong><strong>here</strong><strong>! </strong></li> <br><br></ul><strong><u>Please Note<br></u></strong><ul> <li>We are looking for students going to U.S. universities, <strong>graduating in Winter 2021 or Spring 2022</strong></li> <li>Prior mobile/gaming experience is <strong>NOT</strong> required</li> <br><br></ul><strong>Read more about what we’ve been up to! <br></strong><ul> <li>Pocket Gems Blog</li> <br></ul>At Pocket Gems, we're building teams that value originality, inclusivity, and accountability. While we believe we offer competitive perks, such as annual bonuses, unlimited PTO, 401k matching, and a generous benefits package, we hope to engage with talent based on our core values.<br><br><em>Pocket Gems is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status. <br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest an</em><em>d conviction records.</em>",
        "index": 35,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "data visualization",
            "javascript",
            "networks"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Intern",
        "company": "Amplitude",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-09T03:47:07.539Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-amplitude-2356593820?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=Eh6GVWrkrTdk36mEHcrCMw%3D%3D&position=13&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:07.539Z",
        "description": "We are looking for Software Engineering Interns to join our team at Amplitude to work on our Product Engineering, Backend Infrastructure, Machine Learning and DevOps teams. Our engineers are taking on the challenge to scale our systems to the next 10x level while making innovations to our industry leading analytics capabilities and building new features for an evolving product.<br><br><strong><u>As a Software Engineering Intern At Amplitude, You Will<br></u></strong><ul><li> Develop large-scale interactive web applications or improve scale, performance, operability, and availability of our systems</li><li> Design and develop core distributed components and services</li><li> Collaborate cross-functionally to build new product features</li><li> Take product ideas from design to implementation</li><li> Collaborate cross-functionally with product and design teams to iterate on our product</li><li> Participate in design discussions and code reviews to learn best practices from our engineering team<br></li></ul>You'll be a great addition to the team if you:<br><ul><li> Are pursuing a full-time BS or MS in Computer Science or related technical field with an expected graduation date in Winter 2021 or Spring 2022</li><li> Have strong computer science fundamentals e.g. Data Structures, Algorithms, Object-Oriented Design, Operating Systems, Distributed Systems</li><li> Enjoy working on technically challenging problems</li><li> Have excellent attention to detail</li><li> Real passion for solving challenging problems and iterating quickly<br></li></ul>",
        "index": 36,
        "skills": [
            "machine learning",
            "software engineering",
            "devops"
        ],
        "remote": false
    },
    {
        "position": "Research Intern, Computer Vision",
        "company": "Aibee Inc.",
        "location": {
            "city": "Palo Alto",
            "state": "California"
        },
        "posted": "2021-01-06T03:47:08.173Z",
        "url": "https://www.linkedin.com/jobs/view/research-intern-computer-vision-at-aibee-inc-2347335156?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=pjbpTBeVzJG9ihXN4ayKQg%3D%3D&position=14&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:08.173Z",
        "description": "<p>Founded by Dr. Yuanqing LIN in November 2017, AiBee is a leading AI startup providing AI total solutions, and its mission has been to empower and upgrade vertical industries with AI. We are a leading company in the application of AI technologies for retail and have developed full AI solutions for offline retailers that allow closing the loop among data, algorithms and product/service. By deploying the most advanced and innovative AI technologies (computer vision, speech recognition, natural language understanding, big data analytics, robotics, etc.), AiBee has grown into a strategic partner of many of the world’s largest retail chains. </p>  <p>&nbsp; </p>  <p>We are looking for top-notch research interns from all levels (BS, MS and PhD) to join our Silicon Valley labs. We have access to a huge amount of real-world data from large retail chains, enabling researchers like you to develop techniques at scale. </p>  <p>&nbsp; </p>  <p>Interns will have the opportunity to pursue interests across academic, applied research and engineering and will be exposed to problems across various domains in computer vision and machine learning such as: </p>  <p>&nbsp; </p>  <p>• Object Detection, Segmentation, and Classification </p>  <p>• Pose Estimation and Tracking </p>  <p>• Activity Recognition </p>  <p>• Re-identification and Metric Learning </p>  <p>• Holistic Visual Understanding </p>  <p>• (Multi-Camera) Multiple Target Tracking </p>  <p>• SLAM </p>  <p>&nbsp; </p>  <p><strong>In this internship, you will:</strong> </p>  <p>&nbsp; </p>  <p>• Define ambitious, relevant research problems and criteria for evaluating success. </p>  <p>• Based on the project, help analyze and improve efficiency, scalability, and stability of corresponding deployed algorithms </p>  <p>• Build state-of-the-art solutions by designing algorithms and carrying out experiments. </p>  <p>• Have the opportunity to publish at top-tier conferences and/or journals such as CVPR, ECCV, ICCV, NeurIPS, etc… </p>  <p>• Work and collaborate with a world-class group of researchers and engineers led by VP of Vision Technology. </p>  <p>&nbsp; </p>  <p><strong>Preferred Qualifications: </strong></p>  <p>&nbsp; </p>  <p>• PhD, MS or BS students in Computer Science, computer vision, machine learning related field. </p>  <p>• Ability to communicate complex research in a clear, precise, and actionable manner </p>  <p>• Experience working with deep learning frameworks and related tools in computer vision. </p>  <p>• Proficient in C++ or Python, or equivalent languages. </p>  <p>• If PhD student, a track record of publications at top-tier conferences such as CVPR, ECCV, ICCV, ICML or similar is preferred</p>",
        "index": 37,
        "skills": [
            "machine learning",
            "data visualization",
            "robotics",
            "c and c++",
            "project management",
            "python",
            "information technology",
            "software engineering"
        ],
        "start": "2017-11-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Intern Data Science /Analytics",
        "company": "FedEx Services",
        "location": {
            "city": "Memphis",
            "state": "Tennessee"
        },
        "posted": "2020-12-16T03:47:08.450Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-analytics-at-fedex-services-2204986583?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=jdxJKIJdtCpWVTcYtNVTbw%3D%3D&position=15&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:08.450Z",
        "description": "<strong>Company:</strong> FedEx Services<br><strong>Job Title:</strong> Intern Data Science /Analytics<br><strong>Job Requisition Number:</strong> RC286540<br><strong>Category:</strong> Intern<br><strong>Pay Type:</strong> Non-exempt<br><strong>Locations:<br></strong>Memphis, Tennessee 38116<br>United States<br><br>This is a 10-week assignment for students pursuing a college degree. Assignments are directly related to intern's academic degree. Under direct supervision, performs duties as assigned. Student participates in a number of organized events providing visibility into the overall operations of FedEx.<br><br>Full-time internship opportunity available in multiple locations across the US from June 2021 to August 2021.<br><br><strong><u>The Intern May Assist With<br><br></u></strong>Under close supervision, the successful candidate may assist with project management, process mapping, data analysis, workflow documentation, and report automation. The project may relate to developing customer profiles based on data attributes, or analyzing package data attributes to optimize customer satisfaction.<br><ul><li>Conducting data analytics, customer profiles, report development, and/or research.</li><li>Interacting with business partners and/or staff to gather, interpret, and document customer and operational behavior for data analysis. </li><li>Documenting systems functions and business process flows.<br>The ideal candidate will possess the following skills and experience:</li></ul><ul><li>Strong analytical/quantitative, project/program management, organizational, leadership, presentation, and verbal and written communication skills.</li><li>Ability to manage multiple tasks, set priorities and monitor ongoing results.</li><li>Ability to synthesize big data (quantitative and qualitative); Report design/development.</li><li>Knowledge or experience with one or more of the following: data analytics, forecasting/modeling, strategy planning, engineering planning, operations, economics, process mapping, database query creation, web development, and project management.</li><li>Basic knowledge of one or more of the following: the software development process, systems applications and architecture, Query Languages, “R,” MATLAB, Python, C++, objective-C, and SQL.</li><li>Experience with Big Data technologies like Hadoop, Spark, Hive, Kafka, Hbase, etc.</li><li>Use of one or more analytic software tools or languages such as. Scala, R, Python, SAS</li><li>Demonstrated expertise in developing data pipelines with industrial datasets to enable descriptive, applied, and predictive analytics</li><li>Information technology data collection, organization, integration, data cleansing, data quality assessment, and using analytics for data assessment</li><li>Knowledge of PowerPoint, Keynote or Prezi and the Microsoft Office suite.<br><br></li></ul><strong><u>The Following Are Considered a Plus<br></u></strong><ul><li>Enrollment as undergraduate at junior year or above or graduate student in Engineering, Industrial Engineering, Operations Engineering, Software Engineering, Computer Engineering, Computer Science, Information Systems, Process Analysis, Systems Analysis and Design, Decision Science, Data Science, Statistics, Applied Statistics, Quality Improvement Analytics, Informatics, Mathematics, Business, Management, Finance, Accounting, Economics, Industrial Psychology, or other related major.</li></ul><ul><li>Ideally, plans to graduate within 12 months of completing the internship and begin full-time employment.<br><br></li></ul><strong><u>Resume Should Include The Following Information<br></u></strong><ul><li>College address and permanent home address.</li><li>Email address.</li><li>Telephone number.</li><li>The following regarding the degree you are currently pursuing:<br><ul><li>Name of college/university.</li><li>Degree (For example, bachelor’s degree, master’s degree, or doctorate).</li><li>Major and/or minor.</li><li>Overall GPA.</li><li>Major GPA.</li><li>Date of intended graduation (Month and year).</li></ul></li></ul><u>Domicile Location</u><u>:<br></u>Multiple locations across the US.<br>Relocation assistance not available.<br><br>FedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.<br><br>FedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com.",
        "index": 38,
        "skills": [
            "data science",
            "project management",
            "information technology",
            "software engineering",
            "sql",
            "matlab",
            "scala",
            "c and c++",
            "python"
        ],
        "contact": "recruitmentsupport@fedex.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "MotionPoint",
        "location": {
            "city": "Coconut Creek",
            "state": "Florida"
        },
        "posted": "2020-12-23T03:47:08.760Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-motionpoint-2368109993?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=O0AbEKN%2FC4dcCDOOYVBKdg%3D%3D&position=16&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-06T03:47:08.760Z",
        "description": "<p><strong>About this Job<br><br></strong></p><p>MotionPoint is seeking a software engineer intern to work 16 to 24 hours per week for 10 weeks during the spring of 2021 (February 1 - April 9) at our corporate offices in Coconut Creek, Florida. Due to Covid-19, the internship will likely start as remote work and it may convert to onsite work at our corporate office later in the Spring. The intern will report to a development manager. This is an excellent opportunity for individuals interested in Software Engineering careers. Highlights include:<br><br></p><ul><li>Paid internship with competitive wages of $20/hr.</li><li>Professional software development work environment.</li><li>Casual work environment.</li><li>Open-door management policy.</li><li>Potential full-time employment.</li></ul><p> <br><br></p><p>Responsibilities will include hands-on, real-world tasks and projects that will have a direct impact on the ongoing growth of our company:<br><br></p><ul><li>Develop code for application in cloud platform using Java, JavaScript and Python.</li><li>Participate in development sprint planning and prioritization.</li><li>Create and maintain continuous integration and development processes.</li><li>Become involved in managing DevOps tools in creating system integration infrastructure in a cloud platform.</li><li>Participate in daily Software Development team standup meetings.</li></ul><p> <br><br></p><p>Learning Objectives:<br><br></p><ul><li>Learn how to use version control.</li><li>Learn agile methods.</li><li>Use mainstream programming languages in a professional setting (Python, JavaScript, Java, HTML, CSS).</li></ul><p> <br><br></p><p>Qualifications:<br><br></p><ul><li>Current college students or graduates in Computer Science or Computer Engineering with a cumulative GPA of 3.0 or higher.</li><li>Ability to code in functional or Object-Oriented Programming language. (Python/Groovy/Java).</li><li>Knowledge of OOP, Data Structures, Unix and SQL.</li></ul><p><strong>About MotionPoint Corporation<br><br></strong></p><p>MotionPoint’s technology and processes solve the operational complexity and cost of website localization.<br><br></p><p>MotionPoint’s mission is to help brands reach, engage and serve new customers around the world. Our technology and processes solve the operational complexity and cost of website localization. We work with leading brands like AT&amp;T, Urban Outfitters and jetBlue Airways. The real challenge of website translation isn't language--it's technology. MotionPoint's industry-leading approach eliminates the numerous technical challenges, making it effortless for brands to launch and operate translated sites in global markets. We optimize those sites for organic search and user experience, too.<br><br></p>",
        "index": 39,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "javascript",
            "java",
            "devops",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Software Engineer Intern",
        "company": "Sennovate",
        "location": {
            "city": "United States",
            "state": "United States"
        },
        "posted": "2020-11-07T03:48:11.850Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-sennovate-2213535638?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=6LBbaD%2BSbkIta2t2VVe5fw%3D%3D&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "software engineering",
            "sql",
            "javascript",
            "java",
            "networks",
            "machine learning",
            "project management",
            "python"
        ],
        "lastScraped": "2021-01-06T03:48:11.850Z",
        "description": "<p><strong>Position: Software Engineer – Internship. </strong></p><p><strong>About Sennovate</strong></p><p>Sennovate is an Information Security managed Security Service provider (MSSP) that specializes in Identity and Access Management (IAM) and Security Operations Center (SOC) powered by AI. For more information, please visit <strong>www.sennovate.com</strong>&nbsp;</p><p>What We’re Looking For</p><p>&nbsp;</p><p>Sennovate is looking for a self-motivated person who has an interest in systems, applications, network, and database administration who can potentially develop into a cloud Security Administrator or Developer.</p><p><strong><em>Wait!!! Please review our culture below</em></strong></p><p><strong>Sennovate Culture:</strong></p><p>If you can commit to and live with the following principles, then you are the type of person who will be successful and help our company thrive. If you feel this level of engagement is not right for you or that you’re not willing or able to participate with us at this level, we are not a good fit for you. Our expectation is that you will take the steps necessary to do what you say you are going to do and be accountable for your actions. In other words, live “Above the Line.” We understand that not every person is ready for this level of performance, and we appreciate the honesty of those who decide this is not the right place for them. On the other hand, you would make an ideal candidate to join our company if you are willing to commit to the following Above the Line principles:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accountability: See it, own it, solve it, do it.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Become part of the solution, Act now!</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Respect for others and their feelings; show others that you care</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ask the questions: what else can I do? What coaching do you have for me? And What can I do better?</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Constant Seeking, Learning and Sharing with fellow Employees</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Personal ownership and pride</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Reject the average</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Show Gratitude for even small things</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Value time, keep it simple, be effective and efficient</p><p>&nbsp;</p><p>&nbsp;</p><p><strong><em>If you feel that you will fit into our culture, then proceed further</em></strong></p><p>&nbsp;</p><p>&nbsp;</p><p><strong>Preferred Qualification:</strong></p><p>It is not expected to know everything, but good and flexible enough to explore and learn the following areas.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Student of </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Freshers or Student pursuing bachelor’s degree or equivalent experience in Computer Science or related field</p><p>&nbsp;&nbsp;&nbsp;&nbsp;Network Administration with relevant certification</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge with APIs, integrating data from various back-end services and databases.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Course work in information security or Cyber Security</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Possesses a positive attitude and creativity.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent communications skills</p><p>&nbsp;#####</p><p><strong>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Basic Knowledge or Course Work is preferred in any of the following </strong></p><p><strong>Programming</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Java, JavaScript, API, python scripting, Unix scripting, Perl scripting, Ruby, .Net, PHP, REST/JSON Development</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Any development platform&nbsp;with relevant certification</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Source control (Git, Subversion, etc.)</p><p><strong>Systems Administration with relevant certification</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Unix/Linux/Windows Servers Administration</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Linux Shell (Basic understanding)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AWS/AZURE Cloud or any other IaaS or PaaS Cloud and Alarm / Monitoring</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Microsoft AD and LDAP&nbsp;administration</p><p><strong>Database Development and administration with relevant certification</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MVC, SQL / NoSQL, and Relational Databases Development</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Indexing, Query Optimization, DB cleanup, backup</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;General Database Administration</p><p><strong>Knowledge on any of the following Cloud Security Domain is a plus </strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Single Sign-on (SSO)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Privileged Access Management (PAM)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Security Information Event Management (SIEM)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Security Operating Center (SOC)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Threat detection and Cyber hacking</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>Location: <u>Remote in US</u></strong></p><p>&nbsp;</p><p><strong>How to Apply?</strong></p><p>To consider your application, you must <strong><u>send a 2-3 minute video</u></strong><u> </u>about why should you be considered for this position via the LinkedIn application portal. If you have any difficulty in recording video on LinkedIn, please use any other means and send share the link to&nbsp;<strong>gmartin@sennovate.com</strong> with job code in the subject.</p>",
        "index": 40,
        "contact": "gmartin@sennovate.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Intern",
        "company": "Quantum Signal AI, LLC",
        "location": {
            "city": "Saline",
            "state": "Michigan"
        },
        "posted": "2020-12-23T03:48:12.629Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-quantum-signal-ai-llc-2354259156?refId=d52df36b-f23f-4c8c-95cb-8a16259996a9&trackingId=6tC7%2Fye%2FSQQNl1dJSe8xTg%3D%3D&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "software engineering",
            "hardware",
            "networks",
            "python",
            "robotics",
            "c and c++"
        ],
        "lastScraped": "2021-01-06T03:48:12.629Z",
        "description": "<strong>Job Summary:<br><br></strong>We’re looking for an intern who is interested in working as part of our multi-disciplinary team on challenging problems in the area of autonomous vehicles. Day to day, you will work in a dynamic environment helping to build, test, and document software that controls steering, propulsion, braking, and accessories on autonomous vehicle platforms.<br><br><strong>What You'll Do:<br><br></strong>You will be called upon to support multiple aspects of the software lifecycle for vehicle platforms with responsibilities such as:<br><br><ul><li>Work with complex systems that include computing, communications, custom electronics, and embedded software/firmware</li><li>Develop and execute test plans</li><li>Support qualification and field-testing activities</li><li>Setup continuous integration pipelines to verify software builds</li><li>Analyze log files and troubleshoot issues<br></li></ul><strong>What You’ll Need:<br><br></strong><ul><li>College-level coursework in Computer Science, Computer Engineering, Robotics, Electrical Engineering, or a related discipline</li><li>Sufficient self-confidence and motivation to tackle new challenges, but enough humility to seek and value constructive feedback</li><li>Experience in C/C++ and Python</li><li>Familiarity with Linux and command line utilities</li><li>Interest in developing knowledge and skills in:<br><ul><li>Complex software build, testing, and deployment</li><li>Autonomous vehicle control systems</li><li>Lab equipment (digital multimeters, oscilloscopes, function generators, etc.)</li><li>Functional safety<br></li></ul></li></ul><strong>Bonus Points For:<br><br></strong><ul><li>Previous hobby or school experience with:<br><ul><li>Microcontroller hardware and software (Arduino, Raspberry Pi, etc.)</li><li>Hands-on experience with robotics, actuation, and/or vehicles</li><li>Controller Area Network (CAN) communication</li><li>ARM processor development</li><li>Computer networking and administration</li><li>Test engineering<br></li></ul></li></ul>Powered by JazzHR<br><br>JRY4xRbxzy",
        "index": 41,
        "remote": false
    },
    {
        "position": "Machine Learning Engineering Internship - Summer 2021",
        "company": "Vimeo",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-12-16T03:48:13.457Z",
        "url": "https://www.linkedin.com/jobs/view/machine-learning-engineering-internship-summer-2021-at-vimeo-2338410411?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=1CIKtWWRUFX6Wg6HIYXR1g%3D%3D&position=17&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "machine learning",
            "project management",
            "software engineering",
            "java",
            "data visualization",
            "devops",
            "deep learning"
        ],
        "lastScraped": "2021-01-06T03:48:13.457Z",
        "description": "Vimeo empowers video creators to tell exceptional stories and connect with their audiences and communities. Home to more than 60 million members in over 150 countries, Vimeo is the world’s largest ad-free open video platform and provides powerful tools to host, share and sell videos in the highest quality possible.<br><br>The Machine Learning Research team at Vimeo is focused on developing, deploying, and maintaining machine learning models to help support and enhance the capabilities of various teams across Vimeo. Whether it's targeting users for marketing, improving quality-of-experience in playback, or enabling visual classification of all videos at Vimeo, the Machine Learning Research team has a wide selection of projects in its future. By applying open source solutions, or experimenting with creating our own, we're focused on deploying the latest and greatest in ML across the stack.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li>Contribute to building, iterating, evaluating, and shipping machine learning models</li> <li>Develop monitoring and tooling for machine learning systems</li> <li>Help build pipelines and APIs for offline and online inference</li> <li>Gain experience using docker, Kubernetes, and Google Cloud technologies for MLOps and model lifecycle management</li> <li>Work with other teams to understand real problems and develop strategies to improve or entirely solve problems with machine learning</li> <li>Write clean, portable, and well-documented code</li> <br><br></ul><strong><u>What We’re Seeking<br></u></strong><ul> <li>You are currently pursuing a B.S. or M.S./Ph.D in Machine Learning, Computer Science, Software Engineering, or related technical field, with an expected graduation date of 2021 or 2022</li> <li>You have experience working with any of these languages: Python, Go, Java, C++</li> <li>You are familiar with machine learning libraries or frameworks such as sklearn, keras, tensorflow, pytorch, spark-ml, R </li> <li>You have experience in ML engineering, through previous internships, coursework or open-source projects</li> <li>You are passionate about designing software systems and shipping high-quality code</li> <br><br></ul><strong><u>Bonus Points<br></u></strong><ul> <li>You are familiar with DevOps cloud tools (AWS/EC2, or Google Cloud) or MLOps tools (Kubeflow)</li> <br></ul>This is a paid internship.<br><br><strong><em>While we offer competitive compensation, we don't provide accommodation. Please ensure you are interested in an internship in New York City under these circumstances before applying.<br><br></em></strong>Creativity and diversity are at the center of the Vimeo universe. To make sure our culture and products reflect those values, we’re committed to building an actively inclusive environment for human beings of every age, race, religion, sex, gender identity, sexual orientation, mental and physical ability, veteran status, national origin, and ancestry. At Vimeo, diverse backgrounds, refreshing perspectives, and open hearts are all welcome. If you like the sound of that, come work with us.<br><br>Vimeo is the world’s leading all-in-one video software solution. Our platform enables any professional, team, and organization to unlock the power of video to create, collaborate and communicate. We proudly serve our growing community of over 200 million users — from creatives to entrepreneurs to the world’s largest companies.<br><br>Vimeo is headquartered in New York City with offices around the world. At Vimeo, we believe our impact is greatest when our workforce of over 650 passionate, dedicated people, represents our diverse and global community. We’re proud to be an equal opportunity employer where diversity, equity and inclusion is championed in how we build our products, develop our leaders, and strengthen our culture.<br><br>Learn more at www.vimeo.com<br>Learn more at www.vimeo.com/jobs",
        "index": 42,
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Programming Intern",
        "company": "Fried Frank",
        "location": {
            "city": "New York City Metropolitan Area",
            "state": "United States"
        },
        "posted": "2021-01-06T03:48:14.306Z",
        "url": "https://www.linkedin.com/jobs/view/programming-intern-at-fried-frank-2355241667?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=5P8Dz5LDgjpXEXryUDcoFw%3D%3D&position=18&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "sql",
            "data visualization",
            "networks",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2021-01-06T03:48:14.306Z",
        "description": "<p><strong><u>Position Summary</u>:</strong>&nbsp;</p><p>As an intern of the PG (Programming Group), he/she will provide assistance in application development work, specifically custom in-house development.&nbsp;The intern will work closely with primarily the PG team (other programmers, SQL database administrator) and secondarily with the Applications Support team, Networking team, and Operations team.</p><p><br></p><p><strong><u>Duties &amp; Responsibilities</u>:&nbsp;</strong></p><ul><li>Assist the members of the PG in the performance of their duties and responsibilities, specifically in custom in-house development.</li><li>Assist in the implementation of solutions in a timely manner, adhering to deadlines and communicating impediments to meeting them. </li><li>Assist in testing solutions.</li><li>Assist in creating documentation and in updating the team wiki. </li><li>Assist to investigate and learn new tools and systems which might facilitate the efficient creation of necessary programs.</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p><strong>  Education: </strong>College student taking Computer Science or related field.</p><p><strong>  Experience:&nbsp;</strong>Some experience with needs analysis, client/server and web programming is a plus.</p><p><br></p><p><strong>  Job Specific/Technological Skills:</strong></p><ol><li>Experience to program advanced web applications using Visual Basic .NET</li><li>Knowledge of MS SQL</li><li>Basic understanding of Active Directory</li><li>Knowledge of Power BI is a plus</li></ol><p><br></p><p><strong>  Skills and Abilities:</strong></p><ol><li>Must have design and programming skills</li><li>Must have an understanding of client/server programming and relational database design</li><li>Must possess good communication skills, both oral and written</li></ol>",
        "index": 43,
        "remote": false
    },
    {
        "position": "Computer Science: Data Analyst Intern (Summer 2021)",
        "company": "SPX Corporation",
        "location": {
            "city": "East Stroudsburg",
            "state": "Pennsylvania"
        },
        "posted": "2020-12-30T03:48:16.734Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-data-analyst-intern-summer-2021-at-spx-corporation-2247968702?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=4aBkiAQDIaO0UktTdtXMyA%3D%3D&position=19&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "software engineering",
            "sql",
            "data visualization",
            "hardware",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "lastScraped": "2021-01-06T03:48:16.734Z",
        "description": "<strong><u>Job Summary<br><br></u></strong>Assist the Engineering department in successfully achieving manufacturing goals and contribute to continuous improvement efforts. This position offers a variety of opportunities including basic engineering tasks related to design, analysis, test, integration and systems engineering. Opportunities can vary from performing analysis on existing hardware, assisting in the design and development of future hardware, performing analysis for both completed and future equipment, test, systems engineering, quality assurance, system safety, and production operations.<br><br><strong><u>Essential Duties And Responsibilities<br></u></strong><ul> <li> Improve material handling methods. </li> <li> Develop quoting tools that allows the calculation of pricing based on a set of input dimensions as specified by an end user. </li> <li> Perform work station/cell analyses to improve productivity and quality. </li> <li> Provide input for manufacturing fixtures and tooling. </li> <li> Assist with plant layout and work station design. </li> <li> Develop computer programs to help manipulate data for use. </li> <li> Learn and use ERP manufacturing software. </li> <li> Create documentation for new product launches. </li> <li> All other duties or projects as assigned. </li> <br></ul>Interns will typically support one or more experienced engineers in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of engineering.<br><br><strong><u>Basic Qualifications<br></u></strong><ul> <li> Student working towards a Bachelor’s degree in Computer Science, Manufacturing, Industrial, and Mechanical, or other related Engineering field. </li> <li> Candidates must have completed their second year of engineering studies. </li> <li> Cumulative GPA of 3.0 or above. </li> <li> Must be a US Citizen or have legal US working status. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li> Working knowledge or exposure to 3D software (CREO Preferred) </li> <li> Working knowledge or exposure to ERP systems </li> <li> Experience in Visual Studio and .Net </li> <li> Exposure to Lean and 5S concepts. </li> <li> Background in manipulating data </li> <li> Experience in C++ </li> <li> Experience in Visual Basic </li> <li> Experience with Data Analytics </li> <li> Experience in SQL </li> <br></ul>For more than 140 years, Patterson-Kelley has proudly served the commercial heating industry with the most respected heating solutions in the field. Our commercial boilers and hot water heaters are designed and built in the USA and distributed throughout North America. Even more, our products are backed by the highest level of technical and application support. Each piece of equipment we build is the direct result of knowledge cultivated from generations of experience, expertise, and customer input.<br><br>SPX is an equal opportunity employer and makes employment decisions without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, genetic information, disability, protected veteran status, or any other reason prohibited by applicable law.<br><br>Thank you for your interest in our company.",
        "index": 44,
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Robotics Software Engineer Intern - Austin",
        "company": "Maidbot",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2020-12-09T03:48:17.441Z",
        "url": "https://www.linkedin.com/jobs/view/robotics-software-engineer-intern-austin-at-maidbot-2364963586?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=8eeLyJmIZVgGNydxhzDkgA%3D%3D&position=20&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "software engineering",
            "javascript",
            "robotics",
            "hardware",
            "python",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "lastScraped": "2021-01-06T03:48:17.441Z",
        "description": "<strong><u>About Maidbot<br><br></u></strong>Maidbot is leading the way as a pioneer in revolutionizing commercial cleaning by leveraging the power of robotics and innovative automated solutions. This all starts with Rosie: an industrial housekeeping robot for commercial cleaning, which handles the dull, dirty, and dangerous tasks. With rising market demand and Maidbotâ€™s first-mover status, we have partnered with several of the largest hospitality &amp; commercial cleaning companies. Beginning in Austin, weâ€™ve expanded into markets such as Houston, Dallas and Denver. After launching successful deployments with multiple hospitality companies where dozens of our robots work alongside hotel staff, we are developing new features and enhancing our current software, which ranges from a customer-facing web application to state-of-the-art electronics. In our Austin office youâ€™ll find 3D printers, laser cutters, dogs, and an ever-growing army of robots.<br><br><strong><u>About You<br><br></u></strong>You are a software developer with a passion for robotics. You enjoy working in a small team to develop software for our autonomous mobile robots. You are able to write software at multiple levels of abstraction: from low-level drivers and behaviors that interface directly with the sensors and actuators, all the way to task-level decision making and high-level control. Most importantly, you are passionate about playing a key role in the development of a revolutionary robot.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Robotics Software Development - write code for SLAM (Simultaneous localization and mapping), path planning, state machines, robot to cloud interface and vision processing pipelines.</li><li>AI - develop models, collect data, train and deploy to robots. After deployment, track performance and iterate design.</li><li>Hardware Interface - Development for embedded Linux and microcontroller environments.</li><li>Testing - Simulation, in our officeâ€™s testbed, and in the field.</li><li>Source Code Management - documentation, unit testing, code reviews, and continuous integration.<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Proficient programming in C++</li><li>B.S. / M.S. / Ph.D. in Robotics, Computer Science, or related field.</li><li>Training and / or experience in software engineering and related activities (version control, unit, integration, acceptance tests, etc.)</li><li>Experience working and developing in a Linux environment.</li><li>Applicants must be authorized to work in the U.S.<br></li></ul><strong><u>Preferred Experience<br></u></strong><ul><li>Experience programming in python and javascript.</li><li>Experience with robotics, especially mobile robot navigation or vision systems.</li><li>Experience developing for an embedded Linux environment.</li><li>Experience with the Robot Operating System (ROS).</li><li>Exposure to Agile software development practices.<br></li></ul><strong><u>Benefits<br></u></strong><ul><li>Medical, Dental, Vision offered</li><li>Unlimited PTO</li><li>Paid Sick Leave</li><li>Paid Time Off to Vote</li><li>Flexible Work and Telecommute Arrangements</li><li>Dog Friendly<br></li></ul>Please note that only short-listed candidates will be contacted for an interview.<br><br>Maidbot is an Equal Employment Opportunity Employer. Maidbot will consider all qualified applicants for employment without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity, marital status, disability, veteran status or any other characteristic protected by law.<br><br>Powered by JazzHR",
        "index": 45,
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Engineering Internships - Summer 2021",
        "company": "Avalara",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "posted": "2020-12-30T03:48:18.186Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-internships-summer-2021-at-avalara-2155369663?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=jSJtvqfNPKz7e8xFJEqcrg%3D%3D&position=21&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "project management",
            "software engineering",
            "javascript",
            "c and c++",
            "react"
        ],
        "lastScraped": "2021-01-06T03:48:18.186Z",
        "description": "<strong><u>Description<br><br></u></strong>Join us in building a secure platform supporting Avalara’s expanding business. In this role you will have the opportunity to engage with the best and brightest engineers and architects as they build our future application and service capabilities, while ensuring our current generation solutions continue to deliver the trust and reliability our customers expect. If you want to make a big difference in a fast-moving environment without endless meetings, if you want to set your direction instead of having it set for you, if you want to have all of the benefits of startup and an established company, we want to talk to you.<br><br>Avalara is looking for a number of interns for our Summer 2021 program. Beginning in early May through late August to early September, interns will support our Engineering business in 4 functions: Avatax, Security, Registrations, and Returns. Interns will be provided with a detailed, significant 12-week project to support these functions through deep collaboration with their direct manager, an assigned mentor and their broader project team. Interns will have the opportunity to work with a variety of disciplines, including C#, .Net, React, Javascript, and AWS, and will demonstrate their progress in a final presentation shared with the broader Avalara org.<br><br><strong><li>Specific job/project duties and team alignment will be shared as they are finalized and updated on Avalara.com but all interns are to expect the job duties below. <br><br><strong><u>Job Duties<br></u></strong><ul><li>Follow strategic direction from assigned manager and mentor to achieve project deliverables</li><li>Collaborate with assigned team to identify gaps and propose solutions</li><li>Partner with fellow interns to attend and participate in internship program events and activities</li><li>Participate on an agile team – full lifecycle and full stack – including design, development, testing, planning, backlog grooming and support</li><li>Identify and implement best practices for coding as well as development processes<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Experience with any of the following languages: C#, .Net, React, Javascript, AWS</li><li>Desire to join Avalara as a full-time Engineer after completion of the internship</li></ul><ul><li>Willingness to dive in and identify root causes and develop creative solutions<br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Prior internship experience is a plus</li><li>Pursuing a degree in computer science or related field<br></li></ul>Avalara is an Equal Opportunity Employer. All qualified candidates will receive consideration for employment without regard to race, color, creed, religion, age, gender, national orientation, disability, sexual orientation, US Veteran status, or any other factor protected by law.</li></strong>",
        "index": 46,
        "remote": false
    },
    {
        "position": "Data Science Internship (Machine Learning AI)",
        "company": "Reesby",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2020-12-09T03:48:18.966Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-internship-machine-learning-ai-at-reesby-2366455191?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=pW31l%2F2DJbV%2BPAVEERuCJQ%3D%3D&position=22&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "data science",
            "machine learning",
            "sql",
            "artificial intelligence",
            "java",
            "data visualization",
            "scala",
            "c and c++",
            "python",
            "information technology"
        ],
        "lastScraped": "2021-01-06T03:48:18.966Z",
        "description": "<strong><u>About The Data Scientist Internship<br><br></u></strong>Reesby are looking for a junior ML/AI Data Scientist who wants to learn how to analyze large amounts of raw information to find patterns and use them to optimize our performance. You will work with our team to learn to build data products to extract valuable business insights, analyze trends and help us make better decisions.<br><br>We expect you to be highly analytical with a knack for analysis, math and statistics, and a passion for machine-learning and research. Critical thinking and problem-solving skills are also required.<br><br><strong><u>Data Scientist Internships Will Involve<br></u></strong><ul><li>Research and detect valuable data sources and automate collection processes</li><li>Perform preprocessing of structured and unstructured data</li><li>Review large amounts of information to discover trends and patterns</li><li>Create predictive models and machine-learning algorithms</li><li>Modify and combine different models through ensemble modeling</li><li>Organize and present information using data visualization techniques</li><li>Develop and suggest solutions and strategies to business challenges</li><li>Work together with engineering and product development teams<br><br></li></ul><strong><u>Data Scientist<br></u></strong><ul><li>Graduate Role, no experience necessary, remote opportunity available</li><li>Develop Significant knowledge in data mining, machine-learning and operations research</li><li>Gain experience using business intelligence tools (such as Tableau) and data frameworks (such as Hadoop)</li><li>Gain knowledge of R, SQL and Python; familiarity with Scala, Java or C++ is an asset</li><li>Strong math and analytical skills, with business acumen</li><li>Strong communication and presentation skills</li><li>Good problem-solving abilities</li><li>BSc or BA degree in Computer Science, Engineering or other relevant area; graduate degree in Data Science or other quantitative field is preferred<br><br>www.reesby.com.au</li></ul>",
        "index": 47,
        "remote": true
    },
    {
        "position": "2021 Summer Internship - Software Developer, Zebra Prescriptive Analytics",
        "company": "Zebra Technologies",
        "location": {
            "city": "Burlington",
            "state": "Massachusetts"
        },
        "posted": "2021-01-06T03:48:19.663Z",
        "url": "https://www.linkedin.com/jobs/view/2021-summer-internship-software-developer-zebra-prescriptive-analytics-at-zebra-technologies-2185123994?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=%2FKvcSJ5G4Tf367aVTYsWrg%3D%3D&position=23&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "machine learning",
            "software engineering",
            "angular",
            "networks",
            "c and c++",
            "project management",
            "virtual reality",
            "information technology"
        ],
        "lastScraped": "2021-01-06T03:48:19.663Z",
        "description": "<strong><u>Overview<br><br></u></strong>At Zebra, we’re reinventing how businesses operate at the enterprise edge - helping them run faster, smarter, and more connected than ever before.<br><br>A <strong>dynamic community of builders, doers, and problem solvers</strong>, we each play a unique role - shaping new technologies, bringing solutions to market, and partnering with companies on the front line of business. Being a part of Zebra means making your mark as we make digital transformation a reality.<br><br>It means growing into a leader at a leading company that makes a distinct difference - because together, we’ve only just begun.<br><br><strong>Build Today. Create Tomorrow.<br><br></strong>Join a team of builders, doers, and problem solvers.<br><br>Join Zebra.<br><br>The purpose of this internship is to prepare college students for entry into the business world by providing a thorough understanding of the various functions of the Zebra Technologies organization. The program is designed to provide you with a full experience so that you can fully envision a career with Zebra. You will be positioned for success with training, exposure to all parts of the business, social activities, a professional mentor relationship and development sessions to help you discover your own performance edge!<br><br>Zebra Prescriptive Analytics (ZPA) allows customers to apply analytics and machine learning techniques on big data (Point of Sale and Inventory) to find actionable insights that can reduce fraud or waste within an organization. Our pattern library is used to apply repeatable pattern checking that looks for opportunities to improve the bottom line.<br><br><strong><u>Responsibilities<br><br></u></strong>Projects assigned will depend on the candidate's capabilities and interests. Examples of projects may include:<br><ul><li> Microservices architecture. Work through solutions utilizing a combination of services to provide users an overall set of features.<br><ul><li> Include API activity mechanism to track a series of micro-service calls. </li><li> Implement cross service solution </li></ul></li><li> Migrate features from an older version to the newest version build using Angular and Google cloud.<br><ul><li> Create, update, and delete report definitions. </li><li> Implement report execution and generation of task notifications. </li></ul></li><li> Application performance<br><ul><li> Conduct deep research into identifying performance bottlenecks and help identify solutions </li></ul></li><li> Develop planning, organizational and leadership skills </li><li> Increase technology knowledge and skills </li><li> Develop team-based work proficiencies </li><li> Develop interpersonal skills to connect with day-to-day business contacts through follow up activities <br><br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Required Qualifications:<br></strong><ul><li> Current enrollment in an undergraduate degree program in Computer Science, Computer Engineering, or Electrical Engineering </li><li> Must be a rising Junior, rising Senior, or graduating Senior </li><li> Must be authorized to work in the U.S. on a permanent basis without requiring sponsorship </li><li> Must reside within 50 miles of the primary work location <br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> Knowledge of C# </li><li> Proficient in Microsoft Office (including Excel, Word, &amp; PowerPoint) </li><li> Intellectual curiosity with a strong desire to learn and grow </li><li> Proven leadership and excellence in professional, academic, and/or extracurricular experiences </li><li> Ability to collaborate as part of a team </li><li> Effective verbal and written communication skills <br><br></li></ul>Apply Apply<br><br>Share<br><br>Refer Talent Refer Talent<br><br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br><br>Share with Your Network<br><br><strong> Need help finding the right job? <br><br></strong>We can recommend jobs specifically for you! Click here to join our Zebra Talent Pool.<br><br>Zebra is an equal opportunity/affirmative action employer committed to a diverse and inclusive workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, ancestry, marital status, age, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. If you are an individual with a disability and need assistance in applying for a position, please contact us at workplace.accommodations@zebra.com .<br><br>The EEO is the Law poster is available here: https://www.zebra.com/content/dam/zebra/compliance/eeoisthelawposter.pdf . The EEO is the Law poster supplement is available here: https://www.zebra.com/content/dam/zebra/compliance/ginasupplement.pdf .<br><br>Zebra is a federal contractor and is committed to an alcohol and drug free workplace. As a result, all U.S. based employees are subject to the Drug and Alcohol Free Workplace Policy and Procedure.",
        "index": 48,
        "contact": "accommodations@zebra.com",
        "remote": false
    },
    {
        "position": "Intern - Data Engineering",
        "company": "InterDigital, Inc.",
        "location": {
            "city": "Manhattan",
            "state": "New York"
        },
        "posted": "2020-12-16T03:48:20.388Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-engineering-at-interdigital-inc-2347134720?refId=d354978b-6b98-461b-8776-9e85f93f3b1b&trackingId=ghtM%2BwE4DVajc2W7xrrPVA%3D%3D&position=24&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "skills": [
            "machine learning",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "networks",
            "deep learning"
        ],
        "lastScraped": "2021-01-06T03:48:20.388Z",
        "description": "<strong><u>About InterDigital<br><br></u></strong>InterDigital develops fundamental wireless and multimedia technologies that are at the core of mobile devices, networks, and services worldwide. We solve many of the industry's most critical and complex technical challenges, inventing solutions for more efficient broadband networks and a richer multimedia experience years ahead of market deployment. InterDigital has licenses and strategic relationships with many of the world's leading wireless companies. Founded in 1972, InterDigital is listed on NASDAQ and is included in the S&amp;P MidCap 400® index.<br><br><strong><u>Summary<br><br></u></strong>The AIML team at InterDigital is a team of highly motivated, fast-paced, and highly skilled researchers with strong backgrounds in wireless communications, embedded systems, artificial intelligence and machine learning. We are seeking a co-op to help us with data collection for machine learning applications. Co-op will also help with design, setup, and implementation of a data repository in support of our machine learning and artificial intelligence work for wireless communications. The co-op shall perform the following duties and shall have the following qualifications:<br><br><strong><u>Essential Duties And Responsibilities<br></u></strong><ul><li>Assist in the design and implementation of a data repository for wireless system data</li><li>Assessment, selection, and implementation of data formats for various types of wireless data</li><li>Interfacing with internal and external groups to implement the data repository in an external cloud environment</li><li>Implement and test upload and access mechanisms to/from the repository to our ML processing environment</li><li>Documentation, and configuration management<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Must be enrolled in Master’s Degree program in Computer Science or Electrical Engineering</li><li>Proficient in Python, C/C++, Java, SQL and/or other database environments</li><li>Proficiency with Linux environment</li><li>Knowledge of cloud-based storage environments and related tools is preferred</li><li>Knowledge of Machine Learning environments such as PyTorch or TensorFlow is a plus</li><li>Knowledge of GitHub for configuration management is a plus.</li><li>Excellent written and verbal communication skills. Strong team player.<br></li></ul><strong>Location: </strong>New York, NY<br><br><em>InterDigital is committed to a policy of Equal Employment Opportunity and will not engage in or tolerate unlawful discrimination against an applicant or employee on the basis of race, color, religion, creed, national origin, ancestry, citizenship, immigrant status, military status, veteran status, sex, sexual orientation, gender (including gender identity and/or expression), pregnancy, age, physical or mental disability, genetic information, atypical heredity cellular or blood trait, marital status, family status, domestic partner or civil union status or any other legally recognized protected basis under federal, state or local laws, regulations or ordinances. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, compensation, benefits, training, assignments, evaluations, coaching, promotion, discipline, discharge and layoff.<br><br></em>",
        "index": 49,
        "remote": false
    }
]