[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-07T10:00:41.691Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=UXbTMeDEZI%2FEwDbFfpm4YA%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:41.691Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
        "index": 1,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "python",
            "c and c++",
            "machine learning"
        ],
        "contact": "accommodations@linkedin.com",
        "remote": false
    },
    {
        "position": "Software Development Engineer Intern - 2021",
        "company": "Apptio",
        "location": {
            "city": "Bellevue",
            "state": "Washington"
        },
        "posted": "2020-12-17T10:00:42.353Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-engineer-intern-2021-at-apptio-2339549202?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=MOR44fM7ljArq4CUDvQDJA%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:42.353Z",
        "description": "<strong>You</strong>: You’re a student who wants to truly make an impact on an organization with your computer science background. You love to learn hands on and thrive in fast-paced environments that provide the opportunity for ongoing collaboration. <br><br><strong>Us</strong>: We are a high performance, customer-obsessed engineering team with a passion for innovation. We love to solve problems and find ways to advance the technology within our products every single day. Here at Apptio, we love to teach, develop our talent, and find ways to improve as a collective team.<br><br><strong><u>What We Want You To Do<br></u></strong><ul> <li>Participate in a 12-week long internship program beginning in May or June. </li> <li>Help to solve real business problems alongside our products &amp; engineering teams. </li> </ul><ul> <li>Partner with experienced software developers to complete and present a project. </li> <li>Foster professional development through mentorships, training activities, and opportunities to engage with company leadership. </li> <br><br></ul><strong><u>Basic Qualifications<br></u></strong><ul> <li>Pursuing or achieved BS or MS in Computer Science (or related technical discipline). </li> <li>Experience with object-oriented design and coding skills (Java and/or C/C++). </li> </ul><ul> <li>Experience in systems software or algorithms. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Experience with UI design and web-dev technologies. </li> <li>Experience working in a collaborative and fast paced environment. </li> <li>Desire and ability to pick up new technologies quickly and innovate. </li> </ul><ul> <li>Local to WA state candidate preferred.</li></ul>",
        "index": 2,
        "skills": [
            "software engineering",
            "java",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Internship Spring 2021 (Software Engineering / Data Science)",
        "company": "Amobee",
        "location": {
            "city": "Redwood City",
            "state": "California"
        },
        "posted": "2020-12-19T10:00:42.768Z",
        "url": "https://www.linkedin.com/jobs/view/internship-spring-2021-software-engineering-data-science-at-amobee-2321946500?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=WSHnOes6cJ%2BkdOmBPCepCA%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:42.768Z",
        "description": "<strong>This is a part-time Spring internship with the expectation to move to full-time hours in the Summer. <br><br></strong>The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing, and has been named a Leader in Gartner’s Magic Quadrant. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation. Explore all of our notable Amobee Awards . We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee .<br><br><strong><u>Position Summary<br><br></u></strong>Amobee’s ACE (Amobee Career Exploration) Internship Program offers Technical Interns hands-on exposure to different areas of our business, specifically in the fields of Software Development, Data Science, DevOps Engineering, Technical Solutions Engineering, or Data Systems Engineering. We are currently seeking Technical Interns at our Redwood City location. As an ACE Intern you will be paired with an Advocate within the Engineering team who will oversee your professional development and project delivery. The Amobee ACE Internship will provide you with real-world, applied experience with a technology product company, tackling unique challenges that will position you well for your career ahead.<br><br><strong><u>Requirements<br></u></strong><ul><ul><li>Current student pursuing a Bachelor's, Master’s, or PhD degree in Computer Science, Data Science, Mathematics, Engineering or related field.</li><li>Minimum 3.0 GPA</li><li>Ability to work well in teams</li><li>Excellent understanding of Computer Science fundamentals</li><li>Core knowledge of at least one programming language (Java or Python preferred)Passionate about web-based applications</li><li>Excited by working in a fast-paced, collaborative environment<br><br></li></ul></ul><strong><u>Benefits Of Our Program<br></u></strong><ul><ul><li>Ability to observe and work with other team members, including leadership</li><li>Direct mentorship from an assigned Advocate</li><li>Endless opportunities to learn</li><li>Challenging work assignments</li><li>Potential Career opportunities upon graduation</li><li>Formal Training Programs, Social Events, and Community Outreach Programs<br><br></li></ul></ul><strong><u>About Amobee<br><br></u></strong>The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation, see all Amobee Awards. We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee<br><br>In addition to our great environment, we offer a competitive base salary, employee development programs and other comprehensive benefits. Please send a cover letter along with your resume when applying to the position of interest located at Amobee.com . We are an Equal Opportunity Employer. No phone calls and no recruiting agencies, please.<br><br>",
        "index": 3,
        "skills": [
            "data science",
            "information technology",
            "software engineering",
            "java",
            "devops",
            "python",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Vineyard",
            "state": "Utah"
        },
        "posted": "2020-12-07T10:00:43.067Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-lockheed-martin-2350347471?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=wFj6mJlR9eNW7jyVmHlnUg%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:43.067Z",
        "description": "<strong>Description:</strong>Lockheed Martin Procerus Technologies (LMPT) is a leader in the small UAS field with work that encompasses all product life cycle phases from conceptual design to end of life. LMPT is seeking a Junior-level Software Engineering Intern (SW Intern) to join its engineering team. The LMPT engineering team is a multi-disciplinary group with mechanical, electrical, software and systems expertise. The team develops new products and solutions while also supporting current products. As a SW Intern, you will be an integral part of the expanding LMPT engineering team.<br><br>In this position, the SW Intern will develop and apply software engineering skills toward the design of complex tactical unmanned air systems. Software skills will include various coding languages such as C, Python, Bash Script, HTML, CSS, PHP, and JAVA. The SW Intern will develop software for various targets including PC platforms and embedded devices.<br><br>Quality and reliability are critical to our team’s success. Accordingly, the SW Intern will participate in periodic code reviews and testing at both the component and system levels.<br><br>Desired schedule: 30+ hours per week over a 4 month period, Jan through April<br><br><strong><u>Basic Qualifications<br></u></strong><ul><li> Enrolled in an accredited degree program for Software Engineering, Computer Science, or Computer Programming, Junior level.</li><li> Ability to collaborate in a team environment</li><li> Strong written, communication, and presentation skills</li><li> Proficiency in MS Office Products<br></li></ul><strong><u>Desired Skills<br></u></strong><ul><li> Experience with Small Unmanned Aircraft Systems (SUAS)</li><li> Ability to work in a collaborative and highly integrated team environment</li><li> Desire to assume ownership of tasks and drive to closure quickly and efficiently</li><li> Experience with development and execution of test plans</li><li> Experience developing within the following languages: C, Python, Bash Script, HTML, CSS, PHP, and JAVA.</li><li> Experience developing GUIs using development environments such as QT</li><li> Experience working with low-level communications protocols: Serial, I2C, SPI, TCP/IP, UDP<br></li></ul><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern",
        "index": 4,
        "skills": [
            "software engineering",
            "java",
            "python",
            "c and c++",
            "information technology",
            "web development"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer in Test (Intern)",
        "company": "ASML",
        "location": {
            "city": "San Jose",
            "state": "California"
        },
        "posted": "2020-12-16T10:00:43.363Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-in-test-intern-at-asml-2337479279?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=fFnXJt%2BZ2%2BJBukF%2FWlPAtg%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:43.363Z",
        "description": "<strong>Introduction<br></strong>ASML US brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Chandler Arizona, San Jose and San Diego California, Wilton Connecticut, and Hillsboro Oregon.<br><strong>Job Mission<br></strong>We are looking for a highly talented individual to join our software quality assurance team.<br><br><strong><u>Job Description<br><br></u></strong>In this position, you will be participating the project involving test design, test execution and test report and learn the test methodologies and test automation for the ASML world-class products. You will have the opportunity to work with software developers, hardware engineers and the application engineering organization on a regular basis.<br><br><strong>Education<br></strong>Student pursuing advanced degree in Computer Science, Electrical Engineering, Mathematics, Applied Mathematics, Physics, Applied Physics, or any related engineering or equivalent experiences.<br><br><strong><u>Experience<br></u></strong><ul><li>Knowledge of operating system, relational database, concurrent computing,<br></li></ul>client/server architecture, network protocols, and file system management.<br><ul><li>Knowledge of software lifecycle and quality engineering methodology</li><li>Good numerical analysis and logic thinking skills</li><li>Familiar with programming languages Python, C/C++,Java, Perl or shell scripting<br></li></ul><strong><u>Personal Skills<br></u></strong><ul><li>Excellent problem solving and trouble shooting skills</li><li>Ability to excel in cross functional, team environment<br></li></ul><strong>Context of the position<br></strong>This position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings. The physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described.<br><br><strong><u>Other Information<br><br></u></strong>EOE AA M/F/Veteran/Disability<br><br>",
        "index": 5,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "hardware",
            "networks",
            "java"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "SpineZone",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2020-12-07T10:00:43.802Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-spinezone-2338895253?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=%2FIsYuybXXHxzAF6cqnGFrg%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:43.802Z",
        "description": "SpineZone is looking for a Data Science Intern to work with our Product Director on a variety of mission-critical projects related to our online platform and other proprietary technology and systems. We are looking for somebody who can work well independently, and somebody well-versed in the modern data science tools and technology.<br><br>This internship will be remote and temporary with the possibility of turning into a full-time role.<br><br><u><em><strong>What You Will Do:<br><br></strong></em></u><ul><li>Work under the guidance of Product Director to write data pipelines, perform ad hoc analytics, operationalize model pipelines, and communicate results back to team.</li><li>Use techniques from statistical analysis and predictive modeling to help decipher user behavior models.</li><li>Query and analyze data in support of existing apps and other products in commercial use.</li><li>Work with team under agile development methods.</li><li>Organize and interpret raw data into analysis-ready data sets.</li><li>Assist in requirements definition, project scoping, timeline management, and results documentation to ensure professional relationship management.</li><li>Perform high quality research in collaboration with other functional teams into the patterns and properties of meaningful data from the individual to population scale to inform product, digital services and business development.</li><li>Document code in shared repositories and communicates project results to department on completion of program.</li><li>Assist in executing projects that further the improvement and efficiency of the department.<br><br></li></ul><u><em><strong>You Should Have:<br><br></strong></em></u><ul><li>Familiarity working with databases and distributed computing platforms and their query interfaces.</li><li>Familiarity working with computer programming languages, and/or excel, SQL techniques.</li><li>Familiarity with statistical inference, data mining, pattern recognition or machine learning.</li><li>Familiarity with algorithms and the mathematical methods used to extract information from data.</li><li>Familiarity provisioning compute resources with tools and software for exploratory data science discovery work.</li><li>Familiarity with visualization software and techniques.</li><li>Excellent written and verbal communications skills, with a proven ability to translate complex methodologies and analytical results to business insights.<br><br></li></ul><u><em><strong>You Should be:<br><br></strong></em></u><ul><li>A team player with demonstrated track record of collaboration.</li><li>Capable of conducting independent research, motivated by hard technical challenges.</li><li>Results-driven, self-motivated, and a self-starter.<br><br></li></ul><em><strong><u>Bonus Points if you have:<br><br></u></strong></em><ul><li>Experience working with Python or Java.</li><li>Working knowledge of enterprise cloud tools for big data analysis such as Google Cloud, AWS, and Azure</li><li>Familiarity working with column store and NoSQL databases</li><li>Familiarity with queuing systems and ability to work efficiently in a shared compute environment.</li><li>Ability to prepare high quality technical figures for publication in industry and scientific journals.</li><li>Familiarity working cross functionally with teams deployed across the US and internationally.</li><li>Entrepreneurial experience at start-ups and academic labs.<br></li></ul>Powered by JazzHR<br><br>PgQ3y29uTe",
        "index": 6,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "sql",
            "java",
            "data visualization",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Summer Internships",
        "company": "NASA Jet Propulsion Laboratory",
        "location": {
            "city": "Pasadena",
            "state": "California"
        },
        "posted": "2020-11-23T10:00:44.075Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-summer-internships-at-nasa-jet-propulsion-laboratory-2323059824?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=h40FLveG6K2svGb3ckPl9A%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:44.075Z",
        "description": "New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.<br><br>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.<br><br>Our missions are complex, long-lasting, far-reaching, and each one is unique. We’re constantly developing new mission-specific software. For designers, engineers, architects, and developers who like to test the limits, JPL is a constant source of new stimulating challenges.<br><br>JPL is seeking highly motivated college and university students with intellectual curiosity to join our team and aid in our quest to ensure mission success. In this role you would be a vital team member in a JPL software or computer engineering groups. You will partner with lead engineers to design, code, and develop secure software applications and interface solutions that power JPL’s spacecraft, science instruments, mission control systems, science analysis pipelines and IT services.<br><br><strong><u>Exciting Opportunities Include, But Are Not Limited To<br></u></strong><ul><li>Computer Security Engineer</li><li>Computer Systems Engineer</li><li>Configuration Management Engineer</li><li>Cybersecurity Engineer</li><li>Database Administrator</li><li>Data Scientist</li><li>Data Visualization Developer</li><li>Electrical Ground Support Equipment Software Engineer</li><li>Engineering Applications Software Engineer</li><li>Enterprise Applications Software Engineer</li><li>Enterprise Systems Analyst</li><li>Flight Software Engineer</li><li>Network Engineer</li><li>Project Information Management Engineer</li><li>Scientific Application &amp; Data Interaction Engineer</li><li>Scientific Applications Software Engineer</li><li>Systems Administrator</li><li>Software Systems Engineer</li><li>Software Systems Architect</li><li>Software Systems Engineer</li><li>Software Assurance Engineer</li><li>User Interface Designer</li><li>User Interface Developer<br><br></li></ul><strong><u>Majors Include, But Not Limited To<br></u></strong><ul><li>Cloud Computing</li><li>Computer Engineering</li><li>Computer Science</li><li>Cyber Security </li><li>Data Analytics</li><li>Data Science</li><li>Data Visualization </li><li>Information Science</li><li>Information Systems</li><li>Information Technology</li><li>Software Engineering</li><li>Robotics</li></ul><ul><li>Must be currently enrolled in a college or university pursuing a Bachelor’s, Master’s, or PhD in a technical or engineering major related to work assignment</li><li>Must have at least 1 semester or quarter remaining to complete degree</li><li>Must be available to work full-time (40 hours/week) for 8-12 weeks during the Summer (2021)</li><li>Must have a minimum cumulative 3.0 out of a 4.0 GPA or equivalent</li><li>Relevant internship experience</li><li>Recently completed coursework providing an understanding and application of standard principles, theories, concepts and techniques in related work assignment</li><li>General knowledge of applicable industry and/or academic practices and standards in related work assignment</li><li>Demonstrated leadership abilities</li><li>Good verbal and written communications skills with ability to work in a team environment</li></ul>",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "networks",
            "data visualization",
            "robotics"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "2021 Summer Internship - IT and Computer Science",
        "company": "Barrick Gold Corporation",
        "location": {
            "city": "Elko",
            "state": "Nevada"
        },
        "posted": "2020-12-19T10:00:44.490Z",
        "url": "https://www.linkedin.com/jobs/view/2021-summer-internship-it-and-computer-science-at-barrick-gold-corporation-2346057841?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=fj5odiddhUj4RVvA9KqDxA%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:44.490Z",
        "description": "<strong><u>Position Description<br><br></u></strong>At Nevada Gold Mines, our vision is to be the world’s most valued gold mining business by finding, developing and operating the best assets with the best people. At Nevada Gold Mines we are committed to a safe work environment sending every person home safe and healthy every day and leaving a sustainable legacy on our host communities. We will be notifying candidates of our selections starting Jan 2021<br><br><strong><u>Responsibilities<br><br></u></strong>Our interns will have an opportunity to complete challenging and rewarding projects in their field of study, working side by side with our professionals in the field. By applying for an internship opportunity, you may be considered for an internship at any one of our Nevada Gold Mines locations.<br><br><strong><u>Qualifications<br></u></strong><ul> <li>Must be able to complete an internship lasting a minimum of ten (10) weeks between May 1 and September 1, 2021.</li> <li>Must be enrolled in school for the Fall 2021 semester (proof of enrollment required).</li> <li>Must have a cumulative GPA of 3.0 or higher (transcripts required).</li> <li>Must be able to pass Nevada Gold Mines’ pre-employment physical, which includes drug and alcohol testing as well as metals testing (where applicable).</li> <br><br></ul><strong><u>What We Can Offer You<br></u></strong><ul> <li>Ability to make a difference and lasting impact</li> <li>Work in a dynamic, collaborative, progressive, and high-performing team</li> <li>An Opportunity to transform Traditional Mining into the future of Digital Mining</li> <li>Opportunities to grow and learn with the industry colleagues are endless</li> <li>Access to a variety of career opportunities across Nevada Gold Mine locations</li> <li>Nevada Gold Mines is committed to creating a diverse environment and is proud to be an equal opportunity employer</li> <br><br></ul><strong><u>About Nevada Gold Mines<br><br></u></strong>Nevada Gold Mines is a joint venture between Barrick Gold Corporation (61.5%) and Newmont Goldcorp Corporation (38.5%), combining their significant assets across Nevada to create the single largest gold-producing complex in the world and realize the full potential of these mines through synergies and best-in-class operational improvements.<br><br>The massive mining operation comprises 8 mines along with their associated infrastructure and processing facilities that produced an estimated 4 million ounces of gold in 2018. Three of these assets are Tier One gold mines: Barrick’s Cortez; the combination of Barrick’s Goldstrike and Newmont Goldcorp’s Carlin; and the combination of Barrick’s Turquoise Ridge and Newmont Goldcorp’s Twin Creeks. In addition, Barrick’s Goldrush-Fourmile project has the potential to become the fourth Tier One asset in this portfolio. The new JV is expected to generate around $5 billion in cost savings over the next five years. Nevada Gold Mines is operated by Barrick.<br><br><em>Thank you for your application, however, only those selected for an interview will be contacted.</em>",
        "index": 8,
        "skills": [
            "machine learning",
            "project management"
        ],
        "start": "2021-01-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Programmer - Intern",
        "company": "Cognizant",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-12-19T10:00:44.776Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-intern-at-cognizant-2323009493?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=%2FbeRu6Nu%2FKS2kvfKnXxMAw%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:44.776Z",
        "description": "Cognizant Softvision seeks an intern with experience in software design, coding and debugging. The intern will gain exciting real-world software engineering experience at a thriving company.<br><br>We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Document and test new software applications</li><li> Assess new application ideas</li><li> Develop applications (coding, programming)</li><li> Test and release applications<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Computer Science/Network Engineering, Engineering, or Mathematics major</li><li> Excellent analytical and mathematics skills</li><li> Ability to work in teams</li><li> Experience programming in Javascript, HTML, CSS, React.js<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Practical experience with a wide variety of software engineering tasks</li><li> Collaborating hand-in-hand with skilled teams of software engineers</li><li> Shadowing, mentoring, and training opportunities with seasoned professionals</li><li> Opportunity to participate in networking events and company meetings</li><li> Flexible schedule for students</li><li> Compensation available<br></li></ul>Employee Status : Full Time Employee<br><br>Shift : Day Job<br><br>Job Posting : Dec 09 2020<br><br><strong><u>About Cognizant<br><br></u></strong>Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.<br><br>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.<br><br>Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br><br>If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "index": 9,
        "skills": [
            "information technology",
            "software engineering",
            "networks",
            "javascript",
            "machine learning",
            "web development",
            "react"
        ],
        "contact": "CareersNA2@cognizant.com",
        "remote": false
    },
    {
        "position": "Intern, SW Engineering",
        "company": "Mercedes-Benz Research & Development North America, Inc.",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2020-12-17T10:00:45.097Z",
        "url": "https://www.linkedin.com/jobs/view/intern-sw-engineering-at-mercedes-benz-research-development-north-america-inc-2320477829?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=LLFgdHPG8bGH7kI0%2B5OExw%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:45.097Z",
        "description": "Embedded in a worldwide network Mercedes-Benz Research &amp; Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.<br><br>During your internship you will be supporting engineering projects for voice applications in Daimler ecosystems and vehicles. You will be responsible for prototype software and contribute to feature and functional specifications.<br><br><strong><u>Key Tasks &amp; Responsibilities<br></u></strong><ul><ul><li>Software Development and testing of progressive and regressive features for the Digital Voice Assistants (Amazon Alexa, Google Assistant Mercedes me integration)</li><li>Conceptualize, develop and write software architectures and implementations for IoT technologies</li><li>Document technical software solutions or specifications</li><li>Coordinate and participate testing, validation, debugging of software and system architecture</li><li>Collaborate with other engineers, designers and user experience experts to find solutions software implementation and integration tasks</li><li>Develop new software prototypes and mass production frameworks</li><li>Integrate and test software in prototyping cars or demonstration hardware</li><li>Actively demonstrate cross-functional collaboration with other engineers, designers, user experience experts and researchers<br><br></li></ul></ul><strong>Minimum level of education required and required field of study:<br></strong><ul><ul><li>Enrolled in a Bachelor’s degree in Software/Computer Engineering or Engineering and Natural Science with additional Computer Science knowledge (or equivalent)<br><br></li></ul></ul><strong><u>Minimum Skills Required<br></u></strong><ul><ul><li>Strong understanding of operating systems and computer architecture fundamentals. Java or JavaScript / NodeJS, RESTful API, MySQL, NoSQL. </li><li>Experience in iOS or Android apps development. </li><li>Experience integrating 3rd party API/SDK in iOS/Android Apps. </li><li>Ability to analyze complex problems, recognizes and explains connections between cause-and-effect understandably and develops concrete, viable solutions taking risks and obstacles into account. </li><li>Ability to work in inter-cultural, inter-disciplinary teams across multiple time zones. </li><li>Able to learn quickly and willing to share knowledge. </li><li>Attention to detail, Strong Team player. </li><li>Open to international travel, for approximately 10% of the time.</li><li>Will accept equivalent work experience in lieu of formal education: No</li><li>Minimum years of experience required (Non-exempt positions only): 0 years</li><li>Combination of Degree and Years of experience acceptable (minimum) : Associates</li><li>Other licenses or certifications required : Valid US Driver License<br><br></li></ul></ul><strong><u>Preferred Qualifications<br></u></strong><ul><ul><li>Good Knowledge about Digital Voice Assistants (Google Assistant, Amazon Alexa, Apple Siri and others)</li><li>Understanding of design patterns and software architecture</li><li>Multiple apps published in Apple and Google app stores</li><li>Java, C/C++, JavaScript, Python, Swift, Objective-C</li><li>Experience with location based services</li><li>Knowledge in Backend and embedded car system technologies<br><br></li></ul></ul><strong>Why should you apply?<br><br></strong>Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.<br><br>MBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.<br><br>MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.<br><br><em>Thank you for your interest in Mercedes-Benz Research &amp; Development North America. Please be aware the impact of COVID-19 could increase the amount of time it takes our HR and Hiring Team to process your application. We apologize for any inconvenience this may cause. We are dedicated to the health and safety of our employees and candidates. We appreciate your patience during this time.<br><br></em>Mercedes-Benz Research and Development North America, Inc.<br><br><strong>PRIVACY AGREEMENT FOR JOB APPLICANTS (Lever)<br><br></strong><u>Information on the processing and use of your data in the context of <br><br></u><u>submitting an application for employment.<br><br></u>This Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.<br><br>The Daimler Company and its affiliates that have advertised the vacancy <u>is responsible</u> for data processing. You will find the details in the job advertisement.<br><br>The <u>categories of data</u> that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for <u>special categories of personal data</u> (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.<br><br>We process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the <u>purpose</u> of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).<br><br>The <u>recipients</u> of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software.<br><br><strong><u>As An Applicant, You Have The Right<br><br></u></strong>To request information from the company your personal data it has stored.<br><br>To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.<br><br>To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.<br><br>To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.<br><br>To complain to the company if you believe that the processing of your personal data violates the law.<br><br><strong><u>Therefore, We Regularly Delete Your Personal Data As Follows<br><br></u></strong>The company limits the <u>storage</u> of your data to the period of time required by applicable law.<br><br>The application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months [MB1] .<br><br>You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.<br><br>Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.<br><br>The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.<br><br>A cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.<br><br>A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.<br><br>We collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.<br><br>We do not respond to browser \"do not track\" signals at this time.<br><br>If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship.<br><br><u><strong>PRIVACY NOTICE FOR CALIFORNIA RESIDENTS<br><br></strong></u><strong><u>Category Of Personal Information<br><br></u></strong>When you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:<br><br>identifiers<br><br><strong><u>Source(s)<br><br></u></strong>Directly from you<br><br><strong><u>Purpose(s)<br><br></u></strong>Determining eligibility for employment<br><br>Contacting you about future job opportunities<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Personal information categories listed in the California Customer Records statute (Cal. Civ. Code <li>1798.80(e))<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Geolocation data<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Professional or employment-related information<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong>Access</strong> : You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to <strong>‘Privacy Agreement for Job Applicants (Lever)’</strong> in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions.<br><br><u><strong>Changes to our Privacy Agreement<br><br></strong></u>Our business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.<br><br>This Privacy Agreement is effective on January 1, 2020.</li>",
        "index": 10,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "hardware",
            "networks",
            "javascript",
            "java"
        ],
        "contact": "mbrdna@daimler.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Computer Science/Computer Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "Ohio"
        },
        "posted": "2020-11-30T10:00:45.373Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-computer-engineering-intern-at-applied-optimization-2351182822?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=W7zb7tWcnVi1GLgNzgNtfw%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:45.373Z",
        "description": "<strong><u>Applied Optimization (AO) Job Description<br><br></u></strong>Job Title: Computer Science/Computer Engineering Intern<br>Reports to: Principal Scientist<br>FLSA Status: Part-Time (Non-Exempt)<br><br><strong><u>Position Objective<br><br></u></strong>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms in the areas of mechanical engineering or space science<br><br><strong><u>Essential Functions<br><br></u></strong>Aid in designing, building, testing, and implementing software applications for space science applications<br>Provide technical support for object modeling and algorithm development for new generation science applications<br>Perform verification, documentation, and quality assurance for new and existing software<br>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work<br>Other related duties as assigned<br><br><strong><u>Required Qualifications<br><br></u></strong>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record<br>General understanding of software development and knowledge of various coding languages<br>Attention to detail and effective time and schedule management skills<br>Effective organizing, planning, debugging, and problem-solving skills<br>Ability to adapt within a small team to support evolving customer requirements<br>Ability to execute instructions and communication in written, oral, and diagram form<br>Demonstrated strong writing, fact-gathering, and analytical skills<br>Basic computer and software skills including, but not necessarily limited to, Microsoft Office products (e.g., Outlook, Word, Excel, and Power Point)<br><br><strong><u>Preferred Qualifications<br><br></u></strong>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher<br>Minor or dual degree in mathematics, engineering, or physics/astronomy<br>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages<br>Knowledge or experience in CSS, Django, D3-data visualization, and Linux<br>Knowledge of computer operating systems<br>Ability to occasionally work 2nd shift<br><br><strong><u>Citizenship/Security Clearance Requirements<br><br></u></strong>U.S. Citizen or Green Card Holder<br>May be required to obtain and maintain U.S. Government Security Clearance<br><br><strong><u>About Our Internships<br><br></u></strong>Hours: The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the student’s class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.<br>About Us: Applied Optimization is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.<br><br><strong><u>Please Contact<br><br></u></strong>This job description is subject to change.<br><br>hr@appliedo.com",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "java",
            "data visualization",
            "matlab",
            "c and c++",
            "python",
            "web development"
        ],
        "compensation": "paid",
        "contact": "hr@appliedo.com",
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "PTC",
        "location": {
            "city": "Portland",
            "state": "Maine"
        },
        "posted": "2020-11-30T10:00:45.789Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-ptc-2331685036?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=OUc5kqahVF4CSlPafKL6ZA%3D%3D&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:45.789Z",
        "description": "Software Engineering Intern<br><br><strong><u>Your Impact<br><br></u></strong>The Summer Internship Program offers students exposure to the real world of Software Engineering as well as allowing our full-time staff to take on stretch assignments and grow their leadership skills. The interns will work on projects that solve real-world problems and are designed to be completed within the summer timeframe. These projects will provide direct benefit to our production product, improve the supportability and/or remove unknowns for future development. The interns always bring a positive energy to our office that many get to share. They learn a lot have a great time doing it. PTC Portland has several engineers that were hired out of our intern program going back many, many years.<br><br><strong><u>Your Team<br><br></u></strong>We place our interns on a SCRUM team, either with other interns or an existing team depending on how many we have. They are responsible for design, implementation, validation, and documentation of a real-world software project related to PTC's Industrial IoT offering and present along with their scrum team every two weeks. The interns report to the Director of Software Development and are supported by full-time staff to ensure they have the resources they need to be successful.<br><br>Day to Day Responsibilities<br><ul><li>Collaborate with other interns and/or members of our professional engineering staff.</li><li>Design, code, test and document their team’s feature </li><li>Participate in all team scrum ceremonies: stand-up, backlog refinement, sprint demos and sprint retrospectives</li></ul>Basic Qualifications<br><ul><li>Studying Computer Engineering, Electrical Engineering, Computer Science, or a related field </li><li>Passionate about working with others and solving problems </li><li> Experience with Object-Oriented or the C-family of programming languages a plus.<br><br></li></ul><strong><u>PTC Company Description<br><br></u></strong>PTC enables global manufacturers to realize double-digit impact with software solutions that enable them to accelerate product and service innovation, improve operational efficiency, and increase workforce productivity. In combination with an extensive partner network, PTC provides customers flexibility in how its technology can be deployed to drive digital transformation – on premises, in the cloud, or via its pure SaaS platform. At PTC, we don’t just imagine a better world, we enable it.<br><strong>Region<br></strong>The Americas<br><strong>Subregion<br></strong>North America<br><strong>PTC Org<br></strong>R&amp;D - Research and Development<br><strong>Job Type<br></strong>Academic Coop / Intern",
        "index": 12,
        "skills": [
            "software engineering",
            "networks",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Software Development Intern",
        "company": "Synopsys Inc",
        "location": {
            "city": "Pasadena",
            "state": "California"
        },
        "posted": "2020-12-15T10:00:46.087Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-intern-at-synopsys-inc-2332274483?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=6F2%2BqTh7FDHrBFQqb0fymQ%3D%3D&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:46.087Z",
        "description": "<strong>Title: Software Developer Intern<br></strong>Position: Synopsys has an opening for a Software Developer Intern within the Optical Solutions Group (OSG) working in our Pasadena California office. We are looking for a motivated individual with passion for programming and software development who wants to contribute to a world leading software for optical design and analysis. The position requires good software development skills with working knowledge of C++.<strong>Job Responsibilities:</strong><li> Work with the stakeholders to turn technical requirements into actionable tasks<br><ul><li> Develop C++ code to implement required software features</li><li> Make sure the new code is covered by adequate automated tests in the internal testing environment</li><li> Demonstrate the developed capabilities to our marketing team for feedback</li><li> Work with developers, testers and customer representatives in an agile environment to create illumination software solutions to tackle cutting edge problems<strong>Job Requirements</strong></li><li> Current academic pursuit of a degree in Computer Science or similar technical field</li><li> Accomplishments in the field of Computer Science and/or Software Engineering</li><li> Hands-on experience creating C++ software, specifically Microsoft Visual C++ for Windows</li><li> Strong communication skills for working in team as well as the ability to read scholarly journals<br></li><strong><u>Optional But Desired Qualifications<br></u></strong><ul><li> Experience with mathematics, physics and optics</li><li> Experience in development of commercial software</li><li> Experience with simulation or CAD software</li><li> Keen sense of balancing the best solution versus time constraints</li><li> Experience with Software testing<br></li></ul><strong>Why come to work for the OSG R&amp;D Group?<br></strong><ul><li> Gain the real world experience in commercial software development</li><li> Work on an Agile self-directed team supported by management who provides broad but clear goals</li><li> Provide software solutions to world leading companies that design most of the consumer electronics products we use every day</li><li> Experience a team responsibility process that focuses on win-win solutions as the norm and not the exception</li><li> Work with some of the brightest engineers in both the Software and Optics fields who support each other in a multi-disciplined environment</li><li> Leverage the best of the world’s leading Electronic Design Automation software company with the world’s leading Computer Aided Optical Design software company to solve problems that have never been solved before<br></li></ul><strong><u>Company<br><br></u></strong>Synopsys OSG has been the leader in making high-quality optical software for 40 years. We are a team of internally motivated individuals dedicating ourselves to produce the best optical imaging, illumination, and photonics solutions for our customer’s applications. Our software is used to design optical systems in the automotive, display, technical lighting, medical, and aerospace.</ul></li>",
        "index": 13,
        "skills": [
            "software engineering",
            "data visualization",
            "c and c++",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Intern Bachelors Software Engineer",
        "company": "Honeywell",
        "location": {
            "city": "Atlanta",
            "state": "Georgia"
        },
        "posted": "2020-12-19T10:00:46.400Z",
        "url": "https://www.linkedin.com/jobs/view/intern-bachelors-software-engineer-at-honeywell-2330594230?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=hMY0Az7%2BRtQ7Zi1tqeb0gQ%3D%3D&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:46.400Z",
        "description": "Design solutions to drive safe living and quality of life<br><br>The future is what you make it.<br><br>When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all our employees enjoy access to dynamic career opportunities across different fields and industries.<br><br>Are you ready to help us make the future?<br><br>Join a team that designs, develops and integrates highly complex software applications within Honeywell. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.<br><br>Use your skill set to provide value added software features to our products for our customers.<br>Accelerate innovation and growth, teaming with the world's most talented engineers.<br><br>We invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for!<br><br><strong>YOU MUST HAVE<br><br></strong><li> Currently pursuing a Bachelor’s or Master’s degree from an accredited college or university in Software Engineering or Computer Science</li><li> Must graduate after December 2021</li><li> Must continue enrollment in degree program upon completion of the internship<br><br></li><strong>WE VALUE<br><br></strong><li> Understanding various software development lifecycle</li><li> Demonstrate the ability to develop efficient and high-quality software</li><li> Knowledge of software configuration management and change management practices</li><li> Diverse and global teaming and collaboration</li><li> Excellent oral and written communication skills</li><li> Effective communicator</li><li> Can quickly analyze, incorporate and apply new information and concepts</li><li> Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness</li><li> Validated academic excellence (3.0 GPA and higher)<br><br></li>Additional Information<br><br><ul><li><strong>JOB ID: </strong>req241710</li><li><strong>Category: </strong>Engineering</li><li><strong>Location: </strong>715 Peachtree Street, N.E.,Atlanta,Georgia,30308,United States</li><li>Nonexempt<br></li></ul>Engineering (GLOBAL)<br><br>Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
        "index": 14,
        "skills": [
            "software engineering",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Analytics Intern",
        "company": "Altair",
        "location": {
            "city": "Troy",
            "state": "Michigan"
        },
        "posted": "2020-11-23T10:00:46.693Z",
        "url": "https://www.linkedin.com/jobs/view/software-analytics-intern-at-altair-2329347497?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=OD9EzLni2IeO3jdiZ7g1VA%3D%3D&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:46.693Z",
        "description": "<strong>Transforming the Future with the Convergence of Simulation and Data <br><br></strong><strong><u>Software Analytics Intern<br><br></u></strong>Do you like a challenge, are you a complex thinker who likes to solve problems? If so, then you might be the new Altairian we are searching for. At Altair, your curiosity matters. We pride ourselves on a business culture that enables open, creative thinking, and we deeply value our employees and their contributions towards our clients' success, as well as our own.<br><br><strong><u>Job Summary<br><br></u></strong>At Altair’s Enterprise Solutions Group, we work with our clients to increase organizational efficiency by combining industry leading software solutions with tailored services to provide system integration, process automation, specialized analytics applications and data management solutions. We democratize our solutions through scripted automated workflows, capturing best practices and thus increasing the productivity of our customers.<br>The Software Analytics Intern will work with our global and cross functional teams to analyze best coding practices to improve the user experience during workflow customization cross applications and research how to read and analyze scripts of multiple programming languages to get their inputs and outputs without running them. You will identify candidate features and build the ML model which can be used to score tasks in various engineering applications, such as Altair Pulse, Hyperworks, SimLab, Compose.<br><br><strong><u>What You Will Do<br></u></strong><ul> <li> Explore and develop concepts to analyze scripts without execution based on research. </li> <li> Collaborate with software, customization and engineering teams to verify requirements and best practices </li> <li> Develop an initial list of feature candidates and ML module </li> <li> Present concept and progress to a larger audience for reviews. </li> <li> Strong emphasis on end user research. </li> <br><br></ul><strong><u>Basics<br><br></u></strong><strong> What You Will Need: <br></strong><ul> <li> Attention to details </li> <li> Passionate to solve problems </li> <li> Strong desire to improve user experience with Engineering applications </li> <li> Progress towards a Bachelor’s degree in Computer Science, Analytics or related field. </li> <li> Ability to research by yourself </li> <li> Experience with a scripted programming language like Python, Tcl, OML, Lua, etc. </li> <li> Strong verbal and written communication skills </li> <li> Appreciation to work within a team </li> <li> Strong problem-solving skills. </li> <li> Ability to work in a cross functional and multidisciplinary team. </li> <br><br></ul><strong><u>How You Will Be Successful<br></u></strong><ul> <li> <strong> Envision the Future </strong> </li> <li> <strong> Communicate Honestly and Broadly </strong> </li> <li> <strong> Seek Technology and Business “Firsts” </strong> </li> <li> <strong> Embrace Diversity and Take Risks </strong> </li> <br><br></ul><strong><u>What We Offer<br></u></strong><ul> <li> Competitive salary </li> <li> Training &amp; Development - free training on Altair products </li> <br><br></ul><strong><u>Why Work With Us<br><br></u></strong>Altair is a global technology company that provides software and cloud solutions in the areas of data analytics, product development, and high-performance computing (HPC). Altair enables organizations in nearly every industry to compete more effectively in a connected world, while creating a more sustainable future. With more than 3,000 engineers, scientists and creative thinkers in 25 countries, we help solve our customer’s toughest challenges and deliver unparalleled service, helping the innovators innovate, drive better decisions, and turn today’s problems into tomorrow’s opportunities.<br><br><strong> Our vision is to transform customer decision making with data analytics, simulation, and high-performance computing. <br><br></strong>For more than 30 years, we have been helping our customers integrate electronics and controls with mechanical design to expand product value, develop AI, simulation and data-driven digital twins to drive better decisions, and deliver advanced HPC and cloud solutions to support unlimited idea exploration. To learn more, please visit altair.com .<br><br><strong> Ready to go? #ONLYFORWARD <br><br></strong>At our core we are explorers; adventurers; pioneers. We are the brains behind some of the world’s most revolutionary innovations and are not only comfortable in new and uncharted waters, we dive in headfirst. We are the original trailblazers that make the impossible possible; discovering new solutions to our customer’s toughest challenges.<br><br>Altair is an equal opportunity employer. Our backgrounds are diverse, and every member of our global team is critical to our success. Altair's history demonstrates a belief that empowering each individual authentic voice reinforces a culture that thrives because of the uniqueness among our team.",
        "index": 15,
        "skills": [
            "software engineering",
            "python",
            "machine learning",
            "project management",
            "information technology",
            "artificial intelligence"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "UL",
        "location": {
            "city": "Laramie County",
            "state": "Wyoming"
        },
        "posted": "2020-12-14T10:00:46.982Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-ul-2345172667?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=I4b2fC1%2F%2B4%2BLC7adVP4Lmw%3D%3D&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:46.982Z",
        "description": "Thousands of us around the world wake up every day with a common purpose to make the world a safer, more secure and sustainable place. Science is in our DNA; we are endlessly curious and passionate about seeking and speaking the truth. We take delight in knowing that our work makes a meaningful contribution to society, and we are proud that our culture is centered on integrity, collaboration, inclusion and excellence. UL stands at the forefront of technological advancement, and we are continually challenged to find new ways to foster innovation and positive change. Satisfying? Yes. Exciting? Absolutely!<br><br>As our global footprint continues to grow, we are looking for a Data Science Intern to join our team in Laramie, WY.<br><br><ul><li>Processing, cleansing, and verifying the integrity of data used for analysis</li><li>Doing ad-hoc analysis and presenting results in a clear manner</li><li>Analyze large, complex datasets to extract insights and decide on the appropriate technique</li><li>Selecting features, building and optimizing classifiers using machine learning techniques</li><li>Data mining using state-of-the-art methods</li><li>Use data modelling and evaluation strategy to find patterns and predict unseen instances</li></ul><ul><li>Bachelor’s/Master’s degree or equivalent work experience in Data Analytics, Data Science, Computer Science or any other related field of science</li><li>Strong problem solving skills with an emphasis on product development.</li><li>Experience querying databases and using statistical and computer languages R, Python, SQL, etc.</li><li>Experience using statistical computer languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data sets.</li><li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li><li>A drive to learn and master new technologies and techniques.</li><li>Strong Python coding skills and problem-solving, good analytical &amp; communication skills</li></ul><ul><li><strong>Mission </strong>For UL, corporate and social responsibility isn’t new. Making the world a safer, more secure and sustainable place has been our business model for the last 125 years and is deeply engrained in everything we do. </li><li><strong>People </strong>Ask any UL employee what they love most about working here, and you’ll almost always hear, “the people.” Going beyond what is possible is the standard at UL. We’re able to deliver the best because we employ the best. </li></ul><ul><li><strong>Interesting work </strong>Every day is different for us here as we eagerly anticipate the next innovation that our customers create. We’re inspired to take on the challenge that will transform how people live, work and play. And as a global company, in many roles, you will get international experience working with colleagues around the world. </li><li><strong>Grow &amp; Achieve</strong> We learn, work and grow together with targeted development, reward and recognition programs as well as our very own UL University that offers extensive training programs for employees at all stages, including a technical training track for applicable roles. </li><li><strong>Total Rewards</strong> Total Rewards All employees at UL are eligible for bonus compensation. UL offers a generous 401k matching structure of up to 5% of eligible pay. Additionally, we invest an additional 4% into your retirement saving fund after your first year of continuous employment. We provide Healthcare Reimbursement Accounts and Health Savings Accounts that UL contributes to twice per year! Depending on your role, you can work with your manager on flexible working arrangements. We also provide employees with paid time off including vacation, holiday, sick and volunteer time off. <br><br></li></ul>Working at UL is an exciting journey that twists and turns daily. We thrive in the twists and revel in the turns. This is our every day. This is our normal.<br><br>Curious? To learn more about us and the work we do, visit UL.com.",
        "index": 16,
        "skills": [
            "data science",
            "machine learning",
            "sql",
            "networks",
            "python",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "UL",
        "location": {
            "city": "Laramie County",
            "state": "Wyoming"
        },
        "posted": "2020-12-15T10:00:57.540Z",
        "url": "https://www.linkedin.com/jobs/view/intern-research-assistant-hcii-school-of-computer-science-at-carnegie-mellon-university-2351308330?refId=f683c4ca-ec4f-4b4c-ad74-580754afcd24&trackingId=rnvLgzvSCMGgb7UpSK3sag%3D%3D&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-21T10:00:57.540Z",
        "description": "Thousands of us around the world wake up every day with a common purpose to make the world a safer, more secure and sustainable place. Science is in our DNA; we are endlessly curious and passionate about seeking and speaking the truth. We take delight in knowing that our work makes a meaningful contribution to society, and we are proud that our culture is centered on integrity, collaboration, inclusion and excellence. UL stands at the forefront of technological advancement, and we are continually challenged to find new ways to foster innovation and positive change. Satisfying? Yes. Exciting? Absolutely!<br><br>As our global footprint continues to grow, we are looking for a Data Science Intern to join our team in Laramie, WY.<br><br><ul><li>Processing, cleansing, and verifying the integrity of data used for analysis</li><li>Doing ad-hoc analysis and presenting results in a clear manner</li><li>Analyze large, complex datasets to extract insights and decide on the appropriate technique</li><li>Selecting features, building and optimizing classifiers using machine learning techniques</li><li>Data mining using state-of-the-art methods</li><li>Use data modelling and evaluation strategy to find patterns and predict unseen instances</li></ul><ul><li>Bachelor’s/Master’s degree or equivalent work experience in Data Analytics, Data Science, Computer Science or any other related field of science</li><li>Strong problem solving skills with an emphasis on product development.</li><li>Experience querying databases and using statistical and computer languages R, Python, SQL, etc.</li><li>Experience using statistical computer languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data sets.</li><li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li><li>A drive to learn and master new technologies and techniques.</li><li>Strong Python coding skills and problem-solving, good analytical &amp; communication skills</li></ul><ul><li><strong>Mission </strong>For UL, corporate and social responsibility isn’t new. Making the world a safer, more secure and sustainable place has been our business model for the last 125 years and is deeply engrained in everything we do. </li><li><strong>People </strong>Ask any UL employee what they love most about working here, and you’ll almost always hear, “the people.” Going beyond what is possible is the standard at UL. We’re able to deliver the best because we employ the best. </li></ul><ul><li><strong>Interesting work </strong>Every day is different for us here as we eagerly anticipate the next innovation that our customers create. We’re inspired to take on the challenge that will transform how people live, work and play. And as a global company, in many roles, you will get international experience working with colleagues around the world. </li><li><strong>Grow &amp; Achieve</strong> We learn, work and grow together with targeted development, reward and recognition programs as well as our very own UL University that offers extensive training programs for employees at all stages, including a technical training track for applicable roles. </li><li><strong>Total Rewards</strong> Total Rewards All employees at UL are eligible for bonus compensation. UL offers a generous 401k matching structure of up to 5% of eligible pay. Additionally, we invest an additional 4% into your retirement saving fund after your first year of continuous employment. We provide Healthcare Reimbursement Accounts and Health Savings Accounts that UL contributes to twice per year! Depending on your role, you can work with your manager on flexible working arrangements. We also provide employees with paid time off including vacation, holiday, sick and volunteer time off. <br><br></li></ul>Working at UL is an exciting journey that twists and turns daily. We thrive in the twists and revel in the turns. This is our every day. This is our normal.<br><br>Curious? To learn more about us and the work we do, visit UL.com.",
        "index": 17,
        "skills": [
            "data science",
            "machine learning",
            "sql",
            "networks",
            "python",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]