[
    {
        "position": "Software QA Intern",
        "company": "Smarttwigs -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-25T09:51:45.605Z",
        "url": "https://www.simplyhired.com/job/hGDbJCDbvjUvOiWgMHkSQakJpRfwK8nv6Lp78djjs390byixl8YmDA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:45.605Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Smarttwigs is a software consultancy firm focusing on accelerating enterprise and start up tech teams by combining platform, tools, and methodology to help the companies build software and run their most strategic applications. Our team works with companies and developers to give software development and IT operations a strategic advantage.</p><p><b>Job Description</b></p><p>Our ideal candidate will be driven by and passionate about building a flawless product. QA is the last line of defense before a product goes to market, and is an essential step in the development process. Are you capable of building software quality solutions where the problem is not well defined? Are you an analytical thinker capable of working on several assignments at once? If yes, you might be exactly who we're looking for!</p><p><b>Requirements</b></p><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Software Engineering, Computer Engineering, Electrical Engineering or Computer Science.</li><li>Familiarity in a major programming language such as C/C++ or Java/ Javascript</li><li>Strong scripting skills in at least one common language (Python, Perl, Ruby, Bash, etc.).</li><li>Git and Github experience</li><li>Knowledge of software QA methodologies, tools, and processes.</li><li>Experience with Web Application automation testing (using Selenium or any test automation tool) writing test scripts</li><li>Strong attention to detail</li><li>Experience with Linux a plus</li></ul><p><b>Your Day-to-Day</b></p><ul><li>Work cross-functionally with key parties from product and development teams to evaluate key system problems, and understand potential bottlenecks in our software delivery lifecycle (SDLC).</li><li>Attend Daily Scrum meetings to identify what QA is needed to deliver quality product and users experiences in a timely manner.</li><li>Document results of tests for the software development team</li><li>Design new automated tests and procedures while simultaneously expanding existing test suites</li></ul><p><b>What we can offer</b></p><ul><li>On-the-job training and continual support will be provided, allowing the candidate to become familiar with the many products, platforms and processes we are developing.</li><li>The Technical Managers will work with the candidate to establish goals and create a detailed project plan with meaningful work to accomplish those goals.</li><li>The candidate will receive a comprehensive orientation on our company structure and how the QA Automation Intern role fits into the development process and overall business.</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Salary: $0.00 per hour</p><p>Benefits:</p><ul><li>Professional development assistance</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li><li>On call</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Quality assurance: 1 year (Preferred)</li><li>Agile: 1 year (Preferred)</li><li>Jira: 1 year (Preferred)</li><li>Software testing: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Company's website:</p><ul><li>www.smarttwigs.com</li></ul><p>Company's Facebook page:</p><ul><li>https://www.facebook.com/smarttwigs</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Virtual meetings</li></ul></div><div></div>",
        "index": 1,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "javascript",
            "java",
            "c and c++",
            "virtual reality",
            "python"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Computer Programmer Intern",
        "company": "ERS- Environmental Record Search -",
        "location": {
            "city": "Laguna Hills",
            "state": "California"
        },
        "posted": "2021-01-20T09:51:45.708Z",
        "url": "https://www.simplyhired.com/job/yTfGXtylEXQQEQj6eXuoPewouecEULKqzmBdtwL7mHFq9nebXs1L9w?q=computer+science",
        "lastScraped": "2021-01-25T09:51:45.708Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>This Part-Time position, Programmer Intern (female or male) will assist ERS in updating and trouble shooting and fixing our in-house software and systems. Some of the programing language skills used are as follows:</p><p>1. VB.net</p><p>2. Data Compiling using MS Access/SQL Macros.</p><p>3. ArcGis or ArcMap</p><p>4. C++</p><p>5. SQL Server</p><p>6. Ability to setup virtual servers using VMware on rack servers would be great.</p><p>9. Ability to setup and manage e-mail accounts and VPN accounts.</p><p>Experience with SQL databases or any other database platform is a plus.</p><p><b>Must be Student currently going to school in computer science or A.A. degree in some sort of computer science related major is a minimum requirement.</b></p><p>Wage increases will occur on a regular basis based upon demonstrated and proven ability by employee to become proficient in the work over a period of time once fully trained.</p><p>Office hours are flexible and as needed or required and are commonly M-F 9am-6pm. This is why this job is perfect for a students. ERS is an equal opportunity employer, EOE, female/male. An applicant must possess the following in order to be considered: Excellent MS Office, Excel, Word, skills. Great work ethic, learning attitude and care for excellence in what you and others do! We hire people that care about their work, Female/Male applicants, EOE. If you want to join a growing and progressive environmental database company, send your resume with a letter of why you are perfect for this job to Erick@ reccheck.com. DO NOT CALL! Prior to applying, check out our web site at www.reccheck.com.</p><p>Job Type: Part-time</p><p>Salary: $15.00 to $18.00 /hour</p><p>Job Types: Part-time, Internship</p><p>Pay: $14.00 - $18.00 per hour</p><p>Benefits:</p><ul><li>Paid time off</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Associate (Preferred)</li></ul><p>Experience:</p><ul><li>Microsoft SQL Server: 1 year (Preferred)</li><li>Microsoft Access: 1 year (Preferred)</li><li>VB.net programming: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>Multiple locations</li><li>Fully Remote</li></ul><p>Hours per week:</p><ul><li>10-19</li><li>20-29</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>No: Not providing sponsorship for this job</li></ul><p>This Job Is Ideal for Someone Who Is:</p><ul><li>Dependable -- more reliable than spontaneous</li><li>Adaptable/flexible -- enjoys doing work that requires frequent shifts in direction</li><li>Detail-oriented -- would rather focus on the details of work than the bigger picture</li><li>Autonomous/Independent -- enjoys working with little direction</li><li>Innovative -- prefers working in unconventional ways or on tasks that require creativity</li></ul><p>This Job Is:</p><ul><li>A job for which military experienced candidates are encouraged to apply</li><li>A good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or more</li><li>A good job for someone just entering the workforce or returning to the workforce with limited experience and education</li><li>A job for which people with disabilities are encouraged to apply</li></ul><p>Company's website:</p><ul><li>www.reccheck.com</li></ul><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Personal protective equipment provided or required</li><li>Social distancing guidelines in place</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>",
        "index": 2,
        "skills": [
            "sql",
            "c and c++",
            "machine learning",
            "project management",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Summer 2021 Paid Internships",
        "company": "Minority Access, Inc. -",
        "location": {
            "city": "Washington",
            "state": "District Of Columbia"
        },
        "posted": "2021-01-19T09:51:46.011Z",
        "url": "https://www.simplyhired.com/job/Qn_3rpzGwxnnXzyP6XKf8XQoXX-89_wouh2-O7PQk96JcrSJfnZTyQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:46.011Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Minority Access is seeking to employ interns during the summer of 2021 and place hired interns in federal government sites located in Washington DC; New York City; Boston, MA; Charlotte, NC; Cincinnati, OH; Columbus, OH; Dallas-Fort Worth, TX; Providence, RI and San Francisco, CA. To apply you <b><i>MUST </i></b>be: a U.S. Citizen, Pursuing a degree from an accredited college or university, Have a <b>minimum 3.0 GPA,</b> Reside in or have housing in the geographical area of the internship site, <b>Available to work</b> <b>10 weeks</b> beginning June 7, 2021 until August 13, 2021 (40 hours per week Monday thru Friday) Due to COVID-19, teleworking may be available. All placements are <b><i>PAID </i></b>summer internships.</p><ul><li>Washington DC intern placements (12 needed) are for Supervision Support, HQ Staff Support, Bank Examiners, Law Offices, Risk Analyst &amp; Executive Assistant interns. Applicants <b>must </b>be majoring in one of the following fields: Accounting, Business, Computer Science, Communications, Data Science, Economics, Finance, Graduate School Law Student (JD), Human Resource, Mathematics, MIS, Pre-Law, Public Policy, Statistics, or Web/Electronic Publishing. Applicants must have a college classification of Junior, Senior or Grad School.</li><li>New York City intern placements (8 needed) are for Bank Examiners, Risk &amp; Operations Analyst, and IT Customer Support. Applicants <b>must </b>be majoring in one of the following fields: Accounting, Banking, Business, Computer Science, Economics, Finance, or Law. Applicants must have a college classification of Junior, Senior or Grad School.</li><li>Boston, MA &amp; Providence, RI intern placements (2 needed) are for Bank Examiners. Applicants <b>must </b>be majoring in one of the following fields: Accounting, Banking, Business, Economics, or Finance. Applicants must have a college classification of Junior or Senior.</li><li>Charlotte, NC intern placements (3 needed) Retail and Commercial Credit Review Analyst. Applicants <b>must </b>be majoring in one of the following fields: Accounting, Banking, Business, Economics, or Finance. Applicants must have a college classification of rising Junior or rising Senior.</li><li>Cincinnati, OH intern placement (1 needed) for Examiner's Office to assist with asset management, commercial real estate. Applicants <b>must </b>be majoring in one of the following fields: Banking, Business, Economics, or Finance. Applicants must have a college classification of Junior or Senior.</li><li>Columbus, OH intern placement (1 needed) for an Examiner/Analyst to perform report analysis and editing plus assist with bank examinations. Applicants <b>must </b>be majoring in one of the following fields: Banking, Business, Economics, or Finance. Applicants must have a college classification of Junior or Senior.</li><li>Dallas, TX &amp; Irving, TX intern placements (2 needed) for Risk &amp; Operations and Comptrollers Office to conduct analysis of systemic risk and financial performance in district banks, and review/monitor financial portfolio condition of banks. Applicants <b>must </b>be majoring in one of the following fields: Accounting or Finance. Applicants must have a college classification of Sophomore, Junior or Senior.</li><li>San Francisco, CA intern placement (1 needed) for Bank Examiner to assist with compliance strategy, audits and presentations. Applicants <b>must </b>be majoring in one of the following fields: Accounting, Banking, Business, Economics or Finance. Applicants must have a college classification of Junior or Senior.</li></ul><p><b><i>All applicants must submit a current resume and your latest college/university (official or unofficial) transcript. Without a current resume and transcript, your application will not be reviewed.</i></b></p><p>For more specific internship job duties, contact Mason Monroe at 301-779-7100 ext. 215</p><p>Job Types: Full-time, Internship</p><p>Pay: $15.00 - $17.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>COVID-19 considerations:<br>If required to work on premise, all interns will be required to wear a face mask and follow CDC COVID-19 precautions.</p><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>Company's website:</p><ul><li>www.minorityaccess.org</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Temperature screenings</li><li>Social distancing guidelines in place</li><li>Virtual meetings</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>",
        "index": 3,
        "skills": [
            "information technology",
            "project management",
            "virtual reality"
        ],
        "compensation": "paid",
        "due": "2021-06-07T10:00:00.000Z",
        "contact": "301-779-7100",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Error",
        "company": "RTX - 4.8",
        "location": {
            "city": "Palmer",
            "state": "Texas"
        },
        "posted": "2021-01-22T09:51:46.369Z",
        "url": "https://www.simplyhired.com/job/OKrD9E4mtjxf42gGWHpNqB-UDoEYxmGZWNgJNM8wk8ZyD1TnCW_XBA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:46.369Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">***Great opportunity for current college students entering their Junior or Senior year by Fall 2021 or college graduate students (entering or currently enrolled) in a graduate program by Fall 2021. If you are not a current college or graduate student, please visit our website for other opportunities!***\n<br><br>\nThe Systems Engineering Center is seeking a skilled Secure Systems/Cybersecurity Engineering intern to join the Secure Systems Department. This position is in a technical growth area and we need team members who can apply their education, technical knowledge and experience to systems security/Cybersecurity engineering and program protection concerns within the key areas of Cybersecurity, Anti Tamper, software assurance, supply chain exploitation, and threat and design vulnerability analysis. The engineer will participate in the development of embedded systems security solutions, and will be responsible for developing and executing efforts for secure systems products.\n<br><br>\n<b>Key responsibilities for the qualified candidate include:</b><br>\nThe engineering intern must be able to work as a member of a team in coordination with engineers in development, integration, test and modeling. The engineering intern will exhibit a high degree of creativity and ingenuity, and will be responsible for supporting systems integrity, Cybersecurity, and information assurance. The engineering intern must be able to effectively communicate with both internal and external customers.\n<br><br>\n<b>These activities include:</b><br>\nParticipating in technical peer reviews throughout the design life cycle.\n<br>Interface with their team lead, team members, and other teams (SW and HW) on a daily basis\n<br>Candidate should be a team player and effectively work with team members and provide cost effective solutions for customer needs.\n<br><b>Related day-to-day duties include:</b> participating in peer reviews throughout the product life cycle of design, development, integration and test. This team member will interface with their team lead, team members, and other teams on a daily basis, conduct or participate in customer and/or program technical review presentations, and provide task progress status updates and work products to the team lead.\n<br><br>\n<b>For Multi-Level Intern Requisitions:</b><br>\nThis position can be a Salary Grade of G04, G05 or NUG based on the candidate's qualifications as they relate to the skills, experience and responsibility requirements for the position.\n<br>G04 (College Junior by Fall 2021) - must have completed 60 hours of college\n<br>G05 (College Senior by Fall 2021) - must have completed 90 hours of college\n<br>NUG (Post- Graduate-Masters-PhD by Fall 2021) - must have an undergraduate degree and currently enrolled or about to enroll in a graduate degree program\n<br><br>\n<b>Security Clearance &amp; Other Requirements:</b> Must be able to obtain a secret security clearance, not being able to secure the Secret Security Clearance needed for this position may result in an offer of employment being rescinded.\n<br><br>\n<b>Requirements:</b><br>\nMust be a college Junior, Senior or Graduate student by Fall 2021\n<br>Understanding of embedded Cybersecurity Solutions, Security Authorization requirements, vulnerability assessments, or threat mitigation\n<br>Systems, Cyber, Electrical, Software engineering or Computer Science course work\n<br>Familiar with designing, testing Cybersecurity-oriented solutions\n<br>Familiar with secure/Cybersecurity systems technologies, methodologies, policies and guidelines\n<br><br>\n<b>Desired Requirements:</b><br>\nMinimum 3.0 cumulative GPA (Please upload an unofficial transcript when applying)\n<br>Active secret clearance\n<br>Excellent written and verbal communication skills\n<br>IASE or IAT level I or greater cybersecurity certification per DoD 8570.01; such as: SSCP, CAP, GCIA, Security+, CySA+, etc.\n<br>Knowledge of operating systems security features and settings (e.g. Windows, UNIX and Linux)\n<br>Engineering projects or previous internship experience\n<br><br>\n<b>Required Education:</b><br>\nCurrently pursuing a BS degree from a four-year university and entering as a college Junior or Senior OR pursuing a MS / PhD by Fall 2021. Must be working towards a degree in Electrical Engineering, Computer Engineering, Systems Engineering, Computer Science, or related field. Must be appropriate grade level listed above.\n<br><br>\nThis position requires either a U.S. Person or a Non-U.S. Person who is eligible to obtain any required Export Authorization.174300\n<br><br>\nRaytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.</div><div></div>",
        "index": 4,
        "skills": [
            "information technology",
            "software engineering",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "QA Intern",
        "company": "Beautycounter - 4.3",
        "location": {
            "city": "Santa Monica",
            "state": "California"
        },
        "posted": "2021-01-25T09:51:46.666Z",
        "url": "https://www.simplyhired.com/job/-MrrvdwozfRyfhkfA2HTb9PHqcFG5Guv0fSJcTF15mSNEyNp5OGqfw?q=computer+science",
        "lastScraped": "2021-01-25T09:51:46.666Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">One by one, we are leading a movement to a future where all beauty is clean beauty. We are powered by people, and our collective mission is to get safer products into the hands of everyone. Formulate, advocate &amp; educate- that's our motto for creating products that truly perform while holding ourselves to unparalleled standards of safety.\n<br><br>\n<b>Why? It's really this simple:</b> Beauty should be good for you.\n<br><br>\nThe Quality Assurance Intern will be responsible for executing black box testing on a number of web-based and mobile app projects under the guidance of senior QA team members. They will be trained in the company’s Quality Assurance process and be given opportunities to contribute to the creation of test cases and scripts.The ideal candidate will have a background in computer science, meticulous attention to detail, strong analytical skills, and strong written and verbal communication skills. Please note this internship will be 100% virtual and remote applicants are encouraged to apply.\n<br><br>\n<b>In this role you will:</b><br>\nExecute black box tests on all web-based and desktop application-based products\n<br>Execute and help develop automated test cases\n<br><br>\n<b>Requirements:</b><br>\nMust be currently enrolled at an accredited university pursuing a degree in Computer Science\n<br>Prior quality assurance experience or software development experience is a plus\n<br><br>\nAt Beautycounter we are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div><div></div>",
        "index": 5,
        "skills": [
            "project management",
            "virtual reality",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Frontend Engineering Intern",
        "company": "Beautycounter - 4.3",
        "location": {
            "city": "Santa Monica",
            "state": "California"
        },
        "posted": "2021-01-25T09:51:46.905Z",
        "url": "https://www.simplyhired.com/job/Uy33DCWNxMgBdeSEvGx4O-p9prjnD2HyU924gp2b7IF3uVvkR4HSow?q=computer+science",
        "lastScraped": "2021-01-25T09:51:46.905Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">One by one, we are leading a movement to a future where all beauty is clean beauty. We are powered by people, and our collective mission is to get safer products into the hands of everyone. Formulate, advocate &amp; educate- that's our motto for creating products that truly perform while holding ourselves to unparalleled standards of safety.\n<br><br>\n<b>Why? It's really this simple:</b> Beauty should be good for you.\n<br><br>\nAs an intern, you will also gain a holistic view of the organization, department, and interacting with different cross functional teams at Beautycounter. You will be working with seasoned industry pros who guide and mentor you through your internship. Please note this internship will be 100% virtual and remote applicants are encouraged to apply.\n<br><br>\n<b>In this role you will:</b><br>\nUse standard engineering tools to accomplish work such as an IDE, debugging tools, Git, and graphics editors like Sketch\n<br>Read a blueprint or requirements for a feature or task and be able to interpret that for the web on multiple devices\n<br>Engage in Intrateam communication to illuminate motivations and issues\n<br>Converse about applied technology to others\n<br>Pivot given new instructions due to priority or technology changes\n<br>Be curious about technology and explore technological solutions\n<br><br>\n<b>Requirements:</b><br>\nMust be currently enrolled to an accredited university pursuing a degree in Computer Science\n<br>Solid knowledge of modern JavaScript and React best practices\n<br>A good foundation for CSS, Sass, and design systems\n<br>A good understanding of browser intricacies and how they interact with front-end technology\n<br><br>\n<b>What would be helpful:</b><br>\nA basic understanding of server-side-rendered applications\n<br>Basic Node.js experience\n<br>Familiarity with basic web performance and maintenance for the front-end such as unit testing, end-to-end testing, core web vitals, monitoring, logging, and accessibility.\n<br><br>\nAt Beautycounter we are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div><div></div>",
        "index": 6,
        "skills": [
            "javascript",
            "software engineering",
            "virtual reality",
            "information technology",
            "react",
            "web development"
        ],
        "remote": true
    },
    {
        "position": "iOS Engineering Intern",
        "company": "Beautycounter - 4.3",
        "location": {
            "city": "Santa Monica",
            "state": "California"
        },
        "posted": "2021-01-25T09:51:47.157Z",
        "url": "https://www.simplyhired.com/job/5QRfzLcTR7KmvpcK7cza5BeVFRg611_oae6GP07S7QbZJCLw9Vubsw?q=computer+science",
        "lastScraped": "2021-01-25T09:51:47.157Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">One by one, we are leading a movement to a future where all beauty is clean beauty. We are powered by people, and our collective mission is to get safer products into the hands of everyone. Formulate, advocate &amp; educate- that's our motto for creating products that truly perform while holding ourselves to unparalleled standards of safety.\n<br><br>\n<b>Why? It's really this simple:</b> Beauty should be good for you.\n<br><br>\nYou want to push some production code and features that user will actually use? We have a bunch of fun projects that will be stress free, learning focused and fun. Maybe improve our iOS 14 widget, maybe add features to our livestream video player or maybe add some flair to the app by building some custom view transitions between view controllers. We will have a bunch of fun projects that you can choose from.\n<br><br>\nOur mobile app is how our most loyal users interact with the brand and we love to make their life a joy when they open the app. Our goal is to go above and beyond all expectations of the user and deliver a fantastic experience that truly enriches their life. Please note this internship will be 100% virtual and remote applicants are encouraged to apply.\n<br><br>\n<b>In this role you will:</b><br>\nBuild a few user-facing features on our iOS app\n<br>Work with our product managers, designers and other tech teams to bring those features to life\n<br>Communicate and collaborate with teams cross-functionally to solve interesting problems\n<br><br>\n<b>Requirements:</b><br>\nMust be currently enrolled at an accredited university pursuing a degree in Computer Science\n<br><br>\n<b>We are looking for someone who:</b><br>\nKnows the basic about iOS development and is looking for a real opportunity to push production code\n<br>Understands the basics of git\n<br>Excited about learning\n<br>Is respectful and courteous to everyone they work with\n<br>Loves to bring new ideas to the table\n<br>Has open mind about hearing other people’s ideas\n<br><br>\n<b>What we use:</b><br>\nSwift. UIKit. XCTest\n<br>Swift Package Manager &amp; Cocoapods\n<br><b>Local Storage:</b> Realm\n<br><br>\nAt Beautycounter we are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div><div></div>",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "machine learning",
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Data Engineering Intern",
        "company": "Beautycounter - 4.3",
        "location": {
            "city": "Santa Monica",
            "state": "California"
        },
        "posted": "2021-01-25T09:51:47.424Z",
        "url": "https://www.simplyhired.com/job/5l-Okpi8GYDKXgV7nVhZyH1qnFnigdoi2n5UcLDr6ZVfe_31_8zHxg?q=computer+science",
        "lastScraped": "2021-01-25T09:51:47.424Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">One by one, we are leading a movement to a future where all beauty is clean beauty. We are powered by people, and our collective mission is to get safer products into the hands of everyone. Formulate, advocate &amp; educate- that's our motto for creating products that truly perform while holding ourselves to unparalleled standards of safety.\n<br><br>\n<b>Why? It's really this simple:</b> Beauty should be good for you.\n<br><br>\nAs an intern, you will also gain a holistic view of the organization, department, and interacting with different cross functional teams at Beautycounter. You will be working with seasoned industry pros who guide and mentor you through your internship. Please note this internship will be 100% virtual and remote applicants are encouraged to apply.\n<br><br>\n<b>In this role you will:</b><br>\nSupport the Data Engineering and BI Team with day-to-day operational and project-based work\n<br>Work hand-in-hand with analysts from around the company to help solve their data needs\n<br>Assist with migrating Data from Legacy Systems to our new Data Warehouse\n<br>Work with our Data Lake in Big Query\n<br>Assist with building ETLs to bring data from external sources to our Warehouse\n<br>Assist with building Data Models using Kimball Methodology\n<br>Assist with building Data Validation tool/processes as a part of Data Governance Strategy\n<br>Assist with CI/CD pipelines\n<br>Write System Requirement documentation (SRD) and work with Project Manager to create Business Requirement Documents (BRD)\n<br>Utilize Reporting tools (Looker) to generate comprehensive dashboards and reports for departments\n<br><br>\n<b>Requirements:</b><br>\nA very strong command of SQL\n<br>Some knowledge of Java Script, Python and C#\n<br>Basic to Intermediate Experience with Cloud Platform such as AWS, Azure, or GCP\n<br>Ability to work independently and in teams\n<br>Understanding of ETL/ELT\n<br>Strong interpersonal skills including written communication and verbal communication skills\n<br>Must be currently enrolled to an accredited university pursuing a degree in Computer Science\n<br><br>\nAt Beautycounter we are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div><div></div>",
        "index": 8,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "java",
            "c and c++",
            "python",
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Research Scientist/postdoctoral fellow/programmer",
        "company": "University of Hawaiʻi at Mānoa - 4.4",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-01-25T09:51:47.671Z",
        "url": "https://www.simplyhired.com/job/KK8ir21AvQ5SnAawXhpHpnckg97bjKPc3Dgp558JukIJh2axJbaVaQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:47.671Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Duties and Responsibilities</b></p><p>The University of Hawaii Cancer Center has positions for PhD or master level Data Scientist in the Cancer Epidemiology Division to work on high-dimensional epidemiological/statistical problems in Omics (Genomics, Transcriptomics, Methylomics, Proteomics, Metabolomics etc), Statistical Genetics, and Genetic Epidemiology, working closely with Dr. Lang Wu. The Research Scientist or Postdoctoral Fellow or programmer will conduct applied projects under the guidance of the principal investigator. The role of the Scientist involves extensive collaboration and requires the ability to function independently to support and contribute to investigator-led projects. The primary projects are conducted within the large national and international consortia such as The Prostate Cancer Association Group to Investigate Cancer Associated Alterations in the Genome (PRACTICAL) consortium, The Pancreatic Cancer Cohort Consortium (PanScan), The Pancreatic Cancer Case-Control Consortium (PanC4), and the Population Architecture using Genomics and Epidemiology (PAGE) Consortium. As part of these projects we will utilize RNA-Seq, DNA methylation, metabolomics and proteomics data as well as genome-wide genotyping array data for a large number of participants (dozens of thousands to hundreds of thousands). We are very interested in identifying diseases associations and predicting disease risk including in racially and ethnically diverse populations. We also conduct studies using large scale epidemiological study resources (such as Multi-Ethnic Cohort Study which involves over 200,000 subjects and many other large scale studies involving multi-ethnic populations) for identifying molecular markers for diseases.</p><p><b>Position Qualifications</b></p><p>The successful candidate has a PhD in Statistics, Biostatistics, Bioinformatics. Computer Science, Genetic Epidemiology, Genetics, Epidemiology or related fields.</p><p>The successful candidate will be experienced in managing and analyzing large-scale high-dimensional genetic and other -omics data with existing software tools and methods and modifying methods if needed. Experience with multiple types of omics data such as methylation, RNA-seq, protein, or metabolite data is a plus.</p><p><b>Contact</b></p><p>If you are interested in the opportunity, please contact Dr. Lang Wu (https://www.uhcancercenter.org/wu-lang)</p><p>Job Types: Full-time, Part-time, Contract, Temporary, Internship</p><p>Pay: From $4,300.00 per month</p><p>Benefits:</p><ul><li>Dental insurance</li><li>Disability insurance</li><li>Flexible spending account</li><li>Health insurance</li><li>Health savings account</li><li>Life insurance</li><li>Paid time off</li><li>Retirement plan</li><li>Vision insurance</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Contract Length:</p><ul><li>More than 1 year</li></ul><p>Contract Renewal:</p><ul><li>Likely</li></ul><p>Typical start time:</p><ul><li>8AM</li></ul><p>Typical end time:</p><ul><li>5PM</li></ul><p>Company's website:</p><ul><li>https://uhcancercenter.org/wu-lang</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Social distancing guidelines in place</li><li>Virtual meetings</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>",
        "index": 9,
        "skills": [
            "project management",
            "bioinformatics",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Software Engineering Co-op",
        "company": "SetPoint Medical -",
        "location": {
            "city": "Valencia",
            "state": "California"
        },
        "posted": "2021-01-23T09:51:47.909Z",
        "url": "https://www.simplyhired.com/job/4pfJvKPVmo9CkXj6imbf3f7g95-MukjlcfQOMRwE2kH8XEFmkOJH5A?q=computer+science",
        "lastScraped": "2021-01-25T09:51:47.909Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Position Description: </b></p><p>SetPoint Medical is seeking a highly motivated and self-driven Computer Science, Software Engineering, or Computer Information Systems student to work on a sophisticated active implantable device for their co-op or externship. Responsibilities may include, depending on the student’s skillset, any part of the software development stack (from low-level embedded code to high-level cloud development). This is a full-time, off-site position. Co-op position up to 1 year.</p><p>The student will work closely with senior engineers to receive training and mentorship. Compensation will vary significantly depending on the student’s skillset, completed education, and relevant past experience.</p><p><b>All candidates will be required to present a digital portfolio of relevant work experience, personal projects, and/or academic accomplishments. Portfolios should include screenshots of programs and websites the candidate has created, code examples, documentation examples, and/or anything else that highlights the candidate’s skills. Candidates that cannot present a portfolio need not apply.</b></p><p><b>Job Responsibilities: </b><br>Responsibilities will vary depending on the Software Engineer’s skillsets, but may include:</p><p>· Writing mobile applications for iOS or Android. iOS applications use the Swift language, and Android applications will use Java</p><p>· Writing Windows desktop applications in C# using WPF and .NET Core</p><p>· Server-side programming using ASP.NET with C#</p><p>· Low-level embedded programming with C and C++</p><p>· Participate in planning, requirements analysis, architecture and specification design, and verification processes</p><p>· Actively communicate and engage with other departments (e.g., electrical and mechanical engineering, regulatory, quality, etc.) to develop a robust and controlled product</p><p><b>Minimum Qualifications: </b><br>· Applicants should be pursuing a degree in Computer Science or related major. Undergraduate students must be, at a minimum, in their third year of coursework.</p><p>· Proficiency and experience with object-oriented programming. Knowledge of C#, Swift, Java, and/or C++ is preferred.</p><p>· Applicants should have some prior experience in creating applications, either mobile or desktop, including applications created for personal or academic projects.</p><p>· Experience with developing and debugging in professional IDEs (e.g., Visual Studio, Xcode, Eclipse, etc.)</p><p>· Familiarity with relational or non-relational database design principals</p><p>· Familiarity with client/server programming and architecture</p><p>· Must be clear a communicator and strong writer, as working in the medical device field requires detailed and thorough documentation</p><p><b>Preferred Qualifications: </b><br>The following qualifications are all a plus, but not necessarily required:</p><p>· Experience and/or study in advanced topics such as multi-threaded programming, data science and machine learning, cybersecurity, advanced database design, etc.</p><p>· Experience in graphic design, and familiarity with raster and vector design tools (e.g., Photoshop and Illustrator)</p><p>· Familiarity with unit testing and user interface testing frameworks</p><p>· Experience with Class II/III medical devices</p><p>· Relevant work experience</p><p><b>Location: </b><br>Company Headquarters in Valencia, CA</p><p><b>Company Description: </b><br>SetPoint Medical is an early-stage medical device company developing the first implantable bioelectronic device for the treatment of chronic inflammatory diseases.</p><p>Job Types: Full-time, Internship</p><p>Pay: $18.00 - $20.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>Experience:</p><ul><li>creating applications either mobile or desktop: 1 year (Preferred)</li><li>object-oriented programming: 1 year (Preferred)</li></ul><p>This Job Is Ideal for Someone Who Is:</p><ul><li>Dependable -- more reliable than spontaneous</li></ul><p>Company's website:</p><ul><li>www.setpointmedical.com</li></ul></div><div></div>",
        "index": 10,
        "skills": [
            "machine learning",
            "software engineering",
            "java",
            "data visualization",
            "c and c++",
            "project management",
            "information technology",
            "mobile development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "IT and Database Technician",
        "company": "ERS- Environmental Record Search -",
        "location": {
            "city": "Laguna Hills",
            "state": "California"
        },
        "posted": "2021-01-20T09:51:48.160Z",
        "url": "https://www.simplyhired.com/job/A5j9Dm2Ci5a9-S1ilFKbIAsCmArQCHBeVTwyxyl8GlbyhJgN9JrGUQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:48.160Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>This Part-Time position, IT and Database Technician (female or male) will be trained to do multiple tasks within ERS. Some of these tasks will be as fill-in and/or on a regular basis. Some of these tasks are as follows:</p><p>1. Quality Control (Report and Data).</p><p>2. Data Compiling using MS Access/SQL Macros.</p><p>3. Backing up the entire system.</p><p>4. Security</p><p>6. Hardware and Software Knowledge.</p><p>7. Minor programming and/or trouble shooting in C++, SQl, VB.net and other languages. ArcMap experience a big plus!</p><p>8. Ability to setup virtual servers using VMware on rack servers would be great.</p><p>9. Ability to setup and manage e-mail accounts and VPN accounts.</p><p>Experience with SQL databases or any other database platform is a plus.</p><p><b>Must be Student currently going to school in computer science or A.A. degree in some sort of computer science related major is a minimum requirement.</b></p><p>Wage increases will occur on a regular basis based upon demonstrated and proven ability by employee to become proficient in the work over a period of time once fully trained.</p><p>Office hours are flexible and as needed or required and are commonly M-F 9am-6pm. This is why this job is perfect for a students. ERS is an equal opportunity employer, EOE, female/male. An applicant must possess the following in order to be considered: Excellent MS Office, Excel, Word, skills. Great work ethic, learning attitude and care for excellence in what you and others do! We hire people that care about their work, Female/Male applicants, EOE. If you want to join a growing and progressive environmental database company, send your resume with a letter of why you are perfect for this job to Erick@ reccheck.com. DO NOT CALL! Prior to applying, check out our web site at www.reccheck.com.</p><p>Job Type: Part-time</p><p>Salary: $15.00 to $16.00 /hour</p><p>Job Types: Part-time, Internship</p><p>Pay: $14.00 - $16.00 per hour</p><p>Benefits:</p><ul><li>Paid time off</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Associate (Preferred)</li></ul><p>Experience:</p><ul><li>Microsoft SQL Server: 1 year (Preferred)</li><li>Microsoft Access: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>Multiple locations</li><li>Fully Remote</li></ul><p>Hours per week:</p><ul><li>10-19</li><li>20-29</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>This Job Is Ideal for Someone Who Is:</p><ul><li>Dependable -- more reliable than spontaneous</li><li>Adaptable/flexible -- enjoys doing work that requires frequent shifts in direction</li><li>Detail-oriented -- would rather focus on the details of work than the bigger picture</li><li>Autonomous/Independent -- enjoys working with little direction</li><li>Innovative -- prefers working in unconventional ways or on tasks that require creativity</li></ul><p>Company's website:</p><ul><li>www.reccheck.com</li></ul><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Personal protective equipment provided or required</li><li>Social distancing guidelines in place</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>",
        "index": 11,
        "skills": [
            "information technology",
            "sql",
            "hardware",
            "c and c++",
            "machine learning",
            "project management",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "PHP Web Developer - Unpaid Internship (College credit)",
        "company": "Amazing Voice -",
        "location": {
            "city": "Orlando",
            "state": "Florida"
        },
        "posted": "2021-01-21T09:51:48.724Z",
        "url": "https://www.simplyhired.com/job/lB5RZMZOoueMv7WoX2kMNOpPITPS3UbIIJgIOVqGnX9KVqdunHAMpg?q=computer+science",
        "lastScraped": "2021-01-25T09:51:48.724Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Internship position available</b></p><p>This is a unique opportunity for a web developer.</p><p>Working in a recording studio environment, you will be responsible for the web development of several of the company's domains but primarily focused on the amazingvoice.com website.</p><p>We are a growing company with more growth to come with the ongoing addition of multiple languages and currencies.</p><p>You will be part of a small team where you can be creative on many levels and work directly with the company's CEO to help achieve his vision.</p><p>We are seeking an individual with the potential to become a full time employee within our company.</p><p><b>Responsibilities</b></p><ul><li>Write well designed, testable, efficient code by using best software development practices</li><li>Create, modify &amp; update web site layout/user interface by using standard HTML/CSS practices</li><li>Integrate data from various back-end services, cron jobs, and databases</li><li>Gather and refine specifications and requirements based on technical needs</li><li>Create and maintain software documentation</li></ul><p><b>Skills</b></p><ul><li><b>Must have good knowledge of HTML, CSS, PHP, MYSQL, AJAX, BOOTSTRAP.</b></li><li>A solid understanding of how web applications work including security, session management, and best development practices</li><li>Aggressive problem diagnosis and creative problem-solving skills</li><li>Ability to work and thrive in a fast-paced environment, learn rapidly and master diverse web technologies and techniques.</li><li>BS in computer science or a related field</li></ul><p>Job Types: Full-time, Internship</p><p>Pay: $0.00 per hour</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>COVID-19 considerations:<br>Everyone wears masks, and also work in their own environment.<br>Everyone has their own office/room.</p><p>Internship Compensation:</p><ul><li>College Credit</li></ul><p>Company's website:</p><ul><li>amazingvoice.com</li></ul></div><div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "software engineering",
            "web development"
        ],
        "compensation": "unpaid",
        "remote": false
    },
    {
        "position": "Intern, Research - Devices, Circuits, and Systems",
        "company": "Arm - 4.2",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2021-01-25T09:51:49.095Z",
        "url": "https://www.simplyhired.com/job/S4Uss4_h1IZu9AIXMz7W9CgcGIEdentNasH3D3z0DORwWKgrnp6SPA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:49.095Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Show more\n<br>Research Internships 2021 – DCS\n<br><br>\nArm is the industry's leading supplier of microprocessor technology providingefficient, low-power chip intelligence making electronic innovations come to life. Through our partners, our designs power everything from coffee machines to the fastest supercomputer in the world. Do you want to work on technology that enriches the lives of over 70% of the world’s population? Our internship program is now open for applications! We want to hear from curious and enthusiastic candidates interested in working with us on the future generations of compute.\n<br><br>\nAbout Arm and Arm Research\n<br><br>\nArm plays a key role in our increasingly connected world. Every year, more than 20 billion products featuring Arm technology are shipped. Our engineers design and develop CPUs, graphics processors, complex systemtechnologies, supporting software development tools, and physical libraries.\n<br><br>\nAt Arm Research, we develop new technology that can grow into new business opportunities. We keep Arm up to speed with recent technological developments by pursuing blue-sky research programs, collaborating with academia, and integrating emerging technologies into the wider Arm ecosystem. Our research activities cover a wide range of fields from mobile and personal computing to server, cloud, and HPC computing. Our work and our researchers span a diverserangefrom circuits to theoretical computer science. We all share a passion for learning and creating.\n<br><br>\nAboutthe devices, circuits and systemsgroup and our work\n<br><br>\nWe are looking for interns to join our Devices, Circuits and Systems Research team; we want to hear from candidates interested in delivering post-Moore scaling and pushing compute past the limits of power, cost, and performance.Our research activities cover a wide range of chip design challengessuch as:\n<br><br>\nDelivering power to multi-GHz processors\n<br>Crafting performant and energy-efficient systems with emerging post-Moore memory and switching devices\n<br>3D stacking\n<br>Designing microwatt sub-threshold microcontrollers\n<br>Realising 1 cent disposable printed electronics\n<br>Prototyping battery-less sensor nodes\n<br><br>\nJob requirements\n<br><br>\nEducation\n<br><br>\nOur internstypically pursueMastersor PhD degrees in engineering and science,most commonly Computer Science, Electrical Engineering, Mathematics, or Physics, but we encourage applications from any field of studyif you are motivated and feel your unique skills are relevant to what we do.\n<br>We will also consider your application if you are pursuing an undergraduate or bachelor's degree and have relevant project or work experience.\n<br><br>\nSkills and Experience\n<br><br>\nYou have strong problem-solving abilities\n<br>You have a keen research interestin VLSI and chip design\n<br>You are keen to learn new EDA tools and techniques\n<br>You think about your research \"across the stack\" from devices to systems\n<br>You want to collaborate and participate in the research community\n<br><br>\nOur internships and how to apply\n<br><br>\nWe invite you to apply for an internship if your research interests align with ours and are enthusiastic about the type ofworkwe do. As an Arm Research intern, you will get a first-hand view of how Arm crafts its technology and maintains an ecosystem of more than one thousand partners that have shipped over 170 billion leading-edge Arm-powered processors. We will work closely with you to develop an internship project that is tailored to your interests. Our internships are three months long with flexible start dates. We offer continuous support, feedback, and development opportunities as well as flexibility to decide how to complete project tasks.\n<br><br>\nYou will work alongside experienced researchers within a specific teamand alsothe wider research group doing real project tasks. We believe in developing talent for the future, so we seek to offer many of our interns a graduate position once they have finished their studies.\n<br><br>\nPlease provide a cover note with your application; include some information about what you are interested in and the kind of projects you would like to work on. If you have a clear idea about the work you want to do, include it in your letter. It is okay not to be 100% sure! Tell us about your studies and what you enjoy, and we will try to find the right fit for you.\n<br><br>\nArm Research recognizes that diverse and inclusive teams generate exceptional ideas and innovations critical to an outstanding research organization's success. We do not discriminate because of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.</div><div></div>",
        "index": 13,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Vee Cyber Security Intern",
        "company": "Vee - 3.9",
        "location": {
            "city": "New York State",
            "state": "State"
        },
        "posted": "2021-01-24T09:51:49.450Z",
        "url": "https://www.simplyhired.com/job/i9F2ipns2utkaFEOoj01nRo34ThA86VER81yTYs6ONsC6fxumObRAQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:49.450Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Position:</b> Cyber Security Intern (REMOTE)\n<br><br>\n<b>Reports to:</b> CTO\n<br><br>\n<b>Location:</b> Remote\n<br><br>\nAre you passionate about designing a secure cloud architecture and defending systems in an age of cyber threats? Driven to stay on the cutting edge of data privacy, data lineage, and data governance? Motivated to help establish, define, and evangelize how cyber security is integral to business strategy?\n<br><br>\nCompany Overview\n<br><br>\nVee inspires people to align on Purpose so they can unlock their individual and collective human potential. We are an early stage startup poised for dramatic growth. We specialize in developing ways to drive greater strategic alignment to unlock enterprise innovation and growth. After spending considerable time exploring the need for better alignment models across diverse organizations, we have developed a framework and methodology based on insights from extensive research. We are building products to assess gaps and are offering our consulting services to help 21st century leaders develop and implement their organizational and people strategies, along with the capabilities required to operationalize their Purpose.\n<br><br>\nPosition Overview\n<br><br>\nJoin our fast-growing team! You will help support the business by focusing on cyber security and privacy via a blend of software development and operations expertise to optimize the risk related to Vee's cloud operations.\n<br><br>\nGeneral Responsibilities\n<br><br>\nInstitute the rigorous implementation of AWS IAM\n<br>Research and apply Access Advisor, CloudTrail, and other services to assess the security of access policies\n<br>Learn about new technologies in cyber security, DevOps security, and data privacy\n<br>Analyze full-stack Python code bases to identify vulnerabilities and perform code reviews to remediate problems\n<br>Support the review of all data in hardware and cloud contexts\n<br>Takes ownership of tasks assigned, asking questions along the way, and helps drive work products to completion\n<br>Communicate results and ideas to key stakeholders at Vee\n<br><br>\nCore Experience &amp; Requirements\n<br><br>\nSoftware Engineering experience with high proficiency in Python\n<br>Must have a degree in computer science or similar discipline\n<br>Must currently have or currently pursuing a certification in the field of Cyber Security\n<br>CompTIA Security+\n<br>CISSP\n<br>Information Assurance\n<br>Certified Ethical Hacker\n<br><br>\nPreferred Experience\n<br><br>\nExperience with AWS IAM\n<br>Data privacy and data lineage knowledge\n<br><br>\n<b>Understanding of:</b><br>\nData manipulation of Indicators of Compromise (IOC's)\n<br>Security Information and Event Management (SIEM)\n<br>Vulnerability Management (Vulnerability Scanning and Patching)\n<br>Information Assurance\n<br>Forensics\n<br>Multifactor Authentication\n<br>Security Operations Center (SOC) monitoring\n<br><br>\nProfile\n<br><br>\nPurpose is what drives you. Your passion for your work has led you here. You are ready to combine your experience with ours to help our client companies gain competitive advantage. You bring strong creative thinking skills in addition to superior communication skills, allowing you to develop creative solutions for any challenge that comes your way.\n<br><br>\n<b>You:</b><br>\nLove what you do, love to be busy, and love to produce by being organized and methodical\n<br>Work with a sense of urgency and have a strong drive for results\n<br>Have the resilience and agility to adapt quickly in a fast-paced environment\n<br>Work independently as well as collaboratively to stretch thinking into creative solutions\n<br>Have strong verbal and written communication skills\n<br>Are excited about and suited for a startup, where you'll be wearing a few hats\n<br>Are smart and fun with an empathetic nature, which will add to our culture\n<br><br>\nAbout Vee\n<br><br>\nOur founders and team have deep expertise in branding, innovation, design, I/O psychology, organization design, digital &amp; data product development, enterprise software and application development complemented by experience with clients ranging from emerging Silicon Valley unicorns to established leaders in government and the public and private sectors including American Express, Bank of America, BMW, Box, HP, Lowe's, Mastercard, Microsoft, Nissan, Pepsico, Procter &amp; Gamble, SAP and The Clorox Company, among others. For more information, check out our website in transition at https://www.letsvee.com/.</div><div></div>",
        "index": 14,
        "skills": [
            "information technology",
            "software engineering",
            "devops",
            "hardware",
            "project management",
            "python",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Software Development Intern",
        "company": "Telos Corporation - 4.1",
        "location": {
            "city": "Ashburn",
            "state": "Virginia"
        },
        "posted": "2021-01-24T09:51:49.791Z",
        "url": "https://www.simplyhired.com/job/UF_QNeTNbF3XhOhUrlaLbeT2VpzjFxvwZwGQdskmzOjYfqD8N4Z1Dg?q=computer+science",
        "lastScraped": "2021-01-25T09:51:49.791Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Job Description:</b><br>\nThe most security-conscious organizations trust Telos Corporation to protect their vital IT assets. The reputation of our company rests on the quality of our solution and the integrity of our people. See what your imagination can bring to our solutions in enterprise IT security management, consulting, secure wireless networking, communications, and identity management.\n<br><br>\nWe have exciting internship opportunities for college students with experience or an interest in computational mathematics, systems engineering, data analysis, information security, software development, or computer science. Candidates do not need to be specifically in a Science Technology Engineering and Math curriculum. We are interested in individuals that are excited by and interested in all aspects of technology\n<br><br>\nPreference will be given to those applicants based in the DC, VA, and MD areas. Relocation assistance is not available.\n<br><br>\n<b>Software Developer Intern:</b><br>\nWe have an exciting Software Developer Intern opportunity that is open for a college sophomore or higher and will be based out of our headquarters in Ashburn, VA.\n<br><br>\n<b>Responsibilities:</b><br>\nWork with business analyst, development and QA teams to implement new features or resolve application bugs.\n<br>Work with framework team to assist in the evaluation and development of technical solutions to identified problems.\n<br>Complete assignments with independent thought and action within the scope of specific assignments.\n<br><br>\n<b>Job Requirements:</b><br>\nCollege sophomore or higher.\n<br>The successful candidate must meet eligibility requirements to access sensitive information which requires US Citizenship.\n<br>Highly motivated and driven.\n<br>Experience with Java and OO concepts.\n<br>Familiarity with SQL and ORMs is a plus.\n<br>Understands Software Development Life Cycle.\n<br>Fast learner who can adapt to new technologies.\n<br>Strong written and verbal communications skills and the ability to interact with people at all levels.\n<br>Proficient with standard PC applications (e.g., Windows, Word, Excel, etc.).\n<br>Ability to work independently and collaboratively in fast-paced and dynamic environment.\n<br><br>\nTelos maintains a drug-free workplace and will conduct drug testing on all applicants who have accepted an offer of employment.\n<br><br>\nTelos Corporation participates in the E-Verify program. Therefore, any employment with Telos will also be contingent upon confirmation from the Social Security Administration (“SSA”) and/or the Department of Homeland Security (“DHS”) of your authorization to work in the United States.\n<br><br>\nTelos offers excellent compensation packages including salary commensurate with experience and benefits to meet your needs for today and the future.\n<br><br>\nTelos and its subsidiaries are an Affirmative Action/Equal Opportunity Employer encouraging women, minorities, individuals with disabilities, and veterans to apply.</div><div></div>",
        "index": 15,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "java",
            "networks",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Administrative Assistant/Computer technician",
        "company": "Simplex United LLC -",
        "location": {
            "city": "Calimesa",
            "state": "California"
        },
        "posted": "2021-01-24T09:51:50.059Z",
        "url": "https://www.simplyhired.com/job/lXnkyRz52dqFpJTBFwnTOL5SsurN_UbEYNDy6nJP5MLzjTqn2HeI1Q?q=computer+science",
        "lastScraped": "2021-01-25T09:51:50.059Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Please submit cover page and resume.</p><p>The position requires background check and a drug test. Be available to work on the weekends.</p><p>Minimum Requirements:<br>Associate Degree in computer science or higher education. Perfect for recent graduates or students</p><p>The successful candidate expect to demonstrate above average computer skills, be comfortable with software installation and updates, familiar with website management and update as needed. Ability to understand and repair hardware is a plus.</p><p>An office responsibilities include answering phone calls, schedule appointments, helping with proctoring exams in the Testing Center, monitoring online exams, performing I-9 verification for remote job applicants, live scan fingerprints and assisting with drug test for job candidates.</p><p>Job Types: Part-time, Internship</p><p>Pay: $13.00 - $15.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Day shift</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Hours per week:</p><ul><li>10-19</li></ul><p>Typical start time:</p><ul><li>9AM</li></ul><p>Typical end time:</p><ul><li>4PM</li></ul><p>Company's website:</p><ul><li>simplexunited.com</li></ul><p>Company's Facebook page:</p><ul><li>https://www.facebook.com/Simplex-United-Business-and-Career-Center-467983186667293/</li></ul><p>Work Remotely:</p><ul><li>No</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Personal protective equipment provided or required</li><li>Plastic shield at work stations</li><li>Temperature screenings</li><li>Social distancing guidelines in place</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>",
        "index": 16,
        "skills": [
            "hardware",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "2021 Actuarial Internship",
        "company": "Lincoln Financial - 3.7",
        "location": {
            "city": "Hartford",
            "state": "Connecticut"
        },
        "posted": "2021-01-24T09:51:50.488Z",
        "url": "https://www.simplyhired.com/job/XTBLNUN3j6Abyhs-rjiCYD9oSOfwJLFzTC6pFIIEi1AQKxq8AmQ7iQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:50.488Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Alternate Locations:</b> Atlanta, GA (Georgia); Boston, MA (Massachusetts); Dover, NH (New Hampshire); Fort Wayne, IN (Indiana); Greensboro, NC (North Carolina); Hartford, CT (Connecticut); Omaha, NE (Nebraska); Radnor, PA (Pennsylvania)\n<br><br>\nRelocation assistance will be considered/provided for this opportunity within our company guidelines.\n<br><br>\n<b>Level:</b> Intern\n<br><br>\nRequisition #64355\n<br><br>\nAbout the Company\n<br><br>\nLincoln Financial Group, a Fortune 250 company with over 10,000 employees, provides advice and solutions that help empower Americans to take charge of their financial lives with confidence. Our core business areas — Life Insurance, Annuities, Retirement Plan Services and Group Protection — focus on supporting, preserving and enhancing over 17 million customer’s lifestyles and retirement outcomes.\n<br><br>\nHeadquartered in Radnor, Pennsylvania, Lincoln Financial Group is the marketing name for Lincoln National Corporation (NYSE: LNC) and its affiliates. The company had $238 billion in assets under management as of December 31, 2018.\n<br><br>\nRanked one of the Best Large Employers in America by Forbes magazine, Lincoln Financial Group makes a serious investment in our employees’ futures through a broad range of wealth accumulation and protection plans, health and wellness programs, and career development resources designed to help each individual reach their personal and professional goals.\n<br><br>\nGeneral Purpose of Job\n<br><br>\nOur actuarial interns are a key part of our organization because they perform meaningful work in an environment that supports their learning.\n<br><br>\nDuties and Responsibilities\n<br>Compiles, categorizes, and audits data.\n<br>Documents and verifies factors used in computations and actuarial models.\n<br>Gains knowledge about company operations, systems, and actuarial methodologies.\n<br>Maintains knowledge on current and emerging developments/trends for assigned area(s) of responsibility.\n<br>Performs and delivers on routine assignments/projects for his/her assigned area(s) of responsibility.\n<br>Performs basic data analysis and calculations for consistency and reasonableness to support broader actuarial deliverables for his/her assigned area(s) of responsibility.\n<br>Supports and promotes change management and/or departmental/enterprise initiatives within assigned area(s) of responsibility.\n<br>Additional Position Responsibilities\n<br>Carries out duties in compliance with all state and federal regulations and guidelines. Complies with all company and site policies and procedures.\n<br><b>Makes a positive contribution as demonstrated by:</b> - Making suggestions for improvement - Learning new skills, procedures and processes\n<br>Performs other duties as required.\n<br>Remains current in profession and industry trends.\n<br>Other Skills and Abilities\n<br>Ability to perform under stress in cases of emergency, critical or hazardous situations.\n<br>Ability to work with others in a team environment.\n<br>Demonstrated solid relationship management skills with internal clients (e.g. management, peers and colleagues).\n<br>Demonstrates excellent organizational skills with the ability to prioritize workload and multi-task while maintaining strict attention to detail.\n<br>Demonstrates strong interpersonal skills with a collaborative style.\n<br>Demonstrates the ability to use sound judgment and discretion regarding confidential information.\n<br>Finds common ground and can gain collaboration among management, colleagues and peers.\n<br>Proficiency with Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n<br>Successfully completes regulatory and job training requirements.\n<br>Education\n<br><b>Other:</b> - Minimum Required in Undergraduate degree in Actuarial Science, Applied Mathematics, Statistics, Economics, Computer Science, or other quantitative major.\n<br>Certifications\n<br>1-4 Actuarial Exams passed. -Upon Hire\n<br><br>\nThis position may be subject to Lincoln’s Political Contribution Policy. An offer of employment may be contingent upon disclosing to Lincoln the details of certain political contributions. Lincoln may decline to extend an offer or terminate employment for this role if it determines political contributions made could have an adverse impact on Lincoln’s current or future business interests, misrepresentations were made, or for failure to fully disclose applicable political contributions and or fundraising activities.\n<br><br>\nAny unsolicited resumes/candidate profiles submitted through our web site or to personal e-mail accounts of employees of Lincoln Financial Group are considered property of Lincoln Financial Group and are not subject to payment of agency fees.\n<br><br>\nLincoln Financial Group (“LFG”) is an Equal Opportunity employer and, as such, is committed in policy and practice to recruit, hire, compensate, train and promote, in all job classifications, without regard to race, color, religion, sex (including pregnancy), age, national origin, disability, sexual orientation, gender identity and expression, veterans status, or genetic information. Applicants are evaluated on the basis of job qualifications. If you are a person with a disability that impedes your ability to express your interest for a position through our online application process, or require TTY/TDD assistance, contact us by calling 260-455-2558.\n<br><br>\n#[[customString5]]\n<br><br>\n<b>Nearest Major Market:</b> Hartford</div><div></div>",
        "index": 17,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "contact": "260-455-2558",
        "remote": false
    },
    {
        "position": "IT/Development Intern",
        "company": "Indikon Media - 5.0",
        "location": {
            "city": "Overland Park",
            "state": "Kansas"
        },
        "posted": "2021-01-20T09:51:50.795Z",
        "url": "https://www.simplyhired.com/job/ocnp3OkvFmsnSx6JRcdFQTKIs3V3eJB7xPAHjSVG49RERsWuhy07nA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:50.795Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Indikon Media is looking for a highly motivated intern to assist in a variety of IT and Web Development tasks. This internship has the potential to grow into a full-time position for the right candidate. Candidates need to be currently within the Kansas City, Metropolitan area.</p><p>Job duties include:</p><p>WordPress</p><ul><li>General troubleshooting</li><li>HTML and CSS</li><li>WP Engine</li><li>Back end templates</li></ul><p>Tracking and Analytics</p><ul><li>Google Analytics</li><li>Search Console</li><li>Keyword tracking</li></ul><p>PPC</p><p>SEO</p><p>Social Media Ad Campaigns</p><p>Ad Server for Multiple Sites</p><p>Domain Management</p><ul><li>Managing DNS</li><li>Sales</li><li>Acquisitions</li><li>Transfers</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $12.00 - $15.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Experience:</p><ul><li>Computer Science Education: 1 year (Required)</li></ul><p>Typical start time:</p><ul><li>8AM</li></ul><p>Typical end time:</p><ul><li>5PM</li></ul><p>Company's website:</p><ul><li>www.Indikonmedia.com</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Personal protective equipment provided or required</li></ul></div><div></div>",
        "index": 18,
        "skills": [
            "information technology",
            "project management",
            "software engineering",
            "web development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Software Engineer, Intern/Co-op",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Menlo Park",
            "state": "California"
        },
        "posted": "2021-01-22T09:51:51.235Z",
        "url": "https://www.simplyhired.com/job/mxwikgKCyOl9ZcPAo1wvd00IDl1wt9VijxwWhTB-bDDhGH7qxW4whA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:51.235Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Want to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems?Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately.Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n<br>Code high-volume software using primarily C++ and Java\n<br>Create web applications using primarily PHP\n<br>Implement web interfaces using XHTML, CSS, and JavaScript\n<br>Build report interfaces and data feeds\n<br>1 or more years of experience with perl, java, php, python, or c++\n<br>Must be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\n<br>Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications\n<br>Intent to return to degree-program after the completion of the internship/co-op\n<br>High levels of creativity and quick problem-solving capabilities\n<br>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n<br>#LI-REMOTE</div><div></div>",
        "index": 19,
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "python",
            "c and c++"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "AUDIT IT ASSURANCE INTERN - SUMMER 2021",
        "company": "GRANT THORNTON - 3.7",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2021-01-24T09:51:54.202Z",
        "url": "https://www.simplyhired.com/job/exz_N0uN3lHHdg0rO7DVNCi1w-ZsmLyIuPyticFHRw5zQTahqnM3bQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:54.202Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Audit IT Assurance Intern - Summer 2021(Job Number:</b> 047468)\n<br><br>\nDescription\n<br><br>\nGrant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant Thornton International Ltd, one of the world’s leading organizations of independent audit, tax and advisory firms. We’ve never been a typical professional services firm. We put people first, and that is what sets us apart.\n<br><br>\nAs one of the fastest-growing professional services firms in the world, Grant Thornton LLP is continuously seeking top talent. Discover a place where you’ll work with a team of professionals dedicated to providing bold leadership and distinctive client service. Spend each day engaged in meaningful and challenging work. Be supported in your professional growth and recognized for your contributions.\n<br><br>\nAudit IT Assurance Intern\n<br><br>\nPosition Summary\n<br><br>\nAn IT Assurance Intern is responsible for delivering a full range of IT audit services to our clients. Responsibilities include testing and assessment of information systems control review engagements in support of financial statement audits.\n<br><br>\nQualifications\n<br><br>\nEssential Duties and Responsibilities\n<br>Evaluate and test IT controls and identify areas of risk.\n<br>Apply current knowledge of IT trends and systems processes to identify security and risk management issues, as well as other opportunities for overall process improvement.\n<br>Maintain professionalism and rapport with the client. Proactively interact with key client management to manage expectations, help ensure client satisfaction, meet client deadlines, and resolve any problems.\n<br>Gain a comprehensive understanding of assigned client operations, processes and business objectives, and then utilize that knowledge on assigned engagements.\n<br>Participate in recruiting efforts as needed.\n<br>Meet or exceed IT Assurance metrics (e.g. – billable hours, CPE, time delinquencies, etc…)\n<br>Participate in other business development activities as appropriate\n<br>Other duties as assigned.\n<br>Experience Requirements\n<br><br>\nPursuing Bachelor's degree in Accounting, Finance, Information Technology, MIS or related field. A Master’s degree is a plus.\n<br>Desire to pursue CPA, CISA, CISSP, CIA or CISM license/certification.\n<br>Some related work experience in public accounting or equivalent delivering controls based services, auditing Information Technology General Controls (ITGC’s.) in support of financial statement audits to cross-industry clients and technologies. An understanding of generally accepted practices for testing Key Reports, and Application Controls a plus.\n<br>Information Security experience or information security training is required.\n<br>Exceptional client service and communication skills.\n<br>Strong technical aptitude and problem solving skills\n<br>Excellent analytical, communication (written and verbal) and interpersonal skills.\n<br>Effective project and time management skills for handling multiple priorities and simultaneous projects\n<br>Enthusiasm to learn through a combination of structured, on-the-job and self-directed training\n<br>Ability to work efficiently and effectively in a complex team environment\n<br>Strong computer skills including proficiency in Microsoft Office suite applications.\n<br>Ability to work additional hours and/or travel as needed.\n<br><br>\n<b>BENEFITS:</b><br>\nGrant Thornton LLP promotes a nationally recognized culture of health and offers an extensive array of benefits to meet individual lifestyles. For a complete list of benefits please visit http://www.gt.com/.\n<br><br>\nIt is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law.\n<br><br>\n<b>Requisition ID:</b> 047468\n<br><br>\nChicago, IL\n<br>Chicago, Illinois</div><div></div>",
        "index": 20,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "IT Internship",
        "company": "Dekker Vacuum Technologies, Inc. -",
        "location": {
            "city": "Michigan City",
            "state": "Indiana"
        },
        "posted": "2021-01-20T09:51:54.470Z",
        "url": "https://www.simplyhired.com/job/rsUXWTAfYSe7q5SvEMHvayMd5r4zHjCMAkd33-1Bzin92-T5kJgixQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:54.470Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Not Remote. Must be able to come to facility. </b></p><p><b>IT Intern Duties and Responsibilities</b></p><p>· Support the IT team in maintaining hardware, software, and other systems migration of systems to NGAD</p><p>· Assist with troubleshooting issues and provide technical support for Dekker Staff</p><p>· Organize and maintain IT resources to security Standards</p><p>· Lend IT support in areas such as cybersecurity, programming, analytics, and data center management</p><p>· Implement change order process, secure data/pc operations to corporate standards.</p><p>· Jobs as assign to meet company goals.</p><p>· Reports to IT Manager/Controller</p><p><b>Requirements</b></p><p>· Computer Science, Information Technology, or Management Information Systems major</p><p>· Minimum GPA of 3.0</p><p>· Familiar with Java, .NET, JavaScript or HTML/DHTML and Microsoft Office 365</p><p>· Strong verbal and written communication</p><p>· Excellent analytical and problem-solving skills</p><p>· Ability to work well in teams</p><p>· Strong work ethic and attention to detail</p><p>· Available to work nights and weekends per schedule to ensure easy migration for non-production impact. Flexible Schedule</p><p>Job Types: Full-time, Temporary, Internship</p><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Windows: 1 year (Preferred)</li><li>Customer Service: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Employment Length:</p><ul><li>Varies</li></ul><p>Work Remotely:</p><ul><li>No</li></ul></div><div></div>",
        "index": 21,
        "skills": [
            "information technology",
            "javascript",
            "java",
            "hardware",
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Business Analyst (Software Solutions)",
        "company": "V Group Inc. -",
        "location": {
            "city": "Cranbury",
            "state": "New Jersey"
        },
        "posted": "2021-01-24T09:51:54.845Z",
        "url": "https://www.simplyhired.com/job/Zx0irNqANgwp74FiruoxGojN7THkud72PiE3H6ZdXtIBShdJYlqt-w?q=computer+science",
        "lastScraped": "2021-01-25T09:51:54.845Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>JOB ROLE:</p><p>We are hiring a Business Analyst to join our project team. You will work alongside other business analysts and report directly to the project manager. Your main tasks will include performing detailed requirements analysis, documenting processes, and performing some user acceptance testing. To succeed in this role you should have a natural analytical way of thinking and be able to explain difficult concepts to non-technical users.</p><p>RESPONSIBILITIES:</p><ul><li>Analyse, specify and validate the business needs of stakeholders, be they customers or end-users.</li><li>Collaborate with customers to determine project scope and vision.</li><li>Conduct interviews to gather customer requirements via workshops, questionnaires, surveys, site visits, workflow storyboards, use cases, scenarios, and other methods.</li><li>Identify and establish scope and parameters of requirements analysis on a project-by-project basis to define project impact, outcome criteria, and metrics.</li><li>Work with stakeholders and project team to prioritize collected requirements.</li><li>Research, review and analyze the effectiveness and efficiency of existing requirements-gathering processes and develop strategies for enhancing or further leveraging these processes.</li><li>Requirements analysis (different methodologies and notations usage - prototyping, surveys, brainstorming, existing documentation analysis and competitors);</li><li>Assist in conducting research to meet agreed-upon requirements and to support development efforts.</li><li>Participate in the QA of activities to ensure features and functions have been enabled and optimized.</li><li>Participate in the selection of any requirements documentation software solutions that the organization may opt to use.</li><li>Analyse and verify requirements for completeness, consistency, comprehensibility, feasibility, and conformity to standards.</li><li>Develop and utilize standard templates to accurately and concisely write requirements specifications.</li><li>Translate conceptual customer requirements into functional requirements in a clear manner that is comprehensible to developers/project team.</li><li>Create process models, specifications, diagrams, and charts to provide direction to developers and/or the project team.</li><li>Assist with the interpretation of customer requirements into feasible options, and communicating these back to the business stakeholders- use necessary tools</li><li>Manages and tracks the status of requirements throughout the project lifecycle; enforce and redefine as necessary.</li><li>Communicate changes, enhancements, and modifications of business requirements verbally or through written documentation to project managers, sponsors, and other stakeholders so that issues and solutions are understood.</li></ul><p>ADDITIONAL SKILLS:</p><ul><li>Able to exercise independent judgment and take action on it</li><li>Excellent analytical, mathematical, and creative problem-solving skills</li><li>Excellent listening, interpersonal, written, and oral communication skills</li><li>Logical and efficient, with keen attention to detail &amp; highly self-motivated and directed</li><li>Ability to effectively prioritize and execute tasks while under pressure</li><li>Strong customer service orientation</li><li>Experience working in a team-oriented, collaborative environment</li><li>Experienced in Strategic planning, Business Analysis, Market research, Gap Analysis and Wire-framing</li><li>Proficient in designing and reviewing various documents including BRD, FRD, SRS, SOW and Project Estimation Sheet.</li><li>Ability to use modelling tools such as Microsoft Visio, Balsamiq, for Business Process Modelling, Flow Charts, and Use Case Diagrams.</li><li>Expertise in Wire framing, Prototyping, ER Diagrams, UML Diagrams etc</li></ul><p>REQUIRED SKILLS, QUALIFICATION AND EXPERIENCE:</p><ul><li>A Bachelor's Degree in Computer Science or Information Technology, and an accredited qualification in Management Consultancy, or similar.</li><li>Extensive experience in technical business analysis in a related industry.</li><li>Good documentation capabilities to capture business requirements clearly and prepare techno functional solutions &amp; exposure to content writing.</li><li>Advanced knowledge of programming languages like SQL and system integration solutions.</li><li>Ability to facilitate internal end-user proficiency.</li><li>Ability to design and maintain efficient customer portal support and feedback channels.</li><li>Advanced knowledge of data security and encryption.</li><li>Ability to keep up with IT advancements.</li><li>Knowledge of relevant licensing and industry compliance regulations.</li><li>Should have strong understanding of QA/user acceptance testing (UAT) process within an Agile environment.</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $38,000.00 - $450,000.00 per year</p><p>Benefits:</p><ul><li>Dental insurance</li><li>Flexible schedule</li><li>Health insurance</li><li>Paid time off</li><li>Professional development assistance</li><li>Referral program</li><li>Vision insurance</li></ul><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Typical start time:</p><ul><li>8AM</li></ul><p>Typical end time:</p><ul><li>9PM</li></ul><p>Company's website:</p><ul><li>www.vgroupinc.com</li></ul><p>Company's Facebook page:</p><ul><li>https://www.linkedin.com/company/v-group/</li></ul><p>Benefit Conditions:</p><ul><li>Only full-time employees eligible</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Virtual meetings</li></ul></div><div></div>",
        "index": 22,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "virtual reality"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Motion Planning Intern - Summer 2021 - Master's or PhD",
        "company": "Motional -",
        "location": {
            "city": "Pittsburgh",
            "state": "Pennsylvania"
        },
        "posted": "2021-01-24T09:51:55.285Z",
        "url": "https://www.simplyhired.com/job/0iTNfzH7X6OEyHbyvjfCX1q4-RI_1iw_3Ad4QxgbVdm9p0F1ERYnDw?q=computer+science",
        "lastScraped": "2021-01-25T09:51:55.285Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The Motion Controls team is responsible for building out the trajectory optimization planning and model predictive control of the autonomy stack. Our software engineers contribute to software architecture and design, implementation strategy, and leads code reviews. Partnering with motion control research scientists to bring algorithms from concept to prototype and deployment in the real world at scale. Work in a complex and growing system where new features are being added and evaluated rapidly.\n<br><br>\n<b>What you'll be doing:</b><br>\nThe intern will contribute to the development of algorithms and software for the planning in the autonomy stack. The potential areas of work would be motion planning, prediction, simulation tests, and trajectory verification according to the rules.\n<br><br>\n<b>What You'll Bring:</b><br>\nCurrently enrolled in a Computer Science, Robotics, or relevant Graduate program.\n<br><br>\nC++ (i.e. C++11, C++14, C++17) development experience in a Unix/Linux environment.\n<br><br>\nKnowledge of software engineering principles including software design, source control management, build processes, code reviews, testing methods.\n<br><br>\nExperience working on robotics systems within Motion Planning, Motion Controls, Trajectory Optimization, or Model Predictive Control.\n<br><br>\nStrong problem-solving skills and ability to learn.\n<br><br>\nStrong communication and interpersonal skills.\n<br><br>\nFlexible and creative thinking.\n<br><br>\nAbout Us\n<br>Motional is making driverless vehicles a safe, reliable, and accessible reality.\n<br>Our team is commercializing a world-class driverless system. The Motional team is behind some of the industry’s largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world’s first robotaxi pilot, and operation of the world’s most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group, one of the world’s largest vehicle manufacturers offering smart mobility solutions, and Aptiv, a global technology leader in advanced safety, electrification, and vehicle connectivity, Motional is fundamentally changing how people move through their lives.\n<br><br>\nHeadquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on Twitter, LinkedIn, Facebook, Instagram and YouTube.\n<br><br>\nMotional AD Inc. is an EOE. We celebrate diversity and are committed to creating an inclusive environment for all employees. To comply with Federal Law, we participate in E-Verify. All newly-hired employees are queried through this electronic system established by the DHS and the SSA to verify their identity and employment eligibility.</div><div></div>",
        "index": 23,
        "skills": [
            "information technology",
            "software engineering",
            "robotics",
            "c and c++",
            "machine learning",
            "project management",
            "virtual reality"
        ],
        "remote": false
    },
    {
        "position": "STEM Internships - 1053",
        "company": "SARA Inc - 5.0",
        "location": {
            "city": "Colorado Springs",
            "state": "Colorado"
        },
        "posted": "2021-01-24T09:51:55.658Z",
        "url": "https://www.simplyhired.com/job/k2Rt3onL0bKj8HRwjcNws6ScySCelVlBt9_EWBB42y0-EkzNim8UsQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:55.658Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Are you looking for a hands-on internship that will engage you and help you grow in your chosen field of study? Would you like to be a part of an organization that is inventing new technologies and maturing them into useful products? Do you enjoy working on projects that take you out of your comfort zone and expand your ability to look outside the box?\n<br><br>\nWe are looking for highly motivated students and recent graduates who can adapt to a variety of challenges and are ready to take their learning beyond the classroom environment. If this excites you, apply and tell us more about you!\n<br><br>\n<b>The internship program is currently looking for:</b><br>\nMechanical Engineers\n<br>Electrical Engineers\n<br>Physicists\n<br>Computer Science/ Computer Engineering\n<br>Information Technology\n<br><br>\n<b>Minimum Requirements:</b><br>\nMust currently be a US citizen\n<br>Currently enrolled or recently graduated (within the last year) undergraduate student in the field of study applicable to the position for which you are applying with 2+ year of completed college course work\n<br>GPA &gt; 2.75\n<br>Strong verbal and written communication skills\n<br>Ability to prioritize tasks and handle numerous assignments simultaneously\n<br>Proficient in Microsoft Office applications (Word, PowerPoint, Excel)\n<br>Attention to detail\n<br>Ability to follow directions\n<br>Capable of working independently and completing assigned tasks\n<br><br>\n<b>Other Requirements:</b><br>\nEach position will have additional requirements and assigned responsibilities based on the area of competency.\n<br>Be sure to note on your resume and cover letter which internship you would like to be considered for\n<br><br>\nWhat’s in it for you?\n<br><br>\nFlexible work schedules\n<br>401(k)/profit sharing, and stock ownership eligibility credit\n<br><br>\nSalaries at SARA are competitive and are commensurate with the experience and qualifications of the individual. SARA is headquartered in the Los Angeles/Orange County area of Southern California and has offices in Irvine, California, Colorado Springs, Colorado, and Tyler, Texas.\n<br><br>\nSARA, Inc. is an EEOC/Title VII/ADA compliant federally contracted employer. All qualified applicants are considered for employment without regard to their race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Also, as a federal contractor, SARA must abide by the Drug-Free Workplace Act of 1988 and maintains a drug-free workplace regardless of local and state allowance.</div><div></div>",
        "index": 24,
        "skills": [
            "information technology",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "RISK ADVISORY INTERN - SUMMER 2021",
        "company": "GRANT THORNTON - 3.7",
        "location": {
            "city": "Minneapolis",
            "state": "Minnesota"
        },
        "posted": "2021-01-24T09:51:56.110Z",
        "url": "https://www.simplyhired.com/job/RcoAUR0etYrKAtBcVPB7o1xlE53MeII4MdRZHs7NVDvnyCsqqyOvfw?q=computer+science",
        "lastScraped": "2021-01-25T09:51:56.110Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Risk Advisory Intern - Summer 2021(Job Number:</b> 047795)\n<br><br>\nDescription\n<br><br>\nWho is Grant Thornton?\n<br><br>\nGrant Thornton is a collaborative, entrepreneurial firm on the move! As part of a dynamic, global organization of more than 42,000 people serving clients in more than 120 countries, we have the agility and focus it takes to be a leader.\n<br><br>\nFounded in Chicago in 1924, Grant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant Thornton International Ltd, one of the world’s leading organizations of independent audit, tax and advisory firms. Grant Thornton has revenue in excess of $1.56 billion and operates 58 offices across the United States with more than 565 partners and 8,000+ employees.\n<br><br>\nGrant Thornton works with a broad range of publicly and privately held companies, government agencies, financial institutions, and civic and religious organizations. Core industries served include consumer and industrial products, financial services, not-for-profit, private equity, and technology. Grant Thornton focuses on serving dynamic organizations that pursue growth holistically – whether through revenue improvement, leadership, mission fulfillment or innovation.\n<br><br>\nWe are committed to capitalizing on our strengths and serving dynamic organizations that share our values and drive. Our global values of collaboration, leadership, excellence, agility, respect, and responsibility (“CLEARR”) guide our behaviors and fuel our ambition to be the firm that makes a difference every day.\n<br><br>\nWe provide companies with the guidance that they need to help run their businesses, establish robust internal controls, use information effectively and improve performance. These services include compliance, consulting services, information technology solutions, forensic accounting and investigative services, recovery and reorganization, tax preparation, and valuation, to name a few.\n<br><br>\nWhat is Risk?\n<br><br>\nThe digitization of currencies, transactions, relationships, experiences and assets has transformed entire industries. Technologies extend borders and reach, creating new customers, business partners, avenues of access, methods of innovation and forms of value. At the same time, ongoing disruption in the marketplace and in the competitive and regulatory landscape presents continually evolving strategic, operational, financial and other risks.\n<br><br>\nTo move forward in this challenging environment, many management teams are turning to advisers like Grant Thornton LLP for broader industry and business perspectives and proven experience to assist them with developing and implementing their risk management programs, and providing attestations and certifications to validate the risk mitigation strategies relevant to their customers.\n<br><br>\nGrant Thornton’s Advisory professionals are progressive thinkers who create, protect, transform value today, so our clients have the opportunity to thrive and grow. Our advisory practice creates holistic solutions delivered by innovative, curious professionals who bring technical depth and industry insight to our clients.\n<br><br>\n<b>POSITION SUMMARY:</b><br>\nRisk Interns are responsible for delivering engagements ranging from business process and information systems controls assessments and testing to support regulatory, compliance and other strategic and operational and attestation engagements.\n<br><br>\n<b>RISK ADVISORY SERVICES ESSENTIAL DUTIES AND RESPONSIBILITIES:</b><br>\nEvaluate and test business processes and IT controls and identify areas of risk\n<br>Apply current knowledge of trends to identify business risk management issues and other opportunities for improvement\n<br>Work with the client to plan engagement strategy, define objectives, and address business risks and issues and supporting controls\n<br>Work with risk teams and the client to plan engagement strategy, define objectives, and address business process and IT controls risks and issues\n<br>Execute assigned client engagements from start to completion of information systems assessments and/or business process control reviews\n<br>Gain a comprehensive understanding of assigned client operations, processes and business objectives, and then utilize that knowledge on assigned engagements\n<br>Participate in recruiting efforts as needed\n<br>Meet or exceed targeted billing hours (utilization)\n<br>Assist practice leadership in creating proposals, budgets, and work plans. Participate in other business development activities as appropriate\n<br>Other duties as assigned\n<br><br>\nQualifications\n<br><br>\nWhy become a Risk Intern?\n<br>A Risk Intern will gain exposure to various areas of the practice by participating as an active member on consulting and compliance projects and by becoming an integral part of the delivery teams. As a Risk Intern your primary responsibility will be executing high quality Risk projects and services from beginning to end under the supervision of experienced Risk leadership. You will be responsible for efficiently managing your workload to budget and learning how to apply technical skills across our various Risk solutions. As a Risk Intern you’ll have opportunities to build client relationships by developing a deep understanding of our clients’ businesses and delivering value through your insight and quality work. In addition, as a Risk intern you’ll focus on continuously developing your technical and professional skills to grow and expand your role in the Risk practice. Additional responsibilities may include:\n<br><br>\nPerforming detailed analysis to identify and assess compliance or opportunities for improvement, documenting conclusions, and providing recommendations\n<br>Utilizing and continuously learning new technologies to collaborate with team members and enhance service delivery\n<br>Utilizing various data collection techniques, selecting appropriate method and prioritization to fit project objectives and deliverables, and applying established analytical models to evaluate data, costs and benefits\n<br>What are we looking for in an Intern?\n<br><br>\nInterested candidates should be self-starters and should demonstrate strength in or a desire to build skills related to Grant Thornton’s core values of: Collaboration, Leadership, Excellence, Agility, Respect and Responsibility.\n<br><br>\n<b>Risk Advisory Qualifications:</b><br>\nBachelor’s degree in Accounting, Information Technology, MIS or related field. A Master’s degree is a plus.\n<br>Desire to pursue CPA, PMP, CISA, CISSP, CIA, CAMS, or CISM license/certification preferred\n<br>Major and overall GPA of 3.2/4.0\n<br>Ability to work additional hours as needed and travel 60%-100% as required\n<br><br>\nSkill Requirements\n<br><br>\nInterest to work cross functionally throughout different business processes within an organization\n<br>Excellent analytical, communication (written and verbal) and interpersonal skills\n<br>Strong technical aptitude and problem-solving skills\n<br>Effective project and time management skills for handling multiple priorities and simultaneous projects\n<br>Enthusiasm to learn through a combination of structured, on-the-job and self-directed training\n<br>Ability to work efficiently and effectively in a complex team environment\n<br>Desire to pursue applicable professional certification as outlined above\n<br>Exceptional client service and communication skills with a demonstrated ability to develop and maintain outstanding client relationships\n<br>Ability to manage multiple engagements and competing priorities in a rapidly growing, fast-paced, interactive, results-based team environment\n<br>Strong verbal, written, and presentation skills. Additionally, excellent analytical, organizational, and project management skills\n<br>As part of our Risk team you would help our clients assess their internal controls environment via Internal Audit, SOX Readiness / Compliance, Attestation and IT Certification projects. Risk Interns are exposed to various projects across Risk solutions, allowing the interns to discover the advisory services most suited to their skills and interests. Interns can expect to work closely with other staff, managers, and partners on all phases of the engagement lifecycle including planning, engagement management, and project wrap up. In addition, interns are expected to actively contribute to Risk business growth by identifying business development opportunities, participating in marketing and brand initiatives and assisting with development of Grant Thornton thought leadership.\n<br><br>\n<b>TRAINING:</b><br>\nGrant Thornton LLP provides both local and national training programs related to an individual’s job responsibilities. We are committed to ongoing professional development and we encourage individuals to attend outside training seminars.\n<br><br>\n<b>BENEFITS:</b><br>\nGrant Thornton LLP offers an outstanding opportunity for career growth and development, an attractive compensation and incentive program, generous benefits including immediate participation in our 401(k) plan, and a flexible work environment that offers individual enrichment opportunities in a team environment.\n<br><br>\nIt is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law.\n<br><br>\n<b>Requisition ID:</b> 047795\n<br><br>\nMinneapolis, MN\n<br>Minneapolis, Minnesota</div><div></div>",
        "index": 25,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Information Technology Summer Intern 2021",
        "company": "CoBank - 3.2",
        "location": {
            "city": "Denver",
            "state": "Colorado"
        },
        "posted": "2021-01-23T09:51:56.538Z",
        "url": "https://www.simplyhired.com/job/QYPzTpSrdWosHNnb7hU-TUtzO9AL94hsRM8vBGqkf-KAysmks7cWAw?q=computer+science",
        "lastScraped": "2021-01-25T09:51:56.538Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The CoBank Information Technology (IT) department supports the Bank’s business and strategic goals by providing high quality and cost effective technology based solutions to business problems. These solutions are delivered under a policy of strict Information Security compliance and with a high level of system functionality, availability, and reliability. This is a paid position for undergraduate and graduate students working toward a degree in Computer Science, Computer Engineering, Systems Engineering, Application Development, Innovation, or related discipline.\n<br><br>\nIn addition, various training courses are available throughout the summer for interns. A living stipend will be included.\n<br><br>\nThis 2021 summer intern position is located in our Denver office.\n<br><br>\nBasic Qualifications\n<br><br>\nHigh school diploma and 2-3 years relevant experience or education.\n<br>Currently enrolled in and working toward a degree in Computer Science, Computer Engineering, Systems Engineering, Application Development, Innovation, or related discipline.\n<br><br>\nPreferred Qualifications\n<br><br>\nBasic knowledge of the Java programming language, and the Object Oriented Programming concepts, experience writing java code using one of common IDEs: Eclipse, IntelliJ or Netbeans.\n<br>Experience writing API’s.\n<br>Aptitude for learning software applications.\n<br>Ability to perform research across multiple systems.\n<br>Ability to work independently and as part of a team.\n<br>Strong written and verbal communications.\n<br>Experience in banking or financial services industry.\n<br>A basic knowledge of cooperative principles.\n<br>Basic exposure and understanding of Apache Camel, the Java Spring Framework, Liferay DXP is a plus.\n<br><br>\nCompensation Information\n<br><br>\n<b>Estimated Base Salary Range:</b> $19/hr-$25/hr</div><div></div>",
        "index": 26,
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "machine learning"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Internship - Software Engineering, IT/Cyber-Security",
        "company": "SES - 3.6",
        "location": {
            "city": "Princeton",
            "state": "New Jersey"
        },
        "posted": "2021-01-23T09:51:56.932Z",
        "url": "https://www.simplyhired.com/job/WkS1FAbxvQgB7gf3OXOUUwhou-NlcIwxjB-zNMBibrSGs72VPJsXqQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:56.932Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This is an exciting opportunity to become part of the IT-Cyber-Security efforts for the Software Engineering team in a fast-paced, global organization within an innovative and unique industry. Based in Princeton, NJ, you will contribute to the improvement of its IT/Cyber-Security efforts and risk reductions as it relates to the software development and maintenance activities for the Ground Control System (GCS) used to fly 50+ satellites.\n<br><br>\nYour responsibilities\n<br><br>\nAutomate remediation/patching of identified Vulnerabilities for Software Engineering’s GCS and other systems and associated software through the use of it existing tools, including SuSE Manager.\n<br>Review Vulnerabilities and identify risk mitigation to determine what remediations have the most impact on reducing risk.\n<br>Standup/support/automate SuSE Manager and QRadar log forwarding\n<br><br>\nYour profile\n<br><br>\nBeing an advanced student in Computer Science, with a focus on IT/Cyber-Security\n<br>Strong interest in the media/telecommunication business and technical interest in satellites\n<br>Excellent analytical and judgment skills, experience with all aspects of IT/Cyber-Security including risk management, vulnerability management, patching/remediation, and Linux/Windows Log Forwarding\n<br>Experience with Linux command line, Linux scripting (bash), and MS-Windows scripting (preferably with Powershell)\n<br>Basic understanding of software development processes and practices\n<br>Ability to set priorities and to work under tight deadlines;\n<br>Work independently as well as in a team;\n<br>Easiness to communicate at all levels;\n<br>Fluency in spoken and written English with additional languages considered an asset.</div><div></div>",
        "index": 27,
        "skills": [
            "information technology",
            "software engineering",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "2021 Summer Intern - Software Engineer, Robotic Applications",
        "company": "Brain Corporation - 4.2",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2021-01-23T09:51:57.447Z",
        "url": "https://www.simplyhired.com/job/Uj4w5uScFyjdTJCD_nOHMdSQ-cNt1K7qyOOD3N67HA4xHQVAwGp4kg?q=computer+science",
        "lastScraped": "2021-01-25T09:51:57.447Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Brain Corp is a San Diego-based AI company creating transformative core technology for the robotics industry. Our diverse teams in Software, Hardware Design, and Embedded Systems are creating comprehensive solutions to support the builders of today's autonomous machines in successfully producing, deploying, and supporting commercial robots across industries and applications. Brain Corp is funded by the SoftBank Vision Fund and Qualcomm Ventures. For more information please visit: https://www.braincorp.com/\n<br><br>\n<b>Position Summary:</b><br>\nAs a member of the Robotics Application team, the Software Engineer Intern will participate in Brain’s development of intelligent, autonomous navigation systems for use in everyday machines. The position is located at Brain’s San Diego Headquarters with a US remote option.\n<br><br>\n<b>Anticipated Project Areas &amp; Learning Opportunities:</b><br>\nNew visualizations and tooling development\n<br>Robot simulation infrastructure development\n<br>Contribute to core infrastructure development\n<br>Assist with new robot applications\n<br>Other duties and projects as assigned\n<br><br>\n<b>We offer:</b><br>\nHands on experience working with an array of robots that operate in the real world at production scale\n<br>Casual, fun work environment\n<br>Business focused project that will challenge you\n<br>Potential for career growth\n<br>Participation in the design and development of the largest fleet of commercial mobile robots operating in public spaces\n<br><br>\n<b>We are seeking someone that:</b><br>\nIs studying computer science, computer engineering, robotics, or electrical engineering\n<br>Experience in Python and/or C++ in a Linux Environment\n<br>Available for the period of 3 months, approximately (June - August 2021)\n<br>Additional qualifications here and below\n<br>Has enthusiasm for the robotics industry and eagerness to work on new &amp; challenging technologies and projects\n<br><br>\n<b>Physical Demands:</b><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, grasp, and feel; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; lift, push, carry, or pull up to 10 pounds.\n<br><br>\n<b>Work Environment:</b><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate, though the sound level may be elevated at times in the lab. Employee is exposed to the typical office environment with computers, printers and telephones.</div><div></div>",
        "index": 28,
        "skills": [
            "machine learning",
            "software engineering",
            "information technology",
            "robotics",
            "data visualization",
            "hardware",
            "c and c++",
            "project management",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Internship - Software Engineer",
        "company": "SES - 3.6",
        "location": {
            "city": "Princeton",
            "state": "New Jersey"
        },
        "posted": "2021-01-23T09:51:57.838Z",
        "url": "https://www.simplyhired.com/job/JPrHW28h_kRc0o6_jyUPPE7QBxZnI_MlJhZYb1sUG1enWqjO-3wgbA?q=computer+science",
        "lastScraped": "2021-01-25T09:51:57.838Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This is an exciting opportunity to become part of the Software Engineering team in a fast-paced, global organization within an innovative and unique industry. Based in Princeton, NJ, you will contribute to the software development and maintenance activities for the Ground Control System (GCS) used to fly 50+ satellites.\n<br><br>\nYou will contribute the start of service of the SES17 satellite and the mPower fleet (7 satellites) by assisting with our cloud platform transformation.\n<br><br>\nYour responsibilities\n<br><br>\nGain an understanding in Cloud Native development and engineering practices;\n<br>Develop end-to-end functioning prototypes using Cloud platforms like Microsoft Azure;\n<br>Document and model aspects of engineering cost analyses for prototypes.\n<br><br>\nYour profile\n<br><br>\nBeing an advanced student in Computer Science, Software Engineering or in a relevant technical area;\n<br>Strong interest in the media/telecommunication business and technical interest in satellites;\n<br>Excellent analytical and judgment skills;\n<br>Experience with different programming languages (i.e. C, C++, C#, Python, Java, etc);\n<br>Experience with Integrated Development Environments (IDE) (i.e. Eclipse, IntelliJ, Visual Studio, etc) and Microsoft Office Suite;\n<br>Configuration management experience a plus (i.e. Git, BitBucket, GitHub, GitLab)\n<br>Basic understanding of software development processes and practices\n<br>Ability to set priorities and to work under tight deadlines;\n<br>Work independently as well as in a team;\n<br>Easiness to communicate at all levels;\n<br>Fluency in spoken and written English with additional languages considered an asset.</div><div></div>",
        "index": 29,
        "skills": [
            "software engineering",
            "java",
            "data visualization",
            "python",
            "c and c++",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "IT Internship",
        "company": "H3 Biomedicine - 4.7",
        "location": {
            "city": "Cambridge",
            "state": "Massachusetts"
        },
        "posted": "2021-01-23T09:51:58.228Z",
        "url": "https://www.simplyhired.com/job/QaBraPJMwUo3ksPaWXXlSKKmhjQZ9XTtMGXQK2Jwv-JenJtAK3suxQ?q=computer+science",
        "lastScraped": "2021-01-25T09:51:58.228Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Location:</b> Cambridge MA\n<br><br>\n10-12 week paid internship\n<br><br>\nH3 Biomedicine is searching for a dynamic summer/fall intern to join our growing IT team. The intern will be supporting the studies and analysis of our IT programs. The successful candidate will have the chance to interact and collaborate cross-functionally with scientists in different departments including biology, chemistry, and biochemistry. S/he will also have the chance to participate in team meetings and observe the IT process. This is a great opportunity for a student who wants to work in IT, specifically in precision medicine.\n<br><br>\nPrincipal Duties and Responsibilities\n<br>Support the I&amp;T team in maintaining hardware, software, and other systems\n<br>Assist with troubleshooting issues and provide technical support\n<br>Organize and maintain IT resources\n<br>Lend IT support in areas such as cybersecurity, programming, analytics, and data center management\n<br>Qualifications\n<br>In a degree seeking program with a major is Computer Science, or a related field.\n<br>Strong verbal and written communication\n<br>Excellent analytical and problem-solving skills\n<br>Ability to work well in teams\n<br>Strong work ethic and attention to detail\n<br>About H3 Biomedicine Inc.\n<br><br>\nH3 Biomedicine Inc. is a privately-held, uniquely-structured oncology discovery enterprise whose sole mission is to become a prolific source of new drugs that treat more human cancers with greater success. H3 Biomedicine is applying the expertise of leading scientists to the integration of insights from cancer genomics with innovative capabilities in synthetic chemistry and tumor biology to pursue the most promising current opportunity in cancer therapeutics: patient-based, genomics-driven, small molecule drugs.\n<br><br>\nSubmit Your Resumé</div><div></div>",
        "index": 30,
        "skills": [
            "information technology",
            "hardware",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "2021 Summer Intern - Software QA & Automation Engineer",
        "company": "Brain Corporation - 4.2",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2021-01-23T09:51:58.637Z",
        "url": "https://www.simplyhired.com/job/NE8_7paiXztOQxuFudi7v5IaaFSjxlF2GIRQEliXcF27X7rjdv2O0g?q=computer+science",
        "lastScraped": "2021-01-25T09:51:58.637Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Brain Corp is a San Diego-based AI company creating transformative core technology for the robotics industry. Our diverse engineering teams in Software, Hardware Design, and Embedded Systems are creating comprehensive solutions to support the builders of today's autonomous machines in successfully producing, deploying, and supporting commercial robots across industries and applications. Brain Corp is funded by the SoftBank Vision Fund and Qualcomm Ventures. For more information please visit: https://www.braincorp.com/\n<br><br>\n<b>Position Summary:</b><br>\nAs a member of the Software QA &amp; Automation Engineering team, the Software QA &amp; Automation Engineer Intern will participate in Brain’s development of intelligent, autonomous navigation systems for use in everyday machines. The position is located at Brain’s San Diego Headquarters with a US remote option.\n<br><br>\n<b>Anticipated Project Areas &amp; Learning Opportunities:</b><br>\nTest automation for autonomous mobile robotics software\n<br>Develop end-to-end test execution framework with scheduler, analytics &amp; reporting integrated with our cloud system\n<br>Test development for Navigation, Computer Vision, Object detection &amp; Localization features\n<br>Work collaboratively with Systems, SW, HW engineers for developing SW test automation critical to our business needs.\n<br>Other duties and projects as assigned\n<br><br>\n<b>We offer:</b><br>\nHands on experience with autonomous mobile robotics software, firmware and hardware systems\n<br>Casual, fun work environment\n<br>Business focused project that will challenge you\n<br>Potential for career growth\n<br>Participation in the design and development of the largest fleet of commercial mobile robots operating in public spaces\n<br><br>\n<b>We are seeking someone that:</b><br>\nIs studying computer science, computer engineering, or robotics engineering\n<br>Has experience in building software with Python\n<br>Available for the approximate period of May-September 2021\n<br>Additional qualifications here and below\n<br>Has enthusiasm for the robotics industry and eagerness to work on new &amp; challenging technologies and projects\n<br><br>\n<b>Things that make a difference:</b><br>\nSelf driving systems and software\n<br>Systems and software testing\n<br>Excellent technical communication skills\n<br><br>\n<b>Physical Demands:</b><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, grasp, and feel; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; lift, push, carry, or pull up to 10 pounds.\n<br><br>\n<b>Work Environment:</b><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate, though the sound level may be elevated at times in the lab. Employee is exposed to the typical office environment with computers, printers and telephones.</div><div></div>",
        "index": 31,
        "skills": [
            "machine learning",
            "software engineering",
            "information technology",
            "data visualization",
            "hardware",
            "robotics",
            "project management",
            "python"
        ],
        "remote": true
    },
    {
        "position": "WordPress Developer Intern",
        "company": "Saisystems International - 3.8",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-23T09:51:59.051Z",
        "url": "https://www.simplyhired.com/job/R7-qRsFXS3u98C5I37KnAJpchMzL5QnbJNVX_W6n0G6_jxNePpNnEg?q=computer+science",
        "lastScraped": "2021-01-25T09:51:59.051Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Saisystems is looking for a WordPress Developer and Web Content Management Intern. This career opportunity will place you directly in a fast-paced and truly exciting work environment where you will continually increase your knowledge and improve your skill set by working on a variety of projects.</p><p>If you are looking for a challenging opportunity - apply today and be part of one the BEST PLACES TO WORK! The responsibilities of this position include but are not limited to:</p><ul><li>Create WordPress websites</li><li>Configure and maintain websites</li><li>Work in WordPress, manage the content, create documentation, create posts, articles, pages</li><li>Work on blogs (Create/add/update news and topics)</li><li>Research, extract and analyze required data from Google</li></ul><p>The qualifications for this position include:</p><ul><li>Concurrently enrolled in a University pursuing a degree in Computer Science, Information Systems, or related field</li><li>Experience with modern web development techniques &amp; technologies: JavaScript, HTML5, CSS3, jQuery, WordPress, Themes</li><li>Experience in Adobe Photoshop Photoshop Illustrator, and/or InDesign</li><li>Experience in search engine optimization (SEO)</li><li>Strong Communication (understanding &amp; explaining business logic and technical concepts)</li><li>Very strong research skills</li><li>Desire to learn fast, self-motivated and organized</li><li>Experience in MS Word, Excel, PowerPoint</li><li>Understanding of File Sharing Platforms (Google-Drive, Dropbox)</li><li>Time management and planning skills</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Experience:</p><ul><li>JavaScript, HTML5, CSS3, jQuery, WordPress: 1 year (Required)</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>No: Not providing sponsorship for this job</li></ul><p>Company's website:</p><ul><li>www.saisystems.com</li></ul><p>Company's Facebook page:</p><ul><li>https://www.facebook.com/saisystemstechnology/</li></ul></div><div></div>",
        "index": 32,
        "skills": [
            "project management",
            "information technology",
            "javascript",
            "machine learning",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Intern",
        "company": "Offerpad - 4.5",
        "location": {
            "city": "Arizona",
            "state": "Arizona"
        },
        "posted": "2021-01-23T09:52:01.617Z",
        "url": "https://www.simplyhired.com/job/GjvNE0JEzsnLSz1tJMhfqYptqsVBzek5GlECnjM37u7vQNCivIg_LA?q=computer+science",
        "lastScraped": "2021-01-25T09:52:01.617Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Job Description:</b><br>\nPosition Summary\n<br><br>\nThe Software Engineering Intern at Offerpad will work on innovative solutions and high-quality products that touch thousands of homeowners and home sellers every day across our Markets including those utilized daily by our own employees. The SW Engineering Intern will use his/her technical talent and programming skills, as well as their passion for systems to learn and understand our products and services and support the design and development work required to push our technology forward with respect to functionality, performance, reliability, and scalability. This employee will work alongside internal engineering talent to learn our tech stack and agile philosophy at Offerpad and will participate in projects that will help them understand development, design, search, platform, test, quality, big data, front end and back end. The incumbent will help design and build new platforms, improve existing products, and develop enhancements to systems required in providing the best way to buys and sell a home\n<br><br>\nEssential Functions\n<br><br>\nUnder the guidance of Offerpad Tech Team Leadership you will learn, support, and be given tasks and projects related to the following:\n<br><br>\nBuilding and maintaining our internal home buying platform and customer facing websites, which are built on the latest technologies, including Azure Cloud Services, .NET Core 2.0, ReactJS.\n<br>Streamlining our business processes through automation and integration with external applications through web services, RESTful APIs and other technologies.\n<br>Contributing to our suite of front &amp; back-end automated tests scripts.\n<br>Shadowing and attaining tasks from engineering team members\n<br>Working closely with the Marketing &amp; Business Teams to learn about, work on and even implement new features.\n<br><br>\n<b>Required Experience:</b><br>\nMinimum Qualifications\n<br><br>\nMust have 2+ years of completed college level coursework and actively pursuing a Bachelor of Science level degree in Computer Science, Software Engineering or related College Program\n<br>High School Diploma\n<br>You have a high EQ (emotional intelligence) and able to effectively work well with others, fostering a great, collaborative, and fun environment, even amidst technical challenges\n<br>Strong work ethic, ability to learn quickly and adapt to change\n<br>Excellent communication (oral and written) skills\n<br>Ability to take initiative and work independently to establish and manage work priorities, activities and timelines to achieve results\n<br>Exhibits sound judgment and swift decision-making skills\n<br>Exhibit strong attention to detail\n<br>Ability to think creatively and come up with solutions\n<br>Ability to critically review, summarize, and report findings and recommendations\n<br>PC skills including working knowledge of the Microsoft environment and the ability to access, manipulate, organize and relay information in a meaningful way.\n<br>Coursework with experience using the following programing languages/technologies:\n<br>C# &amp; .NET MVC, .NET Core\n<br>JavaScript &amp; modern JS frameworks (React, Angular, Vue)\n<br>HTML5 &amp; CSS3\n<br>T-SQL\n<br>An understanding of the Agile Team Concept (Scrum with XP best practices) and an interest in working with and understanding the business\n<br>Ability to work in a fast-paced team environment.\n<br><br>\nPreferred Qualifications\n<br><br>\nCoursework, knowledge, and/or experience with any of the following a plus:\n<br>Real Estate Industry\n<br>front-end automated testing frameworks\n<br>Azure and other Microsoft Cloud services\n<br>PHP &amp; MySQL\n<br>AWS &amp; Lambda functions\n<br><br>\n<b>What we have to offer:</b><br>\nCompetitive Compensation\n<br>Opportunity to enroll in Health/Dental/Vision and Retirement Plan\n<br>Mileage Reimbursement (where applicable for role)\n<br>Strong, collaborative team environment\n<br>Offerpad is an EOE, AA/M/F/IWD/protected veterans\n<br><br>\n<b>From:</b> Offerpad</div><div></div>",
        "index": 33,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "angular",
            "javascript"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Co-op",
        "company": "SetPoint Medical -",
        "location": {
            "city": "Valencia",
            "state": "California"
        },
        "posted": "2021-01-23T09:52:01.897Z",
        "url": "https://www.simplyhired.com/job/4pfJvKPVmo9CkXj6imbf3f7g95-MukjlcfQOMRwE2kH8XEFmkOJH5A?q=computer+science",
        "lastScraped": "2021-01-25T09:52:01.897Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Position Description: </b></p><p>SetPoint Medical is seeking a highly motivated and self-driven Computer Science, Software Engineering, or Computer Information Systems student to work on a sophisticated active implantable device for their co-op or externship. Responsibilities may include, depending on the student’s skillset, any part of the software development stack (from low-level embedded code to high-level cloud development). This is a full-time, off-site position. Co-op position up to 1 year.</p><p>The student will work closely with senior engineers to receive training and mentorship. Compensation will vary significantly depending on the student’s skillset, completed education, and relevant past experience.</p><p><b>All candidates will be required to present a digital portfolio of relevant work experience, personal projects, and/or academic accomplishments. Portfolios should include screenshots of programs and websites the candidate has created, code examples, documentation examples, and/or anything else that highlights the candidate’s skills. Candidates that cannot present a portfolio need not apply.</b></p><p><b>Job Responsibilities: </b><br>Responsibilities will vary depending on the Software Engineer’s skillsets, but may include:</p><p>· Writing mobile applications for iOS or Android. iOS applications use the Swift language, and Android applications will use Java</p><p>· Writing Windows desktop applications in C# using WPF and .NET Core</p><p>· Server-side programming using ASP.NET with C#</p><p>· Low-level embedded programming with C and C++</p><p>· Participate in planning, requirements analysis, architecture and specification design, and verification processes</p><p>· Actively communicate and engage with other departments (e.g., electrical and mechanical engineering, regulatory, quality, etc.) to develop a robust and controlled product</p><p><b>Minimum Qualifications: </b><br>· Applicants should be pursuing a degree in Computer Science or related major. Undergraduate students must be, at a minimum, in their third year of coursework.</p><p>· Proficiency and experience with object-oriented programming. Knowledge of C#, Swift, Java, and/or C++ is preferred.</p><p>· Applicants should have some prior experience in creating applications, either mobile or desktop, including applications created for personal or academic projects.</p><p>· Experience with developing and debugging in professional IDEs (e.g., Visual Studio, Xcode, Eclipse, etc.)</p><p>· Familiarity with relational or non-relational database design principals</p><p>· Familiarity with client/server programming and architecture</p><p>· Must be clear a communicator and strong writer, as working in the medical device field requires detailed and thorough documentation</p><p><b>Preferred Qualifications: </b><br>The following qualifications are all a plus, but not necessarily required:</p><p>· Experience and/or study in advanced topics such as multi-threaded programming, data science and machine learning, cybersecurity, advanced database design, etc.</p><p>· Experience in graphic design, and familiarity with raster and vector design tools (e.g., Photoshop and Illustrator)</p><p>· Familiarity with unit testing and user interface testing frameworks</p><p>· Experience with Class II/III medical devices</p><p>· Relevant work experience</p><p><b>Location: </b><br>Company Headquarters in Valencia, CA</p><p><b>Company Description: </b><br>SetPoint Medical is an early-stage medical device company developing the first implantable bioelectronic device for the treatment of chronic inflammatory diseases.</p><p>Job Types: Full-time, Internship</p><p>Pay: $18.00 - $20.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>Experience:</p><ul><li>creating applications either mobile or desktop: 1 year (Preferred)</li><li>object-oriented programming: 1 year (Preferred)</li></ul><p>This Job Is Ideal for Someone Who Is:</p><ul><li>Dependable -- more reliable than spontaneous</li></ul><p>Company's website:</p><ul><li>www.setpointmedical.com</li></ul></div><div></div>",
        "index": 34,
        "skills": [
            "machine learning",
            "software engineering",
            "java",
            "data visualization",
            "c and c++",
            "project management",
            "information technology",
            "mobile development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern - IT",
        "company": "Capital Metro - 3.5",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2021-01-23T09:52:02.397Z",
        "url": "https://www.simplyhired.com/job/jJdA-_dQGzrTFUE7ilYW7FhlzRC5e5CNR3ppYTHwLXfuhrv54enwdA?q=computer+science",
        "lastScraped": "2021-01-25T09:52:02.397Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The Intern, Help desk position reports directly to the Manager, Service Delivery. This position will perform professional support work in the Information Technology Department and will work with the Help Desk team in configuring, deploying and retiring desktops/laptops.\n<br><br>\n<b>PRIMARY RESPONSIBILITIES:</b><br>\n<ul><li>Customer Service</li><li>Delivers, tags, and assists in the configuration of end-user PC desktop hardware, software and peripheral equipment.</li><li>Executes PC retirement process for End-of-Life computer equipment</li><li>Organizes PC Stock room</li><li>Identifies, diagnoses and resolves Level I problems for users of personal computer software and hardware, agency network, the internet and new computer technology in a call center environment and communicates solutions to end users</li><li>Support Capital Metro’s safety culture by following safety and security policies, considering safety in every action and reporting safety and security concerns.</li><li>Perform other duties as required and/or assigned.</li></ul>\n<b>MINIMUM QUALIFICATIONS:</b><br>\n<ul><li>High school diploma or equivalent</li><li>Must be currently enrolled in a degree program at a college or university</li><li>Enrollment in an information technology degree program is preferred.</li></ul>\n<b>KNOWLEDGE SKILLS AND ABILITIES:</b><br>\n<ul><li>Knowledge of Microsoft Windows architecture, of customer service and working team concepts.</li><li>Proficient in Microsoft Office Suite</li><li>Desktop operating systems, various software applications and basic hardware for the PC; principles and theories of network systems and management; Internet technologies and products.</li><li>Good oral and written communication skills and ability to establish and maintain effective working relationships.</li><li>Ability to coordinate several diverse job requirements and projects.</li><li>Ability to lift and carry 70 lbs. with assistance</li></ul>\nCAPITAL METRO IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER.\n<br><br>\nPAY RANGE - 11.00 - 18.00 - HOURLY</div><div></div>",
        "index": 35,
        "skills": [
            "project management",
            "information technology",
            "hardware",
            "networks",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Johnson Controls - 3.7",
        "location": {
            "city": "Milwaukee",
            "state": "Wisconsin"
        },
        "posted": "2021-01-23T09:52:02.900Z",
        "url": "https://www.simplyhired.com/job/pRQHJcBvuDDvjaYFsOWjjBd2QexIcLFbjttdhneBuAA3D7K-7vqrpg?q=computer+science",
        "lastScraped": "2021-01-25T09:52:02.900Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Software Engineering Intern - WD30107595020\n<br><br>\nWhat you will do\n<br><br>\nJoin our team as a Technical Intern for one or more Agile teams that develop the next generation of Building Automation System products. We develop products such as the Metasys Building Automation System (BAS) to help our global customers (e.g., hospitals, universities, iconic skyscrapers) manage their building energy efficiency.\n<br><br>\nHow you will do it\n<br><br>\nAttending team discussions on requirements, design implementation\n<br>Developing software prototypes, software modules, and unit tests\n<br>Configuring and maintaining test labs and performing software tests\n<br>Technology and third part tool research\n<br><br>\nQualifications\n<br><br>\nWhat we look for\n<br><br>\nRequired\n<br><br>\nKnowledge of modern software programming concept\n<br>Strong programming skills using one or more programming languages\n<br>Strong analytical and problem solving skills\n<br>Strong oral and written communication skills\n<br>Fast learner with a strong desire to learn\n<br>Perform well both on a team and independently under guidance\n<br>Currently pursuing a Bachelor's degree/Master's degree in Computer Science, Software Engineering or Mathematics\n<br><br>\nPreferred\n<br><br>\nKnowledge of modern software engineering process such as Scrum is desired\n<br><br>\nJohnson Controls is an equal employment opportunity and affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, status as a qualified individual with a disability, or any other characteristic protected by law. For more information, please view EEO is the Law. If you are an individual with a disability and you require an accommodation during the application process, please visit www.johnsoncontrols.com/tomorrowneedsyou.\n<br><br>\nJob Administration\n<br>Primary LocationUS-WI-Milwaukee\n<br>Organization Bldg Technologies &amp; Solutions</div><div></div>",
        "index": 36,
        "skills": [
            "information technology",
            "software engineering",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Information Technology Summer Intern",
        "company": "Wade Trim - 3.6",
        "location": {
            "city": "Taylor",
            "state": "Michigan"
        },
        "posted": "2021-01-23T09:52:03.297Z",
        "url": "https://www.simplyhired.com/job/tt4vyZhtDhv02JgHBP-wEEFdWA7TuvQ2DuVz15CveZMsRsAMnJHHrA?q=computer+science",
        "lastScraped": "2021-01-25T09:52:03.297Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Candidates must be pursuing a bachelor's degree in Information Technology, Engineering, or a related field. Working knowledge of Microsoft Office Suite Package, the desire to learn, and the ability to work independently is required. Candidates should be familiar to typical programming languages. Typical responsibilities include:\n<br>Work on assigned projects\n<br>Assist members of the IT group\n<br>Maintain records/files\n<br>Assist end users\n<br>Maintain excellent client relations\n<br>Maintain a safe working environment</div><div></div>",
        "index": 37,
        "skills": [
            "information technology",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Internship Opportunities for Students attending NSBE 47 Conference – Software Engineer",
        "company": "Microsoft - 4.2",
        "location": {
            "city": "Redmond",
            "state": "Washington"
        },
        "posted": "2021-01-23T09:52:03.733Z",
        "url": "https://www.simplyhired.com/job/UgMKExKX9MFyB4TPbBZP5CvzVE4iZaheb-mqkJqV0zz2A11lV4YnRg?q=computer+science",
        "lastScraped": "2021-01-25T09:52:03.733Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Interviews for the position below will be conducted in partnership with our registration at NSBE 47. To be considered, applicants must confirm their registration to NSBE 47.\n<br><br>\n<b>Note:</b> Microsoft will not support the cost of conference attendance.\n<br><br>\nIf you are interested in Internship Software Engineering Roles at Microsoft but are not registered for the above conference, please apply to Job Number: 870957.\n<br><br>\n<b>Overview:</b><br>\nSoftware engineers at Microsoft are passionate about building technologies that make the world a better place. At Microsoft, you will collaborate with others to solve problems and build some of the world's most advanced services and devices. Your efforts on the design, development, and testing of next-generation applications will have an impact on millions of people.\n<br><br>\nDo you want to work on a meaningful and impactful project and make a difference?\n<br><br>\nAre you willing to learn from others and open to new ideas?\n<br><br>\nDo you want to support others to succeed and operate in a highly-collaborative and global environment?\n<br><br>\nIf this sounds like you, Microsoft would like to invite you to come join us as you are, where you can find more than just a job.\n<br><br>\nRead on to learn more about opportunities and apply online!\n<br><br>\nResponsibilities\n<br><br>\nSoftware Engineer\n<br><br>\nSoftware engineers (SWEs) collaborate with a committed team to design, develop and test the next generation of technology solutions for millions of people.\n<br><br>\nYou are passionate about customers and product quality, and you provide technical guidance to Program Managers as they consider user needs and product requirements. You will also be expected to demonstrate an ability to learn and adopt relevant new technologies, tools, methods and processes to leverage in your solutions.\n<br><br>\nAs a SWE, you are dedicated to building software to empower every person and organization on the planet to achieve more.\n<br><br>\nQualifications\n<br>Currently pursuing bachelor’s, master’s, or PhD degree in engineering, computer science or related field with at least one semester/quarter remaining after internship\n<br>A year or two of experience programming in C++, Java or other computer programming languages preferred.\n<br>Ability to demonstrate understanding of algorithms, data structures and other systems architecture factors that affect code quality, performance and customer experience\n<br>Some experience building software outside of the classroom environment like an internship, hackathon, research project or related experience preferred\n<br>Demonstrated skill in time management and completing software projects in a cooperative team environment\n<br><br>\nApplications to these opportunities are considered for all available Software Engineering roles including the one described above, depending on education level and/or location.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</div><div></div>",
        "index": 38,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "c and c++",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Error",
        "company": "Brain Corporation - 4.2",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "posted": "2021-01-23T09:52:04.053Z",
        "url": "https://www.simplyhired.com/job/b5w7kTb6alwysXcSHxzG0AqODuuqQc_WvCIt_ysdaK2rCigKQ6NGCg?q=computer+science",
        "lastScraped": "2021-01-25T09:52:04.053Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Brain Corp is a San Diego-based AI company creating transformative core technology for the robotics industry. Our diverse engineering teams in Software, Hardware Design, and Embedded Systems are creating comprehensive solutions to support the builders of today's autonomous machines in successfully producing, deploying, and supporting commercial robots across industries and applications. Brain Corp is funded by the SoftBank Vision Fund and Qualcomm Ventures. For more information please visit: https://www.braincorp.com/\n<br><br>\n<b>Position Summary:</b><br>\nAs a member of the BrainOS Platform team, the Software Engineer Intern will participate in Brain’s development of intelligent, autonomous navigation systems for use in everyday machines. The position is located at Brain’s San Diego Headquarters with a US remote option.\n<br><br>\n<b>Anticipated Project Areas &amp; Learning Opportunities:</b><br>\nNew visualizations and tooling development\n<br>Robot simulation infrastructure development\n<br>Contribute to core infrastructure development\n<br>Assist with new robot applications\n<br>Other duties and projects as assigned\n<br><br>\n<b>We offer:</b><br>\nHands on experience working with an array of robots that operate in the real world at production scale\n<br>Casual, fun work environment\n<br>Business focused project that will challenge you\n<br>Potential for career growth\n<br>Participation in the design and development of the largest fleet of commercial mobile robots operating in public spaces\n<br><br>\n<b>We are seeking someone that:</b><br>\nIs studying computer science, computer engineering, robotics, or electrical engineering\n<br>Experience in Python and/or C++ in a Linux Environment\n<br>Available for the period of 3 months, approximately June - August 2021\n<br>Additional qualifications here and below\n<br>Has enthusiasm for the robotics industry and eagerness to work on new &amp; challenging technologies and projects\n<br><br>\n<b>Physical Demands:</b><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, grasp, and feel; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; lift, push, carry, or pull up to 10 pounds.\n<br><br>\n<b>Work Environment:</b><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate, though the sound level may be elevated at times in the lab. Employee is exposed to the typical office environment with computers, printers and telephones.</div><div></div>",
        "index": 39,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "data visualization",
            "hardware",
            "robotics",
            "c and c++",
            "project management",
            "python"
        ],
        "remote": true
    },
    {
        "position": "2021 - Technology Internship Program (Engineering)",
        "company": "CNA Insurance - 3.6",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2021-01-23T09:52:04.459Z",
        "url": "https://www.simplyhired.com/job/Ce53FyrqNE3YlqSZqUhgyInVij7Dvo3yHkO3Q7tcUaVLWlA3JoeS8g?q=computer+science",
        "lastScraped": "2021-01-25T09:52:04.459Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">2021 - Technology Internship Program (Engineering)-ADM0002IE\n<br>Description\n<br><br>\nTechnology Internship Program (Engineering)\n<br><br>\nAs one of the country’s largest writers of commercial and specialty insurance, CNA depends on the talent, expertise and enthusiastic engagement of our employees. We provide insurance protection to more than 1 million businesses and professionals in the U.S. and internationally, offering unique expertise for the businesses and industries we serve. Our commitment to diversity and inclusion enables us to serve a broad range of customers while supporting our communities through charitable contributions and employee volunteerism.\n<br><br>\nCNA’s Tech Summer Internship Program is looking to create a team of interns for a dynamic and fast pace 10-12 week training program that provides hands on experience and unique opportunities across a variety of technologies. Interns will have experiences in areas such as Application Development and Dev Ops while working with Agile methodologies and tools.\n<br><br>\n﻿\n<br><br>\n<b>Program Features and Benefits:</b><br>\nChallenging, innovative assignments that provide real-world experience in applying technical education to technology projects\n<br>Work directly with experienced CNA developers to learn the eXtreme Programming methodology\n<br>Apply software engineering best practices such as Test Driven Development (TDD)\n<br>Use Public Cloud platforms to create business applications and services.\n<br>In-depth education in technology, the insurance industry, CNA’s organization and how Technology plays a leading role in an insurer’s profitability\n<br>A dedicated manager and a mentor who will guide you throughout your internship program at CNA\n<br>Opportunities to meet with members of our senior leadership team and learn about their personal experiences in Technology within the insurance industry\n<br>Professional and personal development activities and ongoing feedback and coaching on performance\n<br>Consideration for potential full-time placement upon graduation\n<br><br>\n<b>Required Knowledge, Skills and Experience:</b><br>\nMust be a sophomore, junior or senior (undergraduate) or in first year of Masters program pursuing a degree in Computer Science, Computer Engineering or related field\n<br>A minimum 3.00 GPA is required (overall and major)\n<br><br>\n<b>Computer Science courses in:</b><br>\nObject-oriented language(s), Java preferred\n<br>Data Structures\n<br>Web Development\n<br>SQL and Database Fundamentals\n<br>Knowledge of Information Security and Application Security\n<br>Knowledge of Systems and Network Architecture\n<br>Interest in the Insurance Industry\n<br>Some previous work experience preferred\n<br>Ability to work independently as well as in a team environment, and the ability to cultivate and maintain positive business relationships\n<br>Strong organizational skills\n<br>Excellent interpersonal and communication skills\n<br>Effective problem solving, analytical aptitude, learn quickly and embrace change\n<br>Ability to learn and change quickly\n<br>Demonstrated leadership ability\n<br><br>\nCNA is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, marital status, sexual orientation or veteran status in employment opportunities\n<br><br>\nAbout CNA Insurance\n<br><br>\nWe offer an environment that challenges you to learn, to use your imagination and to gain professional experience as part of a team of bright individuals.\n<br><br>\nFor more than a century, CNA has built relationships with agents and brokers to meet the insurance needs of businesses of any size. Our senior management team consists of proven, experienced insurance leaders who are committed to developing long-term relationships with our customers and producers. Headquartered in Chicago, CNA has offices throughout the U.S., Canada and Europe. In these locations, we work with highly professional independent agents and brokers to ensure our customers receive the personal service and attention they look for in a carrier. At CNA, our mission and vision is to focus on what we do best — providing insurance solutions that allow our customers to better manage their risks and grow profitably. \"Our vision for CNA is simple. We offer more than just a policy — we deliver distinctive insurance solutions and we promise a superior customer experience.\" — Dino E. Robusto, CNA Chairman &amp; Chief Executive Officer At CNA, we focus on what we do best — providing insurance solutions that allow our customers to better manage their risks and grow profitably. We use our expertise to continually evolve our products and services to anticipate and address our customers' needs. Our broad portfolio enables us to respond to a wide range of business risks while focusing on the specialized needs of our insureds in construction, manufacturing, technology, healthcare, professional services, financial institutions and small business.\n<br><br>\nJob Administration\n<br>Primary LocationUnited States-Illinois-Chicago\n<br>Organization Operations Executive\n<br><br>\nJob Posting Jan 22, 2021\n<br>Unposting Date Ongoing</div><div></div>",
        "index": 40,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "sql",
            "java",
            "networks",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Error",
        "company": "Error",
        "location": {
            "city": "Error",
            "state": "Not Available"
        },
        "posted": "2021-01-25T09:52:04.900Z",
        "url": "https://www.simplyhired.com/job/NRUze1sVNFtuSHzyQ_BnpXNlyG67GKiWZrllI_4qJzib0j1dxbsMkQ?q=computer+science",
        "lastScraped": "2021-01-25T09:52:04.900Z",
        "description": "Error",
        "index": 41,
        "skills": [],
        "remote": false
    }
]