[
    {
        "position": "Software Engineer Intern - Research (Common Lisp) - Summer 2021",
        "company": "GrammaTech, Inc.",
        "location": {
            "city": "Ithaca",
            "state": "New York"
        },
        "posted": "2020-11-30T12:23:27.259Z",
        "url": "https://stackoverflow.com/jobs/465279/software-engineer-intern-research-common-lisp-grammatech-inc?a=2w2utW0pBvUc&so=i&pg=1&offset=0&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "project management"
        ],
        "lastScraped": "2020-12-21T12:23:27.259Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>Overview</strong></p>\n<p>GrammaTech’s internship program offers students the opportunity to gain real experience in a friendly, open, and supportive environment. We choose projects based on real needs, and interns work closely with engineers to make sure that projects are completed successfully.</p>\n<p>GrammaTech will conduct a series of programming tests and screening interviews as part of our process.&nbsp; There are multiple positions available and a position will remain posted until all roles are filled.</p>\n<p><strong>Location:</strong>&nbsp; Remote in the USA only with a possibility (if restrictions are lifted) of being located in our Ithaca, NY office for the summer.&nbsp; (COVID Restrictions will be considered as we get closer to the summer.)</p>\n<p><strong>Responsibilities</strong></p>\n<p>Research projects at GrammaTech can take on a wide variety of topics and challenges. Projects focus on software assurance, software protection, reverse engineering, and software transformation. We do both static and dynamic analysis on both source and object code, in order to tackle serious problems with practical solutions.</p>\n<p>Potential projects include:</p>\n<ul>\n<li>Apply compiler optimizations to binaries. Develop some classic compiler optimizations on top of our Binary IR (<a href=\"https://grammatech.github.io/gtirb/\" rel=\"nofollow\" target=\"_blank\">https://grammatech.github.io/gtirb</a>)</li>\n<li>Develop source-code program transformations for refactoring, optimization, and diversification on top of our Software Evolution Library (<a href=\"https://grammatech.github.io/sel\" rel=\"nofollow\" target=\"_blank\">https://grammatech.github.io/sel</a>)</li>\n<li>Design and run large-scale experiments evaluating automated software modification and automated software engineering tools</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<p><u>Required</u></p>\n<ul>\n<li>Currently enrolled in a BS, MS, or PhD in Computer Science</li>\n<li>Excellent programming skills with Common LISP</li>\n</ul>\n<p><u>Preferred</u></p>\n<ul>\n<li>Enrollment in a Computer Science PhD program</li>\n</ul>            </div>",
        "index": 1,
        "remote": true
    },
    {
        "position": "Web Software Engineer Intern - Summer 2021",
        "company": "Vail Systems Inc.",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2020-11-21T12:23:27.999Z",
        "url": "https://stackoverflow.com/jobs/451949/web-software-engineer-intern-summer-2021-vail-systems-inc?a=2rzjQ6PKeA3C&so=i&pg=1&offset=1&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-12-21T12:23:27.999Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Web Software Engineer Intern (Summer 2021)</p>\n<p>Our&nbsp;voice technology is&nbsp;cool, but it’s mostly invisible. That’s why we take great care in surrounding our voice applications with elegant and intuitive web-based applications to make them tangible and usable. Vail’s web development team develops user applications that enable our clients to achieve optimal benefits from our software. Creating intuitively usable web applications is a multi-disciplinary process that requires instinct, creativity, empathy and an eye for detail. We assemble collaborative teams made up of industry experts and neophytes applying principles of application design, graphic art and even cognitive psychology to ensure that we approach problems from every angle. We’d like to add a Web Software Engineer to our team, and we’d like to know if you think you fit the bill. You will if you:</p>\n<ul>\n<li>Thrive in a collaborative environment</li>\n<li>Are able to pick up new concepts quickly</li>\n<li>Can keep an open mind to new ideas</li>\n<li>Have excellent interpersonal communication skills</li>\n<li>Don’t mind using those skills to share your best ideas</li>\n<li>Have an ability to work independently in a fast-paced environment</li>\n<li>Aren’t afraid of ambiguity and can problem solve with little direction</li>\n<li>Have a positive, can-do attitude</li>\n</ul>\n<p>What you can expect to be doing:</p>\n<p>As part of the team, you’ll be expected to coordinate with internal product teams to design and develop intuitive applications using state-of-the-art technologies. Your work will be the main thing that our Fortune 500 clients and consumer users see when they interact with Vail’s technologies. You’ll work in small teams out of our office in the Chicago Loop, developing applications using Ruby on Rails, JavaScript Frameworks, APIs and maybe some other technologies that your expertise or curiosity helps bring to the table. We encourage you to consistently experiment with new technologies in order to tackle a complex problem from multiple angles. You’ll design, code, debate, learn, and share; you’ll work hard, but you’ll have fun every day.</p>\n<p>To be considered for this position, you must:</p>\n<ul>\n<li>Currently be pursuing a Bachelor’s degree in Computer Science/Engineering or a related field</li>\n<li>Have a strong understanding of Object-Oriented software development techniques</li>\n<li>Have prior experience with Ruby, Java, .NET or other object-oriented languages</li>\n<li>Have a true desire to experiment with new technologies</li>\n<li>Have an ability to solve complex problems in a short amount of time</li>\n</ul>\n<p>Ideally, you will also be able to demonstrate:</p>\n<ul>\n<li>Web development experience using MVC frameworks</li>\n<li>Experience with Agile development practices</li>\n<li>Experience with TDD or BDD</li>\n<li>Familiarity with UNIX/Linux/OSX</li>\n<li>Experience with git</li>\n</ul>            </div>",
        "index": 2,
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern Software Developer (spring session)",
        "company": "O'Reilly Auto Parts",
        "location": {
            "city": "Springfield",
            "state": "Missouri"
        },
        "posted": "2020-12-10T12:23:28.723Z",
        "url": "https://stackoverflow.com/jobs/445484/intern-software-developer-spring-session-oreilly-auto-parts?a=2poTqKVJ84Jq&so=i&pg=1&offset=2&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "information technology",
            "software engineering",
            "machine learning",
            "project management"
        ],
        "lastScraped": "2020-12-21T12:23:28.723Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>Department</strong>: Information Technology<br><strong>Location</strong>: Corporate Headquarters - Springfield, MO<br><strong>Status</strong>: Part-Time<br><strong>Tentative Schedule</strong>: Monday - Friday 1:00 p.m. - 5:00 p.m.</p>\n<p>The O'Reilly Auto Parts Software Developer Internship is an ongoing internship that begins with a 12 week classroom period to train each intern for a long term engagement with the company. This training period is taught by internship supervisors from O'Reilly Auto Parts and is hosted at Missouri State University. The program consists of both classroom training and hands-on experience in a lab environment. <strong>This internship requires part-time on site participation in Springfield, Missouri Monday through Friday from 1PM to 5PM starting Monday, <span>Feb 1st</span>. </strong>After the initial 12 week training period, interns transition to more flexible part time hours with an assigned development team. This internship is designed to be an ongoing opportunity for professional development as long-term team members of O'Reilly Auto Parts.&nbsp;</p>\n<p>Essential Job Functions:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<ul>\n<li>Debug and correct software defects.</li>\n<li>Develop new or modify existing software.</li>\n<li>Create or update project documentation.</li>\n<li>Test software to validate accuracy of code.</li>\n</ul>\n<p>Skills/Qualifications/Education:<br><br>Required:</p>\n<ul>\n<li>High School diploma or equivalent.</li>\n<li>Entry level knowledge of programming, database systems, and systems analysis and design.</li>\n<li>Ability to write technical documentation.</li>\n<li>Good problem-solving skills.</li>\n<li>Good verbal and written communications skills.</li>\n<li>Must work well in a team environment.</li>\n<li>Ability to learn independently.</li>\n</ul>\n<p>Desired:&nbsp;</p>\n<ul>\n<li>Computer-related work experience is an advantage.</li>\n</ul>            </div>",
        "index": 3,
        "start": "2020-02-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Algo Internship - Summer 2021",
        "company": "Hudson River Trading",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-12-08T12:23:29.113Z",
        "url": "https://stackoverflow.com/jobs/433582/algo-internship-summer-2021-hudson-river-trading?a=2lpq1Q4mMbcc&so=i&pg=1&offset=3&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "machine learning",
            "software engineering",
            "matlab",
            "python",
            "c and c++",
            "project management",
            "game design",
            "information technology"
        ],
        "lastScraped": "2020-12-21T12:23:29.113Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<strong>We are currently accepting applications for summer 2021 internships, and we will be reviewing applications on a rolling basis starting in July 2020.</strong>\n\nHRT is seeking exceptional, full-time students across all degree levels to join our algo summer internship program. Algo developers at HRT focus on research and implementation of automated trading strategies. As an intern, you will have the opportunity to rotate with our high-frequency trading, multi-frequency trading, and/or machine learning teams. In close collaboration with your mentors, you will apply sophisticated quantitative modeling techniques to understand and predict market behavior and write software to improve our trading strategies.\n\nWe are looking for quantitatively-driven and practically-minded programmers, scientists, and mathematicians who want to work on the most challenging problems in our field, enjoy collaboration, and hate the idea of climbing corporate ladders.&nbsp;\n\n<strong>WHAT TO EXPECT:</strong>\n<ul>\n<li>A fast-paced summer training program to give you an introduction to the quantitative trading industry. You will have the opportunity to get exposure to our high-frequency trading, multi-frequency trading, and/or machine learning teams.</li>\n<li>Leverage our proprietary infrastructure (Python/C++) in conjunction with third-party tools to conduct quantitative research and data analysis.</li>\n<li>Use machine learning and time series techniques to derive novel insights regarding market behavior from large and complex datasets.</li>\n<li>Work on real projects in close collaboration with experienced researchers, traders, and developers.</li>\n<li>Use our world class compute cluster to run simulations and crunch data</li>\n<li>Build predictive models for financial markets using a combination of market and non-market data.</li>\n<li>Participate in seminars that will give you an overview of markets and HRT’s trading philosophy.</li>\n<li>Enjoy a curriculum of talks, trading games, mentorships, and social events throughout the summer.</li>\n</ul>\n\n<strong>REQUIREMENTS:</strong>\n<ul>\n<li>You are a full-time undergraduate, masters, or PhD student in a quantitative discipline (e.g. math, physics, computer science, statistics, or a related program)</li>\n<li>You will be graduating and looking for full-time roles in 2022.</li>\n<li>Experience programming in Python is a must; C++ is a plus for those interested in high-frequency trading.</li>\n<li>You have experience with statistical analysis, numerical programming, or machine learning in Python, R, or MATLAB.</li>\n<li>A passion for applying quantitative models and technology toward solving real-world problems.</li>\n<li>Strong communication skills.</li>\n</ul>\n\n<strong>CULTURE:</strong>\n\nHudson River Trading (HRT) brings a scientific approach to trading financial products. We have built one of the world's most sophisticated computing environments for research and development. Our researchers are at the forefront of innovation in the world of algorithmic trading.\n\nAt HRT we come from all sorts of backgrounds: mathematics, computer science, statistics, physics, and engineering. We’re a community of self-starters who are motivated by the excitement of being at the cutting edge of automated trading. Our culture celebrates great ideas whether they come from HRT veterans or new hires. At HRT we’re friends and colleagues, whether we are sharing a meal, playing the latest board game, or writing elegant code. We embrace a culture of togetherness that extends far beyond the walls of our office.\n\nSeem like something you might be interested in? Our goal is to find the best people and bring them together to do great work in a place where everyone is valued. HRT is proud of our diverse staff; we have offices all over the globe and benefit from our varied and unique perspectives. HRT is an equal opportunity employer; so whoever you are, we’d love to get to know you.            </div>",
        "index": 4,
        "start": "2020-07-01T10:00:00.000Z",
        "due": "2020-07-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Devops Software Engineer Intern - Summer 2021",
        "company": "Vail Systems Inc.",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2020-12-19T12:23:29.481Z",
        "url": "https://stackoverflow.com/jobs/451030/devops-software-engineer-intern-summer-2021-vail-systems-inc?a=2rgd6rx3MIx2&so=i&pg=1&offset=4&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "devops",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "lastScraped": "2020-12-21T12:23:29.481Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><span>DevOps Software Engineer Intern </span><span>– </span><span>Summer 20</span><span>21</span></p>\n<p><br><span>It’s official. “Cloud” is the buzzword of the decade. Being in the business of hosting, you could say that we are a little more than interested in cloud operations. Our platform’s success depends on our ability to simplify, adapt and scale. We would like to turn this into a structured and tested practice for others to benefit from as well.</span></p>\n<p><span>We are looking for an individual who has an innate interest in driving cloud infrastructure development and enhancement - someone who is a theorizer, educator and implementer. You would be a leader of this effort and would have the opportunity to dabble in a bit of everything that we do in order to get started. You’ll be a great fit for this if you:</span></p>\n<ul>\n<li><span>Are stimulated by complex problems</span></li>\n<li><span>Are a self-starter and take initiative to navigate these complex </span><span>problems</span></li>\n<li><span>Have curiosity to learn different ways to approach an issue</span></li>\n<li><span>Are interested in sharing and teaching others about your ideas</span></li>\n<li><span>Thrive in a collaborative environment</span></li>\n<li><span>Are able to synthesize and analyze new concepts quickly</span></li>\n<li><span>Have the ability to work in a fast-paced environment<br></span></li>\n<li><span>Have a good sense of humor and a positive, can-do attitude</span></li>\n</ul>\n\n<p><span>What you can expect to be doing:</span></p>\n<p><br><span>You will use your hands-on and growing knowledge of DevOps, software development, infrastructure automation, security best practices and effective integration methodologies to help us deliver product features quickly and reliably via our evolving PaaS and IaaS capabilities. You will focus on transitioning operations to become more automated, scalable and adaptable to a prospective customer’s needs.</span></p>\n<p><br><span>To be considered for this position, you must have:</span></p>\n<ul>\n<li><span>Strong </span><span>problem-solving</span><span> skill</span></li>\n<li><span>Passion for automation</span></li>\n<li><span>Good presentation skills for a diverse audience</span></li>\n<li><span>Innate interest in “the cloud” and its underlying technologies, architectural options and the competitive landscape</span></li>\n<li><span>Proficiency with Linux OS</span><span>A working knowledge of C, C++, Golang (optional)</span></li>\n</ul>\n<p><span>Ideally, you will also be able to demonstrate:</span></p>\n<ul>\n<li><span>Familiarity and experience with Linux containers (specifically using either the Docker or Rocket container engines)</span></li>\n<li><span>Familiarity with OpenStack, Mesos, Kubernetes</span></li>\n<li><span>Familiarity with CentOS</span></li>\n<li><span>Familiarity using </span><span>SaltStack</span><span> or other config management tools (Ansible, Chef, Puppet)</span><span> <br></span></li>\n</ul>\n<p>If the above sounds interesting to you, and is a good fit for your skill set, we’d love to have you on the team.</p>            </div>",
        "index": 5,
        "remote": false
    },
    {
        "position": "Scientific Software Developer Paid Co-op/Internship",
        "company": "Stellar Science",
        "location": {
            "city": "Albuquerque",
            "state": "New Mexico"
        },
        "posted": "2020-12-12T12:23:30.364Z",
        "url": "https://stackoverflow.com/jobs/458210/scientific-software-developer-paid-co-op-stellar-science?a=2tFvqb7gLUA0&so=i&pg=1&offset=5&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "lastScraped": "2020-12-21T12:23:30.364Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>Selected Interns or Co-op students will support object-oriented C++ software development in the following domains</strong>: computer vision and image processing, image simulation, high power microwave systems modeling and simulation, laser source generation and effects modeling, computational electromagnetics (CEM), space situational awareness (SSA), high performance computing (HPC), and computer aided design (CAD) tools, among others.</p>\n<p><strong>The main requirements</strong>&nbsp;are that candidates be top-notch, responsible, self-motivated, honest, able to work well independently or in small teams, and be able to rapidly learn new languages, tools, and techniques as needed to meet mission requirements.</p>\n<p><strong>Applicants who convey a passion for developing quality code</strong>, through listed projects, a github link,&nbsp;or other software development experiences, will be given preference.</p>\n<p><strong>This is a paid cooperative/internship</strong>&nbsp;learning experience. Full-time positions are 40 hours per week. Part-time positions require a minimum commitment of 10 hours per week.</p>\n<p><strong>Minimum Requirements:</strong></p>\n<ul>\n<li>Majoring in computer science, physics, math, engineering, or a related field</li>\n<li>Software development experience in C++&nbsp;</li>\n<li>Ability to implement, understand, and maintain mathematical and scientific software libraries</li>\n<li>Must be available for full time employment within a year&nbsp;of completing this internship</li>\n<li>U.S. citizen willing to undergo background investigation and perform some work at Kirtland Air Force Base</li>\n</ul>\n<p><strong>Experience in any of the following is a plus:</strong></p>\n<ul>\n<li>Cross-platform software development on Linux and Windows</li>\n<li>3D graphics using Open Scene Graph and/or OpenGL</li>\n<li>User interface development with Qt, Java Swing, or GWT</li>\n<li>Supercomputing, CUDA, OpenMP, MPI, threads</li>\n<li>Google Closure or similar tools for large-scale JavaScript development</li>\n<li>OSGi, Orekit, or Apache Commons Math</li>\n<li>Image processing, imagery analysis, or computer vision</li>\n<li>Aerospace vehicles, orbital mechanics, electromagnetics, or space situational awareness</li>\n<li>Directed energy modeling and simulation</li>\n<li>Computer aided design (CAD)</li>\n</ul>\n<p><strong>A representative sample of your code</strong>&nbsp;will be requested early in the evaluation process, e.g. something you've written for work, for a class, or for fun. It need not compile, but should be long enough to help evaluate your programming and software engineering skills.</p>\n<p><strong>About Stellar Science:&nbsp; We are&nbsp;a growing Albuquerque-based computational science company seeking talented computer programmers to create and extend exciting scientific and engineering analysis applications.</strong>&nbsp;We maintain high standards in all our software development efforts, utilizing modern development practices including continuous integration, test-driven development, pair programming, and code reviews in order to develop high quality, maintainable, and reusable code. By employing a lightweight development process, we remain highly productive and responsive to changing customer needs.</p>\n<p><strong>Stellar Science is a forward-thinking business</strong>&nbsp;that allows its developers and scientists to work at home on occasion when consistent with job requirements. Standard benefits include ten paid federal holidays (which may be floated as desired), three weeks vacation, a generous fully employer-funded SEP IRA, and fully employer-funded health insurance, as well as dental, disability, and life insurance.</p>\n<p><em>Stellar Science is an&nbsp;</em><strong><a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\" rel=\"nofollow\" target=\"_blank\">equal opportunity employer</a></strong><em>. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity,disability, protected veteran status, or national origin, in accordance with&nbsp;</em><strong><a href=\"http://www.ecfr.gov/cgi-bin/text-idx?&amp;node=41:1.2.3.1.1#se41.1.60_61_14\" rel=\"nofollow\" target=\"_blank\">federal regulations</a>.</strong></p>            </div>",
        "index": 6,
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "iOS Developer Intern at Sports AI Startup",
        "company": "Sparrow",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2020-12-08T12:23:32.376Z",
        "url": "https://stackoverflow.com/jobs/468473/ios-developer-intern-at-sports-ai-startup-sparrow?a=2x6TToOnB31K&so=i&pg=1&offset=6&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "machine learning",
            "artificial intelligence",
            "project management"
        ],
        "lastScraped": "2020-12-21T12:23:32.376Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Sparrow is an early-stage startup that uses artificial intelligence (AI) to help athletes improve.</p>\n<p>We are offering a valuable iOS internship for a bright, motivated, resourceful college student or recent college graduate looking to learn the ins and outs of the startup, A.I., and sports worlds.</p>\n<p>*</p>\n<p>You’ll work closely with the company’s lead iOS developer on the production ready version of our app. You will:<br>*<br>Work on an iOS app, heavy in video and animation</p>\n<ul>\n<li>Create proofs of concept and demos</li>\n</ul>\n<ul>\n<li>Bug fixes</li>\n</ul>\n<ul>\n<li>Unit testing</li>\n</ul>\n<ul>\n<li>Small UI projects</li>\n</ul>\n<ul>\n<li>And much more!</li>\n</ul>\n<p>Person sought must:</p>\n<ul>\n<li>Be a student at or a recent graduate of a reputable 4-year college, with either a business, communications or marketing related degree and/or experience</li>\n</ul>\n<ul>\n<li>Be able to work an 8 hour work day (-40 hours per week) January through the end of May 2021 or longer (perfect for students taking a gap semester or year)</li>\n</ul>\n<ul>\n<li>Be uber-productive, able to switch between different kinds of tasks, and comfortable taking on all jobs complex or mundane.</li>\n</ul>\n<ul>\n<li>Be proficient in iOS development (Swift).</li>\n</ul>\n<ul>\n<li>Be very detail-oriented and thoughtful when executing a task or initiative</li>\n</ul>\n<ul>\n<li>Be able to figure out how things work, or how to get things done when a solution isn’t obvious or involves multiple steps or tools</li>\n</ul>\n<p>This position represents a unique opportunity to:</p>\n<ul>\n<li>Work closely with the company founders, successful serial entrepreneurs who have started numerous companies, raised over $20 million in venture capital for them, and have 2 successful exits. (check out our founders here: <a href=\"https://youtu.be/r82gufgzltg\" rel=\"nofollow\" target=\"_blank\">https://youtu.be/r82gufgzltg</a>)</li>\n</ul>\n<ul>\n<li>Learn the ins-and-outs of running a startup with tremendous potential that is just getting started</li>\n</ul>\n<ul>\n<li>Receive a $50 weekly stipend, college credit and potentially earn an equity bonus (stock options), and more importantly gain relationships in the tech, AI, and sports industry</li>\n</ul>\n<p>To apply, please send your resume and reason(s) why you are a fit</p>\n<p>Testimonials from Sparrow’s Intern Classes</p>\n<p>* My time at Sparrow has been great! I’ve learned the ins and outs of what it takes to successfully run a business + gained valuable insight from the founders. -Gabriel R., Yale University (Men’s Varsity Golf, Econ)</p>\n<p>* I was given real responsibilities while working alongside people who really exemplified what it means to be a part of a team. - Georgia L., Williams College (Women’s Varsity Soccer, Psych Major)</p>\n<p>*I definitely feel as though I’m honing important skills and experience for when I enter the job market.” said the rising senior. - Abby E., Pomona College in CA (Women’s Varsity Golf, Psych Major)</p>\n<p>*At Sparrow I assisted with fundraising rounds, analyzing consumer/user data &amp; conceptualizing macro marketing schemes - experiences that will help me for years to come. - Nick S., USC (Business Major)</p>\n<p>* I loved getting exposure into the fast paced start-up world - my internship with Sparrow was awesome!</p>\n<p>- Rebecca R., Brown University (Women’s Varsity Soccer, Applied Math major)</p>\n<p>* Interning at Sparrow was so valuable! I got to work with the founders and see first hand how a successful company is made! - Annie M, Lehigh (Womens’ Varsity Lacrosse, Business Major)</p>\n<p>* My internship with Sparrow was great! I worked on an investment and PR project that contributed to the launch of the company. - Colette M., Columbia University (Women's Varsity Soccer)</p>\n<p>** My internship with Sparrow was a valuable one. I worked closely with the co-founders &amp; gain valuable insight into the inner workings of a great startup. - Adam X., Harvard University (Men’s Varsity Golf)</p>\n<p>* I worked with an expert machine learning advisor, got my name on a patent and had an all around amazing experience with Sparrow! Trevor J., University of Michigan (Computer Science Major)</p>\n<p>To apply, please send your resume and reason(s) why you are a fit</p>\n<p>Job Type: Internship</p>\n<p>Pay: $50.00 per week</p>            </div>",
        "index": 7,
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Apple Media Products - Full-Stack Engineer, Internal Tools",
        "company": "Apple",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "posted": "2020-11-28T12:23:33.033Z",
        "url": "https://stackoverflow.com/jobs/437960/apple-media-products-full-stack-engineer-apple?a=2mSrXPGYVsn6&so=i&pg=1&offset=7&total=8&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "hardware",
            "project management",
            "information technology"
        ],
        "lastScraped": "2020-12-21T12:23:33.033Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThe Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here.<br><br><span>In this role, you will be creating tools for Apple editors and business managers, so that they can succeed in creating the most immersive and useful experience possible for Apple’s millions of users worldwide. The work will consist of building tooling to power our users to create a great AppStore. We power the pages, and recommendation signals that drive user engagement to allow for immersive and engaging app discovery experiences.\n\nYou will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology to further improve Apple's hardware performance and user experience.\n\nThe people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us to help deliver the next amazing Apple product.</span>            </div>",
        "index": 8,
        "remote": false
    }
]