[
    {
        "position": "Algo Internship - Summer 2021",
        "company": "Hudson River Trading",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-09-10T03:03:18.831Z",
        "url": "https://stackoverflow.com/jobs/433582/algo-internship-summer-2021-hudson-river-trading?a=2lpq1Q4mMbeg&so=i&pg=1&offset=0&total=3&so_medium=Internal&so_source=JobSearch&j=internship",
        "skills": [
            "c++",
            "python",
            "c"
        ],
        "lastScraped": "2020-10-03T03:03:18.831Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<strong>We are currently accepting applications for summer 2021 internships, and we will be reviewing applications on a rolling basis starting in July 2020.</strong>\n\nHRT is seeking exceptional, full-time students across all degree levels to join our algo summer internship program. Algo developers at HRT focus on research and implementation of automated trading strategies. As an intern, you will have the opportunity to rotate with our high-frequency trading, multi-frequency trading, and/or machine learning teams. In close collaboration with your mentors, you will apply sophisticated quantitative modeling techniques to understand and predict market behavior and write software to improve our trading strategies.\n\nWe are looking for quantitatively-driven and practically-minded programmers, scientists, and mathematicians who want to work on the most challenging problems in our field, enjoy collaboration, and hate the idea of climbing corporate ladders.&nbsp;\n\n<strong>WHAT TO EXPECT:</strong>\n<ul>\n<li>A fast-paced summer training program to give you an introduction to the quantitative trading industry. You will have the opportunity to get exposure to our high-frequency trading, multi-frequency trading, and/or machine learning teams.</li>\n<li>Leverage our proprietary infrastructure (Python/C++) in conjunction with third-party tools to conduct quantitative research and data analysis.</li>\n<li>Use machine learning and time series techniques to derive novel insights regarding market behavior from large and complex datasets.</li>\n<li>Work on real projects in close collaboration with experienced researchers, traders, and developers.</li>\n<li>Use our world class compute cluster to run simulations and crunch data</li>\n<li>Build predictive models for financial markets using a combination of market and non-market data.</li>\n<li>Participate in seminars that will give you an overview of markets and HRT’s trading philosophy.</li>\n<li>Enjoy a curriculum of talks, trading games, mentorships, and social events throughout the summer.</li>\n</ul>\n\n<strong>REQUIREMENTS:</strong>\n<ul>\n<li>You are a full-time undergraduate, masters, or PhD student in a quantitative discipline (e.g. math, physics, computer science, statistics, or a related program)</li>\n<li>You will be graduating and looking for full-time roles in 2022.</li>\n<li>Experience programming in Python is a must; C++ is a plus for those interested in high-frequency trading.</li>\n<li>You have experience with statistical analysis, numerical programming, or machine learning in Python, R, or MATLAB.</li>\n<li>A passion for applying quantitative models and technology toward solving real-world problems.</li>\n<li>Strong communication skills.</li>\n</ul>\n\n<strong>CULTURE:</strong>\n\nHudson River Trading (HRT) brings a scientific approach to trading financial products. We have built one of the world's most sophisticated computing environments for research and development. Our researchers are at the forefront of innovation in the world of algorithmic trading.\n\nAt HRT we come from all sorts of backgrounds: mathematics, computer science, statistics, physics, and engineering. We’re a community of self-starters who are motivated by the excitement of being at the cutting edge of automated trading. Our culture celebrates great ideas whether they come from HRT veterans or new hires. At HRT we’re friends and colleagues, whether we are sharing a meal, playing the latest board game, or writing elegant code. We embrace a culture of togetherness that extends far beyond the walls of our office.\n\nSeem like something you might be interested in? Our goal is to find the best people and bring them together to do great work in a place where everyone is valued. HRT is proud of our diverse staff; we have offices all over the globe and benefit from our varied and unique perspectives. HRT is an equal opportunity employer; so whoever you are, we’d love to get to know you.            </div>",
        "start": "2020-07-01T10:00:00.000Z",
        "due": "2020-07-01T10:00:00.000Z"
    },
    {
        "position": "Software Engineer Intern",
        "company": "HENNGE K.K.",
        "location": {
            "city": "Tokyo",
            "state": "Japan"
        },
        "posted": "2020-09-03T03:03:19.402Z",
        "url": "https://stackoverflow.com/jobs/380987/software-engineer-intern-hennge-kk?a=23LOAbbUg8De&so=i&pg=1&offset=1&total=3&so_medium=Internal&so_source=JobSearch&j=internship",
        "skills": [
            "python",
            "go",
            "amazon-web-services",
            "google-cloud-platform"
        ],
        "lastScraped": "2020-10-03T03:03:19.402Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Join us for a unique 6-8 week internship in Japan that will offer you both personal and professional development opportunities. Experience working in a Japanese company that prides itself on cultivating an internationally diverse culture. You will work alongside our experienced <em>Cloud Product Development</em> engineers with a dedicated mentor. In the <strong>HENNGE Global Internship Program (GIP)</strong>, you will acquire practical application development skills using <em>Python</em> and <em>Go</em>. GIP will provide hands-on experience using state-of-the-art cloud platforms such as <em>Amazon Web Services</em> and <em>Google Cloud Platform</em> to develop applications. <strong>Japanese is not required as English is our primary language.</strong> <br><strong><br>Internship&nbsp;Duration</strong>&nbsp;<br>6 or 8 weeks (from 10AM until 7PM from Monday to Friday)&nbsp;<br><br><strong>Internship Slots</strong>&nbsp;<br><br>Our Global Internship Program is open year-round and the internship slots are every two months.<br><em><br>Please check our website for the updated slots&nbsp;of 2021 batches along with our recent statement regarding the ongoing Covid-19 pandemic.<br><br></em><a href=\"http://hennge.com/global/gip\" rel=\"nofollow\" target=\"_blank\">hennge.com/global/gip</a></p>\n<p><br><strong>Qualifications<br></strong></p>\n<ul>\n<li>At least second-year completed (Junior or Senior) or fresh graduate with BS, MS, or PhD in Computer Science or a related area of study</li>\n<li>Experience in systems, software or algorithms</li>\n<li>Knowledge of Unix/Linux environment</li>\n<li>Proficiency with Python or Go</li>\n<li>Familiarity with TCP/IP and network programming</li>\n<li>Fluency in English (Japanese is not required)</li>\n</ul>\n<p><em>Those interested in seeking a career in Japan will be at a significant advantage.</em> <br><br><strong>Benefits<br></strong></p>\n<ul>\n<li>Up to 150,000 JPY/month subsidy. HENNGE Global Internship Program is a training program without salary. The subsidy is provided to cover living costs such as meals, commuting expenses, and accommodation.</li>\n<li>Round-trip airfare coverage</li>\n<li>Medical insurance</li>\n<li>Support for visa acquisition &amp; full guidance for incoming preparation</li>\n<li>10 free Get-To-Know-You lunches</li>\n<li>Japanese cultural events</li>\n<li>Monthly Technical Session: internal mini-conference where the engineers will share knowledge or recent trends</li>\n<li>Refresh room &amp; office parties</li>\n</ul>\n<p><br><strong>Residency Requirements<br></strong>All candidates considered, including international students<br><br><strong>Application Procedures</strong>&nbsp;<br>The internship slots are handled on a first-come, first-served basis. Our team will review applications on a rolling basis and so it is in your best interest to apply early. There is no deadline for submission of the admission challenge, and time taken to complete it will not be considered in the application. Due to the time required for visa and internship preparation, we suggest you apply at least 3 months before your preferred slot.<br> <br><strong>Selection Process</strong>&nbsp;<br>1. HENNGE Admission Challenge<br>2. Screening process <br>3. Online interview</p>            </div>",
        "compensation": "paid"
    },
    {
        "position": "Intern IT Security - for Hamburg’s first Unicorn company",
        "company": "ABOUT YOU GmbH",
        "location": {
            "city": "Hamburg",
            "state": "Deutschland"
        },
        "posted": "2020-09-18T03:03:21.331Z",
        "url": "https://stackoverflow.com/jobs/379291/intern-it-security-for-hamburg-s-first-unicorn-about-you-gmbh?a=23cyaB6YqEko&so=i&pg=1&offset=2&total=3&so_medium=Internal&so_source=JobSearch&j=internship",
        "skills": [
            "security",
            "testing"
        ],
        "lastScraped": "2020-10-03T03:03:21.331Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>We are currently looking for an<strong>&nbsp;Intern&nbsp;IT Security</strong>&nbsp;who is eager to learn and join our&nbsp;<strong>Information Security Team for 3 – 6 months.</strong></p>\n<p>Our&nbsp;<strong>Security Team</strong>&nbsp;ensures that customers of our online shop have a safe shopping experience and their personal data is secure with us. In addition, the team also protects our corporate data and the hardware of our employees. Protecting customer and company information is an important part of our business and our team is passionate about bringing security to the next level. Our goal is to create a secure environment without restricting or slowing down business processes.</p>\n<p>We are looking for an<strong>&nbsp;Intern&nbsp;IT Security&nbsp;</strong>who wants to start their career in the security field, is passionate to work on security-related topics and wants to build up knowledge in penetration testing, security monitoring, automation other topics.</p>\n<p><strong>What you will do</strong></p>\n<ul>\n<li>Assist the team in triaging vulnerability reports submitted through our bug bounty program</li>\n<li>Investigate and respond to security incidents in our systems</li>\n<li>Participate in employee security awareness training</li>\n<li>Participate in penetration testing of internal systems</li>\n<li>Improve our monitoring and scanning tools to detect security issues and automate routine tasks</li>\n<li>Review and write security policies and guidelines</li>\n</ul>\n<p><strong>Who you are</strong></p>\n<ul>\n<li>You are curious about Web Application security and want to understand how things work and how to break them</li>\n<li>You have some background in Computer Science, IT Administration and/or Security</li>\n<li>You are able to write simple scripts and programs in any programming language</li>\n<li>You like challenges, ideally you play CTF or solve hacking challenges online</li>\n<li>You have good communication and presentation skills</li>\n<li>Fluent English skills (spoken &amp; written)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Grow together with one of the fastest growing eCommerce companies in Europe</li>\n<li>Flexible working times</li>\n<li>40% discount on our online shop</li>\n<li>Fresh fruits + drinks everywhere</li>\n<li>Language courses (German &amp; English)</li>\n<li>Free sports courses &amp; reduced price for gym membership</li>\n<li>Subsidized public transportation ticket</li>\n<li>Free choice of hardware and operating system (Mac, Windows, Linux) also for private usage</li>\n<li>State-of-the-art tech stack running on AWS</li>\n<li>Modern office in the city center of Hamburg</li>\n<li>International working environment and English as company language</li>\n<li>Company flats (subject to availability)</li>\n<li>Agile work environment (<a href=\"https://corporate.aboutyou.de/de/move#hero\" rel=\"nofollow\" target=\"_blank\">MOVE</a>) and cross-functional teams</li>\n<li>Free access to Germany’s greatest developer conference <a href=\"https://www.codetalks.de/\" rel=\"nofollow\" target=\"_blank\">code.talks</a></li>\n<li>Company pension scheme</li>\n<li>Free Laracasts and Egghead account&nbsp;</li>\n<li>Help in relocation and VISA process</li>\n</ul>\n<p>We are looking forward to receiving your application – preferably via our online application portal! Thus, we can ensure a faster process and for you it is very easy to upload your application documents. :)</p>            </div>"
    }
]