[
    {
        "position": "Algo Internship - Summer 2021",
        "company": "Hudson River Trading",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2020-10-09T21:34:24.348Z",
        "url": "https://stackoverflow.com/jobs/433582/algo-internship-summer-2021-hudson-river-trading?a=2lpq1Q4mMbeg&so=i&pg=1&offset=0&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "c++",
            "python",
            "c"
        ],
        "lastScraped": "2020-10-16T21:34:24.348Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<strong>We are currently accepting applications for summer 2021 internships, and we will be reviewing applications on a rolling basis starting in July 2020.</strong>\n\nHRT is seeking exceptional, full-time students across all degree levels to join our algo summer internship program. Algo developers at HRT focus on research and implementation of automated trading strategies. As an intern, you will have the opportunity to rotate with our high-frequency trading, multi-frequency trading, and/or machine learning teams. In close collaboration with your mentors, you will apply sophisticated quantitative modeling techniques to understand and predict market behavior and write software to improve our trading strategies.\n\nWe are looking for quantitatively-driven and practically-minded programmers, scientists, and mathematicians who want to work on the most challenging problems in our field, enjoy collaboration, and hate the idea of climbing corporate ladders.&nbsp;\n\n<strong>WHAT TO EXPECT:</strong>\n<ul>\n<li>A fast-paced summer training program to give you an introduction to the quantitative trading industry. You will have the opportunity to get exposure to our high-frequency trading, multi-frequency trading, and/or machine learning teams.</li>\n<li>Leverage our proprietary infrastructure (Python/C++) in conjunction with third-party tools to conduct quantitative research and data analysis.</li>\n<li>Use machine learning and time series techniques to derive novel insights regarding market behavior from large and complex datasets.</li>\n<li>Work on real projects in close collaboration with experienced researchers, traders, and developers.</li>\n<li>Use our world class compute cluster to run simulations and crunch data</li>\n<li>Build predictive models for financial markets using a combination of market and non-market data.</li>\n<li>Participate in seminars that will give you an overview of markets and HRT’s trading philosophy.</li>\n<li>Enjoy a curriculum of talks, trading games, mentorships, and social events throughout the summer.</li>\n</ul>\n\n<strong>REQUIREMENTS:</strong>\n<ul>\n<li>You are a full-time undergraduate, masters, or PhD student in a quantitative discipline (e.g. math, physics, computer science, statistics, or a related program)</li>\n<li>You will be graduating and looking for full-time roles in 2022.</li>\n<li>Experience programming in Python is a must; C++ is a plus for those interested in high-frequency trading.</li>\n<li>You have experience with statistical analysis, numerical programming, or machine learning in Python, R, or MATLAB.</li>\n<li>A passion for applying quantitative models and technology toward solving real-world problems.</li>\n<li>Strong communication skills.</li>\n</ul>\n\n<strong>CULTURE:</strong>\n\nHudson River Trading (HRT) brings a scientific approach to trading financial products. We have built one of the world's most sophisticated computing environments for research and development. Our researchers are at the forefront of innovation in the world of algorithmic trading.\n\nAt HRT we come from all sorts of backgrounds: mathematics, computer science, statistics, physics, and engineering. We’re a community of self-starters who are motivated by the excitement of being at the cutting edge of automated trading. Our culture celebrates great ideas whether they come from HRT veterans or new hires. At HRT we’re friends and colleagues, whether we are sharing a meal, playing the latest board game, or writing elegant code. We embrace a culture of togetherness that extends far beyond the walls of our office.\n\nSeem like something you might be interested in? Our goal is to find the best people and bring them together to do great work in a place where everyone is valued. HRT is proud of our diverse staff; we have offices all over the globe and benefit from our varied and unique perspectives. HRT is an equal opportunity employer; so whoever you are, we’d love to get to know you.            </div>",
        "index": 1,
        "start": "2020-07-01T10:00:00.000Z",
        "due": "2020-07-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Intern Software Developer (spring session)",
        "company": "O'Reilly Auto Parts",
        "location": {
            "city": "Springfield",
            "state": "Missouri"
        },
        "posted": "2020-10-07T21:34:24.937Z",
        "url": "https://stackoverflow.com/jobs/445484/intern-software-developer-spring-session-oreilly-auto-parts?a=2poTqKVJ84Jq&so=i&pg=1&offset=1&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "javascript",
            "html",
            "database",
            "css",
            "java"
        ],
        "lastScraped": "2020-10-16T21:34:24.937Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>Department</strong>: Information Technology<br><strong>Location</strong>: Corporate Headquarters - Springfield, MO<br><strong>Status</strong>: Part-Time<br><strong>Tentative Schedule</strong>: Monday - Friday 1:00 p.m. - 5:00 p.m.</p>\n<p>The O'Reilly Auto Parts Software Developer Internship is an ongoing internship that begins with a 12 week classroom period to train each intern for a long term engagement with the company. This training period is taught by internship supervisors from O'Reilly Auto Parts and is hosted at Missouri State University. The program consists of both classroom training and hands-on experience in a lab environment. <strong>This internship requires part-time on site participation in Springfield, Missouri Monday through Friday from 1PM to 5PM starting Monday, <span>Feb 1st</span>. </strong>After the initial 12 week training period, interns transition to more flexible part time hours with an assigned development team. This internship is designed to be an ongoing opportunity for professional development as long-term team members of O'Reilly Auto Parts.&nbsp;</p>\n<p>Essential Job Functions:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<ul>\n<li>Debug and correct software defects.</li>\n<li>Develop new or modify existing software.</li>\n<li>Create or update project documentation.</li>\n<li>Test software to validate accuracy of code.</li>\n</ul>\n<p>Skills/Qualifications/Education:<br><br>Required:</p>\n<ul>\n<li>High School diploma or equivalent.</li>\n<li>Entry level knowledge of programming, database systems, and systems analysis and design.</li>\n<li>Ability to write technical documentation.</li>\n<li>Good problem-solving skills.</li>\n<li>Good verbal and written communications skills.</li>\n<li>Must work well in a team environment.</li>\n<li>Ability to learn independently.</li>\n</ul>\n<p>Desired:&nbsp;</p>\n<ul>\n<li>Computer-related work experience is an advantage.</li>\n</ul>            </div>",
        "index": 2,
        "start": "2020-02-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Intern IT Security - for Hamburg’s first Unicorn company",
        "company": "ABOUT YOU GmbH",
        "location": {
            "city": "Hamburg",
            "state": "Deutschland"
        },
        "posted": "2020-09-18T21:34:27.603Z",
        "url": "https://stackoverflow.com/jobs/379291/intern-it-security-for-hamburg-s-first-unicorn-about-you-gmbh?a=23cyaB6YqEko&so=i&pg=1&offset=2&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "security",
            "testing"
        ],
        "lastScraped": "2020-10-16T21:34:27.603Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>We are currently looking for an<strong>&nbsp;Intern&nbsp;IT Security</strong>&nbsp;who is eager to learn and join our&nbsp;<strong>Information Security Team for 3 – 6 months.</strong></p>\n<p>Our&nbsp;<strong>Security Team</strong>&nbsp;ensures that customers of our online shop have a safe shopping experience and their personal data is secure with us. In addition, the team also protects our corporate data and the hardware of our employees. Protecting customer and company information is an important part of our business and our team is passionate about bringing security to the next level. Our goal is to create a secure environment without restricting or slowing down business processes.</p>\n<p>We are looking for an<strong>&nbsp;Intern&nbsp;IT Security&nbsp;</strong>who wants to start their career in the security field, is passionate to work on security-related topics and wants to build up knowledge in penetration testing, security monitoring, automation other topics.</p>\n<p><strong>What you will do</strong></p>\n<ul>\n<li>Assist the team in triaging vulnerability reports submitted through our bug bounty program</li>\n<li>Investigate and respond to security incidents in our systems</li>\n<li>Participate in employee security awareness training</li>\n<li>Participate in penetration testing of internal systems</li>\n<li>Improve our monitoring and scanning tools to detect security issues and automate routine tasks</li>\n<li>Review and write security policies and guidelines</li>\n</ul>\n<p><strong>Who you are</strong></p>\n<ul>\n<li>You are curious about Web Application security and want to understand how things work and how to break them</li>\n<li>You have some background in Computer Science, IT Administration and/or Security</li>\n<li>You are able to write simple scripts and programs in any programming language</li>\n<li>You like challenges, ideally you play CTF or solve hacking challenges online</li>\n<li>You have good communication and presentation skills</li>\n<li>Fluent English skills (spoken &amp; written)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Grow together with one of the fastest growing eCommerce companies in Europe</li>\n<li>Flexible working times</li>\n<li>40% discount on our online shop</li>\n<li>Fresh fruits + drinks everywhere</li>\n<li>Language courses (German &amp; English)</li>\n<li>Free sports courses &amp; reduced price for gym membership</li>\n<li>Subsidized public transportation ticket</li>\n<li>Free choice of hardware and operating system (Mac, Windows, Linux) also for private usage</li>\n<li>State-of-the-art tech stack running on AWS</li>\n<li>Modern office in the city center of Hamburg</li>\n<li>International working environment and English as company language</li>\n<li>Company flats (subject to availability)</li>\n<li>Agile work environment (<a href=\"https://corporate.aboutyou.de/de/move#hero\" rel=\"nofollow\" target=\"_blank\">MOVE</a>) and cross-functional teams</li>\n<li>Free access to Germany’s greatest developer conference <a href=\"https://www.codetalks.de/\" rel=\"nofollow\" target=\"_blank\">code.talks</a></li>\n<li>Company pension scheme</li>\n<li>Free Laracasts and Egghead account&nbsp;</li>\n<li>Help in relocation and VISA process</li>\n</ul>\n<p>We are looking forward to receiving your application – preferably via our online application portal! Thus, we can ensure a faster process and for you it is very easy to upload your application documents. :)</p>            </div>",
        "index": 3,
        "remote": false
    },
    {
        "position": "Software Engineer Intern, Machine Learning (PhD)",
        "company": "Facebook",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "posted": "2020-10-08T21:34:28.900Z",
        "url": "https://stackoverflow.com/jobs/445926/software-engineer-intern-machine-learning-phd-facebook?a=2py5eQTEjwis&so=i&pg=1&offset=3&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "perl",
            "php",
            "machine-learning"
        ],
        "lastScraped": "2020-10-16T21:34:28.900Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. <br><br>At Facebook, we use machine learning across a diverse set of applications to help people discover better content more quickly, and to connect with the things that matter most to them. We strive to find ways to deliver more engaging content in News Feed, rank search results more accurately, and present the most relevant ads possible.In order to meet the demands of our scale, we approach machine learning challenges from a system engineering standpoint, pushing the boundaries of scalable computing and tying together numerous complex platforms to build models that leverage trillions of actions. Our research and production implementations leverage many of the innovations being generated from Facebook's research in Distributed Computing, Artificial Intelligence and Databases, and run on the same hardware and network specifications that are being open sourced through the Open Compute project.As a PhD intern at Facebook, you will help build machine learning systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.As part of our hiring process, PhD interns are pre-assigned to a relevant team based on their expertise and interests.This internship has a minimum twelve (12) week duration with 2021 start dates ONLY. <br><br></p><ul><li>Develop highly scalable classifiers and tools leveraging machine learning, regression, and rules-based models</li><li>Suggest, collect and synthesize requirements and create effective feature roadmap</li><li>Code deliverables in tandem with the engineering team</li><li>Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)</li><li>Perform specific responsibilities which vary by team</li></ul> <br><br><ul><li>Currently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, or related field</li><li>Research experience in a relevant field, such as machine learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, or computer vision</li><li>Experience in systems software or algorithms</li><li>Experience in C/C++, Java, Perl, or PHP</li><li>Experience in scripting languages such as Perl, PHP, Python, and shell scripts</li><li>Experience with Hadoop/Hbase/Pig or Mapreduce/Sawzall/Bigtable</li><li>Experience with cross-group and cross-culture collaboration</li><li>High levels of creativity and quick problem solving capabilities</li><li>Proven track record of achieving significant results</li><li>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment</li></ul> <br><br><ul><li>Intent to return to degree-program after the completion of the internship/co-op</li><li>Demonstrated software engineer experience via an internship, work experience, coding competitions, or PhD papers</li></ul> <br><br>Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at <a href=\"mailto:accommodations-ext@fb.com\">accommodations-ext@fb.com</a>.            </div>",
        "index": 4,
        "contact": "ext@fb.com",
        "remote": false
    },
    {
        "position": "Software Engineer Intern, Machine Learning (PhD)",
        "company": "Facebook",
        "location": {
            "city": "Bellevue",
            "state": "Washington"
        },
        "posted": "2020-10-08T21:34:29.475Z",
        "url": "https://stackoverflow.com/jobs/445927/software-engineer-intern-machine-learning-phd-facebook?a=2py6wMqbGGSA&so=i&pg=1&offset=4&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "perl",
            "php",
            "machine-learning"
        ],
        "lastScraped": "2020-10-16T21:34:29.475Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. <br><br>At Facebook, we use machine learning across a diverse set of applications to help people discover better content more quickly, and to connect with the things that matter most to them. We strive to find ways to deliver more engaging content in News Feed, rank search results more accurately, and present the most relevant ads possible.In order to meet the demands of our scale, we approach machine learning challenges from a system engineering standpoint, pushing the boundaries of scalable computing and tying together numerous complex platforms to build models that leverage trillions of actions. Our research and production implementations leverage many of the innovations being generated from Facebook's research in Distributed Computing, Artificial Intelligence and Databases, and run on the same hardware and network specifications that are being open sourced through the Open Compute project.As a PhD intern at Facebook, you will help build machine learning systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.As part of our hiring process, PhD interns are pre-assigned to a relevant team based on their expertise and interests.This internship has a minimum twelve (12) week duration with 2021 start dates ONLY. <br><br></p><ul><li>Develop highly scalable classifiers and tools leveraging machine learning, regression, and rules-based models</li><li>Suggest, collect and synthesize requirements and create effective feature roadmap</li><li>Code deliverables in tandem with the engineering team</li><li>Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)</li><li>Perform specific responsibilities which vary by team</li></ul> <br><br><ul><li>Currently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, or related field</li><li>Research experience in a relevant field, such as machine learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, or computer vision</li><li>Experience in systems software or algorithms</li><li>Experience in C/C++, Java, Perl, or PHP</li><li>Experience in scripting languages such as Perl, PHP, Python, and shell scripts</li><li>Experience with Hadoop/Hbase/Pig or Mapreduce/Sawzall/Bigtable</li><li>Experience with cross-group and cross-culture collaboration</li><li>High levels of creativity and quick problem solving capabilities</li><li>Proven track record of achieving significant results</li><li>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment</li></ul> <br><br><ul><li>Intent to return to degree-program after the completion of the internship/co-op</li><li>Demonstrated software engineer experience via an internship, work experience, coding competitions, or PhD papers</li></ul> <br><br>Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at <a href=\"mailto:accommodations-ext@fb.com\">accommodations-ext@fb.com</a>.            </div>",
        "index": 5,
        "contact": "ext@fb.com",
        "remote": false
    },
    {
        "position": "Software Engineer Intern, Machine Learning (PhD)",
        "company": "Facebook",
        "location": {
            "city": "Boston",
            "state": "Massachusetts"
        },
        "posted": "2020-10-08T21:34:30.082Z",
        "url": "https://stackoverflow.com/jobs/445925/software-engineer-intern-machine-learning-phd-facebook?a=2py3WVn6WlIk&so=i&pg=1&offset=5&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "perl",
            "php",
            "machine-learning"
        ],
        "lastScraped": "2020-10-16T21:34:30.082Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. <br><br>At Facebook, we use machine learning across a diverse set of applications to help people discover better content more quickly, and to connect with the things that matter most to them. We strive to find ways to deliver more engaging content in News Feed, rank search results more accurately, and present the most relevant ads possible.In order to meet the demands of our scale, we approach machine learning challenges from a system engineering standpoint, pushing the boundaries of scalable computing and tying together numerous complex platforms to build models that leverage trillions of actions. Our research and production implementations leverage many of the innovations being generated from Facebook's research in Distributed Computing, Artificial Intelligence and Databases, and run on the same hardware and network specifications that are being open sourced through the Open Compute project.As a PhD intern at Facebook, you will help build machine learning systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.As part of our hiring process, PhD interns are pre-assigned to a relevant team based on their expertise and interests.This internship has a minimum twelve (12) week duration with 2021 start dates ONLY. <br><br></p><ul><li>Develop highly scalable classifiers and tools leveraging machine learning, regression, and rules-based models</li><li>Suggest, collect and synthesize requirements and create effective feature roadmap</li><li>Code deliverables in tandem with the engineering team</li><li>Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)</li><li>Perform specific responsibilities which vary by team</li></ul> <br><br><ul><li>Currently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, or related field</li><li>Research experience in a relevant field, such as machine learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, or computer vision</li><li>Experience in systems software or algorithms</li><li>Experience in C/C++, Java, Perl, or PHP</li><li>Experience in scripting languages such as Perl, PHP, Python, and shell scripts</li><li>Experience with Hadoop/Hbase/Pig or Mapreduce/Sawzall/Bigtable</li><li>Experience with cross-group and cross-culture collaboration</li><li>High levels of creativity and quick problem solving capabilities</li><li>Proven track record of achieving significant results</li><li>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment</li></ul> <br><br><ul><li>Intent to return to degree-program after the completion of the internship/co-op</li><li>Demonstrated software engineer experience via an internship, work experience, coding competitions, or PhD papers</li></ul> <br><br>Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at <a href=\"mailto:accommodations-ext@fb.com\">accommodations-ext@fb.com</a>.            </div>",
        "index": 6,
        "contact": "ext@fb.com",
        "remote": false
    },
    {
        "position": "PHP JUNIOR DEVELOPER / TRAINEE",
        "company": "Error",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2020-09-16T21:34:40.880Z",
        "url": "https://stackoverflow.com/jobs/389202/php-junior-developer-trainee-sjm-softech-pvt-ltd?a=26wD1dvVnlJe&so=i&pg=1&offset=6&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "php",
            "mysql",
            "linux"
        ],
        "lastScraped": "2020-10-16T21:34:40.880Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<b>Desired profile:</b><br>\nWe seek talented, self starter and self motivated engineering and technology background individuals with drive to learn and create great web application.\n<br><br>\nQualification\n<br><br>\nB Tech, B.E. BCA, MCA, Tech Diploma holder having experience of 0 to 1.5 years\n<br><br>\n<b>Job Skills &amp; Responsibilities:</b><br>\nShould have basic knowledge of laravel , codignitor, core php 5 and php 7, Mysql, angular JS, Jquery.\n<br>He should able to write and understand basic queries and store procedure in Mysql 5 and abvoe.\n<br>He should have basic understanding of HTML 5, bootstrap, CSS etc.\n<br>Should be self motivated and self starter\n<br>Should understand Linux and run basic Linux command\n<br>He should be solution oriented, self starter and self motivated person.\n<br>Should able to work on project under the guidance of tech lead and his tech mentor.\n<br>Good Communication skills and should able to write emails in English language\n<br>Eager to learn new things and take up challenges\n<br>Interview process would be\n<br><br>\nTech interview round\n<br>Machine test\n<br>HR interview round\n<br>Send Your CV at <a href=\"mailto:hr@sjmsoftech.com\">hr@sjmsoftech.com</a> , <a href=\"mailto:kaniksha@sjmsoftech.com\">kaniksha@sjmsoftech.com</a>            </div>",
        "index": 7,
        "contact": "hr@sjmsoftech.com",
        "remote": false
    },
    {
        "position": "Machine Learning / AI - Engineering & Research Internship (Interspeech 2020)",
        "company": "Apple",
        "location": {
            "city": "Cupertino",
            "state": "California"
        },
        "posted": "2020-10-12T21:34:41.620Z",
        "url": "https://stackoverflow.com/jobs/447497/machine-learning-ai-engineering-research-apple?a=2q4KFrOC6jPG&so=i&pg=1&offset=7&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "c++",
            "python",
            "java"
        ],
        "lastScraped": "2020-10-16T21:34:41.620Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nApple is seeking highly qualified people for the position of AI/ML Engineer Intern and AI/ML Researcher Intern. The team pursues research &amp; development in the areas of machine learning (ML) with particular focus on deep learning (DL), computer vision (CV), Natural Language Processing (NLP), optimization, and reinforcement learning (RL). As a member of the team, ​you will work on some of the most ambitious technical problems, develop new ML solutions that will impact future Apple products, and collaborate with the best product teams to integrate your ideas into products.<br><br><span>You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>            </div>",
        "index": 8,
        "remote": false
    },
    {
        "position": "Audible Software Development Engineer Internship",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "New Jersey"
        },
        "posted": "2020-10-08T21:34:42.821Z",
        "url": "https://stackoverflow.com/jobs/441791/audible-software-development-engineer-internship-audible?a=2oa6zjNPYIIU&so=i&pg=1&offset=8&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "c++",
            "design"
        ],
        "lastScraped": "2020-10-16T21:34:42.821Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nAudible’s Technical Internship Program<br><br>Good storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>About The Role<br><br>As a Software Development Engineer Intern with Audible, you will be an integral part of our storytelling ecosystem, using cutting edge technology to deliver a tangible impact to our millions of listeners. Here, talent is recognized and good ideas are rewarded — we invite the best of our interns to join Audible, either full time after graduation or with a return internship offer. In years past, we’ve had internships in Newark NJ and Cambridge MA, but our summer 2020 internship was fully virtual. We’re ready to adapt to whatever 2021 brings.<br><br><br><br><br><br><br>Basic Qualifications<br><br>· Current enrollment as an undergraduate or masters student in computer science, engineering, computer vision or a related major<br>· An anticipated graduation date between December 2021 and May/June 2022<br><br>Preferred Qualifications<br><br>· Experience in one or more of the following: Object-oriented design and programming experience in C/C++, Java preferably on a UNIX or Linux Platform<br>· Proven experience as an innovator and a creator, with strong critical thinking and communication skills<br>About Audible<br><br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As the world’s largest producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>Learn more about Life Inside Audible:<br>- Interns turned full time Software Development Engineers<br>- The Economic Impact of our commitment to our communities<br>- Our Lead Intern Recruiter, Jeremy Bradshaw<br>- Reinventing our workplace for Covid-19, and beyond!<br>- Our Statement on Racism and Justice<br>- Our Statement on Trans Rights<br>- Our Impact Groups, and Spectrum and Belonging<br>- Our Latest Launch<br>- Explore Our Newsroom for the latest in Audible News!<br><br><br>            </div>",
        "index": 9,
        "remote": false
    },
    {
        "position": "Audible Quality Assurance Engineer Internship",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "New Jersey"
        },
        "posted": "2020-10-08T21:34:43.423Z",
        "url": "https://stackoverflow.com/jobs/441792/audible-quality-assurance-engineer-internship-audible?a=2oa7RfknlTj2&so=i&pg=1&offset=9&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "c++",
            "design"
        ],
        "lastScraped": "2020-10-16T21:34:43.423Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nAudible’s Technical Internship Program<br>Good storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>About The Role<br>As a Quality Assurance Engineer Intern with Audible, you will be an integral part of our storytelling ecosystem, using cutting edge technology to deliver a tangible impact to our millions of listeners. Here, talent is recognized and good ideas are rewarded — we invite the best of our interns to join Audible, either full time after graduation or with a return internship offer. In years past, we’ve had internships in Newark NJ and Cambridge MA, but our summer 2020 internship was fully virtual. We’re ready to adapt to whatever 2021 brings.<br><br><br><br><br><br><br>Basic Qualifications<br><br>· Current enrollment as an undergraduate or masters student in computer science, engineering, computer vision or a related major<br>· An anticipated graduation date between December 2021 and May/June 2022<br>· Proven experience as an innovator and a creator, with strong critical thinking and communication skills<br><br>Preferred Qualifications<br><br>· Experience in one or more of the following: Object-oriented design and programming experience in C/C++, Java preferably on a UNIX or Linux Platform<br>About Audible<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As the world’s largest producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>Learn more about Life Inside Audible:<br>- Interns turned full time Software Development Engineers<br>- The Economic Impact of our commitment to our communities<br>- Our Lead Intern Recruiter, Jeremy Bradshaw<br>- Reinventing our workplace for Covid-19, and beyond!<br>- Our Statement on Racism and Justice<br>- Our Statement on Trans Rights<br>- Our Impact Groups, and Spectrum and Belonging<br>- Our Latest Launch<br>- Explore Our Newsroom for the latest in Audible News!<br>            </div>",
        "index": 10,
        "remote": false
    },
    {
        "position": "Trainee Transport & Radio Engineering (f/m) 18 months",
        "company": "Error",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2020-10-03T21:34:53.961Z",
        "url": "https://stackoverflow.com/jobs/443559/trainee-transport-radio-engineering-f-m-18-sunrise-communications-ag?a=2oKRNHFwIuZ2&so=i&pg=1&offset=10&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "testing",
            "web-services",
            "python"
        ],
        "lastScraped": "2020-10-16T21:34:53.961Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nWelcome to the world's most exciting industry! Sunrise's Trainee Program is an 18-months learning journey - designed for talented university graduates who are willing to take on challenges in an innovative and dynamic company. The Trainee Program consists of rotational assignments within the Transport and Radio Engineering department and gives you the chance to start a great career at Sunrise. <br><br>\n<p><strong>Trainee Transport &amp; Radio Engineering (f/m) 18 months</strong></p><br>\n\n<br>Duties and responsibilities:<br><strong>DC and Backbone Engineering</strong><br><ul><li>Testing and documenting test results, supporting network services and network automation, solutions development.</li><li>Help in generation of network status reports</li><li>Help in organizing documentation on centralized documents repository<strong><br></strong></li></ul><strong>Radio Planning &amp; Optimization</strong><br><ul><li>Maintain the upgrade program (RND) in Atoll (radio planning tool)&nbsp;</li><li>Basic KPI verification for 4G and 5G upgrades</li><li>Performing / analysis of drive tests</li><li>Support local optimizer in specific regions</li></ul>  <strong>Central Radio Engineering</strong><br><ul><li>From Lab to live. Help in testing and introducing new software features, hardware or new mobile services</li><li>Plan and prepare potential POC or FUT and support live introduction</li><li>Support in defining and executing technical test procedure or protocols</li><li>Supporting deployment PM's in rollout projects (depending on start date, potentially lead own small project if available)</li></ul><br>\n\n<br>Qualifications:<br><ul><li>Matser degree in Engineering</li><li>Knowledge of the programming languages: Python, PERL, XML</li><li>High motivation, enthusiasm and curiosity </li><li>Very good communication and presentation skills </li><li>Proactive &amp; solution oriented attitude</li><li>Network-thinking and quick learning ability</li><li>Ability to prioritize work load and consistently meet deadlines </li><li>Fluent in English</li></ul><br>\n\n<br>Take your first career steps in the exciting world of technology and engineering. Seize the moment and apply now!<br><br>Please note that we only accept applications via our online tool.<br><br>\n\n<p><strong><a href=\"https://recruitingapp-2790.umantis.com/Vacancies/3361/Application/CheckLogin/2?source=200\" rel=\"nofollow\" target=\"_blank\">[ Apply now ]</a></strong></p>            </div>",
        "index": 11,
        "remote": false
    },
    {
        "position": "Apple Cloud Platform - internal tools",
        "company": "Apple",
        "location": {
            "city": "Cupertino",
            "state": "California"
        },
        "posted": "2020-10-12T21:34:54.526Z",
        "url": "https://stackoverflow.com/jobs/384736/apple-cloud-platform-internal-tools-apple?a=251LNz9g0Hlu&so=i&pg=1&offset=11&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java"
        ],
        "lastScraped": "2020-10-16T21:34:54.526Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThe Apple Cloud Platform organization is building the next generation tools empowering Apple’s software developers to build products our customers love. We're a fast moving, highly skilled but small team designing and building a continuous integration and delivery system that Apple’s developers utilize to build, test and deploy their code with. Our system has to scale globally, stay highly available, and \"just work”. We're looking for a talented person to join this amazing team, if you feel this is you, we'd love to hear from you.<br><br><span>Our team comes with a diverse set of experience with many of the technologies below to represent the perspective and variety of our internal customer base. Candidates are not required to have experience with every technology or product: \n\n\n• Java and/or other JVM languages like Scala, Clojure and Groovy.\n• NoSQL: Cassandra, MongoDB; Caching: Redis, Memcached; RDBMS: MySQL, PostgreSQL.\n• Affinity to system level programming including scripting in Bash, Ruby and/or Python.\n• Virtual machines, containers and tools like Kubernetes, Vagrant and Docker.\n• Build tools: Gradle, Maven, Ant, Make, Rake, Grunt, Gulp, Ninja, Blaze/Bazel, Pants or others.\n• CI Solutions: Travis, Circle, Go, Jenkins, Team-City or others.\n• Testing frameworks: Junit, TestNG, Spock, Cucumber, Rspec, Mocha or others.\n• Deployment systems: EC2, Heroku,Engine Yard, App Engine. \n• Application development frameworks: Finagle, Vert.x, Java Servlets, Node.js, Ruby On Rails, Django or others. \n• Operating Systems: Linux and macOS.</span>            </div>",
        "index": 12,
        "remote": false
    },
    {
        "position": "Software Engineering Manager - Internal Tools (Analytics/Data Engineering)",
        "company": "Indeed",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2020-09-24T21:34:55.549Z",
        "url": "https://stackoverflow.com/jobs/427291/software-engineering-manager-internal-tools-indeed?a=2jiBLW2H1JbW&so=i&pg=1&offset=12&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "cloud",
            "hadoop"
        ],
        "lastScraped": "2020-10-16T21:34:55.549Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nOur mission: <br>As the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers.<br>The team: <br>We are a rapidly growing and highly-capable Engineering organization building the most popular job site on the planet. Every month, over 250 million people count on Indeed to help them find jobs, publish their resumes, process their job applications, and connect employers to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo, Singapore, Hyderabad and Vancouver, we are improving people's lives all around the world, one job search at a time.<br><br>The base salary range below represents the low and high end of the Indeed salary range for this position. Actual salaries will vary and may be above or below the range based on various factors including but not limited to location, experience, and performance. The range listed is just one component of Indeed's total compensation package for employees. Other rewards may include quarterly bonuses, Long Term Incentives, an open Paid Time Off policy, and many region-specific benefits. <br><br>\tRemote Americas Base Salary Range: 138,000 - 174,000 per year<br>Your job: <br>We are seeking a hands-on Engineering manager for our User Insights team, which is part of the Data Platforms organization. <br><br>\tThe User Insights team has the mission to provide critical data assets and valuable insights to support the understanding of how users use all of Indeed's products. As a team we are highly analytical and methodical, we prioritize progress over perfection, and have a reputation for accountability for collaborating well with our users and stakeholders. <br><br>\tCome join this team of data professionals as a Manager to support evolving the team’s products into an industry-standard cloud data platform.<br>About you: <br>You have years of experience as a SWE in the Data space, and then moved on to leading /managing a Data Platform team since you were passionate about building teams, building strategic solutions, and having massive business impact. You have delivered high quality data solutions that your internal and external stakeholders rave about. <br><br>\tYou put the team before self, and believe you are successful only if your entire team and stakeholders are successful. You create opportunities for team members to leverage their skills, learn new ones, and have massive impact. You are passionate about coding and technology and know how to share your passion with your team.<br><br>\tWith your broad knowledge of how to source, extract, transform, load, monitor, and maintain data you are able to guide your team to hold solid data practices and management and ensure customers are able to leverage the data platform you have created with a minimum of effort and learning. You are rarely satisfied with the status-quo, and always think about developing capabilities that our customers themselves didn’t know they needed and at the same time you take pride in your ability to balance short term gains with long term investments. You are always open to new ideas and technologies. <br><br>The role<br><br>\tResponsibilities of the role include<br><br>\t* <br><br>\tLeading and growing the team of Engineers, ensuring you have all the skills needed to building and maintenance team’s products<br>\t* <br><br>\tLeading and constantly improving the team’s delivery process<br>\t* <br><br>\tCollaborating with the Product Manager to ensure the team has a backlog of impactful work <br>\t* <br><br>\tGuiding team on migration of existing data pipelines to the cloud (AWS) and leveraging cloud technologies to create new solutions.<br>\t* <br><br>\tParticipating in code reviews for the code produced by the team and by external contributors to ensure the right level of quality. <br>\t* <br><br>\tCollaborate with multiple upstream services and products teams to ensure they are collecting the right data in the right schema and make that data available on our platform with the least number of hops and the lowest latency<br>\t* <br><br>\tInfluence the holistic environment/technologies we need to develop and maintain the data platforms, for example scheduling, data processing, and data integration tools.<br>\t* <br><br>\tContributing code, preparing designs and working alongside the team on moving the solutions forward<br><br>Qualifications<br><br>Must Haves<br><br>\t* <br><br>\t5+ years of experience in Software Engineering/Data Engineering roles<br>\t* <br><br>\tDemonstrated ability managing a high-performing engineering team including the ability to mentor developers, helping them improve their skills and grow their careers<br><br>\t* <br><br>\tHands-on data processing and data modeling experience in a big data environment<br>\t* <br><br>\tSolid demonstrable experience with <br><br>\t* <br><br>\tJava or Scala<br>\t* <br><br>\tApache Spark, Hive <br>\t* <br><br>\tBig data cloud platforms (AWS, GCP)<br>\t* <br><br>\tAdvanced SQL scripting<br><br>\t* <br><br>\tUnderstanding the basics of distributed systems<br>\t* <br><br>\tStrong communication and collaboration skills<br>\t* <br><br>\tExperience with Agile methodologies<br><br>Nice to haves<br><br>\t* <br><br>\tExperience with AWS EMR<br>\t* <br><br>\tExperience with setting up and improving the team’s delivery processes using Continuous Integration and Continuous Delivery practices<br>\t* <br><br>\tSome experience with high throughput web systems, ideally experience with building end to end event data pipeline from collecting data in the browser to preparing aggregated datasets in Hadoop/Hive<br>\t* <br><br>\tExperience building high-performance distributed systems<br>\t* <br><br>\tExperience with web analytics systems (e.g. Google Analytics, MixPanel, Amplitude, Omniture, etc)<br>\t* <br><br>\tFamiliarity with Kafka<br><br>\tIndeed provides a variety of benefits that help us focus on our mission of helping people get jobs. <br><br>\tView our bounty of perks: [1] <a href=\"http://indeedhi.re/IndeedBenefits\" rel=\"nofollow\" target=\"_blank\">http://indeedhi.re/IndeedBenefits</a>  <br><br>\tView Indeed's Applicant Privacy Terms: [2] <a href=\"https://www.indeed.com/legal/applicant-privacy\" rel=\"nofollow\" target=\"_blank\">https://www.indeed.com/legal/applicant-privacy</a><br><br>\tEEO and Accommodations <br><br>\tIndeed is deeply committed to building a workplace and global community where inclusion is not only valued, but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neuro-diversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.<br><br>\tIndeed is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Talent Attraction Help at 1-855-567-7767, or by email at [3] <a href=\"mailto:TAhelp@indeed.com\">TAhelp@indeed.com</a> at least one week in advance of your interview.            </div>",
        "index": 13,
        "compensation": "paid",
        "contact": "TAhelp@indeed.com, 1-855-567-7767",
        "remote": true
    },
    {
        "position": "Senior Quality Assurance Automation Engineer (Remote) - International Business Unit",
        "company": "Indeed",
        "location": {
            "city": "Remote",
            "state": "Oregon"
        },
        "posted": "2020-09-25T21:34:56.167Z",
        "url": "https://stackoverflow.com/jobs/440511/senior-quality-assurance-automation-engineer-indeed?a=2nJurI2PCePK&so=i&pg=1&offset=13&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "automation",
            "qa",
            "reactjs"
        ],
        "lastScraped": "2020-10-16T21:34:56.167Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nOur mission: <br>As the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers.<br>The team: <br>We are a rapidly growing and highly-capable Engineering organization building the most popular job site on the planet. Every month, over 250 million people count on Indeed to help them find jobs, publish their resumes, process their job applications, and connect employers to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo, Singapore, Hyderabad and Vancouver, we are improving people's lives all around the world, one job search at a time.<br><br>The base salary range below represents the low and high end of the Indeed salary range for this position. Actual salaries will vary and may be above or below the range based on various factors including but not limited to location, experience, and performance. The range listed is just one component of Indeed's total compensation package for employees. Other rewards may include quarterly bonuses, Long Term Incentives, an open Paid Time Off policy, and many region-specific benefits. <br><br>Remote Americas Base Salary Range: 120,000 - 148,000 USD per year<br>Your job: <br>The International Team works to make all of Indeed’s products effective at getting people hired, in every market and language. This involves translating the needs of specific markets into configuration patterns that let us scale those variations worldwide. We consider both sides of the experience, meaning that we internationalize employer-facing products (such as posting jobs and managing candidates) and jobseeker-facing products (such as mobile job search, updating profiles, and messaging-app based experiences).  Most importantly, the team is expected to deliver results, and be able to demonstrate the impact our changes have on our business. <br><br>\tAs a QA Automation Engineer, you will work as a Software Development Engineer in Test in our International Platforms team working across multiple Forward Deployed Engineering (FDE) teams. You will partner with Product, UX, and other engineering teams to make Indeed’s products delight all our users worldwide. You will work to evolve Indeed’s products to address international opportunities, potentially working on solutions that span multiple teams. You will embed with other teams to help them make core parts of the product better suited for different market needs. This configuration goes well beyond simple language translation and localization, and into the behavior of the features themselves.<br><br>\tAs a member of one of our International Platforms Forward Deployed Engineering (FDE) teams, you will be a \"dual citizen\" who is fully a member of the International Platforms team but works deeply in the codebases of and with your \"host\" teams to address long-standing issues which have blocked strong adoption of your host team’s products and platforms in Indeed’s international markets.<br><br>\tAs the founding QAAE/SDET for the International Platforms Team, you will \"write the book\" on how we effectively collaborate with the host teams with which we work.<br>About you: <br>You are a QAAE (QA Automation Engineer) whose preference is to operate as an SDET (Software Development Engineer in Test). You are passionate about testing and quality and getting products into customers' hands as quickly as possible. You have experience enabling the teams with which you work to have high-quality testing and best practices like CI/CD and \"Push-on-Green\". You won’t be the only person writing tests: you will be focused on enabling each and every member of your teams to write high-quality tests. <br><br>Required Skills<br><br>\t* 7+ years of experience as a QA Automation Engineer, Software Development Engineer in Test (SDET), Software Developer, or similar Automation role<br>\t* Experience designing test structures that are easily maintainable, resilient, performant and scalable<br>\t* Proficiency in writing clean, modular, reusable code using design patterns<br>\t* Proficiency in writing thorough tests that cover edge cases with appropriate ROI for velocity and quality<br>\t* Proficiency at identifying and analyzing the root cause of complex bugs in your code as well as others’ code<br>\t* Well-versed with incrementally validating investments in innovative solutions for your team’s automation<br>\t* Experience with test frameworks such as PyTest, TestNG, RSpec, JUnit, Jasmine, Mocha, etc.<br>\t* Proficiency in one or more of the following technologies: RESTful APIs,  gRPC, or Selenium Webdriver automation with Java, Python or other object-oriented languages<br><br>Desired Skills<br><br>\t* <br><br>\tGood understanding of Spring Framework, Protobuf, ReST, GraphQL and JSON.<br>\t* <br><br>\tStrong knowledge of and experience working with React.<br>\t* <br><br>\tGood understanding of one or more SQL and/or NoSQL databases<br>\t* <br><br>\tGood understanding of Technologies like Jenkins, Git, Docker, Unix commands, shell scripts, AWS, gRPC RabbitMQ, and machine learning<br>\t* <br><br>\tProficiency with Linux based environments<br>\t* <br><br>\tExperience with GIT, Continuous Integration systems (Hudson/Jenkins) &amp; Bug Tracking (Jira) tools<br>\t* <br><br>\tExperience with using agile methodologies for software development<br>\t* <br><br>\tExperience with Test Driven Development <br>\t* <br><br>\tExperience in product internationalization desirable<br>\t* <br><br>\tExperience living and/or working outside of the US a positive<br><br>\tIndeed provides a variety of benefits that help us focus on our mission of helping people get jobs. <br><br>\tView our bounty of perks: [1] <a href=\"http://indeedhi.re/IndeedBenefits\" rel=\"nofollow\" target=\"_blank\">http://indeedhi.re/IndeedBenefits</a>  <br><br>\tView Indeed's Applicant Privacy Terms: [2] <a href=\"https://www.indeed.com/legal/applicant-privacy\" rel=\"nofollow\" target=\"_blank\">https://www.indeed.com/legal/applicant-privacy</a><br><br>\tEEO and Accommodations <br><br>\tIndeed is deeply committed to building a workplace and global community where inclusion is not only valued, but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neuro-diversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.<br><br>\tIndeed is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Talent Attraction Help at 1-855-567-7767, or by email at <a href=\"mailto:TAhelp@indeed.com\">TAhelp@indeed.com</a> at least one week in advance of your interview.            </div>",
        "index": 14,
        "compensation": "paid",
        "contact": "TAhelp@indeed.com, 1-855-567-7767",
        "remote": true
    },
    {
        "position": "Software Development Engineer II - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "New Jersey"
        },
        "posted": "2020-10-09T21:34:57.031Z",
        "url": "https://stackoverflow.com/jobs/433441/software-development-engineer-ii-international-audible?a=2lmu61D9psXu&so=i&pg=1&offset=14&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "design",
            "web-services"
        ],
        "lastScraped": "2020-10-16T21:34:57.031Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nABOUT THE TEAM<br>Audible International Expansion team is delivering on a vision for launching a localized, customer-centric presence in new countries while building world class engineering platform to enable faster and differentiated launches. We are expanding and improving the platform from mobile web to back-end services while innovating and leveraging new Amazon technology and platforms. Success means we are delighting more customers in new countries while building on an already tremendously successful and much-loved product.<br><br>ABOUT YOU<br>You are an innovative and passionate top software engineer looking to make a positive impact on customer experience. You like to own deliverables end-to-end and have a meaningful influence on the final product. You are a builder. You like to work with fellow engineers and product people to share knowledge, imagine, design, develop, test, and launch software that wows our community and inspires our peers. You're curious and love to learn unprompted as you stay up to date with tools, trends, technologies and best practices in the industry. Please don't hesitate to apply!<br><br>HOW DOES AMAZON FIT IN?<br>We're a a strategic and growing part of Amazon, our parent company. Audible's built on Amazon technology and you'll have insight into the inner workings of the world's leading ecommerce experience. You'll get to play with all of Amazon's and AWS technologies. There's a LOT to learn! Your career will benefit from working with teams like Kindle, A9, P13N and many more.<br>If you want to own and solve problems, work with a creative dynamic team, fail fast in a supportive environment whilst growing your career and working on high volume (2000+ tps) services that support millions of customers worldwide, we want to hear from you.<br><br>Come and be part of a great Audible team in Newark! We take learning, innovation, and teamwork to the next level to accomplish superior results. We are a team that cares about your work-life balance and harmony, while challenging you to solve problems at Amazon scale. You will be part of a strong agile team where innovation and inventions are encouraged. You will have broad visibility and direct access to product, business, and tech leadership teams. You will build software that will improve people’s lives and experience with Audible, where inspiring voices bring stories, ideas, and characters to life.<br><br>Come and talk to us to know more about this exciting opportunity and see if we're indeed a good match.<br><br>KEY RESPONSIBILITIES<br>· Partner with cross-functional teams to imagine, design, develop, test, and launch software that impacts our community and inspires your peers.<br>· Set the technical direction and strategy within a team and strategize to influence technology across Audible and beyond.<br>· Work with your team to invent, design and build software that is stable and performant.<br>· Proficient in a broad range of design approaches and know when it is appropriate to use each.<br>· Solve difficult problems of diverse scope where analysis of data requires evaluation of identifiable factors, demonstrating sound judgment in selecting methods and techniques for obtaining solutions.<br>· Capable of independently clarifying technical requirements, developing coding estimates and applying a broad range of design approaches to bring innovative solutions to the table.<br>· Review code of other team members and provide constructive direction.<br>· Constantly strive to raise the bar on engineering excellence.<br>· Drive continuous improvement of software quality, CX and maintainability of products/features.<br>· Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br>· Additional duties as assigned.<br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· 2 years of professional software development experience.<br>· Knowledge of Spring, SOA and automated testing.<br>· Full stack experience (Java, NoSQL, Javascript).<br>· Experience in communicating with users, other technical teams and senior management to collect requirements, describe software product features, technical designs and product strategy.<br>· Well-rounded engineering skills; full-stack development experience - web + services - If you've built something in your spare time send us the link, we'd love to hear about it.<br><br>Preferred Qualifications<br><br>· Experience with React, HTTP/2, PWA, Serverless, Microservices, CI/CD, and cross-platform development.<br>· Experience taking a lead role developing complex software systems that have successfully been delivered to customers.<br>· Great communication skills - ability to think creatively and adapt the message to the audience. Can provide information to technical and non-technical stakeholders alike and guide them to confidently informed decisions.<br>· Prior use of AWS technologies at scale in a production environment.<br>· Strong problem solving skills; adaptable, proactive and willing to take ownership.<br>· A high-quality bar and a drive of continuous improvement; just-enough documentation, unit testing, code reviews, test automation, continuous integration &amp; deployment and a preference for agile methods.<br>· Strong business and technical vision.<br><br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As the world’s largest producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>            </div>",
        "index": 15,
        "remote": false
    },
    {
        "position": "Software Development Engineer II - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "New Jersey"
        },
        "posted": "2020-09-20T21:34:57.644Z",
        "url": "https://stackoverflow.com/jobs/415215/software-development-engineer-ii-international-audible?a=2ffvTAqlYubK&so=i&pg=1&offset=15&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "web-services"
        ],
        "lastScraped": "2020-10-16T21:34:57.644Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThis opportunity is for a Software Development Engineer for Audible’s Consumer Domains group. We are the team that creates and powers Audible’s website applications and services for our global listeners. We are the home for tech talent that wants to grow Audible’s market leading business and build the sites and services (APIs) across desktop and mobile devices. The team is comprised of developers who work in an agile environment and partner closely with Audible and Amazon tech teams, Product, UX and QA teams.<br><br>We are embarking on a mission to reshape the fundamental experiences and delight our customers and drive a strong engineering culture. It's our responsibility to push Audible into new places; wherever our customers are listening. Achieving this vision means expanding and strengthening our development process and leveraging new technologies to deliver services and web applications. We need your help to develop and deliver on this vision. Success means we lay the foundation for continued expansion of our company without disrupting an already tremendously successful and much loved product.<br><br>HOW DOES AMAZON FIT IN?<br>We're a part of Amazon: they are our parent company and it's a great partnership. You'll get to play with Amazon's technologies, but it doesn't stop there. Audible is built on a strong foundation of Amazon technology and you'll have insight into the inner workings of the world's leading ecommerce experience. There's a LOT to learn! Your career will benefit from working with teams like Alexa, Search, Kindle, A9, P13N and many more.<br><br>If you are excited to own and solve problems, work with a creative dynamic team, fail fast in a supportive environment while growing your career and working on high volume (2000+ transactions per second) services that support millions of customers worldwide, we want to hear from you.<br><br>KEY RESPONSIBILITIES<br>· Set the technical direction and strategy within the team and strategize to influence technology across Audible and beyond.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.Developing solutions web solution and services: Envisioning, designing, creating, and supporting our solutions that operate with a high degree of operational excellence.<br>· Partner with a cross-functional team to imagine, design, develop, test, and launch software that wows our community and inspires our peers. Be willing to explore technical needs and bring problems AND solutions to the table.<br>· Constantly strive to raise the bar on engineering excellence. Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.<br><br>Basic Qualifications<br><br>· Great Java development skills building large scale web applications and APIs.<br>· Knowledge of Spring, SOA and automated testing.<br>· Full stack experience (Java, NoSQL, HTML5, CSS3, Javascript, node.js).<br>· Degree in Computer Science or equivalent experience (5+ years).<br>· Well-rounded engineering skills; full-stack development experience - web + services - If you've built something in your spare time send us the link, we'd love to hear about it.<br>· Strong problem solving skills; adaptable, proactive and willing to take ownership.<br>· A high-quality bar and a drive of continuous improvement; just-enough documentation, unit testing, code reviews, test automation, continuous integration &amp; deployment and a preference for agile methods.<br>· Great communication skills - ability to think creatively and adapt the message to the audience.<br><br>Preferred Qualifications<br><br>· Experience with React, HTTP/2, PWA, Serverless, Microservices, CI/CD, and cross-platform development.<br>· Prior use of AWS technologies at scale in a production environment.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As the world’s largest producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br>            </div>",
        "index": 16,
        "remote": false
    },
    {
        "position": "Software Development Engineer II - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "New Jersey"
        },
        "posted": "2020-09-20T21:34:58.441Z",
        "url": "https://stackoverflow.com/jobs/415216/software-development-engineer-ii-international-audible?a=2ffxbvWTlELS&so=i&pg=1&offset=16&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "web-services"
        ],
        "lastScraped": "2020-10-16T21:34:58.441Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThis opportunity is for a Software Development Engineer for Audible’s Consumer Domains group. We are the team that creates and powers Audible’s website applications and services for our global listeners. We are the home for tech talent that wants to grow Audible’s market leading business and build the sites and services (APIs) across desktop and mobile devices. The team is comprised of developers who work in an agile environment and partner closely with Audible and Amazon tech teams, Product, UX and QA teams.<br><br>We are embarking on a mission to reshape the fundamental experiences and delight our customers and drive a strong engineering culture. It's our responsibility to push Audible into new places; wherever our customers are listening. Achieving this vision means expanding and strengthening our development process and leveraging new technologies to deliver services and web applications. We need your help to develop and deliver on this vision. Success means we lay the foundation for continued expansion of our company without disrupting an already tremendously successful and much loved product.<br><br>HOW DOES AMAZON FIT IN?<br>We're a part of Amazon: they are our parent company and it's a great partnership. You'll get to play with Amazon's technologies, but it doesn't stop there. Audible is built on a strong foundation of Amazon technology and you'll have insight into the inner workings of the world's leading ecommerce experience. There's a LOT to learn! Your career will benefit from working with teams like Alexa, Search, Kindle, A9, P13N and many more.<br><br>If you are excited to own and solve problems, work with a creative dynamic team, fail fast in a supportive environment while growing your career and working on high volume (2000+ transactions per second) services that support millions of customers worldwide, we want to hear from you.<br><br>KEY RESPONSIBILITIES<br>· Set the technical direction and strategy within the team and strategize to influence technology across Audible and beyond.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.Developing solutions web solution and services: Envisioning, designing, creating, and supporting our solutions that operate with a high degree of operational excellence.<br>· Partner with a cross-functional team to imagine, design, develop, test, and launch software that wows our community and inspires our peers. Be willing to explore technical needs and bring problems AND solutions to the table.<br>· Constantly strive to raise the bar on engineering excellence. Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.<br><br>Basic Qualifications<br><br>· Great Java development skills building large scale web applications and APIs.<br>· Knowledge of Spring, SOA and automated testing.<br>· Full stack experience (Java, NoSQL, HTML5, CSS3, Javascript, node.js).<br>· Degree in Computer Science or equivalent experience (5+ years).<br>· Well-rounded engineering skills; full-stack development experience - web + services - If you've built something in your spare time send us the link, we'd love to hear about it.<br>· Strong problem solving skills; adaptable, proactive and willing to take ownership.<br>· A high-quality bar and a drive of continuous improvement; just-enough documentation, unit testing, code reviews, test automation, continuous integration &amp; deployment and a preference for agile methods.<br>· Great communication skills - ability to think creatively and adapt the message to the audience.<br><br>Preferred Qualifications<br><br>· Experience with React, HTTP/2, PWA, Serverless, Microservices, CI/CD, and cross-platform development.<br>· Prior use of AWS technologies at scale in a production environment.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As the world’s largest producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>            </div>",
        "index": 17,
        "remote": false
    }
]