[
    {
        "position": "Data Engineer",
        "company": "Jo Supplements",
        "location": {
            "city": "Europe • Middle East • Asia • Remote",
            "state": "Out of Country"
        },
        "url": "https://angel.co/company/jo-supplements/jobs/1378918-data-engineer",
        "skills": [
            "software engineering",
            "devops",
            "bioinformatics",
            "python",
            "project management"
        ],
        "lastScraped": "2021-06-08T21:38:33.459Z",
        "description": "<p><strong>We are currently prioritizing applicants outside of North America and Northern Europe.</strong></p>\n\n<p>We are looking for qualified candidates for our Data Science &amp; Engineering department. </p>\n\n<p>Our data team members are experts at ingesting large, complex biological data sets, creating fast and efficient pipelines to process them, and working closely with our DevOps group to seamlessly deliver cutting edge genomic analysis to our customers.</p>\n\n<p>Pay will be in accordance with abilities, skills, experience, hustle, leadership, level of English proficiency and location.</p>\n\n<p>*<em>The Role is: *</em></p>\n\n<ul>\n<li>Full time.</li>\n<li>Fully Remote.</li>\n</ul>\n\n<p>*<em>Salary: *</em></p>\n\n<ul>\n<li>20k-75k / yr (we are seeking candidates from intern to senior level)</li>\n<li>Equity is also available for outstanding applicants with leadership qualities</li>\n</ul>\n\n<p><strong>Highly Desired Skills</strong></p>\n\n<ul>\n<li>2+ years of experience working with large data sets</li>\n<li>Strong English-language communication skills</li>\n<li>Professional experience and analytics heavy language, Python prefered</li>\n<li>Professional experience with workflow management (Nextflow, Snakemake, or Airflow, etc)</li>\n<li>Deep knowledge of creating efficient database queries and operations</li>\n<li>Well-versed in source control with Git</li>\n</ul>\n\n<p><strong>Duties</strong></p>\n\n<ul>\n<li>Analyzing and maintaining large databases of sensitive user data</li>\n<li>Developing scalable, easily-maintainable software</li>\n<li>Optimizing applications for maximum speed and scalability</li>\n<li>Extending and improving existing internal software systems</li>\n<li>Integrating multiple data sources and databases into one system</li>\n</ul>\n\n<p><strong>Plusses:</strong></p>\n\n<ul>\n<li>Knowledge of statistical techniques</li>\n<li>Bioinformatics knowledge</li>\n<li>Math knowledge</li>\n</ul>\n\n<p>(not accepting candidates still in school, i.e., with education in progress)</p>",
        "index": 1,
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Full Stack Engineer",
        "company": "Sigma Ratings",
        "location": {
            "city": "Brazil",
            "state": "Out of Country"
        },
        "url": "https://angel.co/company/sigma-ratings/jobs/884165-full-stack-engineer",
        "skills": [
            "project management",
            "software engineering",
            "javascript",
            "devops",
            "scala",
            "machine learning",
            "python",
            "information technology"
        ],
        "lastScraped": "2021-06-08T21:38:35.592Z",
        "description": "<p>Hello!  Thank you for your interest in Sigma Ratings.</p>\n\n<p>Sigma Ratings (“Sigma”) is an MIT-incubated and venture-backed global data and analytics firm that helps clients better manage risk that may impact credit, credibility and reputation.  Sigma’s unique products leverage cutting-edge computer science and deep domain expertise to convert the world’s data into actionable insight that powers decision-making at global financial institutions, corporates and governments.  </p>\n\n<p>Sigma’s core values are collaboration, curiosity, and integrity. Working in a complex domain with a small, globally distributed team requires us to actively work together, embrace learning, and hold ourselves accountable to each other.</p>\n\n<p>We believe engineers do their best work when they have interesting problems to solve with a smart, kind team. Our engineers value pragmatism and sharing. We aim to use the right tools to build incrementally and iterate rapidly. We collaborate on designs and implementations because many heads are better than one. We share ownership, knowledge, rewards, and pain because we are a team and teams build together.</p>\n\n<p><strong>What You will Do</strong></p>\n\n<ul>\n<li>Partner with product and engineering to design scalable engineering solutions</li>\n<li>Build and maintain production systems, including services (Go, Python, Scala), the UI (React/Redux), databases (PostgreSQL), docker with some AWS devops work</li>\n<li>Build or provision new services, infrastructure and UI for greenfield projects such as public APIs along with other product development ideas</li>\n<li>Regularly participate in code reviews</li>\n<li>Weigh in on architectural decisions and participate in our RFC process</li>\n<li>Mentor and share knowledge with the rest of the team</li>\n</ul>\n\n<p><strong>Our stack</strong></p>\n\n<ul>\n<li>Javascript/ES6 (React)</li>\n<li><p>Golang (Echo)</p></li>\n<li><p>Scala (Play Framework)</p></li>\n<li><p>Python (Databricks)</p></li>\n<li><p>Amazon ECS Fargate, RDS, Kinesis, and more,</p></li>\n<li><p>Docker, Grafana, Prometheus and GitLab CI</p></li>\n</ul>\n\n<p><strong>Qualifications</strong><br>\nNot all qualified candidates will have all these requirements, so if you have some or most of them, we’d love for you to apply, especially if you have some nice-to-haves from below!</p>\n\n<p><strong>Required for this role:</strong></p>\n\n<ul>\n<li>Solid communication skills in English is a MUST</li>\n<li>Golang ~2 years experience is a MUST </li>\n<li>React / Redux ~1 year experience is a MUST</li>\n</ul>\n\n<p>Other important skills:</p>\n\n<ul>\n<li>Approximately 5 or more years of software development including: </li>\n<li>design, implementation, and testing of production features</li>\n<li>maintenance and monitoring of production systems</li>\n</ul>\n\n<p>Solid working experience with: (Ideally, at least one year of professional use)</p>\n\n<ul>\n<li>Scala </li>\n<li>Python</li>\n</ul>\n\n<p>Other important attributes:</p>\n\n<p>Approximately 3 or more years of experience working with cross-functional stakeholders (product, sales, ops, etc)</p>\n\n<ul>\n<li>Preference for rapid iteration or prototyping over extended debate</li>\n<li>Familiarity with build tools and automated build pipelines</li>\n<li>AWS experience, especially with managed services such as ECS over EC2</li>\n<li>Experience with Docker</li>\n</ul>\n\n<p><strong>Nice to have</strong></p>\n\n<ul>\n<li>Experience developing a public facing RESTful APIs</li>\n<li>Experience with search engines like Elastic or Solr</li>\n<li>Nginx, Grafana </li>\n<li>Experience with one or any Graph DB</li>\n</ul>\n\n<p><strong>What We Offer</strong><br>\nCompetitive compensation and company stock </p>\n\n<ul>\n<li>Fully remote work - Standup at 10am EST </li>\n<li>Generous vacations</li>\n</ul>\n\n<p>Sigma is a proud equal opportunity employer. We are committed to fair hiring practices and to creating a welcoming environment for all team members. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, familial status or veteran status.</p>",
        "index": 2,
        "remote": true
    },
    {
        "position": "Kids Computer Science Teacher (Multiple Openings)",
        "company": "Code Galaxy",
        "location": {
            "city": "Austin",
            "state": "United States"
        },
        "url": "https://angel.co/company/code-galaxy/jobs/700615-kids-computer-science-teacher-multiple-openings",
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "game design"
        ],
        "lastScraped": "2021-06-08T21:38:37.552Z",
        "description": "Position - Kids Computer Science Teacher<br><br>Department - Teaching<br><br>Employment Type - Part Time - 10-20 hrs/week<br><br>Start Date - Immediately <br><br>Openings - Multiple<br><br> <br><br>Who We Are<br><br>Code Galaxy is the nation's leading kids coding after school learning program. In our center, kids ages 5-14 learn to code in a fun and engaging way - by playing and building the games and applications they love. With our model, kids have a blast and can't wait to come back. Parents are thrilled as their children gain confidence while learning coding, math, logic, and problem-solving skills as they progress through each level.  <br><br>What is the Job?<br><br>Code Galaxy is currently seeking a Part Time Coding School Teaching Assistant (TA)! If you have coding experience and a desire to teach others, this is an exciting opportunity to work with hands-on with students during Launch’s summer camp programs. The primary role of the computer science teacher assistant is to bring Launch’s computer science curriculum for kids to life. Our ideal teacher is enthusiastic about helping our students succeed and able to learn and grow, learning about Launch’s courses and technology. This is a great position for students seeking to gain leadership and coding skills.<br><br> <br><br>Responsibilities<br><br>Assisting the lead teacher in organizing and managing the classroom<br>Leading a class at a Code Galaxy satellite location <br>Maintaining a safe and healthy learning environment<br>Reinforcing lesson concepts with students and checking the completion of work.<br>Classroom &amp; student record keeping.<br>Participation in promotional events and fairs at schools &amp; other locations<br>Any other assistance to lead teacher as needed.<br>Required Qualifications<br><br>At least 16 years old.<br>Have a valid driver license.<br>Able to travel between schools/events (Downtown, West and North Austin).<br>Available throughout weekends and some evenings during the summer.<br>Great with kids.<br>Have experience with technology.<br>Willing to develop or have an understanding of the technology used.<br>Be able to engage with both parents and children.<br>working knowledge of computer programs and accessing internet applications such as Student Information Systems, Google Applications (Gmail) including Sheets, Docs, &amp; Slides.<br>Desire &amp; drive to help students achieve while having fun.<br>Must be able to successfully pass a background check and complete fingerprinting requirement.<br>Preferred Qualifications<br><br>A previous job working with elementary and middle school students in a camp or after-school setting.<br>Coding skills and examples projects to show.<br> <br><br>All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, age, marital status, pregnancy, genetic information, or other legally protected status.",
        "index": 3,
        "remote": false
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": "Out of Country"
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": [
            "software engineering",
            "javascript",
            "hardware",
            "project management",
            "information technology",
            "react"
        ],
        "lastScraped": "2021-06-08T21:38:39.856Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>",
        "index": 4,
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Software Engineer II",
        "company": "Agnostiq",
        "location": {
            "city": "Toronto • Remote",
            "state": "Out of Country"
        },
        "url": "https://angel.co/company/agnostiq/jobs/1381317-software-engineer-ii",
        "skills": [
            "software engineering",
            "data visualization",
            "python",
            "machine learning",
            "project management",
            "artificial intelligence"
        ],
        "lastScraped": "2021-06-08T21:38:41.777Z",
        "description": "<p><strong>Role: Software Engineer II</strong></p>\n\n<p>As a Software Engineer II, you will have the opportunity to contribute to the implementation of a wide variety of cutting-edge enterprise software projects. You will be working closely with accomplished quantum software engineers and cloud engineers to develop, test, and benchmark Agnostiq’s software. The ideal candidate will have prior experience programming in Python and be familiar with Linux.  No prior experience in quantum computing is required.  Candidates must be willing to learn on the job.</p>\n\n<p><strong>Key Responsibilities</strong> </p>\n\n<ul>\n<li>Assist in the implementation of new algorithms using Python</li>\n<li>Test and benchmark software applications</li>\n<li>Contribute to and maintain Agnostiq’s existing codebases</li>\n<li>Packaging and polishing software for distribution</li>\n</ul>\n\n<p><strong>Must-haves:</strong></p>\n\n<ul>\n<li>A Bachelors in Computer Science (candidates from other backgrounds with programming experience will also be considered)</li>\n<li>Experience debugging and testing software</li>\n<li>Skilled in Python and familiar with git</li>\n<li>High level of proficiency in data structures and algorithms</li>\n<li>Data visualization experience</li>\n</ul>\n\n<p><strong>Nice-to-haves:</strong></p>\n\n<ul>\n<li>Previous experience working in HPC environments or with scientific software</li>\n<li>Developer certifications from reputable sources</li>\n<li>Experience benchmarking and profiling software</li>\n<li>Familiarity with Debian or RedHat Linux</li>\n</ul>\n\n<p>Agnostiq is based in Toronto, Canada, however, we are committed to hiring the best talent available anywhere in the world. This position can be remote, in person, or anything in between.  </p>\n\n<p>If you are interested in applying for this role, please feel free to contact us directly at <a href=\"mailto:careers@agnostiq.ai\" target=\"_blank\" rel=\"nofollow\">careers@agnostiq.ai</a>. Please make sure to include your resume when reaching out (academic CVs welcome).</p>",
        "index": 5,
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": "Out of Country"
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": [
            "software engineering",
            "information technology",
            "react"
        ],
        "lastScraped": "2021-06-08T21:38:43.584Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>",
        "index": 6,
        "remote": true
    },
    {
        "position": "Mobile and Front End Developer (React/React Native)",
        "company": "BurnAlong",
        "location": {
            "city": "New York City • Washington DC • Maryland • Remote",
            "state": "United States"
        },
        "url": "https://angel.co/company/burnalong/jobs/1358078-mobile-and-front-end-developer-react-react-native",
        "skills": [
            "python",
            "react",
            "machine learning",
            "game design",
            "web development"
        ],
        "lastScraped": "2021-06-08T21:38:45.560Z",
        "description": "<p>We’re growing, we’re hiring, and we’re looking for awesome people!  If you want a basic job, look elsewhere.  If you want to be part of an amazing, tight, and mission-driven team, look no further!</p>\n\n<p>This is a rare and exciting opportunity to join a startup that already has global momentum and work closely with the CTO.  Lots of room for growth with the company.</p>\n\n<p>Join us and help us make a difference for people around the world.</p>\n\n<p>If you're passionate about what you do, you do it well, and are looking to be a part of an awesome movement, BurnAlong is the right place for you.</p>\n\n<p>We're currently searching for a Mobile and Front End Developer to work on our most important initiatives. </p>\n\n<p>We are looking for a problem solver, not just a doer.  Become part of a culture of integrity, innovation, and creativity as we revolutionize an entire industry.</p>\n\n<p>Ideal candidates need not apply.  Exceptional and motivated applicants only.  Join us as we help people &amp; businesses achieve better outcomes.</p>\n\n<p><strong>Job Summary:</strong></p>\n\n<p>BurnAlong is looking for a Mobile and Front End Developer to help us rapidly iterate and improve.</p>\n\n<p>We’re looking for someone who understands what it’s like to be part of a startup; someone who works hard and has the optimism to plow through any challenge with a positive attitude. </p>\n\n<p>We’re looking for the perfect fit for the team, not the role - as long as you have a strong skills, a desire to learn, and a positive attitude, we want to hear from you!</p>\n\n<p><strong>Qualifications and Skills:</strong></p>\n\n<ul>\n<li>5+ years of development experience with at least 2 using React / React Native</li>\n<li>React Web Frontend Development</li>\n<li>React-native Web Development</li>\n<li>Mobile Development Experience &amp; Eco-systems</li>\n<li>Node.js Experience a Plus</li>\n<li>Some Python Web Experience (Or Equivalent) a Plus</li>\n<li>API Integration (Rest) &amp; Data Familiarity</li>\n<li>CSS/SASS and  Ui/Ux Implementation</li>\n<li>Automated Testing: Basic JS or Python Test Frameworks a Plus</li>\n<li>Good Communication, Planning/Organization &amp; Teamwork Skills</li>\n</ul>\n\n<p><strong>About you:</strong></p>\n\n<ul>\n<li>You are a good person and recognize others are too.  You maintain respect of others while working through tough challenges and tight timelines;</li>\n<li>You’re passionate about building a great product and you’re a quick learner who is passionate about code. You take initiative to self-teach when needed;</li>\n<li>Ability to work independently and as part of a team with a strong attention to detail. </li>\n<li>You approach problems from a product perspective, thinking through how the user will interact with what you're building;</li>\n<li>You have strong communication skills. You ask questions, let others know when you need help, and tell others what you need;</li>\n<li>You're a problem solver. You believe the best work is the result of finding the simplest solution to complex challenges;</li>\n<li>You have a strong desire to learn and try new things!</li>\n<li> </li>\n</ul>\n\n<p><strong>About BurnAlong:</strong></p>\n\n<p>When friends want to play video games together but can't do so in person, they play online together.</p>\n\n<p>When we can't do an in-person meeting, we connect using tools like Zoom, Skype, FaceTime or google hangout.</p>\n\n<p>When we can't make it to the gym with friends, why should we be stuck at home working out to solo, one-directional experiences… with instructors who we don’t know?</p>\n\n<p>BurnAlong comes to solve the problem, of life often getting in the way of staying mentally and physically fit -- especially with your friends and instructors who you know and trust from your local gym, studio or wellness professional.  We have 45+ categories to choose from and more than 10,000 classes.  </p>\n\n<p>Whole Mind, Whole Body, Whole Life.</p>\n\n<p>We’ve built BurnAlong – to bridge the gap between online and in person - to help those who are struggling to keep wellness and fitness engaging and social.</p>\n\n<p>How?</p>\n\n<p>On BurnAlong you can take classes live online with the friends you invite and your favorite local wellness instructors.  Less Hollywood and more neighborhood – authentic people helping each other stay connected and fit (mentally &amp; physically)…  it’s a surprisingly cool experience and exploding. </p>\n\n<p><strong>Apply Now and Join Us.</strong></p>\n\n<p>This is a rare and exciting opportunity to join a startup that already has global momentum.  Check out our site for more: <a href=\"http://www.BurnAlong.com\" target=\"_blank\" rel=\"nofollow\">www.BurnAlong.com</a>.</p>\n\n<p><strong>Apply today - we want to hear from you!</strong></p>",
        "index": 7,
        "remote": true
    }
]