[
    {
        "url": "https://jobs.apple.com/en-us/details/200253196/hardware-technology-internship?team=STDNT",
        "position": "Hardware Technology Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:42.176Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"152\">Some responsibilities in Hardware or Silicon Engineering may include: \n\nYou will work on real challenges the team faces as well as upcoming products. \n\nYou have a strong technical foundation, are able to show initiative.\n\nLearn new technologies quickly, and possess excellent interpersonal and communication skills. \n\nYou are motivated and prepared to work independently.</span>",
        "index": 1,
        "skills": [
            "hardware",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253203/product-design-internship?team=STDNT",
        "position": "Product Design Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:43.421Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"170\">Some responsibilities in Product Design may include:\n\nAs a member of a multi-functional design team at Apple, you will help to create the next generation of the world's finest hardware devices. You will conceive, design, and bring into production products that will re-define user experience. You will work closely with many different multi-functional teams including Industrial Design, Packaging, Safety, Hardware Engineering, EMC, and Marketing.</span>",
        "index": 2,
        "skills": [
            "hardware",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253195/software-engineering-internship?team=STDNT",
        "position": "Software Engineering Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:44.708Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"162\">Some responsibilities in Hardware or Silicon Engineering may include: \n\nBackend Development - Making the features that Apple users love (like Siri) work by presenting data to the user-facing applications. Backend development opportunities are available for students in the following areas: \n\nSiri, iCloud, Apple Maps, Core OS, OS X, Frameworks and Applications, Interactive Media Group, Audio/Video Software Integration and Localization, Advanced Computation, iLife, iWorks, Aperture, Pro Apps, iTunes, Security, Site Reliability Engineering (SRE) and Platform Infrastructure Engineering (PIE)\n\nCore OS - The Core OS team is responsible for the design and development of core technologies that are deployed across all Apple product areas including the iPhone, iPad, Watch, MacBook, iMac, Apple TV, and audio accessories. (Yes, that's pretty much everything.)\n\nWeb Development - Help build web-based tools and applications to improve our products and do more for our customers. Our developers are responsible for crafting the direction of our products by considering the architecture, performance, testing, design, and implementation. And of course we look for engineers that use our products. \n\nEngineers at Apple work on both UI level and lower-level implementation details. The successful intern candidate will be amenable to working in a dynamic, collaborative environment. The person filling this position must be a hands-on, enthusiastic, self-motivated developer with strong initiative and desire to succeed in a challenging environment. You will have a real passion for extraordinary user experiences and an eye for details. Those applying for the Web Development intern position should include a link to a web portfolio.</span>",
        "index": 3,
        "skills": [
            "software engineering",
            "hardware",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253212/engineering-program-management-internship?team=STDNT",
        "position": "Engineering Program Management Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:45.844Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"150\">Some responsibilities may include:\n\nDefining project plans and schedules and driving project execution\n\nLeading internal and external multi-functional teams in engineering and validation activities\n\nEnsuring tight team coordination and communication\n\nStrong presentation and communication skills \n\nUnderstand and communicate sophisticated, technical issues \n\nIdentify and resolve conflicts, inter-dependencies and program issues quickly and efficiently\n\nLead development budgets and engineering builds</span>",
        "index": 4,
        "skills": [
            "project management",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253210/operations-manufacturing-design-engineer-internship?team=STDNT",
        "position": "Operations, Manufacturing Design Engineer Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:46.805Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">Some of the responsibilities in Manufacturing Engineering may include:\n\nMANUFACTURING DESIGN ENGINEER\nAs an MDE, you will handle selection, implementation &amp; optimization of manufacturing processes for mechanical enclosure subassemblies for our legendary products. \n\nUtilize Mechanical Engineering experience and work cross functionally with Product Design Engineering and Industrial Design \n\nAssess product features for manufacturability, and recommend capable processes and equipment.\n\nDeveloping new manufacturing processes to enable future product design and conducting DOEs to validate process capability. \n\nWork with Global Supplier Managers to identify capable suppliers, assess their secondary processes for capacity, quality and cost.\n\nWork with suppliers to define and refine mechanical tooling, fixtures and establish capability / readiness. \n\nAudit supplier processes and assembly processes and support product phase builds from EVT, DVT PVT and ramp. \n\nAssist post production quality / cost improvement activity related to fixtures and processes.\n\nMANUFACTURING QUALITY ENGINEER\nAs an MQE, you will utilize Engineering, Factory Management &amp; Supply Chain skills in developing and implementing high efficiency inspection equipment, groundbreaking quality systems and ultimately the best products available.\n\nHelp lead the creation of state of the art inspection &amp; measurement equipment for Apple product.\n\nApply your understanding of quality control and manufacturing concepts to lead the development of specific Product Quality Plans (PQP) appropriate to program and commodity.\n\nProvide technical direction and mentorship to other Quality Engineers supporting the implementation of the PQP.\n\nIdentify and direct studies to implement improvements in measuring method where appropriate.\n\nCoordinate Quality Engineering functions for multiple programs in the product category. \n\nCollaborate with internal and external groups to ensure accurate definition of quality expectations and appropriate assurance techniques are used for the product.\n\nSupplier Quality Management - Assist in supplier selection process for new products and sourcing activities. Assess supplier production control and quality programs, identify shortfalls to expectations, and directly secure agreement to correct. Supervise each supplier's performance through measurement of production line statistics, company inspections, and audits.\n\nSUBJECT MATTER AUTHORITY\nOur SME's investigate and develop solutions to overcome difficult technical challenges that require non-standard manufacturing approaches. Apply your engineering skills to develop an in depth understanding of the process drivers that will drive successful implementation of significant improvements to mechanical enclosures. \n\nThe following activities fall within the scope of responsibilities:\n\nAssess mechanical designs and relate design goals to process, equipment, and material requirements to evaluate a set of options to tackle difficult manufacturing problems.\n\nResearch manufacturing processes and evaluate them for potential to achieve technical goals. \n\nPlan and execute development trials to test feasibility, optimize process inputs, and validate capabilities of process options. \n\nPresent analysis to key decision makers used to make significant commercial and design commitments.</span>",
        "index": 5,
        "skills": [
            "project management",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253211/machine-learning-ai-internship?team=STDNT",
        "position": "Machine Learning / AI Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:48.018Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">Some responsibilities in AI/ML may include:\n\nYou will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>",
        "index": 6,
        "skills": [
            "artificial intelligence",
            "machine learning"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253214/business-marketing-and-g-a-internships?team=STDNT",
        "position": "Business, Marketing, and G&A Internships",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:49.826Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"158\">Within Apple, these teams support various lines of business with a mixture of non-technical and technical roles. The people here are a unique mix of backgrounds, experiences, and skills. The teams here are full of dynamic and full of incredibly smart, hardworking, and fun people passionate about technology, digital media, arts and entertainment.\n\nIf you're excited to join one of the most successful companies in the world, then we'd love to hear from you. Let’s do our best work together.\n\nAs an intern, you will learn, grow, and contribute to Apple’s business while working on exciting projects alongside top professionals. \n\nWe truly believe that at Apple, you will do your life’s best work.\n\nInternships are based in SCV and Culver City.\n\nINTERNSHIP OPPORTUNITIES ARE AVAILABLE WITHIN THE FOLLOWING AREAS:\nFinance\n\nLegal\n\nUniversity Relations\n\nWellness\n\nEnvironment, Policy, &amp; Social Initiatives\n\nMarketing\n\nBusiness \n\nCreative\n\nInclusion &amp; Diversity</span>",
        "index": 7,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200241504/finance-development-program-fdp-internship?team=STDNT",
        "position": "Finance Development Program (FDP) Internship",
        "posted": "2021-05-24T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:50.812Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"148\">As a Finance intern, you’ll support a specific area of Apple’s business, such as: \nAppleCare, Financial Services, Internet Software &amp; Services, Marketing, Operations, R&amp;D, Retail, Sales, Worldwide Financial Planning &amp; Analysis, and more. \n\nDuring the summer, you could: \nAnalyze financial performance by highlighting trends and anomalies\nStreamline reporting through the use of databases such as Tableau or with Excel macros\nPartner with cross functional groups and business partners to analyze the business\nProvide insights and recommendations for operational improvements and innovations\nAssist with close procedures\n\nAfter completing a summer internship in Cupertino, successful Finance interns will be eligible for an offer into Apple’s highly desirable Finance Development Program (FDP). The FDP is a two-year rotational program providing entry-level talent with an opportunity to gain breadth through typically six to eight diverse experiences in Apple Finance in Cupertino, CA. Upon completion, FDPs move into non-rotating Financial Analyst roles within Apple.</span>",
        "index": 8,
        "skills": [
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200256173/mba-internships-summer-2022?team=STDNT",
        "position": "MBA Internships - Summer 2022",
        "posted": "2021-06-10T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:52.722Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"154\">APPLECARE\nStrategic Systems Program Manager:\nYou will have the right balance of program management, and technical knowledge to successfully deliver complex cross-functional programs in Apple’s fast-paced environment. As a program manager you will have to manage risk, expectations, and outcomes throughout the whole program roadmap. Work closely with the engineering team by openly and continuously communicating product vision, delivery objectives, and priorities.  Must think as a technical developer, a material subject expert, and a teacher. \n\nPRODUCT OPERATIONS\nOperations Program Manager: \nAs an OPM, you will work with our New Product Introduction (\"NPI\") or Sustaining Operations teams on component &amp; ramp readiness, product launch &amp; ramp, or sustaining operations through ‘end of life’ programs. Run the product manufacturability, testability, and supply chain responsiveness in pursuit of low cost and maximum flexibility while stewarding the highest standards of product quality expected of Apple's products.\n\nA successful OPM excels in program/project management; communicates with ease at all levels; is adept at facilitating actions and resolving conflicts; manages through relationships and influence; and brings calm and control to even the highest-intensity projects. \n\nSTRATEGIC SOURCING\nGlobal Supply Manager: \nYou will interface between Apple and the industries that supply core component technologies. In this role, you are responsible for developing and executing sourcing strategies as well as recommending product innovations based on improving technology. This position requires an interest in market dynamics and competitive behavior, negotiation and pricing, manufacturing processes, and risk mitigation. \n\nSUPPLY CHAIN OPERATIONS\nSupply Demand Management: \nIn SDM, you will hold a critical role in Apple's multi-billion dollar supply chain decisions by forecasting product demand, analyzing production needs, allocating global supply across all channels of distribution and influencing quarterly sales projections used in guidance to Wall Street. Your job will require you to collaborate and influence across many key groups within Apple (Marketing, Sales, Finance, Procurement, Ops, Materials), all in an effort to both set the strategy and drive the execution of products across Apple’s global supply chain.</span>",
        "index": 9,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200253208/hardware-hardware-products-hardware-engineering-internship?team=STDNT",
        "position": "Hardware, Hardware Products, Hardware Engineering Internship",
        "posted": "2021-06-01T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:54.089Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"160\">Some responsibilities in Hardware Engineering may include: \n\nEngineering Program Management: Identifying, evaluating and driving engineering/quality improvements/new supplier qualifications)\n\nCamera/Touch/Display Engineering: Optics, Flat Panel/HW, Touch Mechanical Design. Design &amp; Execute experiments validating new materials (optical, mechanical); Optimize design for performance and reliability\n\nWireless Technologies: Antenna Design, RF System Level Validation, Automated Software/Tool Dev, Optimization of RF Automated Systems, RF Sys Analysis\n\nASIC / VLSI: RTL Design &amp; Implementation, Verification, Integration, Validation, Emulation, Power/Tech &amp; Circuits, CAD, STA, Physical Design, Low Power Design, Signal Integrity, Analog/Mixed Signal, LDV/HDV, DFT\n\nEmbedded/Systems Development: Electrical System Design and Integration, System-Level Testing Support, Schematic Capture, Bug Resolution\n\nAudio/Acoustics/Optical Production Testing and Mechanical Test Design\n\nHuman Interface Devices: Firmware Eng, Low-Level Microcontroller Code Dev, Prototyping concepts, design verification (FPGA), Streamline Electrical Design\n\nFirmware Development: Writing/Debugging Low level firmware, drivers, protocols and other firmware code, developing embedded firmware solutions</span>",
        "index": 10,
        "skills": [
            "software engineering",
            "hardware",
            "project management",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200260748/ai-ml-research-scientist-health-ai?team=MLAI",
        "position": "AI/ML - Research Scientist, Health AI",
        "posted": "2021-06-24T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:55.284Z",
        "location": {
            "city": "New York City",
            "state": "New York"
        },
        "description": "<span data-reactid=\"154\">Your responsibilities include:\nResearching, developing, and implementing the most innovative machine learning, artificial intelligence, statistics, computer vision, and NLP techniques applied to unique health data and problems\nActively engaging with the academic community by publishing papers and presenting your work\nTransferring machine learning solutions to data scientists and engineers on product teams\nProviding technical guidance to product teams on the machine learning approaches appropriate for a task</span>",
        "index": 11,
        "skills": [
            "machine learning",
            "artificial intelligence",
            "software engineering"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200254825/university-relations-operations-recruiter?team=CORSV",
        "position": "University Relations Operations Recruiter",
        "posted": "2021-06-21T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:56.481Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"150\">RESPONSIBILITIES INCLUDE:\n-  Authoritatively own the university recruiting full cycle hiring process\n\n-  Partner with recruiting peers to develop a holistic recruiting strategy on university campuses\n\n-  Know your universities - develop positive relationships with faculty, staff, and student organizations to build a customized approach to recruiting\n\n-  Know your clients - partner with business leaders to assess their recruiting needs and anticipate future needs\n\n-  Know your market - have a pulse on the trends in the university space and modify your hiring strategy to best take advantage\n\n-  Work consistently to ensure an excellent candidate experience from first-touch to post-internship\n\n-  Navigate and overcome any roadblocks in the hiring process through effective use of time and resources\n\n-  Track and analyze recruiting metrics\n\n-  Ability to travel in the US ~20%</span>",
        "index": 12,
        "skills": [],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200249320/university-relations-r-d-recruiter?team=CORSV",
        "position": "University Relations R&D Recruiter",
        "posted": "2021-06-17T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:57.667Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"150\">RESPONSIBILITIES INCLUDE:\n-  Authoritatively own the university recruiting full cycle hiring process\n\n-  Partner with recruiting peers to develop a holistic recruiting strategy on university campuses\n\n-  Know your universities - develop positive relationships with faculty, staff, and student organizations to build a customized approach to recruiting\n\n-  Know your clients - partner with business leaders to assess their recruiting needs and anticipate future needs\n\n-  Know your market - have a pulse on the trends in the university space and modify your hiring strategy to best take advantage\n\n-  Work consistently to ensure an excellent candidate experience from first-touch to post-internship\n\n-  Navigate and overcome any roadblocks in the hiring process through effective use of time and resources\n\n-  Track and analyze recruiting metrics\n\n-  Ability to travel in the US ~20%</span>",
        "index": 13,
        "skills": [],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200254894/university-relations-r-d-recruiter?team=CORSV",
        "position": "University Relations R&D Recruiter",
        "posted": "2021-06-17T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:08:59.044Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"154\">RESPONSIBILITIES INCLUDE:\n\n-  Authoritatively own the university recruiting full cycle hiring process\n\n-  Partner with recruiting peers to develop a holistic recruiting strategy on university campuses\n\n-  Know your universities - develop positive relationships with faculty, staff, and student organizations to build a customized approach to recruiting\n\n-  Know your clients - partner with business leaders to assess their recruiting needs and anticipate future needs\n\n-  Know your market - have a pulse on the trends in the university space and modify your hiring strategy to best take advantage\n\n-  Work consistently to ensure an excellent candidate experience from first-touch to post-internship\n\n-  Navigate and overcome any roadblocks in the hiring process through effective use of time and resources\n\n-  Track and analyze recruiting metrics\n\n-  Ability to travel in the US ~20%</span>",
        "index": 14,
        "skills": [],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200247328/mba-recruiter-university-relations?team=CORSV",
        "position": "MBA Recruiter, University Relations",
        "posted": "2021-06-08T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:00.207Z",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "description": "<span data-reactid=\"152\">Responsibilities Include:\n\n-  Authoritatively own the university recruiting full cycle hiring process\n\n-  Partner with recruiting peers to develop a holistic recruiting strategy on university campuses\n\n-  Know your universities - develop positive relationships with faculty, staff, and student organizations to build a customized approach to recruiting\n\n-  Know your clients - partner with business leaders to assess their recruiting needs and anticipate future needs\n\n-  Know your market - have a pulse on the trends in the university space and modify your hiring strategy to best take advantage\n\n-  Work consistently to ensure an excellent candidate experience from first-touch to post-internship\n\n-  Navigate and overcome any roadblocks in the hiring process through effective use of time and resources\n\n-  Track and analyze recruiting metrics\n\n-  Ability to travel in the US ~20%</span>",
        "index": 15,
        "skills": [],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200234176/early-career-development-program-ecdp-full-stack-software-engineer-network-data-center?team=SFTWR",
        "position": "Early Career Development Program (ECDP) - Full Stack Software Engineer (Network & Data Center)",
        "posted": "2021-06-07T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:02.459Z",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "description": "<span data-reactid=\"150\">EARLY CAREER DEVELOPMENT PROGRAM DESCRIPTION The IS&amp;T Early Career Development Program (ECDP) is for people with less than 12 months of relevant experience in their position and provides employees with the opportunity to build community among themselves by attending educational and social events.  Within IS&amp;T, there are a variety of positions available across many different teams, ranging from special projects for new business initiatives to operations in a rapidly growing and dynamic setting. Examples of positions:  Software Engineer: iOS, front-end, back-end, full-stack  Engineering Project Manager  DevOps Engineer  Machine Learning Engineer  Quality Engineer  Database Engineer   TEAMS THAT ARE HIRING INCLUDE: Online Store Engineering  Worldwide Developer Relations  Enterprise and Retail Networking  Retail Engineering  Collaboration and Productivity  Global Business Intelligence  SAP Global Systems</span>",
        "index": 16,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "networks",
            "devops"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200007574/apple-industrial-design-accepting-portfolios?team=DESGN",
        "position": "Apple Industrial Design Accepting Portfolios",
        "posted": "2021-02-12T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:03.429Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"156\">To apply, please direct a CV and concise PDF portfolio to:  idportfolios@apple.com</span>",
        "index": 17,
        "skills": [],
        "company": "N/A",
        "contact": "idportfolios@apple.com",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193055/hardware-engineer-entry-level-boston?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Boston)",
        "posted": "2021-01-26T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:04.326Z",
        "location": {
            "city": "Boston",
            "state": "Massachusetts"
        },
        "description": "<span data-reactid=\"146\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "index": 18,
        "skills": [
            "software engineering",
            "hardware",
            "python",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200193053/hardware-engineer-entry-level-san-diego?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (San Diego)",
        "posted": "2021-01-26T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:05.247Z",
        "location": {
            "city": "San Diego",
            "state": "California"
        },
        "description": "<span data-reactid=\"146\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "index": 19,
        "skills": [
            "software engineering",
            "hardware",
            "python",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    },
    {
        "url": "https://jobs.apple.com/en-us/details/200186228/hardware-engineer-entry-level-cupertino?team=HRDWR",
        "position": "Hardware Engineer - Entry Level (Cupertino)",
        "posted": "2021-01-26T10:00:00.000Z",
        "lastScraped": "2021-06-28T18:09:06.224Z",
        "location": {
            "city": "Santa Clara Valley (Cupertino)",
            "state": "California"
        },
        "description": "<span data-reactid=\"146\">As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently. \n\nBelow are the various areas you can explore: \n\n<b>RTL Design:</b>You will help in the verification and lab bring-up of advanced mixed-signal circuits. Deep knowledge of chip architecture/microarchitecture, front end pre-silicon design flow, RTL design/coding, logic design, Verilog/System Verilog, low power design, timing/power/performance analysis, C/C++ \n\n<b>Design Verification:</b> In Design Verification, you will enable us to produce fully functional first silicon. Knowledge of chip architecture, Pre-silicon RTL design verification, System Verilog or UVM/OVM/VMM, block/chip/core test bench exp, System Verilog Assertion (SVA), C/C++/assembly, Perl/Python \n\n<b>Physical Design:</b> In Physical Design, you will be at the center of design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class designs Knowledge of basic chip architecture, back end chip design flow, physical synthesis, floor-planning, place and route (PnR), power grid, timing (STA), physical design verification (DRC/LVS), EMIR (Redhawk/Totem/Voltus) \n\n<b>Modeling/Performance Engineer: </b>You will be focused on writing code for modeling and performance modeling for GPUs, CPUs, SoCs and other model infrastructure. C++, SystemC scripting; Python modeling for H/W verification, workloads, correlation, and analysis. experience in chip development environment with RTL and verification define, architect, design and implement and deploy models. \n\n<b>CAD Engineer: </b>You will develop and support chip level design methodology and flow. You'll be plugged into all tech nodes for chip delivery and be able to contribute on multiple projects. Must have excellent CAD flow programming and algorithm development knowledge. You will be collaborating with VLSI design and CAD teams, and EDA vendors to seek some of the most significant design problems. Strong analytical skills, effective communication and leadership qualities. \n\n<b>Signal Integrity/RF Engineer:</b> In RF Integrity, you will engage with cross-disciplinary teams to develop SoCs that will be used in Apple’s mobile devices. Specifically, responsibilities include developing novel methodology to solve very complex coupling issues, mitigating multi-radio coexistence problems at IC, package/module, and systems, as well as executing RF design integration topologies. Prior RF circuit design and EM modeling experience is highly preferred. \n\n<b>Embedded Engineer:</b> In Embedded Software Engineering, you will make up a significant portion of the Silicon Validation and Productization teams. Our embedded engineers develop, port, release, maintain, and enhance software to enable large scale testing of Apple’s SoCs. These engineers will integrate existing test software between environments, enhance test software to exercise functional blocks, develop Linux device drivers and user-land tests, implement device libraries to aid in the portability of device drivers, bring up low-level code on new SoCs and develop our own SMP RTOS. We have several types of embedded software engineers that focus on various aspects of the chip including feature validation (video, audio, display, etc.), IP validation, performance testing, micro-controller code, and low-level software. These engineers work in bare-metal, RTOS, and/or Linux environments to write software that runs on every Apple SoC in the design validation phase and downstream during manufacturing in the factory to identify bugs. C/C++ is the primary coding language (with some ARM Assembly) and Python is the primary scripting language. \n\n<b>Power/Battery Engineer: </b>In this role, you will be on the forefront of development bringing innovations in the industry Electronic circuit design/development experience for microcontroller-based systems. Knowledge of inter-module communication protocols (I2C, SPI, UART, etc.) and familiarity of embedded systems. Prior experience in batteries, portable consumer electronics, Power Supplies, Medical Electronics, or automotive electronics. \n\n<b>Analog/Mixed Signal Engineer: </b>You will work closely with multi-functional teams with an understanding of design specs and requirements for analog mixed signal (AMS) circuits, including SerDes, PLLs &amp; Data Converters. Experience of designing AMS circuit blocks such as bandages, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, oscillators, filters. Device physics knowledge as it applies to analog IC design. \n\n<b>IC Packaging Engineer: </b>You will develop advanced packaging technologies for a multitude of projects including SoC’s Hands on experience with Cadence ADP/SIP. Familiarity with Signal and Power Integrity fundamentals. You'll be responsible for package/SIP layout, optimization, design verification and taping out. \n\n<b>Silicon Validation: </b>You will have the opportunity as either an embedded software engineer, high-speed board design engineer, or debug/triage engineer to work at the cross-section of hardware and software to perform silicon bring-up and system level validation of Apple’s SOCs. These teams build test software environments, debug tools, automated tests, and PCB boards that push functional blocks to their limits in order to root cause failures in the Silicon, identify fixes, and optimize performance and efficiency before we manufacture hundreds of millions of units. Knowledge of debug, silicon bring-up, chip architecture and design, embedded systems, C/C++/assembly, Python/Perl/Tcl. \n\n<b>Platform Engineer: </b>You will work as either an FPGA or Emulation engineer who build prototypes on FPGAs, build emulation models, and perform emulation on each yet-to-be-built chip with the primary goal of debugging. Knowledge of chip architecture and design, industry standard interfaces, FPGA tool flow, Verilog, C/C++/assembly, Python/Perl/Tcl, and debugging.</span>",
        "index": 20,
        "skills": [
            "software engineering",
            "hardware",
            "python",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "company": "N/A",
        "remote": false
    }
]