[
    {
        "url": "https://80000hours.org/job-board/?role=frontend-engineering-intern___recb6zAw5fIFhbGIa",
        "position": "Frontend Engineering Intern",
        "company": "Ought",
        "location": {
            "city": "San Francisco Bay Area",
            "state": "N"
        },
        "posted": "Posted 3 months ago",
        "lastScraped": "2021-07-08T08:27:11.408Z",
        "description": "\"About the role: As a frontend engineering intern at Ought, you will be: Helping create intuitive user interfaces that let research analysts use language models as tools for thought. The role is paid.\"",
        "index": 1,
        "skills": [
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "url": "https://80000hours.org/job-board/?role=software-engineering-intern___recPGOrZ1g1wps1pU",
        "position": "Software Engineering Intern",
        "company": "Ought",
        "location": {
            "city": "San Francisco Bay Area",
            "state": "N"
        },
        "posted": "Posted 5 months ago",
        "lastScraped": "2021-07-08T08:27:13.426Z",
        "description": "\"Ought is an applied research lab building Elicit, a GPT-3-based research assistant for questions about the future. Today, researchers and policy analysts use Elicit to find relevant publications for a literature review, find datasets, or brainstorm research questions that are interesting to their audience. Researchers can define new tasks by showing Elicit just a few examples of the task being done. Elicit then scales those tasks to thousands of publications and datasets [...]",
        "index": 2,
        "skills": [
            "software engineering"
        ],
        "remote": false
    },
    {
        "url": "https://80000hours.org/job-board/?role=research-intern-competition-with-china___recSUSFuT8R8i9A2J",
        "position": "Research Intern, Competition with China, AI infrastructure investment, and Algorithmic Fairness",
        "company": "Schmidt Futures",
        "location": {
            "city": "New York, NY",
            "state": "N"
        },
        "posted": "Posted 7 months ago",
        "lastScraped": "2021-07-08T08:27:15.276Z",
        "description": "\"Many of the most pressing global policy challenges today have technical problems at their core (e.g. tech competition with China, AI infrastructure investment, global internet standards, and algorithmic fairness). Yet the top policy research groups and think tanks driving new policy ideas lack technical expertise on staff or within their networks. Solving these challenges requires technical insight, which can uniquely be produced by exceptional technical talent. We are seeking “Computer Science + policy” research interns to help build a next-generation technical strategy group from the ground up to solve this by producing cutting edge knowledge products on tech strategy questions to drive decision making for policymakers and philanthropic investment.",
        "index": 3,
        "skills": [
            "networks",
            "artificial intelligence"
        ],
        "remote": false
    },
    {
        "url": "https://80000hours.org/job-board/?role=intern-ml-technical-research___recOdYGIE8FUaet3w",
        "position": "Intern, ML Technical Research",
        "company": "Tencent",
        "location": {
            "city": "Shenzhen, China",
            "state": "N"
        },
        "posted": "Posted 8 months ago",
        "lastScraped": "2021-07-08T08:27:17.701Z",
        "description": "\"What is the most important thing for a researcher? Is it hundreds of millions of data, rich application scenarios, ultra-large-scale computing resources, deep technology accumulation in the full spectrum of fields, or the pursuit of the ultimate innovation atmosphere? As a research engineer in the field of natural language processing, you'll be: 1. Responsible for the research and development of natural language processing algorithms, including but not limited to semantic analysis, intention recognition, human-machine dialogue, semantic mining, machine translation, knowledge graphs, named entity recognition, etc,; 2. Responsible for the technical research of dialogue systems, especially task-oriented dialogue systems, including natural language understanding [...]\"",
        "index": 4,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "url": "https://80000hours.org/job-board/?role=research-intern-natural-language-and-sp___reczUzzYBbIyYFon1",
        "position": "Research Intern, Natural Language and Speech Processing",
        "company": "Tencent",
        "location": {
            "city": "Seattle metro area",
            "state": "N"
        },
        "posted": "Posted 8 months ago",
        "lastScraped": "2021-07-08T08:27:20.008Z",
        "description": "\"We are seeking natural language & speech processing research interns in our Seattle office located at Bellevue WA for year 2019. You will be working with researchers on a research project related to one of the core problems in natural language processing (e.g., natural language understanding and generation, question and answering, reading comprehension, and knowledge graph inference), dialog system (e.g., multi-turn, multi-modal, and multi-user dialog tracking and management), and speech recognition and synthesis (e.g., new paradigm). You will work on real and/or big data using our high-performing computing facility and are encouraged to publish the results of your internship. Key responsibilities:",
        "index": 5,
        "skills": [
            "project management"
        ],
        "remote": false
    },
    {
        "url": "https://80000hours.org/job-board/?role=machine-learning-intern___recZmD7f6W0Qsrpwp",
        "position": "Machine Learning Intern",
        "company": "University of Montreal, Institute for Learning Algorithms",
        "location": {
            "city": "Quebec, Canada",
            "state": "N"
        },
        "posted": "Posted 8 months ago",
        "lastScraped": "2021-07-08T08:27:21.903Z",
        "description": "\"To become an intern at Mila, you must first be supervised by one of its associate professors.The requests for supervision are made via a Mila application form. Internships are considered paid jobs, unless you are a Canadian citizen or permanent resident, you will also need to apply for the appropriate work permit. Complete the online Mila Supervision Request Form. You will receive an acknowledgment of receipt. We recommend that you also contact one ore more professors by email to encourage them to review your application (we receive a lot of requests, please be patient).",
        "index": 6,
        "skills": [
            "machine learning"
        ],
        "compensation": "paid",
        "remote": false
    }
]