[
    {
        "position": "Data Science Intern",
        "company": "Candid",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-07-23T07:32:32.904Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/1c3e2cbebe304b6d9bbe60cdefccb3d1-data-science-intern-candid-new-york",
        "lastScraped": "2021-07-29T07:32:32.904Z",
        "description": "<p>Candid seeks a resourceful, creative, conscientious, and detail-oriented intern to work closely with the Candid Data Science team to address problems in natural language processing.</p><p><strong>See the world. Make it better. </strong></p><p>On February 1, 2019, Foundation Center and GuideStar joined forces to become Candid,</p><p>a 501(c)(3) nonprofit organization. Candid connects people who want to change the world to the resources they need to do it.&nbsp;</p><p>Every year, millions of nonprofits spend trillions of dollars around the world. Candid finds out where that money comes from, where it goes, and why it matters. Through research, collaboration, and training, Candid connects people who want to change the world to the resources they need to do it. Candid’s data tools on nonprofits, foundations, and grants are the most comprehensive in the world.&nbsp;</p><p>Candid’s vision is an ambitious one. But we know that when we make investments in our</p><p>talent, it translates to more access and better knowledge for those working for social good around the world.</p><p><strong>Position: </strong>Data Science Intern</p><p><strong>Reporting to: </strong>Data Scientist</p><p><strong>Schedule: </strong>19 hours per week, Monday through Friday between the hours of 9:00am to 5:00pm during the Fall semester</p><p><strong>Location: </strong>Remote, New York, NY or Williamsburg, VA (due to the Covid-19 pandemic, this position may be remote until our offices reopen)</p><p><strong>Position summary</strong></p><p>Candid (candid.org), the nation’s leading authority on philanthropy, seeks a resourceful, creative, conscientious, and detail-oriented intern to work closely with the Candid Data Science team to address problems in natural language processing.</p><p>The successful candidate will demonstrate a commitment to excellence, the ability to think and learn quickly, strong organizational skills and attention to detail, and an appreciation for the activities of the nonprofit sector.</p><p><strong>Career Exploration</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exposure to machine learning on real-world data.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exposure to modern techniques in natural language processing.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exposure to the day to operations of the Candid Agile/Scrum development process.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exposure to creative approach to design problems, meetings and brainstorming concepts.</p><p><strong>Responsibilities</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to develop in Python and to work with mathematical computing libraries.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to identify and engineer features for supervised and semi-supervised machine learning tasks.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work within an Agile Development framework.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work closely with Product Teams to understand the “definition of done”.</p><p><strong>Requirements</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pursuing a degree in mathematics, statistics, computer science or related field.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Basic understanding of common machine learning algorithms, and a desire to learn more.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of Python.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of mathematical computing libraries for Python, such as NumPy, a plus.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Professional, positive attitude.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Willingness to perform other duties and special projects as needed/requested.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sensitivity and respect for racial, gender, sexual orientation, and cultural differences.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Champions and represents Candid’s core values: We’re driven, direct, accessible, curious, and inclusive.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Speaking proficiency in Spanish or French is a plus.</p>",
        "index": 1,
        "skills": [
            "data science",
            "machine learning",
            "python",
            "c and c++",
            "project management",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Pathways Fellowship for Aspiring Educators of Color",
        "company": "The Pathways Fellowship at ExpandED Schools",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-07-17T07:32:35.637Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/53dbee9d43a446849c0f14766eabb6df-pathways-fellowship-for-aspiring-educators-of-color-the-pathways-fellowship-at-expanded-schools-new-york",
        "lastScraped": "2021-07-29T07:32:35.637Z",
        "description": "<p>What is the Pathways Fellowship?</p><p>The Pathways Fellowship is a 10-month program designed to provide young men and women of color, who aspire to become K-12 teachers in New York City, with an enriching experience that offers: professional development workshops, an after-school practicum, early career support, mentorship, and networking opportunities. The program offers Fellows three different tracks--General Education, STEM, or Computer Science-- to receive training.</p><ul><li>General Education: Fellows will be placed in an after-school practicum to provide academic and enrichment activities, curricula support, and small group tutoring to youth. This track targets predominantly young males of color to prepare them for successful entry into New York’s City teaching workforce. Participants who opt into this track can potentially benefit from further support through NYC Men Teach after completing the program.</li><li>STEM: Fellows will be placed in an after-school practicum to provide academic and enrichment activities using STEM curriculum. In the STEM track, you will discover the techniques and tools to feel confident delivering high-quality STEM lessons. This track targets young women and men of color who have an interest in becoming a STEM teacher in New York City public schools.</li><li>Computer Science: Similar to the STEM track, fellows will be placed in an after-school practicum to provide academic and enrichment activities using a computer science curriculum. This track targets young women and men of color who have an interest in becoming computer science teachers in New York City public schools.</li></ul><p>To be considered you must:</p><p>• Be enrolled at a CUNY school or a college/university in New York City.</p><p>• Be a rising senior (graduate in the spring of 2022) or a rising junior (graduate in spring of 2023).</p><p>• Be committed to employment as a New York City public school teacher upon receiving your bachelor's</p><p>• Have a minimum 3.0 grade point average (special consideration may given if lower than 3.0 )</p><p>• Be able to satisfy pre-employment screening, including employment eligibility verification and background checks by related agencies, such as New York City Department of Education and Department of Health</p><p>If you have recently graduated within the past 3 years with a bachelor’s degree you are also eligible to apply for the Pathways Fellowship.</p><p>If you wish to apply to the Computer Science or STEM track, you also must have a demonstrated interest in the field not necessarily experience.</p><p>Time Commitment</p><p>As a participant you will be required to:</p><p>•Actively participate and contribute to the Fellowship from August 2021 to June 2022</p><p>•Attend professional development workshops at ExpandED Schools.</p><p>•Participate in a paid afterschool practicum from Monday through Friday from 2:00 pm to 6:00 pm</p>",
        "index": 2,
        "skills": [
            "networks"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]