[
    {
        "position": "BR-16 Human Resources Intern",
        "company": "N/A",
        "location": {
            "city": "Washington",
            "state": "District Of Columbia"
        },
        "posted": "2021-05-13T21:58:20.712Z",
        "url": "https://www.idealist.org/en/internship/d8ca4978869044fd927be439f26498d8-br-16-human-resources-intern-wwf-washington-dc-washington",
        "lastScraped": "2021-06-09T21:58:20.712Z",
        "description": "<p><strong>Overview</strong></p><p><br></p><p><strong><u>WWF Overview</u></strong></p><p>For 60 years, WWF has worked to help people and nature thrive. As one of the world's leading conservation organization, WWF works in more than 100 countries, connecting cutting-edge conservation science with the collective power of our partners in the field – more than one million supporters in the United States and five million globally, as well as partnerships with communities, companies, and governments.</p><p><br></p><p>Our vision for diversity, equity and inclusion at WWF is an organization as diverse as the world we protect; where the richness of all our unique views, experiences, and backgrounds combines to create the most sustainable and inclusive conservation outcomes possible — bringing the greatest benefit to the planet and every person who lives on it.</p><p><br></p><p>Across the many cultures and individuals that represent WWF, we are unified by one mission, one brand, and one common set of values: Courage, Respect, Integrity and Collaboration.</p><p><br></p><p><strong><u>Internships at WWF</u></strong></p><p>WWF's internship program vision is to recruit professionals early in their careers who bring fresh thinking and innovation to the environmental and conservation sector and are well positioned to develop into the next generation of leaders. Our mission is to increase exposure of students from underrepresented populations to conservation and environmental careers, provide professional development opportunities, reduce the barriers to attracting a diverse pool of internship candidates, and develop a pipeline for future WWF hires from underrepresented populations.</p><p><br></p><p><strong>Position Overview</strong></p><p>World Wildlife Fund (WWF), one of the world's leading conservation organizations, seeks a Human Resources Intern with the Human Resources Team.</p><p><br></p><p><strong><u>Position Summary</u></strong></p><p>The Job Description is one of the most important Personnel Documents for an employee. The Job Description is a roadmap of core responsibilities and duties that also articulates the competencies necessary to perform successfully in one's role. Over the years, WWF has had multiple repositories and formats for the all-important Job Description, and to date, final versions have been inconsistently filed, filed in different locations, gone missing entirely, etc. As a result:</p><ul><li>Finding the most recent job description for any given role or individual employee is difficult and time consuming.</li><li>Some job descriptions are not available or need to be written from memory/scratch.</li><li>HR Business Partners (HRBPs) cannot easily access an specific employee's job description at any given time, because job descriptions are organized not by individuals name, but by job title.</li><li>Multiple job descriptions may exist for one job title (and job titles have also historically been inconsistently applied), so it is difficult to say which description corresponds to each employee.</li></ul><p>This internship will play a pivotal role in leading the charge on “WWF's Job Description Repository Project”. The successful culmination of this project will result in a cohesive and up-to-date WWF Jobs Repository where each employee (~600 total) has an updated job description at all times. The repository must be intuitive to navigate and easy to access for HR Business Partners and other HR colleagues. This is an opportunity to provide great value to what has been a pain-point for WWF employees and HR alike for many years.</p><p><br></p><p><br></p><p><strong>Responsibilities</strong></p><p><br></p><ul><li>Work closely with the HR Business Partners team to learn the various historical repositories and processes for housing Job Descriptions</li><li>Become oriented to all HR systems and filing structures</li><li>Create a detailed tracker for each division (corresponding to each HR Business Partner) and up-to-date job title, level, family, etc. and maintain a record of when each employee's current job description has been saved within the tracker.</li><li>Match each WWF employee with existing job descriptions and put in the repository.</li><li>Create a report of employee status: updated, dated, or missing job description.</li><li>Organize and implement a process for maintaining and updating employee job descriptions so all employees have an up-to-date job description in their file at all times.</li><li>Present a final report and close the project.</li><li>Other duties as assigned.</li></ul><p><strong>Internship Description</strong></p><p>Working in close coordination with the HRBP team and WWF Departments' leaders, managers and staff, the HR Intern will lead the execution of the WWF's Job Description Repository Project.</p><p><br></p><p><strong>Learning Outcomes</strong></p><p>You will learn how to get a project done, start to finish, and resolve any obstacles that come your way in the process. Reverse engineer and manage your time starting from the project's outcome; you will learn to monitor and course correct to ensure successful completion. You will develop the leadership skills necessary to entice people at all levels of WWF to support and contribute your work. Your manager will provide you with support and constant feedback to make your internship a success by developing planning, project management and leadership skills.</p><p><strong>Qualifications</strong></p><p><br></p><p><strong>Minimum Requirements</strong></p><ul><li>We will be focused on the skills and abilities in this selection process.</li><li>Experience managing a similar project, organizing electronic data, repositories is a plus, but not required.</li><li>We believe this will be an interesting opportunity for somebody interested in Human Resources or more specifically in HR Operations or the HR Business Partner role. That said we don't have a specific field of study required for this role. If the description of this internship sounds like something you are well suited to do and aligned with your interests, you are welcome to apply.</li><li>Identifies and aligns with the core values of the WWF organization: Courage, Integrity, Respect &amp; Collaboration</li></ul><p><strong>Skills and Abilities</strong></p><ul><li>Fluent computer skills: email, creating folders, renaming files, moving files around, Word, Excel. Power Point a plus.</li><li>Analytic and systematic on managing large quantities of data and files.</li><li>Attention to detail and fast paced.</li><li>Planning and organizing ability.</li><li>Work based in goals and deadlines.</li><li>Effective communicator: strong written and verbal communication skills</li><li>Influence others with no formal authority</li><li>Organized and self-motivated</li></ul><p><strong>Location:</strong></p><p>US Remote – WWF employs interns in all states with the exception of: Alabama, Arkansas, Hawaii, Idaho, Indiana, Iowa, Kentucky, Louisiana, Mississippi, Nevada, New Hampshire, North Dakota, Oklahoma, Rhode Island, Wisconsin, Wyoming.</p><p><br></p><p><strong>Compensation:</strong></p><p>Paid - $15 per hour (35 hours per week)</p><p>One time stipend – net $100</p><p><br></p><p><strong>How to apply:</strong> <strong>Please submit cover letter and resume through our </strong><a href=\"https://careers-wwfus.icims.com/jobs?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Careers Page</strong></a><strong>, Requisition #BR-16. Application deadline is May 17th, 2021 at 11:59 PM EST. </strong></p><p>If selected for the role, you will need to provide 2 letters of recommendation as part of the WWF application process.</p><p><br></p><p><strong><u>* Please note that intern must have U.S. work authorization that does not require sponsorship of a visa.</u></strong></p><p><br></p><p><strong>As an EOE/AA employer, WWF will not discriminate in its employment practices due to an applicant's race, color, religion, sex, national origin, age, marital status, genetic information, sexual orientation, gender identity and expression, disability, or protected Veteran status.</strong></p><p><br></p><p><a href=\"https://www.click2apply.net/z1Lj7luAgaoYfJllsYEe7?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Apply Here</a></p><p>PI136385954</p>",
        "index": 1,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2021-05-17T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Science Based Targets Network Summer Intern",
        "company": "Science Based Targets Network",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-06-03T21:58:22.665Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/5ae11405c37e42cf9c57d9b47dabb545-science-based-targets-network-summer-intern-science-based-targets-network-new-york",
        "lastScraped": "2021-06-09T21:58:22.665Z",
        "description": "<p>Do you care about environmental issues? Would you like to be at the heart of driving change to create a global economy in which companies and cities operate within environmental boundaries on a socially equitable basis?&nbsp;</p><p><br></p><p>Science Based Targets Network is seeking a highly motivated summer intern to support the implementation of its corporate engagement strategy and to drive other strategic initiatives.</p><p><br></p><p><strong>Project/organization overview</strong></p><p><a href=\"http://sciencebasedtargetsnetwork.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Science Based Targets Network</a> (SBTN) is currently developing the technical methodologies, targets, and tools to translate global goals (such as those set by the UN Convention on Biological Diversity) into actionable targets -- science-based targets (SBTs) -- for companies, cities and investors. In parallel, the network is working to engage with companies and cities to support and encourage them to set SBTs, to help them move from “doing a bit better” to “doing enough” to stay within Earth’s limits.</p><p><br></p><p>SBTN builds on the momentum of the<a href=\"https://sciencebasedtargets.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"> Science-Based Targets initiative</a> (SBTi), which has spurred roughly 850 of the world’s largest companies to commit to greenhouse gas emissions reduction targets in line with climate science.</p><p><br></p><p>SBTN is part of the <a href=\"http://globalcommonsalliance.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Global Commons Alliance</a> (GCA), which is a network of 25+ leading nonprofits and influential actors focused on systems change. This unprecedented collaboration brings together powerful leadership, science, innovation, technology, and communications to positively transform the global economy and protect the global commons.&nbsp;</p><p><br></p><p><strong>Job overview + responsibilities and duties</strong></p><p>Your responsibilities may include:</p><ul><li>Supporting the implementation of SBTN’s corporate engagement strategy&nbsp;</li><li>Providing project management support for several programs and projects&nbsp;</li><li>Conducting data analyses (qualitative and quantitative) on select activities and engagements</li><li>Coordinating and editing knowledge outputs (meetings, webinars, training sessions)</li><li>Operational support and front desk tasks as needed</li><li>Manage the Corporate Engagement Program communication and emails&nbsp;</li><li>Update and manage SBTN’s CRM for the Corporate Engagement Program</li><li>Working to identify and execute on high-priority special projects&nbsp;</li><li>Helping to run team operations, from assistance with external event coordination to contributing to internal communications for key stakeholders</li></ul><p><br></p><p><strong>Learning outcomes&nbsp;</strong></p><p>Candidate will gain experience in:</p><ul><li>Contributing to a complex, early stage, multi-partner initiative involving leading institutions such as the World Economic Forum, World Resources Institute, and WWF</li><li>Working with nonprofits, companies, cities and other stakeholders on a range of environmental sustainability issue areas such as climate, freshwater, land, ocean and biodiversity</li><li>Driving systems change strategies that tackle global issues and location-based solutions</li><li>Being part of a diverse, remotely based, top caliber team with cutting edge science, strategy, multi-stakeholder coalition and project management expertise</li></ul><p><br></p><p><strong>Skillset and experience requirements</strong></p><ul><li>Candidate will be currently working to pursue a Bachelor’s or Master’s degree</li><li>Self-starter and an ability to take initiative</li><li>High attention to detail, organized, and committed to achieving high standards</li><li>Strong analytical skills, both quantitative and qualitative. Ability to perform advanced analysis in Excel&nbsp;</li><li>Ability to conduct and manage video meetings. Understands the various functions of video conferencing platforms such as Zoom, Google Meet, etc.&nbsp;</li><li>Ability to develop new strategies and innovative projects, embracing complex and at times ambiguous challenges with a ‘can-do’ and hypothesis-driven approach</li><li>Strong written and verbal communication skills</li><li>A positive and enthusiastic team player with the ability to work under pressure in a fast-paced, dynamic start up environment</li><li>Collaborative spirit to liaise with a wide range of people at all levels and across different cultures, with credibility and diplomacy</li><li>Committed and motivated to achieve the aims of SBTN</li><li>English fluency</li></ul><p><br></p><p><strong>How to apply</strong></p><p>To apply please email your CV and a cover letter stating how you meet the required skills and experience or key responsibilities to <u>corporate-engagement@sciencebasedtargetsnetwork.org</u> with the subject line: ‘SBTN Summer Intern, First name, Last name’.<strong>&nbsp;</strong></p><p><br></p><p><strong><em>Payment: </em></strong>This internship will be paid on an hourly basis</p><p><strong><em>Location: </em></strong>Remote (Supervising staff is in ET)</p><p><strong><em>Internship period: </em></strong>ASAP to Mid-August</p><p><strong><em>Hours</em></strong>: 20 hours/week (negotiable)</p><p><strong><em>Required equipment:</em></strong> Laptop computer with internet access sufficient for video conferencing&nbsp;</p>",
        "index": 2,
        "skills": [
            "project management",
            "networks",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "MEDICINE AND HEALTHCARE EXPERIENCE & OBSERVATION",
        "company": "Aldeas de Paz - Peace Villages",
        "location": {
            "city": "Santa Barbara de Samaná",
            "state": "Dominican Republic"
        },
        "posted": "2021-05-17T21:58:24.814Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/a95834fea2ac476c845815dbaf54deaa-medicine-and-healthcare-experience-observation-aldeas-de-paz-peace-villages-santa-barbara-de-samana",
        "lastScraped": "2021-06-09T21:58:24.814Z",
        "description": "<h2><strong>MEDICINE AND HEALTHCARE EXPERIENCE &amp; OBSERVATION - Work side by side with medical staff at the local hospital</strong></h2><p><strong>Gain invaluable hands-on experience, working side by side with medical staff and fellow volunteers at a hospital or a neighborhood health clinic.</strong> This opportunity will give you an insight into the running and daily routine of a hospital or a neighborhood health clinic. You will experience the stark contrast between Western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing, there are many challenges faced and as a result you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage. Therefore this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country.</p><p>Furthermore, you can gain experience in a range of different departments and activities within the hospital/health clinic, such as: emergency, pediatric, maternity (only female volunteers), diabetes, integral attention &amp; prevention for HIV, tuberculosis and uterine cancer as well as nursing, hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the hospital pharmacy. You are welcome to also work on our other projects such as the English and computer literacy classes for locals.</p><p>This opportunity will give you an insight into the day to day running of a hospital or clinic. You will experience the stark contrast between western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing there are many challenges faced and there are realities not often seen in developed countries. Therefore, this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country where you will be faced with the stark realities of the disparities between medical practice in the developed and developing world. This means that, sadly, you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage uncommon in developed countries. Furthermore, you can gain experience in a range of different departments and activities within the hospital, such as: Emergency, Pediatry, Maternity (only female volunteers), Diabetes and Integral Attention &amp; Prevention for HIV, Tuberculosis and Uterine Cancer as well as Nursing, Hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the pharmacy.</p><p>Your level of possible involvement will largely depend on your Spanish language skills and experiences in the field, as well as your motivation and willingness to get involved. It will also depend on the current needs and tasks at the hospital as we really want to help out wherever our help is needed most. Your work schedule will be created in a meeting with the departmental director and the volunteer coordinator and supervisor. In this process we always try to match your interests and skills with the current situation at the hospital. In order to gain the most out of your experience, and especially if you have a specific health care goal, please contact us in advance to discuss your options in detail. Please keep in mind that hospitalized patient care in the Dominican Republic is much less extensive compared to nursery practices in the western world! It is common to see that family members are expected to take care of their patient at the hospital.&nbsp;</p><p><strong>What to expect</strong></p><p>You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs.</p><p><strong>Activities can include but are not limited to&nbsp;</strong></p><ul><li>Observing, shadowing and assisting doctors and nurses during their work</li><li>Participating in patient care: comforting patients and assisting with examinations</li><li>Providing ambulance support when needed</li><li>Assisting, teaching and encouraging prevention, hygiene and checkups</li><li>Assisting in developing educational materials and engagement strategies for various prevention programs using multimedia&nbsp;</li><li>Helping regularly with hospital administration tasks and helping improve procedures and workflow</li><li>Some volunteers may also choose to teach English to the doctors, provided that there is a sufficient number of doctors interested</li><li>Foreign medical missions visit and work at the hospital several times a year. You may accompany them and translate for them and the patients</li></ul><p><strong>Requirements&nbsp;</strong></p><p>This program is suitable for pre-medical students and students of pharmaceutics as well as nursing students with free holiday time, pre-university students, students taking or planning to take specialist medical courses such as biomedical science, nursing and physiotherapy as well as professionals. The key requirements for a medical volunteer or intern are initiative, enthusiasm, and readiness to work in unfamiliar circumstances. If volunteers have more specialized skills, this will allow for more specialized activities. Basic conversational Spanish skills are required and the more advanced your level of experience and Spanish language skills, the larger the number of opportunities available. To allow a deeper engagement with your placement we offer free Spanish language lessons every week allowing for an enhanced experience as a volunteer/intern with us. Suggestions on what to bring: Please bring scrubs and easy to clean comfortable closed shoes to wear as they are mandatory</p><p>Please bring scrubs and closed shoes that are easy to clean for working in the hospital, as they are mandatory. Latex gloves, hand sanitizer and face masks (N95 for the TB patients) would be a very helpful donation to the dental clinic.</p><p><strong>Guidelines on medical Issues of the Dominican Republic:</strong></p><ul><li>WHO reportcon health care reform in Dominican Republic, 2010</li><li>Health System of the Dominican Republic, 2011. The website provides an excellent overview of common medical issues in the DR and the government health system. Only available in Spanish.</li></ul><p><strong>Volunteer Placement or Internship </strong></p><p>You can join this program as a volunteer and are free to commit from between 20 to 40 hours per week. Thats up to you! As an intern however you probably have to fulfill requirements set by your school or university. Please inform us of your school or university’s internship requirements in advance so that we can work out your personalized work plan together. Also tell us about your personal expectations and goals and we will see how we can help you achieve them.</p><p><strong>Time Commitment&nbsp;</strong></p><p>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a six to eight week minimum time commitment is encouraged. You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs. Spanish speakers will get the most out of the rotation. Friendly and welcoming physicians, nurses, and patients make this rotation a joy to be a part of! You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Availability </strong>this program is ongoing throughout the whole year</p><p><strong>Placement Locations</strong>: Hospital and neighbourhood health clinics in Samana, La Pascuala and Las Terrenas</p><p><strong>Time Commitment </strong>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a 6 to 8 week minimum time commitment is encouraged. You can join this program throughout the whole year.&nbsp;You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Financial Contribution &amp; Benefits&nbsp;</strong></p><p>Aldeas de Paz works hard to keep the required financial contribution to an absolute minimum and to offer financial transparency by practicing an open book policy. The calculation of your financial contribution or donation is set up so that the longer you stay the less you give per week. We do this to encourage longer stays, recognizing that longer stays lead to more significant volunteer work and more energy contributed in the form of donated time in place of money! The minimum contribution starts at €175 per week and includes Spanish language classes, double room at one of our fully equipped guesthouse apartments, a special program donation as well as a personal welcome service and pick-up at the airport, transfer to the bus, bus fare and free transfer to your placement location in Las Terrenas or Samana. If you wish a single room upgrade add €50 per week and an all in Host Family homestay upgrade is €150 per week, including a private bedroom and two meals per day. For more information about costs and benefits check out our <a href=\"http://www.peacevillages.org/fee?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">webpage</a>.</p><p><strong>What is included</strong></p><ul><li>Welcome Service at the airport and transport to your placement location&nbsp;</li><li>Volunteer or Internship placement</li><li>Accommodation of your choice</li><li>Placement introduction, training, supervision, briefings and meetings</li><li>Free regular Spanish lessons throughout your placement&nbsp;</li><li>Free Wifi and use of washing machine at all our facilities&nbsp;</li><li>Certificate, written reference and student credit</li><li>Information about adventure packages</li><li>Full support and 24/7 backup from local staff</li></ul><p><strong>Special Offer&nbsp;</strong></p><p><strong>Spanish language classes</strong>: Volunteers and interns receive free language lessons every week. The classes focus on developing communication skills so that students are able to put their knowledge to practical use as soon as they step outside the classroom. Our teaching method enables students to develop four basic skills: listening comprehension, speaking, reading and writing. The idea is to learn Spanish in a natural and spontaneous way, just as students have learned their mother tongue. Our students are encouraged to speak Spanish right from the very first day, using it in typical real-life situations: the basic syllabus is supplemented by special exercises, such as role-play, situational dialogues and work projects. Outside the classroom, the learning process continues as you are immersed in the Spanish language and the Dominican culture.</p><p><strong>Contact Information&nbsp;</strong></p><p>Contact Person: Manfred Mönnighoff</p><p>Project/charity name: Fundación Aldeas de Paz</p><p>Address: Samana, Dominican Republic</p><p>Whatsapp: +1 829 7055 123</p><p>E-Mail: <a href=\"mailto:mail@peacevillages.org\">mail@peacevillages.org</a></p><p>Webpage: <a href=\"https://www.peacevillages.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.peacevillages.org</a></p><p>Facebook: <a href=\"https://www.facebook/AldeasdePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.facebook/AldeasdePaz</a></p><p>Instagram: <a href=\"https://www.instagram.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.instagram.com/AldeasDePaz</a></p><p>Twitter: <a href=\"https://twitter.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://twitter.com/AldeasDePaz</a></p><p>YouTube: <a href=\"http://www.youtube.com/Peacevillages?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">http://www.youtube.com/Peacevillages</a></p>",
        "index": 3,
        "skills": [
            "machine learning",
            "project management",
            "virtual reality",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Federal Volunteer Service or Internship as Consumer and Market Research Assistant in the Food Industry and Retail Department",
        "company": "ProVeg",
        "location": {
            "city": "Berlin",
            "state": "Berlin"
        },
        "posted": "2021-06-01T21:58:26.773Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/5871b7f2194b4de1ad3f5a2977d37e06-federal-volunteer-service-or-internship-as-consumer-and-market-research-assistant-in-the-food-industry-and-retail-department-proveg-berlin",
        "lastScraped": "2021-06-09T21:58:26.773Z",
        "description": "<p>ROLE SUMMARY</p><p>Are you interested in assisting the international Food Industry &amp; Retail team in supporting companies along their journey to offering more plant-based alternatives? Then this Federal Volunteer Service or internship is for you!</p><p><br></p><p>We are active in the following fields:</p><p>- Primary and secondary market research</p><p>- Corporate consultancies</p><p>- Speaking at conferences and collaborating with trade fairs</p><p>- Media work</p><p>- Collaborations with experts from science and research</p><p>- Projects</p><p><br></p><p>An exciting opportunity has arisen to lead on the identification and cataloguing of existing academic research and market data related to the plant based-space. In the role, you will have the opportunity to identify and review academic literature, market data (from renowned market research agencies) and wider trends from the plant-based food and beverage sector, providing you with the unique opportunity to enhance your research skills by connecting with experts within the plant-based space.</p><p><br></p><p><br></p><p>RESPONSIBILITIES</p><p>- Independently searching, pre-selecting and structuring internal and external data and literature</p><p>- Shaping, refining and delivering the data-gathering process, taking a user-centric approach to the cataloguing of data, research and reports</p><p>- Carrying out regular data maintenance and ad-hoc research activities</p><p>- Taking over administrative and organisational tasks</p><p>- Preparing and carrying out own smaller projects.</p><p><br></p><p>QUALIFICATIONS</p><p>- Able to navigate academic literature, journals, sales data and market reports to gather and catalogue relevant information</p><p>- Confident in handling large amounts of data and information</p><p>- Skilled in identifying information and trends, and able to write clear concise summaries</p><p>- Ability to work in an independent, structured, proactive, pragmatic, and efficient manner.</p><p>- Excellent analytical skills and the ability to recognise interrelations.</p><p>- Excellent English language skills</p><p>- Excellent computer skills, with confidence in using basic functions of Excel and ideally some familiarity with WordPress or similar platforms</p><p>- You are a long-term thinker and don’t lose your motivation without short-term successes.</p><p>- You identify with the goals and values of ProVeg.</p><p>- Ideally, you are studying or have completed studies in the field of consumer studies, communication science, food technology, food economics, nutritional sciences, business administration or similar, or already have work experience in these areas.</p><p><br></p><p>WHEN?</p><p>Start: September</p><p>Period: BFD min. 6 to max. 18 months, voluntary internships 3 months, compulsory internships up to 6 months, Full-time or part-time (only available for interns)</p><p>Location: Berlin (or remotely - interns only)</p>",
        "index": 4,
        "skills": [
            "information technology",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Archival Intern",
        "company": "AFS Intercultural Programs",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-05-26T21:58:28.891Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/18b83741696f4c8ebe6c9b415a25a663-archival-intern-afs-intercultural-programs-new-york",
        "lastScraped": "2021-06-09T21:58:28.891Z",
        "description": "<p>Summer Intern, Archives of the American Field Service, AFS Intercultural Programs</p><p>The Archives of the American Field Service and AFS Intercultural Programs (AFS Archives) is seeking a&nbsp;summer intern to assist with various projects in order to better preserve and make accessible the organization’s records and special collections.</p><p><br></p><p><strong>About AFS:&nbsp;&nbsp;</strong></p><p><br></p><p><a href=\"https://afs.org/about-afs?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">AFS Intercultural Programs, Inc. (AFS)</a> is a leading international education organization with a mission to provide and expand intercultural learning opportunities that develop active global citizens and institutions with the knowledge and skills needed to create a more just and peaceful world. AFS is active in over 100 countries, with offices in 57 countries, and 12,000+ participants annually supported by 50,000+ volunteers globally.</p><p><br></p><p>AFS began as the American Field Service (AFS),founded by A. Piatt Andrew, who secured an authorization from the French Army for American volunteer ambulance units to rescue wounded soldiers in battle during World War I. Under Andrew’s leadership, AFS took part in every great battle in which French troops were engaged between 1915 and 1917, prior to the U.S. entering the war. AFS was reactivated during World War II, and, from 1940 until 1945, AFS volunteer drivers served in France, North Africa, the Middle East, Italy, France, Germany, India, and Burma. The AFS ambulance drivers evacuated more than 1,000,000 casualties during both World Wars.&nbsp;</p><p><br></p><p><strong>Internship summary:&nbsp;</strong></p><p><br></p><p>The primary responsibilities of the Summer 2021 Intern will be to:&nbsp;</p><ul><li>Assist with keeping&nbsp;the archives accessible to the public by adding offsite storage location information into Archon, AFS’ archival content management system</li><li>Process (rehouse, describe, and create a finding aid for) the newly-acquired records of the Friendship Ambassadors Foundation.&nbsp;</li><li>Acquire&nbsp;experience creating file-level inventories, rehousing new donations, and drafting Deed of Gift agreements.</li><li>Create a blog post about his/her projects for AFS’ website: <a href=\"http://www.afs.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">www.afs.org</a> with the opportunity to gain reference experience, if time permits</li></ul><p><br></p><p><strong>Required skills and abilities:&nbsp;</strong></p><p>The candidate must have successfully completed one year of an archival science, library science, history, or museum studies graduate program. The candidate must be detail-oriented, organized, able to work independently on tasks, be flexible in changing situations, and be reliable and responsible. The candidate must have some experience using Microsoft Excel. Preference will be given to candidates who have some knowledge of Archon, Archivists’ Toolkit, or ArchivesSpace.&nbsp;</p><p><br></p><p><strong>Physical requirements:&nbsp;</strong></p><p><br></p><p>The intern must be able to commute to the AFS offices at 5 Hanover Square in Manhattan, and must be comfortable moving light to medium weight boxes of archival materials</p><p><br></p><p><strong>Schedule and Salary</strong>:</p><p><br></p><p>The intern will work one to two days a week (Monday through Saturday) onsite and remotely for a period of 8-10 weeks during the summer of 2021. This internship will provide $20.00 per hour for a maximum of $2,800.00. The intern will be supervised by the&nbsp;Director of Partner Engagement and Communications, and Archival Consultant.</p><p><br></p><p><br></p><p><strong>How to apply:&nbsp;</strong></p><p><br></p><p>E-mail resume/CV, cover letter, and the names and contact information for two references under the subject heading “AFS Archives Internship” to recruitment@afs.org. Applications will be reviewed on a rolling basis until early June 2021.</p>",
        "index": 5,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "due": "2021-06-01T10:00:00.000Z",
        "remote": true
    }
]