[
    {
        "position": "Process Analytics and Engineering Intern (BS/MS candidates)",
        "company": "Bristol Myers Squibb",
        "location": {
            "city": "Princeton",
            "state": "New Jersey",
            "zip": "N/A"
        },
        "posted": "2021-03-09T23:04:07.824Z",
        "url": "https://www.indeed.com/rc/clk?jk=f16b0b77f9b8251c&fccid=ab891284bb561914&vjs=3",
        "skills": [
            "java",
            "software engineering",
            "matlab",
            "python",
            "c and c++",
            "project management"
        ],
        "lastScraped": "2021-03-15T23:04:07.824Z",
        "description": "<div><p>At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.</p><p></p><p>\nMain Goal of this summer project is to develop strategy for cloud computing of equipment monitoring processes using existing options available within BMS. Some additional work on side projects revolving around but not limited to the equipment robustness program, including equipment monitoring, automated email service, and maximizing utilization of a shared computer.</p><p></p><div><p>\nKey Responsibilities</p></div><ul><li>\nDefining plan, risk assessment, and strategy for cloud computing of equipment monitoring processes</li><li>\nMaximize utilization of shared computer</li><li>\nFully automated Equipment Robustness monitoring plan method that will decrease the number of FTE hours for monitoring equipment.</li><li>\nExpanded automated email service for new sites and equipment.</li></ul><p></p><div><p>\nQualifications &amp; Experience</p></div><ul><li>\nAll candidates must be authorized to work in the US without sponsorship needs.</li><li>\nCandidates must be a rising junior, senior or master’s student currently enrolled in an accredited college/university seeking an undergraduate degree or master’s degree in engineering (chemical preferred) and continuing their education for the following semester (e.g., Fall 2021).</li><li>\nMinor in Computer Science or strong Computer Skills</li><li>\nStrong computer programing experience in MATlab, Python, R, C++, HTML, Java, etc.</li><li>\nHighly motivated, self-driven individual with the ability to work in a project team structure.</li><li>\nStrong written and verbal communication skills</li><li>\nExperience with video conferencing, MS Teams, Zoom, etc.</li><li>\nMust be eligible to work full-time remotely, 40 hours per week, from June – August 2021.</li></ul><p></p><p>\nBMSEC, BMSINTERN</p><p></p><p>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.</p><p></p><p>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</p></div>",
        "index": 1,
        "remote": true
    }
]