[
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-03T17:21:48.767Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-05-03T17:21:48.767Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>",
        "index": 1,
        "skills": [
            "data science",
            "machine learning",
            "python",
            "project management",
            "information technology",
            "artificial intelligence",
            "deep learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "EPA Bioinformatics and Data Science Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-04-03T17:21:57.313Z",
        "url": "https://www.internships.com/posting/cd96c04d-fdc4-4866-bab7-cece8611268c",
        "lastScraped": "2021-05-03T17:21:57.313Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Biomolecular &amp; Computational Toxicology Division (BCTD) located in Research Triangle Park, North Carolina.</p><p><br></p><p>The EPA&nbsp;CCTE is responsible for developing new experimental models that can be used to evaluate the potential for chemicals to produce adverse effects on human and ecological health for improving environmental risk assessments and regulatory decisions pertaining to chemical safety and sustainability.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This project aims to develop computational models to predict the safety of chemicals without running tests on whole animals. The tools to be used include high-throughput transcriptomic screening data across multiple cell lines, databases of previously run animal studies, data from other in vitro high-throughput screening experiments, data and models for in vitro to in vivo extrapolation of dose, and outputs of various predictive models of chemical action. The project integrates bioinformatics, data science, software engineering, applied statistics, and predictive mathematical modeling, with the broader goal of advancing safety assessment using new approach methodologies.</p><p><br></p><p>Under the guidance of a mentor, the research participant will learn to develop novel bioinformatics and biostatistics applications to integrate multiple data streams relevant to toxicological testing, including transcriptomics, biochemical assays, and other high-throughput screening methods. Research activities may include:</p><ol><li>Helping develop models to predict toxicological outcomes of animal testing from in vitro assays</li><li>Helping develop&nbsp;a data science infrastructure to simulate outcomes of tiered testing strategies that combine multiple in vitro screening methods</li><li>Learning how to curate and manage large-scale heterogeneous chemical safety screening data</li><li>Evaluating additional methods to integrate data across screening studies.</li></ol><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>This is a research training opportunity where in the candidate will gain education and training in the general areas of bioinformatics data science, transcriptomics, computational toxicology, and mathematical modeling in preparation for future career opportunities across government, industry, and academic sectors.</p><p><br></p><p>The research participant may also&nbsp;author or co-author on peer-reviewed publications, and present at local and national meetings. The participant will be a member of a multi-disciplinary research team.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity&nbsp;are&nbsp;Katie Paul-Friedman (paul-friedman.katie@epa.gov) and Logan Everett (Everett.logan@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 2,
        "skills": [
            "data science",
            "project management",
            "bioinformatics",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Product Manager Intern",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-04-03T17:22:15.243Z",
        "url": "https://www.internships.com/posting/bug_38982167237",
        "lastScraped": "2021-05-03T17:22:15.243Z",
        "description": "Job Details\n\n*\n\nProduct Manager Internship\n\nJob Code Number\n\n11685372\n\nJob Description\n\nProduct Manager Internship\n\nProduct Manager Internship\n\nIn 2005, Smartsheet was founded on the idea that teams and millions of people worldwide deserve a better way to deliver their very best work. Today, we deliver a leading cloudbased platform for work execution, empowering organizations to plan, capture, track, automate, and report on work at scale, resulting in more efficient processes and better business outcomes.\n\nAs the Product Manager Intern, you will support our efforts to build next generation experiences for our core spreadsheet, Gantt, kanban and calendar views. You will develop new capabilities to address the needs of modern project and portfolio managers supporting traditional waterfall, hybrid and agile methodologies.\n\nYou will be a remote employee who will report to an Product Leader, based out of our Bellevue, WA office. This is a fulltime internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nCreate a compelling vision for your portfolio of features, break down the work into a wellprioritized plan, and execute\n\n2.\n\nAssess opportunity, project feasibility, approach, scope\n\n3.\n\nDefine detailed product requirements\n\n4.\n\nMake tradeoffs in market fit, usability, cost, and performance\n\n5.\n\nDrive project through to completion, providing detailed progress metrics during build and, insightful analysis of results postlaunch\n\n6.\n\nAnalyze market and competitive trends to inform new recommendations\n\nYou have:\n\n1.\n\nEnrolled in a technical discipline, such as Computer Science, Computer Engineering, Applied and Computational Math Sciences, Human Computer Interaction, Information Systems or related. Business majors with technical knowledge are welcome to apply\n\n2.\n\nPassion to make customers and colleagues successful\n\n3.\n\nLeadership mindset with the natural inclinations to take challenges head on and provide impact\n\n4.\n\nExperience with datadriven, decisionmaking that incorporates analytical rigor\n\n5.\n\nCreative way of thinking\n\n6.\n\nUnderstand customer needs and able to work with software engineers and designers to design, evaluate and implement product features\n\n7.\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovativejoin us!\n\nDepartment\n\nEngineering  Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 3,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Product Manager Intern",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-04-03T17:22:33.334Z",
        "url": "https://www.internships.com/posting/bug_38982167237",
        "lastScraped": "2021-05-03T17:22:33.334Z",
        "description": "Job Details\n\n*\n\nProduct Manager Internship\n\nJob Code Number\n\n11685372\n\nJob Description\n\nProduct Manager Internship\n\nProduct Manager Internship\n\nIn 2005, Smartsheet was founded on the idea that teams and millions of people worldwide deserve a better way to deliver their very best work. Today, we deliver a leading cloudbased platform for work execution, empowering organizations to plan, capture, track, automate, and report on work at scale, resulting in more efficient processes and better business outcomes.\n\nAs the Product Manager Intern, you will support our efforts to build next generation experiences for our core spreadsheet, Gantt, kanban and calendar views. You will develop new capabilities to address the needs of modern project and portfolio managers supporting traditional waterfall, hybrid and agile methodologies.\n\nYou will be a remote employee who will report to an Product Leader, based out of our Bellevue, WA office. This is a fulltime internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nCreate a compelling vision for your portfolio of features, break down the work into a wellprioritized plan, and execute\n\n2.\n\nAssess opportunity, project feasibility, approach, scope\n\n3.\n\nDefine detailed product requirements\n\n4.\n\nMake tradeoffs in market fit, usability, cost, and performance\n\n5.\n\nDrive project through to completion, providing detailed progress metrics during build and, insightful analysis of results postlaunch\n\n6.\n\nAnalyze market and competitive trends to inform new recommendations\n\nYou have:\n\n1.\n\nEnrolled in a technical discipline, such as Computer Science, Computer Engineering, Applied and Computational Math Sciences, Human Computer Interaction, Information Systems or related. Business majors with technical knowledge are welcome to apply\n\n2.\n\nPassion to make customers and colleagues successful\n\n3.\n\nLeadership mindset with the natural inclinations to take challenges head on and provide impact\n\n4.\n\nExperience with datadriven, decisionmaking that incorporates analytical rigor\n\n5.\n\nCreative way of thinking\n\n6.\n\nUnderstand customer needs and able to work with software engineers and designers to design, evaluate and implement product features\n\n7.\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovativejoin us!\n\nDepartment\n\nEngineering  Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 4,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Software Engineer Internship - Content Collaboration",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-04-03T17:22:51.607Z",
        "url": "https://www.internships.com/posting/bug_38982167519",
        "lastScraped": "2021-05-03T17:22:51.607Z",
        "description": "Job Details\n\n*\n\nSoftware Engineer Internship  Content Collaboration\n\nJob Code Number\n\n11685393\n\nJob Description\n\nSoftware Engineer Internship  Content Collaboration\n\nSoftware Engineer Internship  Content Collaboration\n\nSmartsheet is looking for a Software Development Engineer Intern to join the Content Collaboration Team. Our business is built on finding top grade talent and getting out of their way while they create our awardwinning Software as a Service (SaaS) offering for collaborative work and project management. Our software team is small and efficient. You will work in an agile apolitical environment that stays focused on building great software. Here you will use the latest web technologies to their fullest potential.\n\nYou will be a remote employee who will report to an Engineering Leader, based out of our Bellevue, WA office. This is a fulltime internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nParticipate in the entire development life cycle, from concept to release\n\n2.\n\nImplement new features and improve the ones we have already built\n\n3.\n\nUse technologies to solve complex engineering problems\n\n4.\n\nLearn and apply best practices in designing scalable services\n\n5.\n\nImplement delightful customer experiences\n\n6.\n\nParticipate in all phases of quality assurance and defect resolution\n\n7.\n\nWork on Pacific Time (PST)\n\nYou have:\n\n1.\n\nA Computer Science program or a related field of study\n\n2.\n\nSoftware development experience\n\n3.\n\nKnowledge of software design and data structures\n\n4.\n\nLegally eligible to work in the U.S. on an ongoing basis\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovativejoin us!\n\nDepartment\n\nEngineering  Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 5,
        "skills": [
            "project management",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Eligible to work in the U.S"
        ],
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-04-03T17:23:00.408Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-05-03T17:23:00.408Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>",
        "index": 6,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-03T17:23:09.170Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-05-03T17:23:09.170Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>",
        "index": 7,
        "skills": [
            "project management",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "Summer 2021 FOX Entertainment Virtual Internship Program",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-05-03T17:23:27.210Z",
        "url": "https://www.internships.com/posting/wup_571557442850498",
        "lastScraped": "2021-05-03T17:23:27.210Z",
        "description": "OVERVIEW OF THE COMPANY\n\nFOX Entertainment\n\nThe FOX Network, a premier national television broadcaster, is renowned for its combination of appealing primetime entertainment and powerful sports programming. It delivers 15 hours of weekly primetime programming to 208 local market affiliates, reaching approximately 99.9% of all U.S. television households. Among 18- to 34-year-olds, the FOX Network has ranked among the top two networks in primetime entertainment for the past 23 years.\n\nJOB DESCRIPTION\n\nSUMMARY:\n\nFOX is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industry's brightest talent. The FOX Entertainment Virtual Internship Program is for motivated college students who are passionate about entertainment and the media industry. FOX Interns are paid to gain real world work experience with guidance from top industry professionals. FOX Interns are assigned to a department that matches their skill set, work experience, and career aspirations. Please note this internship is available nationwide as a remote internship opportunity.",
        "index": 8,
        "skills": [
            "networks",
            "virtual reality"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "EPA Exposure Pathway Modeling Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-04-03T17:23:35.981Z",
        "url": "https://www.internships.com/posting/b9e3fa77-6d2f-44ee-897b-ed9bf314a9e5",
        "lastScraped": "2021-05-03T17:23:35.981Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The EPA Center for Computational Toxicology and Exposure (CCTE) is responsible for developing new computational tools and providing quantitative analysis for improving public health and environmental risk assessments and regulatory decisions pertaining to chemical safety. Throughout the course of this project, the&nbsp;participant will collaborate with a CCTE team developing computational tools (including mechanistic and statistical models) to predict population estimates of human exposures and doses to thousands of existing and emerging chemicals in commerce. This research project will focus on characterizing exposure pathways for which predictive data or models are lacking (e.g., via ambient pathways such as via chemicals in biosolids, or occupational pathways). The models and data developed by the participant will inform EPA consensus models for these pathways.&nbsp;</p><p><br></p><p>Under the guidance of a mentor, the research participant may be involved in the following research activities:</p><ul><li>Analyzing innovative data describing how individuals come into contact with chemicals (such as information on chemical use and sources or activities relevant to the pathways in questions).&nbsp;</li><li>Analyzing, modeling, and interpreting measurement data describing chemical concentrations measured in field studies of human exposure, including concentrations measured in occupational media.&nbsp;&nbsp;</li><li>Assisting in the development of&nbsp;computational models/algorithms of chemical fate, transport, or exposure processes for priority exposure pathways.</li><li>Parameterizing and running existing or newly developed models for various chemicals, and interpret and summarize results</li><li>Performing reviews of literature or other available data for identifying measurements for evaluating exposure model algorithms and results.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will collaborate with an integrated team of agency scientists towards generating critical research hypotheses, developing programmatic tools to test these hypotheses, and ultimately solving complex environmental health problems. Through this research training opportunity, the research participant will have the opportunity develop their programming, analytical, and communication skills.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Kristin Isaacs (isaacs.kristin@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 9,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Computer Vision Intern",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-04-03T17:23:54.118Z",
        "url": "https://www.internships.com/posting/bug_38976272330",
        "lastScraped": "2021-05-03T17:23:54.118Z",
        "description": "Computer Vision Intern - Summer 2021 job in California, USA / United States\n\nJohnson &amp; Johnson\n\nLocation:\n    (94059) California, United States\nSalary:\n    Competitive\nType:\n    Temporary\nStart Date:\n    As Soon As Possible\nContract Period:\n    To be confirmed.\nMain Industry:\n    Information Technology\nEmployer:\n    Johnson &amp; Johnson\nJob ID:\n    109535693\nPosted On:\n    03/04/2021\n\nAt Johnson &amp; Johnson, we use technology and the power of teamwork to discover new ways to prevent and overcome the world's the most significant healthcare challenges. Our Corporate, Consumer Health, Medical Devices, and Pharmaceutical teams leverage data, real-world insights, and creative minds to make life-changing healthcare products and medicines. We're disrupting outdated healthcare ecosystems and infusing them with transformative ideas to help people thrive throughout every stage of their lives. With a reach of more than a billion people every day, there's no limit to the impact you can make here. Are you ready to reimagine healthcare?\n\nHere, your career breakthroughs will change the future of health, in all the best ways. And you'll change, too. You'll be inspired, and you'll inspire people across the world to change how they care for themselves and those they love. Amplify your impact. Join us!\n\nAuris Health, Inc., part of the Johnson &amp; Johnson family of companies, is redefining medical intervention. By combining advancements in medical robotics, instrumentation, navigation and data science, Auris is building a platform technology capable of expanding the applicability of robotics to a spectrum of medical procedures. Learn more about Auris Health at\n\nAuris Health, Inc., part of the Johnson &amp; Johnson family of companies, is redefining medical interventions. By combining advancements in medical robotics, instrumentation, navigation and data science, Auris is building intelligence platforms capable of growing the applicability of robotics to a new spectrum of medical procedures.\n\nWe are seeking a talented individual for a Computer Vision Internship position within the Algorithms/AI team at Auris Health. As a computer vision intern you will work closely with other Research Scientists and Software Engineers in the Algorithms/AI team within the R&amp;D Flexible Robotics organization to develop novel solutions in the area of machine learning, computer vision, and robotic navigation. This will be an exciting opportunity to develop your skills in solving challenging problems and contribute to technology development for next generation robotic intervention platforms.\n\nCORE JOB RESPONSIBILITIES:\n\n- Development, implementation, and testing of machine learning and computer vision algorithms (in Python/C++)\n- Experiment design, testing, and analysis of machine learning algorithm performance and comparison between different algorithms (in Python)\n- Development of new RGBD datasets and implementation of new data processing architectures\n- Port computer vision results into augmented reality and prototype solutions\n- Work closely with other research scientists, robotics engineers and SW engineers to transfer solutions into Monarch products and application\n\nApply For This Job Add to job basket Email me jobs Find similar jobs Search for other jobs Email Job to a Friend\n.\n\nApply:\n\nYour email address:\n\nYour country of residence:\nPlease Select a CountryAfghanistanAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntigua and BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBosnia and HerzegovinaBotswanaBrazilBritish Indian Ocean TerritoryBritish Virgin IslandsBruneiBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCayman IslandsCentral African RepublicChileChinaColombiaComorosCosta RicaCroatiaCubaCyprusCzech RepublicDemocratic Republic of the CongoDenmarkDjiboutiDominicaDominican RepublicEast TimorEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEswatiniEthiopiaFalkland Islands (Islas Malvinas)Faroe IslandsFiji IslandsFinlandFranceGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuineaGuinea-BissauGuyanaHaitiHondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsraelItalyIvory CoastJamaicaJapanJordanKazakhstanKenyaKiribatiKuwaitKyrgyzstanLaosLatviaLebanonLesothoLiberiaLibyaLiechtensteinLithuaniaLuxembourgMacedoniaMadagascarMalawiMalaysiaMaldivesMaliMaltaMartiniqueMauritaniaMauritiusMexicoMicronesiaMoldovaMonacoMongoliaMontenegroMontserratMoroccoMozambiqueMyanmarNamibiaNepalNetherlandsNew ZealandNicaraguaNigerNigeriaNorth KoreaNorwayOmanPakistanPalauPanamaPapua New GuineaParaguayPeruPhilippinesPitcairn IslandsPolandPortugalPuerto RicoQatarRepublic of the CongoRomaniaRussiaRwandaSamoaSan MarinoS�o Tom� and Pr�ncipeSaudi ArabiaSenegalSerbiaSeychellesSierra LeoneSingaporeSlovakiaSloveniaSolomon IslandsSomaliaSouth AfricaSouth Georgia and the South Sandwich IslandsSouth KoreaSouth SudanSpainSri LankaSt. Kitts and NevisSt. LuciaSt. Vincent and the GrenadinesSudanSwedenSwitzerlandSyriaTaiwanTajikistanTanzaniaThailandTogoTongaTrinidad and TobagoTunisiaTurkeyTurkmenistanTurks and Caicos IslandsTuvaluUgandaUkraineUnited Arab EmiratesUnited KingdomUnited StatesUruguayUzbekistanVanuatuVatican CityVenezuelaVietnamYemenZambiaZimbabwe\n\nImportant:  Never supply bank or financial information to job advertisers. If you see a vacancy and bank details or money are requested, email support@tiptopjob.com.",
        "index": 10,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "robotics",
            "c and c++",
            "python",
            "virtual reality"
        ],
        "compensation": "paid",
        "contact": "support@tiptopjob.com",
        "remote": false
    },
    {
        "position": "Research And Development Intern",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-05-03T17:24:12.267Z",
        "url": "https://www.internships.com/posting/bug_38985729577",
        "lastScraped": "2021-05-03T17:24:12.267Z",
        "description": "R&amp;D Intern\n\nJob Summary:\n\nR&amp;D Product Development Intern\n\nLead project ideas:\n\n Prototype development to build snack nuts pipeline\n Prototype applications development for Global Ingredients\n Prototype development for new culinary almond flour pipeline products.\n\nIn this role you will work directly with the Innovation scientific staff in carrying out research assignments involving a variety of laboratory methods, equipment, and procedures. You will provide technical or logistical support and conduct research projects under the supervision of the scientific staff.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS (w/ percentage of time)\n\nPercentage of Time\n\n40%\n\n* Essential Job Function: Apply Food Science Knowledge\n* What learning or experience will the Intern gain:\n* Foundations of Food Science: Apply learnings from the classroom into a real-world project.\n* Learning about new applications areas, studying results from past related projects, planning new experiments, etc.\n\n40%\n\n* Essential Job Function: Bench Prototype Development\n* What learning or experience will the Intern gain:\n* Work at lab bench utilizing knowledge of food ingredients, food science, and consumer marketing insights to identify and develop new almond products and formulas to meet customer and business unit product strategies and requirements.\n* Organize and manage new products ideas and develop lab prototypes.\n* Sources new food ingredients. Develop and document specifications.\n* Assist with regulatory compliance with development of nutrition facts, allergen labeling and ingredient declaration.\n\n20%\n\n* Essential Job Function: Project Status &amp; Completion Presentation\n* What learning or experience will the Intern gain:\n* Project Management: How to organize a defined project.\n* Time Management: How to complete tasks in defined period.\n* Communication: How to develop a PowerPoint presentation and present to other team members.\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Completion of Sophomore or Junior year in a food science undergraduate program, or completion of a B.S. in food science and in an M.S. program.\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Food Science background\n* Interested in learning the foundations of Food Science at a Food Manufacturing organization.\n* Interested in collaborating with cross functional team members.\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Willingness to tackle the challenges presented to the candidate.\n* Drive progress and/or completion of assignments / projects.\n* Successfully complete assigned projects and present to Product Development, Regulatory and Innovation Marketing teams.\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* R&amp;D Product Development Team\n* Regulatory Team\n* Innovation Marketing Team\n* VP Innovation\n\nPHYSICAL DEMANDS\n\nWhile performing the duties of this job, the employee is frequently required to sit; use hands and fingers, handle or feel and talk or hear.  The employee is occasionally required to stand, walk, and reach with hands and arms.  Specific vision abilities required by this job include close vision, color vision, depth perception and ability to adjust focus.\n\nOccasionally required to lift and carry items weighing up to 50 pounds.\n\nWORK ENVIRONMENT\n\nPrimarily a mix of hands-on laboratory and office work.  At times, work in a pilot plant or manufacturing facility may be required.  The incumbent must be able to climb stairs/ladders and occasionally conduct work on elevated platforms.\n\nEducation:\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$23.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor.",
        "index": 11,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "EPA Toxicokinetic Models Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-04-03T17:24:21.028Z",
        "url": "https://www.internships.com/posting/2dc66130-0497-43e6-a0f4-81f39161364c",
        "lastScraped": "2021-05-03T17:24:21.028Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Characterizing the uncertainty in the predictions of toxicokinetic models, including predictions based upon in vitro data, requires comparison to in vivo data. This research project works to address the current major sources of uncertainty in high-throughput toxicokinetics (HTTK).&nbsp;The basic outline of this research project is to conduct: 1) in vitro metabolic clearance assays of selected environmental chemicals using human and rat microsomal preparations; 2) protein binding assays with the environmental chemicals; 3) in vivo toxicokinetic studies with the environmental chemicals.&nbsp;The research participant may prepare dosing solutions of selected environmental chemicals, conduct in vitro microsomal clearance and protein binding assays, conduct in vivo toxicokinetic studies which involves dosing rats and collecting blood samples, processing samples for analytical analysis, and compiling and graphing data. With the in vitro clearance and binding data, in vivo toxicokinetic predictions can be developed using established toxicokinetic models. The in vivo predictions can then be compared to the determined in vivo toxicokinetic data.&nbsp;Sources of variability between the predicted versus the determined toxicokinetic can then be assessed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will learn about in vitro and in vivo toxicokinetics, toxicokinetic modeling, analytical chemistry, in vitro to in vivo extrapolation, good practices in quality assurance and working with laboratory animals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.michaelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or&nbsp;four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 12,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Federal and Commercial Programs Internship",
        "company": "Capitol Advisors on Technology",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:24:33.367Z",
        "url": "https://www.internships.com/posting/5a4c09d5-5d49-426d-a958-ccbe9d365636",
        "lastScraped": "2021-05-03T17:24:33.368Z",
        "description": "<p><u>Position Summary</u>:</p><p>The intern will work under the direction of a Capitol Advisors on Technology staff member and provide strategic support for multiple programs to include One Acquisition Solution for Integrated Service (OASIS), the National Center for Manufacturing Sciences (NCMS), and future programs. </p><p><br></p><p>Responsibilities will include the management of electronic communications from OASIS 8(a) Sub-Pool1 &amp; Sub-Pool4.&nbsp;Identify mandatory training requirements or participation in seminars and report the information to pertinent staff.&nbsp;Provide an ongoing review of opportunities in databases such as, Capture Exec, GSA eBuy and Beta.gov and execute appropriate and timely responses in accordance with established guidelines and practices.&nbsp;Effectively manage the coordination of meetings with NCMS staff members.&nbsp;Provide prompt and professional follow-through on requests from NCMS and others.&nbsp;&nbsp;Lead the coordination and scheduling of regular conference calls for Capitol Advisors on Technology President and Program Managers. Marketing and Outreach projects may include creating and distributing&nbsp;Pozomy Capability Statements to designated Federal agencies and others as directed.&nbsp;Initiate communication with Federal, state, and local government POC’s to arrange meetings or presentations.</p>",
        "index": 13,
        "skills": [
            "project management",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "USFS Bioacoustics Monitoring Program",
        "company": "ORISE",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-04-03T17:24:41.900Z",
        "url": "https://www.internships.com/posting/8de07b29-f7ea-4a7e-83dd-430276792b65",
        "lastScraped": "2021-05-03T17:24:41.900Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A&nbsp;research opportunity is&nbsp;available at the USDA Forest Service located in Springfield, Oregon.&nbsp;Research will take place in Oregon’s Cascade Range, near the HJ Andrews Study Area and Blue River, Oregon.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p>The mission of the Ecological Process and Function Program is to advance and communicate knowledge of fundamental ecological processes and interactions&nbsp;across scales and develop applications of this knowledge to enable improved management of ecosystems and resources.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The Bioacoustics Monitoring Program conducts passive bioacoustics research as an alternative method to monitor trends in wildlife populations that takes advantage of technological advancements in non-invasive detection equipment.&nbsp;</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant&nbsp;will gain first-hand, on the ground experience with logistics involved with conducting bioacoustics wildlife monitoring using autonomous recording units in remote mountainous areas to monitor for the presence of wildlife, including spotted owls, and other birds and mammals. Participant will also learn about emerging artificial intelligence frameworks and data organizational structures used for efficiently analyzing large amounts of bioacoustics data and will have the opportunity to connect with researchers on the forefront of this evolving field of wildlife research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Todd Wilson (todd.wilson@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring/Summer 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for three months, but may be&nbsp;renewed upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 14,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Water Quality Assessment Analysis Fellowship",
        "company": "ORISE",
        "location": {
            "city": "District of Columbia",
            "state": "United States"
        },
        "posted": "2021-04-03T17:24:54.536Z",
        "url": "https://www.internships.com/posting/e6a64e43-6f4d-4225-8de4-018460bfe327",
        "lastScraped": "2021-05-03T17:24:54.536Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>One to two&nbsp;research opportunities are available at the U.S. Environmental Protection Agency (EPA) in the Office of Water (OW), Office of Wetlands, Oceans and Watersheds (OWOW) Nonpoint source Program located in Washington D.C.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA research project involving research and&nbsp;analysis focused on the successful use of Clean Water Act Section 319 nonpoint source funding for achieving water quality improvements, as well as researching state Nonpoint Source Management Plans and local scale watershed plans.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor the participant will have the opportunity to:</p><ul><li>evaluate water quality results in proposed nonpoint success stories from state agencies prior to publication</li><li>evaluate implementation of best management practices and water quality monitoring for controlling nonpoint source pollution</li><li>analyze effective approaches and measures in watershed planning to protect water quality</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for these opportunities is Cynthia Curtis (Curtis.cynthia@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for one year and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>At this time, master's degree stipends are ~$60,129 per year. Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 15,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USFS Bioacoustics Monitoring Program",
        "company": "ORISE",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-04-03T17:25:03.100Z",
        "url": "https://www.internships.com/posting/8de07b29-f7ea-4a7e-83dd-430276792b65",
        "lastScraped": "2021-05-03T17:25:03.100Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A&nbsp;research opportunity is&nbsp;available at the USDA Forest Service located in Springfield, Oregon.&nbsp;Research will take place in Oregon’s Cascade Range, near the HJ Andrews Study Area and Blue River, Oregon.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p>The mission of the Ecological Process and Function Program is to advance and communicate knowledge of fundamental ecological processes and interactions&nbsp;across scales and develop applications of this knowledge to enable improved management of ecosystems and resources.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The Bioacoustics Monitoring Program conducts passive bioacoustics research as an alternative method to monitor trends in wildlife populations that takes advantage of technological advancements in non-invasive detection equipment.&nbsp;</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant&nbsp;will gain first-hand, on the ground experience with logistics involved with conducting bioacoustics wildlife monitoring using autonomous recording units in remote mountainous areas to monitor for the presence of wildlife, including spotted owls, and other birds and mammals. Participant will also learn about emerging artificial intelligence frameworks and data organizational structures used for efficiently analyzing large amounts of bioacoustics data and will have the opportunity to connect with researchers on the forefront of this evolving field of wildlife research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Todd Wilson (todd.wilson@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring/Summer 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for three months, but may be&nbsp;renewed upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 16,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Water Quality Assessment Analysis Fellowship",
        "company": "ORISE",
        "location": {
            "city": "District of Columbia",
            "state": "United States"
        },
        "posted": "2021-04-03T17:25:17.926Z",
        "url": "https://www.internships.com/posting/e6a64e43-6f4d-4225-8de4-018460bfe327",
        "lastScraped": "2021-05-03T17:25:17.926Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>One to two&nbsp;research opportunities are available at the U.S. Environmental Protection Agency (EPA) in the Office of Water (OW), Office of Wetlands, Oceans and Watersheds (OWOW) Nonpoint source Program located in Washington D.C.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA research project involving research and&nbsp;analysis focused on the successful use of Clean Water Act Section 319 nonpoint source funding for achieving water quality improvements, as well as researching state Nonpoint Source Management Plans and local scale watershed plans.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor the participant will have the opportunity to:</p><ul><li>evaluate water quality results in proposed nonpoint success stories from state agencies prior to publication</li><li>evaluate implementation of best management practices and water quality monitoring for controlling nonpoint source pollution</li><li>analyze effective approaches and measures in watershed planning to protect water quality</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for these opportunities is Cynthia Curtis (Curtis.cynthia@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for one year and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>At this time, master's degree stipends are ~$60,129 per year. Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 17,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "PROGRAMMER Spring Internship",
        "company": "Elle Investments",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:25:26.503Z",
        "url": "https://www.internships.com/posting/24d3807e-f58e-44c0-b021-b3c2593b58a5",
        "lastScraped": "2021-05-03T17:25:26.503Z",
        "description": "<p>We are currently offering a  Programmer/ Designer internship - HTML, CSS, PHP, JS, PYTHON, JAVA, MySQL</p><p><br></p><p>The internship is ideal for someone who'd like to develop real-world coding experience by working on real projects. You'll have the opportunity to gain practical experience with a variety of tools.</p><p>The ideal candidate is completing a graduate or undergraduate program in computer science or MIS at a US university and is eager to get a head-start by participating in the development of real-life applications. This opportunity is intended for a programmer who is particularly interested in developing a rather broad range of skills and experience.</p><p><br></p><p>This internship takes place remotely with most of the interactions taking place electronically and with almost daily conference calls. This is a virtual internship and a substantial time commitment is required.</p><p><br></p><p><br></p>",
        "index": 18,
        "skills": [
            "java",
            "python",
            "project management",
            "virtual reality",
            "web development"
        ],
        "remote": true
    },
    {
        "position": "Software Development - Python",
        "company": "Annapurna Solutions",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:25:35.097Z",
        "url": "https://www.internships.com/posting/ccm_1fa5cd89-b186-4e8f-987b-e410f011d490",
        "lastScraped": "2021-05-03T17:25:35.097Z",
        "description": "<p>&nbsp;Joining Innovation Department as a Software Engineering intern gives you the opportunity to experience an exciting, fast-paced startup environment hands on. We’re looking for a passionate Computer Science student who has a strong understanding of Python to work on latest frontend and backend tools and technologies. Work directly with our Engineering team to learn how to build components of a SaaS e-Learning platform.</p><p><br></p><p>Innovation Department builds sustainability mobile solutions from the ground up. Our team of brand strategists, marketers, operators and builders are obsessed with reducing the time to product-market fit and creating repeatable success for the launch of early-stage products &amp; Services in the sustainability sector.</p><p><br></p><p>Responsibilities/ Tasks:</p><p>• Daily responsibilities will include:- Software development- Software quality assurance- Hardware/software troubleshooting and testing</p><p>• Gather requirements, develop test plans, and develop and deploy stable modules to support archiving and backup of data as required by external regulators</p><p>• Test and Validate automated backup solution along with an indexing strategy to easily retrieve relevant data based on archive properties</p><p><br></p><p>Requirements:</p><p>• Strong development skills using Python (and secondarily Perl/shell) is needed</p><p>• Require course credit or CPTOPT training for International students</p><p>• Strong expertise working in a Linux/Unix environment</p><p>• Good understanding of software design, local and cloud systems (Google cloud) is a plus</p><p>• Must have the ability to communicate effectively with engineers and software developers and be detail oriented and self-driven.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>",
        "index": 19,
        "skills": [
            "software engineering",
            "python",
            "hardware",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "EPA Air Pollution and Atmospheric Modeling Systems MS Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-04-03T17:25:43.686Z",
        "url": "https://www.internships.com/posting/ce9ccf58-297a-4690-9fdc-cf458c7200cd",
        "lastScraped": "2021-05-03T17:25:43.686Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will attempt to quantify the effects of new model developments in both the hemispheric CMAQ (H-CMAQ) and the next generation global MPAS-CMAQ modeling system on background pollution and the contributions from domestic and international anthropogenic sources, along with natural emission sources. This research project may include developments of a consistent setup for both the H-CMAQ and MPAS-CMAQ modeling platforms; a protocol for quantifying background pollution through emission perturbation simulations, source apportionment, and/or DDM simulations; and, an approach for prioritizing which specific model updates (e.g. halogen chemistry, deposition, secondary organic aerosols) should be tested through this platform.</p><p><br></p><p>Research activities may include:</p><ul><li>Setting up, performing, and analyzing simulations using regional WRF-CMAQ, hemispheric WRF-CMAQ and global MPAS-CMAQ configurations to enable model inter-comparisons</li><li>Developing methods for quantifying observed and simulated hemispheric and global background air pollution</li><li>Obtaining new observation datasets (e.g. satellite data) and developing new tools/methods to use those data in hemispheric/global model evaluation</li><li>Use existing methods and/or develop new methods to estimate the impact of different model configurations on simulated background air pollution</li><li>Developing new methods to test the various individual components of the CMAQ modeling system to determine their importance in estimating background air pollution</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>In collaboration with the AESMD scientists, the research participant will learn how to develop and apply large scale comprehensive atmospheric modeling systems to study various aspects of air pollution. This research training opportunity will give the research participant experience that extends skills acquired through their advanced degree education.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Wyat Appel&nbsp;(appel.wyat@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required </p><p>for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 20,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Billing-Intern",
        "company": "Petro-Construction",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-03T17:25:52.169Z",
        "url": "https://www.internships.com/posting/3a99c102-cba4-4146-8cf3-ac323fab54c9",
        "lastScraped": "2021-05-03T17:25:52.169Z",
        "description": "<p>We are looking for a  Billing Intern to perform tasks that will help us monitor our revenues. You will be responsible for keeping track of money owed to us by customers, preparing invoices and updating records.</p><p>&nbsp;</p><p>As a billing intern, you must be accurate and reliable in handling accounts and documents. Being good at math and a high degree of organizational ability is essential due to the great amount of financial information. Since you will be using technology to expedite your work, a degree of computer knowledge is required.</p><p>&nbsp;</p><p>The goal is to contribute to the accurate preparation of bills receivable and safeguard the company’s income.</p><p><br></p><p><strong> RESPONSIBILITIES:</strong></p><ul><li>This internship primarily entails supporting standard billing and maintenance transactions in billing, metering, and other related systems to ensure accurate customer billing, accurate revenue reporting and adherence to regulatory requirements.</li><li>Internship responsibilities include running reports and/or providing data from the billing system to be used in regulatory &amp; financial reporting.</li><li>Assists in the development and maintenance of documentation for department procedures; billing, metering, or other customer system reports, processes and related information.</li><li>May assist project teams in testing modifications and enhancements to billing, metering, or related systems.</li></ul>",
        "index": 21,
        "skills": [
            "information technology",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Intern, Strategic Partnerships - Market Research & Business Development",
        "company": "SigFig",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:26:02.647Z",
        "url": "https://www.internships.com/posting/2176fdb9-b237-4291-b300-3edef233833b",
        "lastScraped": "2021-05-03T17:26:02.647Z",
        "description": "<p>We are SigFig.&nbsp;We’re here to empower everyone to achieve their life goals and ambitions. It takes extraordinary people to disrupt decades of legacy financial practices to reimagine solutions to be customer-centric, engaging, and intuitively designed that use technology to serve customers at scale.</p><p><br></p><p>We are committed to building impactful financial solutions that are accessible and affordable to everyone. Using a combination of design, data science, and technology, we help provide people with financial advice and guidance they need to achieve their life goals. Whether it’s through our direct-to-consumer or businesses-to-consumer products through partnerships with some of the world’s largest and most innovative financial institutions like Wells Fargo, UBS, and Citizens Bank, SigFig seeks to help consumers and institutions make better financial decisions.</p><p><br></p><p>Headquartered in San Francisco, we also have amazing talent solving interesting problems across our offices in Tucson, Calgary, Singapore, and New Delhi, but also remote employees in 14 states across the U.S.</p><p>Come thrive at SigFig!</p><p><br></p><p>The Team -- Strategic Partnerships</p><p>The Strategic Partnerships team exists to support our enterprise partners in leveraging SigFig-powered solutions to create meaningful value for their customers, employees, and organizations. Within Strategic Partnerships, a variety of sub-teams play specialized roles in acquiring new partners and driving the deployment and ongoing success of partner-specific programs across our Digital Wealth and Atlas solutions. These teams include Enterprise Sales, Relationship Management, Advisor Consulting, and Enterprise Product Marketing.</p><p><br></p><p>The Opportunity - Strategic Partnerships Intern</p><p>You will have the opportunity to directly support high-impact projects related to engaging and closing new partnerships, working across different lines of business and collaborating closely with Sales, Marketing, and other sub-teams. You will conduct market and account research to enable partnership activities and better inform our business development strategy, as well as drafting thought leadership and marketing content.This is a paid 2 to 3-month full-time REMOTE internship.</p><p><br></p><p>How You’ll Make an Impact</p><ul><li>Work closely with the VPs of Sales to create research-based account mappings and target buyer profiles for top opportunities.</li><li>Research, synthesize and write briefings to equip VPs of Sales with relevant and updated information on recent press, annual reports, and strategic priorities for top accounts.</li><li>Identify and organize target prospects and other key stakeholders at accounts, helping VPs of Sales to create strategic account-based plans.</li><li>Collaborate with Enterprise Marketing &amp; Demand Generation to research industry trends and market patterns to create useful, evidence-based thought leadership pieces.</li><li>Draft content copy for various marketing assets and SigFig blog, collaborating cross-functionally with Sales &amp; Marketing teams.</li><li>Support various revenue intelligence projects, such as improving deal forecasting models and analytics reportings within the CRM.</li><li>For candidates with strong creative design skills: support creation of custom sales collateral and assets, such as decks and one-pagers.</li><li><br></li></ul><p>Why We Value You</p><ul><li>Strong qualitative research skills and an excellent writer (as demonstrated by your cover letter!).</li><li>Curious about FinTech, Banking, Wealth Management, and/or Tech Startups.</li><li>Proactive, biased-to-action mentality.</li><li>Enrolled in a 4-year undergraduate program, preferably entering junior or senior year.</li><li>Able to work independently and dedicate 40 hours/week during the program.</li><li>Must be legally authorized to work in the United States without restriction.</li><li>Willing to submit to a background investigation, including verification of your employment and criminal history.</li><li>Must be 18 years of age or older.</li><li><br></li></ul><p>**To apply, please submit an updated resume/CV and a cover letter describing your interest in the role. Applications without cover letters will NOT be considered. You may also submit an optional work sample if you believe a project you’ve recently completed shows relevant transferable skills.**</p><p><br></p><p>Founded in 2006, SigFig is backed by premier venture capital firms, including Bain Capital Ventures, DCM Ventures, Nyca Partners, and Union Square Ventures as well as leading financial institutions including Wells Fargo, UBS, Santander, New York Life, Eaton Vance, and Comerica. We've raised $110 million to support our growth as the #1 online investment advisor for large financial institutions.</p><p>© Nvest. All rights reserved, SigFig is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, religion, color, gender identity, sexual orientation, age, disability, veteran status, or other applicable legally protected characteristics. We encourage people of different backgrounds, experiences, abilities and perspectives to apply. San Francisco Applicants: SigFig will consider applicants with arrest and conviction records (criminal histories) in a manner consistent with the San Francisco Fair Chance Ordinance.</p><p><br></p><p><br></p>",
        "index": 22,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Process Improvement Intern Manufacturing",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-05-03T17:26:22.679Z",
        "url": "https://www.internships.com/posting/bug_38985729668",
        "lastScraped": "2021-05-03T17:26:22.679Z",
        "description": "Process Improvement Intern  Manufacturing\n\nJob Summary:\n\nLooking for a high potential, summer internship candidate with the passion to apply University Technical Learning to real life applications. Someone with the interest to work with People and improve Processes. The candidate will support our 3 manufacturing facilities by identifying improvement opportunity and prioritizing projects to be executed to capture the identified improvements.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS  This job description reflects managements assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned.\n\nPercentage of Time\n\n70%\n\nBusiness Process Mapping\n\n* Mapping of Blue Diamonds manufacturing practices, and their requirements/impact on internal material sourcing between warehouses and manufacturing factories.\n* Assessment of the technology, systems, and staffing practices used to support the processes mapped, and opportunities for optimization.\n* Identifying opportunities to standardize similar practices across facilities, assisting in the creation of agreed upon and accepted standards.\n\n25%\n\nProject Management &amp; Project Execution\n\n* Project management principles, including project statuses and next step reporting.\n* Work with internal stakeholders to translate requirements into actionable project tasks.\n* Assembly of projects into a broader Manufacturing improvement portfolio\n\n5%\n\nProject Status &amp; Completion Presentation\n\n* Assembly of work product into an end of assignment presentation to be given to an audience of Blue Diamond Senior Leaders\n\n_______\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior class standing at a university working towards a degree\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Working towards a degree in Mechanical, Electrical, or Industrial Engineering, or similar\n* Interested in working with people\n* Interested in Food Manufacturing\n* Interesting in Project Management\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Willingness to tackle the challenges presented to the candidate\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Operations Manager, Quality, Safety, Engineering, Finance, Operations Excellence, etc.\n* Contractors, Operators, Mechanics, and Quality Technicians\n\nPHYSICAL DEMANDS\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nWORK ENVIRONMENT\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$25.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor.",
        "index": 23,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:26:33.404Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-05-03T17:26:33.404Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>",
        "index": 24,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:26:43.870Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-05-03T17:26:43.870Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>",
        "index": 25,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern, Strategic Partnerships - Market Research & Business Development",
        "company": "SigFig",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-03T17:26:54.560Z",
        "url": "https://www.internships.com/posting/2176fdb9-b237-4291-b300-3edef233833b",
        "lastScraped": "2021-05-03T17:26:54.560Z",
        "description": "<p>We are SigFig.&nbsp;We’re here to empower everyone to achieve their life goals and ambitions. It takes extraordinary people to disrupt decades of legacy financial practices to reimagine solutions to be customer-centric, engaging, and intuitively designed that use technology to serve customers at scale.</p><p><br></p><p>We are committed to building impactful financial solutions that are accessible and affordable to everyone. Using a combination of design, data science, and technology, we help provide people with financial advice and guidance they need to achieve their life goals. Whether it’s through our direct-to-consumer or businesses-to-consumer products through partnerships with some of the world’s largest and most innovative financial institutions like Wells Fargo, UBS, and Citizens Bank, SigFig seeks to help consumers and institutions make better financial decisions.</p><p><br></p><p>Headquartered in San Francisco, we also have amazing talent solving interesting problems across our offices in Tucson, Calgary, Singapore, and New Delhi, but also remote employees in 14 states across the U.S.</p><p>Come thrive at SigFig!</p><p><br></p><p>The Team -- Strategic Partnerships</p><p>The Strategic Partnerships team exists to support our enterprise partners in leveraging SigFig-powered solutions to create meaningful value for their customers, employees, and organizations. Within Strategic Partnerships, a variety of sub-teams play specialized roles in acquiring new partners and driving the deployment and ongoing success of partner-specific programs across our Digital Wealth and Atlas solutions. These teams include Enterprise Sales, Relationship Management, Advisor Consulting, and Enterprise Product Marketing.</p><p><br></p><p>The Opportunity - Strategic Partnerships Intern</p><p>You will have the opportunity to directly support high-impact projects related to engaging and closing new partnerships, working across different lines of business and collaborating closely with Sales, Marketing, and other sub-teams. You will conduct market and account research to enable partnership activities and better inform our business development strategy, as well as drafting thought leadership and marketing content.This is a paid 2 to 3-month full-time REMOTE internship.</p><p><br></p><p>How You’ll Make an Impact</p><ul><li>Work closely with the VPs of Sales to create research-based account mappings and target buyer profiles for top opportunities.</li><li>Research, synthesize and write briefings to equip VPs of Sales with relevant and updated information on recent press, annual reports, and strategic priorities for top accounts.</li><li>Identify and organize target prospects and other key stakeholders at accounts, helping VPs of Sales to create strategic account-based plans.</li><li>Collaborate with Enterprise Marketing &amp; Demand Generation to research industry trends and market patterns to create useful, evidence-based thought leadership pieces.</li><li>Draft content copy for various marketing assets and SigFig blog, collaborating cross-functionally with Sales &amp; Marketing teams.</li><li>Support various revenue intelligence projects, such as improving deal forecasting models and analytics reportings within the CRM.</li><li>For candidates with strong creative design skills: support creation of custom sales collateral and assets, such as decks and one-pagers.</li><li><br></li></ul><p>Why We Value You</p><ul><li>Strong qualitative research skills and an excellent writer (as demonstrated by your cover letter!).</li><li>Curious about FinTech, Banking, Wealth Management, and/or Tech Startups.</li><li>Proactive, biased-to-action mentality.</li><li>Enrolled in a 4-year undergraduate program, preferably entering junior or senior year.</li><li>Able to work independently and dedicate 40 hours/week during the program.</li><li>Must be legally authorized to work in the United States without restriction.</li><li>Willing to submit to a background investigation, including verification of your employment and criminal history.</li><li>Must be 18 years of age or older.</li><li><br></li></ul><p>**To apply, please submit an updated resume/CV and a cover letter describing your interest in the role. Applications without cover letters will NOT be considered. You may also submit an optional work sample if you believe a project you’ve recently completed shows relevant transferable skills.**</p><p><br></p><p>Founded in 2006, SigFig is backed by premier venture capital firms, including Bain Capital Ventures, DCM Ventures, Nyca Partners, and Union Square Ventures as well as leading financial institutions including Wells Fargo, UBS, Santander, New York Life, Eaton Vance, and Comerica. We've raised $110 million to support our growth as the #1 online investment advisor for large financial institutions.</p><p>© Nvest. All rights reserved, SigFig is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, religion, color, gender identity, sexual orientation, age, disability, veteran status, or other applicable legally protected characteristics. We encourage people of different backgrounds, experiences, abilities and perspectives to apply. San Francisco Applicants: SigFig will consider applicants with arrest and conviction records (criminal histories) in a manner consistent with the San Francisco Fair Chance Ordinance.</p><p><br></p><p><br></p>",
        "index": 26,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Process Improvement Intern - Systems",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-05-03T17:27:14.539Z",
        "url": "https://www.internships.com/posting/bug_38985729639",
        "lastScraped": "2021-05-03T17:27:14.539Z",
        "description": "Process Improvement Intern - Systems\n\nJob Summary:\n\nLooking for a high potential, summer internship candidate with the passion to apply University Technical Learning to real life applications. Someone with the interest to work with People and improve Processes. The candidate will support our 3 manufacturing facilities in establishing and adopting process standards and tools to be used to optimize manufacturing operations.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS  This job description reflects managements assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned.\n\nPercentage of Time\n\n70%\n\nEstablish Manufacturing Systems, Tools, and Templates\n\n* Partner with team members from each of our 3 factories to develop standard tools and templates to be leveraged in improvement and problem-solving activities at the sites.\n* With input from others, develop a methodology for when and how respective tools/templates are used by the Manufacturing team members.\n\n25%\n\nDevelop a SharePoint library for team members to access various tools and templates\n\n* Develop a framework and build a SharePoint (or other) library to house all continuous improvement and problem-solving tools and templates.\n* Implement a standard method for versioning/updating all content within the library, including a cadence for organizational review and sign-off.\n\n5%\n\nProject Status &amp; Completion Presentation\n\n* Assembly of work product into an end of assignment presentation to be given to an audience of Blue Diamond Senior Leaders\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior class standing at a university working towards a degree\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Working towards a degree in Engineering or Business Administration\n* Interested in working with people\n* Interested in Food Manufacturing\n* Interesting in Project Management\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Willingness to tackle the challenges presented to the candidate\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Safety, Quality, Finance, Operations, Process Improvement, Senior Site Leadership, etc.\n* Contractors, Operators, Mechanics, and Quality Technicians\n\nPHYSICAL DEMANDS\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nWORK ENVIRONMENT\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$25.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor.",
        "index": 27,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Innovation Strategic Alliance Intern",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-05-03T17:27:34.582Z",
        "url": "https://www.internships.com/posting/bug_38985729797",
        "lastScraped": "2021-05-03T17:27:34.582Z",
        "description": "Innovation Strategic Alliance Intern\n\nJob Summary:\n\nInnovation Strategic Alliance Intern  In-Support of Open Innovation Team.\n\nIn this role, you will get a hands-on experience working in a fast-paced start-up environment, supporting the open innovation strategy which includes crowd sourcing challenges, scouting technologies, evaluation of proposals and commercialization roadmaps. You will work within an open ecosystem of external partners, promoting rapid, iterative innovation across the organization.\n\nThis position will start in June and complete in September. This position will require a 40 hour per week commitment.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS (w/ percentage of time)\n\n* Support the open Innovation team by testing and validating new business ideas.\n* Works to help advance the open innovation and incorporate in traditional innovation framework.\n* Writing and evaluating responses to business innovation challenges.\n* Support development of ecosystems of solvers, technologies, scientist, and universities.\n* Sourcing, strategic alliance management and project management.\n\nPercentage of Time\n\n35%\n\n* Essential Job Function: Problem Identification for External Ecosystems. Expanding Crowdsourcing Techniques.\n* What learning or experience will the Intern gain:\n* How to source external partners\n* How to develop &amp; communicate business challenges\n* How to create leverage and competition within a challenge\n* The benefits of open innovation\n* How to create ecosystems of solvers\n\n35%\n\n* Essential Job Function: Develop Scouting Frameworks and Techniques to Evaluate External Ecosystem Partners/Solutions.\n* What learning or experience will the Intern gain:\n* Market evaluation\n* Technical feasibility evaluation\n* Cross functional collaboration\n* Developing opportunity analysis\n* Creating proof of concepts\n* Product prototyping approaches\n\n30%\n\n* Essential Job Function: Project Evaluation\n* What learning or experience will the Intern gain:\n* Evaluation of total project and determining feasibility to proceed\n* Commercial process evaluation\n* Prototype processing\n* Sourcing for qualified companies\n* Ariba RFP building\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior or Senior class standing at a university working towards a degree.\n* Strong interest and experience in innovation, entrepreneurship, marketing, or related topics.\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Pursuing a degree in Business, Marketing, Design or Communications.\n* Strong communication, collaboration, research, and presentation skills.\n* Inquisitive, willing to challenge the status quo.\n* Ability to work independently and as a member of a cross functional team.\n* Ability to perform market research, data analytics, financial modeling.\n* Familiar with marketing and storytelling tactics.\n* Comfortable working in whitespace (new areas/concepts).\n* Proficient in Microsoft Office suite.\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Desire to improve open innovation processes and outcomes.\n* Ability to complete tasks, quality, timeliness, and overall presentation.\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Director of Procurement\n* Procurement staff\n* Innovation Marketing staff\n* R&amp;D staff\n* VP Innovation\n\nPHYSICAL DEMANDS\n\n* Fast paced environment handling multiple demands. Must be able to exercise appropriate judgment, as necessary. Requires a high level of initiative and independence. Excellent written and oral communication skills required. Requires ability to use a personal computer for extended periods of time.\n\nWORK ENVIRONMENT\n\n* Home office and office based.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$23.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor.",
        "index": 28,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Procurement Intern",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-05-03T17:27:54.744Z",
        "url": "https://www.internships.com/posting/bug_38985729840",
        "lastScraped": "2021-05-03T17:27:54.744Z",
        "description": "Procurement Intern\n\nJob Summary:\n\nThe Procurement Internship position provides an opportunity for supply chain students or business students with a supply chain focus to get hands on experience working in a fast-paced manufacturing environment.\n\nThe Global Procurement group is a dynamic and fast paced group supporting the company in procurement operations, strategic sourcing, replenishment (MRP) innovation, procurement category management, and contract management. Activities include spend analysis, negotiations, contract terms analysis and sourcing engagements. The Global Procurement teams work with stakeholders across the organization including marking, engineering, IT, facilities management, capital, R&amp;D, legal, finance and innovation.\n\nThis position will start in June and complete in December. This position will require a minimum of 30 hour per week commitment.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS (w/ percentage of time)\n\n* Working closely with Procurement, the chosen candidates will gain experience utilizing strategic Procurement methodologies and world-class eProcurement tools\n* Work on data analysis initiatives and opportunities to improve the effectiveness of strategic sourcing activities\n* Daily networking and learning opportunities with a broad exposure to stakeholders who work with Procurement\n* Open innovation activities including sourcing, strategic alliance management and project management\n* Technology process and workflows within SAP and Ariba\n\nPercentage of Time\n\n40%\n\n* Essential Job Function: Issues/Reviews RFP/RFQ's and obtains/provides proposals/quotes for standard products and services in support of new business proposals and on-going projects. Seeks and promotes competition in the acquisition of goods and services. collect NDAs, RFQs, RFIs and RFPs and ensure all commercial terms are agreed and documented.\n\n* What learning or experience will the Intern gain:\n* Legal process, contract lifecycle and commercial term management.\n* Procure to Pay process (p2p)\n* Source to Settle process (s2s)\n* Evaluation / analytics of proposals\n* Utilization of world class technology in procurement and sourcing processes\n* Develop metrics and monitor supplier performance using supplier scorecards\n* Assist stakeholder groups with identifying alternate sources focusing on quality, delivery, and total cost as the drivers\n\n30%\n\n* Essential Job Function: Capital procurement- Internship will focus on capital projects defined by management and managed by the Intern to completion\n\n* What learning or experience will the Intern gain:\n* Capital procurement and governance process\n* Scope of work/Master service contracts\n* Change order process, justification\n* Capital procurement strategies, indexes, and benchmarking\n* Manage project deliverables, meeting action items, schedule, documentation, and content in support of capital projects.\n* Manage content, workflow, and approvals related to Request for Information, Project Submittals, and Project governance\n* Multiple aspects of engineering, design &amp; construction, and facilities asset maintenance programs\n\n30%\n\n* Essential Job Function: Innovation procurement, supplier onboarding and supplier diversity\n\n* What learning or experience will the Intern gain:\n* Supplier Diversity reporting and efforts to increase supplier diversity registration and compliance.\n* Innovation process from discovery through commercialization\n* Supplier onboarding process, supplier risk management and reporting\n* Open innovation frameworks\n* Presentation and communication skill building\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* College Junior or Senior majoring in Supply Chain, Operations Management, Procurement/Sourcing, Business Management, Business Administration, or equivalent field\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Sourcing, procurement, negotiation, contracting, construction management\n* Ability to work independently and as a member of a cross functional team\n* Ability to work virtually\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Desire to improve procurement processes and outcomes\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Procurement director, procurement category managers and administration Stakeholders from marketing, engineering, innovation and legal\n\nPHYSICAL DEMANDS\n\nFast paced environment handling multiple demands. Must be able to exercise appropriate judgment, as necessary. Requires a high level of initiative and independence. Excellent written and oral communication skills required. Requires ability to use a personal computer for extended periods of time.\n\nWORK ENVIRONMENT\n\n* Office\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$20.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor.",
        "index": 29,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning",
            "virtual reality",
            "software engineering"
        ],
        "start": "2021-06-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Economic Analysis Intern",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-04-03T17:28:14.828Z",
        "url": "https://www.internships.com/posting/bug_38982481326",
        "lastScraped": "2021-05-03T17:28:14.828Z",
        "description": "Job Information\n\nState of Minnesota Economic Analysis Intern in St. Paul, Minnesota\n\nJob Summary\n\nJob Summary\n\nEconomic Analysis at Minnesota Management &amp; Budget is responsible for preparing and presenting forecasts of Minnesota's state tax revenues. Forecast information is used by the Governor and Legislature to ensure that enacted budgets remain on track and in balance, and to plan for future budgets. Our small group of three economists, plus the State Economist, also produce objective research to inform policymakers and the public on a broad range of topics related to Minnesota's economy and budget.\n\nThe Economic Analysis (EA) summer internship provides an excellent opportunity for a graduate student to participate in EA's research and to experience our economic and revenue forecasting process up close. The internship is designed to provide valuable work experience for students considering careers in economics, finance, public policy, statistics, or related areas. Interns gain valuable experience in areas such as research project planning, data collection, tools and concepts of economic analysis, and communications and outreach. This internship is expected to continue for approximately 10 to 12 weeks.\n\nEA interns are typically assigned to a specific research project for the summer. Research projects generally include special studies where planning, design, implementation, and presentation of a research topic are relevant to the evaluation of Minnesota's economy or state tax revenues.\n\nIn addition to a research project, this intern may assist EA staff with research and analysis related to economic and revenue forecasting. This includes conducting literature reviews, compiling data, economic modeling, and interpreting results. The intern may also participate in educational briefings or attend seminars related to Minnesota's economy, budgeting process, or public policy.\n\nQualifications\n\nMinimum Qualifications\n\n* Undergraduate degree AND pursuing a graduate degree in applied economics, economics, public policy, or a related field.\n* Graduate coursework in econometrics.\n* Interest in understanding the state economy and/or budget process.\n* Strong critical thinking skills and data analysis proficiency.\n* Excellent interpersonal skills and ability to communicate ideas in writing.\n* Ability to collaboratively organize a research project and meet tight deadlines.\n* Experience using computer applications such as Microsoft Excel, Word, PowerPoint, etc.\n* Experience modeling and programming in R, SAS, or EViews\n\nTo be eligible for an Internship, you must meet the following requirements:\n\n1) You must be a student at an accredited educational institution; AND\n\n2) Your advisor must certify that you will either receive academic credit or fulfill an academic requirement. The signature of a sponsoring academic instructor is required prior to beginning an Internship.\n\nAdditional Requirements\n\nSuccessful candidate must pass past-employer reference checks and a criminal background check.\n\nApplication Details\n\nHow to Apply\n\nClick \"Apply\" at the bottom of the page. If you have questions about applying for jobs, contact the job information line at 651-259-3637.\n\nFor additional information about the application process, go to http://www.mn.gov/careers.\n\nContact\n\nIf you have questions about the position, contact Colleen Siegel at colleen.siegel@state.mn.us.\n\n------------\n\nAN EQUAL OPPORTUNITY EMPLOYER\n\nThe State of Minnesota is an equal opportunity, affirmative action, and veteran-friendly employer. We are committed to providing culturally responsive services to all Minnesotans. The State of Minnesota recognizes that a diverse workforce is essential and strongly encourages qualified women, minorities, individuals with disabilities, and veterans to apply.\n\nWe will make reasonable accommodations to all qualified applicants with disabilities. If you are an individual with a disability who needs assistance or cannot access the online job application system, please contact the job information line at 651-259-3637 or email careers@state.mn.us. Please indicate what assistance you need.\n\nJob Title: Economic Analysis Intern\n\nLocation: St. Paul\n\nJob ID: 44856\n\nRegular/Temporary: Intern\n\nFull/Part Time: Intermittent\n\nWho May Apply: Open to all qualified job seekers\n\nDate Posted: 03/30/2021\n\nClosing Date: 04/19/2021\n\nHiring Agency/Seniority Unit: Mn Management &amp; Budget\n\nHiring Agency: Mn Management &amp; Budget\n\nDivision/Unit: Economic Analysis Division\n\nWork Shift: Day Shift\n\nWork Hours: Day Shift\n\nWork Shift/Work Hours: Day Shift\n\nDays of Work: Monday - Friday (schedule to be determined)\n\nSalary Range: $20.40/hourly\n\nClassified Status: Non-Status\n\nBargaining Unit/Union: 223 - Non-Employee/Unrep\n\nJob Class: Intern\n\nWorking Title: Economic Analysis Intern",
        "index": 30,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "contact": "651-259-3637",
        "remote": false
    },
    {
        "position": "Pharmacy Technician/Pharm Technician Apprentice",
        "company": "N/A",
        "location": {
            "city": "Kaneohe",
            "state": "Hawaii"
        },
        "posted": "2021-04-03T17:28:35.038Z",
        "url": "https://www.internships.com/posting/bug_38976804378",
        "lastScraped": "2021-05-03T17:28:35.038Z",
        "description": "Job Information\n\nWalgreens Pharmacy Technician / Pharm Tech Apprenticeship in KANEOHE, Hawaii\n\nJob Description:\n\nOur pharmacy technician positions have undergone an exciting transformation, moving from a transaction-based environment to a much more patient-centric one. As a Walgreens Pharmacy Technician or Pharmacy Technician Apprentice, you'll be front and center  interacting with our customers and developing strong patient relationships. Pharmacy is the core of our business, and our pharmacy technicians enjoy all the tools and support  including the latest technology  to grow their careers and reach their goals.\n\nWalgreens is proud to invest &amp; champion an earn while you learn Pharmacy Technician Training Program recognized by ASHP &amp; Department of Labor. This apprenticeship program gives you an entry point to a career in health care by guiding you in taking steps towards becoming a Pharmacy Technician Certification Board (PTCB) Certified Pharmacy Technician and helping you maintain the high level of skill required in the pharmacy care industry. Arming you with a nationally recognized, portable credential that will help you advance your career.\n\nWhether you are new to working in pharmacies or are an experienced Pharmacy Technician Apply Now! Walgreens will train you to use your skills and talents to serve and care for our patients and customers. The courses, learning activities, and resources provided to you in our pharmacy technician training program are designed to give you foundational and advanced knowledge, skills, and on-the-job experiences you need to prepare to become a certified pharmacy technician.\n\n*\n\nIn accordance with state and federal regulations, assists the pharmacist, under direct supervision, in the practice of pharmacy. Assists the pharmacist in the performance of other Pharmacy Department duties in accordance with Company policies and procedures.\n\n*\n\nResponsible for using pharmacy systems to obtain patient and drug information and process prescriptions. If PTCB certified, assists with and coaches pharmacy technicians in the operation of pharmacy systems and cashiers in the operation of the pharmacy cash registers.\n\n*\n\nModels and delivers a distinctive and delightful customer experience.\n\nCustomer Experience\n\n*\n\nEngages customers and patients by greeting them and offering assistance with products and services. Resolves customer issues and answers questions to ensure a positive customer experience.\n\n*\n\nModels and shares customer service best practices with all team members to deliver a distinctive and delightful customer experience, including interpersonal habits (e.g., greeting, eye contact, courtesy, etc.) and Walgreens service traits (e.g., offering help proactively, identifying needs, servicing until satisfied, etc.).\n\n*\n\nDevelops strong relationships with most valuable customers.\n\nOperations\n\n*\n\nUnder the supervision by the pharmacist, assist in the practice of pharmacy, in accordance with state, federal, and company policy. Reviews and complies with the Walgreen Co. Pharmacy Code of Conduct.\n\n*\n\nPerforms duties as assigned by Pharmacy Manager, Staff Pharmacist and Store Manager including utilizing pharmacy systems to enter patient and drug information, ensuring information is entered correctly, filling prescriptions by retrieving, counting and pouring pharmaceutical drugs, verifying medicine is correct, and checking for possible interactions. Assists pharmacists in scheduling and maintaining work flow.\n\n*\n\nReports, immediately, prescription errors to pharmacist on duty and adheres to Company policies and procedures in relation to pharmacy errors and the Quality Improvement Program.\n\n*\n\nStrictly adheres to the Walgreen Co. policy regarding Good Faith Dispensing during all applicable prescription dispensing activities.\n\n*\n\nResponsible and accountable for registering all related sales on assigned cash register, collects and handles cash as required. Takes customer to OTC aisle when possible to assist in locating products.\n\n*\n\nHandles telephone calls that do not require personal attention of the pharmacist, including those to physicians.\n\n*\n\nProcesses (corrects and resubmits) manual claims for third party program prescription services in a timely and efficient manner, and performs other clerical duties, as assigned by the Pharmacy Manager.\n\n*\n\nAssists and supports Pharmacy Department on inventory management activities, such as, ordering, unpacking, checking and storing shipment of pharmaceuticals. Maintains knowledge of Company asset protection techniques, and files claims for warehouse overages (merchandise received, but not billed), shortages (merchandise billed, but not received), order errors or damaged goods involving Rx drugs.\n\n*\n\nMay assist pharmacist in administering clinical services including the collection and proper labeling of blood/urine samples from patients and other clinical services as required; assists pharmacy staff in coordination of clinical services, Walgreens healthcare clinics and external providers.\n\n*\n\nAssists Pharmacy Manager and Staff Pharmacist in developing and maintaining good relationships with the local medical community, including physicians, nurses, and other health care providers, by medical provider detailing and outreach to health groups, retirement homes, nursing homes, and other forums for enhancing growth opportunities.\n\n*\n\nAssists with exterior and interior maintenance by ensuring the Pharmacy Department is stocked with adequate supplies, clean, neat and orderly in condition and appearance.\n\n*\n\nComplies with all company policies and procedures; maintains respectful relationships with coworkers.\n\n*\n\nCompletes special assignments and other tasks as assigned.\n\nTraining &amp; Personal Development\n\n*\n\nEarns and maintains PTCB certification through the designated PTCB training program and/or state required certification/registration. Otherwise, earns PTCB certification as condition of promotion to senior technician.\n\n*\n\nAttends training and completes PPLs requested by Manager and acquires continuing education credits. Maintains knowledge and skill in healthcare and pharmacy, including latest news and developments.\n\nJob ID: 582150BR\n\nTitle: Pharmacy Technician / Pharm Tech Apprenticeship\n\nCompany Indicator: Walgreens\n\nEmployment Type: Flexible hours\n\nJob Function: Retail\n\nFull Store Address: 46-021 KAMEHAMEHA HWY,KANEOHE,HI,96744\n\nFull District Office Address: 46-021 KAMEHAMEHA HWY,KANEOHE,HI,96744-03769-10048-S\n\nExternal Basic Qualifications:\n\n*\n\nMust be fluent in reading, writing, and speaking English. (Except in Puerto Rico)\n\n*\n\nRequires willingness to work flexible schedule, including evening and weekend hours.\n\nPreferred Qualifications:\n\n*\n\nPrefer six months of experience in a retail environment.\n\n*\n\nPrefer to have prior work experience with Walgreens.\n\n*\n\nPrefer good math skills so they can fill prescriptions accurately, including counting, measuring and weighing medications.\n\n*\n\nPrefer good computer skills.\n\n*\n\nPrefer the knowledge of store inventory control.\n\n*\n\nPrefer PTCB certification.\n\nAn Equal Opportunity Employer, including disability/veterans.\n\nThe following information is applicable to Colorado only, in accordance with the Colorado Pay Equity Act. In Colorado, an employee in this position can expect a salary/hourly rate between $14.00 and $20.00 depending on experience, seniority, geographic locations, and other factors permitted by law. To review the available benefits, please click here: jobs.walgreens.com/benefits .Walgreens will provide applicants in other states with information related to the positions, to the extent required by state or local law, by calling 1-866-967-5492\n\nShift: Various\n\nStore: 10048-KANEOHE HI",
        "index": 31,
        "skills": [
            "information technology",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "contact": "1-866-967-5492",
        "remote": false
    },
    {
        "position": "Pharmacy Technician/Pharm Technician Apprentice",
        "company": "N/A",
        "location": {
            "city": "Kailua",
            "state": "Hawaii"
        },
        "posted": "2021-05-03T17:28:55.187Z",
        "url": "https://www.internships.com/posting/bug_38984324367",
        "lastScraped": "2021-05-03T17:28:55.187Z",
        "description": "Job Information\n\nWalgreens Pharmacy Technician / Pharm Tech Apprenticeship in KAILUA, Hawaii\n\nJob Description:\n\nOur pharmacy technician positions have undergone an exciting transformation, moving from a transaction-based environment to a much more patient-centric one. As a Walgreens Pharmacy Technician or Pharmacy Technician Apprentice, you'll be front and center  interacting with our customers and developing strong patient relationships. Pharmacy is the core of our business, and our pharmacy technicians enjoy all the tools and support  including the latest technology  to grow their careers and reach their goals.\n\nWalgreens is proud to invest &amp; champion an earn while you learn Pharmacy Technician Training Program recognized by ASHP &amp; Department of Labor. This apprenticeship program gives you an entry point to a career in health care by guiding you in taking steps towards becoming a Pharmacy Technician Certification Board (PTCB) Certified Pharmacy Technician and helping you maintain the high level of skill required in the pharmacy care industry. Arming you with a nationally recognized, portable credential that will help you advance your career.\n\nWhether you are new to working in pharmacies or are an experienced Pharmacy Technician Apply Now! Walgreens will train you to use your skills and talents to serve and care for our patients and customers. The courses, learning activities, and resources provided to you in our pharmacy technician training program are designed to give you foundational and advanced knowledge, skills, and on-the-job experiences you need to prepare to become a certified pharmacy technician.\n\n*\n\nIn accordance with state and federal regulations, assists the pharmacist, under direct supervision, in the practice of pharmacy. Assists the pharmacist in the performance of other Pharmacy Department duties in accordance with Company policies and procedures.\n\n*\n\nResponsible for using pharmacy systems to obtain patient and drug information and process prescriptions. If PTCB certified, assists with and coaches pharmacy technicians in the operation of pharmacy systems and cashiers in the operation of the pharmacy cash registers.\n\n*\n\nModels and delivers a distinctive and delightful customer experience.\n\nCustomer Experience\n\n*\n\nEngages customers and patients by greeting them and offering assistance with products and services. Resolves customer issues and answers questions to ensure a positive customer experience.\n\n*\n\nModels and shares customer service best practices with all team members to deliver a distinctive and delightful customer experience, including interpersonal habits (e.g., greeting, eye contact, courtesy, etc.) and Walgreens service traits (e.g., offering help proactively, identifying needs, servicing until satisfied, etc.).\n\n*\n\nDevelops strong relationships with most valuable customers.\n\nOperations\n\n*\n\nUnder the supervision by the pharmacist, assist in the practice of pharmacy, in accordance with state, federal, and company policy. Reviews and complies with the Walgreen Co. Pharmacy Code of Conduct.\n\n*\n\nPerforms duties as assigned by Pharmacy Manager, Staff Pharmacist and Store Manager including utilizing pharmacy systems to enter patient and drug information, ensuring information is entered correctly, filling prescriptions by retrieving, counting and pouring pharmaceutical drugs, verifying medicine is correct, and checking for possible interactions. Assists pharmacists in scheduling and maintaining work flow.\n\n*\n\nReports, immediately, prescription errors to pharmacist on duty and adheres to Company policies and procedures in relation to pharmacy errors and the Quality Improvement Program.\n\n*\n\nStrictly adheres to the Walgreen Co. policy regarding Good Faith Dispensing during all applicable prescription dispensing activities.\n\n*\n\nResponsible and accountable for registering all related sales on assigned cash register, collects and handles cash as required. Takes customer to OTC aisle when possible to assist in locating products.\n\n*\n\nHandles telephone calls that do not require personal attention of the pharmacist, including those to physicians.\n\n*\n\nProcesses (corrects and resubmits) manual claims for third party program prescription services in a timely and efficient manner, and performs other clerical duties, as assigned by the Pharmacy Manager.\n\n*\n\nAssists and supports Pharmacy Department on inventory management activities, such as, ordering, unpacking, checking and storing shipment of pharmaceuticals. Maintains knowledge of Company asset protection techniques, and files claims for warehouse overages (merchandise received, but not billed), shortages (merchandise billed, but not received), order errors or damaged goods involving Rx drugs.\n\n*\n\nMay assist pharmacist in administering clinical services including the collection and proper labeling of blood/urine samples from patients and other clinical services as required; assists pharmacy staff in coordination of clinical services, Walgreens healthcare clinics and external providers.\n\n*\n\nAssists Pharmacy Manager and Staff Pharmacist in developing and maintaining good relationships with the local medical community, including physicians, nurses, and other health care providers, by medical provider detailing and outreach to health groups, retirement homes, nursing homes, and other forums for enhancing growth opportunities.\n\n*\n\nAssists with exterior and interior maintenance by ensuring the Pharmacy Department is stocked with adequate supplies, clean, neat and orderly in condition and appearance.\n\n*\n\nComplies with all company policies and procedures; maintains respectful relationships with coworkers.\n\n*\n\nCompletes special assignments and other tasks as assigned.\n\nTraining &amp; Personal Development\n\n*\n\nEarns and maintains PTCB certification through the designated PTCB training program and/or state required certification/registration. Otherwise, earns PTCB certification as condition of promotion to senior technician.\n\n*\n\nAttends training and completes PPLs requested by Manager and acquires continuing education credits. Maintains knowledge and skill in healthcare and pharmacy, including latest news and developments.\n\nJob ID: 593473BR\n\nTitle: Pharmacy Technician / Pharm Tech Apprenticeship\n\nCompany Indicator: Walgreens\n\nEmployment Type: Flexible hours\n\nJob Function: Retail\n\nFull Store Address: 56 ONEAWA ST,KAILUA,HI,96734\n\nFull District Office Address: 56 ONEAWA ST,KAILUA,HI,96734-02501-12466-S\n\nExternal Basic Qualifications:\n\n*\n\nMust be fluent in reading, writing, and speaking English. (Except in Puerto Rico)\n\n*\n\nRequires willingness to work flexible schedule, including evening and weekend hours.\n\nPreferred Qualifications:\n\n*\n\nPrefer six months of experience in a retail environment.\n\n*\n\nPrefer to have prior work experience with Walgreens.\n\n*\n\nPrefer good math skills so they can fill prescriptions accurately, including counting, measuring and weighing medications.\n\n*\n\nPrefer good computer skills.\n\n*\n\nPrefer the knowledge of store inventory control.\n\n*\n\nPrefer PTCB certification.\n\nThe following information is applicable for San Francisco, CA applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nAn Equal Opportunity Employer, including disability/veterans.\n\nThe following information is applicable to Colorado only, in accordance with the Colorado Pay Equity Act. In Colorado, an employee in this position can expect a salary/hourly rate between $14.00 and $20.00 depending on experience, seniority, geographic locations, and other factors permitted by law. To review the available benefits, please click here: jobs.walgreens.com/benefits .Walgreens will provide applicants in other states with information related to the positions, to the extent required by state or local law, by calling 1-866-967-5492\n\nShift: Various\n\nStore: 12466-KAILUA HI",
        "index": 32,
        "skills": [
            "information technology",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "contact": "1-866-967-5492",
        "remote": false
    }
]