[
    {
        "position": "Fellowship in Machine Learning and Computer Vision",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:49:32.485Z",
        "url": "https://www.internships.com/posting/1edd34b5-e40d-4254-9b91-f1b85438ee79",
        "lastScraped": "2021-07-08T09:49:32.485Z",
        "description": "<p>The Department of Defense (DoD) is offering a postdoctoral fellowship for their Visiting Scientist Program at the National Geospatial-Intelligence Agency (NGA), a world leader in timely, relevant, accurate and actionable GEOINT.</p><p><br></p><p><strong>What will I be doing?</strong></p><p><br></p><p>With the omnipresence of high quality images available via the internet and social media, high resolution photographs from US -denied corners of the world are available like never before.&nbsp;Oftentimes, these images contain objects of very high interest and intelligence value.&nbsp;But, unlike highly calibrated space-borne and aerial cameras whose image metadata contains sensor position, orientation, calibration characteristics, etc., photographs harvested from personal devices and the internet are absent such metadata – metadata required for accurate photogrammetric exploitation of objects displayed within the image scene.</p><p><br></p><p>Even though images harvested from non-metric (unknown) sources typically display very high resolution quality, the process of obtaining accurate dimensions of objects depicted in those images is oftentimes immensely difficult and frequently unfruitful.&nbsp;This is partly attributed to the absence of sensor/lens data, sensor orientation and geolocation, and image cropping (non-full frame images).&nbsp;Additional constraints are presented by the absence of multiple images containing the object(s) of interest, i.e. only a single image being available, and finding object(s) of known size within an image scene, i.e. identifying a known scalar.&nbsp;Lastly, close range images often display perspective foreshortening, and sometimes wide-angle lens distortion, adding additional challenges to photogrammetric exploitation of objects in a scene.</p><p><br></p><p>As the selected candidate, you will utilize advances in computer vision and machine learning combined with well-established photogrammetric techniques to derive a camera sensor model from a single or very small-batch of metadata-absent images acquired using consumer grade cameras/mobile devices.&nbsp;The research will involve developing an automated or semi-automated process utilizing learned/recognized common objects, shapes, geometries, and architectural standards present in most photographic scenes.&nbsp;The derived sensor model will enable accurate dimensional analysis of metadata-absent images.</p><p><br></p><p><strong>Where will I be located?</strong></p><p><br></p><p>You will conduct research remotely under the direction of a mentor who will be based in Springfield, Virginia.&nbsp;</p><p><br></p><p><strong>What is the anticipated start date?</strong></p><p><br></p><p>NGA is ready to make appointments immediately. Exact start dates&nbsp;will be determined at the time of selection and in coordination with the selected candidate. Applications are reviewed on an ongoing basis and fellowships will be filled as qualified candidates are identified.</p><p><br></p><p><strong>What is the appointment length?</strong></p><p><br></p><p>Appointments are initially for one year with the option to extend the appointment for up to four additional years, contingent upon project needs and funding availability.</p><p><br></p><p><strong>What are the benefits?</strong></p><p><br></p><p>As a participant with NGA, you will receive:</p><p><br></p><ul><li>Stipend, determined by NGA, based on your academic credentials and commensurate with GS Locality Pay Tables</li><li>Health Insurance Allowance</li><li>Relocation Allowance, if you are located more than 50 miles one way from the hosting facility</li><li>Travel Expense Allowance</li><li>Education and Research Support Allowance</li></ul><p><br></p><p><strong>About NGA</strong></p><p><br></p><p>The National Geospatial-Intelligence Agency (NGA) delivers world-class geospatial intelligence that provides a decisive advantage to policymakers, warfighters, intelligence professionals, and first responders. Anyone who sails a U.S. ship, flies a U.S. aircraft, makes national policy decisions, fights wars, locates, target, responds to natural disasters, or even navigates with a cellphone relies on NGA. NGA enables all of these critical actions and shapes decisions that impact our world through the indispensable discipline of geospatial intelligence.&nbsp;&nbsp;For more information about NGA, please visit&nbsp;https://www.nga.mil/.</p><p><br></p><p><strong>About ORISE</strong></p><p><br></p><p>This program, administered by Oak Ridge Associated Universities (ORAU) through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and DoD.&nbsp;Participants do not enter into an employee/employer relationship with ORISE, ORAU, DoD or any other office or agency. Instead, you will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.&nbsp;For more information, visit the&nbsp;ORISE Research Participation Program at the U.S. Department of Defense.</p><p><br></p><p><strong>Qualifications</strong></p><p class=\"ql-align-right\"><br></p><p>The qualified candidate will have a doctoral&nbsp;degree or be within nine months of completion of that degree. Degree must have been received within five years of the appointment start date.&nbsp;U.S. military veterans who have been honorably discharged (or who have been medically discharged because of a service-connected disability) and who received a doctoral degree within ten years of the desired start date are also eligible.</p><p><br></p><p>Highly competitive applicants will have:</p><p><br></p><ul><li>A background in computer vision, machine learning or other relevant discipline.</li><li>Experience in the application of the scientific method.</li><li>A background in modern research techniques in a field highly related to the GEOINT Research.</li><li>Experience in conceptualizing a broad research agenda and in planning and executing specific research projects.</li><li>Knowledge of scientific computing/scripting languages such as Python.</li><li>Experience working with remote sensing and geographic data.</li><li>Ability to integrate with large data repositories.</li><li>A background in high-performance computing.</li></ul>",
        "index": 1,
        "skills": [
            "machine learning",
            "project management",
            "python",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-06-08T09:49:41.214Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-07-08T09:49:41.214Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>",
        "index": 2,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Programming Intern Xcode",
        "company": "For Our Youth",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:49:50.128Z",
        "url": "https://www.internships.com/posting/ea256a59-de91-4d68-bd5c-d3332e022fe2",
        "lastScraped": "2021-07-08T09:49:50.128Z",
        "description": "<p>Hello we have an educational Math Game we are wanting to get up on different sites must have knowledge on Xcode and be committed we will give stipend after job is completed.</p>",
        "index": 3,
        "skills": [
            "game design"
        ],
        "remote": true
    },
    {
        "position": "Programming Intern Xcode",
        "company": "For Our Youth",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:49:59.113Z",
        "url": "https://www.internships.com/posting/ea256a59-de91-4d68-bd5c-d3332e022fe2",
        "lastScraped": "2021-07-08T09:49:59.113Z",
        "description": "<p>Hello we have an educational Math Game we are wanting to get up on different sites must have knowledge on Xcode and be committed we will give stipend after job is completed.</p>",
        "index": 4,
        "skills": [
            "game design"
        ],
        "remote": true
    },
    {
        "position": "Engineer Recruiter Interns (Immediate Start)",
        "company": "Minuteman Group",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:50:07.785Z",
        "url": "https://www.internships.com/posting/90c97ed4-3c94-4779-bcd3-4bc24b1b4f10",
        "lastScraped": "2021-07-08T09:50:07.785Z",
        "description": "<p>If you are a current engineering, software or data science intern, this is an interesting summer internship. We are seeking current students or 2021 graduates with technical degrees in engineering, or computer and data science, who are interested in working in the human resources function. This position will require you to review open positions, search for candidates, and screen resumes, talk to candidates, and discuss them with Senior Recruiters. </p><p><br></p><p>Our senior recruiters are primarily engineers who decided to take a different career path.  This position will give a sense of what recruiters are looking for, and teach you a lot about different roles in engineering.  We will train you on the job; we need to know you are passionate about this. </p><p><br></p><p><strong>Position Scope/Job Functions:</strong></p><p><strong> </strong>To provide highly skilled candidates for current job openings using expertise in engineering, IT and recruiting.</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Source candidates using various resources including job boards and internal database</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact active and passive candidates and build talent pipeline for hiring needs</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Send emails, texts and make phone calls to prospective candidates</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Screen candidates to determine fit with the active positions</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work with Senior Recruiters to submit suitable candidates to the client</p><p><br></p>",
        "index": 5,
        "skills": [
            "information technology",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Software Development Intern",
        "company": "N/A",
        "location": {
            "city": "Arizona",
            "state": "United States"
        },
        "posted": "2021-06-08T09:50:25.900Z",
        "url": "https://www.internships.com/posting/bug_39001248311",
        "lastScraped": "2021-07-08T09:50:25.900Z",
        "description": "?\nSoftware Development InternJob Locations\nUS-AZ-PhoenixReq No.\n2021-8149Category\nInternshipsType\nIntern\n\n\n\nSummary of Major Responsibilities\n\n\nThe Software Development Intern will assist with software configuration, user documentation and validation documentation and execution.  The position is intended to be a full-time opportunity for an engineering or science undergraduate to obtain hands-on laboratory experience in an industry setting.\n\n\n\nEssential Duties and Responsibilities\n\n\nAs coordinated by a member of the software development team, competently carry out software configuration to the specifications of the software manuals and existing user Standard Operating Procedures.Assist in preparing user documentation for off the shelf products and development projects used at Ashion.Assist in preparing validation documentation.Assist in executing operational qualification and performance qualification test plans for software validation. Operate scientific instrumentation related to performance of duties and notifies appropriate personnel of any problems.Effectively utilize and apply established methods or technologies.Ability to complete assignments in expected time frames.Ability to collaborate and work effectively within team and department.Strong attention to detail.Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork.Support and comply with the companys Quality Management System policies and procedures.Regular and reliable attendance \n\n\n\nQualifications\n\n\nMinimum Qualifications:Working towards or having obtained a bachelors degree in computer sciences, bioinformatics, chemical/physical/biological science, or related field. Demonstrated ability to perform the Essential Duties of the position with or without accommodation.Authorization to work in the United States without sponsorship Preferred QualificationsInterest in helping support a software development team in a clinical genomic sequencing laboratory. Working knowledge of basic molecular biology or biochemical techniquesWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Companys affirmative action program are available to any applicant or employee for inspection upon request.",
        "index": 6,
        "skills": [
            "project management",
            "software engineering",
            "bioinformatics",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:50:34.781Z",
        "url": "https://www.internships.com/posting/ccm_95b5ee54-01bf-4c11-a351-eb453bd3c788",
        "lastScraped": "2021-07-08T09:50:34.781Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 7,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-04-30T15:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Bioavailability of Metals and Metalloids Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-08T09:50:47.392Z",
        "url": "https://www.internships.com/posting/f45f8432-8f55-4c55-878d-aac3d7381355",
        "lastScraped": "2021-07-08T09:50:47.392Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will use in vitro and in vivo methods to assess the bioavailability of metals and metalloids. The in vitro methods include the use of mammalian cell-based assays.&nbsp;The in vivo methods include the use of a mouse-based assay.&nbsp;The research participant will have the opportunity to become part of a multi-lab research team that collaborates in the metal/metalloid bioavailability project. This research project provides an opportunity for the research participant to gain experience and proficiency in many aspects of laboratory research.&nbsp;During this opportunity, the research participant will develop skills in mammalian cell culture, animal handling, necropsy, sample collection, tissue preparation, and the processing of tissues for chemical and biochemical analysis.&nbsp;The research participant will learn proper record keeping skills and receive instruction on experimental design, animal feeding studies and animal housing and husbandry. The research participant will gain experience collecting, processing, analyzing and managing scientific data.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor, the research participant may be involved in the following training activities.</p><ul><li>Handling and treating small laboratory animals (mice)</li><li>Basic animal husbandry</li><li>Necropsy and preparation of tissues for chemical and biochemical analyses (such as mass spectroscopy, neutron activation, spectral analysis, and enzymatic assays)</li><li>Analytical chemistry techniques</li><li>Mammalian cell culture</li><li>Cell culture-based biological assays</li><li>Record keeping</li><li>Data processing and statistical analysis graphical presentation</li><li>Evaluating scientific literature and toxicological databases for information relevant to the bioavailability of metals and metalloids</li><li>Participating through guidance of mentor in a range of scientific efforts, performs tissue analysis, data analysis using computers, performs QA/QC evaluations and library search relevant scientific literature</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.miachelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 8,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "PROGRAMMER Summer Internship",
        "company": "Elle Investments",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:50:57.638Z",
        "url": "https://www.internships.com/posting/48ceb103-00ce-4d6a-8fb5-c18aac8760fc",
        "lastScraped": "2021-07-08T09:50:57.638Z",
        "description": "<p>We are currently offering a  Programmer/ Designer internship - HTML, CSS, PHP, JS, PYTHON, JAVA, MySQL</p><p><br></p><p>The internship is ideal for someone who'd like to develop real-world coding experience by working on real projects. You'll have the opportunity to gain practical experience with a variety of tools.</p><p>The ideal candidate is completing a graduate or undergraduate program in computer science or MIS at a US university and is eager to get a head-start by participating in the development of real-life applications. This opportunity is intended for a programmer who is particularly interested in developing a rather broad range of skills and experience.</p><p><br></p><p>This internship takes place remotely with most of the interactions taking place electronically and with almost daily conference calls. This is a virtual internship and a substantial time commitment is required.</p><p><br></p><p><br></p>",
        "index": 9,
        "skills": [
            "java",
            "python",
            "project management",
            "virtual reality",
            "web development"
        ],
        "remote": true
    },
    {
        "position": "Software Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "VT",
            "state": "United States"
        },
        "posted": "2021-06-08T09:51:15.721Z",
        "url": "https://www.internships.com/posting/sam_4070107230",
        "lastScraped": "2021-07-08T09:51:15.721Z",
        "description": "<div><p>Software Engineer Intern<br>Systems &amp; Software - Remote<br><br>As a Software Engineer for Systems &amp; Software, you will be placed into a small Agile Development team where you will play an important role in helping design, build, test and deploy our products. You will work hand in hand with other members on your team to support our current product lines and build out the future of our product. You will have access to the latest tools, hardware and some of the brightest software engineers in this area.<br><br>We are an agile development organization, utilizing Kanban on the support side and Scrum for our development teams. We use industry standard software development tools such as Jira, Git, Docker, Slack and Confluence to manage our iterative design, build, test, and deployment process... any experience with the above is an asset.</p><p></p><p>What we are looking for</p><ul><li>B.S in Computer Science or Computer Information in the process of, or has recently completed a bachelor of science degree in Computer Science, Software Engineering or related field</li><li>Maintains an above average GPA especially in the areas of Engineering</li><li>Has some programming experience with Java or any flavor of C</li><li>Is familiar with HTML, CSS, and JavaScript</li><li>Has an exceptional work ethic and is ambitious</li><li>Communicates well with others and is a team player</li></ul></div>",
        "index": 10,
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "hardware",
            "c and c++",
            "project management",
            "information technology",
            "web development"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:51:28.219Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-07-08T09:51:28.219Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>",
        "index": 11,
        "skills": [
            "project management",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "USFS Internship in Diversity-Forest Ecosystem Functioning Using GIS/Remote Sensing",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-08T09:51:37.030Z",
        "url": "https://www.internships.com/posting/a42ec2d0-dcf1-42c8-b7e5-f6d877ecd968",
        "lastScraped": "2021-07-08T09:51:37.030Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center located in Research Triangle Park, North Carolina. Initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Our proposed work therefore addresses all the four criteria of this solicitation. Through this research and collaboration, the follow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is part-time (20 hours per week).</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 12,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning"
        ],
        "start": "2021-07-14T15:00:00.000Z",
        "remote": true
    },
    {
        "position": "Accounting Information System Specialist intern",
        "company": "youbloom",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:51:46.098Z",
        "url": "https://www.internships.com/posting/ccm_f4876606-ec8b-4677-99c8-85ec528b4cc0",
        "lastScraped": "2021-07-08T09:51:46.098Z",
        "description": "<p>Vision: youbloom’s vision is to make live music performance easier and better for all.</p><p>&nbsp;</p><p>Mission: youbloom’s mission is to expand the deliver of amazing live music experiences by increasing the connectedness of fans, artists, promoters and venues.</p><p><br></p><p><span>We're currently seeking an Accounting major with minor or emphasis in Management Information Systems or Computer Science to become part of our team.</span></p><p><br></p><p><span>What you'll do</span></p><p><br></p><p><span>Demonstrate a clear pride of ownership for the team-owned applications.</span></p><p><span>Assist with the maintenance, administration and support of Finance Systems, and ancillary systems, in alignment w/ Finance programs, goals and initiatives.</span></p><p><span>Assist with developing, defining, and documenting business requirements that describe the business need and solution scope, and communicate them effectively to IT, HR, and business stakeholders within Treasury, Internal Audit, Tax, etc.&nbsp;</span></p><p><span>Assist with the system configurations and maintenance, development and maintenance of a reporting repository and support reporting and analytics requests.</span></p><p><span>Contribute to the maintenance and accuracy of systems data, in the form of data loads and audits.</span></p><p><br></p><p><br></p><p><span>Required skills:</span></p><p><br></p><p><span>Bachelor's degree in MIS or Computer Science, Finance or Business Administration or an equivalent combination of education.</span></p><p><span>Strong analytical skills, excellent communication skills (written and oral).ra</span></p><p><span>A working knowledge of one of more of the following applications desirable: DB2, Cognos Analytics, SPSS, JIRA, Slack, Splunk, advanced Excel, Robotic Process Automation, and other new technology data analytics tools.</span></p><p><br></p><p><br></p><p>Job Type: Internship</p><p>The intern term is 3 to 6 months. This is a non-paid internship, with flexible hours (minimum of 16 hours per week) to reflect your necessary college credit requirements. If the intern could hold the position very well, we may be able to offer a more full or part-time position with compensation.</p>",
        "index": 13,
        "skills": [
            "information technology",
            "robotics",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Business Development/Marketing Internship",
        "company": "NED Biosystems",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:51:54.898Z",
        "url": "https://www.internships.com/posting/6ea3d830-90c0-43f2-83bf-591d42bcef35",
        "lastScraped": "2021-07-08T09:51:54.898Z",
        "description": "<p><strong>Overview:</strong></p><p><span>Are you looking for a mission-driven, disruptive start-up that will inspire you and support your career exploration of the life sciences industry? Do you want to work directly with a bold Founder/CEO and experience how a clinical stage biotech start-up is changing the global fight against cancer and COVID? </span></p><p>NED Biosystems, Inc., a Delaware Public Benefit Corporation, was founded to bring a safe, non-toxic, efficacious, low-cost treatment to cancer patients globally, including those in economically challenged regions. NED’s main office is based in Cambridge, MA but we are offering a fully remote summer internship program with potential to extend year-round.&nbsp;</p><p><strong>About the Role:</strong></p><p><span>NED Biosystems is offering a Business Development/Marketing internship for the Summer of 2021 (with potential to extend year-round) In this role the candidate with work directly with the Founder/CEO and will support various business development/fund raising related activities including lead generation activities, CRM, networking, investor database management, competitive intelligence, branding, marketing, and creation of investor decks. The role will have high exposure to the both the science and business aspects of a clinical stage biotech company. </span>Candidates must have a genuine interest in learning the science that inspires our cancer research. </p><p><strong>Desired Experience:</strong></p><ul><li>Google Docs</li><li>Google Workspace</li><li>HubSpot – helpful but will train.</li><li>LinkedIn - Proficient</li><li>MS Word - Proficient</li><li>MS Excel - Proficient</li><li>MS PowerPoint - Proficient</li><li>Must be deadline driven and have a high level of organizational and planning skills.</li><li>The ideal candidate exhibits ability to operate in a fast-paced, unstructured environment. With proactive oral and written communication skills, he or she also possesses the ability to work well in teams, can take on tasks with minimal supervision, and present ideas clearly and concisely.</li></ul><p><br></p>",
        "index": 14,
        "skills": [
            "networks",
            "machine learning",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Business Development/Marketing Internship",
        "company": "NED Biosystems",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:52:03.795Z",
        "url": "https://www.internships.com/posting/6ea3d830-90c0-43f2-83bf-591d42bcef35",
        "lastScraped": "2021-07-08T09:52:03.795Z",
        "description": "<p><strong>Overview:</strong></p><p><span>Are you looking for a mission-driven, disruptive start-up that will inspire you and support your career exploration of the life sciences industry? Do you want to work directly with a bold Founder/CEO and experience how a clinical stage biotech start-up is changing the global fight against cancer and COVID? </span></p><p>NED Biosystems, Inc., a Delaware Public Benefit Corporation, was founded to bring a safe, non-toxic, efficacious, low-cost treatment to cancer patients globally, including those in economically challenged regions. NED’s main office is based in Cambridge, MA but we are offering a fully remote summer internship program with potential to extend year-round.&nbsp;</p><p><strong>About the Role:</strong></p><p><span>NED Biosystems is offering a Business Development/Marketing internship for the Summer of 2021 (with potential to extend year-round) In this role the candidate with work directly with the Founder/CEO and will support various business development/fund raising related activities including lead generation activities, CRM, networking, investor database management, competitive intelligence, branding, marketing, and creation of investor decks. The role will have high exposure to the both the science and business aspects of a clinical stage biotech company. </span>Candidates must have a genuine interest in learning the science that inspires our cancer research. </p><p><strong>Desired Experience:</strong></p><ul><li>Google Docs</li><li>Google Workspace</li><li>HubSpot – helpful but will train.</li><li>LinkedIn - Proficient</li><li>MS Word - Proficient</li><li>MS Excel - Proficient</li><li>MS PowerPoint - Proficient</li><li>Must be deadline driven and have a high level of organizational and planning skills.</li><li>The ideal candidate exhibits ability to operate in a fast-paced, unstructured environment. With proactive oral and written communication skills, he or she also possesses the ability to work well in teams, can take on tasks with minimal supervision, and present ideas clearly and concisely.</li></ul><p><br></p>",
        "index": 15,
        "skills": [
            "networks",
            "machine learning",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "EPA Cyanobacteria and Microplastics Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-08T09:52:16.033Z",
        "url": "https://www.internships.com/posting/97198216-1270-440c-97ef-884f6a2670b9",
        "lastScraped": "2021-07-08T09:52:16.033Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA is concerned about the contamination from plastics in the water supply and the growth of cyanobacteria in lakes/streams that can produce harmful cyanotoxins to man and animals. The research will involve two projects:1) cyanobacteria and 2) microplastics. The aim of the microplastic project will be to detect small microplastics particles in solutions from environment samples using a brand new Cytek Spectral flow cytometer and different types optical imaging equipment. The uptake of micro and nano plastic particles will be studied using different sizes of sub-micron&nbsp;polystyrene beads in mammalian cells. Possible health effects of these microparticles will be studied on cells.&nbsp;The cyanobacteria projects will involve 1) the study of effects that chemicals (KMnO4, H2O2 and CuSO4)&nbsp;used in water treatment has on cyanobacteria, and 2) the study the effects of cyanobacteria toxins on plants using the Cytek spectral flow cytometer, a Nikon Ti2 research fluorescence microscope and hyperspectral imaging equipment.&nbsp;</p><p><br></p><p>The research participant will have the opportunity to prepare samples for use in the laboratory scientific experiments. The research participant will be able to gain experience using and operating the following state of the art scientific equipment:&nbsp;1) Nikon Ti2 research fluorescence microscope 2) Leica fluorescence stereo microscope, 3)&nbsp;Cytek Aurora spectra flow cytometer 4) PARISS hyperspectral equipment&nbsp;5) PARISS Macro hyperspectral optical equipment 6) Nexcelom cell counter and 7) general laboratory equipment.&nbsp;The research participant will have the opportunity to be involved in the operation of this equipment the lab that will be used to generate data for the cyanobacteria and microplastic projects. They will gain experience assisting in the evaluation of the data using scientific computer software programs.&nbsp;The research participant will have the opportunity to learn how to carry out general laboratory procedures that constitute a functional biological laboratory. In addition, with guidance from the mentor, the research participant will gain experience growing cyanobacteria cultures, mammalian tissue culture cells and water plant cultures.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The knowledge gained in the operation of this microscopic and flow cytometry scientific equipment will be an be invaluable for the research participant's educational development and their future laboratory research. The research participant will learn how to use state-of-the-art equipment in these research projects. They will have the opportunity to be engaged in educationally based research and learning activities that can benefit their scientific development.&nbsp;The knowledge gained can be helpful for future employment in different scientific research fields and could be useful if they decide on pursuing higher education. The mastering of the techniques used in the laboratory will provide the research participant an excellent skill set for future higher education studies or employment in scientific industries. If the research participant masters the operation of these laboratory equipment, the skills learned will be extremely useful for graduate research or employment in scientific research laboratories.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Robert Zucker (Zucker.robert@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;August&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment&nbsp;can be&nbsp;part-time or full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 16,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "EPA Advanced Air Quality Model System (AAQMS) Research Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-08T09:52:24.738Z",
        "url": "https://www.internships.com/posting/f69212af-e344-4dba-b3e7-aa82e3ee722b",
        "lastScraped": "2021-07-08T09:52:24.738Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u></strong>: The USEPA has embarked on the Advanced Air Quality Model System (AAQMS) project to enable modeling of air quality from global to regional to local scales. The system will have three configurations: 1. Global meteorology with seamless mesh refinement and online (coupled) atmospheric chemistry; 2. Regional (limited area) online meteorology and chemistry; and 3. Offline (sequential) regional meteorology and chemistry.&nbsp;A team of scientists in AESMD is developing a global online configuration which includes the Model for Prediction Across Scales – Atmosphere (MPAS-A), developed at the National Center for Atmospheric Research (NCAR), coupled with the latest version of the Community Multiscale Air Quality (CMAQv5.3) model developed at the U.S. EPA. .&nbsp;This multiyear development and evaluation effort offers many opportunities to learn new skills and gain valuable research experience collaborating with a team of experienced atmospheric modeling scientists.</p><p><br></p><p>The main focus of this research project will be a continuation of the Advanced Air Quality Model System (AAQMS) development which enables modeling of air quality from global to regional to local scales.</p><p><br></p><p>Research activities may include:</p><ul><li>adding new features in the modelling system</li><li>thorough model evaluation</li><li>studying and implementing aerosol radiative effect with respect to long wave radiation</li><li>applying the model in real case study</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will have the opportunity to learn about aerosol radiative effect, model coupling mechanics, systemic model evaluation as well as air quality impact in a local, regional, and/or global scale. The research participant will gain experience with coding, AMET and Python tools, and will have a great opportunity to collaborate and interact with other scientists in the group.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is David Wong (wong.david-c@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;September 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 17,
        "skills": [
            "project management",
            "python",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "start": "2021-08-31T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "USDA-ARS Research Opportunity in Geospatial Analyses of Agroecosystem Dynamics",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:52:33.503Z",
        "url": "https://www.internships.com/posting/50ce241e-77c3-4139-8d3b-ecc0708feae0",
        "lastScraped": "2021-07-08T09:52:33.503Z",
        "description": "<p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple&nbsp;master's level research opportunities&nbsp;are currently&nbsp;available with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS) located at multiple ARS units across the country.</p><p><br></p><p>This research opportunity is part of the SCINet Fellowship program at ARS. All fellows will spend time at headquarters for some of their training, but will be based&nbsp;in&nbsp;another ARS research unit&nbsp;for more specific training.&nbsp;The SCINet/Big Data Program at ARS offers research opportunities to motivated participants interested in&nbsp;solving agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales, as well as metadata enhancement for data discovery. One of the goals of the SCINet Initiative is to develop and apply new technologies, including artificial intelligence (AI) and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, linkage, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of these opportunities is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each&nbsp;participant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with geospatial software for analysis (e.g., ArcGIS) provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The successful candidate will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The successful candidate will also learn AI technologies relevant to these problems. The successful candidate will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses across multiple spatial and temporal scales.</p>",
        "index": 18,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "software engineering",
            "artificial intelligence"
        ],
        "remote": true
    },
    {
        "position": "Data Science Intern",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-06-08T09:52:51.559Z",
        "url": "https://www.internships.com/posting/sam_G-EQypc2JKpn3D8OhQ80d8Q553t4BWRsonSciDGdPsqJdDNPkjFf5g",
        "lastScraped": "2021-07-08T09:52:51.559Z",
        "description": "Have you ever wanted to intern inside the cloud?\n<br><br>\nBased in New York, DigitalOcean is a dynamic, high-growth technology company that serves a robust and passionate community of developers, teams, and businesses around the world. We believe that today's entrepreneurs are changing the world through software. Our mission is to empower these entrepreneurs by bringing modern app development within reach for any developer, anywhere in the world.\n<br><br>\nWe want interns who are passionate about creating tools that our customers and peers will love.\n<br><br>\nOur Data &amp; Analytics team is looking for an intern who is excited about data science, analysis, and model building to help build out our growing suite of tooling and dashboards. The ideal candidate has experience with visualization tools, python, and SQL. Data cleansing experience is a plus!\n<br><br>\nThis is a summer 2021 internship.\n<br><br>\nWhat You'll Be Doing:<br>\nAs an intern on the Data &amp; Analytics team, you'll work closely with the knowledgeable and supportive engineers on the team building models and data tools that the business depends on. You'll fully participate in the entire development cycle during each of our 2-week sprints as a member of the team.\n<br><br>\nWhat We'll Expect From You:<br>\nPursuing a Bachelor's degree in Data Science, Operations Research, Computer Science, Math, Statistics, Economics, or other quantitative field\n<br>Demonstrable critical thinking and analytical skills, including the ability and confidence to make conclusions and recommendations from data\n<br>Experience building data visualizations, dashboards and reports\n<br>Experience querying data (SQL), and ad hoc analysis (Excel)\n<br>Experience with data modeling in Looker or other BI tool (e.g. Tableau)\n<br>Bonus: Prior experience with statistical modeling tools such as Python, R, SAS, etc.\n<br><br>\nWhy You'll Like Working for DigitalOcean:<br>\nWe have amazing people. We can promise you will work with some of the smartest and most interesting people in the industry. We work hard but we always have fun doing it. We care deeply about each other and take our \"no jerks\" rule very seriously\n<br>We value development. We are a high-performance organization that is always challenging ourselves to continuously grow. That means we maintain a growth mindset in everything we do and invest deeply in employee development. You'll need to be great to be an intern here, and we promise you'll get even better.\n<br>We value diversity and inclusivity. We are an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\nPlease note, our intern program will be held remotely this summer.",
        "index": 19,
        "skills": [
            "data science",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Intern- Software Engineer (Services)",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-06-08T09:53:10.693Z",
        "url": "https://www.internships.com/posting/sam_3804140255",
        "lastScraped": "2021-07-08T09:53:10.693Z",
        "description": "<p></p><div><p>Role: Intern- Software Engineer</p><p>Reports to: Sr. Manager, Technical Consulting</p><p>Department: Technical Services</p><p>Location: Remote</p><p>Job Type: Internship</p><br><p></p><p>Anaconda 4All Internship Program</p><p>Our internship program, Anaconda 4All, brings diverse university students into Anaconda for both technical and non-technical opportunities for work experience. The program provides paid 10-week summer internships to qualified students who come from underrepresented groups, and concludes with a presentation to our executive team. In addition to valuable work experience, Anaconda 4All interns receive coaching on job search tactics, interview practice opportunities, and resume building.</p><br><p></p><p>Help us Deliver Technology for Human Sensemaking</p><p>Anaconda is the world's most popular data science platform. With more than 21 million users, the open source Anaconda Distribution is the easiest way to do data science and machine learning. We pioneered the use of Python for data science, champion its vibrant community, and continue to steward open-source projects that make tomorrow's innovations possible. Our enterprise-grade solutions enable corporate, research, and academic institutions around the world to harness the power of open source for competitive advantage and groundbreaking research.</p><p>Anaconda is seeking people who want to play a role in shaping the future of enterprise machine learning, and data science. Candidates should be knowledgeable and capable, but always eager to learn more and to teach others. Overall, we strive to create a culture of ability and humility and an environment that is both relaxed and focused. We stress empathy and collaboration with our customers, open-source users, and each other.</p><br><p></p><p>Summary</p><p>Anaconda is seeking a talented Engineering Intern to join our rapidly-growing company. This is an excellent opportunity for you to leverage your experience and skills and apply it to the world of data science and machine learning.</p><p>What You'll Do:</p><ul><li>Works closely with other Senior engineers on the team</li><li>Works on open source projects and applying it to customer problems</li><li>Contributes to open source libraries</li><li>Troubleshoots issues involving system configuration, behavior, and performance</li><li>Runs tests to ensure proper functioning of system in various environments</li><li>Designs and develop tools for automation and process improvement</li><li>Other related duties</li></ul><p>What You Need:</p><ul><li>Quantitative/ Scientific major in Junior year or later</li><li>Comfortable in python</li><li>Interested in data science or artificial intelligence</li><li>Interested in HoloViz packages</li><li>Team attitude: \"I am not done, until WE are done\"</li><li>Embody our core values:<ul><li>Ability &amp; Humility</li><li>Innovation &amp; Action</li><li>Empathy &amp; Connection</li></ul></li></ul><p>Why You'll Like Working Here:</p><ul><li>Unique opportunity to translate strong open source adoption and user enthusiasm into commercial product growth</li><li>Dynamic company that rewards high performers</li><li>On the cutting edge of enterprise application of data science, machine learning and AI</li><li>Collaborative team environment that values multiple perspectives and clear thinking</li><li>Employees-first culture</li><li>Flexible working hours</li></ul><p>An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</p></div><p></p>",
        "index": 20,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "python",
            "information technology",
            "artificial intelligence"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern- Software Engineer (Services)",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-06-08T09:53:29.314Z",
        "url": "https://www.internships.com/posting/sam_3804140255",
        "lastScraped": "2021-07-08T09:53:29.314Z",
        "description": "<p></p><div><p>Role: Intern- Software Engineer</p><p>Reports to: Sr. Manager, Technical Consulting</p><p>Department: Technical Services</p><p>Location: Remote</p><p>Job Type: Internship</p><br><p></p><p>Anaconda 4All Internship Program</p><p>Our internship program, Anaconda 4All, brings diverse university students into Anaconda for both technical and non-technical opportunities for work experience. The program provides paid 10-week summer internships to qualified students who come from underrepresented groups, and concludes with a presentation to our executive team. In addition to valuable work experience, Anaconda 4All interns receive coaching on job search tactics, interview practice opportunities, and resume building.</p><br><p></p><p>Help us Deliver Technology for Human Sensemaking</p><p>Anaconda is the world's most popular data science platform. With more than 21 million users, the open source Anaconda Distribution is the easiest way to do data science and machine learning. We pioneered the use of Python for data science, champion its vibrant community, and continue to steward open-source projects that make tomorrow's innovations possible. Our enterprise-grade solutions enable corporate, research, and academic institutions around the world to harness the power of open source for competitive advantage and groundbreaking research.</p><p>Anaconda is seeking people who want to play a role in shaping the future of enterprise machine learning, and data science. Candidates should be knowledgeable and capable, but always eager to learn more and to teach others. Overall, we strive to create a culture of ability and humility and an environment that is both relaxed and focused. We stress empathy and collaboration with our customers, open-source users, and each other.</p><br><p></p><p>Summary</p><p>Anaconda is seeking a talented Engineering Intern to join our rapidly-growing company. This is an excellent opportunity for you to leverage your experience and skills and apply it to the world of data science and machine learning.</p><p>What You'll Do:</p><ul><li>Works closely with other Senior engineers on the team</li><li>Works on open source projects and applying it to customer problems</li><li>Contributes to open source libraries</li><li>Troubleshoots issues involving system configuration, behavior, and performance</li><li>Runs tests to ensure proper functioning of system in various environments</li><li>Designs and develop tools for automation and process improvement</li><li>Other related duties</li></ul><p>What You Need:</p><ul><li>Quantitative/ Scientific major in Junior year or later</li><li>Comfortable in python</li><li>Interested in data science or artificial intelligence</li><li>Interested in HoloViz packages</li><li>Team attitude: \"I am not done, until WE are done\"</li><li>Embody our core values:<ul><li>Ability &amp; Humility</li><li>Innovation &amp; Action</li><li>Empathy &amp; Connection</li></ul></li></ul><p>Why You'll Like Working Here:</p><ul><li>Unique opportunity to translate strong open source adoption and user enthusiasm into commercial product growth</li><li>Dynamic company that rewards high performers</li><li>On the cutting edge of enterprise application of data science, machine learning and AI</li><li>Collaborative team environment that values multiple perspectives and clear thinking</li><li>Employees-first culture</li><li>Flexible working hours</li></ul><p>An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</p></div><p></p>",
        "index": 21,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "python",
            "information technology",
            "artificial intelligence"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Bookkeeper-Intern 2021",
        "company": "EAGLE EYE HOME AND PROPERTY INSPECTIONS LLC",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:53:55.627Z",
        "url": "https://www.internships.com/posting/bfba583d-5928-4fb3-bdd0-d1a81ebe456a",
        "lastScraped": "2021-07-08T09:53:55.627Z",
        "description": "<p>We're currently seeking a Bookkeeper to join our team as an intern and work their way up! You will be responsible for preparing and examining financial records for our company. This internship will be paid. The intern may be responsible for special projects, database maintenance, conducting research, answering phones, writing reports, proofreading, and general administrative functions such as scanning, filing, and copying. All applicants must be available to start as soon as possible.</p><p><br></p><p>*Please do not come to our office location to drop off resumes. We will contact you for the next steps once your resume is reviewed by our team if you are deemed qualified.</p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><p>Obtain primary financial data for accounting records.</p><p><br></p><p>Compute and record numerical data.</p><p><br></p><p>Check the accuracy of business transactions.</p><p><br></p><p>Perform data entry and administrative duties.</p><p><br></p><p>Account Reconciles.</p><p><br></p><p><br></p>",
        "index": 22,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Freelance Writer/Contributor",
        "company": "BLKPRENEURSHIP",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:54:06.606Z",
        "url": "https://www.internships.com/posting/ccm_1c0ea98c-92fa-459a-b4ad-c7326094e5ee",
        "lastScraped": "2021-07-08T09:54:06.606Z",
        "description": "<p>BLKPRENEURSHIP is seeking Freelance Writer Interns who are interested in writing website and magazine content for the 2021 summer semester. The BLKPRENEURSHIP Website and Magazine is dedicated to uplifting, inspiring, and supporting Black Entrepreneurs around the globe. The qualified candidate must exhibit excellent coordination, organization, and communication skills, and must be capable of working with Content editors to finalize specific stories, angles, and sources. The qualified candidate must also be willing to work with a diversified team of individuals from various backgrounds in order to accomplish the mission and vision of BLKPRENEURSHIP.</p><p><br></p><p><strong>JOB DESCRIPTION&nbsp;&nbsp;&nbsp;</strong></p><p><br></p><p>This is a Freelance Writer Intern position for Journalism/English major (or other relevant fields of study) students responsible for gathering information, investigating and reporting on current events, and writing news pieces while presenting news in an honest and balanced manner. The ideal candidate must be capable of meeting regular and recurring deadlines, access leads and pitch captivating story ideas to editors, and keep up-to-date on the latest news developments by attending events, studying different papers, opinion pieces, and social media.&nbsp;</p><p><br></p><p><strong>RESPONSIBILITIES&nbsp;</strong></p><p><br></p><ul><li>Conduct research to uncover interesting and significant news</li><li>Gather corroborate and interpret data</li><li>Interview key persons (Sources, etc.) to obtain more information&nbsp;</li><li>Use findings to construct a well-written article</li><li>Obtain first-hand information being present in happenings</li><li>Receive assignments or investigate news leads/tips</li><li>Comply with the moral code of the profession</li><li>Maintain notes and audio recordings</li><li>Partner with other journalists, editors, producers etc.</li><li>Establish contacts and sources for use in future research</li></ul><p><br></p><p>&nbsp;</p><p><strong>DESIRED SKILLS AND EXPERIENCE</strong></p><p><br></p><p>The ideal candidate for this position must be accountable, team driven, career-minded, and must display a passion for writing while working in often stressful environments. To excel in this role you should be friendly and extremely self-motivated to succeed.&nbsp;&nbsp;The individual selected must be working towards his/her undergraduate study in the field of English, journalism, or relevant field.&nbsp;</p><p><br></p><ul><li>Ability to follow strict deadlines and fast check information&nbsp;</li><li>Excellent communication and networking skills along with an aptitude in extracting information&nbsp;</li><li>Computer proficiency (MS Office, digital editing, web search, databases)</li><li>Must display an organizational capability</li><li>Resilient and Adaptable</li><li>Unbridled Creativity</li><li>Integrity and morality</li><li>Current knowledge of headlines</li></ul><p><br></p><p><br></p><p><strong>WE OFFER</strong></p><p><br></p><ul><li>Rewarding career</li><li>Fun working environment</li><li>Opportunity to meet new people everyday</li><li>Flexible work schedule</li><li>Paid Internship</li></ul><p><br></p><p><br></p><p>A new opportunity awaits when you make the decision to join the team at BLKPRENEURSHIP. BLKPRENEURSHIP is a division of dailyNOLA.com Inc. and an Equal Opportunity Employer (E.O.E.)&nbsp;&nbsp;</p>",
        "index": 23,
        "skills": [
            "networks",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Finance Intern",
        "company": "The Bail Project",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:54:17.602Z",
        "url": "https://www.internships.com/posting/53504b84-e703-4852-9f95-22b82fe5568a",
        "lastScraped": "2021-07-08T09:54:17.602Z",
        "description": "<p><strong><u>Organization:</u></strong>&nbsp;</p><p>The Bail Project is a national nonprofit designed to combat mass incarceration by disrupting the money bail system one person at a time. The Bail Project’s National Revolving Bail Fund provides free bail assistance to low-income individuals who are legally presumed innocent, and whom a judge has deemed eligible for release before trial contingent on paying bail. We enable our clients to return home to their families and communities while awaiting their court dates, connect them with community organizations that can assist them in accessing resources, and provide reminders and assistance to ensure that clients return to court for their court dates.&nbsp;</p><p><br></p><p><strong><u>The Intern Program:</u></strong></p><p>The Intern Program invites members of the community, 18 or older, to intern with The Bail Project. All individuals who intern with TBP will be members of a cohort. All interns will be expected to participate in educational opportunities, community-building events, and other cohort activities. Interns will be expected to work 10-15 hours a week based on their availability. All interns will begin work on August 30, 2021. This is a hard start date and we encourage all candidates to consider this requirement carefully.</p><p><br></p><p><strong><u>Position Summary:</u></strong></p><p>The Finance Intern would primarily assist the Finance team and other members of the organization with recovering refunds that have yet to be returned to the organization.</p><p><br></p><p><strong><u>Hours:</u></strong>&nbsp;10-15 hours per week, flexible schedule</p><p><strong><u>Term:&nbsp;</u></strong>August 2021 - November 2021</p><p><strong><u>Start Date:</u></strong>&nbsp;8/30/21</p><p><strong><u>End Date:</u></strong>&nbsp;11/30/21</p><p><strong><u>Reports to:&nbsp;</u></strong>Volunteer and Intern Coordinator</p><p><strong><u>Compensation:&nbsp;</u></strong>$15 an hour.</p><p><br></p><p><strong><u>Responsibilities:</u></strong></p><ul><li>Obtain bail refunds by:</li><li class=\"ql-indent-1\">Working with Finance team, local site leaders, and others, as applicable, to determine list of cases where review would be helpful</li><li class=\"ql-indent-1\">Determining the status of these cases and try to obtain refunds by reviewing court documentation, reaching out to the clerk's office, etc.</li><li class=\"ql-indent-1\">Documenting learnings related to the process for obtaining refunds, potential policy changes which could expedite refunds, etc.</li><li>Assist in reconciling transactions across bank accounts, Salesforce, and bail receipts</li><li>Participate in cohort events geared towards education around social justice, policy, nonprofit management, connection, and professional development.</li><li>Engage in weekly or bi-weekly check-ins with supervisor to evaluate progress, identify next steps, etc.</li><li>Other duties as assigned</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p>You are driven, highly organized, and have a deep commitment to The Bail Project’s mission to eliminate race- and wealth-based disparities in our criminal justice system. We’re looking for someone who&nbsp;is comfortable working independently or in a team-based setting, and with a strong commitment to our clients.</p><p><br></p><p><strong><u>To excel in this role, you likely bring the following:</u></strong></p><ul><li>Passion for understanding and changing the system of mass incarceration and criminal justice</li><li>Familiarity or personal experience with the criminal justice system a plus</li><li>Basic computer skills and familiarity with spreadsheet software (Google Sheets or Microsoft Excel preferred)</li><li>Must be well-organized and professional</li><li>Professional email and telephone etiquette</li></ul><p><br></p><p><strong><u>How to Apply:&nbsp;</u></strong></p><p>Interested applicants should submit a resume and cover letter. In the cover letter, please address the following:</p><ul><li>Why do you want to intern with The Bail Project?</li><li>Please share 1-2 experiences that highlight why you would be a strong candidate for this internship and how you meet the qualifications for the position.</li></ul><p>No emails, faxes, or phone calls, please. Applicants will be notified regarding whether or not they have been selected for an interview.&nbsp;<strong>Applications without cover letters will not be processed.</strong></p><p><br></p><p><strong>Candidates will only be considered if they live in a state where The Bail Project has an active site. Applications from candidates in states where TBP does not have a site will not be considered. Please visit our website to see the states where TBP operates.</strong></p><p><br></p><p><em>The Bail Project is proud to be an equal opportunity/affirmative action employer and actively seeks the candidacy of people of color, women, LGBTQIA people, and formerly incarcerated individuals. We are committed to inclusive hiring and dedicated to diversity in our work and staff.</em></p><p><br></p><p>Note: This position should ideally be filled by an undergraduate or graduate student, someone directly or indirectly impacted by the bail system, or an individual coming from an internship-providing institution.</p>",
        "index": 24,
        "skills": [
            "project management",
            "machine learning",
            "software engineering"
        ],
        "start": "2021-07-31T15:00:00.000Z",
        "remote": true
    },
    {
        "position": "Client Support Intern",
        "company": "The Bail Project",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:54:28.716Z",
        "url": "https://www.internships.com/posting/24b73810-2d73-4f68-9bbb-2e21717cca5a",
        "lastScraped": "2021-07-08T09:54:28.716Z",
        "description": "<p><strong><u>Organization:&nbsp;</u></strong></p><p>The Bail Project is a national nonprofit designed to combat mass incarceration by disrupting the money bail system one person at a time. The Bail Project’s National Revolving Bail Fund provides free bail assistance to low-income individuals who are legally presumed innocent, and whom a judge has deemed eligible for release before trial contingent on paying bail. We enable our clients to return home to their families and communities while awaiting their court dates, connect them with community organizations that can assist them in accessing resources, and provide reminders and assistance to ensure that clients return to court for their court dates.&nbsp;</p><p><br></p><p><strong><u>The Intern Program:</u></strong></p><p>The Intern Program invites members of the community, 18 or older, to intern with The Bail Project. All individuals who intern with TBP will be members of a cohort. All interns will be expected to participate in educational opportunities, community-building events, and other cohort activities. Interns will be expected to work 10-15 hours a week based on their availability. All interns will begin work on August 30, 2021. This is a hard start date and we encourage all candidates to consider this requirement carefully.</p><p><br></p><p><strong><u>Position Summary:</u></strong></p><p>TBP is seeking an individual with an interest in criminal legal system reform and improving outcomes for incarcerated and returning community members to assist with several data and research projects to improve TBP’s knowledge of system operations and community resources. This individual will also provide data input support by utilizing Salesforce.</p><p><br></p><p><strong><u>Hours:</u></strong>&nbsp;10-15 hours per week, flexible schedule</p><p><strong><u>Term:</u></strong>&nbsp;August 2021 - November 2021</p><p><strong><u>Start Date:</u></strong>&nbsp;8/30/21</p><p><strong><u>End Date:</u></strong>&nbsp;11/30/21</p><p><strong><u>Reports to:</u></strong>&nbsp;Volunteer and Intern Coordinator</p><p><strong><u>Compensation:</u></strong>&nbsp;$15 an hour.</p><p><br></p><p><strong><u>Responsibilities:</u></strong></p><ul><li>Assist the Client Services team with expanding the community release with support model nationwide.</li><li>Work with fellow interns to develop an asset mapping project.</li><li>Connect with service providers to confirm suitability for TBP referrals and document social service providers in Salesforce.</li><li>Conduct internet research on organizations and add to the asset map document.&nbsp;</li><li>Assist with creating process templates and various training materials for sites.</li><li>Participate in cohort events geared towards education around social justice, policy, nonprofit management, connection, and professional development.</li><li>Engage in weekly or bi-weekly check-ins with supervisor to evaluate progress, identify next steps, etc.</li><li>Other duties as assigned.</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p>You are driven, highly organized, and have a deep commitment to The Bail Project’s mission to eliminate race- and wealth-based disparities in our criminal justice system. We’re looking for someone who&nbsp;is comfortable working independently or in a team-based setting, and with a strong commitment to our clients.&nbsp;</p><p><br></p><p><strong><u>To excel in this role, you likely bring the following:</u></strong></p><ul><li>Passion for understanding and changing the system of mass incarceration and criminal justice</li><li>Familiarity or personal experience with local criminal justice system a plus</li><li>A genuine interest in learning about people and environments</li><li>Ability to communicate respectfully with people from diverse backgrounds</li><li>Basic computer skills and familiarity with spreadsheet software (Google Sheets or Microsoft Excel preferred)&nbsp;</li><li>Must be well-organized and professional</li><li>Strong ability to work within a team</li><li>Familiarity with Salesforce a plus</li></ul><p><br></p><p><strong><u>How to Apply:&nbsp;</u></strong></p><p>Interested applicants should submit a resume and cover letter. In the cover letter, please address the following:</p><ul><li>Why do you want to intern with The Bail Project?</li><li>Please share 1-2 experiences that highlight why you would be a strong candidate for this internship and how you meet the qualifications for the position.</li></ul><p>No emails, faxes, or phone calls, please. Applicants will be notified regarding whether or not they have been selected for an interview.&nbsp;<strong>Applications without cover letters will not be processed.</strong></p><p><br></p><p><strong>Candidates will only be considered if they live in a state where The Bail Project has an active site. Applications from candidates in states where TBP does not have a site will not be considered. Please visit our website to see the states where TBP operates.</strong></p><p><br></p><p><em>The Bail Project is proud to be an equal opportunity/affirmative action employer and actively seeks the candidacy of people of color, women, LGBTQIA people, and formerly incarcerated individuals. We are committed to inclusive hiring and dedicated to diversity in our work and staff.</em></p><p><br></p><p>Note: This position should ideally be filled by an undergraduate or graduate student, someone directly or indirectly impacted by the bail system, or an individual coming from an internship-providing institution.</p>",
        "index": 25,
        "skills": [
            "project management",
            "machine learning",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Social Media Intern",
        "company": "California League of Conservation Voters",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-06-08T09:54:41.573Z",
        "url": "https://www.internships.com/posting/0bfdf550-1e86-4e9a-87e5-a7ec6b3218f6",
        "lastScraped": "2021-07-08T09:54:41.573Z",
        "description": "<strong>Social Media Intern</strong><strong>Job Description</strong><p><strong>THE ORGANIZATIONS:</strong></p><p>We believe this moment requires transformative change.&nbsp;</p><p>&nbsp;</p><p>The climate crisis is here. And Black, Indigenous and people of color have been bearing the burden of our pollution-based economy for generations. We have the solutions to stop climate change, but we lack the political will to do it at the rate and scale that’s needed. </p><p>&nbsp;</p><p>California League of Conservation Voters exists to build the political will and power to solve the climate crisis, use climate action to advance justice, and create a global roadmap. To protect our water, land, air, and our most vulnerable communities, we organize voters, elect and train candidates, and hold lawmakers accountable for bold policy change. </p><p>&nbsp;</p><p>Our vision is to build resilient, healthy, thriving communities, and create a democracy and economy that is just and sustainable for all.</p><p>&nbsp;</p><p>CLCV Education Fund, CLCV’s 501(c)3 sister organization, works through programs focused on voter engagement and mobilization, issue advocacy, legislative accountability, and research and opinion polling to provide the public, policymakers, and environmental advocates with the resources they need to make California’s air, water and natural resources cleaner and greener through the democratic process. For more information, please visit www.clcvedfund.org. </p><p>&nbsp;</p><p>The work of CLCV and CLCV Ed Fund to protect and advocate for the environment is rooted in our commitment to racial, social, and environmental justice. Engaging black, indigenous, and people of color, among other key constituencies for the environment is an organizational priority. Within the organization, we aim to create a workplace culture and policies and practices that demonstrate how we value equity and inclusion.</p><p>&nbsp;</p><p><strong>INTERNSHIP DESCRIPTION</strong></p><p>CLCV is seeking a motivated communications professional to assist with the design and execution of social media campaigns. The Intern will create weekly and monthly editorial calendars to promote CLCV priorities and news on various social media websites. Develop and distribute &nbsp;&nbsp;content such as blogs, infographics, videos and press releases on social media. Track social media engagement to identify high-performing ideas and campaigns for scalability.</p><p>Work with other fellows to develop creative content to uplift CLCV priorities.</p><p>&nbsp;</p><p>This internship role will report directly to the Digital Communications Manager. &nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong></p><p class=\"ql-align-justify\"><strong>DUTIES AND RESPONSIBILITIES</strong></p><ul><li>Assist with the design and execution of social media campaigns.&nbsp;</li><li>Create weekly and monthly editorial calendars to promote CLCV priorities and news on various social media websites.</li><li>Create and distribute content on social. Also share organization blogs, infographics, videos, and press announcements on social media.</li><li>Create and update landing pages on website </li><li>Track social media engagement to identify high-performing ideas and campaigns for scalability.</li><li>Track social media analytics for grant reporting.</li><li>Follow political trends and news to keep CLCV on top of current events.&nbsp;</li><li>Work with other Communications team members &nbsp;to develop creative content to uplift CLCV priorities.</li><li>BONUS: Experience developing TikTok videos</li><li>Performs other duties as assigned.</li></ul><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p><strong>REQUIREMENTS</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficient computer skills (Microsoft suite programs)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Familiarity in: Sprout Social (or Hootsuite or Buffer) and Canva</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experts with social media platforms: Facebook, Instagram, Twitter, LinkedIn, TikTok, Pinterest, YouTube, and Snapchat</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent writing skills and strong content development instincts</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to work collaboratively with a team.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Must have an interest in environmental work and specifically climate change work</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Committed to staying on top of social media trends and developments.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to work remotely.</p><p><strong>BENEFITS</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The growth, community management, and content of CLCV's social media channels are a high priority for the organization. This role will fill an important place within the team to ensure critical news and content about climate change and the political landscape of California is shared.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;This person will be responsible for high--visibility content and will be a good addition to the intern's resume.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Compensation $15/hour and paid sick leave.</p><p><strong>TO APPLY:</strong></p><p>Send a cover letter, resume, and tell us how you found this posting to CLCVJobs@ecovote.org. Please write “Social Media Intern” in the subject line. The position is open until 6/25/2021.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;No phone calls please.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p class=\"ql-align-justify\">The CLCV and CLCV Education Fund are committed to workplace diversity and inclusion. We are equal opportunity employers and do not discriminate in hiring or employment on the basis of race, color, religion, national origin, gender, marital status, sexual orientation, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. We offer competitive salaries, generous benefits, and a pleasant working environment. Salary is based on a nonprofit scale and commensurate with experience.</p><p><strong>&nbsp;</strong></p>",
        "index": 26,
        "skills": [
            "information technology",
            "c and c++",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-08T09:54:52.511Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-07-08T09:54:52.511Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>",
        "index": 27,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Finance Intern",
        "company": "The Bail Project",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:55:08.840Z",
        "url": "https://www.internships.com/posting/53504b84-e703-4852-9f95-22b82fe5568a",
        "lastScraped": "2021-07-08T09:55:08.840Z",
        "description": "<p><strong><u>Organization:</u></strong>&nbsp;</p><p>The Bail Project is a national nonprofit designed to combat mass incarceration by disrupting the money bail system one person at a time. The Bail Project’s National Revolving Bail Fund provides free bail assistance to low-income individuals who are legally presumed innocent, and whom a judge has deemed eligible for release before trial contingent on paying bail. We enable our clients to return home to their families and communities while awaiting their court dates, connect them with community organizations that can assist them in accessing resources, and provide reminders and assistance to ensure that clients return to court for their court dates.&nbsp;</p><p><br></p><p><strong><u>The Intern Program:</u></strong></p><p>The Intern Program invites members of the community, 18 or older, to intern with The Bail Project. All individuals who intern with TBP will be members of a cohort. All interns will be expected to participate in educational opportunities, community-building events, and other cohort activities. Interns will be expected to work 10-15 hours a week based on their availability. All interns will begin work on August 30, 2021. This is a hard start date and we encourage all candidates to consider this requirement carefully.</p><p><br></p><p><strong><u>Position Summary:</u></strong></p><p>The Finance Intern would primarily assist the Finance team and other members of the organization with recovering refunds that have yet to be returned to the organization.</p><p><br></p><p><strong><u>Hours:</u></strong>&nbsp;10-15 hours per week, flexible schedule</p><p><strong><u>Term:&nbsp;</u></strong>August 2021 - November 2021</p><p><strong><u>Start Date:</u></strong>&nbsp;8/30/21</p><p><strong><u>End Date:</u></strong>&nbsp;11/30/21</p><p><strong><u>Reports to:&nbsp;</u></strong>Volunteer and Intern Coordinator</p><p><strong><u>Compensation:&nbsp;</u></strong>$15 an hour.</p><p><br></p><p><strong><u>Responsibilities:</u></strong></p><ul><li>Obtain bail refunds by:</li><li class=\"ql-indent-1\">Working with Finance team, local site leaders, and others, as applicable, to determine list of cases where review would be helpful</li><li class=\"ql-indent-1\">Determining the status of these cases and try to obtain refunds by reviewing court documentation, reaching out to the clerk's office, etc.</li><li class=\"ql-indent-1\">Documenting learnings related to the process for obtaining refunds, potential policy changes which could expedite refunds, etc.</li><li>Assist in reconciling transactions across bank accounts, Salesforce, and bail receipts</li><li>Participate in cohort events geared towards education around social justice, policy, nonprofit management, connection, and professional development.</li><li>Engage in weekly or bi-weekly check-ins with supervisor to evaluate progress, identify next steps, etc.</li><li>Other duties as assigned</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p>You are driven, highly organized, and have a deep commitment to The Bail Project’s mission to eliminate race- and wealth-based disparities in our criminal justice system. We’re looking for someone who&nbsp;is comfortable working independently or in a team-based setting, and with a strong commitment to our clients.</p><p><br></p><p><strong><u>To excel in this role, you likely bring the following:</u></strong></p><ul><li>Passion for understanding and changing the system of mass incarceration and criminal justice</li><li>Familiarity or personal experience with the criminal justice system a plus</li><li>Basic computer skills and familiarity with spreadsheet software (Google Sheets or Microsoft Excel preferred)</li><li>Must be well-organized and professional</li><li>Professional email and telephone etiquette</li></ul><p><br></p><p><strong><u>How to Apply:&nbsp;</u></strong></p><p>Interested applicants should submit a resume and cover letter. In the cover letter, please address the following:</p><ul><li>Why do you want to intern with The Bail Project?</li><li>Please share 1-2 experiences that highlight why you would be a strong candidate for this internship and how you meet the qualifications for the position.</li></ul><p>No emails, faxes, or phone calls, please. Applicants will be notified regarding whether or not they have been selected for an interview.&nbsp;<strong>Applications without cover letters will not be processed.</strong></p><p><br></p><p><strong>Candidates will only be considered if they live in a state where The Bail Project has an active site. Applications from candidates in states where TBP does not have a site will not be considered. Please visit our website to see the states where TBP operates.</strong></p><p><br></p><p><em>The Bail Project is proud to be an equal opportunity/affirmative action employer and actively seeks the candidacy of people of color, women, LGBTQIA people, and formerly incarcerated individuals. We are committed to inclusive hiring and dedicated to diversity in our work and staff.</em></p><p><br></p><p>Note: This position should ideally be filled by an undergraduate or graduate student, someone directly or indirectly impacted by the bail system, or an individual coming from an internship-providing institution.</p>",
        "index": 28,
        "skills": [
            "project management",
            "machine learning",
            "software engineering"
        ],
        "start": "2021-07-31T15:00:00.000Z",
        "remote": true
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-06-08T09:55:29.325Z",
        "url": "https://www.internships.com/posting/bug_38999958445",
        "lastScraped": "2021-07-08T09:55:29.325Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time",
        "index": 29,
        "skills": [
            "project management",
            "networks",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Engineer Recruiter Interns (Immediate Start)",
        "company": "Minuteman Group",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-07-08T09:55:40.311Z",
        "url": "https://www.internships.com/posting/90c97ed4-3c94-4779-bcd3-4bc24b1b4f10",
        "lastScraped": "2021-07-08T09:55:40.311Z",
        "description": "<p>If you are a current engineering, software or data science intern, this is an interesting summer internship. We are seeking current students or 2021 graduates with technical degrees in engineering, or computer and data science, who are interested in working in the human resources function. This position will require you to review open positions, search for candidates, and screen resumes, talk to candidates, and discuss them with Senior Recruiters. </p><p><br></p><p>Our senior recruiters are primarily engineers who decided to take a different career path.  This position will give a sense of what recruiters are looking for, and teach you a lot about different roles in engineering.  We will train you on the job; we need to know you are passionate about this. </p><p><br></p><p><strong>Position Scope/Job Functions:</strong></p><p><strong> </strong>To provide highly skilled candidates for current job openings using expertise in engineering, IT and recruiting.</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Source candidates using various resources including job boards and internal database</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact active and passive candidates and build talent pipeline for hiring needs</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Send emails, texts and make phone calls to prospective candidates</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Screen candidates to determine fit with the active positions</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work with Senior Recruiters to submit suitable candidates to the client</p><p><br></p>",
        "index": 30,
        "skills": [
            "information technology",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Station Mobile Apparatus Technician Apprentice Or Journeyman",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-06-08T09:56:00.641Z",
        "url": "https://www.internships.com/posting/bug_39002223926",
        "lastScraped": "2021-07-08T09:56:00.641Z",
        "description": "Station Mobile Apparatus Technician Apprentice or Journeyman\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$32.69 - $47.42\n\nMinimum Age Requirement:\n\nJob Description:\n\nApprentice\n\nThe Station Mobile Apparatus Technician Apprentice assists Station Mobile Apparatus Technician to haul, operate, maintain, test, install, and repair Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nJourneyman\nThe Station Mobile Apparatus Technician hauls, operates, maintains, tests, installs, and repairs Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* OSHA regulations, chemical safety, and electrical safety related work practices\n* Rigging and fall protection\n* Bucket truck and man lift rescue\n* Utility system practices and field operation practices\n* Substation and power plant construction, safety procedures, and maintenance techniques\n* Safe operation of hand and power tools used in construction\n* Structural and mechanical drawings (i.e. elevations, plans, sections, details)\n* Heavy equipment operation (i.e. bucket truck, boom truck, backhoe, line bed, skid steer, and man lift)\n* Power transformers, load tap changers, potential and current transformers, power circuit breakers, metal-clad switchgear, circuit switchers, disconnect and air break switches, synchronous condensers, and series and shunt capacitors\n* Proper use of transit, surveying practices, and laying out station foundation baselines and elevations\n* Forming, pouring and finishing of concrete\n* Steel and aluminum welding\n* Cutting torch\n* Performance Management System, Corporate policies, Idaho Powers safety Program\n* PC use and basic software\n\nSkills in:\n\n* Strong interpersonal, verbal, and written communication\n* Problem identification\n* Problem solving\n* Troubleshooting\n* Operating test equipment\n* Basic use of personal computers using software applications such as word processing, spreadsheets, databases, and e-mail\n* Organization and time management\n\nAbility to:\n\n* Read and understand station drawings\n* Properly correct and document changes to station drawings\n* Establish and maintain effective working relationships\n* Work in a team environment, as well as independently and be self-motivated and flexible\n* Work with a high degree of accountability\n* Meet established project deadlines\n* Apply established guidelines and use good judgment and initiative in resolving work problems\n* Expected to work increasingly independently as evaluated by the Journeyman and/or Leader\n\nMINIMUM REQUIREMENTS\n\nApprentice\n\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Two years of work experience in an electrical, mechanical, maintenance, operation, or construction field\n\nJourneyman\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Five or more years work experience in an electrical, mechanical, maintenance, operation, or construction field, including at least two years of journey-level experience in substation maintenance or construction\n\nOR\n\n* Completion of a Department of Labor Office of Apprenticeship Substation program\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with an acceptable driving record based on driving requirements for the position\n* Valid DOT medical card or the ability to obtain one prior to hire\n* Valid Class A CDL or the ability to obtain one prior to hire - must obtain Double/Triple Trailers, Tank Vehicles, and Hazardous Materials CDL endorsements within 90 days\n* Certification in Telescopic Boom  Fixed Cab, Telescopic Boom  Swing Cab, Articulating Boom Crane/Load, and Overhead/Bridge Crane within 90 days\n* Must obtain First Aid/CPR card within 90 days\n\nPHYSICAL REQUIREMENTS\nThis position requires lifting up to 170 lbs., carrying up to 120 lbs., pushing up to 100 lbs., and pulling up to 180 lbs. in moving/assembling transformers. Crouching, bending/stooping, and crawling is required occasionally and sometimes in confined spaces.  Kneeling is required frequently.  Climbing of 24 foot ladders and onto transformers/equipment with fall restraint gear is performed occasionally as well as work from an elevated lift with sustained reaching.  Standing/walking is performed frequently, and sitting/driving is required up to 7 hours in duration to access job sites. Job placement is contingent upon successful completion of a pre-employment physical evaluation for the Department of Transportation (DOT) medical certificate. The above is a summary of the primary essential functions of the position. This job may require the performance of additional tasks assigned by company leaders or management. Questions regarding job requirements or accommodation requests should be directed to Human Resources.\n\nADDITIONAL REQUIREMENTS\nImmediately enroll in the Stations Technician Apprenticeship Program. Additional safety related training may be required.\n\nADDITIONAL INFORMATION\nThis position requires extensive travel across Idaho Powers service area.  The work schedule for this position may change week to week.  Typical work schedule includes four 10-hour days, and eight 10-hour days working back-to-back weeks.  Each workday may be an out-of-town, overnight stay.  This position requires the ability to work overtime and weekends when business need requires.\n\nMust abide by Idaho Power Company's safety rules and regulations. Complete required Company and safety training.\n\nCompetencies:\n\nAdaptability, Applied Learning, Communication, Decision Making, Safety Focus, Work Standards",
        "index": 31,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-06-08T09:56:21.203Z",
        "url": "https://www.internships.com/posting/bug_38999958445",
        "lastScraped": "2021-07-08T09:56:21.203Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time",
        "index": 32,
        "skills": [
            "project management",
            "networks",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Station Mobile Apparatus Technician Apprentice Or Journeyman",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-06-08T09:56:41.418Z",
        "url": "https://www.internships.com/posting/bug_39002223926",
        "lastScraped": "2021-07-08T09:56:41.418Z",
        "description": "Station Mobile Apparatus Technician Apprentice or Journeyman\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$32.69 - $47.42\n\nMinimum Age Requirement:\n\nJob Description:\n\nApprentice\n\nThe Station Mobile Apparatus Technician Apprentice assists Station Mobile Apparatus Technician to haul, operate, maintain, test, install, and repair Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nJourneyman\nThe Station Mobile Apparatus Technician hauls, operates, maintains, tests, installs, and repairs Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* OSHA regulations, chemical safety, and electrical safety related work practices\n* Rigging and fall protection\n* Bucket truck and man lift rescue\n* Utility system practices and field operation practices\n* Substation and power plant construction, safety procedures, and maintenance techniques\n* Safe operation of hand and power tools used in construction\n* Structural and mechanical drawings (i.e. elevations, plans, sections, details)\n* Heavy equipment operation (i.e. bucket truck, boom truck, backhoe, line bed, skid steer, and man lift)\n* Power transformers, load tap changers, potential and current transformers, power circuit breakers, metal-clad switchgear, circuit switchers, disconnect and air break switches, synchronous condensers, and series and shunt capacitors\n* Proper use of transit, surveying practices, and laying out station foundation baselines and elevations\n* Forming, pouring and finishing of concrete\n* Steel and aluminum welding\n* Cutting torch\n* Performance Management System, Corporate policies, Idaho Powers safety Program\n* PC use and basic software\n\nSkills in:\n\n* Strong interpersonal, verbal, and written communication\n* Problem identification\n* Problem solving\n* Troubleshooting\n* Operating test equipment\n* Basic use of personal computers using software applications such as word processing, spreadsheets, databases, and e-mail\n* Organization and time management\n\nAbility to:\n\n* Read and understand station drawings\n* Properly correct and document changes to station drawings\n* Establish and maintain effective working relationships\n* Work in a team environment, as well as independently and be self-motivated and flexible\n* Work with a high degree of accountability\n* Meet established project deadlines\n* Apply established guidelines and use good judgment and initiative in resolving work problems\n* Expected to work increasingly independently as evaluated by the Journeyman and/or Leader\n\nMINIMUM REQUIREMENTS\n\nApprentice\n\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Two years of work experience in an electrical, mechanical, maintenance, operation, or construction field\n\nJourneyman\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Five or more years work experience in an electrical, mechanical, maintenance, operation, or construction field, including at least two years of journey-level experience in substation maintenance or construction\n\nOR\n\n* Completion of a Department of Labor Office of Apprenticeship Substation program\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with an acceptable driving record based on driving requirements for the position\n* Valid DOT medical card or the ability to obtain one prior to hire\n* Valid Class A CDL or the ability to obtain one prior to hire - must obtain Double/Triple Trailers, Tank Vehicles, and Hazardous Materials CDL endorsements within 90 days\n* Certification in Telescopic Boom  Fixed Cab, Telescopic Boom  Swing Cab, Articulating Boom Crane/Load, and Overhead/Bridge Crane within 90 days\n* Must obtain First Aid/CPR card within 90 days\n\nPHYSICAL REQUIREMENTS\nThis position requires lifting up to 170 lbs., carrying up to 120 lbs., pushing up to 100 lbs., and pulling up to 180 lbs. in moving/assembling transformers. Crouching, bending/stooping, and crawling is required occasionally and sometimes in confined spaces.  Kneeling is required frequently.  Climbing of 24 foot ladders and onto transformers/equipment with fall restraint gear is performed occasionally as well as work from an elevated lift with sustained reaching.  Standing/walking is performed frequently, and sitting/driving is required up to 7 hours in duration to access job sites. Job placement is contingent upon successful completion of a pre-employment physical evaluation for the Department of Transportation (DOT) medical certificate. The above is a summary of the primary essential functions of the position. This job may require the performance of additional tasks assigned by company leaders or management. Questions regarding job requirements or accommodation requests should be directed to Human Resources.\n\nADDITIONAL REQUIREMENTS\nImmediately enroll in the Stations Technician Apprenticeship Program. Additional safety related training may be required.\n\nADDITIONAL INFORMATION\nThis position requires extensive travel across Idaho Powers service area.  The work schedule for this position may change week to week.  Typical work schedule includes four 10-hour days, and eight 10-hour days working back-to-back weeks.  Each workday may be an out-of-town, overnight stay.  This position requires the ability to work overtime and weekends when business need requires.\n\nMust abide by Idaho Power Company's safety rules and regulations. Complete required Company and safety training.\n\nCompetencies:\n\nAdaptability, Applied Learning, Communication, Decision Making, Safety Focus, Work Standards",
        "index": 33,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    }
]