[
    {
        "position": "Fellowship in Machine Learning and Computer Vision",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:05:21.434Z",
        "url": "https://www.internships.com/posting/1edd34b5-e40d-4254-9b91-f1b85438ee79",
        "lastScraped": "2021-06-07T00:05:21.434Z",
        "description": "<p>The Department of Defense (DoD) is offering a postdoctoral fellowship for their Visiting Scientist Program at the National Geospatial-Intelligence Agency (NGA), a world leader in timely, relevant, accurate and actionable GEOINT.</p><p><br></p><p><strong>What will I be doing?</strong></p><p><br></p><p>With the omnipresence of high quality images available via the internet and social media, high resolution photographs from US -denied corners of the world are available like never before.&nbsp;Oftentimes, these images contain objects of very high interest and intelligence value.&nbsp;But, unlike highly calibrated space-borne and aerial cameras whose image metadata contains sensor position, orientation, calibration characteristics, etc., photographs harvested from personal devices and the internet are absent such metadata – metadata required for accurate photogrammetric exploitation of objects displayed within the image scene.</p><p><br></p><p>Even though images harvested from non-metric (unknown) sources typically display very high resolution quality, the process of obtaining accurate dimensions of objects depicted in those images is oftentimes immensely difficult and frequently unfruitful.&nbsp;This is partly attributed to the absence of sensor/lens data, sensor orientation and geolocation, and image cropping (non-full frame images).&nbsp;Additional constraints are presented by the absence of multiple images containing the object(s) of interest, i.e. only a single image being available, and finding object(s) of known size within an image scene, i.e. identifying a known scalar.&nbsp;Lastly, close range images often display perspective foreshortening, and sometimes wide-angle lens distortion, adding additional challenges to photogrammetric exploitation of objects in a scene.</p><p><br></p><p>As the selected candidate, you will utilize advances in computer vision and machine learning combined with well-established photogrammetric techniques to derive a camera sensor model from a single or very small-batch of metadata-absent images acquired using consumer grade cameras/mobile devices.&nbsp;The research will involve developing an automated or semi-automated process utilizing learned/recognized common objects, shapes, geometries, and architectural standards present in most photographic scenes.&nbsp;The derived sensor model will enable accurate dimensional analysis of metadata-absent images.</p><p><br></p><p><strong>Where will I be located?</strong></p><p><br></p><p>You will conduct research remotely under the direction of a mentor who will be based in Springfield, Virginia.&nbsp;</p><p><br></p><p><strong>What is the anticipated start date?</strong></p><p><br></p><p>NGA is ready to make appointments immediately. Exact start dates&nbsp;will be determined at the time of selection and in coordination with the selected candidate. Applications are reviewed on an ongoing basis and fellowships will be filled as qualified candidates are identified.</p><p><br></p><p><strong>What is the appointment length?</strong></p><p><br></p><p>Appointments are initially for one year with the option to extend the appointment for up to four additional years, contingent upon project needs and funding availability.</p><p><br></p><p><strong>What are the benefits?</strong></p><p><br></p><p>As a participant with NGA, you will receive:</p><p><br></p><ul><li>Stipend, determined by NGA, based on your academic credentials and commensurate with GS Locality Pay Tables</li><li>Health Insurance Allowance</li><li>Relocation Allowance, if you are located more than 50 miles one way from the hosting facility</li><li>Travel Expense Allowance</li><li>Education and Research Support Allowance</li></ul><p><br></p><p><strong>About NGA</strong></p><p><br></p><p>The National Geospatial-Intelligence Agency (NGA) delivers world-class geospatial intelligence that provides a decisive advantage to policymakers, warfighters, intelligence professionals, and first responders. Anyone who sails a U.S. ship, flies a U.S. aircraft, makes national policy decisions, fights wars, locates, target, responds to natural disasters, or even navigates with a cellphone relies on NGA. NGA enables all of these critical actions and shapes decisions that impact our world through the indispensable discipline of geospatial intelligence.&nbsp;&nbsp;For more information about NGA, please visit&nbsp;https://www.nga.mil/.</p><p><br></p><p><strong>About ORISE</strong></p><p><br></p><p>This program, administered by Oak Ridge Associated Universities (ORAU) through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and DoD.&nbsp;Participants do not enter into an employee/employer relationship with ORISE, ORAU, DoD or any other office or agency. Instead, you will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.&nbsp;For more information, visit the&nbsp;ORISE Research Participation Program at the U.S. Department of Defense.</p><p><br></p><p><strong>Qualifications</strong></p><p class=\"ql-align-right\"><br></p><p>The qualified candidate will have a doctoral&nbsp;degree or be within nine months of completion of that degree. Degree must have been received within five years of the appointment start date.&nbsp;U.S. military veterans who have been honorably discharged (or who have been medically discharged because of a service-connected disability) and who received a doctoral degree within ten years of the desired start date are also eligible.</p><p><br></p><p>Highly competitive applicants will have:</p><p><br></p><ul><li>A background in computer vision, machine learning or other relevant discipline.</li><li>Experience in the application of the scientific method.</li><li>A background in modern research techniques in a field highly related to the GEOINT Research.</li><li>Experience in conceptualizing a broad research agenda and in planning and executing specific research projects.</li><li>Knowledge of scientific computing/scripting languages such as Python.</li><li>Experience working with remote sensing and geographic data.</li><li>Ability to integrate with large data repositories.</li><li>A background in high-performance computing.</li></ul>",
        "index": 1,
        "skills": [
            "machine learning",
            "project management",
            "python",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Data Science Internship - Summer 2021",
        "company": "SwimKids Swim School",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:05:30.272Z",
        "url": "https://www.internships.com/posting/8e56380a-11a7-4cf8-9c87-f1a446e79fbf",
        "lastScraped": "2021-06-07T00:05:30.272Z",
        "description": "<p>We believe swimming and a love for the water are gifts everyone deserves to enjoy, no matter what challenges they may face. This isn’t just an ideal we talk about. We’ve created several Special Abilities swim programs to help our clients to the greatest extent possible. We split the goals of our clients with special abilities program into two categories: swimming and life. Specific to swimming, our lessons promote developing comfort in the water, learning safety, and teaching swimming to whatever extent a persons developmental ability allows. Science shows that swim lessons significantly reduce the risk of drowning. We offer our clients the option to choose from several swim programs for as low as $106.00 per month.</p><p><br></p><p>The Data Science Intern will coordinate, prepare, review and compile research and/or client information to facilitate data analysis, management review or reporting requirements. The ideal candidate is data-driven, with an ability to understand the bigger picture. The Data Analytics Intern will be responsible for leveraging internal and external data to provide insights and information which supports a fact-based decision making process. He or she will also provide input into strategy, analysis methods, and tool selection. Successful candidate will work under general supervision and may require training and detailed instructions for assigned tasks. Typical day to day duties will involve the intern carrying out the following:</p><p><br></p><p>• Designs and compiles queries, scripts, reproducible protocols, and special reports for analysis, management review, research purposes and/or reporting requirements.</p><p>• Develop and disseminate weekly, monthly and quarterly client report to the executive team.</p><p>• Assists with and develop management visibility and performance reporting data.</p><p>• Document review.</p><p>• Performs data cleaning and record keeping as needed.</p><p>• Translate business problems to an analytics problem, recommending and applying the most appropriate methods to yield insights and results.</p>",
        "index": 2,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "cybersecurity"
        ],
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-05-08T00:05:38.970Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-06-07T00:05:38.970Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>",
        "index": 3,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Data engineering intern",
        "company": "Roadz",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:05:47.733Z",
        "url": "https://www.internships.com/posting/ccm_3864b60d-b90f-4bc2-82b6-fd888acdeace",
        "lastScraped": "2021-06-07T00:05:47.733Z",
        "description": "<p>This is an internship position for passionate individuals who are interested in working on an innovative advanced data platform for processing connected vehicle data.</p>",
        "index": 4,
        "skills": [
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Remote Global It & Computer Science Internship Program",
        "company": "N/A",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-05-08T00:06:05.901Z",
        "url": "https://www.internships.com/posting/bug_38997255119",
        "lastScraped": "2021-06-07T00:06:05.901Z",
        "description": "Remote Global IT &amp; Computer Science Internship Program\n\nThe Intern Group\n\nPosted Under: Honolulu, Hawaii jobs in Other; Other jobs in zipcode 96850\n\nPosted On: 2021-04-27\n\nThe Intern Group is the leading provider of global internship programs and is regularly featured in the world---s top media including CNN, Forbes, Financial Times and Bloomberg amongst other publications. Our virtual internships provide you with the opportunity to gain invaluable professional experience, grow your network and make your resume shine, wherever you are.Realize your potential with an IT &amp; Computer Science virtual internship program. This is a flexible opportunity to fit your schedule. You choose:\n* Between 10, 20, 30 or 40 hours of a remote IT &amp; Computer Science internship per week\n* The duration of your internship --- from 4 to 24 weeks\n* The start date --- we offer internship start dates every month, all-year-roundWhether you---re a prospective or current university student, recent graduate or professional looking to upgrade your career, a virtual IT &amp; Computer Science internship could offer the perfect next step.What---s included in the program?\n* A 10, 20, 30 or 40 hour per week professional internship in IT &amp; Computer Science\n* We have placed interns with some of the most prestigious organizations in the world, through to small and medium-sized businesses and entrepreneurial start-ups, including SONY Music, KPMG, Aflac, Quintessentially, Grant Thornton and more.\n* Best-in-class career advancement training.\n* You will build the skills to thrive. Our training focuses on developing in you the 8 key competencies essential to succeed in the 21st century world of work.\n* Keynote career talks from global business leaders.\n* You will learn from the best. Our program gives you 6 months access to exclusive, real-time talks from leading speakers. A small sample includes:\n* Nick Jellicoe, the global head of marketing and PR at Rolex for 10 years.\n* Federico Vega, one of Latin America---s highest-profile entrepreneurs.\n* Lord Stevenson, British politician and businessman.The majority of our internships are unpaid. Our goal is to find the best possible internship placements that will provide our participants with real-world responsibilities and the skills they will need for the future. If a host organization offers a stipend or another form of compensation, participants are welcome to accept it, however, it is not guaranteed. The true focus is on the immense professional growth.",
        "index": 5,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "virtual reality"
        ],
        "compensation": "unpaid",
        "remote": true
    },
    {
        "position": "Engeneering, Tech, Science Intern or CO-OP – Virtual Position (Please note: ONLY BASED IN EUROPE)",
        "company": "GAOTek Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:06:14.863Z",
        "url": "https://www.internships.com/posting/cad585ed-c972-4608-b7f9-57e9913f3558",
        "lastScraped": "2021-06-07T00:06:14.863Z",
        "description": "<p>Job Description</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech writing</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Online stores such as Amazon</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech support, webpages and datasheets developments, writing, </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Digital marketing, SEO.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Participate in a team to organize virtual (online) global conferences </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Use social media platforms such as LinkedIn to invite conference speakers, attendees, or sponsors</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perform social marketing to promote the conferences and events and our products </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Agenda preparation, care of speakers, attendees and sponsors, events coordination </p><p>\t</p>",
        "index": 6,
        "skills": [
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Python Algorithm Intern",
        "company": "Arine Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:06:23.609Z",
        "url": "https://www.internships.com/posting/7aba1b2a-d80f-4de7-ab7f-e55893710bae",
        "lastScraped": "2021-06-07T00:06:23.609Z",
        "description": "<p>Arine is a growing healthcare technology company that focuses on improved outcomes and lower cost of care for patients. We are leveraging data and artificial intelligence to ensure patients are on the safest and most effective medication regimens possible.</p>",
        "index": 7,
        "skills": [
            "information technology",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Engeneering, Tech, Science Intern or CO-OP – Virtual Position (Please note: ONLY BASED IN EUROPE)",
        "company": "GAOTek Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:06:32.584Z",
        "url": "https://www.internships.com/posting/cad585ed-c972-4608-b7f9-57e9913f3558",
        "lastScraped": "2021-06-07T00:06:32.584Z",
        "description": "<p>Job Description</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech writing</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Online stores such as Amazon</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech support, webpages and datasheets developments, writing, </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Digital marketing, SEO.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Participate in a team to organize virtual (online) global conferences </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Use social media platforms such as LinkedIn to invite conference speakers, attendees, or sponsors</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perform social marketing to promote the conferences and events and our products </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Agenda preparation, care of speakers, attendees and sponsors, events coordination </p><p>\t</p>",
        "index": 8,
        "skills": [
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:06:41.556Z",
        "url": "https://www.internships.com/posting/ccm_95b5ee54-01bf-4c11-a351-eb453bd3c788",
        "lastScraped": "2021-06-07T00:06:41.556Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 9,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "USFS Postdoctoral Fellowship in Remote Sensing & Geospatial Analysis",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:06:50.297Z",
        "url": "https://www.internships.com/posting/186f49c2-55e9-4fdb-b478-b12060b23c1e",
        "lastScraped": "2021-06-07T00:06:50.297Z",
        "description": "<p><strong><em>*Applications will be reviewed on a rolling-basis.</em></strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research training opportunity is available at the USDA Forest Service (USFS), Pacific Southwest (PSW) Research Station, Riverside, California. Due to the ongoing pandemic, remote telework will be permitted until the Pacific Southwest Research Station Labs reopen.</p><p><br></p><p>The&nbsp;Pacific Southwest Research Station (PSW) is part of the research and development branch of the USDA Forest Service in the states of California and Hawaii and the U.S. affiliated Pacific Islands. Our mission is to develop and communicate science needed to sustain forest ecosystems and their benefits to society. The PSW's&nbsp;Urban Ecosystems and Social Dynamics Program explores the myriad relationships and interdependencies between communities and ecosystems, culture and biodiversity, humans and natural resources, all of which evolve in response to societal and environmental change. Its&nbsp;Fire and Fuels Program increases our understanding about how fire behavior affects fuel types and conditions and how physical properties of fuels influence fire severity and intensity.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Across the globe, the social, economic, and ecological impacts of recent and unprecedented wildfires have increased dramatically over the past thirty years. News of these fires typically focuses on loss of forests and structures, but much less is known about their impacts to&nbsp;communities and landscapes in more urbanized environments. Information on the severity and distribution of impacts of recent fires in California’s Wildland Urban Interface (WUI) and urban areas&nbsp;- home to 90% of its population - is needed to better understand the resilience of urban landscapes and communities as well as the effects on ecosystem services and socio-ecological trajectories following wildfires.</p><p><br></p><p>The USDA Forest Service’s PSW Research Station&nbsp;seeks a Postdoctoral Fellow in Remote Sensing and Geospatial Analysis to join a team studying the socio-economic and ecosystem service impacts of wildfires and fuel treatments in California’s urban and WUI forests. This research will investigate: 1) the effects of urban landscaping practices and vegetation on fire severity, 2) the role of fuel treatments on fire behavior in urban and WUI forests, and 3) the development of an urban fuel typology.&nbsp;Under the guidance of a mentor, the Fellow will contribute to:</p><ul><li>Analyzing pre- and post-fire urban and WUI vegetation changes using a combination of remote sensing and cloud computing environments (i.e., Google Earth Engine)</li><li>Developing a set of case studies and guidelines demonstrating the effects of fire on urban and WUI landscapes</li><li>Application of remote sensing, GIS, and machine learning techniques to address management and planning problems related to California’s ecosystems and vulnerable communities.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong></p><ul><li>Gain experience in compiling and statistically analyzing large socioeconomic and ecological datasets</li><li>Learn about the dynamics of wildfires, ecosystem services, and environmental justice in urban and WUI setting</li><li>Use data sets to develop guidelines and best management practices for mitigating fire risk in urban areas</li></ul><p><em>Professional development opportunities</em></p><ul><li>Network with social scientists, economists, ecologists, and other PSW scientists.</li><li>Have a platform to demonstrate quantitative skills and to refine communication skills.</li><li>Author and co-author peer-reviewed publications and management guidelines.</li><li>Gain first-hand knowledge of Forest Service Research &amp; Development science, State and Private Forestry, and National Forest System management</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Dr.&nbsp;Francisco Escobedo (Francisco.escobedo@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Fall&nbsp;2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended for an additional year upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.&nbsp;<strong>The participant will receive a monthly stipend of $6,090. A health insurance supplement covering individual health and prescription coverage (excludes dental/vision) and some travel and supply funds will also be provided.</strong></p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens and Lawful Permanent Residents (LPR) only.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 10,
        "skills": [
            "machine learning",
            "project management",
            "networks",
            "information technology",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Toxicokinetic Models Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:06:59.053Z",
        "url": "https://www.internships.com/posting/2dc66130-0497-43e6-a0f4-81f39161364c",
        "lastScraped": "2021-06-07T00:06:59.053Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Characterizing the uncertainty in the predictions of toxicokinetic models, including predictions based upon in vitro data, requires comparison to in vivo data. This research project works to address the current major sources of uncertainty in high-throughput toxicokinetics (HTTK).&nbsp;The basic outline of this research project is to conduct: 1) in vitro metabolic clearance assays of selected environmental chemicals using human and rat microsomal preparations; 2) protein binding assays with the environmental chemicals; 3) in vivo toxicokinetic studies with the environmental chemicals.&nbsp;The research participant may prepare dosing solutions of selected environmental chemicals, conduct in vitro microsomal clearance and protein binding assays, conduct in vivo toxicokinetic studies which involves dosing rats and collecting blood samples, processing samples for analytical analysis, and compiling and graphing data. With the in vitro clearance and binding data, in vivo toxicokinetic predictions can be developed using established toxicokinetic models. The in vivo predictions can then be compared to the determined in vivo toxicokinetic data.&nbsp;Sources of variability between the predicted versus the determined toxicokinetic can then be assessed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will learn about in vitro and in vivo toxicokinetics, toxicokinetic modeling, analytical chemistry, in vitro to in vivo extrapolation, good practices in quality assurance and working with laboratory animals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.michaelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or&nbsp;four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 11,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "EPA Bioavailability of Metals and Metalloids Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:07:07.946Z",
        "url": "https://www.internships.com/posting/f45f8432-8f55-4c55-878d-aac3d7381355",
        "lastScraped": "2021-06-07T00:07:07.946Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will use in vitro and in vivo methods to assess the bioavailability of metals and metalloids. The in vitro methods include the use of mammalian cell-based assays.&nbsp;The in vivo methods include the use of a mouse-based assay.&nbsp;The research participant will have the opportunity to become part of a multi-lab research team that collaborates in the metal/metalloid bioavailability project. This research project provides an opportunity for the research participant to gain experience and proficiency in many aspects of laboratory research.&nbsp;During this opportunity, the research participant will develop skills in mammalian cell culture, animal handling, necropsy, sample collection, tissue preparation, and the processing of tissues for chemical and biochemical analysis.&nbsp;The research participant will learn proper record keeping skills and receive instruction on experimental design, animal feeding studies and animal housing and husbandry. The research participant will gain experience collecting, processing, analyzing and managing scientific data.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor, the research participant may be involved in the following training activities.</p><ul><li>Handling and treating small laboratory animals (mice)</li><li>Basic animal husbandry</li><li>Necropsy and preparation of tissues for chemical and biochemical analyses (such as mass spectroscopy, neutron activation, spectral analysis, and enzymatic assays)</li><li>Analytical chemistry techniques</li><li>Mammalian cell culture</li><li>Cell culture-based biological assays</li><li>Record keeping</li><li>Data processing and statistical analysis graphical presentation</li><li>Evaluating scientific literature and toxicological databases for information relevant to the bioavailability of metals and metalloids</li><li>Participating through guidance of mentor in a range of scientific efforts, performs tissue analysis, data analysis using computers, performs QA/QC evaluations and library search relevant scientific literature</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.miachelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 12,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "EPA Toxicokinetic Models Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:07:16.706Z",
        "url": "https://www.internships.com/posting/2dc66130-0497-43e6-a0f4-81f39161364c",
        "lastScraped": "2021-06-07T00:07:16.706Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Characterizing the uncertainty in the predictions of toxicokinetic models, including predictions based upon in vitro data, requires comparison to in vivo data. This research project works to address the current major sources of uncertainty in high-throughput toxicokinetics (HTTK).&nbsp;The basic outline of this research project is to conduct: 1) in vitro metabolic clearance assays of selected environmental chemicals using human and rat microsomal preparations; 2) protein binding assays with the environmental chemicals; 3) in vivo toxicokinetic studies with the environmental chemicals.&nbsp;The research participant may prepare dosing solutions of selected environmental chemicals, conduct in vitro microsomal clearance and protein binding assays, conduct in vivo toxicokinetic studies which involves dosing rats and collecting blood samples, processing samples for analytical analysis, and compiling and graphing data. With the in vitro clearance and binding data, in vivo toxicokinetic predictions can be developed using established toxicokinetic models. The in vivo predictions can then be compared to the determined in vivo toxicokinetic data.&nbsp;Sources of variability between the predicted versus the determined toxicokinetic can then be assessed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will learn about in vitro and in vivo toxicokinetics, toxicokinetic modeling, analytical chemistry, in vitro to in vivo extrapolation, good practices in quality assurance and working with laboratory animals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.michaelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or&nbsp;four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 13,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "VT",
            "state": "United States"
        },
        "posted": "2021-05-08T00:07:34.953Z",
        "url": "https://www.internships.com/posting/sam_4070107230",
        "lastScraped": "2021-06-07T00:07:34.953Z",
        "description": "<div><p>Software Engineer Intern<br>Systems &amp; Software - Remote<br><br>As a Software Engineer for Systems &amp; Software, you will be placed into a small Agile Development team where you will play an important role in helping design, build, test and deploy our products. You will work hand in hand with other members on your team to support our current product lines and build out the future of our product. You will have access to the latest tools, hardware and some of the brightest software engineers in this area.<br><br>We are an agile development organization, utilizing Kanban on the support side and Scrum for our development teams. We use industry standard software development tools such as Jira, Git, Docker, Slack and Confluence to manage our iterative design, build, test, and deployment process... any experience with the above is an asset.</p><p></p><p>What we are looking for</p><ul><li>B.S in Computer Science or Computer Information in the process of, or has recently completed a bachelor of science degree in Computer Science, Software Engineering or related field</li><li>Maintains an above average GPA especially in the areas of Engineering</li><li>Has some programming experience with Java or any flavor of C</li><li>Is familiar with HTML, CSS, and JavaScript</li><li>Has an exceptional work ethic and is ambitious</li><li>Communicates well with others and is a team player</li></ul></div>",
        "index": 14,
        "skills": [
            "software engineering",
            "javascript",
            "java",
            "hardware",
            "c and c++",
            "project management",
            "information technology",
            "web development"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "EPA Postdoctoral Fellowship in Integrated Environmental Modeling",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:07:43.933Z",
        "url": "https://www.internships.com/posting/8e8a0326-7ad0-4cd4-b8ff-b8f9f56d9a82",
        "lastScraped": "2021-06-07T00:07:43.933Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM), Watershed and Ecosystem Characterization&nbsp;Division (WECD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina.</p><p><br></p><p>Safe and Sustainable Water Resources (SSWR) Research Program is one of the EPA ORD’s national research programs. One of the important research areas under the SSWR is “Nutrients and Harmful Algal Blooms”. While EPA has made great efforts toward reducing nutrient pollution nationwide, we continue to be challenged to consider the appropriate spatial and temporal context for reductions and alternative practices for tracking interventions to meet nutrient reduction goals in a comprehensive manner.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;&nbsp;This research opportunity,&nbsp;Integrated Environmental Modeling, is&nbsp;comprised of two broad components: 1) Develop and application of state of the science for nutrient study, and 2) seek and evaluate effectiveness of various mitigation practices for water quality improvement.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will have the opportunity to learn model development and application to better understand nutrient source, fate and transport in the large river basins, as well as seeking the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. land use/land management practices) leading to the sustainability of surface and subsurface water resources.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Dr. Yongping Yuan (yuan.yongping@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021 or as soon as a suitable candidate is found.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 15,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USFS Internship in Diversity-Forest Ecosystem Functioning Using GIS/Remote Sensing",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:07:52.835Z",
        "url": "https://www.internships.com/posting/a42ec2d0-dcf1-42c8-b7e5-f6d877ecd968",
        "lastScraped": "2021-06-07T00:07:52.835Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center located in Research Triangle Park, North Carolina. Initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Our proposed work therefore addresses all the four criteria of this solicitation. Through this research and collaboration, the follow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is part-time (20 hours per week).</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 16,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning"
        ],
        "start": "2021-07-15T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Information Security Intern",
        "company": "N/A",
        "location": {
            "city": "Virginia",
            "state": "United States"
        },
        "posted": "2021-05-08T00:08:11.165Z",
        "url": "https://www.internships.com/posting/bug_38993143446",
        "lastScraped": "2021-06-07T00:08:11.165Z",
        "description": "Information Security Intern\n\nPosting Details\n\nJob Code/Title SW - Student Worker\nPosition Number S00001\nWorking Title Information Security Intern\nDepartment Information Security\nOrganizational Overview\n\nAt VCU, we Make it Real through learning, research, creativity, service and discovery  the hallmarks of the VCU experience. A premier, urban, public research university nationally recognized as one of the best employers for diversity, VCU is a great place to work. Its a place of opportunity, where your success is supported and your career can thrive. VCU offers employees a generous leave package, career paths for advancement, competitive pay, and an opportunity to do mission-driven work.\n\nRecruitment Pool All Applicants\nAnticipated Hiring Range $13 - $15\nCampus Monroe Park Campus\nPosition Type Student\nHours/Week 20 hours\nNormal work days Monday-Friday flexible\nNormal work hours flexible\nJob Category Information Technology\nDoes this position provide patient or clinical services to the VCU Health System? No\nDoes this position require a pre-placement medical assessment? No\nIs any portion of this position grant-funded? No\nSensitive Position No\nResource Critical No\nDescription of the Job\n\nSupport VCUs Information Security program by performing intrusion detection and incident response duties. Function as part of the information security operations team and analyze security events and declare and triage security incidents. Coordinate with internal and external stakeholders and senior security operations staff to properly identify, contain, and eradicate threats. Coordinate with and assist IT and business units to recover from security incidents. Develop and track metrics around security events and incidents, and provide reports to security management on security operations. Assist full time security operations staff in other operational needs, such as vulnerability management operations, IT risk management operations, and training efforts.\n\nPerform other duties as assigned.\n\nRequired Qualifications\n\nStrong ethical standards and ability to observe confidentiality and acceptable use when dealing with sensitive subject matters.\n\nBasic to intermediate knowledge of one or more computer operating systems, including Microsoft Windows, Apple macOS, or varying Linux/Unix distributions.\n\nBasic knowledge of computer networking protocols.\n\nBasic knowledge of cyberattack and defensive methodologies.\n\nBasic knowledge of scripting and/or programming languages.\n\nBasic knowledge of system architecture and common application delivery platforms.\n\nBasic knowledge of data security and privacy best practices and regulations that may apply to the higher education environment.\n\nExcellent written and verbal communication skills.\n\nExcellent analytical skills and problem solving skills.\n\nExcellent organizational skills, including the ability to effectively handle multiple tasks and deadlines.\n\nExcellent interpersonal skills, including the ability to communicate technical concepts to non-technical audiences.\n\nAbility to work successfully in a diverse work environment, in teams and independently with technical and non-technical individuals.\n\nAbility to quickly acquire new skills and knowledge.\n\nStrong interest in the field of technology and cybersecurity and the will to learn.\n\nDemonstrated experience working in and fostering a diverse faculty, staff and student environment or commitment to do so as a staff member at VCU.\n\nPreferred Qualifications\n\nTechnical experience working with two of the three following security domains is strongly preferred: systems development security, network security and computer operations security.\n\nTechnical experience working with the development and operations in system architecture, networking, and/or application development preferred.\n\nTechnical experience working with intrusion detection/prevention systems, security information event management systems, and general understanding of intrusion detection and incident response processes preferred.\n\nExperience working with organizational information security teams in the past is preferred.\n\nSecurity related certifications, such as Security+, CISA, SSCP, CISSP, OSCP/OSCE, GSEC or other GIAC are preferred.\n\nExperience working in a university setting is preferred.\n\nJob Open Date 04/16/2021\nRemove from posting on or before\nOpen Until Filled Yes\nSpecial Instructions to Applicants\nAdditional Information\n\nCan accommodate working remotely",
        "index": 17,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Summer STEM Education Jobs & Internships!",
        "company": "Camp Canadensis",
        "location": {
            "city": "Pennsylvania",
            "state": "United States"
        },
        "posted": "2021-05-08T00:08:20.175Z",
        "url": "https://www.internships.com/posting/5f3e3c14-8be3-455d-b915-9643278bec19",
        "lastScraped": "2021-06-07T00:08:20.175Z",
        "description": "<p><strong class=\"ql-size-large\">Who We Are</strong></p><p>This summer, get paid to be a MATURE GOOFBALL! Join our team of motivated staff and enjoy the perfect balance of work and fun. Located in the Pocono Mountains of PA, we are a co-ed sleep away camp for kids ages 7 to 16. We are looking for enthusiastic and creative individuals to work as Art and Tech Specialists in: Rocketry, Robotics, Legos, Coding, Rubiks Cube, Science Experiments, and Model Making</p><p><br></p><p>2021 Dates: June 16th to August 14th</p><p><strong>All positions include Housing, Salary, Food/Meals, and Laundry.</strong> </p><p>*Paid internships to fulfill academic requirements are encouraged.*</p><p><br></p><p><strong class=\"ql-size-large\">Role &amp; Responsibilities</strong></p><ul><li>College-aged counselors live in the bunks with the campers. A typical bunk will have 8-12 campers and 3-4 counselors.</li><li>All counselors share in-bunk responsibilities from wake up to clean up to attendance at meals and evening activities.</li><li>During the activity day, Activity Specialists will be at their program area, teaching a specific activity to a wide range of campers. When not teaching activities, Specialists are scheduled back with their respective bunk of campers.</li><li>There is scheduled time off each day and days off throughout the course of the summer.</li></ul><p><br></p><p><strong class=\"ql-size-large\">3 Reasons to Make Camp Canadensis Your Summer Job</strong></p><ol><li>Build leadership, communication, and problem-solving skills while making lifelong friendships. Serve as a mentor, role model, and hero to our campers.</li><li>Your office? 1,000 acres of beautiful outdoors, including a 75-acre private lake! Your uniform? Shorts and T-shirts! Your co-workers? Passionate young adults like you, looking to have the best summer ever!</li><li>Get paid to be a MATURE GOOFBALL. Play and have fun all summer while gaining professional experiences and developing skills that are universally in demand, regardless of your career path.</li></ol><p><br></p><p><strong class=\"ql-size-large\">APPLY NOW!</strong></p><p>https://canadensis.campintouch.com/ui/forms/application/staff/App</p>",
        "index": 18,
        "skills": [
            "robotics"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Remote Global It & Computer Science Internship Program",
        "company": "N/A",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-05-08T00:08:38.267Z",
        "url": "https://www.internships.com/posting/bug_38997255119",
        "lastScraped": "2021-06-07T00:08:38.267Z",
        "description": "Remote Global IT &amp; Computer Science Internship Program\n\nThe Intern Group\n\nPosted Under: Honolulu, Hawaii jobs in Other; Other jobs in zipcode 96850\n\nPosted On: 2021-04-27\n\nThe Intern Group is the leading provider of global internship programs and is regularly featured in the world---s top media including CNN, Forbes, Financial Times and Bloomberg amongst other publications. Our virtual internships provide you with the opportunity to gain invaluable professional experience, grow your network and make your resume shine, wherever you are.Realize your potential with an IT &amp; Computer Science virtual internship program. This is a flexible opportunity to fit your schedule. You choose:\n* Between 10, 20, 30 or 40 hours of a remote IT &amp; Computer Science internship per week\n* The duration of your internship --- from 4 to 24 weeks\n* The start date --- we offer internship start dates every month, all-year-roundWhether you---re a prospective or current university student, recent graduate or professional looking to upgrade your career, a virtual IT &amp; Computer Science internship could offer the perfect next step.What---s included in the program?\n* A 10, 20, 30 or 40 hour per week professional internship in IT &amp; Computer Science\n* We have placed interns with some of the most prestigious organizations in the world, through to small and medium-sized businesses and entrepreneurial start-ups, including SONY Music, KPMG, Aflac, Quintessentially, Grant Thornton and more.\n* Best-in-class career advancement training.\n* You will build the skills to thrive. Our training focuses on developing in you the 8 key competencies essential to succeed in the 21st century world of work.\n* Keynote career talks from global business leaders.\n* You will learn from the best. Our program gives you 6 months access to exclusive, real-time talks from leading speakers. A small sample includes:\n* Nick Jellicoe, the global head of marketing and PR at Rolex for 10 years.\n* Federico Vega, one of Latin America---s highest-profile entrepreneurs.\n* Lord Stevenson, British politician and businessman.The majority of our internships are unpaid. Our goal is to find the best possible internship placements that will provide our participants with real-world responsibilities and the skills they will need for the future. If a host organization offers a stipend or another form of compensation, participants are welcome to accept it, however, it is not guaranteed. The true focus is on the immense professional growth.",
        "index": 19,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "virtual reality"
        ],
        "compensation": "unpaid",
        "remote": true
    },
    {
        "position": "USFS Internship in Diversity-Forest Ecosystem Functioning Using GIS/Remote Sensing",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:08:47.241Z",
        "url": "https://www.internships.com/posting/a42ec2d0-dcf1-42c8-b7e5-f6d877ecd968",
        "lastScraped": "2021-06-07T00:08:47.241Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center located in Research Triangle Park, North Carolina. Initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Our proposed work therefore addresses all the four criteria of this solicitation. Through this research and collaboration, the follow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is part-time (20 hours per week).</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 20,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning"
        ],
        "start": "2021-07-15T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "USFS Postdoctoral Fellowship in Biodiversity-Forest Ecosystem Functioning Using Remote Sensing/GIS",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:08:57.161Z",
        "url": "https://www.internships.com/posting/6b2a7004-aea2-4643-9dbe-bebd4566db71",
        "lastScraped": "2021-06-07T00:08:57.161Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A&nbsp;postdoctoral research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center in Research Triangle Park, North Carolina. The participant will mainly be stationed at the University of New Hampshire in Durham, New Hampshire, but will travel to Research Triangle Park periodically and South Carolina and Florida as needed if funding is available. The initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Through this research and collaboration, the fellow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.&nbsp;<strong>The annual stipend will be around $70,000. A health insurance supplement covering individual health and prescription coverage (excludes dental/vision) will also be provided.</strong></p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 21,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning"
        ],
        "start": "2021-07-15T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Advanced Air Quality Model System (AAQMS) Research Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:09:06.203Z",
        "url": "https://www.internships.com/posting/f69212af-e344-4dba-b3e7-aa82e3ee722b",
        "lastScraped": "2021-06-07T00:09:06.203Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u></strong>: The USEPA has embarked on the Advanced Air Quality Model System (AAQMS) project to enable modeling of air quality from global to regional to local scales. The system will have three configurations: 1. Global meteorology with seamless mesh refinement and online (coupled) atmospheric chemistry; 2. Regional (limited area) online meteorology and chemistry; and 3. Offline (sequential) regional meteorology and chemistry.&nbsp;A team of scientists in AESMD is developing a global online configuration which includes the Model for Prediction Across Scales – Atmosphere (MPAS-A), developed at the National Center for Atmospheric Research (NCAR), coupled with the latest version of the Community Multiscale Air Quality (CMAQv5.3) model developed at the U.S. EPA. .&nbsp;This multiyear development and evaluation effort offers many opportunities to learn new skills and gain valuable research experience collaborating with a team of experienced atmospheric modeling scientists.</p><p><br></p><p>The main focus of this research project will be a continuation of the Advanced Air Quality Model System (AAQMS) development which enables modeling of air quality from global to regional to local scales.</p><p><br></p><p>Research activities may include:</p><ul><li>adding new features in the modelling system</li><li>thorough model evaluation</li><li>studying and implementing aerosol radiative effect with respect to long wave radiation</li><li>applying the model in real case study</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will have the opportunity to learn about aerosol radiative effect, model coupling mechanics, systemic model evaluation as well as air quality impact in a local, regional, and/or global scale. The research participant will gain experience with coding, AMET and Python tools, and will have a great opportunity to collaborate and interact with other scientists in the group.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is David Wong (wong.david-c@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;September 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 22,
        "skills": [
            "project management",
            "python",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "start": "2021-09-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "EPA Chemical Mixtures Evaluation & Modeling Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:09:15.288Z",
        "url": "https://www.internships.com/posting/05f13ed9-44ee-4e59-9fd0-ea8ca0abbd8f",
        "lastScraped": "2021-06-07T00:09:15.288Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>The Center for Public Health and Environmental Assessment (CPHEA) is tasked to provide support to the Safe and Sustainable Waters Research (SSWR) program by implementing in vitro tools for chemical toxicity and screening purposes. These methods utilize molecular initiating events (MIEs) that have been shown to activate adverse outcome pathways and related physiological/population-level adverse outcomes. Therefore, these efforts secondarily support the Chemical Safety for Sustainability (CSS) program.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The research participant will have the opportunity to conduct research related to goals of the SSWR, and to a lesser extent the CSS, programs.&nbsp;Research activities may include collaboration with an EPA team of investigators involved in toxicology research to understand impacts of environmentally relevant individual compounds and mixtures on nuclear receptor signaling pathways (e.g. estrogen, ER; androgen, AR; glucocorticoid, GR; peroxisome proliferator-activated receptor, PPAR; aryl hydrocarbon, AhR signaling pathways). The participant may gain experience assessing and modeling in vitro and in vivo responses of individual compounds, defined chemical mixtures, and also environmental samples containing unknown chemical mixtures.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Under the guidance of a mentor, the participant will be the following training activities:</p><ul><li>cell culture techniques</li><li>in vitro chemical and environmental exposures and assessments&nbsp;</li><li>application and comparison of chemical mixtures models</li><li>in vivo physiological determinations relevant to ER, AR, GR and PPAR-related Adverse Outcome Pathways</li><li>necropsy and preparation of tissues for biochemical analyses (e.g. hormone production and quantitative-real time polymerase chain reaction)</li><li>data processing, statistical analysis, and graphical presentation</li><li>evaluating scientific literature and toxicological databases for information relevant to the presence of novel environmental contaminants and mixtures models.</li><li>maintain careful, easily legible, and accurate records in a laboratory notebook, electronic journal, or by other means acceptable to the mentor.&nbsp;</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity are Elizabeth Medlock Kakaley (medlockkakaley.elizabeth@epa.gov) and Earl Gray (gray.earl@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 23,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "web development"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS Postdoctoral Fellowship in Plant Molecular Biology",
        "company": "ORISE",
        "location": {
            "city": "New Jersey",
            "state": "United States"
        },
        "posted": "2021-06-07T00:09:24.328Z",
        "url": "https://www.internships.com/posting/c22e7aa8-6b8b-4608-a802-558ef0c9251c",
        "lastScraped": "2021-06-07T00:09:24.328Z",
        "description": "<p><strong>*Applications&nbsp;are reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A postdoctoral research opportunity&nbsp;is currently available with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), Genetic Improvement for Fruits and Vegetables Laboratory (GIFVL) located in Chatsworth, New Jersey.</p><p><br></p><p>The Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision the agency is to provide global leadership in agricultural discoveries through scientific excellence.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The project goal is to develop and validate&nbsp;QTL markers for key traits, such as disease resistance, in cranberry (Vaccinium macrocarpon). Under the guidance of a mentor, the selected participant will be involved in all aspects of the project including genotyping, phenotyping, QTL analyses, marker development and marker validation. The project will allow hands-on opportunity to develop skills in a number of molecular biology techniques as well as bioinformatics.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The project will allow hands-on opportunity to develop skills in a number of molecular biology techniques as well as bioinformatics.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for&nbsp;this opportunity is James Polashock (James.polashock@usda.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;June 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year,&nbsp;but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens and&nbsp;Lawful Permanent Residents (LPR) only.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and&nbsp;include the reference code for this opportunity.</p>",
        "index": 24,
        "skills": [
            "project management",
            "bioinformatics",
            "machine learning",
            "information technology"
        ],
        "start": "2021-06-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "EPA Air Pollution and Atmospheric Modeling Systems MS Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:09:33.073Z",
        "url": "https://www.internships.com/posting/ce9ccf58-297a-4690-9fdc-cf458c7200cd",
        "lastScraped": "2021-06-07T00:09:33.073Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will attempt to quantify the effects of new model developments in both the hemispheric CMAQ (H-CMAQ) and the next generation global MPAS-CMAQ modeling system on background pollution and the contributions from domestic and international anthropogenic sources, along with natural emission sources. This research project may include developments of a consistent setup for both the H-CMAQ and MPAS-CMAQ modeling platforms; a protocol for quantifying background pollution through emission perturbation simulations, source apportionment, and/or DDM simulations; and, an approach for prioritizing which specific model updates (e.g. halogen chemistry, deposition, secondary organic aerosols) should be tested through this platform.</p><p><br></p><p>Research activities may include:</p><ul><li>Setting up, performing, and analyzing simulations using regional WRF-CMAQ, hemispheric WRF-CMAQ and global MPAS-CMAQ configurations to enable model inter-comparisons</li><li>Developing methods for quantifying observed and simulated hemispheric and global background air pollution</li><li>Obtaining new observation datasets (e.g. satellite data) and developing new tools/methods to use those data in hemispheric/global model evaluation</li><li>Use existing methods and/or develop new methods to estimate the impact of different model configurations on simulated background air pollution</li><li>Developing new methods to test the various individual components of the CMAQ modeling system to determine their importance in estimating background air pollution</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>In collaboration with the AESMD scientists, the research participant will learn how to develop and apply large scale comprehensive atmospheric modeling systems to study various aspects of air pollution. This research training opportunity will give the research participant experience that extends skills acquired through their advanced degree education.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Wyat Appel&nbsp;(appel.wyat@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required </p><p>for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 25,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS Research Opportunity in Geospatial Analyses of Agroecosystem Dynamics",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:09:44.075Z",
        "url": "https://www.internships.com/posting/50ce241e-77c3-4139-8d3b-ecc0708feae0",
        "lastScraped": "2021-06-07T00:09:44.075Z",
        "description": "<p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple&nbsp;master's level research opportunities&nbsp;are currently&nbsp;available with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS) located at multiple ARS units across the country.</p><p><br></p><p>This research opportunity is part of the SCINet Fellowship program at ARS. All fellows will spend time at headquarters for some of their training, but will be based&nbsp;in&nbsp;another ARS research unit&nbsp;for more specific training.&nbsp;The SCINet/Big Data Program at ARS offers research opportunities to motivated participants interested in&nbsp;solving agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales, as well as metadata enhancement for data discovery. One of the goals of the SCINet Initiative is to develop and apply new technologies, including artificial intelligence (AI) and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, linkage, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of these opportunities is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each&nbsp;participant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with geospatial software for analysis (e.g., ArcGIS) provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The successful candidate will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The successful candidate will also learn AI technologies relevant to these problems. The successful candidate will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses across multiple spatial and temporal scales.</p>",
        "index": 26,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "software engineering",
            "artificial intelligence"
        ],
        "remote": true
    },
    {
        "position": "Quality Analyst & Automation",
        "company": "Globalwonks",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:09:55.717Z",
        "url": "https://www.internships.com/posting/b71c7ae7-6c88-4591-967a-e25497489610",
        "lastScraped": "2021-06-07T00:09:55.717Z",
        "description": "<p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Analyze requirements and design test cases</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Execute test on the testing platform (QA platform)</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Report anomalies to the QA and raise issues</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Be part of the scrum team and participate actively to the daily team meeting</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;When/If suitable, use selenium/python to automate some features</p>",
        "index": 27,
        "skills": [
            "python"
        ],
        "remote": true
    },
    {
        "position": "EPA Environmental Pollutant Fate and Transport Modeling Research Opportunity",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-07T00:10:06.653Z",
        "url": "https://www.internships.com/posting/350cd6f3-8ec5-47b1-a1c9-6a3524f99d15",
        "lastScraped": "2021-06-07T00:10:06.653Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM), Watershed and Ecosystem Characterization&nbsp;Division (WECD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina.</p><p><br></p><p>EPA ORD’s Research Programs include: Safe and Sustainable Water Resources (SSWR) Research Program, Chemical Safety for Sustainability (CSS) Research Program and Sustainable and Healthy Communities Research Program. Research for the SSWR focuses on developing an integrated modeling system for evaluation of policy options for water quality improvement at a large scale such as the Mississippi River Basin. Research for the CSS focuses on assessing human and environmental risk related to the use of chemicals. Both SSWR and CSS research programs require environmental pollutant fate and transport modeling, which would allow ORD to track the source and identify the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. fertilizer and pesticide application as well as other land use/land management practices).&nbsp;</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will focus on environmental pollutant fate and transport modeling. Under the guidance of a mentor, the participant will be involved in the following research activities:</p><ul><li>Using GIS and hydrological and water quality modeling skills to develop necessary input files for using the integrated modeling system to assist with evaluating nitrogen source, fate and transport under various scenarios</li><li>Reviewing and summarizing the effectiveness of BMPs/conservation practices for nutrient reduction</li><li>Developing and/or applying models and necessary input files for pesticide risk assessment and management</li><li>Interacting with a team of multi-disciplinary scientists/researchers</li><li>Presenting research results at national conferences&nbsp;</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant will have the opportunity to be involved in model development and application to better understand pollutant source, fate and transport in fields as well as in large river basins. The participant will also be involved in seeking the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. land use/land management practices) leading to the sustainability of surface and subsurface water resources.&nbsp;Furthermore, the participant has the opportunity to publish and/or present research results at local and national conferences.&nbsp;</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Dr. Yongping Yuan (yuan.yongping@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021 or as soon as a suitable candidate is found.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment can be 20-40 hours per week, depending on the participant's availability.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 28,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "web development"
        ],
        "remote": false
    },
    {
        "position": "EPA Air Pollution and Atmospheric Modeling Systems MS Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:10:19.747Z",
        "url": "https://www.internships.com/posting/ce9ccf58-297a-4690-9fdc-cf458c7200cd",
        "lastScraped": "2021-06-07T00:10:19.747Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will attempt to quantify the effects of new model developments in both the hemispheric CMAQ (H-CMAQ) and the next generation global MPAS-CMAQ modeling system on background pollution and the contributions from domestic and international anthropogenic sources, along with natural emission sources. This research project may include developments of a consistent setup for both the H-CMAQ and MPAS-CMAQ modeling platforms; a protocol for quantifying background pollution through emission perturbation simulations, source apportionment, and/or DDM simulations; and, an approach for prioritizing which specific model updates (e.g. halogen chemistry, deposition, secondary organic aerosols) should be tested through this platform.</p><p><br></p><p>Research activities may include:</p><ul><li>Setting up, performing, and analyzing simulations using regional WRF-CMAQ, hemispheric WRF-CMAQ and global MPAS-CMAQ configurations to enable model inter-comparisons</li><li>Developing methods for quantifying observed and simulated hemispheric and global background air pollution</li><li>Obtaining new observation datasets (e.g. satellite data) and developing new tools/methods to use those data in hemispheric/global model evaluation</li><li>Use existing methods and/or develop new methods to estimate the impact of different model configurations on simulated background air pollution</li><li>Developing new methods to test the various individual components of the CMAQ modeling system to determine their importance in estimating background air pollution</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>In collaboration with the AESMD scientists, the research participant will learn how to develop and apply large scale comprehensive atmospheric modeling systems to study various aspects of air pollution. This research training opportunity will give the research participant experience that extends skills acquired through their advanced degree education.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Wyat Appel&nbsp;(appel.wyat@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required </p><p>for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 29,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:10:30.687Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-06-07T00:10:30.687Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 30,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-08T00:10:41.732Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-06-07T00:10:41.732Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 31,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "Financial Triangle Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:10:52.797Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-06-07T00:10:52.797Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>",
        "index": 32,
        "skills": [
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "Financial Triangle Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:11:03.791Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-06-07T00:11:03.791Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>",
        "index": 33,
        "skills": [
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:11:15.836Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-06-07T00:11:15.836Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>",
        "index": 34,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Billing-Intern",
        "company": "Petro-Construction",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:11:26.858Z",
        "url": "https://www.internships.com/posting/3a99c102-cba4-4146-8cf3-ac323fab54c9",
        "lastScraped": "2021-06-07T00:11:26.858Z",
        "description": "<p>We are looking for a  Billing Intern to perform tasks that will help us monitor our revenues. You will be responsible for keeping track of money owed to us by customers, preparing invoices and updating records.</p><p>&nbsp;</p><p>As a billing intern, you must be accurate and reliable in handling accounts and documents. Being good at math and a high degree of organizational ability is essential due to the great amount of financial information. Since you will be using technology to expedite your work, a degree of computer knowledge is required.</p><p>&nbsp;</p><p>The goal is to contribute to the accurate preparation of bills receivable and safeguard the company’s income.</p><p><br></p><p><strong> RESPONSIBILITIES:</strong></p><ul><li>This internship primarily entails supporting standard billing and maintenance transactions in billing, metering, and other related systems to ensure accurate customer billing, accurate revenue reporting and adherence to regulatory requirements.</li><li>Internship responsibilities include running reports and/or providing data from the billing system to be used in regulatory &amp; financial reporting.</li><li>Assists in the development and maintenance of documentation for department procedures; billing, metering, or other customer system reports, processes and related information.</li><li>May assist project teams in testing modifications and enhancements to billing, metering, or related systems.</li></ul>",
        "index": 35,
        "skills": [
            "information technology",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-05-08T00:11:47.279Z",
        "url": "https://www.internships.com/posting/bug_38999958445",
        "lastScraped": "2021-06-07T00:11:47.279Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time",
        "index": 36,
        "skills": [
            "project management",
            "networks",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-05-08T00:12:08.245Z",
        "url": "https://www.internships.com/posting/bug_38999957205",
        "lastScraped": "2021-06-07T00:12:08.245Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5842\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the IT teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time",
        "index": 37,
        "skills": [
            "project management",
            "information technology",
            "networks"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Engeneering, Tech, Science Intern or CO-OP – Virtual Position (Please note: ONLY BASED IN EUROPE)",
        "company": "GAOTek Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-07T00:12:19.556Z",
        "url": "https://www.internships.com/posting/cad585ed-c972-4608-b7f9-57e9913f3558",
        "lastScraped": "2021-06-07T00:12:19.556Z",
        "description": "<p>Job Description</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech writing</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Online stores such as Amazon</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tech support, webpages and datasheets developments, writing, </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Digital marketing, SEO.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Participate in a team to organize virtual (online) global conferences </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Use social media platforms such as LinkedIn to invite conference speakers, attendees, or sponsors</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perform social marketing to promote the conferences and events and our products </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Agenda preparation, care of speakers, attendees and sponsors, events coordination </p><p>\t</p>",
        "index": 38,
        "skills": [
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Station Mobile Apparatus Technician Apprentice Or Journeyman",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-05-08T00:12:39.952Z",
        "url": "https://www.internships.com/posting/bug_39002223926",
        "lastScraped": "2021-06-07T00:12:39.952Z",
        "description": "Station Mobile Apparatus Technician Apprentice or Journeyman\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$32.69 - $47.42\n\nMinimum Age Requirement:\n\nJob Description:\n\nApprentice\n\nThe Station Mobile Apparatus Technician Apprentice assists Station Mobile Apparatus Technician to haul, operate, maintain, test, install, and repair Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nJourneyman\nThe Station Mobile Apparatus Technician hauls, operates, maintains, tests, installs, and repairs Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* OSHA regulations, chemical safety, and electrical safety related work practices\n* Rigging and fall protection\n* Bucket truck and man lift rescue\n* Utility system practices and field operation practices\n* Substation and power plant construction, safety procedures, and maintenance techniques\n* Safe operation of hand and power tools used in construction\n* Structural and mechanical drawings (i.e. elevations, plans, sections, details)\n* Heavy equipment operation (i.e. bucket truck, boom truck, backhoe, line bed, skid steer, and man lift)\n* Power transformers, load tap changers, potential and current transformers, power circuit breakers, metal-clad switchgear, circuit switchers, disconnect and air break switches, synchronous condensers, and series and shunt capacitors\n* Proper use of transit, surveying practices, and laying out station foundation baselines and elevations\n* Forming, pouring and finishing of concrete\n* Steel and aluminum welding\n* Cutting torch\n* Performance Management System, Corporate policies, Idaho Powers safety Program\n* PC use and basic software\n\nSkills in:\n\n* Strong interpersonal, verbal, and written communication\n* Problem identification\n* Problem solving\n* Troubleshooting\n* Operating test equipment\n* Basic use of personal computers using software applications such as word processing, spreadsheets, databases, and e-mail\n* Organization and time management\n\nAbility to:\n\n* Read and understand station drawings\n* Properly correct and document changes to station drawings\n* Establish and maintain effective working relationships\n* Work in a team environment, as well as independently and be self-motivated and flexible\n* Work with a high degree of accountability\n* Meet established project deadlines\n* Apply established guidelines and use good judgment and initiative in resolving work problems\n* Expected to work increasingly independently as evaluated by the Journeyman and/or Leader\n\nMINIMUM REQUIREMENTS\n\nApprentice\n\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Two years of work experience in an electrical, mechanical, maintenance, operation, or construction field\n\nJourneyman\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Five or more years work experience in an electrical, mechanical, maintenance, operation, or construction field, including at least two years of journey-level experience in substation maintenance or construction\n\nOR\n\n* Completion of a Department of Labor Office of Apprenticeship Substation program\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with an acceptable driving record based on driving requirements for the position\n* Valid DOT medical card or the ability to obtain one prior to hire\n* Valid Class A CDL or the ability to obtain one prior to hire - must obtain Double/Triple Trailers, Tank Vehicles, and Hazardous Materials CDL endorsements within 90 days\n* Certification in Telescopic Boom  Fixed Cab, Telescopic Boom  Swing Cab, Articulating Boom Crane/Load, and Overhead/Bridge Crane within 90 days\n* Must obtain First Aid/CPR card within 90 days\n\nPHYSICAL REQUIREMENTS\nThis position requires lifting up to 170 lbs., carrying up to 120 lbs., pushing up to 100 lbs., and pulling up to 180 lbs. in moving/assembling transformers. Crouching, bending/stooping, and crawling is required occasionally and sometimes in confined spaces.  Kneeling is required frequently.  Climbing of 24 foot ladders and onto transformers/equipment with fall restraint gear is performed occasionally as well as work from an elevated lift with sustained reaching.  Standing/walking is performed frequently, and sitting/driving is required up to 7 hours in duration to access job sites. Job placement is contingent upon successful completion of a pre-employment physical evaluation for the Department of Transportation (DOT) medical certificate. The above is a summary of the primary essential functions of the position. This job may require the performance of additional tasks assigned by company leaders or management. Questions regarding job requirements or accommodation requests should be directed to Human Resources.\n\nADDITIONAL REQUIREMENTS\nImmediately enroll in the Stations Technician Apprenticeship Program. Additional safety related training may be required.\n\nADDITIONAL INFORMATION\nThis position requires extensive travel across Idaho Powers service area.  The work schedule for this position may change week to week.  Typical work schedule includes four 10-hour days, and eight 10-hour days working back-to-back weeks.  Each workday may be an out-of-town, overnight stay.  This position requires the ability to work overtime and weekends when business need requires.\n\nMust abide by Idaho Power Company's safety rules and regulations. Complete required Company and safety training.\n\nCompetencies:\n\nAdaptability, Applied Learning, Communication, Decision Making, Safety Focus, Work Standards",
        "index": 39,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-08T00:12:50.953Z",
        "url": "https://www.internships.com/posting/ccm_13b7c4c4-46e1-4489-96ee-11422507b366",
        "lastScraped": "2021-06-07T00:12:50.953Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 40,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-05-08T00:13:11.258Z",
        "url": "https://www.internships.com/posting/bug_38993149157",
        "lastScraped": "2021-06-07T00:13:11.258Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time",
        "index": 41,
        "skills": [
            "project management",
            "networks",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    }
]