[
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-02-06T03:08:35.533Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-03-08T03:08:35.533Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>",
        "index": 1,
        "skills": [
            "data science",
            "machine learning",
            "python",
            "project management",
            "information technology",
            "artificial intelligence",
            "deep learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Data Science & Software Development (Python) Grad Intern",
        "company": "Apple Industries",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:08:44.897Z",
        "url": "https://www.internships.com/posting/1618dbc7-04d3-46b2-9324-a591ec3d3b3e",
        "lastScraped": "2021-03-08T03:08:44.897Z",
        "description": "<p class=\"ql-align-justify\">We are seeking an exceptional, self-motivated candidate who is eager to learn, innovate, and create something with tangible value for the millions of photo booth customers we have around the globe.  An intern at Apple Industries will have the ability to work on a new internal product that produces data storytelling and visualization of key business insights, sales analysis, and customer analysis with key responsibilities including:&nbsp;&nbsp;</p><p class=\"ql-align-justify\"><br></p><ul><li class=\"ql-align-justify\">Communicate with various teams and customers to understand gaps in business intelligence</li><li class=\"ql-align-justify\">Determine and/or create metrics to solve these gaps given data constraints/availability</li><li class=\"ql-align-justify\">Design and implement algorithms in Python to achieve these metrics</li><li class=\"ql-align-justify\">Create visual presentations of your findings and present directly to Apple Industries Executives</li><li class=\"ql-align-justify\">Ambitious candidates may also design real-time analysis and fraud-detection tools hosted in AWS&nbsp;&nbsp;</li></ul>",
        "index": 2,
        "skills": [
            "data science",
            "data visualization",
            "python",
            "software engineering",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Summer Internship Program",
        "company": "Cronin and Company",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:08:54.003Z",
        "url": "https://www.internships.com/posting/ecaf93d4-abd0-4413-88fb-c98b5c0273dd",
        "lastScraped": "2021-03-08T03:08:54.003Z",
        "description": "<p>Are you a college student or recent grad looking for an internship?&nbsp;Do you have a passion for marketing, social media, PR, or perhaps the business side of a growing marketing agency?&nbsp;Do you want to gain experience with a top shop and add some amazing work to your portfolio and resume?</p><p>A summer internship at Cronin will provide you a hands-on introduction to working at an advertising agency and the opportunity to be immersed in the craft of creating marketing campaigns for clients. Depending on the type of experience you’re looking to gain, you will get the opportunity to work alongside dedicated and passionate professionals in a wide variety of disciplines, including:</p><p><strong>Account Management / Client Services</strong>&nbsp;– Responsible for the management of agency work and relationships with clients.</p><p><strong>Social Media</strong>&nbsp;– Responsible for reviewing competitive trends and developing social media content for clients and the agency.</p><p><strong>Public Relations&nbsp;</strong>– Responsible for the development of PR campaigns and media relations strategies, editing and updating promotional material and publications (brochures, videos, social media posts etc.), and organizing PR events and media coverage. Prepare and distribute press releases</p><p><strong>Business Development</strong>&nbsp;– Responsible for increasing revenues, growth in terms of business expansion, increasing profitability by building strategic partnerships and making strategic business decisions.</p><p><strong>Creative</strong>&nbsp;– Responsible for the design and execution of campaigns that encourage a target audience to buy a company’s products or services. The team is also responsible for creating a consistent brand image for the company through its look, voice, and messaging.</p><p><strong>Video Content&nbsp;</strong>– Responsible for telling stories through video content, editing based on project scope or client needs.</p><p><strong>Digital&nbsp;</strong>– Includes a variety of opportunities for candidates pursuing careers in web development (frontend and backend), digital project management, business/technical requirements/analysis, and quality assurance. Students currently enrolled in a computer science degree program with fundamental software development skills in the following are encouraged to apply: JavaScript, reactive frameworks, Jquery, CSS, HTML, PHP, WordPress or other CMS platforms.</p><p>The intern program will provide hands-on advertising experience and opportunities to contribute to award-winning work and be a respectable addition to your resume or portfolio. Win / win.</p><p><br></p>",
        "index": 3,
        "skills": [
            "project management",
            "javascript",
            "software engineering",
            "web development"
        ],
        "remote": true
    },
    {
        "position": "Intern - Software Development",
        "company": "Pearson",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-08T03:09:03.274Z",
        "url": "https://www.internships.com/posting/bug_38956905336",
        "lastScraped": "2021-03-08T03:09:03.274Z",
        "description": "Job Details\n\n*\n\nIntern  Software Development\n\nJob Code Number\n\n11546421\n\nJob Description\n\nIntern  Software Development  ( 2102777 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nSoftware Development\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nParticipate in the Development LifeCycle activities by being part of our development team during our Fall BTS Releases to Production and future planning\n\n*\n\nWork with several cross functional teams including Product Management, Developers, Architects, and Quality Engineers\n\n*\n\nSupport Automation of new product deployment verification.\n\n*\n\nParticipate in Proof of Concept creation to be leveraged for future development plans\n\n*\n\nLearn Pearson's Engineering Best Practices on our flagship Higher Education products\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr . This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Regular\n\nReq ID: 2102777\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 4,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "java",
            "machine learning",
            "information technology",
            "react"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-02-06T03:09:12.465Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-03-08T03:09:12.465Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>",
        "index": 5,
        "skills": [
            "data science",
            "machine learning",
            "python",
            "project management",
            "information technology",
            "artificial intelligence",
            "deep learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Development",
        "company": "Pearson",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-08T03:09:21.585Z",
        "url": "https://www.internships.com/posting/bug_38956905336",
        "lastScraped": "2021-03-08T03:09:21.585Z",
        "description": "Job Details\n\n*\n\nIntern  Software Development\n\nJob Code Number\n\n11546421\n\nJob Description\n\nIntern  Software Development  ( 2102777 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nSoftware Development\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nParticipate in the Development LifeCycle activities by being part of our development team during our Fall BTS Releases to Production and future planning\n\n*\n\nWork with several cross functional teams including Product Management, Developers, Architects, and Quality Engineers\n\n*\n\nSupport Automation of new product deployment verification.\n\n*\n\nParticipate in Proof of Concept creation to be leveraged for future development plans\n\n*\n\nLearn Pearson's Engineering Best Practices on our flagship Higher Education products\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr . This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Regular\n\nReq ID: 2102777\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 6,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "java",
            "machine learning",
            "information technology",
            "react"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Development",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:09:31.034Z",
        "url": "https://www.internships.com/posting/bug_38955992253",
        "lastScraped": "2021-03-08T03:09:31.034Z",
        "description": "Job Information\n\nPearson Intern - Software Development in St. Paul, Minnesota\n\nIntern - Software Development - ( 2102777 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nSoftware Development\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nParticipate in the Development LifeCycle activities by being part of our development team during our Fall BTS Releases to Production and future planning\n\n*\n\nWork with several cross functional teams including Product Management, Developers, Architects, and Quality Engineers\n\n*\n\nSupport Automation of new product deployment verification.\n\n*\n\nParticipate in Proof of Concept creation to be leveraged for future development plans\n\n*\n\nLearn Pearson's Engineering Best Practices on our flagship Higher Education products\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr . This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Regular\n\nReq ID: 2102777",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:09:40.415Z",
        "url": "https://www.internships.com/posting/bug_38956592527",
        "lastScraped": "2021-03-08T03:09:40.415Z",
        "description": "Job Information\n\nPearson Intern - Software Engineer in St. Paul, Minnesota\n\nIntern - Software Engineer - ( 2102484 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards under the guidance of software engineer\n\n*\n\nFollows the Pearson practices and processes.\n\n*\n\nEscalates and communicates issues, risks, and concerns to the mentor\n\n*\n\nMakes effective use of engineering tools and technologies\n\n*\n\nBuilds competencies in product and technology domain to the desired level.\n\n*\n\nAligns self to organizational goals.\n\n*\n\nAdhere to Pearson values and ethical practices.\n\n*\n\nMaintains a sense of individuality in thinking and decision making.\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102484",
        "index": 8,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:09:49.972Z",
        "url": "https://www.internships.com/posting/bug_38956592527",
        "lastScraped": "2021-03-08T03:09:49.972Z",
        "description": "Job Information\n\nPearson Intern - Software Engineer in St. Paul, Minnesota\n\nIntern - Software Engineer - ( 2102484 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards under the guidance of software engineer\n\n*\n\nFollows the Pearson practices and processes.\n\n*\n\nEscalates and communicates issues, risks, and concerns to the mentor\n\n*\n\nMakes effective use of engineering tools and technologies\n\n*\n\nBuilds competencies in product and technology domain to the desired level.\n\n*\n\nAligns self to organizational goals.\n\n*\n\nAdhere to Pearson values and ethical practices.\n\n*\n\nMaintains a sense of individuality in thinking and decision making.\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102484",
        "index": 9,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-02-06T03:09:59.348Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-03-08T03:09:59.348Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>",
        "index": 10,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Intern - Cloud Engineer",
        "company": "Pearson",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-08T03:10:08.555Z",
        "url": "https://www.internships.com/posting/bug_38956916505",
        "lastScraped": "2021-03-08T03:10:08.555Z",
        "description": "Job Details\n\n*\n\nIntern  Cloud Engineer\n\nJob Code Number\n\n11546422\n\nJob Description\n\nIntern  Cloud Engineer  ( 2102485 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nCloud Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\n*\n\nDeveloping software to support managing Pearson's AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party API's\n\n*\n\nPython and Go development in support of these API's\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102485\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Software Development Engineer Internship - Directory Services",
        "company": "Smartsheet",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-03-08T03:10:19.003Z",
        "url": "https://www.internships.com/posting/bug_38953040893",
        "lastScraped": "2021-03-08T03:10:19.003Z",
        "description": "Job Information\n\nSmartsheet Software Development Engineer Internship - Directory Services in Honolulu, Hawaii\n\nSoftware Development Engineer Internship - Directory Services\n\nSoftware Development Engineer Internship - Directory Services Team\n\nThe Directory Services team builds capabilities that allow IT and Administrators to manage and govern their Smartsheet accounts at scale. We are challenged to improve our systems to make identity and access management easier and efficient for Administrators. One of the ways we accomplish this is to build integrations with third-party identity providers.You willhelp enhance these integration capabilities and work with our team of Software Development Engineers and product manager.\n\nYou will be a remote employee who will report to an Engineering Leader, based out of our Bellevue, WA office. This is a full-time internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nParticipate in the entire development life cycle, from requirements to release\n\n2.\n\nParticipate in requirements gathering\n\n3.\n\nDesign, develop and test the solution\n\n4.\n\nDeploy the code to production\n\n5.\n\nLead our internship Summer Project\n\nYou have:\n\n1.\n\nComputer Science degree or equivalent\n\n2.\n\nCompetency in a software development language (Java preferred)\n\n3.\n\nFamiliarity in building applications\n\n4.\n\nFamiliarity with JUnit test frameworks\n\n5.\n\nFamiliarity with REST APIs and micro services\n\n6.\n\nFamiliarity with SaaS apps and cloud hosted stacks\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. Were looking for people who are driven, authentic, supportive, effective, and honest. Youre encouraged to apply even if your experience doesnt precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who arent afraid to be innovativejoin us!\n\nDepartment\n\nEngineering - Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field",
        "index": 12,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Quality Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:10:28.783Z",
        "url": "https://www.internships.com/posting/bug_38956575513",
        "lastScraped": "2021-03-08T03:10:28.783Z",
        "description": "Job Information\n\nPearson Intern - Machine Learning Quality Engineer in St. Paul, Minnesota\n\nIntern - Machine Learning Quality Engineer - ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, time-series analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearsons customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearsons customers\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, self-directed, self-motivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102488",
        "index": 13,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Cloud Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:10:37.945Z",
        "url": "https://www.internships.com/posting/bug_38955955058",
        "lastScraped": "2021-03-08T03:10:37.945Z",
        "description": "Job Information\n\nPearson Intern - Cloud Engineer in St. Paul, Minnesota\n\nIntern - Cloud Engineer - ( 2102485 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nCloud Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\n*\n\nDeveloping software to support managing Pearsons AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party APIs\n\n*\n\nPython and Go development in support of these APIs\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102485",
        "index": 14,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Cloud Engineer",
        "company": "Pearson",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-08T03:10:47.209Z",
        "url": "https://www.internships.com/posting/bug_38956916505",
        "lastScraped": "2021-03-08T03:10:47.209Z",
        "description": "Job Details\n\n*\n\nIntern  Cloud Engineer\n\nJob Code Number\n\n11546422\n\nJob Description\n\nIntern  Cloud Engineer  ( 2102485 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nCloud Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\n*\n\nDeveloping software to support managing Pearson's AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party API's\n\n*\n\nPython and Go development in support of these API's\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102485\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 15,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Systems Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:10:56.595Z",
        "url": "https://www.internships.com/posting/bug_38956956501",
        "lastScraped": "2021-03-08T03:10:56.595Z",
        "description": "Job Information\n\nPearson Intern - Software Systems Engineer in St. Paul, Minnesota\n\nIntern - Software Systems Engineer - ( 2102486 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Systems Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nDeveloping software to support managing Pearsons AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party APIs\n\n*\n\nPython and Go development in support of these APIs\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nHelp build the Service Delivery platform, to setup, enhance and maintain application services like load balancing, security controls and traffic management.\n\n*\n\nBuild automation to setup and maintain monitoring, logging, distributed tracing, metrics &amp; reporting systems for fine-grained observability and actionable alerts\n\n*\n\nLeverage AWS machine learning and Artificial Intelligence capabilities to analyze system metrics and customer traffic to build intelligent alerts and state of the art Dashboards.\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Python , Excel, SQL, AWS, Java, Go, , R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102486",
        "index": 16,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "sql",
            "java",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Summer - Saas Operations Intern",
        "company": "Workiva Inc",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-03-08T03:11:11.746Z",
        "url": "https://www.internships.com/posting/bug_38953842159",
        "lastScraped": "2021-03-08T03:11:11.746Z",
        "description": "Summer 2021 - SaaS Operations Intern\n\nJob Summary\nThe SaaS Operations Intern assists with Workiva's internal use SaaS applications. This person is responsible for helping maintain current SaaS applications to ensure they are running properly. The SaaS Operations Intern improves current SaaS systems by assisting with administration and automation. This person also assists with evaluating new SaaS systems by participating in requirements analysis and working with internal teams to recommend specific systems to meet their needs.\n\nResponsibilities\nAdminister and Maintain SaaS Systems:\n\n* Provide Tier 1 SaaS support and administration\n* Update and adhere to standard operating procedures (SOPs)\n* Conduct audits on existing systems by running reports and providing analyses of outputs\n\nImprove current SaaS systems:\n\n* Act as IT liaison to improve user experience and value in our software\n* Champion efficiency, automation, and best practices\n* Find ways to automate and scale current SaaS software applications\n\nnbsp; nbsp;\nEvaluate SaaS systems:\n\n* Partner with SaaS Operations and Portfolio Management teams to conduct fact-finding activities with internal teams to understand how SaaS software is being utilized and how to add more value\n* Supports evaluation of current SaaS portfolio to determine if a new application can replace multiple existing applications\n* Assess risks of new applications and provide recommendations based on assessment\n\nWhat You'll Need\nSkills\n\n* Strong customer service orientation\n* Proven analytical and problem-solving abilities\n* Ability to effectively prioritize and execute tasks in a high-pressure environment\n* Skilled at working within a dynamic, team-oriented, collaborative environment\n* Strong interpersonal and oral communication skills\n* Adept at reading, writing, and interpreting technical documentation and procedure manuals\n* Well-honed research skills\n* Ability to present ideas and solutions in user-friendly language\n* Highly self-motivated and directed\n* Keen attention to detail\n* Critical thinking skills\n\nExperience\n\n* Technical knowledge of current SaaS applications, a plus\n* Track record of technical configuration, process, and change documentation\n\nEducation\n\n* Currently pursuing an undergraduate or higher degree in Computer Science, Management Information Systems, or a related field.\n\nWorking Conditions amp; Physical Requirements\n\n* Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nColorado Pay Rate: $22 per hour\n\nWhere You#x2019;ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we#x2019;ve created.\n\n*\n\nCustomer Success:nbsp; Always delight our customers.\n\n*\n\nTrust: Rely on each other.nbsp;\n\n*\n\nIntegrity: Do the right thing, every time.nbsp;\n\n*\n\nCollaboration: Share resources and work together.nbsp;\n\n*\n\nInnovation: Keep creating solutions and finding better ways.nbsp;\n\n*\n\nInclusion: Support a diverse community where we all belong.nbsp;\n\n*\n\nAccountability: Be responsible for your success and failure.\n\nnbsp;\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need#x2014;backed by our culture of collaboration and diverse thought#x2014;to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today#x2019;s most challenging problems.\n\nAt Workiva, You#x2019;ll Enjoy:nbsp;\n\n*\n\nIntern Environment: Workiva was ranked a top 100 internship program by WayUp and ranked #58 in Best Places to Work for a reason! Our interns have the opportunity to participate in mentoring, professional development, networking, and flexible hours during their internship. We continually strive to provide numerous resources to build not just excellent interns, but excellent business professionals.nbsp;\n\n*\n\nReal Work Experience: Workiva interns are treated as full-time employees and are allowed the freedom to contribute to real work that truly impacts Workiva and it#x2019;s operations. From writing code in our production environment to directly supporting our customers' on our newest platform, our interns play a vital role in our company!nbsp;nbsp;\n\n*\n\nFantastic Perks: Being an intern at Workiva has benefits beyond just a paycheck. You can#x2019;t beat the wellness discounts, 401k participation, casual dress environment and countless other perks that Workiva offers!nbsp;\n\n*\n\nInvolvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more.\n\nIntern Video: https://youtu.be/LIxhabEk8Ao\n\nLearn more: https://www.linkedin.com/company/workiva/life/\n\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer.nbsp; We believe that great minds think differently.nbsp; We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation.nbsp; Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.nbsp;nbsp;\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com.nbsp;\n\nPosted 3 Days AgoPart timeR1411\n\nCURRENT EMPLOYEES:Internal applicants will need to apply for open positions through their Workday account. Click on the quot;Careersquot; worklet and complete the internal application. For questions, please contact the recruiter listed on the open position. #x200b;\n\nWe founded Workiva to transform the way people manage and report business data with various collaborators, data sources, documents, and spreadsheets. Today, people all over the world use our platform to seamlessly orchestrate data among their systems and applications for transparent and trusted connected reporting and compliance.",
        "index": 17,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "talentacquisition@workiva.com",
        "remote": true
    },
    {
        "position": "EPA Bioinformatics and Data Science Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T03:11:20.966Z",
        "url": "https://www.internships.com/posting/cd96c04d-fdc4-4866-bab7-cece8611268c",
        "lastScraped": "2021-03-08T03:11:20.966Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Biomolecular &amp; Computational Toxicology Division (BCTD) located in Research Triangle Park, North Carolina.</p><p><br></p><p>The EPA&nbsp;CCTE is responsible for developing new experimental models that can be used to evaluate the potential for chemicals to produce adverse effects on human and ecological health for improving environmental risk assessments and regulatory decisions pertaining to chemical safety and sustainability.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This project aims to develop computational models to predict the safety of chemicals without running tests on whole animals. The tools to be used include high-throughput transcriptomic screening data across multiple cell lines, databases of previously run animal studies, data from other in vitro high-throughput screening experiments, data and models for in vitro to in vivo extrapolation of dose, and outputs of various predictive models of chemical action. The project integrates bioinformatics, data science, software engineering, applied statistics, and predictive mathematical modeling, with the broader goal of advancing safety assessment using new approach methodologies.</p><p><br></p><p>Under the guidance of a mentor, the research participant will learn to develop novel bioinformatics and biostatistics applications to integrate multiple data streams relevant to toxicological testing, including transcriptomics, biochemical assays, and other high-throughput screening methods. Research activities may include:</p><ol><li>Helping develop models to predict toxicological outcomes of animal testing from in vitro assays</li><li>Helping develop&nbsp;a data science infrastructure to simulate outcomes of tiered testing strategies that combine multiple in vitro screening methods</li><li>Learning how to curate and manage large-scale heterogeneous chemical safety screening data</li><li>Evaluating additional methods to integrate data across screening studies.</li></ol><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>This is a research training opportunity where in the candidate will gain education and training in the general areas of bioinformatics data science, transcriptomics, computational toxicology, and mathematical modeling in preparation for future career opportunities across government, industry, and academic sectors.</p><p><br></p><p>The research participant may also&nbsp;author or co-author on peer-reviewed publications, and present at local and national meetings. The participant will be a member of a multi-disciplinary research team.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity&nbsp;are&nbsp;Katie Paul-Friedman (paul-friedman.katie@epa.gov) and Logan Everett (Everett.logan@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 18,
        "skills": [
            "data science",
            "project management",
            "bioinformatics",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Summer - Saas Operations Intern",
        "company": "Workiva Inc",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-03-08T03:11:30.193Z",
        "url": "https://www.internships.com/posting/bug_38953842159",
        "lastScraped": "2021-03-08T03:11:30.193Z",
        "description": "Summer 2021 - SaaS Operations Intern\n\nJob Summary\nThe SaaS Operations Intern assists with Workiva's internal use SaaS applications. This person is responsible for helping maintain current SaaS applications to ensure they are running properly. The SaaS Operations Intern improves current SaaS systems by assisting with administration and automation. This person also assists with evaluating new SaaS systems by participating in requirements analysis and working with internal teams to recommend specific systems to meet their needs.\n\nResponsibilities\nAdminister and Maintain SaaS Systems:\n\n* Provide Tier 1 SaaS support and administration\n* Update and adhere to standard operating procedures (SOPs)\n* Conduct audits on existing systems by running reports and providing analyses of outputs\n\nImprove current SaaS systems:\n\n* Act as IT liaison to improve user experience and value in our software\n* Champion efficiency, automation, and best practices\n* Find ways to automate and scale current SaaS software applications\n\nnbsp; nbsp;\nEvaluate SaaS systems:\n\n* Partner with SaaS Operations and Portfolio Management teams to conduct fact-finding activities with internal teams to understand how SaaS software is being utilized and how to add more value\n* Supports evaluation of current SaaS portfolio to determine if a new application can replace multiple existing applications\n* Assess risks of new applications and provide recommendations based on assessment\n\nWhat You'll Need\nSkills\n\n* Strong customer service orientation\n* Proven analytical and problem-solving abilities\n* Ability to effectively prioritize and execute tasks in a high-pressure environment\n* Skilled at working within a dynamic, team-oriented, collaborative environment\n* Strong interpersonal and oral communication skills\n* Adept at reading, writing, and interpreting technical documentation and procedure manuals\n* Well-honed research skills\n* Ability to present ideas and solutions in user-friendly language\n* Highly self-motivated and directed\n* Keen attention to detail\n* Critical thinking skills\n\nExperience\n\n* Technical knowledge of current SaaS applications, a plus\n* Track record of technical configuration, process, and change documentation\n\nEducation\n\n* Currently pursuing an undergraduate or higher degree in Computer Science, Management Information Systems, or a related field.\n\nWorking Conditions amp; Physical Requirements\n\n* Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nColorado Pay Rate: $22 per hour\n\nWhere You#x2019;ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we#x2019;ve created.\n\n*\n\nCustomer Success:nbsp; Always delight our customers.\n\n*\n\nTrust: Rely on each other.nbsp;\n\n*\n\nIntegrity: Do the right thing, every time.nbsp;\n\n*\n\nCollaboration: Share resources and work together.nbsp;\n\n*\n\nInnovation: Keep creating solutions and finding better ways.nbsp;\n\n*\n\nInclusion: Support a diverse community where we all belong.nbsp;\n\n*\n\nAccountability: Be responsible for your success and failure.\n\nnbsp;\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need#x2014;backed by our culture of collaboration and diverse thought#x2014;to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today#x2019;s most challenging problems.\n\nAt Workiva, You#x2019;ll Enjoy:nbsp;\n\n*\n\nIntern Environment: Workiva was ranked a top 100 internship program by WayUp and ranked #58 in Best Places to Work for a reason! Our interns have the opportunity to participate in mentoring, professional development, networking, and flexible hours during their internship. We continually strive to provide numerous resources to build not just excellent interns, but excellent business professionals.nbsp;\n\n*\n\nReal Work Experience: Workiva interns are treated as full-time employees and are allowed the freedom to contribute to real work that truly impacts Workiva and it#x2019;s operations. From writing code in our production environment to directly supporting our customers' on our newest platform, our interns play a vital role in our company!nbsp;nbsp;\n\n*\n\nFantastic Perks: Being an intern at Workiva has benefits beyond just a paycheck. You can#x2019;t beat the wellness discounts, 401k participation, casual dress environment and countless other perks that Workiva offers!nbsp;\n\n*\n\nInvolvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more.\n\nIntern Video: https://youtu.be/LIxhabEk8Ao\n\nLearn more: https://www.linkedin.com/company/workiva/life/\n\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer.nbsp; We believe that great minds think differently.nbsp; We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation.nbsp; Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.nbsp;nbsp;\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com.nbsp;\n\nPosted 3 Days AgoPart timeR1411\n\nCURRENT EMPLOYEES:Internal applicants will need to apply for open positions through their Workday account. Click on the quot;Careersquot; worklet and complete the internal application. For questions, please contact the recruiter listed on the open position. #x200b;\n\nWe founded Workiva to transform the way people manage and report business data with various collaborators, data sources, documents, and spreadsheets. Today, people all over the world use our platform to seamlessly orchestrate data among their systems and applications for transparent and trusted connected reporting and compliance.",
        "index": 19,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "talentacquisition@workiva.com",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Engineer",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:11:39.497Z",
        "url": "https://www.internships.com/posting/bug_38956950015",
        "lastScraped": "2021-03-08T03:11:39.497Z",
        "description": "Job Information\n\nPearson Intern - Machine Learning Engineer in St. Paul, Minnesota\n\nIntern - Machine Learning Engineer - ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, time-series analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearsons customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearsons customers\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, self-directed, self-motivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102488",
        "index": 20,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "EPA Exposure Pathway Modeling Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T03:11:49.159Z",
        "url": "https://www.internships.com/posting/b9e3fa77-6d2f-44ee-897b-ed9bf314a9e5",
        "lastScraped": "2021-03-08T03:11:49.159Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The EPA Center for Computational Toxicology and Exposure (CCTE) is responsible for developing new computational tools and providing quantitative analysis for improving public health and environmental risk assessments and regulatory decisions pertaining to chemical safety. Throughout the course of this project, the&nbsp;participant will collaborate with a CCTE team developing computational tools (including mechanistic and statistical models) to predict population estimates of human exposures and doses to thousands of existing and emerging chemicals in commerce. This research project will focus on characterizing exposure pathways for which predictive data or models are lacking (e.g., via ambient pathways such as via chemicals in biosolids, or occupational pathways). The models and data developed by the participant will inform EPA consensus models for these pathways.&nbsp;</p><p><br></p><p>Under the guidance of a mentor, the research participant may be involved in the following research activities:</p><ul><li>Analyzing innovative data describing how individuals come into contact with chemicals (such as information on chemical use and sources or activities relevant to the pathways in questions).&nbsp;</li><li>Analyzing, modeling, and interpreting measurement data describing chemical concentrations measured in field studies of human exposure, including concentrations measured in occupational media.&nbsp;&nbsp;</li><li>Assisting in the development of&nbsp;computational models/algorithms of chemical fate, transport, or exposure processes for priority exposure pathways.</li><li>Parameterizing and running existing or newly developed models for various chemicals, and interpret and summarize results</li><li>Performing reviews of literature or other available data for identifying measurements for evaluating exposure model algorithms and results.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will collaborate with an integrated team of agency scientists towards generating critical research hypotheses, developing programmatic tools to test these hypotheses, and ultimately solving complex environmental health problems. Through this research training opportunity, the research participant will have the opportunity develop their programming, analytical, and communication skills.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Kristin Isaacs (isaacs.kristin@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 21,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-02-06T03:11:58.963Z",
        "url": "https://www.internships.com/posting/ccm_13b7c4c4-46e1-4489-96ee-11422507b366",
        "lastScraped": "2021-03-08T03:11:58.963Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 22,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Exposure Pathway Modeling Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T03:12:08.376Z",
        "url": "https://www.internships.com/posting/b9e3fa77-6d2f-44ee-897b-ed9bf314a9e5",
        "lastScraped": "2021-03-08T03:12:08.376Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The EPA Center for Computational Toxicology and Exposure (CCTE) is responsible for developing new computational tools and providing quantitative analysis for improving public health and environmental risk assessments and regulatory decisions pertaining to chemical safety. Throughout the course of this project, the&nbsp;participant will collaborate with a CCTE team developing computational tools (including mechanistic and statistical models) to predict population estimates of human exposures and doses to thousands of existing and emerging chemicals in commerce. This research project will focus on characterizing exposure pathways for which predictive data or models are lacking (e.g., via ambient pathways such as via chemicals in biosolids, or occupational pathways). The models and data developed by the participant will inform EPA consensus models for these pathways.&nbsp;</p><p><br></p><p>Under the guidance of a mentor, the research participant may be involved in the following research activities:</p><ul><li>Analyzing innovative data describing how individuals come into contact with chemicals (such as information on chemical use and sources or activities relevant to the pathways in questions).&nbsp;</li><li>Analyzing, modeling, and interpreting measurement data describing chemical concentrations measured in field studies of human exposure, including concentrations measured in occupational media.&nbsp;&nbsp;</li><li>Assisting in the development of&nbsp;computational models/algorithms of chemical fate, transport, or exposure processes for priority exposure pathways.</li><li>Parameterizing and running existing or newly developed models for various chemicals, and interpret and summarize results</li><li>Performing reviews of literature or other available data for identifying measurements for evaluating exposure model algorithms and results.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will collaborate with an integrated team of agency scientists towards generating critical research hypotheses, developing programmatic tools to test these hypotheses, and ultimately solving complex environmental health problems. Through this research training opportunity, the research participant will have the opportunity develop their programming, analytical, and communication skills.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Kristin Isaacs (isaacs.kristin@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 23,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "EPA Postdoctoral Fellowship in Bioinformatics and Computational Toxicology",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T03:12:18.021Z",
        "url": "https://www.internships.com/posting/e57e2a5a-096b-4232-87b3-bb630ca8a4fb",
        "lastScraped": "2021-03-08T03:12:18.021Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>Two research opportunities are&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE),&nbsp;Great Lakes Toxicology&nbsp;&amp;&nbsp;Ecology Division (GLTED) located in Research Triangle Park, North Carolina or Cincinnati, Ohio.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The Agency is faced with significant challenges related to characterizing the modes of action of chemicals, the effects of exposures to mixtures of chemicals, and in finding ways to group chemicals that facilitates read-across from data rich to data poor chemicals.&nbsp;The Molecular Indicators Branch within the Office of Research and Development is addressing these challenges through the characterization of molecular responses in aquatic organisms exposed to chemicals.&nbsp;In large part, MIB targets transcriptomic and epigenetic responses using next generation sequencing (NGS)-based tools (RNA-seq, reduced representation bisulfite sequencing - RRBS) to develop biomarkers that can discriminate chemical classes and provide an understanding of impacted biological processes and pathways.&nbsp;There are also opportunities to explore and analyze other omics data including metabolomic and proteomic data from whole animal responses and multigenerational studies.&nbsp;The research participant will be part of a team involved in designing of laboratory experiments, NGS data analysis and data interpretation, design and development of new statistical methods for integrated omics data analysis, and in the communication of results intra- and extramurally.&nbsp;The research participant will be trained in molecular genetics, bioinformatics, statistics, machine learning algorithms for big data analytics, and advanced statistical analysis of complex omics data sets.</p><p><br></p><p>With guidance from the mentor, the research participant may be involved in the following training activities:</p><ul><li>Learning how to develop statistical methods and tools to analyze NGS-based gene expression and epigenetic data</li><li>Learning how to design analysis pipelines and perform analysis of RNA-seq, RRBS, other omics environmental exposure data</li><li>Providing biological context and interpretation of NGS data to characterize chemical MOA</li><li>Applying machine learning algorithms for identification of biomarkers and classification of environmental toxicants</li><li>Contributing to the preparation of peer-reviewed journal articles and disseminating research results to project partners, stakeholders, and the research community</li><li>Presenting research at regional, national, and/or international conferences and workshops</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will be afforded the opportunity to interact with internationally recognized leaders, both within and outside the EPA, the area of bioinformatics and in ecotoxicogenomics.&nbsp;The research participant will have the opportunity to contribute to and to publish original research. This training opportunity will provide an early career scientist with knowledge, skills, and abilities needed to apply new technologies and associated data to regulatory decision-making at the local, national, or international scale and to pursue a professional career in life sciences research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Weichun Huang&nbsp;(huang.weichun@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed three to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 24,
        "skills": [
            "machine learning",
            "bioinformatics",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-02-06T03:12:29.944Z",
        "url": "https://www.internships.com/posting/ccm_95b5ee54-01bf-4c11-a351-eb453bd3c788",
        "lastScraped": "2021-03-08T03:12:29.944Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 25,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Software Engineer Intern",
        "company": "Storj Labs",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:12:42.217Z",
        "url": "https://www.internships.com/posting/d16517e4-333d-4a61-ba79-36137d9aa031",
        "lastScraped": "2021-03-08T03:12:42.217Z",
        "description": "<p><strong>Storj Overview</strong></p><p><br></p><p><span>Storj is pioneering decentralized cloud storage with the world's first decentralized cloud storage network. We make object storage secure, private, and more resilient than other leading cloud storage providers. Our mission is to enable the decentralized future, and our vision is to be the storage layer for the decentralized internet. To do this, we need talented individuals who are equipped to succeed. With that in mind, we are excited to launch our 2021 Internship Program. The program will be 12 weeks long, starting in May 2021, and will place interns on teams to work with experienced engineers. This is a part-time role at 25 hours per week paid at a rate of $43 an hour.</span></p><p>&nbsp;</p><p><span>Though originally founded and headquartered in Atlanta, Storj is a remote-first company with team members worldwide. We’ve built a culture based on transparency, inclusion, and open communication, and we ensure that our team is equipped to succeed. Our people are our most important asset, and we strive to provide them with meaningful professional engagement. Storj promotes empowerment and progress through company-wide and personal training opportunities, proactive diversity efforts, and peer mentorship.&nbsp;</span></p><p>&nbsp;</p><p><span>In this vein of ownership and personal growth, you’ll have the opportunity to choose the team you’ll work with during your internship. Here are some of the teams who would love to work with you:</span></p><p>&nbsp;</p><ul><li><span>Growth Engineering -- </span>The Growth Engineering team focuses on improving the onboarding flow and experience of those interacting with the Storj network to store and download files. This includes components such as the website (Webflow), the Satellite web app (Go, VueJS, TypeScript, GraphQL), and the website's reverse proxy (Go, Caddy). This team will be ideal for people interested in front and backend development, as well as user research.</li></ul><p><br></p><ul><li><span>Infrastructure -- The Infrastructure team manages, monitors, and scales a complex and performant distributed system, spanning both on-premise and cloud-hosted infrastructure. We move fast, and we’re always disaster planning for when things will inevitably fail (re: multi-region, fault tolerance, high availability, etc.)</span></li></ul><p>&nbsp;</p><p><span>In addition to the work on your chosen team, you’ll have ample opportunities and resources to broaden your understanding of potential career paths, how teams work cross-functionally, the infrastructure and inner-operations of a growing company, and more, including:</span></p><p>&nbsp;</p><ul><li><span>Executive Lunch ‘N Learns</span></li><li><span>Cross-functional job shadowing</span></li><li><span>Intern presentations during bi-weekly all-company updates</span></li><li><span>Participation in the Storj Diversity, Equity, and Inclusion Council</span></li></ul><p><br></p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><ul><li><span>Reading code and design docs</span></li><li><span>Taking assigned tickets and working to solve problems involving:</span></li><li class=\"ql-indent-1\"><span>Writing code or tests</span></li><li class=\"ql-indent-1\"><span>Designing systems</span></li><li class=\"ql-indent-1\"><span>Performing operations</span></li><li class=\"ql-indent-1\"><span>Research</span></li><li class=\"ql-indent-1\"><span>Documentation</span></li><li><span>Reviewing code from your team, providing feedback and suggestions</span></li><li><span>Attending weekly meetings with your team of engineers</span></li><li><span>Reporting on your progress to your team lead and others</span></li></ul><p><br></p><p><br></p><p><strong>Must-Haves:</strong></p><p><br></p><ul><li><span>We will consider anyone from the following groups: students currently pursuing a degree in Computer Science, recent graduates of coding boot camps, people seeking to reenter the workforce following a sabbatical from work</span></li><li><span>Knowledge of computer science with experience building meaningful software applications in a class, as a personal hobby, as a job, or as part of an open source project</span></li><li><span>Experience in one or more programming languages or markup languages</span><em> OR</em><span> experience in one or more of the following tools/platforms: Kubernetes, Systemd, Docker, etc.</span></li></ul><p><br></p><p><br></p><p><strong>Our Commitment to Diversity, Equity, &amp; Inclusion:</strong></p><p><br></p><p><span>At Storj Labs, we celebrate diversity and strive for an inclusive work culture. More than a statement on our careers page, these concepts are ingrained in our core values:</span></p><p><br></p><p><strong>Secure</strong><span> - We believe security and privacy in product, process, and habit is key to everything we do.</span></p><p><br></p><p><strong>Together</strong><span> - We inspire, execute, and celebrate as one team, with a commitment to trust, inclusion, collaboration, and accountability.</span></p><p><br></p><p><strong>Open</strong><span> - We’re committed to the free and open sharing of software, information, knowledge, and ideas.</span></p><p><br></p><p><strong>Resolute</strong><span> - We have the courage to do the right thing, even if it is not the easy thing. We resolve always to treat others ethically, with empathy, understanding, and trust.</span></p><p><br></p><p><strong>Empowered</strong><span> - We empower our users to control their data, our teammates to do great work, and our community to build economic value.</span></p><p><br></p><p><strong>Different</strong><span> - We think differently, act differently, and always strive to make a difference.</span></p><p><br></p><p><span>We don’t make hiring or employment decisions on the basis of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other basis protected by applicable local, state or federal law. We also consider for employment qualified applicants with arrest and conviction records in a manner consistent with San Francisco’s Fair Chance Ordinance and similar local laws.</span></p><p><br></p><p><br></p>",
        "index": 26,
        "skills": [
            "project management",
            "software engineering",
            "networks",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Software Engineer Intern",
        "company": "Storj Labs",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:12:54.098Z",
        "url": "https://www.internships.com/posting/d16517e4-333d-4a61-ba79-36137d9aa031",
        "lastScraped": "2021-03-08T03:12:54.098Z",
        "description": "<p><strong>Storj Overview</strong></p><p><br></p><p><span>Storj is pioneering decentralized cloud storage with the world's first decentralized cloud storage network. We make object storage secure, private, and more resilient than other leading cloud storage providers. Our mission is to enable the decentralized future, and our vision is to be the storage layer for the decentralized internet. To do this, we need talented individuals who are equipped to succeed. With that in mind, we are excited to launch our 2021 Internship Program. The program will be 12 weeks long, starting in May 2021, and will place interns on teams to work with experienced engineers. This is a part-time role at 25 hours per week paid at a rate of $43 an hour.</span></p><p>&nbsp;</p><p><span>Though originally founded and headquartered in Atlanta, Storj is a remote-first company with team members worldwide. We’ve built a culture based on transparency, inclusion, and open communication, and we ensure that our team is equipped to succeed. Our people are our most important asset, and we strive to provide them with meaningful professional engagement. Storj promotes empowerment and progress through company-wide and personal training opportunities, proactive diversity efforts, and peer mentorship.&nbsp;</span></p><p>&nbsp;</p><p><span>In this vein of ownership and personal growth, you’ll have the opportunity to choose the team you’ll work with during your internship. Here are some of the teams who would love to work with you:</span></p><p>&nbsp;</p><ul><li><span>Growth Engineering -- </span>The Growth Engineering team focuses on improving the onboarding flow and experience of those interacting with the Storj network to store and download files. This includes components such as the website (Webflow), the Satellite web app (Go, VueJS, TypeScript, GraphQL), and the website's reverse proxy (Go, Caddy). This team will be ideal for people interested in front and backend development, as well as user research.</li></ul><p><br></p><ul><li><span>Infrastructure -- The Infrastructure team manages, monitors, and scales a complex and performant distributed system, spanning both on-premise and cloud-hosted infrastructure. We move fast, and we’re always disaster planning for when things will inevitably fail (re: multi-region, fault tolerance, high availability, etc.)</span></li></ul><p>&nbsp;</p><p><span>In addition to the work on your chosen team, you’ll have ample opportunities and resources to broaden your understanding of potential career paths, how teams work cross-functionally, the infrastructure and inner-operations of a growing company, and more, including:</span></p><p>&nbsp;</p><ul><li><span>Executive Lunch ‘N Learns</span></li><li><span>Cross-functional job shadowing</span></li><li><span>Intern presentations during bi-weekly all-company updates</span></li><li><span>Participation in the Storj Diversity, Equity, and Inclusion Council</span></li></ul><p><br></p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><ul><li><span>Reading code and design docs</span></li><li><span>Taking assigned tickets and working to solve problems involving:</span></li><li class=\"ql-indent-1\"><span>Writing code or tests</span></li><li class=\"ql-indent-1\"><span>Designing systems</span></li><li class=\"ql-indent-1\"><span>Performing operations</span></li><li class=\"ql-indent-1\"><span>Research</span></li><li class=\"ql-indent-1\"><span>Documentation</span></li><li><span>Reviewing code from your team, providing feedback and suggestions</span></li><li><span>Attending weekly meetings with your team of engineers</span></li><li><span>Reporting on your progress to your team lead and others</span></li></ul><p><br></p><p><br></p><p><strong>Must-Haves:</strong></p><p><br></p><ul><li><span>We will consider anyone from the following groups: students currently pursuing a degree in Computer Science, recent graduates of coding boot camps, people seeking to reenter the workforce following a sabbatical from work</span></li><li><span>Knowledge of computer science with experience building meaningful software applications in a class, as a personal hobby, as a job, or as part of an open source project</span></li><li><span>Experience in one or more programming languages or markup languages</span><em> OR</em><span> experience in one or more of the following tools/platforms: Kubernetes, Systemd, Docker, etc.</span></li></ul><p><br></p><p><br></p><p><strong>Our Commitment to Diversity, Equity, &amp; Inclusion:</strong></p><p><br></p><p><span>At Storj Labs, we celebrate diversity and strive for an inclusive work culture. More than a statement on our careers page, these concepts are ingrained in our core values:</span></p><p><br></p><p><strong>Secure</strong><span> - We believe security and privacy in product, process, and habit is key to everything we do.</span></p><p><br></p><p><strong>Together</strong><span> - We inspire, execute, and celebrate as one team, with a commitment to trust, inclusion, collaboration, and accountability.</span></p><p><br></p><p><strong>Open</strong><span> - We’re committed to the free and open sharing of software, information, knowledge, and ideas.</span></p><p><br></p><p><strong>Resolute</strong><span> - We have the courage to do the right thing, even if it is not the easy thing. We resolve always to treat others ethically, with empathy, understanding, and trust.</span></p><p><br></p><p><strong>Empowered</strong><span> - We empower our users to control their data, our teammates to do great work, and our community to build economic value.</span></p><p><br></p><p><strong>Different</strong><span> - We think differently, act differently, and always strive to make a difference.</span></p><p><br></p><p><span>We don’t make hiring or employment decisions on the basis of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other basis protected by applicable local, state or federal law. We also consider for employment qualified applicants with arrest and conviction records in a manner consistent with San Francisco’s Fair Chance Ordinance and similar local laws.</span></p><p><br></p><p><br></p>",
        "index": 27,
        "skills": [
            "project management",
            "software engineering",
            "networks",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "STEM Virtual Summer Internship 2021 - US Army",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:13:08.625Z",
        "url": "https://www.internships.com/posting/fd85edc8-6954-4f29-b844-b7e0119f29f4",
        "lastScraped": "2021-03-08T03:13:08.625Z",
        "description": "<p>The US Army Institute of Surgical Research (USAISR) is seeking applications for summer internship appointments for undergraduate students from accredited colleges and universities to conduct research at the USAISR.&nbsp;The internship has a firm start date of May 31, 2021, and will end on Friday, August 6, 2021.&nbsp;Applicants will be evaluated once their complete packet is submitted.&nbsp;<strong>The final deadline for application submission is Monday, March 1, 2021.</strong>&nbsp;Only U.S. citizens with a minimum GPA of 3.0 are eligible for this program.&nbsp;Previous alumni of this program are not eligible to apply.</p><p><br></p><p>The intent of the undergraduate student internship is to provide an opportunity for students interested in science, engineering or medical career fields to participate in research directed at improving the care of injured military service members and society at large.&nbsp;This mentored research experience will expose interns to ongoing efforts in integrated science, technology and engineering solutions at the nation’s premier military trauma research institute.</p><p><br></p><p><strong>Department Descriptions</strong>:&nbsp;</p><ul><li><strong>Blood Coagulation Research Dept. (BCRD</strong>)—Improve the safety, efficacy and logistical supportability of blood products, identify mechanisms of coagulation dysfunction in trauma, diagnostics and therapeutics to restore normal function.</li><li><strong>Tactical and Enroute Care Research Dept. (TECRD</strong>)—Focused on patient care under the unique set of tactical, environmental and patient factors associated with point of injury care, including ground and air transport.</li><li><strong>Clinical Research Support Dept. (CRSD</strong>)—Provides support to other ISR programs requiring technology solutions to identified programmatic requirements and documented gaps.</li><li><strong>Engineering Processes and Product Development (EPPD</strong>)- hardware/software development, design, and usability testing for advance medical technologies.</li></ul><p><br></p><strong>Key Information</strong><p><strong>Program Dates:</strong>&nbsp;May 31 – August 6, 2021 (10 weeks)</p><p><strong>Research Location:</strong>&nbsp;Fort Sam Houston, San Antonio, TX;&nbsp;<strong>Students will be participating virtually.</strong></p><p><strong>Stipend:</strong>&nbsp;~$2,750 per month, full-time participation</p><p><strong>Number of Selections</strong>:&nbsp;Approximately 8 students will be selected for research participation.</p><p><br></p><p><strong>Research Project Descriptions:</strong></p><ul><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-BCRD-01.pdf</li><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-BCRD-02.pdf</li><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-BCRD-03.pdf</li><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-CRSD-01.pdf</li><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-EPPD-01.pdf</li><li>https://orise.orau.gov/zintellect-files/descriptions/us-army-institute-of-surgical-research/ISR-TECRD-01.pdf</li></ul><p><br></p><strong>Appointment Length</strong><p>This appointment is a 10-week research appointment, with the possibility to be renewed for additional research periods. Appointments may be extended depending on funding availability, project assignment, program rules, and availability of the participant.</p><p><br></p><strong>Participant Benefits</strong><p>Participants will receive a stipend to be determined by&nbsp;<strong>USAISR.&nbsp;</strong>Stipends are typically based on the participant’s academic standing, discipline, experience, and research facility location.&nbsp;Other benefits may include the following:</p><p><br></p><ul><li>Health Insurance Supplement.&nbsp;<em>Participants are eligible to purchase health insurance through ORISE.</em></li><li>Relocation Allowance</li><li>Training and Travel Allowance</li></ul><p><br></p><strong>Nature of Appointment</strong><p>The participant will not enter into an employee/employer relationship with ORISE, ORAU, DOD, or any other office or agency.&nbsp;Instead, the participant will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment.</p><p><br></p><strong>Qualifications</strong><p>Prerequisites:&nbsp;All interns must have completed at least their first year class requirements for a bachelor’s degree with an overall GPA of 3.0 or higher (out of a maximum of 4.0; if other scale is used, provide qualitative interpretation and/or equivalency to 4.0 scale).&nbsp;A science or engineering program of study is preferred, and prior research experience will be considered.&nbsp;</p><p><br></p><p>For consideration, the applicant’s CV must include the following elements:</p><p><br></p><ul><li>&nbsp;Professional Goal and objective statement (what are your career ambitions and what are you looking for in this experience?)</li><li>&nbsp;Academic Major (if declared) or track (if undeclared)</li><li>&nbsp;Grade-Point Average and expected year of graduation.</li><li>&nbsp;Brief description of prior research laboratory experience(s) including specific laboratory or analytical skills (for example, electrophoresis, cell culture, etc.)</li><li>&nbsp;Any relevant publications or other experience</li><li>&nbsp;Rank-ordered preference of&nbsp;three Task Areas in which to work</li></ul><p><br></p><p>Chosen applicants will&nbsp;collaborate closely with a USAISR staff mentor and their research team to conduct a scientific investigation in one of the research Task Areas of the USAISR.&nbsp;Applicants are asked to rank their Task Area preference to their top&nbsp;3 choices. (Of note, not all areas will participate in the summer program and, therefore, top choices cannot be guaranteed).&nbsp;Interns will present the findings of their research projects at a poster session at the end of the experience.</p>",
        "index": 28,
        "skills": [
            "information technology",
            "virtual reality",
            "software engineering",
            "hardware",
            "project management"
        ],
        "start": "2021-05-31T10:00:00.000Z",
        "due": "2021-05-31T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Technical product marketing intern",
        "company": "Nuryl LLC",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:13:21.098Z",
        "url": "https://www.internships.com/posting/ccm_140ebee2-6c8d-4985-8724-96ce653e4c0b",
        "lastScraped": "2021-03-08T03:13:21.098Z",
        "description": "<p>We seek a resourceful, creative and technically-adept candidate to fill various technical product marketing duties within our fast-growing firm. The role will include diverse duties (varying by week/month), but would likely include much of the following:</p><ul><li>Testing of our IOS and Android apps, on multiple devices each, following a methodical test script</li><li>Manage various digital advertising campaigns and report on results</li><li>Assemble monthly customer sales &amp; churn stats</li><li>Lear about the firm's Customer Relationship Management (CRM) system and assist with more ambitious use of (reporting from) this system</li><li>Monitor the press/Web for relevant research articles that support the science behind Nuryl</li><li>Help with responses to app reviews in the app stores as well as finding ways to leave or recruit new reviews.&nbsp;</li><li>Research other apps to see how they are handling gamification and help brainstorm new features for web and app.&nbsp;</li><li>Acting as a proctor/manager of the Nuryl Facebook group</li><li>Social media posts onto public Facebook &amp; Instagram sites,&nbsp;Pinterest, TikTok</li><li>Write and contribute to blogs</li><li>Help manage the evolution of our curriculum</li></ul><p><br></p><p>For a student or young professional who aspires to work in a fast-moving software company, this position will provide exposure and experience to most facets of the company. Nuryl is run by an experienced team, with a proven capability to mentor and guide early-career subordinates. If the intern excels, there is a high probability of this position converting into full-time employment.</p>",
        "index": 29,
        "skills": [
            "project management",
            "software engineering",
            "mobile development"
        ],
        "remote": true
    },
    {
        "position": "Summer - Saas Operations Intern",
        "company": "Workiva Inc",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-03-08T03:13:33.383Z",
        "url": "https://www.internships.com/posting/bug_38953842159",
        "lastScraped": "2021-03-08T03:13:33.383Z",
        "description": "Summer 2021 - SaaS Operations Intern\n\nJob Summary\nThe SaaS Operations Intern assists with Workiva's internal use SaaS applications. This person is responsible for helping maintain current SaaS applications to ensure they are running properly. The SaaS Operations Intern improves current SaaS systems by assisting with administration and automation. This person also assists with evaluating new SaaS systems by participating in requirements analysis and working with internal teams to recommend specific systems to meet their needs.\n\nResponsibilities\nAdminister and Maintain SaaS Systems:\n\n* Provide Tier 1 SaaS support and administration\n* Update and adhere to standard operating procedures (SOPs)\n* Conduct audits on existing systems by running reports and providing analyses of outputs\n\nImprove current SaaS systems:\n\n* Act as IT liaison to improve user experience and value in our software\n* Champion efficiency, automation, and best practices\n* Find ways to automate and scale current SaaS software applications\n\nnbsp; nbsp;\nEvaluate SaaS systems:\n\n* Partner with SaaS Operations and Portfolio Management teams to conduct fact-finding activities with internal teams to understand how SaaS software is being utilized and how to add more value\n* Supports evaluation of current SaaS portfolio to determine if a new application can replace multiple existing applications\n* Assess risks of new applications and provide recommendations based on assessment\n\nWhat You'll Need\nSkills\n\n* Strong customer service orientation\n* Proven analytical and problem-solving abilities\n* Ability to effectively prioritize and execute tasks in a high-pressure environment\n* Skilled at working within a dynamic, team-oriented, collaborative environment\n* Strong interpersonal and oral communication skills\n* Adept at reading, writing, and interpreting technical documentation and procedure manuals\n* Well-honed research skills\n* Ability to present ideas and solutions in user-friendly language\n* Highly self-motivated and directed\n* Keen attention to detail\n* Critical thinking skills\n\nExperience\n\n* Technical knowledge of current SaaS applications, a plus\n* Track record of technical configuration, process, and change documentation\n\nEducation\n\n* Currently pursuing an undergraduate or higher degree in Computer Science, Management Information Systems, or a related field.\n\nWorking Conditions amp; Physical Requirements\n\n* Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nColorado Pay Rate: $22 per hour\n\nWhere You#x2019;ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we#x2019;ve created.\n\n*\n\nCustomer Success:nbsp; Always delight our customers.\n\n*\n\nTrust: Rely on each other.nbsp;\n\n*\n\nIntegrity: Do the right thing, every time.nbsp;\n\n*\n\nCollaboration: Share resources and work together.nbsp;\n\n*\n\nInnovation: Keep creating solutions and finding better ways.nbsp;\n\n*\n\nInclusion: Support a diverse community where we all belong.nbsp;\n\n*\n\nAccountability: Be responsible for your success and failure.\n\nnbsp;\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need#x2014;backed by our culture of collaboration and diverse thought#x2014;to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today#x2019;s most challenging problems.\n\nAt Workiva, You#x2019;ll Enjoy:nbsp;\n\n*\n\nIntern Environment: Workiva was ranked a top 100 internship program by WayUp and ranked #58 in Best Places to Work for a reason! Our interns have the opportunity to participate in mentoring, professional development, networking, and flexible hours during their internship. We continually strive to provide numerous resources to build not just excellent interns, but excellent business professionals.nbsp;\n\n*\n\nReal Work Experience: Workiva interns are treated as full-time employees and are allowed the freedom to contribute to real work that truly impacts Workiva and it#x2019;s operations. From writing code in our production environment to directly supporting our customers' on our newest platform, our interns play a vital role in our company!nbsp;nbsp;\n\n*\n\nFantastic Perks: Being an intern at Workiva has benefits beyond just a paycheck. You can#x2019;t beat the wellness discounts, 401k participation, casual dress environment and countless other perks that Workiva offers!nbsp;\n\n*\n\nInvolvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more.\n\nIntern Video: https://youtu.be/LIxhabEk8Ao\n\nLearn more: https://www.linkedin.com/company/workiva/life/\n\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer.nbsp; We believe that great minds think differently.nbsp; We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation.nbsp; Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.nbsp;nbsp;\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com.nbsp;\n\nPosted 3 Days AgoPart timeR1411\n\nCURRENT EMPLOYEES:Internal applicants will need to apply for open positions through their Workday account. Click on the quot;Careersquot; worklet and complete the internal application. For questions, please contact the recruiter listed on the open position. #x200b;\n\nWe founded Workiva to transform the way people manage and report business data with various collaborators, data sources, documents, and spreadsheets. Today, people all over the world use our platform to seamlessly orchestrate data among their systems and applications for transparent and trusted connected reporting and compliance.",
        "index": 30,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "talentacquisition@workiva.com",
        "remote": true
    },
    {
        "position": "Summer - Saas Operations Intern",
        "company": "Workiva Inc",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-03-08T03:13:45.318Z",
        "url": "https://www.internships.com/posting/bug_38953842159",
        "lastScraped": "2021-03-08T03:13:45.318Z",
        "description": "Summer 2021 - SaaS Operations Intern\n\nJob Summary\nThe SaaS Operations Intern assists with Workiva's internal use SaaS applications. This person is responsible for helping maintain current SaaS applications to ensure they are running properly. The SaaS Operations Intern improves current SaaS systems by assisting with administration and automation. This person also assists with evaluating new SaaS systems by participating in requirements analysis and working with internal teams to recommend specific systems to meet their needs.\n\nResponsibilities\nAdminister and Maintain SaaS Systems:\n\n* Provide Tier 1 SaaS support and administration\n* Update and adhere to standard operating procedures (SOPs)\n* Conduct audits on existing systems by running reports and providing analyses of outputs\n\nImprove current SaaS systems:\n\n* Act as IT liaison to improve user experience and value in our software\n* Champion efficiency, automation, and best practices\n* Find ways to automate and scale current SaaS software applications\n\nnbsp; nbsp;\nEvaluate SaaS systems:\n\n* Partner with SaaS Operations and Portfolio Management teams to conduct fact-finding activities with internal teams to understand how SaaS software is being utilized and how to add more value\n* Supports evaluation of current SaaS portfolio to determine if a new application can replace multiple existing applications\n* Assess risks of new applications and provide recommendations based on assessment\n\nWhat You'll Need\nSkills\n\n* Strong customer service orientation\n* Proven analytical and problem-solving abilities\n* Ability to effectively prioritize and execute tasks in a high-pressure environment\n* Skilled at working within a dynamic, team-oriented, collaborative environment\n* Strong interpersonal and oral communication skills\n* Adept at reading, writing, and interpreting technical documentation and procedure manuals\n* Well-honed research skills\n* Ability to present ideas and solutions in user-friendly language\n* Highly self-motivated and directed\n* Keen attention to detail\n* Critical thinking skills\n\nExperience\n\n* Technical knowledge of current SaaS applications, a plus\n* Track record of technical configuration, process, and change documentation\n\nEducation\n\n* Currently pursuing an undergraduate or higher degree in Computer Science, Management Information Systems, or a related field.\n\nWorking Conditions amp; Physical Requirements\n\n* Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nColorado Pay Rate: $22 per hour\n\nWhere You#x2019;ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we#x2019;ve created.\n\n*\n\nCustomer Success:nbsp; Always delight our customers.\n\n*\n\nTrust: Rely on each other.nbsp;\n\n*\n\nIntegrity: Do the right thing, every time.nbsp;\n\n*\n\nCollaboration: Share resources and work together.nbsp;\n\n*\n\nInnovation: Keep creating solutions and finding better ways.nbsp;\n\n*\n\nInclusion: Support a diverse community where we all belong.nbsp;\n\n*\n\nAccountability: Be responsible for your success and failure.\n\nnbsp;\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need#x2014;backed by our culture of collaboration and diverse thought#x2014;to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today#x2019;s most challenging problems.\n\nAt Workiva, You#x2019;ll Enjoy:nbsp;\n\n*\n\nIntern Environment: Workiva was ranked a top 100 internship program by WayUp and ranked #58 in Best Places to Work for a reason! Our interns have the opportunity to participate in mentoring, professional development, networking, and flexible hours during their internship. We continually strive to provide numerous resources to build not just excellent interns, but excellent business professionals.nbsp;\n\n*\n\nReal Work Experience: Workiva interns are treated as full-time employees and are allowed the freedom to contribute to real work that truly impacts Workiva and it#x2019;s operations. From writing code in our production environment to directly supporting our customers' on our newest platform, our interns play a vital role in our company!nbsp;nbsp;\n\n*\n\nFantastic Perks: Being an intern at Workiva has benefits beyond just a paycheck. You can#x2019;t beat the wellness discounts, 401k participation, casual dress environment and countless other perks that Workiva offers!nbsp;\n\n*\n\nInvolvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more.\n\nIntern Video: https://youtu.be/LIxhabEk8Ao\n\nLearn more: https://www.linkedin.com/company/workiva/life/\n\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer.nbsp; We believe that great minds think differently.nbsp; We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation.nbsp; Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.nbsp;nbsp;\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com.nbsp;\n\nPosted 3 Days AgoPart timeR1411\n\nCURRENT EMPLOYEES:Internal applicants will need to apply for open positions through their Workday account. Click on the quot;Careersquot; worklet and complete the internal application. For questions, please contact the recruiter listed on the open position. #x200b;\n\nWe founded Workiva to transform the way people manage and report business data with various collaborators, data sources, documents, and spreadsheets. Today, people all over the world use our platform to seamlessly orchestrate data among their systems and applications for transparent and trusted connected reporting and compliance.",
        "index": 31,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "talentacquisition@workiva.com",
        "remote": true
    },
    {
        "position": "EPA Water Quality Assessment Analysis Fellowship",
        "company": "ORISE",
        "location": {
            "city": "District of Columbia",
            "state": "United States"
        },
        "posted": "2021-02-06T03:13:56.948Z",
        "url": "https://www.internships.com/posting/e6a64e43-6f4d-4225-8de4-018460bfe327",
        "lastScraped": "2021-03-08T03:13:56.948Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>One to two&nbsp;research opportunities are available at the U.S. Environmental Protection Agency (EPA) in the Office of Water (OW), Office of Wetlands, Oceans and Watersheds (OWOW) Nonpoint source Program located in Washington D.C.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA research project involving research and&nbsp;analysis focused on the successful use of Clean Water Act Section 319 nonpoint source funding for achieving water quality improvements, as well as researching state Nonpoint Source Management Plans and local scale watershed plans.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor the participant will have the opportunity to:</p><ul><li>evaluate water quality results in proposed nonpoint success stories from state agencies prior to publication</li><li>evaluate implementation of best management practices and water quality monitoring for controlling nonpoint source pollution</li><li>analyze effective approaches and measures in watershed planning to protect water quality</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for these opportunities is Cynthia Curtis (Curtis.cynthia@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for one year and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>At this time, master's degree stipends are ~$60,129 per year. Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 32,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "CLIP Resident",
        "company": "CLIP-Central Louisiana Instructional Partnership",
        "location": {
            "city": "Louisiana",
            "state": "United States"
        },
        "posted": "2021-02-06T03:14:08.794Z",
        "url": "https://www.internships.com/posting/ccm_b56b55ab-d66c-4b15-9c48-f5dd6de01089",
        "lastScraped": "2021-03-08T03:14:08.794Z",
        "description": "<p><strong>Have a bachelor’s degree? Want to become a teacher?</strong></p><p>The Orchard Foundation is proud to introduce the Central Louisiana Instructional Partnership (CLIP)program. This is a 15-month teacher residency program focusing on developing middle school Math and Science teachers in high-needs schools. Residents will earn a Master of Arts in Teaching from Northwestern State University. Residents will learn best practices and how to apply technology in the classroom.</p><p><strong>The participating school districts for CLIP are Allen, Avoyelles, Catahoula, Grant, LaSalle,Natchitoches, Rapides, Vernon, and Winn.&nbsp;</strong>These school districts will host a CLIP resident for one academic school year. Residents will serve under the guidance of a mentor teacher while also completing the required graduate school coursework through Northwestern State University. All courses will be delivered online using the NSU course platform. Residents will also meet face-to-face once a month.</p><p>Once residents complete the program, there is a three-year commitment to serve. Residents will be placed in a school in one of the participating districts high-needs schools and receive coaching during the first two years.</p><p><br></p><p><strong>CLIP Incentives</strong></p><p>· Annual stipend of $36,000</p><p>· Additional stipend to cover the cost of tuition</p><p>· Books and course materials provided</p><p>· Hybrid format delivery of online courses and face-to-face monthly meetings</p><p>· Learn best practices and how to apply technology in the classroom</p><p>· Set of technology devices to use in the classroom</p><p>· Support from an Induction Coach during the first two years of teaching</p><p><strong>How to apply</strong></p><p><strong>Deadline to apply for the CLIP 2021 cohort is March 31, 2021.</strong></p><p>We have 13 spots available for the CLIP 2021 Cohort. Interviews for qualified applicants are scheduled to be held in late spring of 2021. Coursework with NSU will begin June of 2021.</p><p><strong>If you are graduating with a bachelor's degree in Spring 2021, you can apply to the program to be considered for the CLIP 2021 cohort.</strong></p><p>The CLIP program will select 13 residents each year for the next three years.</p><p>Here is the list of cohorts to apply for if you are graduating with your bachelor's on or prior to the following semester:</p><p>Fall 2020 or Spring 2021, apply for CLIP 2021 cohort</p><p>Fall 2021 or Spring 2022, apply for CLIP 2022 cohort</p>",
        "index": 33,
        "skills": [
            "machine learning",
            "information technology"
        ],
        "due": "2021-03-31T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and Prediction of Geospatial Dynamics Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-02-06T03:14:22.985Z",
        "url": "https://www.internships.com/posting/ccm_929e68d0-31b8-4796-a497-54460da6b2d4",
        "lastScraped": "2021-03-08T03:14:22.985Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of pests and animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with high performance computing (HPC) or cloud computing provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions. Under the guidance of a mentor, the participant will learn AI technologies relevant to these problems, and will help develop and co-lead ARS-wide workshops resulting in a community of scientific practice on geospatial problems with AI.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The&nbsp;participant will have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses and AI across multiple spatial and temporal scales.</p>",
        "index": 34,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "EPA EcoLearn Environmental Education Program",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:14:42.053Z",
        "url": "https://www.internships.com/posting/0f6a06d8-d48c-48dd-9332-74bac47c833f",
        "lastScraped": "2021-03-08T03:14:42.053Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>An opportunity is available at the Environmental Protection Agency's (EPA) Region 10 Water Division located in Seattle, Washington. At this time, the appointment will be remote (pending the COVID-19 pandemic).</p><p><br></p><p>The mission of EPA is to protect human health and the environment. EPA works to ensure that: Americans have clean air, land and water; National efforts to reduce environmental risks are based on the best available scientific information; Federal laws protecting human health and the environment are administered and enforced fairly, effectively and as Congress intended; Environmental stewardship is integral to U.S. policies concerning natural resources, human health, economic growth, energy, transportation, agriculture, industry, and international trade, and these factors are similarly considered in establishing environmental policy; All parts of society have access to accurate information sufficient to effectively participate in managing human health and environmental risks; Contaminated lands and toxic sites are cleaned up; and chemicals in the marketplace are reviewed for safety.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Environmental protection and sustainability are critical topics for our youth to understand. Schools around the country are struggling to integrate the concepts into their curricula.&nbsp;&nbsp;The EPA’s Environmental Education Lesson Plans to provide a fun, easily accessible enrichment for Preschool through 5th Grade students.&nbsp;</p><p><br></p><p>Over the past ten years, a set of 13 60-minute lesson plans per grade level, preschool through fifth grade have been developed. These lesson plans are used by parents, students, teachers or other interested people and have been tested&nbsp;the lesson plans in local elementary schools or other youth settings. Topics included: Animals, Air, Water, Climate Change, Ecosystems, Energy, Waste, Food, Marine Debris, Oceans, Green Buildings, National Parks, and Endangered Species.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant will collaborate with EPA on&nbsp;preparing&nbsp;lessons for publication and creating&nbsp;training presentations for EPA employees and the public.&nbsp;The participant may consolidate&nbsp;information already available and fill in the lesson plan gaps (e.g., specify required readings, essays, activities, etc.) where needed. The participant also will collaborate with EPA to continue the testing the lesson plans more broadly, expanding EPA's outreach, make necessary revisions to the materials, and create new lessons, as appropriate.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Sally Hanft (hanft.sally@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Late Winter/Early Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;four months&nbsp;and may be renewed three to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 35,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Paid Technology Intern",
        "company": "Foundation Academies",
        "location": {
            "city": "New Jersey",
            "state": "United States"
        },
        "posted": "2021-03-08T03:14:54.044Z",
        "url": "https://www.internships.com/posting/bug_38956662341",
        "lastScraped": "2021-03-08T03:14:54.044Z",
        "description": "Paid Technology Intern (Part-Time)\nat Foundation Academies \nFoundation Academies\n\nFOUNDATION COLLEGIATE ACADEMY ALUMNI ONLY\n\nWere looking for YOU if:\n\n* You believe that EVERY child deserves access to a high-quality education and that children can and will learn if properly taught.\n* You believe that alongside academics, a complete education includes nurturing your students as individuals so that they can become well-rounded, civic-minded, lifelong learners; the changemakers and leaders of the future.\n* You are unabashedly and authentically YOU and proud of it, and genuinely committed to building meaningful relationships with students, families, and staff.\n\nWere you nodding YES as you read the list above? We invite you to apply!\n\nWere looking for a dedicated and talented Technology Intern to become part of our Home Office Team.\n\nThe Technology Intern will play a critical role in assisting the Technology Team to ensure that all of Foundation Academies staff, students, and families are equipped with working technology while learning transferable skills essential to a career in Information Technology. The Technology Intern is an individual with a growth-mindset that accepts and implements feedback to develop and improve over time. Our preferred candidate is someone who has an interest in pursuing a career in Information Technology and is currently enrolled or interested in getting back into postsecondary studies within the field of Information Technology.\n\nHeres what youll be doing\n\nEssential Duties\n\n* Utilize the Technical Support helpdesk ticketing system to respond to student and staff technology issues\n* Assists with scheduling parents and staff for computer repairs, troubleshooting and/or device replacement\n* Assists staff and students with password resets/login issues\n* Assists with the installation of new technology equipment - such as mounting classroom cameras and replacing computer hardware such as hard drives, chromebook screens, keyboards and other components\n* Assists with the setup and distribution of staff and student devices\n* Forwards unresolved problems to more senior staff, such as network/server problems or when log-in issues and password troubleshooting did not resolve the problem\n* Prioritizes and executes such as password resets and computer repairs as instructed by direct supervisor\n* Communicates with staff and students to ensure issues are resolved to their satisfaction\n\nRequirements\n\n* Possess an unrelenting work ethic\n* Communicate effectively in all verbal and written communications\n* Exercise excellent judgment and unquestionable integrity and confidentiality\n* Show great responsibility by being prepared, present, and prompt during all meetings\n* Have a welcoming presence during all staff, student, and parent interactions\n* Priority and time management skills with the ability to stay extremely organized and detailed oriented\n* Do whatever else is necessary to support our staff and students in their preparation for college, while modelling our core values of caring, respect responsibility and honesty\n* The ideal candidate will have knowledge and experience in some of the following areas:\n* Windows 10 Operating System\n* Microsoft Office Suite\n* Google ChromeOS\n* Google Workspaces (GSuite) tools such as Google Docs and Google Sheets\n* Wireless networking\n* Printer/copier hardware\n* AV technologies (Speakers, Projectors)\n\nQualifications\n\n* Alumni of Foundation Collegiate Academy preferred\n* Spanish speakers preferred\n\nCompensation: $15/hour part-time, max of 25 hours per week",
        "index": 36,
        "skills": [
            "information technology",
            "hardware",
            "networks",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T03:15:05.795Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-03-08T03:15:05.795Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 37,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Marketing Operations Analyst Intern",
        "company": "Xactly",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-02-06T03:15:18.374Z",
        "url": "https://www.internships.com/posting/wup_124186003371509",
        "lastScraped": "2021-03-08T03:15:18.374Z",
        "description": "**JOB DESCRIPTION**\n\nJob Title: Marketing Operations Intern\nLocation: US Field (Remote)\nFunction: Marketing Operations\nPosition Type: Marketing\nPosition Level: Internship\n\nXactly Corporation was founded to solve an important challenge: how to help people everywhere connect and unleash their human potential through seamless, perfectly aligned Sales Performance Management. Xactly's comprehensive Sales Performance Management (SPM) suite leverages data from a sales performance AI platform to provide timely insights across the entire SPM value chain, from sales planning to execution, including compensation to optimization. Xactly takes Sales Performance Management from a dark art to a science, providing decision-makers with the data insights they need to tap the motivational power of their incentive compensation. With access to predictive analytics and benchmark data, enterprises can now optimize territories, design the right compensation and incentive plans and accelerate attainment and optimization of sales performance.\nNamed among the best workplaces in the U.S. by Great Place to Work seven times, recognized as a 2020 WayUp Top 100 Internship Program, named as a Top Workplace by the Bay Area News Group eight times as well as The Denver Post the last 3 consecutive years, and honored with the Business Intelligence Group Sales and Marketing Technology award in 2020. Xactly is proud to be disrupting the Sales Performance Management market space. We're building a culture of success and are looking for motivated professionals to join us!\n\n**THE OPPORTUNITY**\n\nAs a Marketing Operations Intern, you'll be bringing a detailed and process driven mindset to execute B2B lead generation programs, measuring their success and optimizing results. You should have a passion for analytics and record of using data to improve business decisions. Success in this role will be measured in terms of demand generation, deal development, and ability to measure and optimize marketing investments. You'll bring an eye for detail and experience with content marketing, lead processes and lead nurturing in Marketo and Salesforce.com. This is an opportunity to collaborate with Sales to ensure effective lead hand-off and to continuously improve lead scoring and lead conversion to new deals. We count on Marketing to coordinate with the content creation team to focus efforts on topics and media types proven to be most engaging. You'll plan, test, and manage the execution of integrated marketing campaigns - leverage tactics across all available channels, including email, online/PPC, webinars, trade shows, content syndication, social media, etc. to engage prospects in Marketo.\n\n**THE TEAM**\n\nOur Xactly Marketing Ops team comes from all over the country and has experience across a variety of large enterprise and startup-style companies. We bring a myriad of ideas from our backgrounds to solve problems of all shapes and sizes while making our stakeholders feel empowered by the data we provide them. We want people to feel comfortable coming to us with any questions, no matter how simple or complex, and strive to leave them with a positive outcome. We're here to make someone's idea a reality!",
        "index": 38,
        "skills": [
            "project management",
            "virtual reality",
            "information technology",
            "artificial intelligence"
        ],
        "remote": true
    },
    {
        "position": "EPA EcoLearn Environmental Education Program",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:15:30.449Z",
        "url": "https://www.internships.com/posting/0f6a06d8-d48c-48dd-9332-74bac47c833f",
        "lastScraped": "2021-03-08T03:15:30.449Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>An opportunity is available at the Environmental Protection Agency's (EPA) Region 10 Water Division located in Seattle, Washington. At this time, the appointment will be remote (pending the COVID-19 pandemic).</p><p><br></p><p>The mission of EPA is to protect human health and the environment. EPA works to ensure that: Americans have clean air, land and water; National efforts to reduce environmental risks are based on the best available scientific information; Federal laws protecting human health and the environment are administered and enforced fairly, effectively and as Congress intended; Environmental stewardship is integral to U.S. policies concerning natural resources, human health, economic growth, energy, transportation, agriculture, industry, and international trade, and these factors are similarly considered in establishing environmental policy; All parts of society have access to accurate information sufficient to effectively participate in managing human health and environmental risks; Contaminated lands and toxic sites are cleaned up; and chemicals in the marketplace are reviewed for safety.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Environmental protection and sustainability are critical topics for our youth to understand. Schools around the country are struggling to integrate the concepts into their curricula.&nbsp;&nbsp;The EPA’s Environmental Education Lesson Plans to provide a fun, easily accessible enrichment for Preschool through 5th Grade students.&nbsp;</p><p><br></p><p>Over the past ten years, a set of 13 60-minute lesson plans per grade level, preschool through fifth grade have been developed. These lesson plans are used by parents, students, teachers or other interested people and have been tested&nbsp;the lesson plans in local elementary schools or other youth settings. Topics included: Animals, Air, Water, Climate Change, Ecosystems, Energy, Waste, Food, Marine Debris, Oceans, Green Buildings, National Parks, and Endangered Species.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant will collaborate with EPA on&nbsp;preparing&nbsp;lessons for publication and creating&nbsp;training presentations for EPA employees and the public.&nbsp;The participant may consolidate&nbsp;information already available and fill in the lesson plan gaps (e.g., specify required readings, essays, activities, etc.) where needed. The participant also will collaborate with EPA to continue the testing the lesson plans more broadly, expanding EPA's outreach, make necessary revisions to the materials, and create new lessons, as appropriate.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Sally Hanft (hanft.sally@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Late Winter/Early Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;four months&nbsp;and may be renewed three to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 39,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Generation Specialist Apprentice I, II Or Journeyman - Hydro Maintenance",
        "company": "Idaho Power Company",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-03-08T03:15:51.989Z",
        "url": "https://www.internships.com/posting/bug_38948057907",
        "lastScraped": "2021-03-08T03:15:51.989Z",
        "description": "Generation Specialist Apprentice I, II or Journeyman - Hydro Maintenance\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$27.14 - $47.42\n\nMinimum Age Requirement:\n\n21\n\nJob Description:\n\nIdaho Power is looking for a Generation Specialist Apprentice I, II or Journeyman  Hydro Maintenance for our Hells Canyon, Oregon location.\n\nIts an exciting time to bring your skills to Idaho Power. We recently announced a goal of 100% clean energy by 2045, and our work plays a critical role in the communities we serve across Idaho and Oregon. We're looking for hard-working, hands-on problem solvers to keep our equipment and systems running smoothly as we continue to provide safe, reliable, affordable energy.\n\nWhat does a Generation Specialist Apprentice I, II or Journeyman do for us? Under limited supervision: The Apprentice I and II performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities. The Journeyman performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities and Completes assigned tasks and assumes a lead role when required.\n\nIn addition to the meaningful work we do, we offer work-life balance, competitive pay and benefits, and both a 401k employer-match and a pension plan, making Idaho Power one of the best employers in the state.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* Basic electricity and the function, operation, troubleshooting and repair of complex equipment through use of drawings and instructional manuals\n\nSkills in:\n\n* Skills in maintenance of power plants\n* Inspection and maintenance of heavy equipment\n* Basic welding and fabrication\n* Basic computing\n* Personal communication\n* Interactive teamwork\n* Conflict resolution\n\nAbility to:\n\n* Ability to maintain high productivity with minimal supervision\n* Perform heavy manual labor in adverse conditions\n* Communicate effectively\n* Establish positive working relationships in a team-based environment\n* Respond to emergencies in excess of normal working hours\n* Perform other duties/tasks as assigned\n\nMINIMUM REQUIREMENTS\n\nApprentice I\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nApprentice II\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nAND\n\n* Enrollment in a Generation Apprenticeship Training Program\n\nOR\n\n* A combination of education and work experience that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Six months of power plant experience\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nJourneyman\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Certificate of completion of a Generation Specialist training program that is recognized by the Bureau of Office of Apprenticeship (OA)\n* At least three years of relevant work experience in power plant operations and/or maintenance\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nPHYSICAL REQUIREMENTS\nThis job will require occasional, physically strenuous work for long periods of time and in adverse conditions. Job requires the ability to bend, stoop, squat, crouch, crawl, climb into and out of vehicles, twist, kneel, balance and reach, and climb multiple flights of stairs. Occasionally lifting items weighing 75 lbs. shoulder height and above; occasionally lifting items weighing up to 100 lbs. waist high and knee high. Occasionally using exertional force up to 50 lbs. to push/pull cable, etc. Occasionally carrying items weighing up to 100 lbs. with two hands and occasionally carrying items weighing up to 75 lbs. with one hand. Requires the ability to operate a vehicle. Must be able to grasp and hold simple hand tools and testing equipment and use fine motor skills to use a computer keyboard, test equipment, and replace parts. Applicant must be able to perform the essential functions of the job with reasonable accommodation and without posing a direct threat of harm to self, others, or property. Job placement is contingent upon successful completion of a pre-employment DOT medical exam.\n\nADDITIONAL REQUIREMENTS\nMust be at least 21 years of age in when working in Hells Canyon. HCC employees required to complete respirator fit test after hire.\n\nADDITIONAL INFORMATION\nRequires occasional travel with overnight stays. Job requires the employee to obtain and wear approved safety footwear and FR clothing.\n\nCompetencies:\n\nAdaptability, Building Customer Loyalty, Communication, Contributing to Team Success, Decision Making, Initiating Action, Innovation, Managing Work (includes Time Management), Quality Orientation, Safety Awareness",
        "index": 40,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "TriangleProperties.net",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-02-06T03:16:08.618Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-03-08T03:16:08.618Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>",
        "index": 41,
        "skills": [
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Student Intern It , Gs - With Security Clearance",
        "company": "US Department of Commerce",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-03-08T03:16:22.151Z",
        "url": "https://www.internships.com/posting/bug_38952961020",
        "lastScraped": "2021-03-08T03:16:22.151Z",
        "description": "Student Intern (IT), GS-2299-04 (SUMMER INTERN) with Security Clearance\n\nDepartment of Commerce\nHonolulu, HI 96801\n\nFull-time, Part-time\nSimilar jobs pay $20.15 - $29.94\n\nRefer friends, get paid!\n\n------------\n\nJob Description\n\nDuties Summary This Summer Internship opportunity will start no sooner than April 2021. Please note that if you are a Spring or Summer 2021 graduate, you will not be eligible for this Internship opportunity unless you are accepted for enrollment at a qualifying educational institution seeking an additional degree (diploma, Certificate, degree program, etc.) or an advanced degree. You must submit proof of acceptance along with your current transcripts for consideration. Learn more about this agency Responsibilities NOAA is seeking bright, innovative, results-oriented students who are pursuing a degree or certificate program in an accredited educational institution for our Summer Intern Program. The NOAA Summer Intern Program targets students currently enrolled (or currently enrolled and accepted for enrollment) in a degree-seeking or Certificate program at least on a half-time basis. (Applicants who do not meet the definition of student by the closing date of the announcement will not be considered). Due to the current global situation, applicants may be eligible to work remotely. This is depending on the hiring office's needs and will be worked out on a case by case basis. *Travel, transportation, and relocation expenses will not be paid. All travel, transportation, and relocation expenses associated with reporting for duty in this position will be the sole responsibility of the selected employee. Salary ranges will vary based on the location. Please visit: OPM Salary Charts for specific salary information related to a specific location. Cost of Living Allowance (COLA) for Honolulu, HI is 10.28%, and 12.62% for Barrigada, Guam and is not federally taxed. The COLA is not reflected in the locality salary shown in this vacancy announcement. COLAs are exempt from Federal income taxes; post differentials are not. Post Differential may be authorized for hires outside of the local area. May be eligible to applicants from the mainland, Alaska, or Hawaii. You may be entitled to 20% post differential allowance in addition to the salary for Guam. Post differentials are not exempt from Federal income taxes. Performs basic and clerical IT assignments, such as providing IT support for local and remote users; tracking and documenting customer support tickets; providing basic IT information to other employees within the office; maintaining incident databases; performing basic maintenance on different equipment and technology; participating in IT security tests; installing commercial software and hardware on government computers; observing the work of higher-grade specialists; and assisting higher-level specialists in more complex and intricate tasks. This position is not in the bargaining unit. Travel Required Not required Supervisory status No Promotion Potential 04 * Job family (Series) 2299 Information Technology Student Trainee * Requirements Help Requirements Conditions of Employment * Must be a U.S. Citizen or National to apply. * Required to pass a background investigation and fingerprint check. * Must be suitable for Federal employment. * Must be registered for Selective Service, if applicable (www.sss.gov) * Must sign a Pathways Programs Participant Agreement. * A minimum one year trial period will be required. * Must be at least 16 years of age at the time of appointment. Upon successful completion of the Pathways Internship Program and completion of their academic degree or Certificate program, individuals may be non-competitively converted to a term position or permanent position in the Competitive Service. (see Other Information). ELIGIBILITY REQUIREMENTS: Intern and Interns NTE must:\n Be accepted for enrollment or enrolled and seeking a degree or certificate in a qualifying educational institution on a half-time to full-time basis (as determined by the educational institution);\n Meet the definition of a student throughout the duration of their appointments;\n Meet agency-specific requirements as specified in the agency's Participant Agreement with the Intern and;\n Meet the qualification standards (e.g., series and grade) for position. Applicants must demonstrate proof of enrollment for the Spring 2021 or equivalent term, by submitting an official proof of enrollment letter from a qualifying educational institution or a transcript indicating courses to be taken in the Spring 2021 or equivalent term. Unofficial transcripts are acceptable. NOTE:\nThis vacancy may be used to fill other Student Intern (IT), GS-2299-04 positions throughout NOAA. The position must be alike (e.g.: the same qualifications and eligibility requirements as indicated in this vacancy announcement). Qualifications Qualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: https://www.opm.gov/policy . Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. To qualify at the GS-04 level: Completion of 2 full academic years of post-high school study or an associate's degree. OR Previous related education and/or experience. Special Provisions/or Interns with Previous Related Education or Experience. Previous education and/or experience may be evaluated to determine the highest grade level for which the individual is qualified. Education Definition of Student: Student is defined as an individual accepted for enrollment or enrolled and seeking a degree (diploma, or certificate) in a qualifying academic institution, on a half or full-time basis. Half-time is defined by the educational institution in which the student is enrolled. Students do not have to be in actual physical attendance in school, online curriculums are acceptable as long as the school is accredited by the Department of Education. All academic degrees or course work must be completed in an educational institution that has obtained accreditation from an accrediting body recognized by the U.S. Department of Education. For a list of schools that meet this criteria, see http://ope.ed.gov/accreditation/Search.aspx . College Transcript: Applicants must submit a copy of their college transcript that lists college courses, course title, and number of credit hours. You may submit an unofficial copy of the transcript at the initial phase of the application process, but an official certified copy must be received before you can report to duty. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. Additional information can be found here: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html . Proof of Enrollment: NOAA will use applicant's transcript as proof of enrollment in the identified college/university provided it demonstrates definition of eligible student. A letter from an educational institution indicating acceptance may be used as proof of enrollment for those students who are continuing studies at a new college or university or for those student whose transcripts do not reflect in-progress courses. An official transcript will be required before you can report to duty. Additional information PROGRAM COMPLETION AND CONVERSION: For both Intern and Intern NTE, agencies have the discretion to consider interns for non-competitive conversion to term or permanent positions in the competitive services, provided that the intern has met all academic and Program requirements, and are within 120 days of academic program completion. There is no guarantee for conversion. To be eligible for conversion, an Intern or eligible Intern NTE must:\n Be a United States citizen or national;\n Complete at least 640 hours of work experience acquired through the Program while enrolled as a half-time or full-time degree or certificate seeking student;\n Complete a course of academic study, within the preceding 120-day period, at a qualifying educational institution conferring a diploma, certificate or degree;\n Meet the qualification standards for the position to which she or he will be converted;\n Receive a favorable recommendation by an official of the agency or agencies in which she or he served; and  Meet agency-specific requirements, as specified in the Participant Agreement. NOAA participates in e-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees. Read more How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above. Your resume, supporting documents and responses to the online questionnaire will be reviewed to determine if you meet eligibility and minimum qualification requirements. Veterans' preference applies to all selections made under the Pathways authority in accordance with CFR, Part 302. To preview questions please click here . Read more Background checks and security clearance Security clearance Other Drug test required No * Required Documents Help Required Documents The following documents are required for your application to be complete. Our office cannot be responsible for incompatible software, illegible fax transmissions, delays in mail service, your system failure or do\n\n\n\nPosting ID: 607501509Posted: 2021-02-19",
        "index": 42,
        "skills": [
            "information technology",
            "hardware",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-04-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Student Intern It , Gs",
        "company": "US Government",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-03-08T03:16:38.754Z",
        "url": "https://www.internships.com/posting/bug_38953147651",
        "lastScraped": "2021-03-08T03:16:38.754Z",
        "description": "Student Intern (IT), GS-2299-04 (SUMMER INTERN) \n          Department of Commerce Overview \n          Accepting applications\n         \n          Open &amp; closing dates\n          02/18/2021  to  02/26/2021 \n          Service\n          \n          Excepted\n          \n          Pay scale &amp; grade\n          \n          GS 04\n          \n          Salary\n          $32,501 to $42,250 per year \n          Appointment type\n          \n          Summer - Not to Exceed (NTE) September 30, 2021. This position may be extended in 1 year increments.\n          \n          Work schedule\n          \n          Full-Time\n          Locations Few vacancies in the following locations: \n          Barrigada, GU \n          \n          Honolulu, HI \n          \n          Relocation expenses reimbursed\n          \n          No\n          \n          Telework eligible\n          \n          Yes as determined by agency policy\n          This job is open to \n          Students\n          \n          Current students enrolled in accredited educational institutions from high school to graduate level. Includes internships, pathways and other student programs.\n          Clarification from the agency \n          Students who are currently enrolled in an accredited educational institution in good academic standing. Good academic standing is determined by the educational institution, but is typically a Grade Point Average of a 2.0 on a 4.0 scale. Applicants must provide proof of current enrollment in school and documentation indicating acceptance in an accredited educational institution (if applicable).\n          Share\n     Announcement number \n          NWS-2021-0048\n          Control number \n          592642000\n          \n          Duties\n          Duties  Summary This Summer Internship opportunity will start no sooner than April 2021. Please note that if you are a Spring or Summer 2021 graduate, you will not be eligible for this Internship opportunity unless you are accepted for enrollment at a qualifying educational institution seeking an additional degree (diploma, Certificate, degree program, etc.) or an advanced degree.  You must submit proof of acceptance along with your current transcripts for consideration.  Responsibilities NOAA is seeking bright, innovative, results-oriented students who are pursuing a degree or certificate program in an accredited educational institution for our Summer Intern Program.  The NOAA Summer Intern Program targets students currently enrolled (or currently enrolled and accepted for enrollment) in a degree-seeking or Certificate program at least on a half-time basis. (Applicants who do not meet the definition of student by the closing date of the announcement will not be considered). Due to the current global situation, applicants may be eligible to work remotely. This is depending on the hiring office's needs and will be worked out on a case by case basis. *Travel, transportation, and relocation expenses will not be paid.  All travel, transportation, and relocation expenses associated with reporting for duty in this position will be the sole responsibility of the selected employee. Salary ranges will vary based on the location. Please visit:   for specific salary information related to a specific location. Cost of Living Allowance (COLA) for Honolulu, HI is 10.28%, and 12.62% for Barrigada, Guam and is not federally taxed. The COLA is not reflected in the locality salary shown in this vacancy announcement. COLAs are exempt from Federal income taxes; post differentials are not. Post Differential may be authorized for hires outside of the local area. May be eligible to applicants from the mainland, Alaska, or Hawaii. You may be entitled to 20% post differential allowance in addition to the salary for Guam. Post differentials are not exempt from Federal income taxes. Performs basic and clerical IT assignments, such as providing IT support for local and remote users; tracking and documenting customer support tickets; providing basic IT information to other employees within the office; maintaining incident databases; performing basic maintenance on different equipment and technology; participating in IT security tests; installing commercial software and hardware on government computers; observing the work of higher-grade specialists; and assisting higher-level specialists in more complex and intricate tasks. This position is not in the bargaining unit. Travel Required Not required \n          Supervisory status\n          \n          No\n          \n          Promotion Potential\n          \n          04\n          Job family (Series) \n          Requirements\n          Requirements  Conditions of Employment Must be a U.S. Citizen or National to apply. Required to pass a background investigation and fingerprint check. Must be suitable for Federal employment. Must be registered for Selective Service, if applicable (www.sss.gov) Must sign a Pathways Programs Participant Agreement. A minimum one year trial period will be required. Must be at least 16 years of age at the time of appointment. Upon successful completion of the Pathways Internship Program and completion of their academic degree or Certificate program, individuals may be non-competitively converted to a term position or permanent position in the Competitive Service. (see Other Information). ELIGIBILITY REQUIREMENTS: Intern and Interns NTE must:  Be accepted for enrollment or enrolled and seeking a degree or certificate in a   on a half-time to full-time basis (as determined by the educational institution);  Meet the definition of a student throughout the duration of their appointments;  Meet agency-specific requirements as specified in the agency's Participant Agreement with the Intern and;  Meet the qualification standards (e.g., series and grade) for position. Applicants must demonstrate proof of enrollment for the Spring 2021 or equivalent term, by submitting an official proof of enrollment letter from a   or a transcript indicating courses to be taken in the Spring 2021 or equivalent term. Unofficial transcripts are acceptable. NOTE: This vacancy may be used to fill other Student Intern (IT), GS-2299-04 positions throughout NOAA. The position must be alike (e.g.: the same qualifications and eligibility requirements as indicated in this vacancy announcement).  Qualifications Qualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards.  This handbook is available on the Office of Personnel Management's website located at:  . Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. To qualify at the GS-04 level: Completion of 2 full academic years of post-high school study or an associate's degree. OR Previous related education and/or experience. Special Provisions/or Interns with Previous Related Education or Experience.  Previous education and/or experience may be evaluated to determine the highest grade level for which the individual is qualified.  Education Definition of Student:  Student is defined as an individual accepted for enrollment or enrolled and seeking a degree (diploma, or certificate) in a qualifying academic institution, on a half or full-time basis.  Half-time is defined by the educational institution in which the student is enrolled.  Students do not have to be in actual physical attendance in school, online curriculums are acceptable as long as the school is accredited by the Department of Education. All academic degrees or course work must be completed in an educational institution that has obtained accreditation from an accrediting body recognized by the U.S. Department of Education.  For a list of schools that meet this criteria, see  .  College Transcript:   Applicants must submit a copy of their college transcript that lists college courses, course title, and number of credit hours. You may submit an unofficial copy of the transcript at the initial phase of the application process, but an official certified copy must be received before you can report to duty. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.   Additional information can be found here:   . Proof of Enrollment:   NOAA will use applicant's transcript as proof of enrollment in the identified college/university provided it demonstrates definition of eligible student. A letter from an educational institution indicating acceptance may be used as proof of enrollment for those students who are continuing studies at a new college or university or for those student whose transcripts do not reflect in-progress courses. An official transcript will be required before you can report to duty. Additional information PROGRAM COMPLETION AND CONVERSION:  For both Intern and Intern NTE, agencies have the discretion to consider interns for non-competitive conversion to term or permanent positions in the competitive services, provided that the intern has met all academic and Program requirements, and are within 120 days of academic program completion.  There is no guarantee for conversion. To be eligible for conversion, an Intern or eligible Intern NTE must:  Be a United States citizen or national;  Complete at least 640 hours of work experience acquired through the Program while enrolled as a half-time or full-time degree or certificate seeking student;  Complete a course of academic study, within the preceding 120-day period, at a qualifying educational institution conferring a diploma, certificate or degree;  Meet the qualification standards for the position to which she or he will be converted;  Receive a favorable recommendation by an official of the agency or agencies in which she or he served; and   Meet agency-specific requirements, as specified in the Participant Agreement. NOAA participates in e-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees.  How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above. \n          Your resume, supporting documents and responses to the online questionnaire will be reviewed to determine if you meet eligibility and minimum qualification requirements. Veterans preference applies to all selections made under the Pathways authority in accordance with CFR, Part 302.  To preview questions please  . Background checks and security clearance Security clearance Drug test required \n          No\n          \n          Required Documents\n          Required Documents The following documents are required for your application to be complete.  Our office cannot be responsible for incompatible software, illegible fax transmissions, delays in mail service, your system failure or downtime, etc.  Encrypted documents will not be accepted. Resume  must include: 1) personal information; to includes address 2) education; 3 work experience including work schedule, hours worked per week, dates of employment; and title, series and grade, if applicable; 4) supervisors phone number, e-mail address for each work period listed, and whether or not we may contact them for reference checks; and 5) other qualifications, such as unpaid volunteer work experience. Proof of enrollment  in school or acceptance of enrollment stipulating that you are in good academic standing. A copy of your most recent transcripts  which show your field of study, school name, students name, current GPA or academic standing, past and current course work, degree program, and major/concentration; an unofficial copy is sufficient with the application provided it contains the required information.  If selected, an official college transcript will be required prior to entering on duty.   You must submit the document below if you claim any of the following: If you are a veteran with preference eligibility and you are claiming 5-points veterans' preference,  you must submit a copy of your Member 4 DD-214 stating disposition of discharge or character of service or other valid proof of eligibility (i.e., statement of service that shows service dates AND character of service).  If you are claiming 10-point veterans' preference,  you must also submit an SF-15, \"Application for 10-Point Veterans' Preference\"  plus the proof required by that form.  For more information on veterans' preference see . Active Duty Service Members  You must submit a statement of discharge/certification of release or an official written document from the armed forces that certifies you are expected to be discharged or released from active duty service in the armed forces under honorable conditions no later than 120 days from the date the announcement closes. Enlisted Record Briefs and military identification do NOT qualify as official documentation. If the appropriate information is not submitted to confirm the discharge status, dates of service, etc., you will not be considered for this job opportunity under Veteran Preference procedures. To gain access to your DD-214 online please visit  . Failure to provide all of the required documents as stated in this vacancy announcement may result in lost consideration, an ineligible rating, or may affect the overall rating. \n          If you are relying on your education to meet qualification requirements:\n          \n          Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n          .\n          \n          Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n          \n          Benefits\n          Benefits \n          A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding.  .\n          NOAA offers a comprehensive benefits package that includes, in part, paid vacation; sick leave; holidays; life insurance; health benefits; and participation in the Federal Employees Retirement System.  This link provides an overview of the benefits currently offered to Federal employees:   .  Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered. \n          How to Apply\n          How to Apply Your complete application, including required documents, must be received by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. To apply on-line, you must complete and submit an application by accessing the USAJOBS website at http://www.usajobs.gov. To begin, click the Apply Online button near the bottom of this screen and follow the prompts to register into your USAJOBS account, answer the questions, and submit all required documents. To return to your saved application, log in to your USAJOBS account at http://www.usajobs.gov and click on \"Application Status.\" Click on the position title, and then select Apply Online to continue. If you have problems completing your on-line application, including problems submitting your supporting documents, please contact the Help Desk by e-mail at mgshelp@monster.com or by phone at (866) 656-6831. The help desk is available Monday-Friday, 7:00 a.m. to 7:00 p.m. ET For instructions on submitting your application in an alternate format, please contac",
        "index": 43,
        "skills": [
            "information technology",
            "hardware",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-04-01T10:00:00.000Z",
        "due": "2021-02-18T10:00:00.000Z",
        "contact": "mgshelp@monster.com",
        "remote": true
    },
    {
        "position": "Intern - Software Development",
        "company": "Pearson",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T03:16:51.809Z",
        "url": "https://www.internships.com/posting/bug_38955992253",
        "lastScraped": "2021-03-08T03:16:51.809Z",
        "description": "Job Information\n\nPearson Intern - Software Development in St. Paul, Minnesota\n\nIntern - Software Development - ( 2102777 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nSoftware Development\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nParticipate in the Development LifeCycle activities by being part of our development team during our Fall BTS Releases to Production and future planning\n\n*\n\nWork with several cross functional teams including Product Management, Developers, Architects, and Quality Engineers\n\n*\n\nSupport Automation of new product deployment verification.\n\n*\n\nParticipate in Proof of Concept creation to be leveraged for future development plans\n\n*\n\nLearn Pearson's Engineering Best Practices on our flagship Higher Education products\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr . This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Computer Science or related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Java, SQL, AWS, Google Cloud, React UI development, application architecture\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Regular\n\nReq ID: 2102777",
        "index": 44,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "GlobalGiving Fellowship Cohort 2021-2022",
        "company": "GlobalGiving",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:20:35.371Z",
        "url": "https://www.internships.com/posting/e9ba2d6b-feae-4a94-a0c3-95325ceb4296",
        "lastScraped": "2021-03-08T03:20:35.371Z",
        "description": "<p><strong class=\"ql-size-large\">Fellows Program Summary</strong></p><p>GlobalGiving is seeking applicants to our Fellows Program to help further our mission and ambitious growth plans. Fellows will have a unique opportunity to learn how a thriving, international NGO operates through practical, hands-on experience with the nuts and bolts of our operations and ample opportunities to explore the broader field of development.</p><p>The program is a highly selective, full-time service year that will challenge and inspire you, and will require hard work and dedication. You will have the opportunity to explore various areas that interest you, so you can capitalize on your experience. You’ll be a vital contributor to our team—not getting coffee or filing papers all day long.</p><p>In return, we offer a $38,600 salary, health and dental insurance, professional development funding, tons of learning opportunities, and an amazing experience!</p><p>Here’s a little taste of the kinds of experiences you might have as a GlobalGiving Fellow:</p><ul><li>Skill-building workshops to improve your understanding of international development, technology startups, social entrepreneurship, philanthropy, disaster response, and crowdfunding.</li><li>In-depth research and analysis projects around a particular issue area.</li><li>Training on experimentation, workflow, and querying tools such as Salesforce, Optimizely, MySQL, Metabase, and Zendesk.</li><li>Career preparation and professional development, including mock interviews and resume review. Previous fellows have used their professional development funds to take coding classes and even learn a new language!</li></ul><p>Due to COVID-19, our Washington, DC office is closed and all staff are working remotely. The 2021-2022 Fellowship cohort will have the option of doing their entire fellowship program remotely. When the office is able to safely open for staff, the cohort will be welcomed to work from the office or continue working remotely.</p><p><br></p><p><strong class=\"ql-size-large\">About GlobalGiving</strong></p><p>GlobalGiving’s mission is to transform aid and philanthropy to accelerate community-led change.&nbsp;</p><p>We help fellow nonprofits access the funding, tools, training, and support they need to serve their communities. Since 2002, the GlobalGiving community has raised more than $500 million from 1 million donors for 27,000 projects in 170+ countries. Each of the nonprofits on GlobalGiving.org has been rigorously vetted and has committed to providing donors regular updates about how donations are put to work.&nbsp;</p><p><br></p><p><strong class=\"ql-size-large\">Fellowship Focus Areas</strong><span class=\"ql-size-large\">&nbsp;</span></p><p>We have fellowship opportunities on four of our teams: Vetting and Grants, Disaster Recovery Network, Operations, and Business Partnerships. <em>You are welcome to apply to multiple fellowships, but please ensure that your application highlights why you are the best fit in that specific role. Learn more about our Fellowship program by visiting us at </em><strong><em>https://www.globalgiving.org/aboutus/who-we-are/fellows/.</em></strong></p><p><br></p><p><strong>Vetting and Grants Management Fellows</strong></p><p>The Vetting and Grant Management team interacts with nonprofit leaders in more than 170 countries to evaluate organizations that want to join GlobalGiving. Fellows use GlobalGiving’s tools to determine if new organizations are eligible to fundraise on the GlobalGiving platform or participate in a corporate partner program.</p><p><br></p><p>Candidates who are interested in international grantmaking, risk analysis, nonprofit governance, and cross-cultural communications are encouraged to apply.</p><p><br></p><p>Fellows will have the chance to:</p><ul><li>Conduct due diligence on nonprofit organizations from around the world for GlobalGiving’s programs; assess and provide recommendations on compliance, financial, reputation, and implementation risks.</li><li>Collaborate with the Program Team as part of a cross-functional team delivering the GlobalGiving Accelerator; participate in Accelerator planning, and support its management and execution.</li><li>Work with the Business Partnerships Team to deliver GlobalGiving’s corporate partner programs. Gain exposure to corporate social responsibility initiatives and international grantmaking programs; cultivate grantee relationships; coordinate grant agreements; assess grant proposals and/or reports.</li><li>Develop expertise in nonprofit law and regulations for countries around the world; build GlobalGiving’s country information database by contributing and curating research.</li><li>Use customer relationship management tools to cultivate, support, and track communications and relationships with donors and nonprofit organizations.</li><li>Author external-content to support nonprofit learning and development.</li><li>Apply creative and critical thinking to improve and innovate on processes and systems.</li></ul><p><br></p><p><br></p><p><strong>Operations Team Fellow</strong></p><p><br></p><p>The Operations Team (or Ops for short) builds and services the backbone of GlobalGiving and ensures tens of millions of dollars are dispersed across the globe each year. We are a close-knit team responsible for the accounting, finance and human resource functions of the organization, as well as supporting business intelligence and overarching strategic planning at GlobalGiving.&nbsp;</p><p><br></p><p>If you’ve got an analytical mind, an eye for detail, and a knack for knowing when the right question is more important than the right answer, we can’t wait to hear from you. We’re especially looking forward to meeting candidates who are excited to pick up projects and run with them! The Operations Fellow will:</p><p>&nbsp;</p><ul><li>Help fund community-led organizations all over the world. You’ll support the core financial operations of over $40M in contributions to organizations around the globe. By appropriately handling and designating contributions, you will help ensure delivery of funds to local organizations, from Albania to Zambia.</li><li>Help make international money transfers more accessible for grassroots nonprofits. Assist our Senior Disbursement Associate with fielding disbursement related questions from our nonprofit partners. Help to identify and communicate solutions to common and uncommon problems. Then help plan longer-term solutions by suggesting UX and/or process changes internally.</li><li>Help us fight crime! You’ll collaborate with our Data Scientist to detect, process, and prevent fraudulent activity on our website.</li><li>Let your geek out. You will use our data to identify and unpack key stories about GlobalGiving’s performance and share results via written reports and staff-wide presentations. You’ll help us understand where our systems and processes can be more efficient and contribute to finding creative solutions to make operations across the organization as effective as possible.</li><li>Level up your experience with SQL and Python. No previous experience necessary but an interest in learning and growing is a huge plus.</li><li>Perform additional tasks to support management or team members on brand new ideas or ongoing projects.</li></ul><p><br></p><p><br></p><p><strong>Business Partnerships Fellow</strong></p><p><br></p><p>Our Business Partnerships team works with Fortune 500 companies like 3M and Facebook to support their global citizenship goals. The team helps companies with employee engagement, consumer-facing campaigns, international grantmaking and more. Candidates with business analytics and/or marketing communications experience are encouraged to apply. Specifically, the Business Partnerships Fellow will:</p><ul><li>Scan media for opportunities to engage or provide content to corporate philanthropy and corporate social media discussions; assist in developing content for marketing and visibility purposes.</li><li>Support new and existing business partnerships by conducting research, having introductory calls, preparing proposals, assisting with outreach, building web pages, generating charitable gift cards, and creating impact reports.</li><li>Support corporate giving portfolios by communicating with employees, generating reports on programmatic activity, and identifying nonprofit partners for corporate campaigns and disaster recovery efforts, as necessary.</li><li>Work across teams to ensure corporate program deliverables and deadlines are met.</li><li>Track and attend webinars and conferences concerning corporate responsibility, employee engagement, and grantmaking.</li><li>Research and write articles about best practices in global corporate philanthropy with an eye toward new opportunities for GlobalGiving.</li><li>Serve as the first point of contact for companies and provide exceptional customer service to companies looking to partner with GlobalGiving.</li><li>Use customer relationship management tools to track communications with companies and discover outreach opportunities.</li><li>Apply creative and critical thinking to contribute to team learning, improvement, and innovation.</li></ul><p><br></p><p><br></p><p><strong>Disaster Response Fellow</strong></p><p><br></p><p>GlobalGiving’s crisis/disaster response work is one of our organization’s most visible and impact areas of focus. It involves virtually all GlobalGiving teams. When crises happen—from a hurricane in Texas to an earthquake in Nepal, to ongoing refugee crises around the world—the entire GlobalGiving community is activated to provide support. GlobalGiving responds to major disasters by posting general relief and recovery Funds, from which the Disaster Response Team then makes grants to our nonprofit partners working to serve impacted communities. We also provide support to the Business Partnership and other teams at GlobalGiving on corporate disaster response programs and other crisis-related activities.</p><p><br></p><p>In 2020, the Disaster Response Team provided critical support to hundreds of nonprofits helping communities affected by the COVID-19 pandemic, while also responding to hurricanes and storms across the globe, the explosion in Beirut as well as to the Australia and California wildfires. As an integral member of the team, the Disaster Response Fellow will:</p><p><br></p><ul><li>Monitor crises as they unfold and develop; conduct outreach to existing and new prospective nonprofit partners responding to disasters and crises globally to assist in both assessing needs and nonprofit partner capacity to inform GlobalGiving’s level of response.&nbsp;</li><li>Review partner disaster-related projects and grant reports.</li><li>Assist in the grantmaking process for GlobalGiving-managed “Funds”; support with setting Fund strategy, research potential grantees, review grant materials, and manage communication with GlobalGiving partners and selected grantee partners.&nbsp;</li><li>Develop and collaborate on human-centered stories and data-driven content; assist in creating externally-facing reports, impact stories and presentations.</li><li>Assist in cross-team initiatives to improve disaster grantees’ experience and engagement with GlobalGiving products and services.</li><li>Stay on the pulse of the crisis/disaster response sector, recommend virtual and physical conferences, participate in external calls/webinars and summarize learnings.</li><li>Manage customer service requests and inquiries sent to “disasters@globalgiving.org” by external stakeholders and GlobalGiving nonprofit partners.</li><li>Assist with research related to disaster Fund and donor data.</li><li>Other cool stuff that emerges throughout the year!</li></ul>",
        "index": 45,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "networks",
            "machine learning",
            "virtual reality",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Student Intern It , Gs",
        "company": "US Government",
        "location": {
            "city": "Honolulu",
            "state": "Hawaii"
        },
        "posted": "2021-03-08T03:32:01.129Z",
        "url": "https://www.internships.com/posting/bug_38953147651",
        "lastScraped": "2021-03-08T03:32:01.129Z",
        "description": "Student Intern (IT), GS-2299-04 (SUMMER INTERN) \n          Department of Commerce Overview \n          Accepting applications\n         \n          Open &amp; closing dates\n          02/18/2021  to  02/26/2021 \n          Service\n          \n          Excepted\n          \n          Pay scale &amp; grade\n          \n          GS 04\n          \n          Salary\n          $32,501 to $42,250 per year \n          Appointment type\n          \n          Summer - Not to Exceed (NTE) September 30, 2021. This position may be extended in 1 year increments.\n          \n          Work schedule\n          \n          Full-Time\n          Locations Few vacancies in the following locations: \n          Barrigada, GU \n          \n          Honolulu, HI \n          \n          Relocation expenses reimbursed\n          \n          No\n          \n          Telework eligible\n          \n          Yes as determined by agency policy\n          This job is open to \n          Students\n          \n          Current students enrolled in accredited educational institutions from high school to graduate level. Includes internships, pathways and other student programs.\n          Clarification from the agency \n          Students who are currently enrolled in an accredited educational institution in good academic standing. Good academic standing is determined by the educational institution, but is typically a Grade Point Average of a 2.0 on a 4.0 scale. Applicants must provide proof of current enrollment in school and documentation indicating acceptance in an accredited educational institution (if applicable).\n          Share\n     Announcement number \n          NWS-2021-0048\n          Control number \n          592642000\n          \n          Duties\n          Duties  Summary This Summer Internship opportunity will start no sooner than April 2021. Please note that if you are a Spring or Summer 2021 graduate, you will not be eligible for this Internship opportunity unless you are accepted for enrollment at a qualifying educational institution seeking an additional degree (diploma, Certificate, degree program, etc.) or an advanced degree.  You must submit proof of acceptance along with your current transcripts for consideration.  Responsibilities NOAA is seeking bright, innovative, results-oriented students who are pursuing a degree or certificate program in an accredited educational institution for our Summer Intern Program.  The NOAA Summer Intern Program targets students currently enrolled (or currently enrolled and accepted for enrollment) in a degree-seeking or Certificate program at least on a half-time basis. (Applicants who do not meet the definition of student by the closing date of the announcement will not be considered). Due to the current global situation, applicants may be eligible to work remotely. This is depending on the hiring office's needs and will be worked out on a case by case basis. *Travel, transportation, and relocation expenses will not be paid.  All travel, transportation, and relocation expenses associated with reporting for duty in this position will be the sole responsibility of the selected employee. Salary ranges will vary based on the location. Please visit:   for specific salary information related to a specific location. Cost of Living Allowance (COLA) for Honolulu, HI is 10.28%, and 12.62% for Barrigada, Guam and is not federally taxed. The COLA is not reflected in the locality salary shown in this vacancy announcement. COLAs are exempt from Federal income taxes; post differentials are not. Post Differential may be authorized for hires outside of the local area. May be eligible to applicants from the mainland, Alaska, or Hawaii. You may be entitled to 20% post differential allowance in addition to the salary for Guam. Post differentials are not exempt from Federal income taxes. Performs basic and clerical IT assignments, such as providing IT support for local and remote users; tracking and documenting customer support tickets; providing basic IT information to other employees within the office; maintaining incident databases; performing basic maintenance on different equipment and technology; participating in IT security tests; installing commercial software and hardware on government computers; observing the work of higher-grade specialists; and assisting higher-level specialists in more complex and intricate tasks. This position is not in the bargaining unit. Travel Required Not required \n          Supervisory status\n          \n          No\n          \n          Promotion Potential\n          \n          04\n          Job family (Series) \n          Requirements\n          Requirements  Conditions of Employment Must be a U.S. Citizen or National to apply. Required to pass a background investigation and fingerprint check. Must be suitable for Federal employment. Must be registered for Selective Service, if applicable (www.sss.gov) Must sign a Pathways Programs Participant Agreement. A minimum one year trial period will be required. Must be at least 16 years of age at the time of appointment. Upon successful completion of the Pathways Internship Program and completion of their academic degree or Certificate program, individuals may be non-competitively converted to a term position or permanent position in the Competitive Service. (see Other Information). ELIGIBILITY REQUIREMENTS: Intern and Interns NTE must:  Be accepted for enrollment or enrolled and seeking a degree or certificate in a   on a half-time to full-time basis (as determined by the educational institution);  Meet the definition of a student throughout the duration of their appointments;  Meet agency-specific requirements as specified in the agency's Participant Agreement with the Intern and;  Meet the qualification standards (e.g., series and grade) for position. Applicants must demonstrate proof of enrollment for the Spring 2021 or equivalent term, by submitting an official proof of enrollment letter from a   or a transcript indicating courses to be taken in the Spring 2021 or equivalent term. Unofficial transcripts are acceptable. NOTE: This vacancy may be used to fill other Student Intern (IT), GS-2299-04 positions throughout NOAA. The position must be alike (e.g.: the same qualifications and eligibility requirements as indicated in this vacancy announcement).  Qualifications Qualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards.  This handbook is available on the Office of Personnel Management's website located at:  . Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. To qualify at the GS-04 level: Completion of 2 full academic years of post-high school study or an associate's degree. OR Previous related education and/or experience. Special Provisions/or Interns with Previous Related Education or Experience.  Previous education and/or experience may be evaluated to determine the highest grade level for which the individual is qualified.  Education Definition of Student:  Student is defined as an individual accepted for enrollment or enrolled and seeking a degree (diploma, or certificate) in a qualifying academic institution, on a half or full-time basis.  Half-time is defined by the educational institution in which the student is enrolled.  Students do not have to be in actual physical attendance in school, online curriculums are acceptable as long as the school is accredited by the Department of Education. All academic degrees or course work must be completed in an educational institution that has obtained accreditation from an accrediting body recognized by the U.S. Department of Education.  For a list of schools that meet this criteria, see  .  College Transcript:   Applicants must submit a copy of their college transcript that lists college courses, course title, and number of credit hours. You may submit an unofficial copy of the transcript at the initial phase of the application process, but an official certified copy must be received before you can report to duty. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.   Additional information can be found here:   . Proof of Enrollment:   NOAA will use applicant's transcript as proof of enrollment in the identified college/university provided it demonstrates definition of eligible student. A letter from an educational institution indicating acceptance may be used as proof of enrollment for those students who are continuing studies at a new college or university or for those student whose transcripts do not reflect in-progress courses. An official transcript will be required before you can report to duty. Additional information PROGRAM COMPLETION AND CONVERSION:  For both Intern and Intern NTE, agencies have the discretion to consider interns for non-competitive conversion to term or permanent positions in the competitive services, provided that the intern has met all academic and Program requirements, and are within 120 days of academic program completion.  There is no guarantee for conversion. To be eligible for conversion, an Intern or eligible Intern NTE must:  Be a United States citizen or national;  Complete at least 640 hours of work experience acquired through the Program while enrolled as a half-time or full-time degree or certificate seeking student;  Complete a course of academic study, within the preceding 120-day period, at a qualifying educational institution conferring a diploma, certificate or degree;  Meet the qualification standards for the position to which she or he will be converted;  Receive a favorable recommendation by an official of the agency or agencies in which she or he served; and   Meet agency-specific requirements, as specified in the Participant Agreement. NOAA participates in e-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees.  How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above. \n          Your resume, supporting documents and responses to the online questionnaire will be reviewed to determine if you meet eligibility and minimum qualification requirements. Veterans preference applies to all selections made under the Pathways authority in accordance with CFR, Part 302.  To preview questions please  . Background checks and security clearance Security clearance Drug test required \n          No\n          \n          Required Documents\n          Required Documents The following documents are required for your application to be complete.  Our office cannot be responsible for incompatible software, illegible fax transmissions, delays in mail service, your system failure or downtime, etc.  Encrypted documents will not be accepted. Resume  must include: 1) personal information; to includes address 2) education; 3 work experience including work schedule, hours worked per week, dates of employment; and title, series and grade, if applicable; 4) supervisors phone number, e-mail address for each work period listed, and whether or not we may contact them for reference checks; and 5) other qualifications, such as unpaid volunteer work experience. Proof of enrollment  in school or acceptance of enrollment stipulating that you are in good academic standing. A copy of your most recent transcripts  which show your field of study, school name, students name, current GPA or academic standing, past and current course work, degree program, and major/concentration; an unofficial copy is sufficient with the application provided it contains the required information.  If selected, an official college transcript will be required prior to entering on duty.   You must submit the document below if you claim any of the following: If you are a veteran with preference eligibility and you are claiming 5-points veterans' preference,  you must submit a copy of your Member 4 DD-214 stating disposition of discharge or character of service or other valid proof of eligibility (i.e., statement of service that shows service dates AND character of service).  If you are claiming 10-point veterans' preference,  you must also submit an SF-15, \"Application for 10-Point Veterans' Preference\"  plus the proof required by that form.  For more information on veterans' preference see . Active Duty Service Members  You must submit a statement of discharge/certification of release or an official written document from the armed forces that certifies you are expected to be discharged or released from active duty service in the armed forces under honorable conditions no later than 120 days from the date the announcement closes. Enlisted Record Briefs and military identification do NOT qualify as official documentation. If the appropriate information is not submitted to confirm the discharge status, dates of service, etc., you will not be considered for this job opportunity under Veteran Preference procedures. To gain access to your DD-214 online please visit  . Failure to provide all of the required documents as stated in this vacancy announcement may result in lost consideration, an ineligible rating, or may affect the overall rating. \n          If you are relying on your education to meet qualification requirements:\n          \n          Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n          .\n          \n          Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n          \n          Benefits\n          Benefits \n          A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding.  .\n          NOAA offers a comprehensive benefits package that includes, in part, paid vacation; sick leave; holidays; life insurance; health benefits; and participation in the Federal Employees Retirement System.  This link provides an overview of the benefits currently offered to Federal employees:   .  Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered. \n          How to Apply\n          How to Apply Your complete application, including required documents, must be received by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. To apply on-line, you must complete and submit an application by accessing the USAJOBS website at http://www.usajobs.gov. To begin, click the Apply Online button near the bottom of this screen and follow the prompts to register into your USAJOBS account, answer the questions, and submit all required documents. To return to your saved application, log in to your USAJOBS account at http://www.usajobs.gov and click on \"Application Status.\" Click on the position title, and then select Apply Online to continue. If you have problems completing your on-line application, including problems submitting your supporting documents, please contact the Help Desk by e-mail at mgshelp@monster.com or by phone at (866) 656-6831. The help desk is available Monday-Friday, 7:00 a.m. to 7:00 p.m. ET For instructions on submitting your application in an alternate format, please contac",
        "index": 46,
        "skills": [
            "information technology",
            "hardware",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-04-01T10:00:00.000Z",
        "due": "2021-02-18T10:00:00.000Z",
        "contact": "mgshelp@monster.com",
        "remote": true
    },
    {
        "position": "Summer 2021 Internships- Paid & Remote",
        "company": "Council on Foreign Relations",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T03:32:15.354Z",
        "url": "https://www.internships.com/posting/5c532fc8-2bfb-44b3-8d65-0f370fb2b230",
        "lastScraped": "2021-03-08T03:32:15.354Z",
        "description": "<p>An intern’s duties generally consist of research, editing and writing, event coordination, and/or departmental support. Internships are offered in Digital Content, the Studies Program, Global Communications, Corporate Program, Washington Program, Meetings Program and many more, including&nbsp;<em>Foreign Affairs</em>.</p><p><br></p><p>Interns participate in CFR’s Intern Professional Development program, which complements their substantive work with a series of skill-based workshops, training, and career advice sessions. These events are designed to improve interns’ writing, editing, research, and program planning skills, while also helping to sharpen interns’ resumes and familiarize them with the multitude of foreign policy career paths and beyond.</p><p><br></p><p>CFR strives to include its interns in the full spectrum of its meetings and events programming, giving interns the opportunity to gain new insights on critical foreign policy issues and further their exposure to world leaders, U.S. policymakers, and sought-after experts. In addition, CFR offers a wide variety of events for staff and interns, including an award-winning health and wellness program. Events range from brown bag lunches with policy experts to a health fair, and an annual Ping-Pong championship.</p>",
        "index": 47,
        "skills": [],
        "remote": true
    }
]