[
    {
        "position": "Software Engineer Intern",
        "company": "Storj Labs",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:45:09.119Z",
        "url": "https://www.internships.com/posting/d16517e4-333d-4a61-ba79-36137d9aa031",
        "lastScraped": "2021-04-12T10:45:09.119Z",
        "description": "<p><strong>Storj Overview</strong></p><p><br></p><p><span>Storj is pioneering decentralized cloud storage with the world's first decentralized cloud storage network. We make object storage secure, private, and more resilient than other leading cloud storage providers. Our mission is to enable the decentralized future, and our vision is to be the storage layer for the decentralized internet. To do this, we need talented individuals who are equipped to succeed. With that in mind, we are excited to launch our 2021 Internship Program. The program will be 12 weeks long, starting in May 2021, and will place interns on teams to work with experienced engineers. This is a part-time role at 25 hours per week paid at a rate of $43 an hour.</span></p><p>&nbsp;</p><p><span>Though originally founded and headquartered in Atlanta, Storj is a remote-first company with team members worldwide. We’ve built a culture based on transparency, inclusion, and open communication, and we ensure that our team is equipped to succeed. Our people are our most important asset, and we strive to provide them with meaningful professional engagement. Storj promotes empowerment and progress through company-wide and personal training opportunities, proactive diversity efforts, and peer mentorship.&nbsp;</span></p><p>&nbsp;</p><p><span>In this vein of ownership and personal growth, you’ll have the opportunity to choose the team you’ll work with during your internship. Here are some of the teams who would love to work with you:</span></p><p>&nbsp;</p><ul><li><span>Growth Engineering -- </span>The Growth Engineering team focuses on improving the onboarding flow and experience of those interacting with the Storj network to store and download files. This includes components such as the website (Webflow), the Satellite web app (Go, VueJS, TypeScript, GraphQL), and the website's reverse proxy (Go, Caddy). This team will be ideal for people interested in front and backend development, as well as user research.</li></ul><p><br></p><ul><li><span>Infrastructure -- The Infrastructure team manages, monitors, and scales a complex and performant distributed system, spanning both on-premise and cloud-hosted infrastructure. We move fast, and we’re always disaster planning for when things will inevitably fail (re: multi-region, fault tolerance, high availability, etc.)</span></li></ul><p>&nbsp;</p><p><span>In addition to the work on your chosen team, you’ll have ample opportunities and resources to broaden your understanding of potential career paths, how teams work cross-functionally, the infrastructure and inner-operations of a growing company, and more, including:</span></p><p>&nbsp;</p><ul><li><span>Executive Lunch ‘N Learns</span></li><li><span>Cross-functional job shadowing</span></li><li><span>Intern presentations during bi-weekly all-company updates</span></li><li><span>Participation in the Storj Diversity, Equity, and Inclusion Council</span></li></ul><p><br></p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><ul><li><span>Reading code and design docs</span></li><li><span>Taking assigned tickets and working to solve problems involving:</span></li><li class=\"ql-indent-1\"><span>Writing code or tests</span></li><li class=\"ql-indent-1\"><span>Designing systems</span></li><li class=\"ql-indent-1\"><span>Performing operations</span></li><li class=\"ql-indent-1\"><span>Research</span></li><li class=\"ql-indent-1\"><span>Documentation</span></li><li><span>Reviewing code from your team, providing feedback and suggestions</span></li><li><span>Attending weekly meetings with your team of engineers</span></li><li><span>Reporting on your progress to your team lead and others</span></li></ul><p><br></p><p><br></p><p><strong>Must-Haves:</strong></p><p><br></p><ul><li><span>We will consider anyone from the following groups: students currently pursuing a degree in Computer Science, recent graduates of coding boot camps, people seeking to reenter the workforce following a sabbatical from work</span></li><li><span>Knowledge of computer science with experience building meaningful software applications in a class, as a personal hobby, as a job, or as part of an open source project</span></li><li><span>Experience in one or more programming languages or markup languages</span><em> OR</em><span> experience in one or more of the following tools/platforms: Kubernetes, Systemd, Docker, etc.</span></li></ul><p><br></p><p><br></p><p><strong>Our Commitment to Diversity, Equity, &amp; Inclusion:</strong></p><p><br></p><p><span>At Storj Labs, we celebrate diversity and strive for an inclusive work culture. More than a statement on our careers page, these concepts are ingrained in our core values:</span></p><p><br></p><p><strong>Secure</strong><span> - We believe security and privacy in product, process, and habit is key to everything we do.</span></p><p><br></p><p><strong>Together</strong><span> - We inspire, execute, and celebrate as one team, with a commitment to trust, inclusion, collaboration, and accountability.</span></p><p><br></p><p><strong>Open</strong><span> - We’re committed to the free and open sharing of software, information, knowledge, and ideas.</span></p><p><br></p><p><strong>Resolute</strong><span> - We have the courage to do the right thing, even if it is not the easy thing. We resolve always to treat others ethically, with empathy, understanding, and trust.</span></p><p><br></p><p><strong>Empowered</strong><span> - We empower our users to control their data, our teammates to do great work, and our community to build economic value.</span></p><p><br></p><p><strong>Different</strong><span> - We think differently, act differently, and always strive to make a difference.</span></p><p><br></p><p><span>We don’t make hiring or employment decisions on the basis of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other basis protected by applicable local, state or federal law. We also consider for employment qualified applicants with arrest and conviction records in a manner consistent with San Francisco’s Fair Chance Ordinance and similar local laws.</span></p><p><br></p><p><br></p>",
        "index": 1,
        "skills": [
            "project management",
            "software engineering",
            "networks",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Intern - Software Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:45:28.117Z",
        "url": "https://www.internships.com/posting/bug_38956592527",
        "lastScraped": "2021-04-12T10:45:28.117Z",
        "description": "Job Information\n\nPearson Intern - Software Engineer in St. Paul, Minnesota\n\nIntern - Software Engineer - ( 2102484 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards under the guidance of software engineer\n\n*\n\nFollows the Pearson practices and processes.\n\n*\n\nEscalates and communicates issues, risks, and concerns to the mentor\n\n*\n\nMakes effective use of engineering tools and technologies\n\n*\n\nBuilds competencies in product and technology domain to the desired level.\n\n*\n\nAligns self to organizational goals.\n\n*\n\nAdhere to Pearson values and ethical practices.\n\n*\n\nMaintains a sense of individuality in thinking and decision making.\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102484",
        "index": 2,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Programming Intern (Python)",
        "company": "Lemle & Wolff, Inc",
        "location": {
            "city": "New York",
            "state": "United States"
        },
        "posted": "2021-04-12T10:45:37.684Z",
        "url": "https://www.internships.com/posting/edd9f0d0-0c91-4571-8e7d-51cc3f1f6dac",
        "lastScraped": "2021-04-12T10:45:37.684Z",
        "description": "<p>This is an in-person internship. We are located in the Kingsbridge/Riverdale section of the Bronx. </p><p>Programmer will work with asset manager and finance team to work on database.</p>",
        "index": 3,
        "skills": [
            "project management",
            "python"
        ],
        "remote": false
    },
    {
        "position": "Programming Intern (Python)",
        "company": "Lemle & Wolff, Inc",
        "location": {
            "city": "New York",
            "state": "United States"
        },
        "posted": "2021-04-12T10:45:47.324Z",
        "url": "https://www.internships.com/posting/edd9f0d0-0c91-4571-8e7d-51cc3f1f6dac",
        "lastScraped": "2021-04-12T10:45:47.324Z",
        "description": "<p>This is an in-person internship. We are located in the Kingsbridge/Riverdale section of the Bronx. </p><p>Programmer will work with asset manager and finance team to work on database.</p>",
        "index": 4,
        "skills": [
            "project management",
            "python"
        ],
        "remote": false
    },
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:45:57.067Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-04-12T10:45:57.067Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>",
        "index": 5,
        "skills": [
            "data science",
            "machine learning",
            "python",
            "project management",
            "information technology",
            "artificial intelligence",
            "deep learning"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:46:15.991Z",
        "url": "https://www.internships.com/posting/bug_38956921730",
        "lastScraped": "2021-04-12T10:46:15.991Z",
        "description": "Job Information\n\nPearson Intern - Quality Engineer in St. Paul, Minnesota\n\nIntern - Quality Engineer - ( 2102887 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nQuality Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 1st and ends Friday, August 7th.\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for:\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\n*\n\nAbility to understand requirement and technical reference documents, charts, diagrams without a doubt and able to review and escalate any issues\n\n*\n\nResponsible for implementing test scenarios and test cases based on designed provided. peer reviewing QA artifacts such as test cases and test scenarios\n\n*\n\nAbility to develop parts of the test strategies and contribute test strategy design process\n\n*\n\nAbility to understand, troubleshoot and differentiate defects and requirement without a doubt\n\n*\n\nShould be able to support the Project team on Automation or Performance testing by creating and executing Automation/Performance scripts.\n\n*\n\nShould have a good knowledge of Automation and performance tools, architecture, framework and technologies used\n\n*\n\nAwareness of DB IDEs used\n\n*\n\nEffective communication with the team, leadership, internal and external customers covering all aspects of team needs.\n\n*\n\nAwareness of agile development practice and QA activities in the organization\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/ Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Mar 6, 2021\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102887",
        "index": 6,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:46:35.396Z",
        "url": "https://www.internships.com/posting/bug_38956921730",
        "lastScraped": "2021-04-12T10:46:35.396Z",
        "description": "Job Information\n\nPearson Intern - Quality Engineer in St. Paul, Minnesota\n\nIntern - Quality Engineer - ( 2102887 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nQuality Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 1st and ends Friday, August 7th.\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for:\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\n*\n\nAbility to understand requirement and technical reference documents, charts, diagrams without a doubt and able to review and escalate any issues\n\n*\n\nResponsible for implementing test scenarios and test cases based on designed provided. peer reviewing QA artifacts such as test cases and test scenarios\n\n*\n\nAbility to develop parts of the test strategies and contribute test strategy design process\n\n*\n\nAbility to understand, troubleshoot and differentiate defects and requirement without a doubt\n\n*\n\nShould be able to support the Project team on Automation or Performance testing by creating and executing Automation/Performance scripts.\n\n*\n\nShould have a good knowledge of Automation and performance tools, architecture, framework and technologies used\n\n*\n\nAwareness of DB IDEs used\n\n*\n\nEffective communication with the team, leadership, internal and external customers covering all aspects of team needs.\n\n*\n\nAwareness of agile development practice and QA activities in the organization\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/ Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Mar 6, 2021\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102887",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Cloud Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:46:54.595Z",
        "url": "https://www.internships.com/posting/bug_38956916505",
        "lastScraped": "2021-04-12T10:46:54.595Z",
        "description": "Job Details\n\n*\n\nIntern  Cloud Engineer\n\nJob Code Number\n\n11546422\n\nJob Description\n\nIntern  Cloud Engineer  ( 2102485 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nCloud Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\n*\n\nDeveloping software to support managing Pearson's AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party API's\n\n*\n\nPython and Go development in support of these API's\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102485\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 8,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:47:13.860Z",
        "url": "https://www.internships.com/posting/bug_38956592527",
        "lastScraped": "2021-04-12T10:47:13.860Z",
        "description": "Job Information\n\nPearson Intern - Software Engineer in St. Paul, Minnesota\n\nIntern - Software Engineer - ( 2102484 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\n*\n\nInterns should be within driving distance of office location\n\nJob description\n\nOverall Responsibilities:\n\n*\n\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards under the guidance of software engineer\n\n*\n\nFollows the Pearson practices and processes.\n\n*\n\nEscalates and communicates issues, risks, and concerns to the mentor\n\n*\n\nMakes effective use of engineering tools and technologies\n\n*\n\nBuilds competencies in product and technology domain to the desired level.\n\n*\n\nAligns self to organizational goals.\n\n*\n\nAdhere to Pearson values and ethical practices.\n\n*\n\nMaintains a sense of individuality in thinking and decision making.\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102484",
        "index": 9,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:47:33.119Z",
        "url": "https://www.internships.com/posting/bug_38956950015",
        "lastScraped": "2021-04-12T10:47:33.119Z",
        "description": "Job Information\n\nPearson Intern - Machine Learning Engineer in St. Paul, Minnesota\n\nIntern - Machine Learning Engineer - ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, time-series analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearsons customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearsons customers\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, self-directed, self-motivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102488",
        "index": 10,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:47:52.324Z",
        "url": "https://www.internships.com/posting/bug_38956906827",
        "lastScraped": "2021-04-12T10:47:52.324Z",
        "description": "Job Details\n\n*\n\nIntern  Machine Learning Quality Engineer\n\nJob Code Number\n\n11544411\n\nJob Description\n\nIntern  Machine Learning Quality Engineer  ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou'll be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, timeseries analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearson's customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearson's customers\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, selfdirected, selfmotivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102488\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 11,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Cloud Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:48:11.726Z",
        "url": "https://www.internships.com/posting/bug_38956916505",
        "lastScraped": "2021-04-12T10:48:11.726Z",
        "description": "Job Details\n\n*\n\nIntern  Cloud Engineer\n\nJob Code Number\n\n11546422\n\nJob Description\n\nIntern  Cloud Engineer  ( 2102485 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nCloud Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nJob description\n\n*\n\nDeveloping software to support managing Pearson's AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party API's\n\n*\n\nPython and Go development in support of these API's\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nEnhancing the Deployment framework used to create and configure infrastructure on the cloud, adhering to Industry best practices for scalability, resiliency and security\n\n*\n\nImprove the automation process using Infrastructure as Code (IaC) and standardizing how microservices and built to operate at scal.\n\n*\n\nLearn and pilot some of the latest cloud services to solve real world problems and learn how to run optimized workloads and adhere to cloud governance\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Excel, SQL, AWS, Google Cloud, Java, Go, Python, R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 23, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102485\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 12,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "sql",
            "java",
            "machine learning",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Systems Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:48:31.534Z",
        "url": "https://www.internships.com/posting/bug_38956956501",
        "lastScraped": "2021-04-12T10:48:31.534Z",
        "description": "Job Information\n\nPearson Intern - Software Systems Engineer in St. Paul, Minnesota\n\nIntern - Software Systems Engineer - ( 2102486 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Systems Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nDeveloping software to support managing Pearsons AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party APIs\n\n*\n\nPython and Go development in support of these APIs\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nHelp build the Service Delivery platform, to setup, enhance and maintain application services like load balancing, security controls and traffic management.\n\n*\n\nBuild automation to setup and maintain monitoring, logging, distributed tracing, metrics &amp; reporting systems for fine-grained observability and actionable alerts\n\n*\n\nLeverage AWS machine learning and Artificial Intelligence capabilities to analyze system metrics and customer traffic to build intelligent alerts and state of the art Dashboards.\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problem-solving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Python , Excel, SQL, AWS, Java, Go, , R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102486",
        "index": 13,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "sql",
            "java",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Software Systems Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:48:51.056Z",
        "url": "https://www.internships.com/posting/bug_38956919563",
        "lastScraped": "2021-04-12T10:48:51.056Z",
        "description": "Job Details\n\n*\n\nIntern  Software Systems Engineer\n\nJob Code Number\n\n11544406\n\nJob Description\n\nIntern  Software Systems Engineer  ( 2102486 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM 2021\n\nSoftware Systems Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou will be paid for the duration of your internship. The internship begins on Monday, June 7th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nDeveloping software to support managing Pearson's AWS cloud estate at scale\n\n*\n\nWorking with REST API development methodologies for both internal and 3rd party API's\n\n*\n\nPython and Go development in support of these API's\n\n*\n\nUsing serverless technologies for application development including containers and lambda functions\n\n*\n\nUsing development tools and practices for agile software development practices\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nWhat are we looking for in an Intern\n\n*\n\nEnrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nHelp build the Service Delivery platform, to setup, enhance and maintain application services like load balancing, security controls and traffic management.\n\n*\n\nBuild automation to setup and maintain monitoring, logging, distributed tracing, metrics &amp; reporting systems for finegrained observability and actionable alerts\n\n*\n\nLeverage AWS machine learning and Artificial Intelligence capabilities to analyze system metrics and customer traffic to build intelligent alerts and state of the art Dashboards.\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nCreative and innovative skills with regards to knowledge and awareness of industry trends and digital advances as they relate to new opportunities and business needs\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nA strategic thinker and listener who acquires good problemsolving techniques\n\n*\n\nAn organized team player who can manage multiple tasks\n\n*\n\nFamiliarity with Python , Excel, SQL, AWS, Java, Go, , R, QL, TensorFlow, or Tableau\n\n*\n\nMin 3.0 GPA\n\n*\n\nGraduation date between 2022 and 2023\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102486\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 14,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology",
            "sql",
            "java",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "EPA Bioinformatics and Data Science Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-13T10:49:00.918Z",
        "url": "https://www.internships.com/posting/cd96c04d-fdc4-4866-bab7-cece8611268c",
        "lastScraped": "2021-04-12T10:49:00.918Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Biomolecular &amp; Computational Toxicology Division (BCTD) located in Research Triangle Park, North Carolina.</p><p><br></p><p>The EPA&nbsp;CCTE is responsible for developing new experimental models that can be used to evaluate the potential for chemicals to produce adverse effects on human and ecological health for improving environmental risk assessments and regulatory decisions pertaining to chemical safety and sustainability.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This project aims to develop computational models to predict the safety of chemicals without running tests on whole animals. The tools to be used include high-throughput transcriptomic screening data across multiple cell lines, databases of previously run animal studies, data from other in vitro high-throughput screening experiments, data and models for in vitro to in vivo extrapolation of dose, and outputs of various predictive models of chemical action. The project integrates bioinformatics, data science, software engineering, applied statistics, and predictive mathematical modeling, with the broader goal of advancing safety assessment using new approach methodologies.</p><p><br></p><p>Under the guidance of a mentor, the research participant will learn to develop novel bioinformatics and biostatistics applications to integrate multiple data streams relevant to toxicological testing, including transcriptomics, biochemical assays, and other high-throughput screening methods. Research activities may include:</p><ol><li>Helping develop models to predict toxicological outcomes of animal testing from in vitro assays</li><li>Helping develop&nbsp;a data science infrastructure to simulate outcomes of tiered testing strategies that combine multiple in vitro screening methods</li><li>Learning how to curate and manage large-scale heterogeneous chemical safety screening data</li><li>Evaluating additional methods to integrate data across screening studies.</li></ol><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>This is a research training opportunity where in the candidate will gain education and training in the general areas of bioinformatics data science, transcriptomics, computational toxicology, and mathematical modeling in preparation for future career opportunities across government, industry, and academic sectors.</p><p><br></p><p>The research participant may also&nbsp;author or co-author on peer-reviewed publications, and present at local and national meetings. The participant will be a member of a multi-disciplinary research team.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity&nbsp;are&nbsp;Katie Paul-Friedman (paul-friedman.katie@epa.gov) and Logan Everett (Everett.logan@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 15,
        "skills": [
            "data science",
            "project management",
            "bioinformatics",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-13T10:49:10.482Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-04-12T10:49:10.482Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>",
        "index": 16,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Intern - Machine Learning Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:49:29.354Z",
        "url": "https://www.internships.com/posting/bug_38956575513",
        "lastScraped": "2021-04-12T10:49:29.354Z",
        "description": "Job Information\n\nPearson Intern - Machine Learning Quality Engineer in St. Paul, Minnesota\n\nIntern - Machine Learning Quality Engineer - ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, time-series analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearsons customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearsons customers\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, self-directed, self-motivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102488",
        "index": 17,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Engineer",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-13T10:49:48.624Z",
        "url": "https://www.internships.com/posting/bug_38956950015",
        "lastScraped": "2021-04-12T10:49:48.624Z",
        "description": "Job Information\n\nPearson Intern - Machine Learning Engineer in St. Paul, Minnesota\n\nIntern - Machine Learning Engineer - ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns - Helping shape the future of education\n\nWhy join Pearsons intern program?\n\nPearson is the worlds learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; were shaping the future of teaching and learning.\n\nWere looking for the next generation of talented undergraduates to join our team for an unforgettable 10-week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. Youll be assigned to a team and work on real-life projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. Youll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the ten-week program.\n\nWe foster a work environment thats inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYoull be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, time-series analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearsons customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearsons customers\n\nThe anticipated starting salary range for Colorado-based individuals expressing interest in this position is $30/hr. This position is not bonus eligible.\n\nBenefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, self-directed, self-motivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : US-RE-Remote\n\nOther Locations : US-California\n\nWork Locations :\n\nUS-Remote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Full-time Temporary\n\nReq ID: 2102488",
        "index": 18,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:50:08.735Z",
        "url": "https://www.internships.com/posting/bug_38956906827",
        "lastScraped": "2021-04-12T10:50:08.735Z",
        "description": "Job Details\n\n*\n\nIntern  Machine Learning Quality Engineer\n\nJob Code Number\n\n11544411\n\nJob Description\n\nIntern  Machine Learning Quality Engineer  ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou'll be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, timeseries analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearson's customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearson's customers\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, selfdirected, selfmotivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102488\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 19,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Machine Learning Quality Engineer",
        "company": "N/A",
        "location": {
            "city": "Michigan",
            "state": "United States"
        },
        "posted": "2021-03-13T10:50:28.396Z",
        "url": "https://www.internships.com/posting/bug_38956906827",
        "lastScraped": "2021-04-12T10:50:28.396Z",
        "description": "Job Details\n\n*\n\nIntern  Machine Learning Quality Engineer\n\nJob Code Number\n\n11544411\n\nJob Description\n\nIntern  Machine Learning Quality Engineer  ( 2102488 )\n\nDescription\n\nPEARSON INTERNSHIP PROGRAM\n\nMachine Learning Engineer\n\nPearson Interns  Helping shape the future of education\n\nWhy join Pearson's intern program?\n\nPearson is the world's learning company. We help people of all ages acquire the knowledge and skills they need to be successful in their work and careers. We believe that everyone should be able to keep learning, every day and in every way, throughout their lives. Bringing together everything we know about the science of learning and the latest technology; we're shaping the future of teaching and learning.\n\nWe're looking for the next generation of talented undergraduates to join our team for an unforgettable 10week internship. An internship at Pearson is an opportunity to bring your own unique perspective as a learner, together with your academic knowledge, technical skills, and enthusiasm, to help create products used by students like you.\n\nAs one of our interns, you will gain a comprehensive introduction to our business. You'll be assigned to a team and work on reallife projects that bring our products and services to life. On the job training and professional development will be provided to enable you to contribute to the business. You'll also have direct access to a senior member of the team, as each intern will be mentored to help you make the most of the tenweek program.\n\nWe foster a work environment that's inclusive as well as diverse, where our people can be themselves. Every idea and perspective is valued so that our products reflect the people we serve  our teachers and learners.\n\nWhat Does the Internship Program Offer?\n\nSuccessful candidates will spend 10 weeks working with our technology teams.\n\nYou'll be paid for the duration of your internship. The internship begins on Monday, June 7 th and ends Friday, August 13 th .\n\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nJob description\n\n*\n\nAbility to understand and capture product requirements and technical solutions through charts, diagrams, and data\n\n*\n\nManipulating data using statistical analysis techniques such as machine learning, timeseries analysis, multiple linear/logistic regression, anomaly detection, forecasting and simulation.\n\n*\n\nUser data and analysis to understand and optimize Pearson's customer experience\n\n*\n\nDevelop reports and visualizations for internal department sharing learned insights into Pearson's customers\n\nThe anticipated starting salary range for Coloradobased individuals expressing interest in this position is $30/hr. This position is not bonus eligible. Pearson is an Equal Opportunity and Affirmative Action Employer and a member of EVerify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n\nQualifications\n\n*\n\nrolled in an undergraduate or graduate technical degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, or a related field\n\n*\n\nThe ideal candidate will be detail oriented, selfdirected, selfmotivated, with a strong capacity for working successfully and flexibly with team members\n\n*\n\nStrong communication skills with the ability to discuss any issues with a wide variety of individuals and groups\n\n*\n\nAbility to work autonomously\n\n*\n\nAbility to learn quickly and apply learning to problems or activities\n\n*\n\nPrevious project work in using or presenting quantitative data analysis\n\n*\n\nPrevious use of tools such as SQL, python, Snowflake, Databricks, Tableau preferred\n\nPrimary Location : USRERemote\n\nOther Locations : USCalifornia\n\nWork Locations :\n\nUSRemote\n\nRemote\n\nJob : Project/Temporary Workforce\n\nOrganization : Technology &amp; Operations\n\nEmployee Status : Fixed Term\n\nJob Type : Internship\n\nJob Level : Entry Level\n\nShift : Day Job\n\nJob Posting : Feb 22, 2021\n\nJob Unposting : Ongoing\n\nSchedule: : Fulltime Temporary\n\nReq ID: 2102488\n\n\n\nOrganization Profile\n\nEmployer Name:\n\nDirect Employers\n\nAddress:\n\n9002 N. Purdue Rd.\n\nAddress Line 2:\n\nSuite 100\n\nCity:\n\nIndianapolis\n\nState/Province/Region:\n\nIndiana\n\nZip/Postal Code:\n\n46268\n\nDescription:\n\nDirectEmployers Association is a nonprofit HR consortium of leading global employers formed to improve labor market efficiency through the sharing of best practices, research and the development of technology. In accordance with its Corporate By",
        "index": 20,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:50:38.678Z",
        "url": "https://www.internships.com/posting/ccm_95b5ee54-01bf-4c11-a351-eb453bd3c788",
        "lastScraped": "2021-04-12T10:50:38.678Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 21,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "artificial intelligence",
            "networks",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "EPA Postdoctoral Fellowship in Bioinformatics and Computational Toxicology",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-13T10:50:48.471Z",
        "url": "https://www.internships.com/posting/e57e2a5a-096b-4232-87b3-bb630ca8a4fb",
        "lastScraped": "2021-04-12T10:50:48.471Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>Two research opportunities are&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE),&nbsp;Great Lakes Toxicology&nbsp;&amp;&nbsp;Ecology Division (GLTED) located in Research Triangle Park, North Carolina or Cincinnati, Ohio.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The Agency is faced with significant challenges related to characterizing the modes of action of chemicals, the effects of exposures to mixtures of chemicals, and in finding ways to group chemicals that facilitates read-across from data rich to data poor chemicals.&nbsp;The Molecular Indicators Branch within the Office of Research and Development is addressing these challenges through the characterization of molecular responses in aquatic organisms exposed to chemicals.&nbsp;In large part, MIB targets transcriptomic and epigenetic responses using next generation sequencing (NGS)-based tools (RNA-seq, reduced representation bisulfite sequencing - RRBS) to develop biomarkers that can discriminate chemical classes and provide an understanding of impacted biological processes and pathways.&nbsp;There are also opportunities to explore and analyze other omics data including metabolomic and proteomic data from whole animal responses and multigenerational studies.&nbsp;The research participant will be part of a team involved in designing of laboratory experiments, NGS data analysis and data interpretation, design and development of new statistical methods for integrated omics data analysis, and in the communication of results intra- and extramurally.&nbsp;The research participant will be trained in molecular genetics, bioinformatics, statistics, machine learning algorithms for big data analytics, and advanced statistical analysis of complex omics data sets.</p><p><br></p><p>With guidance from the mentor, the research participant may be involved in the following training activities:</p><ul><li>Learning how to develop statistical methods and tools to analyze NGS-based gene expression and epigenetic data</li><li>Learning how to design analysis pipelines and perform analysis of RNA-seq, RRBS, other omics environmental exposure data</li><li>Providing biological context and interpretation of NGS data to characterize chemical MOA</li><li>Applying machine learning algorithms for identification of biomarkers and classification of environmental toxicants</li><li>Contributing to the preparation of peer-reviewed journal articles and disseminating research results to project partners, stakeholders, and the research community</li><li>Presenting research at regional, national, and/or international conferences and workshops</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will be afforded the opportunity to interact with internationally recognized leaders, both within and outside the EPA, the area of bioinformatics and in ecotoxicogenomics.&nbsp;The research participant will have the opportunity to contribute to and to publish original research. This training opportunity will provide an early career scientist with knowledge, skills, and abilities needed to apply new technologies and associated data to regulatory decision-making at the local, national, or international scale and to pursue a professional career in life sciences research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Weichun Huang&nbsp;(huang.weichun@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed three to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 22,
        "skills": [
            "machine learning",
            "bioinformatics",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:50:58.736Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-04-12T10:50:58.736Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>",
        "index": 23,
        "skills": [
            "project management",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "EPA Toxicokinetic Models Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-13T10:51:09.276Z",
        "url": "https://www.internships.com/posting/2dc66130-0497-43e6-a0f4-81f39161364c",
        "lastScraped": "2021-04-12T10:51:09.276Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Characterizing the uncertainty in the predictions of toxicokinetic models, including predictions based upon in vitro data, requires comparison to in vivo data. This research project works to address the current major sources of uncertainty in high-throughput toxicokinetics (HTTK).&nbsp;The basic outline of this research project is to conduct: 1) in vitro metabolic clearance assays of selected environmental chemicals using human and rat microsomal preparations; 2) protein binding assays with the environmental chemicals; 3) in vivo toxicokinetic studies with the environmental chemicals.&nbsp;The research participant may prepare dosing solutions of selected environmental chemicals, conduct in vitro microsomal clearance and protein binding assays, conduct in vivo toxicokinetic studies which involves dosing rats and collecting blood samples, processing samples for analytical analysis, and compiling and graphing data. With the in vitro clearance and binding data, in vivo toxicokinetic predictions can be developed using established toxicokinetic models. The in vivo predictions can then be compared to the determined in vivo toxicokinetic data.&nbsp;Sources of variability between the predicted versus the determined toxicokinetic can then be assessed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will learn about in vitro and in vivo toxicokinetics, toxicokinetic modeling, analytical chemistry, in vitro to in vivo extrapolation, good practices in quality assurance and working with laboratory animals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.michaelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or&nbsp;four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 24,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:51:19.427Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-04-12T10:51:19.427Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>",
        "index": 25,
        "skills": [
            "project management",
            "information technology"
        ],
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "Data Analyst Intern",
        "company": "Dean Pest Control",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:51:31.409Z",
        "url": "https://www.internships.com/posting/95867f21-7d45-44a0-97a6-daf68b47c9e1",
        "lastScraped": "2021-04-12T10:51:31.409Z",
        "description": "<p>Are you curious by nature and passionate about data, analytics, and digital marketing? We are looking for a Data Analyst Intern, this would be a great opportunity to learn from and work with our Data Science team! You'll get valuable experience with us,</p><p><br></p><p>• Translate business needs/requirements into data reports and strategies</p><p>• Provide clear, insightful interpretation of available internal and external data</p><p>• Support the Customer Service Representatives and Team Leaders in the setup and troubleshooting of the Call Monitoring System, SAP, Telecom and other systems.</p><p>• Identifying &amp; documenting Data Errors &amp; Inconsistencies</p><p>• Perform data quality and accessibility testing and verification of data Knowledge, Skills, &amp; Abilities</p><p>• Assisting in development of the Data Warehouse.</p><p>• Facilitates working sessions between customers and IT teams to define business requirements.</p><p>• Performs other duties as assigned.</p>",
        "index": 26,
        "skills": [
            "information technology",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "EPA Toxicokinetic Models Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-13T10:51:43.496Z",
        "url": "https://www.internships.com/posting/2dc66130-0497-43e6-a0f4-81f39161364c",
        "lastScraped": "2021-04-12T10:51:43.496Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;Characterizing the uncertainty in the predictions of toxicokinetic models, including predictions based upon in vitro data, requires comparison to in vivo data. This research project works to address the current major sources of uncertainty in high-throughput toxicokinetics (HTTK).&nbsp;The basic outline of this research project is to conduct: 1) in vitro metabolic clearance assays of selected environmental chemicals using human and rat microsomal preparations; 2) protein binding assays with the environmental chemicals; 3) in vivo toxicokinetic studies with the environmental chemicals.&nbsp;The research participant may prepare dosing solutions of selected environmental chemicals, conduct in vitro microsomal clearance and protein binding assays, conduct in vivo toxicokinetic studies which involves dosing rats and collecting blood samples, processing samples for analytical analysis, and compiling and graphing data. With the in vitro clearance and binding data, in vivo toxicokinetic predictions can be developed using established toxicokinetic models. The in vivo predictions can then be compared to the determined in vivo toxicokinetic data.&nbsp;Sources of variability between the predicted versus the determined toxicokinetic can then be assessed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will learn about in vitro and in vivo toxicokinetics, toxicokinetic modeling, analytical chemistry, in vitro to in vivo extrapolation, good practices in quality assurance and working with laboratory animals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Michael Hughes (hughes.michaelf@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or&nbsp;four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 27,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "USFS Bioacoustics Monitoring Program",
        "company": "ORISE",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-04-12T10:51:55.997Z",
        "url": "https://www.internships.com/posting/8de07b29-f7ea-4a7e-83dd-430276792b65",
        "lastScraped": "2021-04-12T10:51:55.997Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A&nbsp;research opportunity is&nbsp;available at the USDA Forest Service located in Springfield, Oregon.&nbsp;Research will take place in Oregon’s Cascade Range, near the HJ Andrews Study Area and Blue River, Oregon.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p>The mission of the Ecological Process and Function Program is to advance and communicate knowledge of fundamental ecological processes and interactions&nbsp;across scales and develop applications of this knowledge to enable improved management of ecosystems and resources.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The Bioacoustics Monitoring Program conducts passive bioacoustics research as an alternative method to monitor trends in wildlife populations that takes advantage of technological advancements in non-invasive detection equipment.&nbsp;</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant&nbsp;will gain first-hand, on the ground experience with logistics involved with conducting bioacoustics wildlife monitoring using autonomous recording units in remote mountainous areas to monitor for the presence of wildlife, including spotted owls, and other birds and mammals. Participant will also learn about emerging artificial intelligence frameworks and data organizational structures used for efficiently analyzing large amounts of bioacoustics data and will have the opportunity to connect with researchers on the forefront of this evolving field of wildlife research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Todd Wilson (todd.wilson@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring/Summer 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for three months, but may be&nbsp;renewed upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>",
        "index": 28,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "USDA-ARS High Performance Computing and Prediction of Geospatial Dynamics Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-13T10:52:08.101Z",
        "url": "https://www.internships.com/posting/ccm_929e68d0-31b8-4796-a497-54460da6b2d4",
        "lastScraped": "2021-04-12T10:52:08.101Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of pests and animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with high performance computing (HPC) or cloud computing provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions. Under the guidance of a mentor, the participant will learn AI technologies relevant to these problems, and will help develop and co-lead ARS-wide workshops resulting in a community of scientific practice on geospatial problems with AI.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The&nbsp;participant will have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses and AI across multiple spatial and temporal scales.</p>",
        "index": 29,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "EPA Water Quality Assessment Analysis Fellowship",
        "company": "ORISE",
        "location": {
            "city": "District of Columbia",
            "state": "United States"
        },
        "posted": "2021-03-13T10:52:20.570Z",
        "url": "https://www.internships.com/posting/e6a64e43-6f4d-4225-8de4-018460bfe327",
        "lastScraped": "2021-04-12T10:52:20.570Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>One to two&nbsp;research opportunities are available at the U.S. Environmental Protection Agency (EPA) in the Office of Water (OW), Office of Wetlands, Oceans and Watersheds (OWOW) Nonpoint source Program located in Washington D.C.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA research project involving research and&nbsp;analysis focused on the successful use of Clean Water Act Section 319 nonpoint source funding for achieving water quality improvements, as well as researching state Nonpoint Source Management Plans and local scale watershed plans.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor the participant will have the opportunity to:</p><ul><li>evaluate water quality results in proposed nonpoint success stories from state agencies prior to publication</li><li>evaluate implementation of best management practices and water quality monitoring for controlling nonpoint source pollution</li><li>analyze effective approaches and measures in watershed planning to protect water quality</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for these opportunities is Cynthia Curtis (Curtis.cynthia@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for one year and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>At this time, master's degree stipends are ~$60,129 per year. Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 30,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "EPA Health Effects of Harmful Algal Blooms (HABs) Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-13T10:52:32.818Z",
        "url": "https://www.internships.com/posting/21f9f6ef-3224-483e-9bc1-9500ac9d08ee",
        "lastScraped": "2021-04-12T10:52:32.818Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants.&nbsp;Results of this research are published in peer-reviewed journals and inform EPA's environmental assessments and human health guidelines. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies.&nbsp;This research opportunity will use animal models to evaluate the health effects of cyanotoxins resulting from exposure to harmful algal blooms (HABs) in freshwater bodies (lakes, ponds, and rivers) and is part of the EPA National Program of Safe and Sustainable Water Research.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>This research project addresses cyanobacterial toxins in U.S. fresh waters. These toxins include compounds that adversely affect the liver (cylindrospermopsins and microcystins) and neurotoxins that affect normal functions of the central nervous system (saxitoxins and anatoxins).&nbsp;This research appointment would offer the research participant experience in the development and execution of animal studies to address this important data gap.&nbsp;There will be opportunities to contribute to animal study design, use equipment to evaluate study endpoints such as blood pressure and heart rate monitoring and serum chemistry analysis, and participate in data analysis.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong></p><ul><li>Critical thinking in toxicological research in general and of HAB toxins impact in the US and globally in particular</li><li>Gaining knowledge base of cyanotoxin health effects</li><li>Performing laboratory animal husbandry including handling and health assessments of rodents</li><li>Collecting and interpreting data parameters for toxicological assessment</li><li>Learning serum chemistry analysis techniques, necropsy, and tissue preparation</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity&nbsp;are Donna Hill (hill.donna@epa.gov) and Chris Lau (lau.christopher@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 31,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "FDA CDER Summer 2021 Research Participation Program",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:52:45.322Z",
        "url": "https://www.internships.com/posting/ccm_7b3e203a-6018-4237-8095-7d88403e08f9",
        "lastScraped": "2021-04-12T10:52:45.322Z",
        "description": "<p><strong>*Although the application deadline is April 16th, mentors will start reviewing submitted applications before the deadline.</strong></p><p><br></p><p>Summer research&nbsp;opportunities&nbsp;are&nbsp;available at the U.S. Food and Drug Administration (FDA),&nbsp;Center for Drug Evaluation and Research (CDER).&nbsp;</p><p><br></p><p>The Center for Drug Evaluation and Research&nbsp;(CDER) performs an essential public health task by making sure that safe and effective drugs are available to improve the health of people in the United States.&nbsp;As part of the U.S. Food and Drug Administration (FDA), CDER regulates over-the-counter and prescription drugs, including biological therapeutics and generic drugs. CDER's mission is to protect and promote health by helping to ensure that these&nbsp;human drugs are safe and effective for their intended use, that they meet established quality standards, and that they are available to patients who need them.</p><p><br></p><p>Participants will have an opportunity to gain a&nbsp;hands-on research experience on a variety&nbsp;of regulatory research projects related to CDER's mission. The program is&nbsp;designed&nbsp;for participants to engage with&nbsp;an expert&nbsp;mentor or mentors during&nbsp;the summer to examine a&nbsp;question of interest&nbsp;related to those projects within the placement office.&nbsp;Past projects have been related to: drug metabolism, bio-statistical questions, in-vitro models for drug toxicology, safety and efficacy, benefit-risk assessments, etc.&nbsp;</p><p>Both full-time and part-time appointments are typically available. Anticipated start day is on or around May 3, 2021, but can be negotiated with the mentor to commence on any Monday throughout the summer in order to best align with school and/or vacation schedules.&nbsp;</p><p><br></p><p>Based on pandemic response, participants may be able to participate from an alternate location on a temporary basis.&nbsp;However, at the time when Mentors and FDA Staff return to their usual on-site work schedule, participants will no longer be able to conduct training from an off-site location and will be expected to report to the site in Silver Spring, Maryland or St. Louis, Missouri.</p><p><br></p><p>To avoid conflict of interest, participants cannot be placed in the same CDER program office where a relative works.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for&nbsp;2-3 months, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is&nbsp;part-time or full-time&nbsp;at FDA in the Silver Spring, Maryland or St. Louis, Missouri areas. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul>",
        "index": 32,
        "skills": [
            "project management",
            "information technology"
        ],
        "start": "2021-04-16T10:00:00.000Z",
        "due": "2021-04-16T10:00:00.000Z",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "Financial Triangle Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:52:58.113Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-04-12T10:52:58.113Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>",
        "index": 33,
        "skills": [
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "USDA-ARS Research Opportunity in Geospatial Analyses of Agroecosystem Dynamics",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:53:10.399Z",
        "url": "https://www.internships.com/posting/50ce241e-77c3-4139-8d3b-ecc0708feae0",
        "lastScraped": "2021-04-12T10:53:10.399Z",
        "description": "<p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple&nbsp;master's level research opportunities&nbsp;are currently&nbsp;available with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS) located at multiple ARS units across the country.</p><p><br></p><p>This research opportunity is part of the SCINet Fellowship program at ARS. All fellows will spend time at headquarters for some of their training, but will be based&nbsp;in&nbsp;another ARS research unit&nbsp;for more specific training.&nbsp;The SCINet/Big Data Program at ARS offers research opportunities to motivated participants interested in&nbsp;solving agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales, as well as metadata enhancement for data discovery. One of the goals of the SCINet Initiative is to develop and apply new technologies, including artificial intelligence (AI) and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, linkage, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of these opportunities is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each&nbsp;participant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with geospatial software for analysis (e.g., ArcGIS) provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The successful candidate will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The successful candidate will also learn AI technologies relevant to these problems. The successful candidate will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses across multiple spatial and temporal scales.</p>",
        "index": 34,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "software engineering",
            "artificial intelligence"
        ],
        "remote": true
    },
    {
        "position": "FDA CDER Summer 2021 Research Participation Program",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:53:22.244Z",
        "url": "https://www.internships.com/posting/ccm_7b3e203a-6018-4237-8095-7d88403e08f9",
        "lastScraped": "2021-04-12T10:53:22.244Z",
        "description": "<p><strong>*Although the application deadline is April 16th, mentors will start reviewing submitted applications before the deadline.</strong></p><p><br></p><p>Summer research&nbsp;opportunities&nbsp;are&nbsp;available at the U.S. Food and Drug Administration (FDA),&nbsp;Center for Drug Evaluation and Research (CDER).&nbsp;</p><p><br></p><p>The Center for Drug Evaluation and Research&nbsp;(CDER) performs an essential public health task by making sure that safe and effective drugs are available to improve the health of people in the United States.&nbsp;As part of the U.S. Food and Drug Administration (FDA), CDER regulates over-the-counter and prescription drugs, including biological therapeutics and generic drugs. CDER's mission is to protect and promote health by helping to ensure that these&nbsp;human drugs are safe and effective for their intended use, that they meet established quality standards, and that they are available to patients who need them.</p><p><br></p><p>Participants will have an opportunity to gain a&nbsp;hands-on research experience on a variety&nbsp;of regulatory research projects related to CDER's mission. The program is&nbsp;designed&nbsp;for participants to engage with&nbsp;an expert&nbsp;mentor or mentors during&nbsp;the summer to examine a&nbsp;question of interest&nbsp;related to those projects within the placement office.&nbsp;Past projects have been related to: drug metabolism, bio-statistical questions, in-vitro models for drug toxicology, safety and efficacy, benefit-risk assessments, etc.&nbsp;</p><p>Both full-time and part-time appointments are typically available. Anticipated start day is on or around May 3, 2021, but can be negotiated with the mentor to commence on any Monday throughout the summer in order to best align with school and/or vacation schedules.&nbsp;</p><p><br></p><p>Based on pandemic response, participants may be able to participate from an alternate location on a temporary basis.&nbsp;However, at the time when Mentors and FDA Staff return to their usual on-site work schedule, participants will no longer be able to conduct training from an off-site location and will be expected to report to the site in Silver Spring, Maryland or St. Louis, Missouri.</p><p><br></p><p>To avoid conflict of interest, participants cannot be placed in the same CDER program office where a relative works.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for&nbsp;2-3 months, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is&nbsp;part-time or full-time&nbsp;at FDA in the Silver Spring, Maryland or St. Louis, Missouri areas. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul>",
        "index": 35,
        "skills": [
            "project management",
            "information technology"
        ],
        "start": "2021-04-16T10:00:00.000Z",
        "due": "2021-04-16T10:00:00.000Z",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "Summer 2021 Paid College Student Internship",
        "company": "City of Hope",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:53:34.405Z",
        "url": "https://www.internships.com/posting/9ad8f96b-a6d3-468b-851f-4b53fb753354",
        "lastScraped": "2021-04-12T10:53:34.405Z",
        "description": "<p><span>The overall aim of the College Student Internship Program is to provide a professional work experience and exposure to undergraduate college students interested in pursuing a career in healthcare. The College Student Internship aims to engage high caliber students in an effort to:</span></p><p><span>&nbsp;</span></p><p><strong>Key Responsibilities include:</strong></p><ul><li><span>Gain substantial professional experience as well as exposure to the City of Hope organization</span></li><li><span>Develop a comprehensive perspective of the healthcare field</span></li><li><span>Participate in networking, personal and professional development opportunities</span></li><li><span>Prepare for a future into a career within the organization</span></li><li><span>Utilize effective communication skills under supervisor’s direction to complete tasks</span></li><li><span>Utilize City of Hope resources (computer, phone, office equipment) as directed by supervisor</span></li><li><span>Work closely with assigned team member to complete assigned tasks</span></li><li><span>The ability to learn and perform assigned work and to handle multiple tasks and changing priorities</span></li></ul><p>&nbsp;</p><p><br></p>",
        "index": 36,
        "skills": [
            "networks",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "EPA Air Pollution and Atmospheric Modeling Systems MS Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-04-12T10:53:48.419Z",
        "url": "https://www.internships.com/posting/ce9ccf58-297a-4690-9fdc-cf458c7200cd",
        "lastScraped": "2021-04-12T10:53:48.419Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will attempt to quantify the effects of new model developments in both the hemispheric CMAQ (H-CMAQ) and the next generation global MPAS-CMAQ modeling system on background pollution and the contributions from domestic and international anthropogenic sources, along with natural emission sources. This research project may include developments of a consistent setup for both the H-CMAQ and MPAS-CMAQ modeling platforms; a protocol for quantifying background pollution through emission perturbation simulations, source apportionment, and/or DDM simulations; and, an approach for prioritizing which specific model updates (e.g. halogen chemistry, deposition, secondary organic aerosols) should be tested through this platform.</p><p><br></p><p>Research activities may include:</p><ul><li>Setting up, performing, and analyzing simulations using regional WRF-CMAQ, hemispheric WRF-CMAQ and global MPAS-CMAQ configurations to enable model inter-comparisons</li><li>Developing methods for quantifying observed and simulated hemispheric and global background air pollution</li><li>Obtaining new observation datasets (e.g. satellite data) and developing new tools/methods to use those data in hemispheric/global model evaluation</li><li>Use existing methods and/or develop new methods to estimate the impact of different model configurations on simulated background air pollution</li><li>Developing new methods to test the various individual components of the CMAQ modeling system to determine their importance in estimating background air pollution</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>In collaboration with the AESMD scientists, the research participant will learn how to develop and apply large scale comprehensive atmospheric modeling systems to study various aspects of air pollution. This research training opportunity will give the research participant experience that extends skills acquired through their advanced degree education.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Wyat Appel&nbsp;(appel.wyat@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required </p><p>for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 37,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Summer 2021 Paid College Student Internship",
        "company": "City of Hope",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:54:00.938Z",
        "url": "https://www.internships.com/posting/9ad8f96b-a6d3-468b-851f-4b53fb753354",
        "lastScraped": "2021-04-12T10:54:00.938Z",
        "description": "<p><span>The overall aim of the College Student Internship Program is to provide a professional work experience and exposure to undergraduate college students interested in pursuing a career in healthcare. The College Student Internship aims to engage high caliber students in an effort to:</span></p><p><span>&nbsp;</span></p><p><strong>Key Responsibilities include:</strong></p><ul><li><span>Gain substantial professional experience as well as exposure to the City of Hope organization</span></li><li><span>Develop a comprehensive perspective of the healthcare field</span></li><li><span>Participate in networking, personal and professional development opportunities</span></li><li><span>Prepare for a future into a career within the organization</span></li><li><span>Utilize effective communication skills under supervisor’s direction to complete tasks</span></li><li><span>Utilize City of Hope resources (computer, phone, office equipment) as directed by supervisor</span></li><li><span>Work closely with assigned team member to complete assigned tasks</span></li><li><span>The ability to learn and perform assigned work and to handle multiple tasks and changing priorities</span></li></ul><p>&nbsp;</p><p><br></p>",
        "index": 38,
        "skills": [
            "networks",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Campaign Management Internship",
        "company": "The Ad Council",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:54:13.902Z",
        "url": "https://www.internships.com/posting/cafeda78-7292-4eec-af51-54bc27e3aa5d",
        "lastScraped": "2021-04-12T10:54:13.902Z",
        "description": "<p><strong>Position</strong>:&nbsp;Internship:&nbsp;Campaign Management</p><p><strong>Location</strong>:&nbsp;Remote&nbsp;and East Coast work hours</p><p><strong>Start Date:</strong>&nbsp;June&nbsp;7, 2021</p><p><strong>End Date:</strong>&nbsp;August&nbsp;6,&nbsp;2021</p><p>The Campaign Development team oversees all aspects&nbsp;in developing fully integrated public service ad (PSA) campaigns. Key areas of responsibility include working with&nbsp;ad&nbsp;agency partners, non-profits and government agencies, from the strategic planning phase through TV and digital production, campaign launch, distribution, and program evaluation.</p><p>To&nbsp;learn about the campaign development and evaluation process, interns are fully&nbsp;integrated into the Campaign Development team and are encouraged to attend both internal and external meetings, as well as&nbsp;activities like&nbsp;remote&nbsp;film shoots and focus groups when possible.</p><p><br></p><p><strong>THIS IS A PAID INTERNSHIP&nbsp;-&nbsp;</strong>Interns will be paid $15/hour.</p><p><strong>Responsibilities:</strong></p><ul><li>Assist with analysis and reporting related to social&nbsp;and&nbsp;digital efforts, donated media, and overall campaign impact.</li><li>Review industry and academic research on marketing trends&nbsp;and social marketing effectiveness.</li><li>Research and draft landscape reviews, describing the social issue landscape in U.S. regions.</li><li>Analyze competitive campaigns and programs.</li><li>Assist with social media, digital, and public relations efforts.</li><li>Collaborate with Ad Council interns&nbsp;to&nbsp;identify the next pressing social issue to become an Ad Council&nbsp;campaign. The intern team will work through the end of the summer program to research, develop and present a campaign proposal to the Ad Council staff</li></ul><p><strong>About You:</strong></p><ul><li>Undergraduate-level student with a concentration in the social sciences, communications or marketing&nbsp;preferred.</li><li>Strong interest in social issues and passion for making an impact</li><li>Interest in non-profit marketing and advertising</li><li>Excellent communication skills (verbal and written).</li><li>Strong organizational and analytical skills.</li><li>Excellent PC skills (Word, PowerPoint, Excel).</li><li>Understanding of social media marketing.</li><li>Team player and independent worker.</li></ul><p><strong>About the Ad Council:</strong></p><p>The&nbsp;Ad Council&nbsp;is where creativity and causes converge at scale. We are a New York-based national non-profit organization, bringing together the brightest minds in the marketing, media, advertising and tech industries to create change around the most critical social issues facing our country. The Ad Council initiates, produces and activates communications campaigns that drive awareness and behavior change, creating a lasting impact on American life. We produce content that ignites new ideas, increases the health, education, and safety of our nation, and literally saves lives.</p><p><strong>We are deeply committed to diversity, equity &amp;&nbsp;inclusion:</strong></p><p>At the Ad Council, we value and celebrate the unique characteristics and perspectives that make each person who they are. Diversity is the foundation of our work and allows us to reimagine how we reach our audiences. It is not simply our belief, but our duty, to cultivate a team that is representative of the American people. Only then can we drive true, measurable, and life-changing impact on the most important issues facing our country today.</p><p>The Ad Council is an Equal Opportunity Employer.&nbsp;Qualified applicants will be considered for employment without regard to race, creed, color,&nbsp;citizenship status, religion, sex, sexual orientation, gender identity, marital status, age, national origin, genetic information, status as an individual with a&nbsp;disability, status as a protected veteran or any other legally protected status.</p><p><br></p><p><strong>Contact&nbsp;Us:</strong></p><p>To apply online: https://www.adcouncil.org/Working-With-Us/Join-Us</p><p>The&nbsp;Ad Council invites all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation for any&nbsp;part of&nbsp;the application or hiring process, please contact please submit your request&nbsp;through one of&nbsp;the following methods listed below:</p><p>Fax (212) 922-1676 or</p><p>US Mail to the Advertising Council</p><p>Attn:&nbsp;Talent Team</p><p>815 2nd Avenue; 9th Floor</p><p>New York, NY 10017</p><p>EEO is the Law</p><p><br></p><p><br></p><p><span>PI132176016</span></p>",
        "index": 39,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Summer 2021 Paid College Student Internship",
        "company": "City of Hope",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:54:26.435Z",
        "url": "https://www.internships.com/posting/9ad8f96b-a6d3-468b-851f-4b53fb753354",
        "lastScraped": "2021-04-12T10:54:26.435Z",
        "description": "<p><span>The overall aim of the College Student Internship Program is to provide a professional work experience and exposure to undergraduate college students interested in pursuing a career in healthcare. The College Student Internship aims to engage high caliber students in an effort to:</span></p><p><span>&nbsp;</span></p><p><strong>Key Responsibilities include:</strong></p><ul><li><span>Gain substantial professional experience as well as exposure to the City of Hope organization</span></li><li><span>Develop a comprehensive perspective of the healthcare field</span></li><li><span>Participate in networking, personal and professional development opportunities</span></li><li><span>Prepare for a future into a career within the organization</span></li><li><span>Utilize effective communication skills under supervisor’s direction to complete tasks</span></li><li><span>Utilize City of Hope resources (computer, phone, office equipment) as directed by supervisor</span></li><li><span>Work closely with assigned team member to complete assigned tasks</span></li><li><span>The ability to learn and perform assigned work and to handle multiple tasks and changing priorities</span></li></ul><p>&nbsp;</p><p><br></p>",
        "index": 40,
        "skills": [
            "networks",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "EPA Tribal Drinking Water Program (in the Pacific Northwest and Alaska)",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-13T10:54:45.201Z",
        "url": "https://www.internships.com/posting/833bc198-e086-4da5-81e2-f64cbc0dd022",
        "lastScraped": "2021-04-12T10:54:45.201Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>Two research&nbsp;opportunities are&nbsp;available at the Environmental Protection Agency's (EPA) Region 10 Groundwater and Drinking Water Section in the Tribal Drinking Water Team located in Seattle, Washington. At this time, the appointment will be remote (pending the COVID-19 pandemic).</p><p><br></p><p>The mission of EPA is to protect human health and the environment. EPA works to ensure that: Americans have clean air, land and water; National efforts to reduce environmental risks are based on the best available scientific information; Federal laws protecting human health and the environment are administered and enforced fairly, effectively and as Congress intended; Environmental stewardship is integral to U.S. policies concerning natural resources, human health, economic growth, energy, transportation, agriculture, industry, and international trade, and these factors are similarly considered in establishing environmental policy; All parts of society have access to accurate information sufficient to effectively participate in managing human health and environmental risks; Contaminated lands and toxic sites are cleaned up; and chemicals in the marketplace are reviewed for safety.</p><p><br></p><p>The Drinking Water program assures that public water systems (PWSs) adhere to national drinking water standards in EPA Region 10, which includes Washington, Oregon, Idaho and Alaska, through a combination of State oversight and direct implementation (DI) on Tribal lands.&nbsp;The participant will gain experience on DI through the Tribal Drinking Water Program, which carries out all functions associated with primacy implementation of the Safe Drinking Water Act (SDWA) and a drinking water program, including assuring that tap water at Tribal PWSs meets national health standards for all regulated contaminants (over 80), that sanitary survey inspections are conducted on time at each water system, and that issues posing potential risks to the water system are identified and mitigated.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;&nbsp;Under the guidance of an EPA mentor, the participant will learn the following areas:&nbsp;&nbsp;</p><ul><li>Reviewing water quality data to assure it meets drinking water standards.</li><li>Preparing technical assistance documents that support Tribal operators and water system managers.&nbsp;</li><li>Providing technical support on the implementation of various drinking water rules, including the Revised Total Coliform Rule (RTCR), Surface Water Treatment Rule (SWTR), Groundwater Rule (GWR), Lead &amp; Copper Rule (LCR), Groundwater Rule (GWR), Disinfection Byproduct Rule (DBPR), radionuclides, organic and inorganic chemicals, and the Consumer Confidence Report (CCR) Rule.</li><li>Preparing technical and scientific input on contamination relating to organic and inorganic chemicals, corrosion control treatment, sanitary defect correction, disinfection byproduct control, fecal bacteria mitigation, as well as on turbidity removal and achieving disinfection for virus, giardia and cryptosporidium.&nbsp;</li><li>Assisting in the management &amp; analysis of drinking water data.</li><li>Assisting in the evaluation of groundwater sources that are potentially under the direct influence of surface water (GUDI).</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>This opportunity will provide the participant with exposure to a broad range of regulatory, technical and policy issues surrounding drinking water. Since the&nbsp;research involves Tribal water systems where the EPA has primacy, the participant will gain hands-on experience in rule implementation. There is flexibility for the&nbsp;participant to develop expertise in areas of his or her interest. The&nbsp;participant will also learn how EPA informs and engages with a broad range of stakeholders, and gain experience in&nbsp;collaborating with water operators in rural areas. Normally, field work is an integral component to this role, though most travel is currently suspended due to the pandemic.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Jenna Manheimer (manheimer.jennifer@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>",
        "index": 41,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:54:58.153Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-04-12T10:54:58.153Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>",
        "index": 42,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Software Development Intern",
        "company": "Brad's Deals",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-12T10:55:10.343Z",
        "url": "https://www.internships.com/posting/00d32309-9658-44c5-8028-7ff08d21d4cd",
        "lastScraped": "2021-04-12T10:55:10.343Z",
        "description": "<p><span>Love what you do. It’s a core value that drives our business. Plus, we’re pretty fun.</span></p><p><br></p><p><span>Brad’s Deals is looking for a Software Development Intern to join the Web Development team. In this role you will work closely with an experienced team of full-stack web developers to build, test, and deploy user-facing features and backend web services. You’ll be paired with a mentor and work on real project work while embedded with the team. Project work may include adding features to our consumer-facing website, building tools to help our Editors find great deals, or incorporating personalized content into our APIs. Finally, you’ll design and build a project of your own on the Brad’s Deals platform with support from the whole team.</span></p><p><br></p><p>In this role you will:</p><ul><li>Ship code to millions of users - by the end of your first week </li><li>Build, test, and deploy features across the web platform </li><li>Grow your technical skills - we use Git, modern Javascript, Vue.js, Ruby on Rails, Go, AWS </li><li>Pair with an experienced team of web developers on projects large and small </li><li>Help diagnose and debug issues using error tracking and application monitoring tools </li><li>Collaborate with data scientists, dev ops engineers, and mobile developers </li><li>Learn industry best practices through code reviews and hand-on mentorship </li><li>Participate in all aspects of our agile software development lifecycle </li><li>Work with a cross-functional team including product managers, designers, and UX experts </li><li>Design and build a project of your own using all that you’ve learned</li></ul><p><br></p><p>This role is a great fit for someone who is:</p><ul><li>Pursuing a degree in computer science, engineering, web development, or equivalent </li><li>OR a graduate of a coding bootcamp, web development immersive, or other non-traditional educational program </li><li>Interested in exploring the full web stack from CSS to SQL </li><li>Experienced with core web technologies like HTML, CSS, and Javascript</li><li>Proficient in one or more programming languages (we use Ruby, Javascript, and Go, but as long as you know any language, we can teach you) </li><li>Versed in object-oriented and/or functional programming patterns and data structures </li><li>Comfortable with version control systems like Git </li><li>Familiar with automated testing </li><li>Attuned to detail and writing clean code </li><li>Curious and self-motivated to learn </li><li>A strong communicator with empathy for their peers</li></ul><p><br></p><p>Our Story</p><p>Brad’s Deals continues to save consumers over $200 million a year by sharing the best deals out there. We live out our&nbsp;core values&nbsp;with a ‘Consumer’s first, always’&nbsp;mindset to deliver the most value every day.</p><p><br></p><p>Started by Brad in 2001, our purpose remains the same to help create smarter shopping habits and to&nbsp;keep it real&nbsp;with expert lifestyle and financial advice.&nbsp;</p><p><br></p><p>Our culture&nbsp;embraces diversity&nbsp;with different talents, experiences, and backgrounds that help us be&nbsp;exceptional together. With competitive pay, full health benefits, 401K match, plenty of paid time off including a paid sabbatical, and&nbsp;creative perks, we also believe in work-life integration and continued learning.</p><p><br></p><p>As one of the 50 Best Places to Work, located in the heart of Chicago’s River North neighborhood, we partner with over 2,500 retailers to help 5.5 million consumers save more every month. So if you want to&nbsp;challenge the ordinary&nbsp;and&nbsp;love what you do, we want to hear from you.</p><p><br></p><p><br></p><p>Brad’s Commitment to Diversity &amp; Inclusion</p><p>'Embrace diversity’ is one of our core values because our differences make us stronger together. To make the world a more inclusive and safe place, we start within our company to intentionally lead with equal opportunities. We encourage the value that unique talents, ethnicities, backgrounds, abilities, and experiences bring to our company, our employees, and our future applicants.&nbsp;We welcome all applicants, whether or not you meet every qualification, to share your unique talents with us.</p><p><br></p><p><br></p><p><em>*Please note: Due to the potential personal and business impacts of Covid-19,&nbsp;Brad's Deals is taking a proactive approach by allowing our employees to work from home. As such, our hiring teams will be conducting virtual interviews with potential candidates as we continue to monitor the effects of the pandemic across our local community.&nbsp;&nbsp;</em></p><p><br></p>",
        "index": 43,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "javascript",
            "machine learning",
            "virtual reality",
            "information technology",
            "web development"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Technician Apprentice - En",
        "company": "N/A",
        "location": {
            "city": "Ohio",
            "state": "United States"
        },
        "posted": "2021-04-12T10:55:32.100Z",
        "url": "https://www.internships.com/posting/bug_38973821582",
        "lastScraped": "2021-04-12T10:55:32.100Z",
        "description": "Technician Apprentice - 194685-en_US\n  QR Code Link to This Post    Pay starts at $22.35    Logistics done differently.  At XPO Logistics, our skilled team of technicians is the driving force that keeps our fleet of tractors and trailers operating in top condition. As the Technician Apprentice, youll need strong technical and diagnostic abilities, a desire to take on challenges and a willingness to be a team player dedicated to exceptional customer service. If youre looking for a growth opportunity, join us at XPO.    Pay, benefits and more.  We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability and more.    What youll do on a typical day:  Perform routine maintenance functions and adjustments on all types of class 7 and 8 diesel equipment, forklifts and trailing equipment, in compliance with the manufacturers' and company schedules  Apply knowledge and work in accordance with DOT, Environmental Protection Agency (EPA), Interstate Authority, Occupational Safety and Health Administration (OSHA) and other rules and regulations as required  Access any area of the equipment or vehicle to perform necessary maintenance, including inspecting and performing work in, on or under parts of vehicles and trailers  Repair or rebuild all or part of equipment systems  Conduct safety inspections of equipment and prepare safety documentation  Move trailers throughout the property  Operate a hostler in all types of weather; safely walk and stand for extended periods of time  What you need to succeed at XPO:  At a minimum, youll need:  1 year of experience in general heavy truck repair, automotive repair or equipment repair; equivalent trade school/technical school time may be applied toward this requirement  Your own technician hand tools required for tractor/trailer and forklift repairs and maintenance  A valid drivers license  Basic computer skills  Availability to work a variety of shifts, including days, evenings and weekends  Itd be great if you also have:  Previous or current ASE certifications  Basic welding skills such as Oxy/Acetylene, ARC and MIG  This job requires the ability to:  Lift objects of various shapes, sizes and weights up to 50 lbs. frequently and greater than 75 lbs. occasionally  Reach (including above your head), bend, climb, push, pull, twist, squat and kneel  Walk and stand for extended periods of time on a loading dock that is not climate-controlled and may be slippery or in various locations that may be outside  Be part of something big.    XPO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team  energetic, innovative people of all experience levels and talents who make XPO a great place to work.    We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran or other protected status.    XPO adheres to CDC, OSHA and state and local requirements regarding COVID safety. All employees and visitors are expected to comply with XPO policies which are in place to safeguard our employees and customers.    All applicants who receive a conditional offer of employment may be required to take and pass a pre-employment drug test.    The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.",
        "index": 44,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Pharmacy Technician/Pharm Technician Apprentice",
        "company": "N/A",
        "location": {
            "city": "Kahului",
            "state": "Hawaii"
        },
        "posted": "2021-03-13T10:55:53.944Z",
        "url": "https://www.internships.com/posting/bug_38967324977",
        "lastScraped": "2021-04-12T10:55:53.944Z",
        "description": "Job Information\n\nWalgreens Pharmacy Technician / Pharm Tech Apprenticeship in KAHULUI, Hawaii\n\nJob Description:\n\nOur pharmacy technician positions have undergone an exciting transformation, moving from a transaction-based environment to a much more patient-centric one. As a Walgreens Pharmacy Technician or Pharmacy Technician Apprentice, you'll be front and center  interacting with our customers and developing strong patient relationships. Pharmacy is the core of our business, and our pharmacy technicians enjoy all the tools and support  including the latest technology  to grow their careers and reach their goals.\n\nWalgreens is proud to invest &amp; champion an earn while you learn Pharmacy Technician Training Program recognized by ASHP &amp; Department of Labor. This apprenticeship program gives you an entry point to a career in health care by guiding you in taking steps towards becoming a Pharmacy Technician Certification Board (PTCB) Certified Pharmacy Technician and helping you maintain the high level of skill required in the pharmacy care industry. Arming you with a nationally recognized, portable credential that will help you advance your career.\n\nWhether you are new to working in pharmacies or are an experienced Pharmacy Technician Apply Now! Walgreens will train you to use your skills and talents to serve and care for our patients and customers. The courses, learning activities, and resources provided to you in our pharmacy technician training program are designed to give you foundational and advanced knowledge, skills, and on-the-job experiences you need to prepare to become a certified pharmacy technician.\n\n*\n\nIn accordance with state and federal regulations, assists the pharmacist, under direct supervision, in the practice of pharmacy. Assists the pharmacist in the performance of other Pharmacy Department duties in accordance with Company policies and procedures.\n\n*\n\nResponsible for using pharmacy systems to obtain patient and drug information and process prescriptions. If PTCB certified, assists with and coaches pharmacy technicians in the operation of pharmacy systems and cashiers in the operation of the pharmacy cash registers.\n\n*\n\nModels and delivers a distinctive and delightful customer experience.\n\nCustomer Experience\n\n*\n\nEngages customers and patients by greeting them and offering assistance with products and services. Resolves customer issues and answers questions to ensure a positive customer experience.\n\n*\n\nModels and shares customer service best practices with all team members to deliver a distinctive and delightful customer experience, including interpersonal habits (e.g., greeting, eye contact, courtesy, etc.) and Walgreens service traits (e.g., offering help proactively, identifying needs, servicing until satisfied, etc.).\n\n*\n\nDevelops strong relationships with most valuable customers.\n\nOperations\n\n*\n\nUnder the supervision by the pharmacist, assist in the practice of pharmacy, in accordance with state, federal, and company policy. Reviews and complies with the Walgreen Co. Pharmacy Code of Conduct.\n\n*\n\nPerforms duties as assigned by Pharmacy Manager, Staff Pharmacist and Store Manager including utilizing pharmacy systems to enter patient and drug information, ensuring information is entered correctly, filling prescriptions by retrieving, counting and pouring pharmaceutical drugs, verifying medicine is correct, and checking for possible interactions. Assists pharmacists in scheduling and maintaining work flow.\n\n*\n\nReports, immediately, prescription errors to pharmacist on duty and adheres to Company policies and procedures in relation to pharmacy errors and the Quality Improvement Program.\n\n*\n\nStrictly adheres to the Walgreen Co. policy regarding Good Faith Dispensing during all applicable prescription dispensing activities.\n\n*\n\nResponsible and accountable for registering all related sales on assigned cash register, collects and handles cash as required. Takes customer to OTC aisle when possible to assist in locating products.\n\n*\n\nHandles telephone calls that do not require personal attention of the pharmacist, including those to physicians.\n\n*\n\nProcesses (corrects and resubmits) manual claims for third party program prescription services in a timely and efficient manner, and performs other clerical duties, as assigned by the Pharmacy Manager.\n\n*\n\nAssists and supports Pharmacy Department on inventory management activities, such as, ordering, unpacking, checking and storing shipment of pharmaceuticals. Maintains knowledge of Company asset protection techniques, and files claims for warehouse overages (merchandise received, but not billed), shortages (merchandise billed, but not received), order errors or damaged goods involving Rx drugs.\n\n*\n\nMay assist pharmacist in administering clinical services including the collection and proper labeling of blood/urine samples from patients and other clinical services as required; assists pharmacy staff in coordination of clinical services, Walgreens healthcare clinics and external providers.\n\n*\n\nAssists Pharmacy Manager and Staff Pharmacist in developing and maintaining good relationships with the local medical community, including physicians, nurses, and other health care providers, by medical provider detailing and outreach to health groups, retirement homes, nursing homes, and other forums for enhancing growth opportunities.\n\n*\n\nAssists with exterior and interior maintenance by ensuring the Pharmacy Department is stocked with adequate supplies, clean, neat and orderly in condition and appearance.\n\n*\n\nComplies with all company policies and procedures; maintains respectful relationships with coworkers.\n\n*\n\nCompletes special assignments and other tasks as assigned.\n\nTraining &amp; Personal Development\n\n*\n\nEarns and maintains PTCB certification through the designated PTCB training program and/or state required certification/registration. Otherwise, earns PTCB certification as condition of promotion to senior technician.\n\n*\n\nAttends training and completes PPLs requested by Manager and acquires continuing education credits. Maintains knowledge and skill in healthcare and pharmacy, including latest news and developments.\n\nJob ID: 570729BR\n\nTitle: Pharmacy Technician / Pharm Tech Apprenticeship\n\nCompany Indicator: Walgreens\n\nEmployment Type: Flexible hours\n\nJob Function: Retail\n\nFull Store Address: 10 E KAMEHAMEHA AVE,KAHULUI,HI,96732\n\nFull District Office Address: 10 E KAMEHAMEHA AVE,KAHULUI,HI,96732-2415-12786-S\n\nExternal Basic Qualifications:\n\n*\n\nMust be fluent in reading, writing, and speaking English. (Except in Puerto Rico)\n\n*\n\nRequires willingness to work flexible schedule, including evening and weekend hours.\n\nPreferred Qualifications:\n\n*\n\nPrefer six months of experience in a retail environment.\n\n*\n\nPrefer to have prior work experience with Walgreens.\n\n*\n\nPrefer good math skills so they can fill prescriptions accurately, including counting, measuring and weighing medications.\n\n*\n\nPrefer good computer skills.\n\n*\n\nPrefer the knowledge of store inventory control.\n\n*\n\nPrefer PTCB certification.\n\nAn Equal Opportunity Employer, including disability/veterans.\n\nThe following information is applicable to Colorado only, in accordance with the Colorado Pay Equity Act. In Colorado, an employee in this position can expect a salary/hourly rate between $14.00 and $20.00 depending on experience, seniority, geographic locations, and other factors permitted by law. To review the available benefits, please click here: jobs.walgreens.com/benefits .Walgreens will provide applicants in other states with information related to the positions, to the extent required by state or local law, by calling 1-866-967-5492\n\nShift: Various\n\nStore: 12786-KAHULUI HI",
        "index": 45,
        "skills": [
            "information technology",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "contact": "1-866-967-5492",
        "remote": false
    },
    {
        "position": "Slcc Student, Work Study- Specialist II Or III, International Committee Digital Access Intern",
        "company": "N/A",
        "location": {
            "city": "Utah",
            "state": "United States"
        },
        "posted": "2021-03-13T10:56:15.896Z",
        "url": "https://www.internships.com/posting/bug_38963777253",
        "lastScraped": "2021-04-12T10:56:15.896Z",
        "description": "SLCC Student, Work Study- Specialist II or III, International Rescue Committee Digital Access Intern\nPosition Information\n\nPosition Title SLCC Student, Work Study- Specialist II or III, International Rescue Committee Digital Access Intern\nOpen Internally or Externally External\nIf faculty, tenure track status Not Applicable\nReports to (title) Campus Community Engagement Coordinator\nDepartment Thayne Center\nRequisition Number W20052\nPosition Type One Year Temporary\nJob Category Work Study - Variable\nFT/PT Part-time\nInitial Work Location Varies\nStarting Salary $12.55 - $15.17\nJob Open Date 02/26/2021\nJob Close Date\nOpen Until Filled Yes\nPriority Review Date\nJob Summary\n\nFounded in 1933, the International Rescue Committee (IRC) is a leading, non-sectarian, non-profit organization providing emergency relief, protection, rehabilitation assistance, resettlement services, and advocacy for refugees and victims of oppression or violent conflict. Domestically, our 26 offices across the U.S. ensure new arrivals have food, shelter, and clothing, and work with refugees to help them gain self-sufficiency.\n\nThe Digital Inclusion Program, within the IRC SLCs Education Program, supports digital skill development for newly arrived refugees and New Americans as well as access to and comfort with technology as a means to improve their lives and livelihoods. This includes providing initial smartphone and data plans, affordable home broadband internet access, Technology Mentorships, and integrated digital skills into core resettlement services.\n\nSCOPE OF INTERN WORK: The IRC SLC seeks a self-starting, tech-savvy intern with cross-cultural sensitivities, troubleshooting skills and a team mindset to support a growing program focused on digital inclusion and digital equity for refugee clients. With oversight from the Digital Inclusion Coordinator, the Digital Access Intern will assist with home broadband enrollments, basic training on computer and smartphone use, and ongoing technology support for refugee clients. Digital connectivity has become a critical issue for IRC SLC programs and newly arrived refugees during the pandemic and technology issues are a main barrier to access. The Digital Access Intern will provide much needed technology-follow-up to support clients participation in IRC SLCs virtual programs. Work will be conducted primarily by virtual web-conference and collaborative tools for troubleshooting clients technology barriers as these arise, keeping an inventory of donated digital tools and equipment for distribution, and ongoing basic digital training for clients to engage as the world becomes increasingly dependent on remote, digital communication.\n\nThe IRC is a community partner of Salt Lake Community Colleges Thayne Center for Student Life, Leadership, and Community Engagement (SLLCE). The Thayne Center for SLLCE provides a supportive and inclusive office for students to explore community involvement, leadership, and volunteerism. By providing opportunities in conjunction with local nonprofits we cultivate an environment to test our students interests and area of study while assisting them to realize they have the knowledge and skills to affect positive change in our community. Though the position will be a direct placement at the IRC, the Thayne Center for SLLCE will administer the orientation, enrollment and exit from the Community Work Study program and will act as on-campus supervisor.\n\nPlease see the responsibilities and duties for more role details.\n\nPlease note that for 2020-2021, all responsibilities and duties will default to be conducted virtually/remotely as long as the state is at the High level for COVID-19. There will be an option to work in person or remotely if the state is at the Moderate or Low level for COVID-19.\n\nEssential Responsibilities and Duties\n\nRESPONSIBILITIES:\nAssist clients with accessing home broadband through enrollment in Comcast Internet Essential Service\nProvide ongoing technology support to clients by troubleshooting problems by phone with interpreter as available\nProvide virtual support for clients in using virtual platforms for communication including WhatsApp for Business, Google Hangouts, and Zoom\nSupport preparation for and facilitation of initial digital inclusion intakes with all new refugee arrivals within the first 30 days\nWork with Digital Inclusion team in the development of a Tech Support Team (similar to Geek Squad) to systematically meet the ongoing technology needs of clients\nDocument and report on progress during weekly check-in meetings\n\nEssential Responsibilities and Duties Continued\nPreferred Qualifications\n\nPrevious experience with teaching technology basics; experience with refugees a plus\nExperience actively using and learning about consumer electronics and troubleshooting\nStrong ability to prioritize and multi-task in a fast-paced environment\nFamiliarity and proficiency with productivity software\nAbility to communicate clearly and effectively in English; fluency in a refugee language helpful\nOutgoing &amp; Independent; able to accomplish tasks efficiently and in a timely manner\nIntroductory use with virtual platforms for communication including WhatsApp for Business, Google Hangouts, and Zoom\n\nMinimum Qualifications\n\n- Must have a SLCC Federal Work-Study Award.\n- Must pass an IRC background check.\n- Attend all Thayne Center orientations and trainings related to this program.\n- Must work 20 hours per week.\n\nKnowledge, Skills &amp; Abilities\n\nAbility to communicate effectively with a broad range of diverse people, ability, culture, ethnic background, to maintain good working relationships across the College. Ability to work with all groups in a diverse academic, socioeconomic, cultural and ethnic background of community college students, faculty and staff, including those with disabilities.\n\nNon-Essential Responsibilities and Duties\nSpecial Instructions\n\n- Must have federal work study award through SLCCs Financial Aid Office to Apply for this job.\n- Must be enrolled in 6 credit hours per semester.\n- Pass a criminal background check.\n\nWHAT IS WORK STUDY:\nWork study is awarded to SLCC students through the Federal College Work Study program, which requires establishing financial need through the FAFSA application from the Financial Aid Office. If you do not have work study awarded to you, you will not be eligible for work under work study positions.\n\nFLSA Non-Exempt\nSLCC Information\n\nSalt Lake Community College (SLCC) is fully committed to policies of equal employment and nondiscrimination. The College does not discriminate on the basis of race, color, national origin, age, sex, sexual orientation, gender identity, genetic information, disability, religion, protected veteran status, expression of political or personal beliefs outside of the workplace, or any other status protected under applicable federal, state, or local law.\n\nSLCC is a participating employer with Utah Retirement Systems (URS).\n\nThis position may require the successful completion of a criminal background check.SLCC Student, Work Study- Specialist II or III, International Rescue Committee Digital Access Intern",
        "index": 46,
        "skills": [
            "information technology",
            "machine learning",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-02-26T10:00:00.000Z",
        "remote": true
    },
    {
        "position": "Paid Technology Intern",
        "company": "N/A",
        "location": {
            "city": "New Jersey",
            "state": "United States"
        },
        "posted": "2021-03-13T10:56:39.448Z",
        "url": "https://www.internships.com/posting/bug_38956662341",
        "lastScraped": "2021-04-12T10:56:39.448Z",
        "description": "Paid Technology Intern (Part-Time)\nat Foundation Academies \nFoundation Academies\n\nFOUNDATION COLLEGIATE ACADEMY ALUMNI ONLY\n\nWere looking for YOU if:\n\n* You believe that EVERY child deserves access to a high-quality education and that children can and will learn if properly taught.\n* You believe that alongside academics, a complete education includes nurturing your students as individuals so that they can become well-rounded, civic-minded, lifelong learners; the changemakers and leaders of the future.\n* You are unabashedly and authentically YOU and proud of it, and genuinely committed to building meaningful relationships with students, families, and staff.\n\nWere you nodding YES as you read the list above? We invite you to apply!\n\nWere looking for a dedicated and talented Technology Intern to become part of our Home Office Team.\n\nThe Technology Intern will play a critical role in assisting the Technology Team to ensure that all of Foundation Academies staff, students, and families are equipped with working technology while learning transferable skills essential to a career in Information Technology. The Technology Intern is an individual with a growth-mindset that accepts and implements feedback to develop and improve over time. Our preferred candidate is someone who has an interest in pursuing a career in Information Technology and is currently enrolled or interested in getting back into postsecondary studies within the field of Information Technology.\n\nHeres what youll be doing\n\nEssential Duties\n\n* Utilize the Technical Support helpdesk ticketing system to respond to student and staff technology issues\n* Assists with scheduling parents and staff for computer repairs, troubleshooting and/or device replacement\n* Assists staff and students with password resets/login issues\n* Assists with the installation of new technology equipment - such as mounting classroom cameras and replacing computer hardware such as hard drives, chromebook screens, keyboards and other components\n* Assists with the setup and distribution of staff and student devices\n* Forwards unresolved problems to more senior staff, such as network/server problems or when log-in issues and password troubleshooting did not resolve the problem\n* Prioritizes and executes such as password resets and computer repairs as instructed by direct supervisor\n* Communicates with staff and students to ensure issues are resolved to their satisfaction\n\nRequirements\n\n* Possess an unrelenting work ethic\n* Communicate effectively in all verbal and written communications\n* Exercise excellent judgment and unquestionable integrity and confidentiality\n* Show great responsibility by being prepared, present, and prompt during all meetings\n* Have a welcoming presence during all staff, student, and parent interactions\n* Priority and time management skills with the ability to stay extremely organized and detailed oriented\n* Do whatever else is necessary to support our staff and students in their preparation for college, while modelling our core values of caring, respect responsibility and honesty\n* The ideal candidate will have knowledge and experience in some of the following areas:\n* Windows 10 Operating System\n* Microsoft Office Suite\n* Google ChromeOS\n* Google Workspaces (GSuite) tools such as Google Docs and Google Sheets\n* Wireless networking\n* Printer/copier hardware\n* AV technologies (Speakers, Projectors)\n\nQualifications\n\n* Alumni of Foundation Collegiate Academy preferred\n* Spanish speakers preferred\n\nCompensation: $15/hour part-time, max of 25 hours per week",
        "index": 47,
        "skills": [
            "information technology",
            "hardware",
            "networks",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    }
]