[
    {
        "position": "ExM MS&T Intern (BS/MS candidates)",
        "company": "Bristol Myers Squibb - 4.2",
        "location": {
            "city": "New Brunswick",
            "state": "New Jersey"
        },
        "posted": "2021-03-09T23:04:04.834Z",
        "url": "https://www.simplyhired.com/job/21t10i9BwDGQv8pZgXu8HINClGNVUjvjwe59TVLDJoXOjIDRaW_LPw?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:03.680Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nOne of the key responsibilities for MS&amp;T colleagues is to navigate through quality events and deviations that routinely happen during manufacturing of commercial DP batches. Deviations lead to investigation, closure of which is associated with root cause analysis and CAPA. Assessment of the root cause and proposing actions items that prevent future occurrence of the same event require both technical and strategic expertise. As of now deviations/investigations are managed case by case and MS&amp;T colleagues are doing a wonderful job at closing the investigation at timely manner making sure DP are released for patient use. But each event creates an excellent learning opportunity that if properly recorded, may end up becoming a useful tool for tackling a future event. Although each deviation may pose its unique challenges, opportunity exists at classifying them under broad categories, such as particulates, appearance etc. and capturing the strategies taken to resolve those events in a manner that is easily searchable. Current quality management systems, such as infinity and trackwise do great job at recording quality events but fall short at serving as a database that is easily searchable. Colleague joining in this position will spearhead creation of a user friendly database on hot topics, including deviation and events. This database will compile events that parenteral MS&amp;T has managed over the years, including the actions taken for root cause analysis and prevention of future occurrence. Colleague will be also responsible for extending the database with option for visualization and statistical assessment.\n<br><br>\nKey Responsibilities\n<br><br>\nCollaborate with cross functional team including MS&amp;T and ExM quality\n<br>Look through historical records of deviations occurred during manufacturing\n<br>Create a searchable, user friendly database compiling all the deviations\n<br>Create tools for visualization and statistical interpretation of events\n<br><br>\nQualifications &amp; Experience\n<br><br>\nAll candidates must be authorized to work in the US without sponsorship needs.\n<br>Candidates must be currently enrolled in an accredited college/university seeking an undergraduate degree or master’s degree in computer science, statistics or any other relevant branches of engineering and science and continuing their education for the following semester (e.g., Fall 2021).\n<br>Experience at data base management\n<br>Experience of working with software tools for visualization and statistical assessment\n<br>Must be eligible to work full-time remotely, 40 hours per week, from June – August 2021.\n<br><br>\nBMSEC, BMSINTERN\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 1,
        "skills": [
            "software engineering",
            "data visualization",
            "machine learning",
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Error",
        "company": "Error",
        "location": {
            "city": "Error",
            "state": "Not Available"
        },
        "posted": "2021-03-09T23:04:06.030Z",
        "url": "https://www.simplyhired.com/job/5-21wqFMEqNqLX4jH4ckcGjvKcPZ4kb732mxJdgJba6heZw3MYjeRg?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:05.235Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nMain Goal of this summer project is to develop strategy for cloud computing of equipment monitoring processes using existing options available within BMS. Some additional work on side projects revolving around but not limited to the equipment robustness program, including equipment monitoring, automated email service, and maximizing utilization of a shared computer.\n<br><br>\nKey Responsibilities\n<br><br>\nDefining plan, risk assessment, and strategy for cloud computing of equipment monitoring processes\n<br>Maximize utilization of shared computer\n<br>Fully automated Equipment Robustness monitoring plan method that will decrease the number of FTE hours for monitoring equipment.\n<br>Expanded automated email service for new sites and equipment.\n<br><br>\nQualifications &amp; Experience\n<br><br>\nAll candidates must be authorized to work in the US without sponsorship needs.\n<br>Candidates must be a rising junior, senior or master’s student currently enrolled in an accredited college/university seeking an undergraduate degree or master’s degree in engineering (chemical preferred) and continuing their education for the following semester (e.g., Fall 2021).\n<br>Minor in Computer Science or strong Computer Skills\n<br>Strong computer programing experience in MATlab, Python, R, C++, HTML, Java, etc.\n<br>Highly motivated, self-driven individual with the ability to work in a project team structure.\n<br>Strong written and verbal communication skills\n<br>Experience with video conferencing, MS Teams, Zoom, etc.\n<br>Must be eligible to work full-time remotely, 40 hours per week, from June – August 2021.\n<br><br>\nBMSEC, BMSINTERN\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 2,
        "skills": [
            "java",
            "matlab",
            "python",
            "c and c++",
            "project management",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Error",
        "company": "Bristol Myers Squibb - 4.2",
        "location": {
            "city": "Princeton",
            "state": "New Jersey"
        },
        "posted": "2021-03-03T23:04:07.629Z",
        "url": "https://www.simplyhired.com/job/cx6GNIx8aReQnQAL2wZtONA-en8zGQViFvYnp7Nxp29iOFF6S10WLQ?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:06.483Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nPosition Summary\n<br><br>\nThis position is in the BMS Research and Early Development Information Technology (R&amp;ED IT) group and will involve working with the Change Management team to update and maintain the end user support site in SharePoint Online. There will be learning opportunities in technologies that will include SharePoint, WalkMe, ServiceNow and a variety of scientific applications such as Dotmatics suite, PerkinElmer ELN, IDBS E-workbook, Schrodinger LiveDesign, Jaggaer Reagent Materials Management, and in-house applications. The intern should have some experience in SharePoint and excellent MS Office application skills, but BMS will provide training in BMS specific technologies. The intern will support the design, development, deployment, administration and maintenance of SharePoint content management solutions using out-of-the-box SharePoint functionality. Candidate should understand technical concepts and be capable of managing relationships within project teams. They should be able to coordinate with peers involved to ensure the completion of the associated work. A high degree of organization and self-motivation is required. Prefer a responsible undergraduate in college working on a life science or computer science degree with technical aptitude.\n<br><br>\nKey Responsibilities\n<br><br>\nUpdating SharePoint content\n<br>Contribute to design decisions for SharePoint site\n<br>Review myBMS content for R&amp;ED IT applications\n<br><br>\nQualifications &amp; Experience\n<br><br>\nCompleted at least one-year undergraduate work at a College or University\n<br>Preferred majors include life sciences or computer science\n<br>SharePoint or website design/editing experience\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 3,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Error",
        "company": "Error",
        "location": {
            "city": "Seattle",
            "state": "Washington"
        },
        "posted": "2021-03-15T23:04:08.790Z",
        "url": "https://www.simplyhired.com/job/XM4xtKa5R6rYLpdmvtiOM58cOpH4h6MjN7Z3Qr8COtkHt31jKnbpIw?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:08.011Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nWe are seeking a highly motivated candidate to join our Translational Bioinformatics at BMS for a 10-week summer internship program. This group of scientists is responsible for advancing BMS' industry-leading oncology pipelines by applying cutting-edge computational methods to clinical trial and real-world data for personalized medicine. The position will focus on the application of machine learning methods to predict patient response to immunotherapy using clinical trial data. The successful applicant will receive mentorship from experienced bioinformatics scientists, interact with bioinformaticians and experimental biologists from collaborating groups, and learn the process of drug development in a leading pharmaceutical industry environment.\n<br><br>\nKey Responsibilities\n<br><br>\nUse existing internal and open-source R codes\n<br>Integrate clinical and molecular data across multiple clinical trials\n<br>Assess effect of molecular information (genomics, transcriptomics) on response to therapy\n<br>Apply machine learning methods on data to predict treatment response\n<br>Deliver and communicate results for key decision points\n<br><br>\nQualifications &amp; Experience\n<br><br>\nUndergraduate or graduate student in bioinformatics, genomics, statistics, computer science or related field.\n<br>Basic working proficiency in R programming preferred.\n<br>Ability to apply statistical modeling and machine learning preferred.\n<br>Hands-on experience in analyzing NGS data preferred.\n<br>Functional knowledge of R Shiny app development is a plus.\n<br>Excellent communication skills, both verbal and written.\n<br>Ability to work independently and effectively collaborate with cross-functional teams.\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 4,
        "skills": [
            "machine learning",
            "bioinformatics",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Error",
        "company": "Bristol Myers Squibb - 4.2",
        "location": {
            "city": "Princeton",
            "state": "New Jersey"
        },
        "posted": "2021-03-15T23:04:10.017Z",
        "url": "https://www.simplyhired.com/job/2P47yQN8ACR3JDQN_u5HeyunpGdf6JqV47KUcF_OyazgYRYOi-bP_Q?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:09.144Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nWe are seeking a highly talented and motivated student for a summer internship in Late Stage Immuno-Oncology. This internship position will focus on assessing the effects of genetic alterations and expressions on response to immunotherapy.\n<br><br>\nThe successful candidate will have the opportunity to independently conduct a computational research project using clinical datasets to support the immune-oncology programs. The candidate will work closely with experienced bioinformatics scientists and cross-functional teams.\n<br><br>\nBristol-Myers Squibb is an industry leader in immuno-oncology pipelines with rich clinical portfolios covering many cancer indications. Our mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nKey Responsibilities\n<br><br>\nPerform analysis of clinical and biomarker datasets (e.g., large-scale omics datasets including RNA-seq, exome and whole genome sequencing)\n<br>Integrate real-world clinical and molecular datasets to answer key scientific questions\n<br>Perform analysis and visualization in a reproducible research framework\n<br>Deliver results and present findings for decision-makings\n<br><br>\nQualifications &amp; Experience\n<br><br>\nMaster or PhD student enrolled in bioinformatics, statistics, computer science or related fields\n<br>Must be able to work full-time for at least 10 weeks\n<br>Demonstrated hands-on experience in one of the following programming languages: R, Python, Perl\n<br>Experience working with genomics and next-generation sequencing data (RNA-seq, WES, WGS) is required; experience in clinical trial data analysis is a plus\n<br>Domain knowledge in molecular biology and statistics is highly preferred\n<br>Independent, creative thinking and strong problem-solving skills\n<br>Excellent written and verbal communication skills\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 5,
        "skills": [
            "data visualization",
            "bioinformatics",
            "python",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Error",
        "company": "Bristol Myers Squibb - 4.2",
        "location": {
            "city": "Tampa",
            "state": "Florida"
        },
        "posted": "2021-03-15T23:04:11.272Z",
        "url": "https://www.simplyhired.com/job/anD9NNdBxZIMaeQxeY92_QVyb8Zb0OG-_0YN1GTscr_s0g1usiYYPg?q=computer+science+intern",
        "lastScraped": "2021-03-15T23:04:10.371Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Bristol Myers Squibb, we are inspired by a single vision – transforming patients’ lives through science. In oncology, hematology, immunology and cardiovascular disease – and one of the most diverse and promising pipelines in the industry – each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\n<br><br>\nWe are seeking an innovative and motivated graduate student scientist to join our team for the duration of this internship. This group of computational scientists is responsible for advancing Bristol-Myers Squibb’s industry-leading pipeline in multiple therapeutic areas (including Immuno-Oncology, Cardiovascular, Fibrosis, and Immunoscience) through the strategic application of cutting-edge bioinformatics approaches.\n<br><br>\nThe scientists in this group analyze both pre-clinical and clinical -omics data sets, including RNA-Seq, Exome and Whole Genome Sequencing, single-cell sequencing, high-throughput proteomics, and multiplex flow cytometry to nominate novel drug targets, enable patient enrichment strategies, and guide drug development decisions. The group interacts with and influences all aspects of R&amp;D at BMS, from early discovery through late-stage development.\n<br><br>\nThis internship position will provide the scientist with knowledge of the type of NGS data analysis we perform, the computational platforms we use, and the ability to further expand our NGS capabilities. There are multiple projects this scientist will be able to contribute to, including: 1) develop machine-learning analysis pipelines applied to NGS data; 2) develop an analysis pipeline mapping whole-exome and bulk RNA-Seq samples to HLA regions of the human genomes; 3) improve our production-grade pipelines to annotate NGS samples with computationally derived annotation; 4) develop a computational platform-agnostic mechanism to deploy analysis pipelines.\n<br><br>\nKey Responsibilities\n<br><br>\nEstablish prototype of proposed analysis to prove effectiveness.\n<br>Apply pipeline to existing clinical trial data to explore results that could potentially impact results.\n<br>Identify potential QC issues and limitations with using this framework.\n<br>Communicate problems, findings and methods with other scientists throughout this process.\n<br>Recommend best practices.\n<br><br>\nQualifications &amp; Experience\n<br><br>\nSenior M.S. or Ph.D. graduate student in Bioinformatics, Computer Science or related field, no work experience necessary.\n<br>Fluency with Linux-based high-performance computing environments, including python, Linux shell scripting, ssh and git\n<br>Experience with DNASeq and RNAseq pipelines and data a plus\n<br>Extensive hands on experience with common NGS tools (GATK, picard, etc) a plus\n<br>Strong problem-solving and collaboration skills, and rigorous and creative thinking\n<br>Excellent written and oral communication skills, including an ability to explain complex ideas to computational scientists, experimentalists, and clinicians\n<br>The ability to work across organizations to define and solve problems that will benefit the whole. Capable of establishing strong working relationships across the organization.\n<br><br>\nAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n<br><br>\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives.</div><div></div>",
        "index": 6,
        "skills": [
            "machine learning",
            "bioinformatics",
            "python",
            "project management"
        ],
        "remote": false
    }
]