[
    {
        "position": "ASIC Engineering Intern",
        "company": "Hewlett Packard Enterprise - 3.8",
        "location": {
            "city": "Roseville",
            "state": "California"
        },
        "posted": "2021-09-23T18:35:36.261Z",
        "url": "https://www.simplyhired.com/job/eXFfrmpb_Sff0yUv-1E_1h4PTuUPTg9SOKMecV5fMfpNmU7Omxukqw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:32.844Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At HPE, we bring together the brightest minds to create breakthrough technology solutions and advance the way people live and work. Our legacy inspires us as we forge ahead dedicated to helping our customers make their mark on the world.\n<br><br>\nLearning does not only happen through training. Relationships are among the most powerful ways for people to learn and grow, and this is part of our HPE culture. In addition to working alongside talented colleagues, you will have many opportunities to learn through coaching and stretch assignment opportunities. You’ll be guided by feedback and support to accelerate your learning and maximize your knowledge. We also have a “reverse mentoring” program which allows us to share our knowledge and strengths across our multi-generation workforce.\n<br><br>\nAruba, a Hewlett Packard Enterprise Company, is a leading provider of next-generation networking solutions for the mobile enterprise: http://www.arubanetworks.com/company/about-us. We have an exciting opportunity for a ASIC Post-Si Verification Engineering Intern to join our team in Roseville, CA.\n<br><br>\nThe company designs and delivers Mobility-Defined Networks that empower IT departments and #GenMobile, a new generation of tech-savvy users who rely on their mobile devices for every aspect of work and personal communication. To create a mobility experience that #GenMobile and IT can rely upon, Aruba Mobility-Defined Networks™ automate infrastructure-wide performance optimization and trigger security actions that used to require manual IT intervention. The results are dramatically improved productivity and lower operational costs.\n<br><br>\n<b>Responsibilities:</b><br>\nThe intern will be working with the HPE Aruba ASIC development team on next generation products. You will have a summer project that will be used for/in the development activities of current or future ASIC's. This ASIC team develops state of the art, world class Networking Chips for the marketplace and our customers. We are looking for individuals that have the desire and ability to contribute at this level. The intern will be working with and learning from the senior members of the ASIC / VLSI team. Responsibilities may include RTL/Physical Design, Pre-Silicon verification; Post-Silicon verification; Formal Verification; Script &amp;/or Tool development; schedule breakdowns, document generation, and several other possible duties. Several assignments are possible, so final alignment will be based on student skills and business needs.\n<br><br>\n<b>Education and Experience Required:</b><br>\nMust be currently enrolled in a 4 year University/College pursuing a degree in Computer Engineering, Computer Science, Electrical Engineering or equivalent.\n<br><br>\nAt least 3rd Year of engineering courses completed (2023 graduate).\n<br><br>\nExperience with scripting languages (Python, PERL, TCL or equivalent)\n<br><br>\nExperience with hardware design\n<br><br>\nExperience with software programming languages (C; C++)\n<br><br>\nExperience with Verilog\n<br><br>\n<b>Skills Needed:</b><br>\nDesire to learn and contribute\n<br>Result oriented and self-motivation\n<br>Good communication skills\n<br>Ability to work within a team environment\n<br><br>\n<b>What we can offer you :</b>Extensive benefits, a competitive salary and participation in the shared values and purpose that make Hewlett Packard Enterprise one of the world´s most attractive employers! At HPE, our goal is to provide equal opportunities, flexible work-life balance, and constantly evolving career growth. If you are looking for challenges in an exciting supportive work environment, then we definitely want to hear from you. Continue the conversation by clicking apply now below, or directly via our Careers Portal at www.hpe.com/careers.Join us and make your mark!Find out more about us and follow us on:https://www.facebook.com/HPECareershttps://twitter.com/HPE_CareersHPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together\n<br><br>\n1090454\n<br><br>\nThis role has been designated as ‘Office’, which means you will primarily work from an HPE office.</div><div></div>",
        "index": 1,
        "skills": [
            "information technology",
            "software engineering",
            "hardware",
            "networks",
            "c and c++",
            "python",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Software Design Intern",
        "company": "KEB - 3.5",
        "location": {
            "city": "Shakopee",
            "state": "Minnesota"
        },
        "posted": "2021-09-23T18:35:40.745Z",
        "url": "https://www.simplyhired.com/job/B9bsqR9LuunXUpZ_U6t-iJNw-ToMRL52vebZtiAw1JQ_JiaAwjrt6g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:36.653Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">KEB AMERICA, Inc., a growing global manufacturer of automation and motion control products, is currently seeking a student for a position as a Software Design Intern.\n<br><br>\nKEB has an exciting opportunity to learn and grow in our Engineering Department. As a Software Design Engineer Intern you will acquire knowledge and develop skills, while working on projects with the Software Engineering Team. This position will assist with the test and validation process via test system software development and testing.\n<br><br>\n<b>Responsibilities may include:</b><br>\nTest and verification of software functionality\n<br>Development and testing of new validation software based on specifications\n<br>Documentation and modeling of new software functions\n<br>Modifying and refactoring existing software\n<br>Ability to follow code execution and identify the resulting functionality\n<br><br>\n<b>Education / Experience:</b><br>\nEnrolled in a professional degree in the field of Computer Science, Computer/Electrical Engineering or related field with a GPA &gt;= 3.0\n<br>C programming experience\n<br>Python programming experience\n<br>Experience with embedded system design\n<br>Experience with file repositories such as Git\n<br><br>\n<b>Specific Technical Skills (May be learned on the job):</b><br>\nFamiliarization with industrial programming language IEC 61131-3\n<br><b>Programming Languages:</b> C, C#, Python, and scripting\n<br>Gitlab\n<br>Confluence, Jira\n<br>Familiarization with UML\n<br>Basic understanding of variable speed drives and control systems\n<br>Embedded systems</div><div></div>",
        "index": 2,
        "skills": [
            "software engineering",
            "python",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Summer 2022 Intern",
        "company": "ANSYS - 3.7",
        "location": {
            "city": "California",
            "state": "California"
        },
        "posted": "2021-09-23T18:35:44.689Z",
        "url": "https://www.simplyhired.com/job/tguvrakT2TZWEx0_CFdXYFO8rLLdbTEYdhJ1_oSln0QQRh2Dgtbj3w?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:41.118Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Ansys is the global leader in engineering simulation, helping the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, Ansys helps companies solve the most complex design challenges and engineer products limited only by imagination.\n<br><br>\nSUMMARY\n<br>ANSYS empowers the world's most innovative companies to design and deliver transformational products by offering the best and broadest engineering simulation software to solve the most complex design challenges and engineer products limited only by imagination. Thus, through our enriching co-op andintern program, we help develop the next-generation of engineers and technologists.You will develop our industry-leading simulation software while gaining real experience in your field of study. You will support Office of CTOfor contributing to researching and implementing new algorithms for machine learning models in context of numerical methods, simulations and 3D understanding using deep learning and other related fields.\n<br><br>\nThis Internship is a 40-hour per week paid position starting May 2022and concluding August 2022.\n<br><br>\nRESPONSIBILITIES\n<br><ul><li>Design and develop machine learning algorithms for training using our ANSYS solvers as surrogates for CAE applications</li><li>Create datasets, label data and train machine learning algorithms using deep learning or reinforcement learning techniques.</li><li>Implement solutions in experimental code (Python, TensorFlow, Pytorch) using industry best practices in software development.</li><li>Test the algorithms developed and share results and training curves.</li><li>Design and develop code with Unit Testing and TDD (test driven design) based on specific list of engineering scenarios.</li></ul>\nMINIMUM QUALIFICATIONS\n<br><ul><li>Enrolled in a MS or PhD program pursuing degree in engineering, mathematics or computer science.</li><li>Experience with machine learning using scripting languages such as Python/R and GPU programming.</li><li>Experience with statistical data analysis such as linear models, multivariate analysis, stochastic models, and sampling methods.</li></ul>\nPREFERRED QUALIFICATIONS\n<br><ul><li>Preferred experience using machine learning frameworks such as TensorFlow or Pytorch</li><li>Preferred experience in machine learning using 3D and geometry</li><li>Preferred experience using 3d software for datasets creation</li><li>Preferred experience Object-oriented languages such as C++ and/or C#</li><li>Preferred experience with source control such as GIT, SVN</li></ul>\nCULTURE AND VALUES\n<br>Culture and values are incredibly important to Ansys. They inform us of who we are, of how we act. Values aren't posters hanging on a wall or about trite or glib slogans. They aren't about rules and regulations. They can't just be handed down the organization. They are shared beliefs - guideposts that we all follow when we're facing a challenge or a decision. Our values tell us how we live our lives; how we approach our jobs. Our values are crucial for fostering a culture of winning for our company:\n<br><br>\nCustomer focus\n<br>Results and Accountability\n<br>Innovation\n<br>Transparency and Integrity\n<br>Mastery\n<br>Inclusiveness\n<br>Sense of urgency\n<br>Collaboration and Teamwork\n<br><br>\nWORKING AT ANSYS\n<br>At Ansys, you will find yourself among the sharpest minds and most visionary of leaders, collectively aiming to change the world with innovative technology and remarkable solutions. With the prestigious reputation in servicing well-known, world-class companies, standards at Ansys are high, met by those willing to rise to the occasion and meet those challenges head-on. Because at Ansys, it's about the learning, the discovery and the collaboration. It's about the \"what's next\" as much as the \"mission accomplished\". It's about the melding of disciplined intellect with strategic direction and results that have, can and will impact real people in real ways, forged within a working environment built on respect, autonomy and ethics.\n<br><br>\nAt Ansys, you will find yourself among those eager to drive the world towards the next best thing with hands planted firmly on the wheel.\n<br>Our team is passionate about pushing the limits of world-class simulation technology so our customers can turn their design concepts into successful, innovative products faster and at lower cost. As a measure of our success in attaining these goals, Ansys has been recognized as one of the world's most innovative companies by prestigious publications such as Bloomberg Businessweek and FORTUNE magazines.\n<br><br>\nAnsys is an S&amp;P 500 company and a component of the NASDAQ-100.\n<br><br>\nFor more information, please visit us at www.ansys.com\n<br><br>\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n<br><br>\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.\n<br><br>\n<b>Nearest Major Market:</b> Sacramento</div><div></div>",
        "index": 3,
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "deep learning",
            "python",
            "c and c++"
        ],
        "compensation": "paid",
        "start": "2022-04-30T15:00:00.000Z",
        "due": "2022-04-30T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "CSX Technology Internship Program",
        "company": "CSX - 3.2",
        "location": {
            "city": "Jacksonville",
            "state": "Florida"
        },
        "posted": "2021-09-23T18:35:48.629Z",
        "url": "https://www.simplyhired.com/job/MbpagTARN_U8fbHvpSO1ttKq6Kdk6GY19r15tTGro3EA7U9I13BQlQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:45.086Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Summary:</b><br>\nCSX Technology is seeking interns for a 12+ week immersion into our organization. Individuals will complete challenging assignments in a collaborative team environment directly contributing to innovation, transformation, and delivery of corporate results. Our internships provide an opportunity for candidates to preview full-time opportunities at CSX, gain practical experience, and build professional networks.\n<br><br>\n<b>Primary Activities and Responsibilities:</b><br>\nInterns will be placed with a technology team based on their skills, aspirations, and active company initiatives. Possible teams include: Applications Development (Java and Angular web development), Data Science &amp; Analytics, Cybersecurity, Agile Delivery, Software Infrastructure (including Automation and Cloud), User Experience, IT Operations, Integrations/API, Project Management, Robotics/Drones, GIS, Field Infrastructure, and Service Support.\n<br><br>\nRegardless of team placement, all technology interns play an important role in advancing and delivering Technology initiatives. The expectations of these compensated positions include, but are not limited to:\n<br><br>\nActive contribution in a dynamic, agile team environment\n<br>Adherence to best practices for developing and maintaining secure systems\n<br>Root-cause analysis to iterate improvement and increase reliability and efficiency\n<br>Engagement across teams and stakeholders, to ensure shared understanding and value delivery\n<br><br>\nQualifications\n<br><br>\n<b>Minimum Qualifications:</b><br>\nMust be at least 18 years of age\n<br>Currently enrolled in an undergraduate or graduate degree program in Computer Science, Information Systems, or a related major field of study from an accredited institution.\n<br>Cumulative minimum GPA of 3.0 (based on a 4-point scale)\n<br><br>\n<b>Preferred Qualifications:</b><br>\nCumulative GPA of 3.3 (based on a 4-point scale)\n<br><br>\n<b>Knowledge and Skills:</b><br>\nKnowledge of web (angular/java) programming concepts and technologies\n<br>Knowledge of relational and/or graph database concepts and functions\n<br>Knowledge of Agile, DEVOPS, cybersecurity, and integration practices and concepts\n<br>Knowledge of hardware, desktop, network, and field infrastructure components\n<br>Strong collaboration, communication, interpersonal, and influence skills\n<br>Problem-solving, analysis, organizational, and time management skills\n<br><br>\n<b>Job Requirements:</b><br>\nCommunicate effectively and professionally with peers, leadership, stakeholder audiences\n<br>Work within established deadlines\n<br>Willing and able to work days and hours as assigned\n<br>Successfully complete a background check and drug test\n<br><br>\n<b>Environmental Conditions:</b><br>\nWork inside an office environment\n<br><br>\n<b>Our Commitment to Operate Safely:</b><br>\nLed by our Guiding Principles, CSX is committed to protecting its employees, customers and the communities in which we operate. Therefore, as a condition of employment, successful candidates for all management positions, train dispatchers and crew dispatchers will be required to provide proof of full COVID-19 vaccination before the candidate’s start of employment. Proof of COVID-19 vaccination must be provided during the onboarding process. Should the successful candidate seek an exemption from vaccination for a medical reason, a contraindication, or a sincerely held religious belief, appropriate documentation must be provided in support of such request.\n<br><br>\n<b>Company Profile:</b><br>\nCSX Corporation, a Fortune 500 company headquartered in Jacksonville, FL, is a multi-modal freight transportation company serving customers across North America. Through its primary subsidiary, CSX operates the largest railroad in the eastern United States with operations in 23 states, the District of Columbia, and two Canadian provinces. CSX also includes an integrated intermodal company which serves customers with its own truck and terminal operations as well as a dedicated domestic container fleet. Other CSX subsidiaries provide technology and real estate support to the company. These subsidiaries combine to allow CSX to deliver efficient freight alternatives to customers in a variety of industries, including coal, chemicals, automobiles, metals, agricultural and forest products, food and consumer goods.\n<br><br>\nClosing Statement\n<br>At CSX, two of the company's core values are People Make The Difference and Safety Is A Way of Life. We are committed to offering our team members the most competitive compensation and benefits package available, unlimited opportunities for development and growth throughout an exciting and rewarding career, and the safest work environment possible.\n<br><br>\nCSX is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Click here to view the EEO is Law poster. Here\n<br><br>\nClick here to view the OFCCP pay transparency provision information. Here\n<br><br>\nCSX Transportation and its subsidiaries are not seeking outside assistance or accepting unsolicited resumes from staffing agencies or search firms for employment or contractor opportunities. Any resumes submitted by an outside vendor to any employee at CSX via e-mail, Internet, or directly to hiring managers without a valid written search agreement in place with the Talent Acquisition / HR department will be deemed the sole property of CSX. No placement fee will be paid in the event a candidate is hired as a result of the referral, or through other means.\n<br><br>\n<b>CSX Company:</b> CSX Technology\n<br><b>Primary Location:</b> United States-FL-Jacksonville\n<br><b>Relocation Available :</b>No\n<br><b>Tax Status:</b> FICA\n<br><b>Overtime Status:</b> Exempt\n<br><b>Closing Date:</b> Nov 22, 2021, 9:59:00 PM\n<br><b>Number of Openings:</b> 6\n<br><b>Travel:</b> No</div><div></div>",
        "index": 4,
        "skills": [
            "project management",
            "information technology",
            "angular",
            "java",
            "devops",
            "hardware",
            "networks",
            "robotics"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Grainger Technology Group Intern - Analyst",
        "company": "Grainger - 3.7",
        "location": {
            "city": "Chicago",
            "state": "Illinois"
        },
        "posted": "2021-09-23T18:35:52.606Z",
        "url": "https://www.simplyhired.com/job/oqchlTfok-8X7zorA3mqasSQTrdjLoA7dMkww4PJv0PRZ9MbJ-DvHQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:49.021Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">GRAINGER OVERVIEW\n<br><br>\nAt Grainger, we’re committed to our purpose – We Keep the World Working. Grainger is a leading global supplier of maintenance, repair, and operational supplies, providing services and solutions for every industry. Our 23,000 employees are driven to serve customers and the community in exceptional ways; focusing on delivering the highest level of service leveraging the most innovative solutions. In the Grainger Technology Group, we deliver the technology platforms, systems, and services that power the Grainger business. As part of a high-performing team, you’ll be able to develop your talents and make a difference. Grainger is a Fortune 500 company and a perennial member of Fortune magazine's Most Admired Companies list.\n<br><br>\nTHE PROGRAM\n<br><br>\nThe GTG internship is a 10-week program based out of our downtown Chicago office. You will work alongside team members on functionality that has a direct impact on the business. Throughout the summer, there will be plenty of time for networking, professional development, and social events. At the end of the internship, you will present your work to senior leadership.\n<br><br>\nThe internship is paid and free housing is provided in downtown Chicago for all Grainger Technology Group interns. At this time, we plan for our 2022 internship program to take place in person. However, we are actively monitoring the COVID-19 pandemic and will take all necessary steps to ensure team member safety.\n<br><br>\nTHE ROLE\n<br><br>\nWe are looking for analysts with strong technical and analytical skills as well as strong interpersonal and effective communication skills. You will contribute your skills to a specific team and may have the opportunity to work with your intern peers on additional projects. Through your work and other development opportunities, you will grow your technical skills and understand how our technology stack empowers our business to serve our customers.\n<br><br>\nResponsibilities\n<br><br>\nGather data to support technical recommendations to address problems\n<br>Write user stories and ensure the integrity of stories across projects\n<br>Define, perform and document basic functional configuration activities\n<br>Collaborate on a team operating in an Agile development context\n<br>Demonstrate strong analytical skills; Excellent verbal and written communication skills;\n<br>Display a proactive, results-oriented attitude; superb work ethic, and flexibility to work in an environment of constant change\n<br><br>\nQualifications\n<br><br>\nPreferably pursuing a Computer Science, Computer Engineering, or Information Systems related field.\n<br>Ability to grasp business and technical concepts quickly\n<br>Preferred major GPA of 3.0 or higher\n<br>Expected graduation with a Bachelors or Masters degree between Winter 2022 – Spring 2023\n<br>Does not require sponsorship\n<br><br>\nGrainger is an Equal Opportunity Workplace and an Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.</div><div></div>",
        "index": 5,
        "skills": [
            "information technology",
            "networks",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "ERP Inside Sales Representative - Associate/Intern (Remote)",
        "company": "Novobi, LLC -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-09-23T18:35:56.509Z",
        "url": "https://www.simplyhired.com/job/UyNYM5zcrygUdRwgMfO6lm3yo7C3Jgf7803fmh4mz0caZi9wbPoNuw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:52.969Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Novobi is an ERP Consulting firm that has been growing consistently by more than 60% per year over the last 5 years. We have 50+ talents and an artisanship culture. We are proud of our multi-year, 100% project-success and customer-retention rates that are fueled by our core values of integrity, artisanship, commitment, and teamwork.</p><p>Our clients are mostly fast-growing SMEs in the Retail, Manufacturing, and Services industries. We help them define and execute digital transformation strategies using Enterprise Resource Planning software (ERP), Cloud Computing, and Data Science.</p><p>We are a Gold Partner of Odoo, an ERP company that has received over $300 million in funding and has been growing at an average of over 60% per year for the last 10+ years. We are also a partner of Amazon Cloud (AWS).</p><p><b>About the Role</b></p><p>This is an entry-level position that will allow you to build a career path in the premier ERP Consulting areas. The Associate/Intern Sales Representative will be involved in ERP product analysis, ERP requirement analysis, market research, marketing initiatives, business development, and sales activities.</p><p>Novobi offers a flexible, 100% remote working environment. We encourage business or IT major students to apply and will do our best to support your school schedule.</p><p><b>What you will do</b></p><ul><li>Work with Sales and Marketing leaders to define strategies and sales plan to win new ERP clients.</li></ul><ul><li>Develop and execute account penetration strategies.</li><li>Recognize business needs for digital transformation and can communicate effectively the benefits an ERP solution can deliver.</li><li>Understand Odoo product offerings and be able to perform high-level gap analysis (mapping business requirements to product offerings)</li><li>Establish and maintain strong relationships with key customer stakeholders in order to ensure customer success and identify new opportunities.</li></ul><p><b>Requirements</b></p><ul><li>Detail-oriented, quality mindset, and strong critical thinking skills.</li><li>Pursuing or hold a Bachelor’s degree in Marketing, Business Administration, Information Technology, Computer Science, or equivalent.</li></ul><p><i>Nice to have</i></p><ul><li>Experience in the Retail or Manufacturing industry.</li><li>Experience in the IT consulting industry.</li><li>Experience with ERP software (Odoo, NetSuite, Acumatica, BrightPearl, Infor, Epicor, IQMS, Sage, etc.).</li><li>Pursuing or hold a Master’s degree in Marketing, Business Administration, Information Technology, Computer Science, or equivalent.</li></ul><p><b>What's great about this job?</b></p><ul><li>Challenging and impactful works: help US businesses execute digital transformation strategies to grow their business.</li><li>Great career path to join the premier ERP Consulting workforce.</li></ul><ul><li>Flexible working hours.</li></ul><ul><li>Get real responsibilities and autonomy.</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $20.00 - $35.00 per hour</p><p>Benefits:</p><ul><li>Employee assistance program</li><li>Flexible schedule</li><li>Health insurance</li><li>Paid time off</li><li>Paid training</li><li>Parental leave</li><li>Travel reimbursement</li><li>Work from home</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Supplemental Pay:</p><ul><li>Bonus pay</li><li>Commission pay</li></ul><p>Experience:</p><ul><li>Customer service: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Work Location: Remote</p></div><div></div>",
        "index": 6,
        "skills": [
            "information technology",
            "project management",
            "software engineering",
            "cloud computing"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Data Science Intern",
        "company": "Service Management Group - 4.0",
        "location": {
            "city": "Kansas City",
            "state": "Missouri"
        },
        "posted": "2021-09-23T18:36:00.492Z",
        "url": "https://www.simplyhired.com/job/os4SsXCilntYgPP_4cYCBB6nWqztOjn-9bFB_iqox53cn_d1TwpBXw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:35:56.893Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Overview: SMG – Service Management Group is looking for a Data Science Intern for summer 2022!</p><p>As a summer intern on our Data Science team, you’ll see code you write go live every week, analyzing and acting on data received from hundreds of thousands of consumers. Through this opportunity, Big Data philosophies and software will be applied to integrate these data feeds and support more efficient and effective business decision-making. Successful applicants can expect to work closely with a mentor to apply a variety of machine learning and data science methods, including deep learning &amp; natural language processing, to real-world business problems.</p><p>Here at SMG, we are more than just an experience management software platform; we aim to inspire experiences that improve people’s lives. We are a catalyst for change—helping organizations generate new revenue, grow existing revenue, reduce churn and detractors, and drive operational efficiencies. Our unique software with a service (SwaS) model puts a dual focus on platform technology and professional services, making it easy for brands to activate insights based on customer, patient, and employee feedback.</p><p>SMG embraces our collective differences as human beings. We celebrate diversity and create an inclusive work environment in which all employees experience belonging, have their unique needs respected and met, have equal access to opportunities and resources, and feel fully engaged to contribute to the company’s success.</p><p>Responsibilities</p><ul><li>Work with a mentor on the data science team to complete an applied machine learning project</li></ul><p>Qualifications</p><ul><li>Ideal candidates will be working toward a BS or an MS degree in Computer Science, Electrical Engineering, or related science/engineering field.</li><li>Knowledge of data structures, algorithms, and statistics</li><li>Experience with Python and SQL</li><li>Familiarity with data science and machine learning concepts</li><li>Experience with Python data science &amp; machine learning libraries such as Scikit-learn, PyTorch, Pandas, and Numpy is preferred.</li></ul><p>Job Types: Full-time, Internship</p><p>Work Location: Multiple Locations</p></div><div></div>",
        "index": 7,
        "skills": [
            "data science",
            "machine learning",
            "project management",
            "software engineering",
            "sql",
            "python",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Intern Application Developer - Summer 2022",
        "company": "State Farm - 3.7",
        "location": {
            "city": "Bloomington",
            "state": "Illinois"
        },
        "posted": "2021-09-23T18:36:04.423Z",
        "url": "https://www.simplyhired.com/job/RxPbk2_nazvcjZmSMBLMaQJZA2UJds8uoCx5wBJDmRt53C5lTw3AUw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:00.858Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Overview:</b><br>\nAs a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.\n<br><br>\nWe offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!\n<br><br>\n<b>Internship duration and hours:</b> Summer 2022 5/23/2022-8/5/2022\n<br><br>\n<b>Session:</b> 38.75 hours per week, Monday-Friday\n<br><br>\nVisit our Careers page for more information on our benefits, locations and the process of joining the State Farm team!\n<br><br>\n<b>Office Location(s):</b> Bloomington, IL; Atlanta, GA; Dallas, TX; Phoenix, AZ\n<br><br>\n<b>Responsibilities:</b><br>\nThe P&amp;C Actuarial and Underwriting Modeling (PCM) department at State Farm is a place where interns complete innovative, meaningful research in a collaborative environment focused on developing technical and business skills - a perfect complement to the classroom.\n<br><br>\nWe are looking for innovative individuals who are self-starters and like being part of a team to develop and implement creative solutions. We have a growing and evolving infrastructure of applications that include development in Java and Python combined with leveraging containers and AWS for implementation.\n<br><br>\nWe offer development through training programs, mentoring programs, and leadership opportunities as well as competitive compensation/benefits such as flexible work arrangements.\n<br><br>\n<b>Qualifications:</b><br>\n<b>We Are Looking for Candidates with:</b><br>\nAbility to build new and/ or modify existing software to meet business and technical requirements through web based software component designing, coding, testing, and quality review\n<br>Experience with Java or Python development\n<br>Experience with Restful Web services\n<br>Experience with AWS is preferred, but is not required\n<br>Strong communication, interpersonal, organization, leadership and critical thinking skills\n<br>A 3.25 GPA cumulative and in major is required. A GPA of 3.5 or higher is preferred.\n<br>Ability to work in a team environment\n<br>Must be a college student, pursuing a degree in Information Systems/IT, Business, Statistics, Informatics, Data Science, Computer Science, Mathematics &amp; Engineering or a related field\n<br><b>Competencies:</b> Initiative; Teamwork; Relationship Building; Communication; Technical Functional; Strategic Business Focus\n<br><br>\nWhat You Can Expect\n<br><br>\n<b>Next Steps:</b> Apply and be sure to upload your unofficial transcripts. Competitive candidates may be invited to participate in the interview process. This is where the excitement begins!\n<br><br>\nWhat’s In It For You\n<br><br>\nCompetitive Pay\n<br><b>A Learning Culture:</b> Mentoring, Employee Development, and more!\n<br><b>Volunteer opportunities:</b> Get involved and give back to the community!\n<br><b>We embrace Diversity and Inclusion:</b> We are one team and it is simply the right thing to do!\n<br>Learn more about our benefits at State Farm Careers!\n<br><br>\n*****Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity*****</div><div></div>",
        "index": 8,
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "python",
            "c and c++",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Intern - Data Engineer - Summer 2022",
        "company": "State Farm - 3.7",
        "location": {
            "city": "Bloomington",
            "state": "Illinois"
        },
        "posted": "2021-09-23T18:36:08.392Z",
        "url": "https://www.simplyhired.com/job/zzssCo4pNwvwkcYZwpkSUcPbIiiQ9qea9NTZz5LsHlftl_eu5mPqFw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:04.820Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Overview:</b><br>\nWe are not just offering a job but a meaningful career! Come join our passionate team!\n<br><br>\nAs a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.\n<br><br>\nWe offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!\n<br><br>\n<b>Internship duration and hours:</b> Summer 2022 5/23/2022-8/5/2022\n<br><br>\n<b>Session:</b> 38.75 hours per week, Monday-Friday\n<br><br>\nVisit our Careers page for more information on our benefits, locations and the process of joining the State Farm team!\n<br><br>\n<b>Office Location(s):</b> Bloomington, IL; Atlanta, GA; Dallas, TX; Phoenix, AZ\n<br><br>\nThis is a \"Hybrid\" position, which means selected candidates will be assigned to a facility and will spend some time working both in office and from their home.\n<br><br>\n<b>Responsibilities:</b><br>\nWe are looking for innovative individuals who are self-starters and like being part of a team to develop and implement creative solutions. Supporting critical analytics, we manage a vast and ever growing DB2 data environment with expanding work in S3 to meet emerging data needs in a cloud environment.\n<br><br>\nWe offer development through extensive training programs, mentoring programs, and leadership, opportunities as well as competitive compensation/benefits such flexible work arrangements.\n<br><br>\n<b>Qualifications:</b><br>\n<b>We Are Looking for Candidates With:</b><br>\nExperience with Python, Scala, or Java\n<br>Familiarity with or eagerness to work on AWS distributed compute infrastructure &amp; applications\n<br>Demonstrated ability to effectively analyze and execute professional level work\n<br>Relational data experience such as Postgres, RDS, or DB2\n<br>Strong communication, interpersonal, organization, leadership, and critical thinking skills\n<br>A 3.25 GPA cumulative and in major is required. A GPA of 3.5 or higher is preferred.\n<br>Ability to work in a team environment\n<br>Must be a college student, pursuing a degree in Information Systems/IT, Business, Statistics, Informatics, Data Science, Computer Science, Mathematics &amp; Engineering, or a related field\n<br><br>\nWhat You Can Expect\n<br><br>\n<b>Next Steps:</b> Competitive candidates may be invited to participate in the interview process. This is where the excitement begins!\n<br><br>\nWhat’s In It For You\n<br><br>\n<b>Competitive Benefits, Pay and Bonus Potential:</b> Who doesn’t want money, right?\n<br><b>Volunteer opportunities:</b> Get involved and give back to the community!\n<br><b>A Learning Culture:</b> Mentoring, Professional Designations, Employee Development, and more!\n<br>401k Plan\n<br><b>Dress Code:</b> We trust our employees to dress for their day. That's right, we trust you...\n<br><b>We embrace Diversity and Inclusion:</b> We are one team and it is simply the right thing to do!\n<br>Learn more about our benefits at State Farm Careers!\n<br><br>\n*****Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity*****</div><div></div>",
        "index": 9,
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "scala",
            "python",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "Exact Sciences Corporation - 3.1",
        "location": {
            "city": "Madison",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:36:12.373Z",
        "url": "https://www.simplyhired.com/job/Hh10sZzBCXW5nVRu6_CzajNUlG5sFD1MBWEd3SQKnyF4qRfqPD8vhw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:08.789Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Summary of Major Responsibilities:</b><br>\nThrough hands-on experience as well as observational and mentorship activities, the Software Engineering Intern will have the opportunity to learn about several aspects of Software Engineering, Biotechnology and working in a real business environment.\n<br><br>\nPrimary responsibilities will be to work with full-time engineers in further development of and support for our in-house applications.\n<br><br>\n<b>Essential Duties and Responsibilities:</b><br>\nDesign and develop software.\n<br>Test software applications and systems.\n<br>Apply knowledge of computing systems and software structure.\n<br>Analyze users' needs.\n<br>Create flowcharts, diagrams, and other documentation.\n<br>Construct, deploy, and maintain general computer applications software or specialized utility programs.\n<br>Use programming languages such as Java, JavaScript, Python, SQL, PSQL, .NET.\n<br>Design and implement system security and data assurance.\n<br>Identify and explain needed changes.\n<br>Ensure security across systems being configured.\n<br>Able to organize and maintain flexibility.\n<br>Design Research &amp; Development (R&amp;D) prototyping.\n<br>Work collaboratively with software testers.\n<br>Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork.\n<br>Support and comply with the company’s Quality Management System policies and procedures.\n<br>Regular and reliable attendance.\n<br>Ability to work designated schedule.\n<br><br>\n#LI-AM1\n<br><br>\n<b>Qualifications:</b><br>\nMinimum Requirements\n<br><br>\nActively pursuing educational advancement in Computer Science or Software Engineering through a secondary or post-secondary institution, in junior or senior standing.\n<br>Authorization to work in the United States without sponsorship.\n<br>Demonstrated ability to perform the Essential Duties of the position with or without accommodation.\n<br><br>\nPreferred Requirements\n<br><br>\nProgramming experience in Java, Python, Linux, Javascript, and HTML/CSS.\n<br>Knowledge of web development and web application frameworks.\n<br>GPA of 3.5 or higher.\n<br><br>\n<b>EEO Disclosure:</b><br>\nWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program are available to any applicant or employee for inspection upon request.</div><div></div>",
        "index": 10,
        "skills": [
            "software engineering",
            "sql",
            "javascript",
            "java",
            "python",
            "machine learning",
            "project management",
            "web development"
        ],
        "remote": false
    },
    {
        "position": "Employee Experience Intern - IT",
        "company": "Thermo Fisher Scientific - 3.5",
        "location": {
            "city": "Pittsburgh",
            "state": "Pennsylvania"
        },
        "posted": "2021-09-23T18:36:16.341Z",
        "url": "https://www.simplyhired.com/job/pBHP2W4xx4OQRA3lZpZuqqdd5KG_jggiD2y09jircoLmeTE29XjL_w?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:12.743Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The Employee Experience Internship position provides an opportunity for students who are currently pursuing a computer science degree, to get hands on experience working with skilled support engineers and infrastructure specialists in a support environment. The intern will contribute to various hands on projects across the North America region and help to manage resource allocations, prioritization of initiatives, progress reports and project planning meetings. The position starts in June, paid working 40 hours per week through August. Opportunity exists for this position to continue through the academic year on a part-time basis to allow for class schedules.\n<br><br>\nEssential Functions\n<br><br>\n<ul><li>Support a variety of infrastructure and support initiatives across various sites</li><li>Help to coordinate onsite visits to execute local projects</li><li>Help facilitate meetings with the internal teams and business partners</li><li>Learn about operational IT support with a large focus on Employee Experience through daily activities</li><li>Accept candid feedback and look for areas of improvements</li><li>Specific tasks will be tailored to the intern’s experience level and abilities</li><li>An Employee Experience intern works under the close supervision of North America Employee Experience Director, regional support managers, project managers, and IT technicians</li></ul>\nSkills and Abilities\n<br><br>\n<ul><li>Ability to work independently and as a member of a cross-functional team</li><li>Ability to learn, be mentored, and improve</li><li>Desire to contribute and improve current processes</li><li>Exceptional customer focus</li><li>Desire to coordinate tasks across multiple geographic teams</li></ul>\nQualifications\n<br><br>\n<ul><li>Minimum 3.5 GPA preferred</li></ul>\nTo qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status.</div><div></div>",
        "index": 11,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-05-31T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Information Security Intern",
        "company": "Exact Sciences Corporation - 3.1",
        "location": {
            "city": "Madison",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:36:22.988Z",
        "url": "https://www.simplyhired.com/job/S6gqShVDjzwctJfmHNmmblwaL4LmmK26pp5mD_tMSaTMTCJKUJkQsA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:19.510Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Summary of Major Responsibilities:</b><br>\nThrough hands-on experience as well as observational and mentorship activities, the IT Intern will have the opportunity to learn about several aspects of Information Security and working in a real business environment.\n<br><br>\nPrimary responsibilities will be involved with day-to-day security operations, including access audits, role validation, response to security events, and general monitoring of security tools. This role will also help monitor compliance with all security policies and standards as well as with applicable regulations and laws.\n<br><br>\n<b>Essential Duties and Responsibilities:</b><br>\nEvaluation and remediation of customer-initiated incident tickets on information security topics (reported phishing e-mails, blocked web sites, etc.).\n<br>User account administration (Provisioning / de-provisioning, account permissions &amp; auditing in a Microsoft Active Directory integrated environment).\n<br>Assisting fellow employees with the installation and use of a variety of information security-related applications.\n<br>Assistance in the development of documentation, user guides, FAQs and presentation materials related to information security topics and tools.\n<br>Act as a problem solver to drive successful completion of assigned tasks.\n<br>Establish positive working relationships with team members, vendors and IT customers.\n<br>Friendly and positive demeanor with a desire to demonstrate the high standards of customer service.\n<br>Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork.\n<br>Support and comply with the company’s Quality Management System policies and procedures.\n<br>Regular and reliable attendance.\n<br>May be required to lift 10lbs on an infrequent basis up to 20% of the time.\n<br>Ability to use computers daily in an interactive manner for extended periods of time and up to 8 hours per day.\n<br>Ability to travel between facilities in the metropolitan area as needed.\n<br>Ability to frequently and accurately communicate with employees, customers, and vendors in person, via the telephone or by email.\n<br><br>\n<b>Qualifications:</b><br>\nMinimum Requirements\n<br><br>\nEnrollment towards a degree in information technology or information security.\n<br>Preference given to candidates with a record of outstanding academic achievement.\n<br>Appetite to learn; general business acumen.\n<br><br>\nPreferred Requirements\n<br><br>\nDemonstrated aptitude for technology and an interest in pursuing a career in information technology and information security/cybersecurity.\n<br><br>\n<b>EEO Disclosure:</b><br>\nWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program are available to any applicant or employee for inspection upon request.</div><div></div>",
        "index": 12,
        "skills": [
            "information technology",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "IT Engineer Internship",
        "company": "PetSmart - 3.5",
        "location": {
            "city": "Phoenix",
            "state": "Arizona"
        },
        "posted": "2021-09-23T18:36:26.990Z",
        "url": "https://www.simplyhired.com/job/boCQE2NGm13OPh1TvTLuM8xgRItknH1LrFK7GUAczFk0U45yjDeKSA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:23.378Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">About the Team\n<br><br>\nAre you looking for a fun and rewarding summer internship? At PetSmart, we are committed to developing future business leaders. Join our Information Technology team this summer as an IT Engineer Intern and thrive in a collaborative culture where being the trusted partner to parents and pets in every moment of their lives is priority number one.\n<br><br>\nAbout the Job\n<br><br>\nWHAT WILL YOU DO?\n<br><br>\nExperience the IT Engineer function of the leading pet specialty retailer firsthand as you work with a team of Software Engineers, front-end developers, and back-end developers to create custom apps that deliver a first-class experience to pet parents. Opportunities range from development, web applications, project management, and information security.\n<br>Leave your “paw” print with a project designed to make a true impact on the business.\n<br>Present your recommendations and innovative ideas to PetSmart leaders.\n<br>Develop and grow your skills with the support of a caring manager and dedicated mentor.\n<br><br>\nWHAT WILL YOU NEED?\n<br><br>\nSophomore or Junior status (Dec 2022, May/Dec 2023, or May 2024 graduation)\n<br>Interest in web services or micro services development using RESTful APIs.\n<br>Interest in REACT front end and UI web development to integrate into these APIs.\n<br>Knowledge in React, Java script, or .net.\n<br>Solid critical thinking ability; analytical skills are highly utilized in this role.\n<br>Excellent written and verbal communication.\n<br>Must be able to produce work in a collaborative, team environment.\n<br><br>\nMAYBE YOUR MAJOR IS\n<br><br>\nComputer Science\n<br>Computer Engineering\n<br>Software Engineering\n<br><br>\nAbout the Culture\n<br><br>\nWHAT'S IN IT FOR YOU?\n<br><br>\n10 week paid summer internship\n<br>Develop and grow your skills with the support of a caring manager and dedicated mentor\n<br>Pet friendly environment, bring your pets to work!\n<br>“Top Dog” gym with equipment, fitness classes, massage therapists and personal trainers*\n<br>“Sit &amp; Stay” Café serving fresh breakfast and lunch options*\n<br>Make a difference! Volunteer with your fellow interns during the annual “PetSmart Interns Give Back” day\n<br><br>\n<ul><li>Please note: On-Campus Amenities are currently limited and/or closed due to Covid-19.</li></ul>\n</div><div></div>",
        "index": 13,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "react"
        ],
        "compensation": "paid",
        "due": "2022-11-30T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "IT Analyst Internship",
        "company": "PetSmart - 3.5",
        "location": {
            "city": "Phoenix",
            "state": "Arizona"
        },
        "posted": "2021-09-23T18:36:31.155Z",
        "url": "https://www.simplyhired.com/job/y4EyvpMClDPqmWTGTZxWGmgwzTB9JqC-rN10ZRPPPNd8JE3KklGlJw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:27.386Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">About the Team\n<br><br>\nAre you looking for a fun and rewarding summer internship? At PetSmart, we are committed to developing future business leaders. Join our Information Technology team this summer as an IT Analyst Intern and\n<br><br>\nthrive in a collaborative culture where being the trusted partner to parents and pets in every moment of their lives is priority number one.\n<br><br>\nAbout the Job\n<br><br>\nWHAT WILL YOU DO?\n<br><br>\nExperience the IT function of the leading pet specialty retailer firsthand as you work with a team of Analysts to work on business process modeling, Data mining, QA testing, process analysis, and other efficiencies.\n<br>Leave your “paw” print with a project designed to make a true impact on the business.\n<br>Present your recommendations and innovative ideas to PetSmart leaders.\n<br>Develop and grow your skills with the support of a caring manager and dedicated mentor.\n<br><br>\nWHAT WILL YOU NEED?\n<br><br>\nSophomore or Junior status (Dec 2022, May/Dec 2023, or May 2024 graduation)\n<br>Knowledge of business process modeling required.\n<br>Knowledge of process analysis and process efficiencies preferred.\n<br>SQL, JAVA, Python, HTML, etc... read and understand some coding languages.\n<br>Solid critical thinking ability; analytical skills are highly utilized in this role.\n<br>Excellent written and verbal communication.\n<br>Must be able to produce work in a collaborative, team environment.\n<br><br>\nMAYBE YOUR MAJOR IS\n<br><br>\nComputer Science\n<br>Information Systems\n<br>Computer Engineering\n<br><br>\nAbout the Culture\n<br><br>\nWHAT'S IN IT FOR YOU?\n<br><br>\n10 week paid summer internship\n<br>Develop and grow your skills with the support of a caring manager and dedicated mentor\n<br>Pet friendly environment, bring your pets to work!\n<br>“Top Dog” gym with equipment, fitness classes, massage therapists and personal trainers*\n<br>“Sit &amp; Stay” Café serving fresh breakfast and lunch options*\n<br>Make a difference! Volunteer with your fellow interns during the annual “PetSmart Interns Give Back” day\n<br><br>\n<ul><li>Please note: On-Campus Amenities are currently limited and/or closed due to Covid-19.</li></ul>\n</div><div></div>",
        "index": 14,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "java",
            "python",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Systems Engineering Intern (Camden, NJ)",
        "company": "L3Harris Technologies - 3.7",
        "location": {
            "city": "Camden",
            "state": "New Jersey"
        },
        "posted": "2021-09-23T18:36:35.188Z",
        "url": "https://www.simplyhired.com/job/0RTSUClPFxsjZPDulfU5bIH00Zx7RwpqfmTlXBXE9qY3SuC7jGnQPw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:31.552Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Description:</b><br>\n<b>Job Description:</b><br>\nPerform operational analysis and develop concept of operations, design and implementation plans\n<br>Develop test plans, procedures &amp; cases\n<br>Conduct tests and document results\n<br>Use software tools, scripting and software/hardware troubleshooting\n<br>Analyze systems requirements from end systems and users\n<br>Supports development and evaluation of complex system designs and architectures\n<br>Develop and deliver presentations to communicate design activity plans and status to internal and external customers\n<br><br>\n<b>Qualifications:</b><br>\nPursuing a Bachelor’s degree in Systems Engineering, Electrical Engineering, Mechanical Engineering, Computer Engineering, Computer Science, Physics, Mathematics, Aviation, Aerospace Engineering, or related field\n<br>GPA of 3.0 or greater\n<br><br>\n<b>Preferred Skills:</b><br>\nCoursework and/or experience in systems engineering, systems architecture, systems analysis and design, system performance modeling, integration and/or project management, and/or model-based systems engineering\n<br>Familiar with Rhapsody</div><div></div>",
        "index": 15,
        "skills": [
            "project management",
            "software engineering",
            "hardware"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Supply Chain, Data, & Logistics Intern, Chartwells Higher Ed",
        "company": "Chartwells Higher Education - 3.5",
        "location": {
            "city": "San Luis Obispo",
            "state": "California"
        },
        "posted": "2021-09-23T18:36:39.120Z",
        "url": "https://www.simplyhired.com/job/LkKmNv7kkM6G2UG5luhzQ0u00-_xjd0xxtJrWolayIg2oGwfX_EChA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:35.548Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Posted Date:</b> Sep 22, 2021\n<br><br>\nWe are hiring immediately for a Supply Chain, Data, &amp; Logistics Intern position.\n<br><b>Location:</b> Role will ideally be located on one of Chartwells' campuses near you, but will be determined upon finding the right candidate. Note: online applications accepted only.\n<br><b>Schedule:</b> Flexible hours to be determined around class schedule; more details upon interview.\n<br><b>Requirement:</b> Supply Chain/Logistics, and/or Agricultural Data Science major/minor preferred\n<br><br>\nAt colleges and universities around the country, Chartwells Higher Education is re-inventing the on-campus dining experience. We are challenging the norm and setting new standards by investing in high-tech, food-infused social spaces that bring people together to promote meaningful relationships and interactions. We are food-forward difference makers, bound together by a desire to feed hungry minds and prepare students for success.\n<br><br>\nWith over 300 campuses around the country, we are seeking hungry, humble and smart associates who are looking to join and grow with a diverse organization. We invite you to start your career journey with us and look forward to hearing from you.\n<br><br>\n<b>General Description:</b><br>\nYou will be working closely with the leaders in Chartwells Higher Ed Central Support Team, Campus Operations and upstream suppliers. Building and sharing skills and competencies to help lead accuracy of our data mapping, supplier resources and supply chain system. You will gain exposure to real data sets, real-world supply chain scenarios, demand planning, emergency response coordination and other special projects to support process improvement within our organization. You will also gain exposure to analyzing raw data, and bring creativity to the way we want to look at our information and positively impact our strategic initiatives.\n<br><br>\n<b>The Requirements:</b><br>\n<ul><li>Sophomore or Junior majoring in Supply Chain, Agriculture, Logistics, Mathematics, Computer Science, Data Analytics, Statistics or related field with an interest in supply chain</li><li>Highly proficient in Excel and data analytics</li><li>Strong organizational skills and attention to detail</li><li>Creative and entrepreneurial spirit</li><li>Articulate</li><li>Good to better interpersonal skills</li><li>General interest and knowledge</li></ul>\n<b>Job Responsibilities (May include any or all):</b><br>\n<ul><li>Executing operational standards</li><li>Financials, P+L, Loss Prevention</li><li>Supplier and vendor partner relations</li><li>Operational support of serving platforms</li><li>Inventory management</li></ul>\n<b>Benefits:</b><br>\n<ul><li>Opportunity to be part of an innovative and collaborative intern experience</li><li>Meet and engage with senior leaders within the organization and expand your network</li><li>Competitive hourly rate</li><li>Acquire hands-on data analytics experience that cannot be taught in a classroom</li><li>Gain invaluable corporate work experience</li><li>Professional development workshops and leadership sessions</li><li>Broaden career experience via job shadowing key team members</li></ul>\n<b>Learning Objectives:</b><br>\n<ul><li>Demonstrate awareness, understanding and skills necessary to work in a diverse environment.</li><li>Experience opportunities to learn, observe, and practice a variety of experiences in the world of hospitality.</li></ul>\nWe Make Applying Easy! Want to apply to this job via text messaging? Text JOB to 75000 and search requisition ID number 892910.\n<br><br>\nThe advertised program is an AI recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions: http://olivia.paradox.ai/moSkg\n<br><br>\nOur Commitment to Diversity and Inclusion\n<br>Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.\n<br><br>\nQualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. *Los Angeles applicants: Compass Group will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box ordinance).\n<br><br>\n<b>Req ID:</b>892910\n<br><br>\nChartwells HE</div><div></div>",
        "index": 16,
        "skills": [
            "project management",
            "networks",
            "machine learning",
            "information technology",
            "artificial intelligence"
        ],
        "remote": false
    },
    {
        "position": "Data Science Intern",
        "company": "ServiceNow - 3.6",
        "location": {
            "city": "Santa Clara",
            "state": "California"
        },
        "posted": "2021-09-23T18:36:43.138Z",
        "url": "https://www.simplyhired.com/job/2CyNxPipT4q1G_JO7byGlgOzVel30tLF6FkvoZqDSN36rR6ISqHGjg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:39.487Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.®\n<br><br>\nWe’re looking for people who are ready to jump right in and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better.\n<br><br>\nLearn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.\n<br><br>\nJob Description\n<br><br>\nGain experience in one of the hottest intersections of the job market: Data Science and Cloud-based software.\n<br><br>\nObtain profile data, construct models, explain results, incorporate feedback, and more.\n<br><br>\nLearn and apply appropriate data science techniques to solve business problems.\n<br><br>\nLead and/or support key analytics projects\n<br><br>\nIntegrate large and diverse data sets together\n<br><br>\nCommunicating findings to business partners to support recurring business challenges.\n<br><br>\nQualifications\n<br><br>\nActively enrolled in an accredited university and pursuing a Masters degree in Computer Science, Analytics, Data Science, Statistics, Math, or related field\n<br><br>\nYou have experience in pre-processing data in preparation for Machine Learning analyses.\n<br><br>\n<b>You have skills in more than one of the following methods:</b> regression, decision trees / random forests, Bayesian methods, neural networks, support vector machines, k-nearest neighbor, HMM, recommendation engines, impact/driver analyses, or optimizations.\n<br><br>\nYou know how to compare predictive models for accuracy.\n<br><br>\nAdditional Information\n<br><br>\nServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.\n<br><br>\nIf you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at [email protected] for assistance.\n<br><br>\nFor positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.\n<br><br>\n<b>Please Note:</b> Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.</div><div></div>",
        "index": 17,
        "skills": [
            "data science",
            "machine learning",
            "software engineering",
            "networks",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, Backend",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Oakland",
            "state": "California"
        },
        "posted": "2021-09-23T18:36:47.389Z",
        "url": "https://www.simplyhired.com/job/GN0dZ-rKPR1mV8u11Bcplis8Ry_8_KVT4GzRz7u6_kJQ-jxC7FBBLg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:43.522Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Atlanta, GA/New York, NY/Oakland, CA\n<br><br>\n<b>Position Summary:</b><br>\nOur engineers get to solve cool problems for more than 100 million users, using big data. We have an opportunity for a talented, enthusiastic software engineering intern to participate on our team and develop high-quality software for the SiriusXM + Pandora music service as we bring it to our large and growing community of listeners. You will be a significant contributor on a hard-working team, and take pride in your work. We have high expectations, and are looking for very knowledgeable and capable interns with solid software development skills. This position is designed to provide you with an opportunity to learn and gain experience crafting solutions to \"real world\" challenges.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nContribute in one or more areas of development, ranging from web UI, iOS Android mobile, music recommendation systems, backend scaling, internal tools, creator tools, user analytics and data science applications and services.\n<br>Perform other duties as required.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor's degree or higher in computer science, data science, or a related field.\n<br>Previous experience in software development and/or machine learning - work projects, internships, summer jobs, etc. preferred.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nBe enthusiastic about learning new technologies and skills.\n<br>Interest in how companies use data to deliver fantastic experience to our users.\n<br>Must be capable of managing time well and working collaboratively.\n<br>Excellent communication skills, both written and verbal, are required.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nExperience developing object-oriented code or functional programming language - Java, Javascript, Python, Scala, C++, Linux, Django, Elixir, Git or NodeJS.\n<br>Experience with analytics, SQL databases, big data storage platforms and/or machine learning a plus.\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 18,
        "skills": [
            "project management",
            "machine learning",
            "software engineering",
            "sql",
            "javascript",
            "java",
            "scala"
        ],
        "compensation": "paid",
        "due": "2023-04-30T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern/Associate Engineer — Ground Software Engineer (Spring/Summer 2022)",
        "company": "Astranis -",
        "location": {
            "city": "San Francisco",
            "state": "California"
        },
        "posted": "2021-09-23T18:36:51.488Z",
        "url": "https://www.simplyhired.com/job/mHMK8t2KyUTApznXftHyFnxj3VTfZo6nddPbptoVgFxDfrmvmyco1g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:47.782Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Astranis is connecting the four billion people in the world who do not currently have access to the internet. We are building the next generation of smaller, lower-cost spacecraft to bring the world online.\n<br><br>\nWe are well-funded by some of the best investors in the business and have raised over $350 million to date. We are have a world-class team that is passionate about building amazing technology. And we have a fun and collaborative work environment where you will learn a lot and make a huge impact no matter where you are in your career. Just check out our Glassdoor reviews to see what our team has to say about working at Astranis.\n<br><br>\nOur team is growing fast. Apply to be a part of our mission to connect the world!\n<br><br>\n<b>Role:</b><br>\nWork with the engineering team to design, build, and implement our ground software system for GEOSat-1\n<br>Collaborate with our operations and satellite teams to build command interfaces and telemetry screens that command and control our satellite through its mission\n<br>This position is for January 2022 - August 2022 time frame\n<br><br>\n<b>Requirements:</b><br>\nCurrently pursuing a B.S. or M.S. in Computer Science or equivalent technical degree\n<br><b>Object-oriented:</b> Python\n<br><b>Frontend:</b> JavaScript (React, Angular, etc.)\n<br><b>Database:</b> SQL, NoSQL\n<br>Demonstrated ability to design, write, and test software from scratch\n<br>Don't meet them all? Not a problem. Please apply even if you do not meet all these criteria.\n<br><br>\n<b>Bonus:</b><br>\nExperience with real time operating systems\n<br>Experience with tools like Docker and load balancers for cloud resource provisioning, deployment, and management\n<br><br>\nU.S. Citizenship, Lawful Permanent Residency, or Refugee/Asylee Status Required\n<br>(To comply with U.S. Government space technology export regulations, applicant must be a U.S. citizen, lawful permanent resident of the United States, or other protected individual as defined by 8 U.S.C. 1324b(a)(3))\n<br><br>\nOur mission and our products are meant to connect the world and everyone in it, regardless of gender, race, creed, or any other distinction. We believe in a diverse and inclusive workplace, and we encourage all people to join our team and bring their unique perspective to help make us stronger.</div><div></div>",
        "index": 19,
        "skills": [
            "software engineering",
            "sql",
            "javascript",
            "angular",
            "c and c++",
            "machine learning",
            "project management",
            "python",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern Scientist, Content Science",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Boulder",
            "state": "Colorado"
        },
        "posted": "2021-09-23T18:36:55.471Z",
        "url": "https://www.simplyhired.com/job/NUbId9B2YXrp_dwYQLfuPjKygICWqTewP9Wb7ZaSb0HoXmhlanZr4g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:51.871Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Oakland, CA/New York, NY/Atlanta, GA/Lawrenceville, NJ/Boulder, CO/Remote\n<br><br>\n<b>Position Summary:</b><br>\nAs a content science intern, you will be building products and services to identify, organize, and recommend music and non-music content to hundreds of millions of Pandora and SiriusXM listeners at scale. You will join a team of scientists with diverse expertise in machine learning, natural language understanding, information retrieval, and recommendation systems.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nConduct research to solve a broad set of machine learning problems ranging from enhancing content understanding of our music and talk content through advanced NLP/NLU techniques to powering our next generation of personalization services using state-of-the-art recommendation and ranking techniques.\n<br>Perform other duties as required.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internship is open to current students enrolled in a PhD degree (those graduating by May 2023/2024 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Majors in computer science, machine learning, statistics or a related quantitative field preferred.\n<br>Expertise in natural language processing, recommendation systems, and/or deep learning techniques.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nExcellent communication skills with both technical and non-technical audiences.\n<br>Experience with the Hadoop technology stack.\n<br>Publications at machine learning conferences/journals.\n<br>Expertise in machine learning and statistics, solid programming skills, outstanding communication skills, and ability to work in a team with a diverse skill set.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nFamiliarity with common machine learning libraries (e.g., sk-learn, TensorFlow).\n<br>Proficiency with Python or Java.\n<br>Experience with Spark and Scala.\n<br>Experience with SQL (or proprietary equivalent).\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 20,
        "skills": [
            "machine learning",
            "information technology",
            "sql",
            "java",
            "scala",
            "python"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern - Data Science (Summer '22 Start)",
        "company": "MedPro Group - 3.3",
        "location": {
            "city": "Fort Wayne",
            "state": "Indiana"
        },
        "posted": "2021-09-23T18:36:59.521Z",
        "url": "https://www.simplyhired.com/job/uQ-EKDUgxJFQE8G9t7eu62sEj6h-5KQmpCWHmnPqENpSmHKPyCd23g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:55.867Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This is a paid internship starting in Summer 2022.\n<br><br>\nMeet MedPro Group. We’re an industry-leading Berkshire Hathaway insurance company with a passion for our clients and our team. We are hundreds of professionals with varied backgrounds and experience levels who came together to achieve one goal: protecting those who have made it their mission to serve and care for others. Never considered the insurance industry before? We think you should.\n<br><br>\nIn this role you will…\n<br><br>\nPerform hands on work on a concrete project that effects the overall business\n<br>Determine which data is helpful for determining the drivers of profit, loss, demand, and other quantities of interest\n<br>Help to design, test, and implement programs using AI, Predictive Modeling, and Machine Learning.\n<br>Participate in gathering, reviewing, analyzing, and evaluating stakeholder needs. This work will culminate in a presentation to the stakeholders.\n<br>Be expected to function as an extension of the Data Scientists in their experiment design, learning and helping where most needed.\n<br>Perform other duties as assigned.\n<br><br>\nWe are looking for candidates with…\n<br><br>\nActive pursuit of graduate degree or exceptional undergraduate ability in Data Science, Actuarial Science, Statistics, Computer Science, Mathematics or related degree.\n<br>Minimum 3.0 GPA.\n<br><b>Mandatory technical skills:</b> Microsoft Suite with some programming experience. Preferred technical skills: Python, Java, SAS, R, C++.\n<br>Outstanding interpersonal, oral, and written communication skills.\n<br>Proven ability to work on a team or operate independently and prioritize job duties.\n<br>Authorization to work in the United States without requiring visa sponsorship, both now and in the future.\n<br><br>\nWhy MedPro?\n<br><br>\nMedPro Group’s mission is built on a century-old legacy of protecting those who protect others. From our roots in our hometown of Fort Wayne, Indiana, we've worked diligently to become the nation's premier healthcare liability coverage provider, currently insuring more than 300,000 customers. With that growth, we've built a significant presence in all 50 states. Our team works across the country to provide the best strategies to mitigate risk and preserve the reputations of those who have entrusted their good name to us. That passion – built on a foundation of a culture that values uncompromised integrity, obsessive client focus, great teamwork, and a long-term mindset – make MedPro a preferred employer that many call their career home.\n<br><br>\n<b>General:</b><br>\nMedPro Group is an Equal Opportunity Employer.</div><div></div>",
        "index": 21,
        "skills": [
            "data science",
            "machine learning",
            "java",
            "python",
            "c and c++",
            "project management",
            "artificial intelligence"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Product Manager MBA Intern - Gaming",
        "company": "NVIDIA - 4.2",
        "location": {
            "city": "Santa Clara",
            "state": "California"
        },
        "posted": "2021-09-23T18:37:03.520Z",
        "url": "https://www.simplyhired.com/job/qcN63WYfOxBR4UqaLHb8Zq4-oPfBA39t5K2Nlk3nAozea-PsGCSG_w?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:36:59.902Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Our GeForce division builds industry leading hardware and software for high-end gaming and content creation. We are now looking for a Product Management Intern for our GeForce division. As a Product Manager Intern, you will help define new products and technologies that drive growth for our GeForce business. You will conduct market research, understand use cases and workflows, define hardware and software features and roadmaps, develop strategy, devise marketing positioning, and help take products to market. The successful candidate will have a strong passion for gaming and/or content creation, broad knowledge of technology, and good sensibility for building products that delight.\n<br><br>\nIn this role, you will work in NVIDIA's GeForce Laptop Product Team along with other PMs. Our team’s charter is to help define, position, and launch the best laptop products in the fastest growing category of the gaming market. You'll join an outstanding team of colleagues who are the driving force behind NVIDIA GeForce, that crafts and builds some of the most critically acclaimed gaming products available anywhere in the world.\n<br><br>\n<b>What you’ll be doing:</b><br>\nDefine hardware and software product requirements and roadmap priorities for next generation laptops.\n<br><br>\nDevelop product strategy, go-to-market plans, and subject matter expertise on GeForce laptop use cases.\n<br><br>\nCreate product positioning, presentations, and sales tools.\n<br><br>\nDevelop partnerships, tools, and programs needed to support and engage the gaming ecosystem.\n<br><br>\nConduct competitive and market analysis.\n<br><br>\n<b>What we need to see:</b><br>\nEnrolled in an MBA program\n<br><br>\nPassion for gaming and hardware technology.\n<br><br>\nAbility to multi-task and manage complex programs.\n<br><br>\nExcellent communication, leadership, and presentation abilities.\n<br><br>\n<b>Ways to stand out from the crowd:</b><br>\nBackground in engineering or computer science.\n<br><br>\nStrong data analysis and programming skills\n<br><br>\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.</div><div></div>",
        "index": 22,
        "skills": [
            "software engineering",
            "project management",
            "hardware",
            "game design",
            "robotics",
            "machine learning",
            "information technology",
            "artificial intelligence"
        ],
        "remote": false
    },
    {
        "position": "Intern Data Science (Summer 2022)",
        "company": "The Hershey Company - 3.8",
        "location": {
            "city": "Hershey",
            "state": "Pennsylvania"
        },
        "posted": "2021-09-23T18:37:10.269Z",
        "url": "https://www.simplyhired.com/job/FVqTFaXkoC2uaSOm7yh2ABXSkX7z0bWtvkAvmijmRlZoghBe-qVjWQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:06.837Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Location:</b> Hershey, PA\n<br><br>\nWHY HERSHEY?\n<br><br>\nThe Hershey Company is a global fortune 500 company that is a recognized leader in the Consumer Packaged Goods industry. Our goal is to integrate students with our knowledgeable and successful teams in order to maintain a fresh perspective on an ever-changing world. Every day presents new challenges and opportunities to learn, grow and innovate. Are you up for the challenge? Are you ready to make a difference?\n<br><br>\nWHY INFORMATION SERVICES AT HERSHEY?\n<br><br>\nThe Information Services department at The Hershey Company has open internships for analytically minded, tech-savvy undergraduate and graduate students. Technology and analytics are elemental to all aspects of Hershey business. Hershey has a diverse global team focused on providing robust innovative capabilities, partnering on analysis to drive successful business outcomes and embraces an entrepreneurial mindset to create an environment that is exciting, compelling, innovative and dynamic.\n<br><br>\n<b>OPPORTUNITIES:</b><br>\nWe are looking for a Data Science Intern who will work with the Enterprise Data Science to build strong analytic capabilities. Applicants must have some exposure to at least two of the following: machine learning, statistical modeling, feature engineering, optimization, exploratory data analysis, data mining and pattern recognition.\n<br><br>\n<b>RESPONSIBILITIES:</b><br>\nUse machine learning, and advanced statistical techniques to create scalable solutions to business problems\n<br>Collaborate with the Enterprise Data Science team to define and quantify business problems, and help them implement appropriate algorithmic solutions\n<br>Proactively identify capabilities which should be improved\n<br>Partner with Information Services and business stakeholders to drive conversion\n<br><br>\n<b>QUALIFICATIONS:</b><br>\nExperience machine learning tools (e.g., Scikit-learn, Keras, TensorFlow, Pandas, NumPy)\n<br>Experience with Python, R and Jupyter\n<br>Passion for analytical problem solving\n<br>Quick learner through formal and self-guided education\n<br>Pro-active self-starter with a desire to make an impact\n<br>Ability to work in teams or individually\n<br>Excellent written and verbal communication skills for coordinating across teams\n<br>Exposure to analytical solutions in the cloud (e.g., Azure, AWS, or GCP) a plus\n<br><br>\n<b>EDUCATION:</b><br>\nGPA of 3.5 or higher preferred\n<br>Bachelor’s degree with quantitative, STEM focus (e.g. Business, Computer Science, Engineering, Economics, Mathematics, Statistics, Psychology - other degrees will be considered). Graduate degrees with an analytical focus considered too.\n<br><br>\nThe Hershey Company is an Equal Opportunity Employer. The policy of The Hershey Company is to extend opportunities to qualified applicants and employees on an equal basis regardless of an individual's race, color, gender, age, national origin, religion, citizenship status, marital status, sexual orientation, gender identity, transgender status, physical or mental disability, protected veteran status, genetic information, pregnancy, or any other categories protected by applicable federal, state or local laws.\n<br><br>\nThe Hershey Company is an Equal Opportunity Employer - Minority/Female/Disabled/Protected Veterans\n<br><br>\nIf you require a reasonable accommodation as part of the application process, please contact the HR Service Center (askhr@hersheys.com).</div><div></div>",
        "index": 23,
        "skills": [
            "data science",
            "machine learning",
            "information technology",
            "python",
            "software engineering",
            "deep learning"
        ],
        "contact": "askhr@hersheys.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Developer Intern",
        "company": "WTS Paradigm - 2.8",
        "location": {
            "city": "Middleton",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:37:14.455Z",
        "url": "https://www.simplyhired.com/job/b72kx_8ZJ8KbHBSunbaHg1lRxgJK-C8y_mOuPKVlaSQ17TUxoK_wRg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:10.653Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>If opportunity doesn’t knock, build a door. - Milton Berle<br>Come build your door with us. It’s what we do here.<br>At Paradigm, we make world-class software and deliver high-quality professional services for the building products industry. Our success is tied directly to our customers’ success, so we do what it takes to make sure they’re successful. And we know that we couldn’t do it without our awesome employees.<br>We are currently seeking a <b>Software Developer Intern</b> to join our Montreal, Quebec office on <b>May 16</b><b>th</b>* 2022* for a 12-week internship.<br>You will work in a dynamic environment and work with a lot of bright people that have knowledge to share with you. We are looking for problem solver, creative thinker and most important fun developer because work needs to be fun to be appreciated!<br>What You Will Do:</p><ul><li>You will develop new features on a brand-new application</li><li>You will analyze and suggests solutions on actual issues</li><li>You will be an active member of an agile team</li><li>You will work with cutting edges technologies</li></ul><p>What You Need to Succeed:</p><ul><li>Pursuing a degree in Computer Science (or equivalent)</li><li>Good knowledge of Javascript (ReactJS), Java or C# is essential</li><li>You will need critical thinking, including creative development skills, requirements analysis capabilities, and proven problem-solving skills</li><li>You need to be dependable, organized and enjoy working in a changing/fast paced environment. We are Agile!</li></ul><p>Apply now at myparadigm.com/careers/</p><p>Job Type: Internship</p><p>Work Location: Multiple Locations</p></div><div></div>",
        "index": 24,
        "skills": [
            "javascript",
            "software engineering",
            "java",
            "c and c++",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Cloud Software Engineer Intern",
        "company": "Mercedes-Benz Research & Development North America, Inc. - 4.1",
        "location": {
            "city": "Sunnyvale",
            "state": "California"
        },
        "posted": "2021-09-23T18:37:18.489Z",
        "url": "https://www.simplyhired.com/job/ufPaYP9TI0-yV5wtfCxZnZB4I45PfiwrYzy8Mtnsfl5kabKiBUfd-w?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:14.834Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Embedded in a worldwide network Mercedes-Benz Research &amp; Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.\n<br><br>\nWe are looking for highly motivated and skilled engineering interns to help develop our strategic products in Experience AI Cloud team for next-generation Mercedes-Benz vehicles at our R&amp;D headquarters in Sunnyvale, CA. This role will work closely with our software development teams to define and implement software architectures on the latest automotive cloud platforms.\n<br><br>\nThe Cloud Software Engineer Intern will build Domains, Apps and Tools for the MBUX Voice Assistant (#HeyMercedes). The engineering intern will contribute, as part of a team, to parts of the software development lifecycle, including development of software prototypes, writing documentation and specifications, participating in software design and code reviews, developing software and product maintenance.\n<br><br>\n<b>Job Responsibilities:</b><br>\nEvaluate new features and system requirements by developing working prototypes.\n<br>Design, implement, and test reusable software components for cloud platforms.\n<br>Write software documentation and specifications, as necessary.\n<br>Integrate and test software in prototyping cars or demonstration hardware.\n<br>Participate in an Agile working model.\n<br>Effectively collaborate with other engineers, designers, user experience experts, and researchers.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nBachelor’s Degree in Software/Computer Engineering, Computer Science, or related field.\n<br>Software development experience with Node.js, RESTful API, MySQL, and/or NoSQL.\n<br>Basic understanding of operating systems and computer architecture fundamentals.\n<br>Ability to analyze complex problems, recognizes and explains connections between cause-and-effect understandably and develops concrete, viable solutions taking risks and obstacles into account.\n<br>Ability to manage competing project priorities and constraints.\n<br>Ability to analyze internal/external technology trends and developments. Active participation in collaborative opportunities to gain skills in new areas to support other team members.\n<br>Ability to work in inter-cultural, inter-disciplinary teams across multiple time zones.\n<br>Evaluate new features and system requirements by developing working prototypes.\n<br>Design, implement, and test reusable software components for cloud platforms.\n<br>Write software documentation and specifications, as necessary.\n<br>Integrate and test software in prototyping cars or demonstration hardware.\n<br>Debug and analyze the performance and system resource usage of software components.\n<br>Participate in an Agile working model together with development teams in various time zones.\n<br>Effectively collaborate with other engineers, designers, user experience experts, and researchers.\n<br>Valid California Driver License.\n<br><br>\n<b>Preferred Qualifications:</b><br>\nExperience in agile collaboration models (e.g. Scrum)\n<br>Experience in developing voice applications e.g. for Houndify, Cerence, Alexa and Google Assistant\n<br>Advanced coding skills in JavaScript, Go, Java\n<br>Why should you apply?\n<br><br>\nHere at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.\n<br><br>\nMBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.\n<br><br>\nMBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.\n<br><br>\nThank you for your interest in Mercedes-Benz Research &amp; Development North America. Please be aware the impact of COVID-19 could increase the amount of time it takes our HR and Hiring Team to process your application. We apologize for any inconvenience this may cause. We are dedicated to the health and safety of our employees and candidates. We appreciate your patience during this time.\n<br><br>\nMercedes-Benz Research and Development North America, Inc.\n<br><br>\nPRIVACY AGREEMENT FOR JOB APPLICANTS (Lever)\n<br><br>\nInformation on the processing and use of your data in the context of\n<br>submitting an application for employment.\n<br><br>\nThis Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.\n<br><br>\nThe Daimler Company and its affiliates that have advertised the vacancy is responsible for data processing. You will find the details in the job advertisement.\n<br><br>\nThe categories of data that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for special categories of personal data (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.\n<br><br>\nWe process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the purpose of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).\n<br><br>\nThe recipients of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software.\n<br><br>\n<b>As an applicant, you have the right:</b><br>\nTo request information from the company your personal data it has stored.\n<br>To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.\n<br>To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.\n<br>To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.\n<br>To complain to the company if you believe that the processing of your personal data violates the law.\n<br>The company limits the storage of your data to the period of time required by applicable law. Therefore, we regularly delete your personal data as follows:\n<br><br>\nThe application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months[MB1] .\n<br>You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.\n<br>Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.\n<br>The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.\n<br><br>\nA cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.\n<br>A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.\n<br><br>\nWe collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.\n<br><br>\nWe do not respond to browser \"do not track\" signals at this time.\n<br>If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship.\n<br><br>\nPRIVACY NOTICE FOR CALIFORNIA RESIDENTS\n<br><br>\nWhen you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:\n<br><br>\n<b>Category of Personal Information:</b><br>\nidentifiers\n<br><br>\n<b>Source(s):</b><br>\nDirectly from you\n<br><br>\n<b>Purpose(s):</b><br>\nDetermining eligibility for employment\n<br>Contacting you about future job opportunities\n<br><br>\n<b>Categories of Third Parties with Whom We Share:</b><br>\nThird party service providers who help us perform administrative employment services, such as background check providers.\n<br>Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.\n<br><br>\n<b>Category of Personal Information:</b><br>\nPersonal information categories listed in the California Customer Records statute (Cal. Civ. Code § 1798.80(e))\n<br><br>\n<b>Source(s):</b><br>\nDirectly from you\n<br><br>\n<b>Purpose(s):</b><br>\nDetermining eligibility for employment\n<br>Contacting you about future job opportunities\n<br><br>\n<b>Category of Personal Information:</b><br>\nThird party service providers who help us perform administrative employment services, such as background check providers.\n<br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.\n<br><br>\n<b>Category of Personal Information:</b><br>\nGeolocation data\n<br><br>\n<b>Source(s):</b><br>\nDirectly from you\n<br><br>\n<b>Purpose(s):</b><br>\nDetermining eligibility for employment\n<br>Contacting you about future job opportunities\n<br><br>\n<b>Categories of Third Parties with Whom We Share:</b><br>\nThird party service providers who help us perform administrative employment services, such as background check providers.\n<br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.\n<br><br>\n<b>Category of Personal Information:</b><br>\nProfessional or employment-related information\n<br><br>\n<b>Source(s):</b><br>\nDirectly from you\n<br><br>\n<b>Purpose(s):</b><br>\nDetermining eligibility for employment\n<br>Contacting you about future job opportunities\n<br><br>\n<b>Categories of Third Parties with Whom We Share:</b><br>\nThird party service providers who help us perform administrative employment services, such as background check providers.\n<br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.\n<br><br>\n<b>Access:</b> You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to ‘Privacy Agreement for Job Applicants (Lever)’ in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions.\n<br><br>\nChanges to our Privacy Agreement\n<br><br>\nOur business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.\n<br><br>\nThis Privacy Agreement is effective on January 1, 2020.</div><div></div>",
        "index": 25,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "cloud computing",
            "information technology",
            "javascript",
            "java",
            "hardware",
            "networks"
        ],
        "contact": "mbrdna@daimler.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Quality Assurance Intern",
        "company": "WTS Paradigm - 2.8",
        "location": {
            "city": "Middleton",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:37:22.503Z",
        "url": "https://www.simplyhired.com/job/pE2XYoSmA8p7YRxj6dEX39yJc_KPtTpKTpElDtwtbqELarbAdh33Cg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:18.892Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>If opportunity doesn’t knock, build a door. - Milton Berle<br>Come build your door with us. It’s what we do here.</p><p>At Paradigm, we make world-class software and deliver high-quality professional services for the building products industry. Our success is tied directly to our customers’ success, so we do what it takes to make sure they’re successful. And we know that we couldn’t do it without our awesome employees.<br>We are currently seeking a <b>Quality Assurance Intern</b> to join our Middleton, WI office on May 16th , 2022 for a 12-week internship, with the opportunity to be hired on full time!<br>We are seeking an intelligent, creative person to join our Software Development Team.<br><b>What You Will Do: </b></p><ul><li>You will have the opportunity to work across teams, products &amp; tech. You may work with products built in .NET, T-SQL, HTML, Visual Studio, CSS, C#, React, JQuery and the list goes on…</li><li>You will provide support to project testing on new development &amp; bug fixes.</li><li>You will help evaluate, identify, and define issues in the form of Jira &amp; user stories.</li><li>Author automated tests in JavaScript and other browser automation tools.</li></ul><p>What You Need to Succeed:</p><ul><li>An interest in using automated testing tools in addition to manual testing and writing test scripts</li><li>You need critical thinking, including creative development skills, requirements analysis capabilities, and proven problem-solving skills.</li><li>Basic JavaScript knowledge</li><li>Pursuing a degree in the Computer Science field</li><li>You need to be dependable, organized and enjoy working in a changing/fast paced environment. We are Agile!</li><li>You have the ability to take direction and work independently to creatively meet business objectives.</li><li>Must be enrolled in current college/university program.</li></ul><p>Apply now at myparadigm.com/careers/</p><p>Job Types: Full-time, Internship</p><p>Work Location: Multiple Locations</p></div><div></div>",
        "index": 26,
        "skills": [
            "sql",
            "javascript",
            "data visualization",
            "c and c++",
            "project management",
            "software engineering",
            "web development",
            "react"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "Marvell - 3.4",
        "location": {
            "city": "Santa Clara",
            "state": "California"
        },
        "posted": "2021-09-23T18:37:26.536Z",
        "url": "https://www.simplyhired.com/job/3O88nG7275DRQXOBwsFh7UMk0tYPfiX9TpXgzFRc_0RMmzZLlPHicA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:22.897Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">About Marvell\n<br><br>\nAt Marvell, we believe that infrastructure powers progress. That execution is as essential as innovation. That better collaboration builds better technology. Trusted by the world’s leading technology companies for 25 years, we move, store, process and secure the world’s data with semiconductor solutions designed for our customers’ current needs and future ambitions. Through a process of deep collaboration and transparency, we’re ultimately changing the way tomorrow’s enterprise, cloud, automotive, and carrier architectures transform—for the better.\n<br><br>\nThe data infrastructure that our customers build has never been more critical to our global economy. It’s what’s keeping the world connected, businesses running, and information flowing. If you’re ready to excel, innovate, and truly enjoy your work, apply now for the position detailed below.\n<br><br>\nThe Opportunity\n<br><br>\nBe part of a Marvell IP development team and participate in developing design flow, maintaining a web server. Write scripts to create design flow. Maintain and improve the web server to provide information sharing and documentation.\n<br><br>\n<b>Job Responsibilities:</b><br>\n<ul><li>Write Perl and Make scripts to implement design flow</li><li>Create automatic test cases to verify the design flow</li><li>Write PHP scripts to run on the web server</li><li>Improve the user experience of the web server</li></ul>\n<b>Requirements:</b><br>\nSophomore in undergraduate program at a 4-year accredited university pursuing a degree in Electrical Engineering or Computer Engineering. (MS preferred)\n<br><br>\nExcellent verbal and written communication skills\n<br><br>\nUnderstanding of analog, digital circuit, and VLSI design\n<br><br>\nUnderstanding of web site design\n<br><br>\nKnowledge of Perl, Make, PHP scripts with good problem solving skills\n<br><br>\nAbility to use scripts to implement a basic web page feature\n<br><br>\n0-1 years of previous experience\n<br><br>\nThe Perks\n<br><br>\nWith competitive compensation and great benefits, you will enjoy our workstyle within an incredible culture. We’ll give you all the tools you need to succeed so you can grow and develop with us. For additional information on what it’s like to work at Marvell, visit our Careers page.\n<br><br>\nYour Future\n<br><br>\nMarvell provides a work environment that promotes employee growth and development. We are searching for an individual who wants to grow with the company and will strive to improve performance. If you are driven, personable, and energetic, there will be additional opportunities for you here at Marvell.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.\n<br><br>\nAny applicant who requires a reasonable accommodation during the selection process should contact Marvell HR Helpdesk at GR-HR-Services-Americas@marvell.com or 408-222-3604.</div><div></div>",
        "index": 27,
        "skills": [
            "information technology",
            "software engineering",
            "cloud computing"
        ],
        "contact": "Americas@marvell.com, 408-222-3604",
        "remote": false
    },
    {
        "position": "Front End Developer Intern",
        "company": "WTS Paradigm - 2.8",
        "location": {
            "city": "Middleton",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:37:30.469Z",
        "url": "https://www.simplyhired.com/job/C6_IqsUbSvMYbeLx6gN3HnkGHoCoZOAYIhulwHdRXgn-1Q1KhIh0Yw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:26.918Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>If opportunity doesn’t knock, build a door. - Milton Berle<br>Come build your door with us. It’s what we do here.<br>At Paradigm, we make world-class software and deliver high-quality professional services for the building products industry. Our success is tied directly to our customers’ success, so we do what it takes to make sure they’re successful. And we know that we couldn’t do it without our awesome employees.<br>We are currently seeking a <b>Front End Software Developer Intern</b> to join our Middleton, WI on May 16th 2022 for a 12-week internship.<br>Our Software Development Team builds and supports a suite of applications. Our flagship product is now a web application hosted in Azure cloud ecosystems in a SaaS model. It uses a web front end built with React, HTML, and CSS, talking to back end APIs and services built in .NET. We're growing, learning, and experimenting with other technologies and techniques such as containerization.<br><b>What You Will Do: </b></p><ul><li>You will have the opportunity to work on a variety of teams &amp; projects, you will focus on enhancing and maintaining the code for the web front end.</li><li>You will collaborate on designs, to ensure that your projects will integrate with the back end, with a strong focus on the user experience.</li><li>You will get to see the big picture and understand the architecture.</li><li>This role is a good mixture of team brainstorming/work and individual work product.</li></ul><p><b>Position Requirements: </b></p><ul><li>Pursuing a Bachelor's degree in Computer Science (or equivalent).</li><li>You need to be involved in campus activities.</li><li>JavaScript or Typescript background</li><li>You will need critical thinking, including creative development skills, requirements analysis capabilities, and proven problem-solving skills.</li><li>You need to be dependable, organized and enjoy working in a changing/fast paced environment. We are Agile!</li></ul><p>Ready to Join? Apply now at myparadigm.com/careers/</p><p>Job Type: Internship</p><p>Work Location: Multiple Locations</p></div><div></div>",
        "index": 28,
        "skills": [
            "javascript",
            "machine learning",
            "project management",
            "information technology",
            "software engineering",
            "web development",
            "react"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Cyber Security Intern",
        "company": "Raytheon Missiles & Defense - 3.8",
        "location": {
            "city": "Tucson",
            "state": "Arizona"
        },
        "posted": "2021-09-23T18:37:34.506Z",
        "url": "https://www.simplyhired.com/job/Ni3KoDb4iufeNDVR6LwW9_lCemW96D-JhBkzt8Z2kluykfSpMVFrgg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:30.831Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This position is for an intern who will be entering their junior or higher year by the start of summer 2022.\n<br><br>\nAbout Us\n<br>At Raytheon Missiles &amp; Defense, by combining our vast resources and investments, we are able to dedicate ourselves to solving mission-level vs. product-level customer challenges – together we can anticipate more, move faster and make a bigger impact on the big picture.\n<br><br>\nJob Summary\n<br>Interns can expect to gain knowledge of a wide variety disciplines within a large Security organization. Assignment may include such disciplines as personnel clearances, classified information accountability, security auditing, classified information system control, physical security, etc. Tasks may include, but are not limited to, shadowing security employees to learn their duties and responsibilities by working with security officers, information assurance personnel, and employees throughout the organization. The position will involve working on special projects to improve overall security processes, some of which could cross between various security core competencies, as well as involve other functions or sites within Raytheon Missiles and Defense.\n<br><br>\n<b>Qualifications You Must Have:</b><br>\nMust be at least a junior by the start of summer 2022 and pursuing a bachelor or master’s degree majoring in Management Information Systems, Cyber Security, Intelligence, Computer Science, Network Administration, Information Technology or other closely related field.\n<br>US citizenship required as eligibility to obtain a secret clearance is necessary\n<br><br>\n<b>Qualifications We Value:</b><br>\n3.0 cumulative GPA desired\n<br>Knowledge in areas such as; Java, C++, Unix, Linux and Mac Operating Systems\n<br>Demonstrated ability to work with colleagues who represent a diversity of work and conflict resolution styles\n<br>Completion of 1 internship in a related field\n<br>Solution oriented to a variety of problems of minor scope and complexity\n<br>Critical thinking skills to ensure detailed status are provided\n<br>Strong written and verbal communication skills\n<br><br>\nThis position can be an intern based on the candidate's qualifications and standing as outlined below:\n<br>Junior Technical or Administrative Intern)- must have completed 60 credit hours of college by start of internship\n<br>Senior Technical or Administrative Intern- must have completed 90 credit hours of college by start of internship\n<br>Post-Graduate Technical or Administrative Intern- must have an undergraduate degree and be enrolled in a graduate degree program\n<br><br>\n<b>Location Information:</b><br>\nThis position is located in beautiful Tucson, AZ. Tucson has a friendly, caring and laid-back atmosphere, combined with the innovation and energy of a metropolitan region and recognized as one of America’s 10 Best Small Cities. Surrounded by beautiful mountains, colorful Sonoran Desert landscape and majestic saguaro cacti, Tucson is blessed with some of nature’s best work. Tucson is known for its bright blue skies, and with more than 310 sunny days per year, Tucson’s fantastic weather lets residents enjoy the outdoors year-round.)\n<br><br>\n<b>Clearance Information:</b><br>\nThis position requires the eligibility to obtain a security clearance. Non-US citizens may not be eligible to obtain a security clearance. The Defense Industrial Security Clearance Office (DISCO), an agency of the Department of Defense, handles and adjudicates the security clearance process. More information about Security Clearances can be found on the US Department of State government website here: https://www.state.gov/m/ds/clearances/c10978.htm187678\n<br><br>\nRaytheon Technologies is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</div><div></div>",
        "index": 29,
        "skills": [
            "project management",
            "information technology",
            "java",
            "networks",
            "c and c++",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Intern, Visa DPS Risk Services",
        "company": "Visa - 3.9",
        "location": {
            "city": "Highlands Ranch",
            "state": "Colorado"
        },
        "posted": "2021-09-23T18:37:38.602Z",
        "url": "https://www.simplyhired.com/job/aH6o7b1Gqn7x4BOVpRZtJ53i1bmKvnyZsFzEqwhVYOVJx7VjeJNT3w?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:34.888Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nAs the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.\n<br><br>\nAt Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.\n<br><br>\nYou’re an Individual. We’re the team for you. Together, let’s transform the way the world pays.\n<br><br>\nJob Description\n<br><br>\nThis Intern role is within the Visa DPS Risk Services team. The Risk Services provides a suite of Payment System risk mitigation tools and services for our Issuer processing clients, and with these tools and services, delivers fraud rates 27% lower than Visa US Debit average. Performance measurement and analytics represents a key differentiator in our competitive performance advantages, enabling us to continually identify opportunities and hone in on areas to target that enable us to continually build on our performance differentiation to the benefit of our clients.\n<br><br>\nThis intern will have the opportunity to work with our Risk and Disputes analytics professionals, developing and deploying data-driven insights and propelling our risk strategies. The position will also evaluate analytics-based solutions to automate key processes including client performance scorecards, client billing, and client performance insights for cross-functional management.\n<br><br>\nEssential Functions\n<br><br>\nDevelop and maintain standard and customized operational and fraud performance insights across various measures\n<br>Provide analytical insights and data visualizations for Visa clients, team members and other internal resources\n<br>Research and implement better methods to streamline data collection and reporting efforts\n<br>Work effectively with internal/external resources to define analytical objectives, data requirements, obtain data and perform in-depth analyses to achieve a defined business objective\n<br>Build out client performance insights and measurements against industry benchmarks with an eye to identifying opportunity for performance improvements and/or increased profitability\n<br>Develop a comprehensive understanding of all Visa products and services\n<br><br>\nQualifications\n<br><br>\nBasic Qualifications\n<br><br>\nUndergrad Intern\n<br><br>\nPursuing a Bachelors degree in Computer Science, Computer Engineering, CIS/MIS, Cybersecurity, Business or a related field, graduating December 2022 or later\n<br>Minimum GPA of 3.0 out of 4.0 (or equivalent scale)\n<br><b>Work Authorization:</b> Permanent Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position. Future sponsorship will not be considered.\n<br>Strong communications skills, specifically, the absence of repeated grammatical or typographical errors, clear and concise written and spoken communications, and communications that demonstrate professional judgment.\n<br><br>\nPreferred Qualifications\n<br><br>\nAdvanced Tableau Desktop and Server skills a plus\n<br>Strong background and skills with ETL systems, with Alteryx as preferred platform.\n<br><b>SAS experience:</b> proficiency and continuous skills development in leading edge analytic tools, e.g. SAS OR, Tableau, Hands on Hadoop experience is a plus\n<br>The ability to take on challenges and address problems head-on\n<br>Strong ability to collaborate\n<br>Highly driven, resourceful and results oriented\n<br>Good team player and excellent interpersonal skills\n<br>Good analytical and problem-solving skills\n<br>Demonstrated ability to lead and navigate through ambiguity\n<br><br>\nAdditional Information\n<br><br>\nWork Authorization\n<br><br>\nPermanent Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position. Future sponsorship will not be considered.\n<br><br>\n<b>Work Hours:</b><br>\nThis position requires the incumbent to be available during core business hours.\n<br><br>\n<b>Travel Requirements:</b><br>\nThis position requires the incumbent to travel for work less than 10% of the time.\n<br><br>\n<b>Physical Requirements:</b><br>\nThis position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms.\n<br><br>\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.</div><div></div>",
        "index": 30,
        "skills": [
            "information technology",
            "data visualization",
            "networks",
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Summer Intern, System Engineer - Connected Vehicle",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Irving",
            "state": "Texas"
        },
        "posted": "2021-09-23T18:37:42.619Z",
        "url": "https://www.simplyhired.com/job/YG7UVqMXAJWHgj1fnBjfKPhS70Oebuy5yMZev_0_yBGDJ1LL_lMpKA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:38.999Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><br>\n<b>Session:</b> Summer 2022\n<br><br>\n<b>Location:</b> Irving, TX\n<br><br>\nSiriusXM + Pandora have joined together to create the world's largest audio entertainment company, and we want you to be a part of it! SiriusXM + Pandora interns don't make coffee. They're on-air, writing code, working on projects, and making valuable contributions to the company. Join our internship program and learn about the world of audio entertainment and get hands-on experience in your field of study.\n<br><br>\n<b>Position Summary:</b><br>\nThe Connected Vehicle Services division of SiriusXM builds and delivers software-based services on our connected car platform. The software we develop not only adds convenience to the daily life of our subscribers, but safety and security as well; when the worst happens, our software helps to save lives.\n<br><br>\nSiriusXM + Pandora is looking for an Information Systems intern to support the IT ops team at SiriusXM CV. This is a position that will require the ability to write and communicate clearly, and to respond quickly to changes in requirements and/or schedules. The successful candidate will have the ability to work in a cooperative manner with software development engineers, SQA testers, release management team, and network/systems engineers.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nCreate change tickets for IT operations infrastructure projects and present to change board.\n<br>Create and follow-up on data center server requests.\n<br>Help monitor ticket queues and assign/resolve service requests and incidents.\n<br>Create and maintain documentation of workflows, network diagrams, and operating procedures.\n<br>Administer and support our AWS environments in the cloud including networking and infrastructure.\n<br>Help triage defects and issues in AWS.\n<br>Collaborate in the audit and control of AWS Cost Management.\n<br>Participate and support security remediation and patching activities.\n<br>Perform all other duties and projects assigned.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Pursuing or have received a Bachelor's degree in computer science, information technology, engineering, or a related technical discipline with an IT focus.\n<br>Must be able to work flexible hours, including evening hours.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nNatural curiosity and flexibility in problem solving.\n<br>Ability to generate insights from information.\n<br>Excellent communication and customer interfacing skills (verbal and written).\n<br>Ability to work independently multi-tasking in a deadline-driven environment.\n<br>Strong organizational skills and attention to details.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nThorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).\n<br>Working knowledge of Windows 7 and 8, Office 2007, 2010, 2014.\n<br>Working knowledge of Unix systems (Linux/AIX).\n<br>Scripting language experience is preferred (Ruby, Perl, Python).\n<br>Networking concepts (Subnetting, routing, LAN/WAN concept).\n<br>Familiarity with cloud computing concepts.\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 31,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "networks",
            "python",
            "machine learning"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, Connected Vehicle Engineering",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Irving",
            "state": "Texas"
        },
        "posted": "2021-09-23T18:37:46.554Z",
        "url": "https://www.simplyhired.com/job/MceixjKi8Vk49JPTUu3bbn4dg2FtDiWsXBb11GC6IKpcure6Lfky1g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:43.004Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Irving, Texas\n<br><br>\n<b>Position Summary:</b><br>\nSiriusXM's connected vehicle division is a market leader in this space providing services to major car makers such as Honda, Toyota, Subaru, Fiat Chrysler, Hyundai and many others. We save lives every day in addition to providing convenience driven by the latest technologies to millions of drivers.\n<br><br>\nWe are looking for an intern to join a dynamic and innovative new product group in the connected vehicle space with SiriusXM. As part of this group you will get exposure to real world IT and technology. Interns will get mentorship and will have an opportunity to truly experience large scale software applications, practical innovation and processes.\n<br><br>\nSiriusXM - Connected Vehicle has a dedicated intern program that is committed to provide mentorship to interns to shape their future and make them \"Market Ready\" by providing them an opportunity to work on real world applications.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nPassion for computer science, writing software and building innovative apps\n<br>Drive to work in real world environment\n<br><br>\n<b>Knowledge and interest in:</b><br>\nSoftware design principles.\n<br>SDLC\n<br>Systems Architecture\n<br>Any programming language, especially js, python and Java.\n<br>Passion to learn cloud computing / IoT (AWS primarily)\n<br>Interest or experience in Mobile development iOS / Android\n<br>An innate curiosity and a drive to learn.\n<br>A bias for action.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone\n<br><br>\n<b>Minimum Qualifications:</b><br>\nEnrolled in or completed a BS or MS candidate in Computer Science/Engineering or Electrical Engineering.\n<br>You must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nDemonstrate an ability to communicate as well as collaborate with internal customers.\n<br>Perform tasks with moderate supervision.\n<br>Ability to work both independently and in a team environment.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nPrior experience writing software is a plus.\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 32,
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "python",
            "machine learning",
            "mobile development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Summer Intern, Frontend",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Atlanta",
            "state": "Georgia"
        },
        "posted": "2021-09-23T18:37:50.501Z",
        "url": "https://www.simplyhired.com/job/G1KBHo_rrxEd0pfokEJLUCCdo8YUS0c3fC495Wbrq2lwkS8RXmNrUw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:46.948Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Atlanta, GA\n<br><br>\n<b>Position Summary:</b><br>\nOur Engineers get to solve cool problems for more than 100 million users, using Big Data. We have an opportunity for a talented, enthusiastic software engineering intern to participate on our team as a Software Engineer and develop high-quality software for the Pandora music service as we bring it to our large and growing community of listeners. You will be challenged to become a significant contributor on a hard-working team, and to take pride in your work. We have high expectations, and are looking for very knowledgeable and capable interns with solid software development skills. This position is designed to provide you with an opportunity to learn and gain experience crafting solutions to “real world” challenges.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nSoftware design and development project work, including web application and server-side development\n<br>Perform other duties as required.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor’s degree or higher in Computer Science or a related field.\n<br>Previous experience in software development - work projects, internships, summer jobs, etc. preferred.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nStrong academic credentials, solid understanding of software development, and personal responsibility for testing the code you write\n<br>Be enthusiastic about learning new technologies and skills\n<br>Must be willing to take initiative and follow through to completion\n<br>Must be capable of managing your time well and working collaboratively.\n<br>Excellent communication skills, both written and verbal, are required.\n<br>Experience developing in JavaScript, Java or NodeJS.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nExperience developing user interfaces with modern JavaScript frameworks, HTML5 and CSS3\n<br>Experience developing object-oriented code in Java/Kotlin\n<br>Experience developing software for deployment on Linux/Unix platforms.\n<br>Understanding of multi-threading, concurrency, design patterns and their impact on application concurrency\n<br>Working knowledge of SQL/ NoSQL based database solutions\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 33,
        "skills": [
            "project management",
            "software engineering",
            "sql",
            "javascript",
            "java",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, Quality Engineering",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Oakland",
            "state": "California"
        },
        "posted": "2021-09-23T18:37:57.251Z",
        "url": "https://www.simplyhired.com/job/MBSyllKiE5KJM_kvGpoJYEw2d8ri29r-zECWVPDNor2DpC9FldM8ew?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:53.752Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Oakland, CA\n<br><br>\n<b>Position Summary:</b><br>\nOur engineers get to solve cool problems for more than 100 million users, using big data. We have an opportunity for a talented, enthusiastic software engineering intern to participate on our team and develop high-quality software for the SiriusXM + Pandora music service as we bring it to our large and growing community of listeners. You will be a significant contributor on a hard-working team, and take pride in your work. We have high expectations, and are looking for very knowledgeable and capable interns with solid software development skills. This position is designed to provide you with an opportunity to learn and gain experience crafting solutions to \"real world\" challenges.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nGain high-level understanding of our apps and services.\n<br>Review requirements/designs, ask questions, and provide feedback.\n<br>Create and execute manual and automated tests.\n<br>Report issues and help improve software, tests, and documentation.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor's degree or higher in computer science, data science, or a related field.\n<br>Previous experience in software development and/or machine learning - work projects, internships, summer jobs, etc. preferred.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nBe enthusiastic about learning new technologies and skills.\n<br>Interest in how companies use data to deliver fantastic experiences to our users.\n<br>Must be capable of managing time well and working collaboratively.\n<br>Excellent communication skills, both written and verbal, are required.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nJava, JavaScript, and Selenium (Web Test Automation)\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 34,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "javascript",
            "java",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Intern",
        "company": "ViaSat - 3.8",
        "location": {
            "city": "Carlsbad",
            "state": "California"
        },
        "posted": "2021-09-23T18:38:01.369Z",
        "url": "https://www.simplyhired.com/job/ENcS4x8bxhY5FMYTYH2-7hVT_fixLK0tb53NgE-pIyyyEAwdzlV-eQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:37:57.644Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Bigger challenges. Bolder ideas. Global impact. At Viasat, we're on a mission to deliver connections with the capacity to change the world. We're the company behind the world's fastest satellite internet service, with technology that's helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide.\n<br><br>\nWe're looking for passionate, innovative professionals to join our team and connect the world to more. You'll work in a collaborative and inclusive environment that values diverse perspectives, continuous learning and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world's first truly global Internet Service Provider. Interested in joining our mission? Look at career opportunities at Viasat today.\n<br><br>\nJob Responsibilities\n<br><br>\nThe Viasat Global Network and Technology security team is responsible for all aspects of security as it relates to our broadband satellite communications systems. This encompasses cryptography, secure protocols, and key management for these systems, but more critically, true cybersecurity is a mindset that permeates the entire development and deployment process. Thus the team is in essence part of all other development teams, and builds automation to help those teams incorporate access control and encryption and vulnerability scanning with common tooling where possible. The intern assignments will provide exposure to the basics of secure systems, and especially the manner in which automation plays a critical role.\n<br><br>\nRequirements\n<br>Currently pursuing a Bachelor’s degree or higher in Computer Science, Computer Engineering, or related subject area\n<br>Strong interpersonal and communication skills\n<br>Proficiency coding in Python, Golang, or equivalent\n<br>Ability to commit to a 10-12 week internship\n<br>Preferences\n<br>Currently pursuing a Master's degree or higher in Computer Science, Computer Engineering, or related subject field\n<br>Previous software development experience\n<br>Previous experience working with containerized applications using Golang\n<br>Previous classwork or other exposure to secure systems, such as public-key cryptography or AAA/RBAC/2FA systems\n<br>Additional Requirements and information\n<br><br>\n<b>Minimum education:</b><br>\nHigh School Diploma or GED\n<br><br>\n<b>Years of experience:</b><br>\n0-1 years\n<br><br>\n<b>Travel:</b><br>\nUp to 10%\n<br><br>\n<b>Citizenship:</b><br>\nUS Citizenship Required\n<br><br>\n<b>Worker Classification:</b><br>\nIntern\n<br>Viasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic.</div><div></div>",
        "index": 35,
        "skills": [
            "information technology",
            "software engineering",
            "networks",
            "python",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Data Analytic Engineer Internship",
        "company": "Allstate - 3.7",
        "location": {
            "city": "Northbrook",
            "state": "Illinois"
        },
        "posted": "2021-09-23T18:38:05.402Z",
        "url": "https://www.simplyhired.com/job/viyZegb6xqIZNNa5AVvfkuykInXmEjykNRi8RNuFq2omtLEfczxVLw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:01.763Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">D3 Data Analytic Engineer Intern\n<br><br>\nWhere good people build rewarding careers.\n<br><br>\nThink that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br><br>\nData Engineering incorporates techniques from many disciplines, including data acquisition, computer programming, data engineering, software development, high performance computing, and traditional business expertise, with the goal of extracting meaning from data to optimize future business decisions. Individuals in this field should wish to be experts in several of these disciplines and sufficiently proficient in others to effectively design, build, and deliver end to end products to optimize future decisions. Successful individuals demonstrate significant analytic agility, and quickly develop new skills across these disciplines as they evolve. The Data Analytics Engineer role is responsible for working with clients to create scaled out business solutions and/or data using best practices, appropriate tools and software to provide documented, trusted and actionable results. This role requires analytic agility and the ability to quickly learn new techniques and technologies.\n<br><br>\nJob Description\n<br><br>\nThis is a 12-week long Summer 2022 internship in the Data, Discovery &amp; Decision Science (D3) department at Allstate. D3 is responsible for supporting other internal business units with a broad range of data, research and analytical projects. With fast growing team of highly skilled personnel, D3 provides a unique learning environment through formal training curriculum, mentoring, informal everyday coaching and hands-on training.\n<br><br>\n<b>Key Responsibilities:</b><br>\nUtilize multidisciplinary approach to Data Engineering problems to combine technical, analytics and business knowledge.\n<br>Demonstrate high degree of analytic agility to meet fluid and dynamic business needs.\n<br>Break down business problems into solvable components to recommend solutions.\n<br>Use a wide variety of tools and languages to achieve results (e.g., Python, C++, Java, Scala, SQL).\n<br>Rapid development of new data and analytics prototypes.\n<br>Develop and deliver data infrastructure to enable advanced analytics.\n<br>Explore data sources to better understand the availability and quality of data.\n<br>Document available data sources and how they are being transformed.\n<br>Embrace an environment that supports innovation and process improvement.\n<br>Disseminate knowledge across the team.\n<br><br>\n<b>Allstate Internship Program:</b><br>\n<b>Target start date:</b> May/June 2022\n<br>12-week summer internship program\n<br>An attractive compensation package\n<br>Collaborative team environment\n<br>Planned intern activities; including lunches with Allstate officers as keynote speakers\n<br>Volunteer/community service opportunities\n<br>Potential to receive possible full-time employment after graduation\n<br>Job Qualifications\n<br>Currently pursuing a degree in a computer science, mathematics or equivalent.\n<br>Pursuit of a graduate degree is a plus.\n<br>Ability to code and develop prototypes in languages such as Python, C++, Java, Scala, SQL\n<br>Some familiarity with the hadoop ecosystem desired.\n<br>Experience with Bash or Korn Shell Scripting desired.\n<br>Familiarity with statistical concepts and related technology (R, SAS, Matlab) is a plus.\n<br>Demonstrated analytic agility and problem-solving skills.\n<br>Ability and desire to learn new languages and technologies.\n<br>Strong attention to detail.\n<br>Solid written and oral communication skills.\n<br>Desire to share and inform others.\n<br>Compensation Data\n<br><br>\nThe salary for this role will be determined based on the school year you are entering in 2022\n<br><br>\nThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\nGood Work. Good Life. Good Hands®.\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life - including a generous paid time off policy. For a full description of Allstate’s benefits, visit allstate.jobs/benefits/\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\nAllstate generally does not sponsor individuals for employment-based visas for this position.\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click “here” for information regarding the San Francisco Fair Chance Ordinance.\n<br>For jobs in Los Angeles, please click “here” for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nTo view the “EEO is the Law” poster click “here”. This poster provides information concerning the laws and procedures for filing complaints of violations of the laws with the Office of Federal Contract Compliance Programs\n<br><br>\nTo view the FMLA poster, click “here”. This poster summarizing the major provisions of the Family and Medical Leave Act (FMLA) and telling employees how to file a complaint.\n<br><br>\nIt is the Company’s policy to employ the best qualified individuals available for all jobs. Therefore, any discriminatory action taken on account of an employee’s ancestry, age, color, disability, genetic information, gender, gender identity, gender expression, sexual and reproductive health decision, marital status, medical condition, military or veteran status, national origin, race (include traits historically associated with race, including, but not limited to, hair texture and protective hairstyles), religion (including religious dress), sex, or sexual orientation that adversely affects an employee's terms or conditions of employment is prohibited. This policy applies to all aspects of the employment relationship, including, but not limited to, hiring, training, salary administration, promotion, job assignment, benefits, discipline, and separation of employment.</div><div></div>",
        "index": 36,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "java",
            "matlab",
            "scala",
            "c and c++",
            "machine learning",
            "project management",
            "python"
        ],
        "compensation": "paid",
        "start": "2022-05-31T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Raytheon Intelligence & Space - 4.1",
        "location": {
            "city": "El Segundo",
            "state": "California"
        },
        "posted": "2021-09-23T18:38:09.418Z",
        "url": "https://www.simplyhired.com/job/IUJBas7q0wyQOSKG2N_oGLfrIvMBzzD0EgXyL-WVFgcFUzM3pzyLAQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:05.797Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Job Description:</b><br>\nHave you ever looked up at the stars and wondered who might be looking back? Well, wonder no more.\n<br><br>\nRaytheon Intelligence and Space creates communications and monitoring systems to keep America’s troops safe with real-time data and information. Our dynamic and diverse engineers develop demanding, trusted, superior solutions to make the world a safer place.\n<br><br>\nWe are looking for a proven Integrated Production Team Lead to join our Software Engineering team in El Segundo, California, a suburb of Los Angeles.\n<br><br>\nThe Secure Systems Solutions SW organization is seeking enthusiastic and highly capable software engineers in programs developing real time embedded software in the Resilient Navigations area.\n<br><br>\n<b>Key responsibilities for the qualified candidate include:</b><br>\nThe ideal candidate will employ Raytheon software development processes. Responsibilities include but are not limited to:\n<br><ul><li>Apply technical principles, theories, and concepts. Contribute to the development of new principles and concepts.</li><li>Analyze technical problems and provide innovative solutions</li><li>Work effectively and contribute during all phases of the software development life-cycle</li><li>Participate in development efforts of real-time embedded software</li><li>Drive towards meeting technical goals</li><li>Communicate effectively with team members and leaders across multiple disciplines and functional areas</li><li>Contribute significantly to team, program and customer meetings and reviews</li></ul>\n<b>Security Clearance &amp; Other Requirements:</b> U.S. Citizenship status is required as this position needs an active U.S. Security Clearance within 1 year of start date\n<br><br>\n<b>Requirements:</b><b>Required Skills:</b><br>\nMust be a college Junior, Senior or Graduate student by Fall 2022\n<br>Basic/fundamental software engineering coursework i.e., embedded software, real time software programming etc.,\n<br>Experience or interest in Aerospace and Defense Industry\n<br>Experience working within a team environment\n<br>Experience developing and delivering presentations (verbal and/or written) to key stakeholders\n<br>Experience with MS Office tool suite\n<br>Must be able to obtain an interim Secret security clearance PRIOR to starting\n<br>This position requires the eligibility to obtain a security clearance. Except in rare circumstances, only U.S. citizens are eligible for a security clearance.\n<br>U.S. Citizenship is required\n<br><br>\n<b>Desired Requirements:</b><br>\nSignal or Data processing experience\n<br><br>\n<b>Required Education:</b> In process for a Bachelor of Science degree in Electrical Engineering, Computer Engineering or related Science, Technology, Engineering or Mathematics (STEM) degree and must be a college Junior, Senior, or graduate student by Fall 2022\n<br>188621\n<br><br>\nRaytheon Technologies is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</div><div></div>",
        "index": 37,
        "skills": [
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Systems Consultant Intern",
        "company": "WTS Paradigm - 2.8",
        "location": {
            "city": "Middleton",
            "state": "Wisconsin"
        },
        "posted": "2021-09-23T18:38:13.405Z",
        "url": "https://www.simplyhired.com/job/-PtTv-ovP4sxYK7k0e3k5wgCPFycI4JAE41a-qei-Z6jVi-YhJBBYw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:09.812Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>If opportunity doesn’t knock, build a door. - Milton Berle<br>Come build your door with us. It’s what we do here.</p><p>At Paradigm, we make world-class software and deliver high-quality professional services for the building products industry. Do you believe that success is defined by the results you achieve? Do you enjoy collaborating with others to solve challenging business problems? Are you dedicated to customer satisfaction? If so, you might be Paradigm material.</p><p>We are currently seeking a <b>Systems Analyst Intern</b> to join our Middleton, WI office on May 16th for a 12-week internship.</p><p>You will be working in the forefront of an expanding industry, providing value to our customers and expanding our market reach.<br>What You Will Do:</p><ul><li>Evaluate feedback and system data to inform process and product improvements.</li><li>Learn and participate in the process for configuring and customizing a quoting system.</li><li>You will gain exposure to, and experience within, the software and technology field. This position gives you an added opportunity to experience the industry hands-on and grow your knowledge with software development processes and learn some of the concepts and skills needed to become a successful Systems Analyst.</li><li>Project opportunities may vary, but could include creating automated testing scenarios, evaluating system performance data, and system configuration and build.</li></ul><p>What You Need to Succeed:</p><ul><li>Proficient with MS Word, Excel, PowerPoint, Outlook</li><li>Strong analytical and quantitative abilities with a willingness to learn new skills and tools on the job</li><li>Passion for solving problems</li><li>Must be motivated, organized and possess good communicate skills (written and verbal)</li><li>Pursuing a degree in Math, Computer Science, Information Systems, Industrial Engineering, Business or similar</li></ul><p>Apply now at myparadigm.com/careers/</p><p>Job Type: Internship</p><p>Work Location: Multiple Locations</p></div><div></div>",
        "index": 38,
        "skills": [
            "information technology",
            "software engineering",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, Web Application Development",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Oakland",
            "state": "California"
        },
        "posted": "2021-09-23T18:38:17.435Z",
        "url": "https://www.simplyhired.com/job/7b1Nof4D8GB1jtixqm7G4v2yAg3SP9tWlRl_1YgLI6xduC8V18O8vg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:13.783Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Atlanta, GA/Irving, TX/Oakland, CA/New York, NY\n<br><br>\n<b>Position Summary:</b><br>\nOur Engineers get to solve cool problems for more than 100 million users, using Big Data. We have an opportunity for a talented, enthusiastic software engineering intern to participate on our team as a Software Engineer and develop high-quality software for the Pandora music service as we bring it to our large and growing community of listeners. You will be challenged to become a significant contributor on a hard-working team, and to take pride in your work. We have high expectations, and are looking for very knowledgeable and capable interns with solid software development skills. This position is designed to provide you with an opportunity to learn and gain experience crafting solutions to “real world” challenges.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nPerform software design and development project work on web applications using modern Javascript such as Angular / React.\n<br>Perform other duties as required.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor’s degree or higher in Computer Science or a related field.\n<br>Previous experience in software development - work projects, internships, summer jobs, etc. preferred.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nStrong academic credentials, solid understanding of software development, and personal responsibility for testing the code you write.\n<br>Be enthusiastic about learning new technologies and skills.\n<br>Must be willing to take initiative and follow through to completion.\n<br>Must be capable of managing your time well and working collaboratively.\n<br>Excellent communication skills, both written and verbal, are required.\n<br>Experience developing front end applications with expertise on Javascript, CSS and other related front end skills.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nExperience developing user interfaces with modern JavaScript frameworks, HTML5 and CSS3.\n<br>Experience developing object-oriented code in Java and/or Node.\n<br>Understanding of multiple threading, concurrency, design patterns and their impacts on application concurrency.\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 39,
        "skills": [
            "project management",
            "software engineering",
            "javascript",
            "angular",
            "java",
            "machine learning",
            "information technology",
            "web development"
        ],
        "compensation": "paid",
        "due": "2023-04-30T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, Technology Program Manager",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "Oakland",
            "state": "California"
        },
        "posted": "2021-09-23T18:38:21.426Z",
        "url": "https://www.simplyhired.com/job/Nse26gDyA-XOpVLk97wWYKR-V6TvKeZnHHy4x38Wjyla3Lo_sSFqWg?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:17.803Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><br>\n<b>Session:</b> Summer 2022\n<br><br>\n<b>Location:</b> Atlanta, GA/Irving, TX/ Oakland, CA\n<br><br>\n<b>Position Summary:</b><br>\nThe Technology Program Manager Intern for the Product Development (PD) organization works with the product and technology team leaders focused on SiriusXM+Pandora's delivery of critical projects, managing all aspects of delivery such as planning, process improvements, requirements definition, risk management, communication, compliance for quality and release processes and implementation. This person will be asked to lead a cross-functional team towards achieving tactical goals, retaining a strategic focus and delivering on critical project milestones that directly impact and reach over 100M users. This person is responsible for specific, short-term cross-functional projects for our Pandora and SiriusXM solutions.\n<br><br>\nWe are looking for someone who is passionate about results-oriented work and highly comfortable facilitating teams to meet commitments and successfully deliver high quality products and new features. You enjoy collaboration and teamwork and believe in trust, transparency, and kindness.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nWork directly with a cross-functional team to deliver on defined short-term project deliverables.\n<br>Help automate, implement and optimize processes across the PD organization.\n<br>Work in an agile, collaborative environment on deliverables that impact application delivery, security and tools for our cloud products.\n<br>Communicate action plans, risks and project status to a broad set of stakeholders.\n<br>Contribute to department attainment of organizational objectives.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor's degree or higher in computer science or a related field.\n<br>Previous experience in software development or cloud - work projects, internships, summer jobs, etc. preferred.\n<br><br>\n<b>Requirements and General Skills:</b><br>\nStrong verbal and written communication skills.\n<br>You are highly motivated and have an interest in working on and learning ad-based digital streaming technologies hosted in the cloud and help resolve technical and business issues.\n<br>Participate and contribute to enhance processes and organizational efficiencies across cross-functional teams and the organization.\n<br>You are excited about participating in technical discussions that impact a digital streaming multimedia company.\n<br>Desire to work in a fun and fast paced environment with cool products.\n<br>Must have legal right to work in the US.\n<br><br>\n<b>Technical Skills:</b><br>\nKnowledge of Project Management methodologies such as Agile.\n<br>Knowledge of Scrum or Kanban frameworks is a plus.\n<br>Experience with JIRA/Confluence/Tableau and Atlassian Products is a plus.\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 40,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2023-04-30T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "IT Security Intern",
        "company": "ServiceNow - 3.6",
        "location": {
            "city": "Santa Clara",
            "state": "California"
        },
        "posted": "2021-09-23T18:38:25.368Z",
        "url": "https://www.simplyhired.com/job/Bdj3xgM06Ra-4E-mtzS2gETfBicvV6w7UhDzA2jLrbNWj3q37Rl9Rw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:21.802Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.®\n<br><br>\nWe’re looking for people who are ready to jump right in and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better.\n<br><br>\nLearn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.\n<br><br>\nJob Description\n<br><br>\nDeliver real-world results on Security assignments, including helping handle incoming security incidents\n<br><br>\nAugment your education with real world work in Security\n<br><br>\nEnsure Sales Team is supported in Pre and Post Sales efforts\n<br><br>\nAnswer security due diligence and RFP questionnaires\n<br><br>\nEarn well-rounded experience to prepare for a career in the Security industry\n<br><br>\nHave opportunities to showcase accomplishments internally\n<br><br>\nQualifications\n<br><br>\nActively enrolled in an accredited university and pursuing an Bachelors degree in Information Systems, Business Administration, Information Technology, Security, or the equivalent\n<br><br>\nSome IT/Security course work is completed, including a basic understanding of networks and operating systems\n<br><br>\nStrong analytical skills and high attention to detail\n<br><br>\nDemonstrated well-developed written and oral communication skills\n<br><br>\nCustomer service experience\n<br><br>\nAre flexible and open-minded about learning about larger Security organizations\n<br><br>\nApproach problems and projects with a high level of professionalism, objectivity, and has an open mind to innovative ideas and solutions\n<br><br>\nAdditional Information\n<br><br>\nServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.\n<br><br>\nIf you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at [email protected] for assistance.\n<br><br>\nFor positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.\n<br><br>\n<b>Please Note:</b> Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.</div><div></div>",
        "index": 41,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Summer Intern, DevOps",
        "company": "SiriusXM - 3.5",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-09-23T18:38:29.423Z",
        "url": "https://www.simplyhired.com/job/L_fZHuntG6vWt9uyT6dFGLnTgDjXjX6HFxY8zW1h0tB2RE2r9XkLEQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:25.722Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners - in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at http://www.siriusxm.com/careers.\n<br><br>\n<b>Position Type:</b> Internship\n<br><b>Session:</b> Summer 2022\n<br><b>Location:</b> Atlanta, GA/New York, NY/ Lawrenceville, NJ/Irving, TX\n<br><br>\n<b>Position Summary:</b><br>\nSiriusXM is looking for a strong collaborative intern to continue their educational journey and gain experience within the SiriusXM Streaming DevOps Team. The DevOps Intern will support applications, hardware and configurations deployed across the Sirius XM’s Streaming infrastructure. The position focuses on streaming deployment and security architecture within the SiriusXM streaming areas; however, this team may be involved in some of the Pandora infrastructure. This also includes technical infrastructure that supports application monitoring, software build machines, and software support servers. The intern should have a penchant for solving tough technical problems, and a dedication to ensuring high-availability.\n<br><br>\n<b>Duties and Responsibilities:</b><br>\nPerform a wide variety of software/hardware configuration/maintenance tasks of many varied back-end systems, including, but not limited to, Windows/Linux server OS/software, server class hardware, VMware VSphere, AWS Infrastructure, Postgres/SQL databases and various application servers.\n<br>Amazon Web Services (AWS) Infrastructure\n<br>Creating and maintaining AWS Cloud Formation Scripts\n<br>Monitor and understand security events with WAFs, IDS/IPS, and access logs\n<br>Installation, configuration, and administration of Linux/Windows Servers.\n<br>Networking (TCP/IP) configuration including Firewall ACL’s and security\n<br>Installation, configuration, and administration of virtualization infrastructures running on AWS, Hashicorp Nomad, VMware suite of products: VSphere 5.X and newer, vCenter, ESXi Servers\n<br>Creation, Management and Configuration of Virtual Machines, Clone and Templates\n<br>Document and maintain procedures for administering, maintaining, and supporting infrastructure\n<br>Create automated tasks with shell scripts (bash, batch, python)\n<br>Perform other duties as required.\n<br><br>\n<b>Supervisory Responsibilities:</b><br>\nNone.\n<br><br>\n<b>Minimum Qualifications:</b><br>\nYou must be 18 years of age or older.\n<br>Internships are open to current students enrolled at a university (those graduating by May 2023 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.\n<br>Currently pursuing a Bachelor's degree or higher in Computer Science, Computer Engineering, Electrical Engineering, Information Technology, Mathematics, Risk and Security Analysis\n<br><br>\n<b>Requirements and General Skills:</b><br>\nBe enthusiastic about learning new technologies and skills.\n<br>Interest in how companies use data to deliver fantastic experience to our users.\n<br>Must be capable of managing time well and working collaboratively.\n<br>Excellent communication skills, both written and verbal, are required.\n<br>Must have legal right to work in the U.S.\n<br><br>\n<b>Technical Skills:</b><br>\nAWS knowledge base\n<br>AWS certification(s) a plus\n<br>Familiar with most flavors of Linux/Windows\n<br>Experience with a terminal in a Linux or Window environment\n<br>Experience with development / CI applications such as SVN, GitHub, Bitbucket\n<br>Knowledge of networking concepts\n<br>Proficiency in documenting using MS Office or Google Docs\n<br>SQL, and NoSQL Database knowledge is a plus\n<br>Experience with Active Directory and Windows Server administration is a plus\n<br>Server Hardware configuration, installation, and maintenance experience\n<br><br>\nPlease note that all SiriusXM internships are paid.\n<br><br>\nMore details about our company benefits can be found https://jobs.jobvite.com/siriusxm/p/cultureanddiversity!\n<br><br>\nOur goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</div><div></div>",
        "index": 42,
        "skills": [
            "machine learning",
            "devops",
            "information technology",
            "software engineering",
            "sql",
            "hardware",
            "networks"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern - Information Security",
        "company": "Itron - 3.8",
        "location": {
            "city": "Austin",
            "state": "Texas"
        },
        "posted": "2021-09-23T18:38:33.457Z",
        "url": "https://www.simplyhired.com/job/b56uyjr7aplREBFDYGK8BVC0LLpTPJe8d_fbUATFWmx2LlVddOEjUQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:29.805Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The work we do every day matters. From modernizing the grid and ensuring safe, reliable water delivery to creating smarter cities, you can make a global impact with Itron.\n<br><br>\nOur Information Security team within corporate IT is looking for an intern to support Information Security compliance.\n<br>This position provides the opportunity to gain experience in information security compliance and audit activities while completing your education.\n<br><b>Duration:</b> Must be available at least 20 hours/wk during the academic year, and located in the greater Austin, TX area. This is not a remote position.\n<br><br>\nJob Duties &amp; Responsibilities\n<br><br>\nSupport information security related tasks including management and documentation of Information Technology general-controls related to Sarbanes-Oxley (SOX) financial audits\n<br>Support Information Security compliance including managing general controls and writing automated scripts\n<br>Develop and grow understanding of risk compliance applications (e.g., Audit Board or Galvanize)\n<br>Collaborate with internal and external stakeholders to achieve individual, team and company goals, including coordinating and leading meetings, with support from manager\n<br>Utilize technology systems and tools to complete work tasks, including Oracle, Excel, Visual Basics Scripts (VBS)\n<br><br>\nQualifications\n<br><b>Education:</b> Currently enrolled in a related degree program (Cybersecurity, Finance, Computer Science preferred)\n<br><br>\n<b>Required:</b><br>\nBasic knowledge of information security technologies and compliance principles (SOX, NIST 800-53, ISO 27001)\n<br>Hands-on experience with Oracle administration and/or Linux OS\n<br>Ability to work well independently and with coworkers to share knowledge as part of a team\n<br>Experience managing time independently and prioritizing tasks\n<br>Strong problem-solving ability with the desire to take ownership of challenges and follow through to resolution\n<br>Intermediate Excel abilities (formulas, functions, vlookup)\n<br>Professional oral and written communication skills\n<br><br>\n<b>Preferred:</b><br>\nRelated academic projects or work experience\n<br>Academic or work experience in Oracle\n<br>Understanding of Audit Control Language (ACL) and/or VBS scripting\n<br><br>\n<b>Travel:</b> 1 - 10%\n<br><br>\n<b>Physical Demands:</b> This is a typical office job, with no special physical requirements or unusual work environment.\n<br><br>\nItron is an Equal Opportunity, Affirmative Action Employer. Qualified applicants are considered without regard to race, color, religion, sex, age, national origin, citizenship, sexual orientation, marital status, pregnancy, medical condition, veteran status, disability, genetic information, gender identity or other characteristics protected by law. If you require an accommodation in order to apply to this position, please contact your local recruiting representative at 1-800-635-5461 or email Accessibility@itron.com. #ItronUR\n<br><br>\nItron enables utilities and cities to safely, securely and reliably deliver critical infrastructure services to communities in more than 100 countries. Our portfolio of smart networks, software, services, meters and sensors helps our customers better manage electricity, gas and water resources for the people they serve. By working with our customers to ensure their success, we help improve the quality of life, ensure the safety and promote the well-being of millions of people around the globe. Itron is dedicated to creating a more resourceful world. Join us: www.itron.com.\n<br><br>\n#LI-JC1</div><div></div>",
        "index": 43,
        "skills": [
            "project management",
            "information technology",
            "data visualization",
            "networks",
            "software engineering"
        ],
        "contact": "Accessibility@itron.com, 1-800-635-5461",
        "remote": true
    },
    {
        "position": "Package Integrity Intern - Signal Integrity",
        "company": "Marvell - 3.4",
        "location": {
            "city": "Burlington",
            "state": "Vermont"
        },
        "posted": "2021-09-23T18:38:37.473Z",
        "url": "https://www.simplyhired.com/job/uizfTZo5REi0Q8fp9e4c4xjpL5oLRiVhQF3EGKEIBgEvuWH1gda6wQ?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:33.832Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">About Marvell\n<br><br>\nAt Marvell, we believe that infrastructure powers progress. That execution is as essential as innovation. That better collaboration builds better technology. Trusted by the world’s leading technology companies for 25 years, we move, store, process and secure the world’s data with semiconductor solutions designed for our customers’ current needs and future ambitions. Through a process of deep collaboration and transparency, we’re ultimately changing the way tomorrow’s enterprise, cloud, automotive, and carrier architectures transform—for the better.\n<br><br>\nThe data infrastructure that our customers build has never been more critical to our global economy. It’s what’s keeping the world connected, businesses running, and information flowing. If you’re ready to excel, innovate, and truly enjoy your work, apply now for the position detailed below.\n<br><br>\nThe Opportunity\n<br><br>\nThe advanced packaging signal integrity position at Marvell focuses on design of advanced packages used in 5G carriers, cloud data centers, enterprise and automotive applications. The engineer provides technical leadership while working with a broad team of system architects, ASIC engineers, CAD engineers and other very talented and knowledgeable SI engineers in creation of next generation high performance products.\n<br><br>\n<b>Job Responsibilities:</b><br>\nPotential activities include\n<br><br>\nPrototyping new modules for future products\n<br><br>\nUnit testing various modules, and running required System and Integration tests using Perl/Pyth o n\n<br><br>\nPerform electrical modeling of high-speed interposer and package structures\n<br><br>\nDesign and analysis of multi-tens-gigabit serial links and their compliance to internal specs and standards\n<br><br>\nModeling and analyzing power delivery networks\n<br><br>\nDevelop innovative chip / interposer/ package/PCB co-design methodologies\n<br><br>\nUse code development expertise to create tools to implement such methodologies\n<br><br>\nProvide package methodology and design related technical leadership to Marvell’s product design, manufacturing, and sales communities\n<br><br>\nDesign package technology test vehicles\n<br><br>\nC ollaborate with people inside and outside the team for effective outcomes.\n<br><br>\nUnderstand and follow Marvell’s Core Behaviors.\n<br><br>\n<b>Requirements:</b><br>\nCandidate MUST be currently pursuing a BS/MS (preferred) degree in CS/EE or related technical field(s) that provides knowledge and exposure to theories, principles and concepts.\n<br><br>\nExcellent written and verbal Communication skills\n<br><br>\nKnowledge of signal integrity and power integrity\n<br><br>\nU nderstanding of fields and waves\n<br><br>\nUnderstanding of circuit elements and simulation techniques\n<br><br>\nExperience using CAD layout tools such as Cadence Allegro\n<br><br>\nExperience with circuit simulators like spice or spectre\n<br><br>\nE xperience with at least one of the following programming languages – tcl , Java, Python, Perl, Skill, C++\n<br><br>\n<b>Minimum Qualifications:</b><br>\n0-1 years of previous experience\n<br><br>\nThe Perks\n<br><br>\nWith competitive compensation and great benefits, you will enjoy our workstyle within an incredible culture. We’ll give you all the tools you need to succeed so you can grow and develop with us. For additional information on what it’s like to work at Marvell, visit our Careers page.\n<br><br>\nYour Future\n<br><br>\nMarvell provides a work environment that promotes employee growth and development. We are searching for an individual who wants to grow with the company and will strive to improve performance. If you are driven, personable, and energetic, there will be additional opportunities for you here at Marvell.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.\n<br><br>\nAny applicant who requires a reasonable accommodation during the selection process should contact Marvell HR Helpdesk at GR-HR-Services-Americas@marvell.com or 408-222-3604.</div><div></div>",
        "index": 44,
        "skills": [
            "information technology",
            "java",
            "networks",
            "python",
            "c and c++",
            "software engineering"
        ],
        "contact": "Americas@marvell.com, 408-222-3604",
        "remote": false
    },
    {
        "position": "Intern Data Governance (Summer 2022)",
        "company": "The Hershey Company - 3.8",
        "location": {
            "city": "Hershey",
            "state": "Pennsylvania"
        },
        "posted": "2021-09-23T18:38:44.858Z",
        "url": "https://www.simplyhired.com/job/yWf-hzq5aq5WX-sMi9VfWf3g_E3NttaIbp0V4QHaX8Rsd_QlPG1p7g?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:41.375Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Location:</b> Hershey, PA\n<br><br>\nThe Hershey Company\n<br><br>\nEnterprise Data and Technology, Data Governance Intern (Hershey, PA)\n<br><br>\nThe Enterprise Data organization drives value for Hershey by providing high-quality, well governed data to the Enterprise for analytics and decision-making. This group employs new cloud-based intelligent systems to collect, distribute, model and analyze disparate and diverse data assets of all sizes to automate insights sizes to automate insights and drive business performance. Our strategy is to improve our data offerings through consolidation and modernization of our data and platforms, while continuing to build our data expertise.\n<br><br>\n<b>Duties:</b><br>\nWork closely with a project team to deliver an enterprise solution for a data catalog\n<br>Understand Hershey data assets by working closely with business stakeholders to build metadata and descriptions for various data assets\n<br>Work to build workflow processes and alerts within the catalog to enable data quality, integrity and maintenance in the solution\n<br>Gain an understanding of the technology used to deliver data assets to the business, becoming an integral part of the team\n<br>Build various levels of reporting capabilities for tracking adoption and progress of the project team\n<br>Provide recommendations to the team and business for building a strong data catalog solution\n<br>Begin to understand the data ecosystem at Hershey and the tools available for data engineering, visualization and governance\n<br><br>\n<b>Qualifications:</b><br>\nExperience within SQL, Power BI, or Tableau\n<br>Passion for analytical problem solving\n<br>Quick learner through formal and self-guided education\n<br>Proactive self-starter with a desire to make an impact\n<br>Ability to work in teams or individually\n<br>Courage to challenge the status quo and take smart risks\n<br>Excellent written and verbal communication skills for coordinating across teams\n<br><br>\n<b>Education:</b><br>\nGPA of 3.3 or higher preferred\n<br>Bachelor’s degree with quantitative, STEM focus (e.g. Business, Computer Science, Engineering, Mathematics, Statistics - other degrees will be considered).\n<br><br>\n<b>Reports to:</b> Senior Manager – Data Governance\n<br><br>\n<b>Travel:</b> 0%\n<br><br>\nThe Hershey Company is an Equal Opportunity Employer. The policy of The Hershey Company is to extend opportunities to qualified applicants and employees on an equal basis regardless of an individual's race, color, gender, age, national origin, religion, citizenship status, marital status, sexual orientation, gender identity, transgender status, physical or mental disability, protected veteran status, genetic information, pregnancy, or any other categories protected by applicable federal, state or local laws.\n<br><br>\nThe Hershey Company is an Equal Opportunity Employer - Minority/Female/Disabled/Protected Veterans\n<br><br>\nIf you require a reasonable accommodation as part of the application process, please contact the HR Service Center (askhr@hersheys.com).</div><div></div>",
        "index": 45,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "data visualization",
            "software engineering"
        ],
        "contact": "askhr@hersheys.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "INTERN - ENVIRONMENT AFFAIRS [Temporary]",
        "company": "United Nations - 4.4",
        "location": {
            "city": "New York",
            "state": "New York"
        },
        "posted": "2021-09-23T18:38:49.010Z",
        "url": "https://www.simplyhired.com/job/_7GAgakfXxB5m9KF4K8123zP5vZHbJ24n6ESOiN3dMjG8nhMfA2FoA?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:45.243Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The United Nations Forum on Forests Secretariat (UNFFS), Department of Economic and Social Affairs (DESA) is accepting applications for internships.\n<br>The UNFFS provides leadership in promoting the implementation of the United Nations Strategic Plan for Forests (UNSPF) and the achievement of its Global Forest Goals, and the effective implementation of the UN Forest Instrument. It provides substantive secretariat support to the United Nations Forum on Forests (UNFF), which is composed of all Member States of the United Nations and specialized agencies.\n<br>In 2015, the UNFF established the Global Forest Financing Facilitation Network under the UNFFS to facilitate access to and effective use of funding for forests, sharing data and best practices on forest financing and contributing to the achievement of the Global Forest Goals of the UN Strategic Plan for Forests 2030. More information on the UNFFS and the GFFFN can be found at www.un.org/esa/forests.\n<br>The prospective intern should have a background in economics, environmental issues, data science, or computer science-related areas. Experience or knowledge of IT-related work is desirable. The internship is for three months, with an opportunity for extension up to a maximum of six (6) months, depending on the needs of the Office.\n<br>The internship is UNPAID and full-time. Interns work five days per week (35 hours) under the supervision of a staff member in the department or office to which they are assigned.\n<br><br>\nFor more information about the Office, please see https://www.un.org/esa/forests/\n<br><br>\nResponsibilities\n<br><br>\nThe selected intern(s) will be responsible for one or more of the following duties in support of the work of the UNFF and its Global Forest Financing Facilitation Network (GFFFN), depending on his/her education background:\n<br><br>\n1.Conduct desk research and collect information on forest financing. This would include information on financing opportunities, learning materials and good practices at international level;\n<br>2.Conduct desk study on the existing data and datasources on financing flow for forests;\n<br>3.Assist in drafting and entering data entries into the website of the UNFF Clearing House on Forest Financing;\n<br>4.Assist in preparing news letters, analytical papers, issue briefs and other written documents on forest financing, for publication through the website of the UNFF Clearing House on Forest Financing.\n<br>5.Assist in website development and updates for the website of the UN Forum on Forests, using WordPress and Drupal;\n<br>6.Assist in preparations for the seventeenth session of the United Nations Forum on Forests (UNFF17) and its preparatory work.\n<br>7.Perform other duties as assigned.\n<br><br>\nCompetencies\n<br><br>\n<b>The United Nations Core Competencies include:</b><br>\n<ul><li>Communication: Ability to draft clearly and concisely, good written and oral language</li></ul>\nskills.\n<br><ul><li>Teamwork: Good interpersonal skills, ability to work collaboratively with colleagues from different national and cultural backgrounds to achieve organisational goals.</li><li>Client Orientation: Considers all those to whom services are provided to be 'clients' and</li></ul>\nseeks to see things from clients' point of view.\n<br><br>\n<b>The intern is expected to:</b><br>\nHave a demonstrated keen interest in the work of the United Nations and have a personal commitment to the ideals of the Charter; and\n<br>Have demonstrated the ability to successfully interact with individuals of different cultural backgrounds and beliefs, which include willingness to try and understand and be tolerant of differing opinions and views.\n<br><br>\nEducation\n<br><br>\nTo qualify for an internship with the United Nations Internship Programme, the following conditions must be met:\n<br><br>\n<b>Applicants must meet one of the following requirements:</b><br>\n(a)be enrolled in a graduate school programme (second university degree or equivalent, or higher);\n<br>(b)be enrolled in the final academic year of a first university degree programme (minimum Bachelor's level or equivalent); or\n<br>(c)have graduated with a university degree (as defined above) and, if selected, must commence the internship within a one year period of graduation;\n<br><ul><li>Be computer literate in standard software applications.</li><li>Knowledge of issues in the context of sustainable development would be an advantage.</li></ul>\nLanguages\n<br><br>\nEnglish and French are the working languages of the United Nations Secretariat. Fluency in spoken and written English is required for the Internship Programme. Knowledge of additional official United Nations language is an asset. Arabic, Chinese, English, French, Russian and Spanish are the official languages of the United Nations Secretariat.\n<br><br>\nAssessment\n<br><br>\nPotential candidates will be contacted by the hiring manager directly for further consideration.\n<br><br>\nSpecial Notice\n<br><br>\nIn the context of the COVID-19 pandemic, interns may be requested to undertake the internship remotely in view of constraints regarding visa issuance, international travel and access to UN premises. The intern must be willing and prepared to undertake the internship remotely for a part or the entirety of the internship. The work hours during the internship shall be determined based on individual discussion between the intern and the supervisor(s) taking into consideration the minimum requirements of the Organization and the time difference between the hosting office and the location of the intern.\n<br><br>\nA completed online application (Cover Note and Personal History Profile) is required.\n<br>Incomplete applications will not be reviewed.\n<br><br>\n<b>The Cover Note must include:</b><br>\n<ul><li>Degree Programme (What are you currently studying?)</li><li>Graduation Date (When will you graduate or when did you graduate from the programme?)</li><li>List the IT skills and programmes that you are proficient in.</li></ul>\nUnited Nations Considerations\n<br><br>\nAccording to article 101, paragraph 3, of the Charter of the United Nations, the paramount consideration in the employment of the staff is the necessity of securing the highest standards of efficiency, competence, and integrity. Candidates will not be considered for employment with the United Nations if they have committed violations of international human rights law, violations of international humanitarian law, sexual exploitation, sexual abuse, or sexual harassment, or if there are reasonable grounds to believe that they have been involved in the commission of any of these acts. The term “sexual exploitation” means any actual or attempted abuse of a position of vulnerability, differential power, or trust, for sexual purposes, including, but not limited to, profiting monetarily, socially or politically from the sexual exploitation of another. The term “sexual abuse” means the actual or threatened physical intrusion of a sexual nature, whether by force or under unequal or coercive conditions. The term “sexual harassment” means any unwelcome conduct of a sexual nature that might reasonably be expected or be perceived to cause offence or humiliation, when such conduct interferes with work, is made a condition of employment or creates an intimidating, hostile or offensive work environment, and when the gravity of the conduct warrants the termination of the perpetrator’s working relationship. Candidates who have committed crimes other than minor traffic offences may not be considered for employment.\n<br><br>\nDue regard will be paid to the importance of recruiting the staff on as wide a geographical basis as possible. The United Nations places no restrictions on the eligibility of men and women to participate in any capacity and under conditions of equality in its principal and subsidiary organs. The United Nations Secretariat is a non-smoking environment.\n<br><br>\nThe paramount consideration in the appointment, transfer, or promotion of staff shall be the necessity of securing the highest standards of efficiency, competence, and integrity. By accepting an offer of appointment, United Nations staff members are subject to the authority of the Secretary-General and assignment by him or her to any activities or offices of the United Nations in accordance with staff regulation 1.2 (c). In this context, all internationally recruited staff members shall be required to move periodically to discharge new functions within or across duty stations under conditions established by the Secretary-General.\n<br><br>\nApplicants are urged to follow carefully all instructions available in the online recruitment platform, inspira. For more detailed guidance, applicants may refer to the Manual for the Applicant, which can be accessed by clicking on “Manuals” hyper-link on the upper right side of the inspira account-holder homepage.\n<br><br>\nThe evaluation of applicants will be conducted on the basis of the information submitted in the application according to the evaluation criteria of the job opening and the applicable internal legislations of the United Nations including the Charter of the United Nations, resolutions of the General Assembly, the Staff Regulations and Rules, administrative issuances and guidelines. Applicants must provide complete and accurate information pertaining to their personal profile and qualifications according to the instructions provided in inspira to be considered for the current job opening. No amendment, addition, deletion, revision or modification shall be made to applications that have been submitted. Candidates under serious consideration for selection will be subject to reference checks to verify the information provided in the application.\n<br><br>\nJob openings advertised on the Careers Portal will be removed at 11:59 p.m. (New York time) on the deadline date.\n<br><br>\nNo Fee\n<br><br>\nTHE UNITED NATIONS DOES NOT CHARGE A FEE AT ANY STAGE OF THE RECRUITMENT PROCESS (APPLICATION, INTERVIEW MEETING, PROCESSING, OR TRAINING). THE UNITED NATIONS DOES NOT CONCERN ITSELF WITH INFORMATION ON APPLICANTS’ BANK ACCOUNTS.</div><div></div>",
        "index": 46,
        "skills": [
            "information technology",
            "networks",
            "c and c++",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "unpaid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Summer Scientist Intern, Radio & Music Informatics",
        "company": "N/A",
        "location": {
            "city": "N/A",
            "state": "N"
        },
        "posted": "2021-09-23T18:38:50.278Z",
        "url": "https://www.simplyhired.com/job/eEHHRIntJaxV03t2ZomovyxrwYIFJ7fB637A4J9PKKeGpVD7TnqkKw?q=computer+science+intern",
        "lastScraped": "2021-09-23T18:38:49.400Z",
        "description": "N/A",
        "index": 47,
        "skills": [],
        "remote": false
    }
]