[
    {
        "position": "Full Stack Web Developer (Remote, International)",
        "company": "SOCi Inc.",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-08-15T18:31:15.627Z",
        "url": "https://stackoverflow.com/jobs/519652/full-stack-web-developer-remote-international-soci-inc?a=2Oh3Jh7jfKnu&so=i&pg=1&offset=0&total=1&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "software engineering",
            "hardware",
            "machine learning",
            "project management",
            "information technology"
        ],
        "lastScraped": "2021-09-03T18:31:15.627Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>About SOCi</strong></p>\n<p>SOCi is an award-winning all-in-one local marketing platform built specifically for \"next-level\" multi-location marketers. Our customers include top brands and influencers like Ace Hardware, Sport Clips, and Anytime Fitness who have the impossible challenge of managing their digital presence across hundreds and thousands of locations. The SOCi platform empowers local management of the entire customer journey across multiple mediums including local business listings, social, reviews, listening, ads, bots, and more. As the central command for multi-location marketers, SOCi makes the impossible possible by enabling top brands and their locations to strengthen and scale their digital presence across limitless local search and social pages while protecting what matters most, their reputation.</p>\n<p>*** This is a fully remote position; <strong>international applicants welcome!</strong></p>\n<p><strong>Full Stack Web Developer</strong></p>\n<ul>\n<li>As a member of an Empowered Product Team, you'll be accountable for deeply understanding the customer's problem, actively contributing to ideating on the solutions and measuring your impact through the results on our customers, not code written. There are no \"specs\" or top-down management here.</li>\n<li>A team consists of 2 other engineers, a UX designer and a product manager. You'll be \"mob programming\" with the other engineers, in real-time over Zoom throughout the day, while ad-hoc collaborating with the product manager and UX designer as needed.</li>\n<li>This position is fully remote, our teams are distributed across four continents. You'll be expected to observe ~6am...~4pm PST (±2) working hours (varies by team).</li>\n<li>You'll be deploying incremental slices of progress to production daily or even multiple times throughout the day; the only measure of progress is delivery of customer value to production.</li>\n</ul>\n<p><strong> Requirements</strong></p>\n<ul>\n<li>7+ years experience in building complex software systems</li>\n<li>Deep understanding of object-oriented programming, ability to articulate the pros and cons of inheritance vs composition, discuss common design patterns, their applications and common mistakes when using them</li>\n<li>Deep understanding of relational database systems (MySQL, Postgres), including normalization (pros, cons), indexing strategies for large databases (100s millions of rows), and query optimization strategies (and common pitfalls)</li>\n<li>Demonstrated track record of being able to balance making the right architectural decisions while moving fast do deliver customer value; can show examples of prior architectures built, articulate the tradeoffs and reasons for them</li>\n<li>Solid core programming skills in a couple of languages (JS, PHP preferred, but not required)</li>\n</ul>\n<p><strong>Why you’ll love it here</strong></p>\n<ul>\n<li>Fully remote, diverse international team</li>\n<li>An extremely talented group of engineers and tech leads to learn from</li>\n<li>Work directly with product and technology executives</li>\n<li>Active career coaching and professional development to keep you growing</li>\n<li>Learning budget (books, online courses)</li>\n<li>Directly see the impact of your work by working closely with customers and help build the fastest-growing mar-tech platform for top brands</li>\n</ul>\n<p><strong>What's SOCi's culture like?</strong></p>\n<p>SOCi stands for Selfless, Overachievers, Customer Centric, and Innovative. We strive to be in service to each other, consider learning as Job #1, and obsess over the customer problems such that we can deliver most valuable solutions to them. We hold each other accountable, are candid in our feedback, and expect you to do the same. It's okay to make mistakes, it's not okay to not learn from them. We partner strongly across departments and function, as we know it'll take a village to succeed. One team, one dream.</p>\n<p>SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</p>            </div>",
        "index": 1,
        "remote": true
    }
]