[
    {
        "position": "Mfg Engineer",
        "company": "inSync Staffing",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/insync-staffing-f5578b52/mfg-engineer-37aa067c?lvk=ZU3S2t7_lWFbe_GoJlH0Bg.--M-iNhfmP3",
        "posted": "2021-04-24T12:54:32.335Z",
        "lastScraped": "2021-04-25T12:54:32.335Z",
        "description": "<div><p>Pay $31.00<br>Day shift<br><br><em>4 year technical or science degree and experience in Medical Device Industry<br><br>Will consider recent BS grads with some applicable internship experience</em><br><em>Job Description:</em></p><ul><li><em>Support Medical Device R&amp;D efforts working with the customer and other engineers</em></li><li><em>Catheter experience preferred.</em></li><li><em>Cleanroom experience</em></li><li><em>Computer skills to access Manufacturing Process Instructions.</em></li><li><em>Good communication skills.</em></li><li><em>QA, Mfg or R&amp;D background</em></li></ul></div>",
        "index": 1,
        "skills": [
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Electrical Engineer",
        "company": "Elite Ed Services Staffing Agency, LLC",
        "location": {
            "city": "Las Vegas",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/elite-ed-services-staffing-agency-llc-f3881386/electrical-engineer-c58937db?lvk=OjEw2y453kh2IjBpul9iIg.--M-m1ggghV",
        "posted": "2021-04-25T12:54:35.234Z",
        "lastScraped": "2021-04-25T12:54:35.234Z",
        "description": "<div><p><strong>Summary</strong></p><p>Uses advanced techniques, theory, precepts and practices in the Electrical Engineering field. Serves as technical specialist, staff advisor and consultant in area of Electrical Engineering. Provides technical support for design effort including participation in planning and design; interpretation of design; application of construction methods; resolution and documentation of design conflicts; and constructability reviews. May be given project management responsibilities. Supervision of engineering and support personnel is usual at this level but may often be on a lead and project basis.</p><p><strong>Essential Responsibilities</strong></p><p>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>Prepare and provide oversight of technical studies, submittals, plans, specifications, diagrams, calculations, cost estimates and control strategies for public works projects and private developments involving electrical systems and equipment, high voltage and renewable energy power systems, control systems and instrumentation, lighting systems, traffic signal systems including voltage drop calculations, telecommunication systems and security systems.</li><li>Conduct a variety of electrical and power system studies, including lighting lamination analysis for transportation corridors</li><li>Perform difficult engineering research and analyze complex engineering and mathematical problems, evaluating alternatives and recommending or adopting effective courses of action</li><li>Ensure engineering activities comply with company and contract requirements and support overall project schedule.</li><li>Conduct field inspections and investigations to verify as-built conditions as they may impact design requirements;</li><li>Coordinate services during construction including attending progress meetings, supervising review of shop drawings, issuing RFI responses and investigating field changes.</li><li>Direct day-to-day project management activity on design and planning projects as assigned, including scheduling and budget.</li><li>Develop, implement, and administer project engineering procedures and other work controlling documents.</li><li>Assist in the proposal process for new contracts, including fee estimates and project scope.</li><li>Oversee work of engineering interns and/or technical staff on project-specific tasks.</li><li>Coordinate technical elements with multi-disciplinary engineering teams.</li></ul><p><strong>Knowledge, Skills, and Abilities</strong></p><ul><li>Theory, principles and practices of electrical engineering</li><li>Applicable laws, codes and regulations pertaining to electrical and instrumentation elements of waterworks infrastructure design and construction, including the National Electrical Code, IEEE standards and InterNational Electrical Testing Standards</li><li>Good working knowledge of CAD software, Civil 3D, ETAP, Microsoft programs (Word, Excel, and Project) and video <span class=\"long-word\">conferencing/communications</span> programs (Zoom, Teams, WebEx).</li><li>Ability to communicate clearly and concisely in written and oral communications.</li><li>Must be able to read and comprehend detailed correspondence and reports.</li><li>Ability to deal with problems involving several variables in standardized situations.</li></ul><p><strong>Education and Experience</strong> <strong>Requirements</strong></p><p>Bachelors of Science degree</p></div>",
        "index": 2,
        "skills": [
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer",
        "company": "sharpencx.corporation.",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/sharpencx-corporation-c2a3d0f6/software-engineer-11efe69b?lvk=_jmyfaZ9IUHA6xMuFGzxgA.--M-jPreD6o",
        "posted": null,
        "lastScraped": "2021-04-25T12:54:38.900Z",
        "description": "<div><p>The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.</p><p>Develop functional software in accordance with the defined requirements.</p><p>Collaborate in the process of conceiving, specifying, designing, programming, documenting, testing, and bug fixing involved in creating and maintaining applications, frameworks, or other software components.</p><p></p><p>What we’re looking for:</p><p></p><p>Minimum 2+ years of software development experience using some of the following or similar technologies:</p><p>C#, .NET, ASP.Net, .NET core - front-end, Database, SQL Server - back-end, Entity Framework, Winforms, WPF - front-end.</p><p>Azure devOPS, CI/CD, Angular, React, JavaScript preferred, not required.</p><p>Relational database skills like SQL Server or MySQL or Oracle</p><p>Any deployment technology such as Container Services, Docker, Jenkins, Kubernetes, Elastic Beanstalk, Load Balancer, etc.</p><p>Writing functional software in JavaScript, C#, Python, Java, etc.</p><p>Familiarity with developing web applications deployed to the cloud (Azure, Amazon Web Services AWS, etc. is a plus, not required)</p><p>What Makes this a Great Opportunity?</p><p></p><p>Opportunity to learn and work with live big data and the latest cloud technologies!</p><p>Apply your software development skills working in a collaborative, team environment, with a company that makes a real difference in our everyday lives!</p><p>Highly Competitive Compensation Package!</p><p>Work in a rapidly growing, financially stable company with a highly motivated and successful support team!</p><p><strong>Responsibilities</strong></p><ul><li>Develop quality software and web applications</li><li>Analyze and maintain existing software applications</li><li>Design highly scalable, testable code</li><li>Discover and fix programming bugs</li></ul><p></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in Computer Science or related field</li><li>Development experience with programming languages</li><li>SQL database or relational database skills</li></ul><p>Employment Type</p><p>Contract</p><p></p><p>Edit job description</p><p>Screening question</p><p>Must-have qualifications</p><ul><li><p>Are you willing to undergo a background check, in accordance with local law/regulations?</p><p>Ideal answer: Yes</p></li></ul><p></p><p>Edit screening question</p><p>0Applicants</p><p>0Views</p><p>Get 3x more qualified applicants Promote for free</p><p></p></div>",
        "index": 3,
        "skills": [
            "sql",
            "software engineering",
            "javascript",
            "angular",
            "java",
            "devops",
            "c and c++",
            "machine learning",
            "python"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Clover Developer Relations (Summer Internship)",
        "company": "Fiserv",
        "location": {
            "city": "Sunnyvale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/05eb4630007e722d212112cd0f8f3481?lvk=J1k7ucLbR1-AO-nmMC57zQ.--M-gZDu05w",
        "posted": "2021-04-23T12:54:41.025Z",
        "lastScraped": "2021-04-25T12:54:41.025Z",
        "description": "<div><div><p></p><p><b>Job Title</b></p>Clover Developer Relations (Summer Internship)<p></p><p><b>Job Purpose</b></p><p><b>Clover Developer Relations Internship</b></p><p></p><p><b>Program Overview:</b></p><p>Our Summer Intern program offers hardworking college students an opportunity to go beyond the classroom to develop leadership skills and gain relevant hands- on experience working as part of a global support team with professionals across the enterprise. Additionally, interns will participate in scheduled activities throughout the summer, including sessions with Senior Leaders, site tours, volunteer opportunities, and other social events. Fiserv interns are in session from June 2, 2021 - August 13, 2021 and work approximately 40 hours per week.</p><p></p><p><b>About Clover </b></p><p>Join the Fintech and SaaS revolution that is helping small businesses grow faster. At Clover, you will be part of an entrepreneurial team working in a fast-paced and high growth environment, with the benefits of a parent company, Fiserv, that is the largest payments processor and merchant acquirer worldwide.</p><p>Clover delivers the leading Point of Sale system with an elegant end-to-end solution that incorporates beautiful devices, cloud-based POS software, payments processing, platform API's for third-party developers, and an ecosystem with over 500 apps. The Clover platform delivers solutions in a scalable and modular fashion that powers tiny merchants and large football stadiums alike, supporting millions of transactions daily.</p><p></p><p><b>Clover's Developer Relations Team</b></p><p>Developer <span class=\"long-word\">Relationshelpsthird</span>-party developers build and maintain apps onour App Market. We provide documentation, tutorials, and webinarstoallow third-party developers to understand Clover Platform's APIs and SDKs.</p><p></p><p><b>What does a Clover Innovation Pod Intern do?</b></p><p>As an intern on the Clover Developer RelationsTeam, you will work in a small pod of 2-3 engineers and 1 product manager to own an initiative. With this project, you will build a solution from the ground up that addresses a real need for the Clover Team. It will not only help make our products perform better in the field, but also help productivity of our engineers. You will be working with experienced engineers and gain valuable insights into the software development process in a real-world environment.</p><p></p><p><b>The responsibilities of the Development Platform Engineering Team includes:</b></p><ul><li><p>Reviewing Clover SDKs and existing sample apps.</p></li><li><p>Revising and revamping the sample apps and documentation to enable ease of integration to our platform.</p></li><li><p>Marketing, educatingand publishing these sample apps for wide adoption.</p></li></ul><p></p><p><b>Requirements of the Internship</b></p><ul><li><p>Progress toward completion of bachelor's degree in <b>Computer Science,</b> <b>Information Technology</b>, <b>Management Information Systems </b>or related field by December 2021 / May 2023 with demonstrated academic achievement.</p></li><li><p>Knowledge of one of the following languages: Java, JavaScript, Swift, Python, Ruby</p></li><li><p>Minimum GPA of 3.0 (3.5 or above preferred)</p></li><li><p>Experience educating peers and adapting content to match different learning styles</p></li><li><p>Strategic and creative thinking; distinguished written and oral communications skills</p></li><li><p>Collaborative, team player who can thrive in a fast-paced environment with quickly changing, ambiguous requirements</p></li><li><p>Strong self-starter with an intellectual curiosity</p></li></ul><p></p><p><b>Learn more about Fiserv:</b></p><p></p><p>To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options.</p><p>We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.</p><p></p><p>Life moves fast. And as it does, we know most people aren't thinking about \"financial services\". But we are.</p><p></p><p>We help people and businesses move money and information every minute of every day. Our solutions connect financial institutions, corporations, merchants and consumers to one another, millions of times a day, behind the scenes, reliably and securely.</p><p></p><p>We're Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The company's approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.</p><p></p><p>Our Aspiration is to move money and information in a way that moves the world. As a FORTUNE 500 company and one of FORTUNE Magazine World's Most Admired Companies for the seventh consecutive year, we are committed to excellence and purposeful innovation.</p><p></p><p>We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</p><p></p><p>Explore the possibilities of a career with Fiserv and Find Your Forward with us.</p><p></p><p>#FINT</p><p>Thank you for considering employment with Fiserv.&nbsp; Please:</p><p></p><ul><li>Apply using your legal name</li><li>Complete the step-by-step profile and attach your resume (either is acceptable, both are preferable).</li></ul><p></p><p></p><p>Fiserv is an Equal Employment Opportunity Employer, and it is the Company's policy to make all employment decisions without regard to race, color, religion, creed, age, sex, national origin, veteran status, disability (as long as the individual is able to perform the essential functions of the job with or without reasonable accommodation), and any other characteristic protected by Law.</p></div></div>",
        "index": 4,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "machine learning",
            "python"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Product Engineering Summer Internship",
        "company": "Alpha Measurement Solutions",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/alpha-measurement-solutions-926ce784/product-engineering-summer-internship-047daf59?lvk=v38gYp7xkIi1eZ2xOTSHJw.--M-_YIP4qJ",
        "posted": "2021-04-23T12:54:43.870Z",
        "lastScraped": "2021-04-25T12:54:43.870Z",
        "description": "<div><p><strong>PRODUCT ENGINEERING SUMMER INTERNSHIP PROGRAM</strong></p><p><strong>OVERVIEW</strong></p><p>AlpHa Measurement Solutions is a liquid sensor technology platform serving the complex testing needs of water quality, pharmaceutical, laboratory, and industrial markets with an unmatched combination of precision, reliability, innovation, and flexibility. We are a vertically integrated manufacturer, creating thousands of units and processing several hundred orders and shipments each day for customers throughout the world. We approach the market with three core brands: Analytical Sensors &amp; Instruments (ASI), Van London, and Aurora Scientific Instruments. </p><p><strong>OPPORTUNITY</strong></p><p>AlpHa Measurement Solutions is experiencing aggressive growth through a global platform consolidation and recognizes a need to continuously strengthen its product development capabilities to meet increased demand and support continued growth. We are establishing a Product Engineering Summer Internship to contribute meaningfully to our Engineering and Operations Departments and develop future engineers. Interns will gain exposure and contribute to product design and product management functions as well as product manufacturing analysis and manufacturing software systems including ERP (Enterprise Resource Planning) software. </p><p>Our privately held company has over 100 years of liquid sensing experience, is growing, and currently employs 230 team members in Houston Texas and 140 in Shanghai China. Our global headquarters is conveniently located in Houston at the southwest intersection of I-69 and Sam Houston Tollway, just north of Sugar Land. </p><p>Product Engineering Interns are high visibility roles with the opportunity to engage directly with the senior leadership team of AlpHa Measurement Solutions. </p><p>Classification: Hourly, Full-Time, Monday through Friday, 8:30 AM to 5:00 PM. </p><p><strong>JOB DESCRIPTION </strong></p><p>Summary</p><p>The Product Engineering Interns will be responsible for assisting the engineering and operation teams with product development and management functions such as bill of material creation and validation, manufacturing labor analysis, and product configuration in ERP. We are accepting applications from individuals pursuing a Bachelor’s degree program in <strong>Industrial or Mechanical engineering</strong>. </p><p>Essential Functions</p><p>Reasonable accommodations may be made to enable individuals with disabilities to perform the following essential functions: </p><ul><li>1)Bill of Materials Creation and Validation – Review drawing packages to validate and/or generate engineering bill of materials and routing based upon assembly and work instructions and product design specification. </li><li>2)ERP Routing – Coordinate with operational management to develop and implement manufacturing routing for products. </li><li>3)Costing Analysis – Work with engineering and manufacturing management to analyze material and labor costs for various product lines. </li></ul><p>Required Qualifications and Experience</p><ul><li>Actively pursuing Bachelor’s degree in Industrial or Mechanical Engineering </li><li>Experience using Excel is highly preferred </li><li>Ability to read Engineering CAD drawings </li><li>Excellent written and verbal communication skills </li><li>Strong problem solving and critical thinking capabilities </li></ul><p>AlpHa Measurement Solutions provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, AlpHa Measurement Solutions complies with applicable state and local laws governing nondiscrimination in employment. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. </p><p>AlpHa Measurement Solutions expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of AlpHa Management Solutions’ employees to perform their job duties may result in discipline up to and including discharge.</p></div>",
        "index": 5,
        "skills": [
            "information technology",
            "software engineering",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Technical Support Year-Round Internship",
        "company": "South Atlantic Services",
        "location": {
            "city": "Austin",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/931a4d98a3553b2f4dff13f8dc162f3e?lvk=g_3aiPybDkPxPgU5-XeHIw.--M-VTzsZa7",
        "posted": "2021-04-16T12:54:45.911Z",
        "lastScraped": "2021-04-25T12:54:45.911Z",
        "description": "<div><div><p>Are you a problem solver, explorer, and knowledge seeker - always asking, \"What if?\"</p><p>&nbsp;</p><p>If so, you may be the new team member we're looking for. Because at SAS, your curiosity matters - whether you're developing algorithms, creating customer experiences or answering critical questions. Curiosity is our code, and the opportunities here are endless.</p><p>&nbsp;</p><p><strong>What we do&nbsp; </strong></p><p>We're the leader in analytics. Through our software and services, we inspire customers around the world to transform data into intelligence. Our curiosity fuels innovation, pushing boundaries, challenging the status quo and changing the way we live.</p><p>&nbsp;</p><p><strong>Opportunity</strong></p><p>We're not about coffee runs and boring busywork. Our SAS Summer internship program is focused on development, culture and community. We'll help you grow professionally, thrive in an award-winning work environment and make memorable connections with your co-workers and fellow interns. From contributing analytical code to improving insights for our Fortune 100 customers, the potential to make a real impact is exciting. We're proud to share that the SAS Intern Program was named one the 100 best internship programs in the United States for 2020! WayUp's panel of industry expert judges and public votes, selected us to join the list of top intern programs. &nbsp;Click here to view the list.</p><p><strong>&nbsp;</strong></p><p>The Austin team is responsible for providing top notch support to our customers.&nbsp; That means you will be interacting via email, phone or technical chat on a daily basis, working with some of the brightest people in the industry.</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>We need you to:</strong></p><ul><li>Be enrolled in a degree seeking program and not graduating prior to Summer 2022.</li><li>Have strong communication skills - both written and verbal.</li><li>Be a leader. You're the one sitting in the front row of the class.</li><li>Embrace technology. You geek out over the latest and greatest!</li></ul><p><strong>What we're looking for</strong></p><ul><li>You're curious, passionate, authentic and accountable. These are our values and influence everything we do.</li><li>You're a college student enrolled in an accredited program.</li><li>You've got practical experience inside or outside of school or work. Do you enjoy fixing problems, think engineer, how about cars - ever had to fix your car? &nbsp;We'd love to hear about it!</li><li>Information Technology, Electrical or mechanical engineering, Decisions Science, Computer Science</li><li>IT would be even more amazing if you loved working in a team, learning quickly either by yourself or from others. Must be confident and great at explaining things in simple terms</li><li>Work Hours: Available to work 10-20 hours during the academic year, and full-time hours during the summer of 2021</li></ul><p><strong>&nbsp;</strong></p><p><strong>Why SAS</strong></p><ul><li>We love living the #SASlife and believe that happy, healthy people have a passion for life, and bring that energy to work. No matter what your specialty or where you are in the world, your unique contributions will make a difference.</li><li>Our multi-dimensional culture blends our different backgrounds, experiences, and perspectives. Here, it isn't about fitting into our culture, it's about adding to it - and we can't wait to see what you'll bring.</li></ul><p><strong>Additional Information</strong></p><p>To qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status. SAS is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, religion, gender, sexual orientation, gender identity, age, national origin, disability status, protected veteran status or any other characteristic protected by law. Read more:&nbsp;Equal Employment Opportunity is the Law. Also view the supplementEEO is the Law, and the noticePay Transparency&nbsp;</p><p>&nbsp;</p><p>Equivalent combination of education, training and experience may be considered in place of the above qualifications. The level of this position will be determined based on the applicant's education, skills and experience.Resumes may be considered in the order they are received.SAS employees performing certain job functions may require access to technology or software subject to export or import regulations. To comply with these regulations, SAS may obtain nationality or citizenship information from applicants for employment. SAS collects this information solely for trade law compliance purposes and does not use it to discriminate unfairly in the hiring process.&nbsp;</p><p>&nbsp;</p><p>&nbsp;<em>All valid SAS job openings are located on the Careers page at&nbsp;www.sas.com. SAS only sends emails from verified \"sas.com\" email addresses and never asks for sensitive, personal information or money. Should you have any doubts about the authenticity of any type of communication from, for, or on behalf of SAS, please contact us at&nbsp;<span class=\"long-word\">Recruitingsupport@sas.com</span>&nbsp;before taking any further action.</em></p></div></div>",
        "index": 6,
        "skills": [
            "information technology",
            "software engineering",
            "machine learning"
        ],
        "contact": "Recruitingsupport@sas.com",
        "remote": false
    },
    {
        "position": "Software Engineer Internship - Paid and Remote",
        "company": "SquareTrade",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ad6cf21be241856d708d654f27ef8d67?lvk=DoN_GNe3rcTRCFYntHi6Bg.--M-X8SzoZw",
        "posted": "2021-04-22T12:54:48.034Z",
        "lastScraped": "2021-04-25T12:54:48.034Z",
        "description": "<div><div><div><p></p> Company Description </div><div><p>SquareTrade is the fastest growing company of its kind. We're revolutionizing a $30b industry with service innovation and attention to customer satisfaction. We partner with some of the largest, most sophisticated retailers and carriers in the world (Amazon, Walmart, The Home Depot to name a few), consistently win industry awards, have received tens of thousands of 5-star reviews... and we're just getting started. A member of the Allstate family, SquareTrade has headquarters in San Francisco and London.&nbsp;We are currently expanding in Europe and Asia Pacific, including Japan and Australia.</p></div><div><p></p> Job Description </div><div><p>We are looking for a curious, passionate, and detail-oriented individual to join us this summer as a Software Engineer.</p><p>In this role, you will write software that will be used by our customers in production and has meaningful impact to the business. You will collaborate and work closely with other engineering groups to accomplish tasks and achieve project goals. Additionally, you will receive technical mentorship and feedback through code reviews and one on one meetings.</p><p><br><strong>WHAT'S GREAT ABOUT THIS ROLE?</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You will be working for a fast-paced and dynamic company with a \"start-up feel\"</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This will be a rotational program through the teams within the customer facing applications engineering org where you'll be learning and contributing on day one</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The program will offer opportunities to showcase and highlight your hard and soft skillsets along with providing you with business context and exposure to upper management</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You will have regularly scheduled checkpoints with your mentors and team members throughout the program to help guide you in the direction that best suits your abilities and interests</p><p>&nbsp;</p><p><strong>RESPONSIBILITIES:</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work closely with your scrum teams to deliver product features for the business.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Attend regularly scheduled planning meetings and contribute ideas and provide status updates.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Regularly check-in with your mentors to discuss personal goals and receive feedback.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Have fun and learn in a top-notch engineering environment!</p></div><div><p></p> Qualifications </div><div><p><strong>WHAT DOES OUR IDEAL CANDIDATE LOOK LIKE?</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Team player with documented experience on team-based side projects or classwork</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Active listener who is open to direct feedback and learns from and fixes mistakes quickly</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Strong fundamentals in Computer Science along with programming experience and familiarity with Java or similar OOP programming languages (Python, Ruby, C++, etc)</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to learn new, large scale systems and form an understanding of them quickly through independent research</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A thought leader;&nbsp; vocal and willing to regularly contribute ideas to team discussions</p><p><strong>&nbsp;&nbsp;</strong></p><p><strong>MINIMUM REQUIREMENTS:</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Currently pursuing college degree related to Computer Science, Software Engineering,&nbsp; or related fields</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to work and deliver in a fast-paced, team environment</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Technology, retail and e-commerce enthusiast</p></div><div><p></p> Additional Information </div><div><p>All your information will be kept confidential according to EEO guidelines.</p><p>The Team:&nbsp; <span class=\"long-word\">http://www.squaretrade.com/leadership</span> &nbsp;<br>&nbsp;<br>SquareTrade is an Equal Opportunity Employer and complies with the San Francisco FCO</p><p>Our commitment to Diversity, Equity &amp; Inclusion</p><p>We're committed to growing high-performance teams where people can bring their whole-selves to work, and creating a greater force for good within our company, industry, and cities. We strive to hire and cultivate diverse teams, and respectfully challenge everyone to do their best regardless of background and experience. We believe that true innovation happens when everyone has the tools, resources, and opportunity to excel.</p></div>Qualifications: WHAT DOES OUR IDEAL CANDIDATE LOOK LIKE? Team player with documented experience on team-based side projects or classwork Active listener who is open to direct feedback and learns from and fixes mistakes quickly Strong fundamentals in Computer Science along with programming experience and familiarity with Java or similar OOP programming languages (Python, Ruby, C++, etc) Ability to learn new, large scale systems and form an understanding of them quickly through independent research A thought leader; vocal and willing to regularly contribute ideas to team discussions MINIMUM REQUIREMENTS: Currently pursuing college degree related to Computer Science, Software Engineering, or related fields Ability to work and deliver in a fast-paced, team environment Technology, retail and e-commerce <span class=\"long-word\">enthusiastResponsibilities:</span> We are looking for a curious, passionate, and detail-oriented individual to join us this summer as a Software Engineer. In this role, you will write software that will be used by our customers in production and has meaningful impact to the business. You will collaborate and work closely with other engineering groups to accomplish tasks and achieve project goals. Additionally, you will receive technical mentorship and feedback through code reviews and one on one meetings. WHAT'S GREAT ABOUT THIS ROLE? You will be working for a fast-paced and dynamic company with a \"start-up feel\" This will be a rotational program through the teams within the customer facing applications engineering org where you'll be learning and contributing on day one The program will offer opportunities to showcase and highlight your hard and soft skillsets along with providing you with business context and exposure to upper management You will have regularly scheduled checkpoints with your mentors and team members throughout the program to help guide you in the direction that best suits your abilities and interests RESPONSIBILITIES: Work closely with your scrum teams to deliver product features for the business. Attend regularly scheduled planning meetings and contribute ideas and provide status updates. Regularly check-in with your mentors to discuss personal goals and receive feedback. Have fun and learn in a top-notch engineering environment!</div></div>",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "java",
            "c and c++",
            "machine learning",
            "python"
        ],
        "remote": true
    },
    {
        "position": "Remote Software Engineer (SCRUM Master)",
        "company": "Jobot",
        "location": {
            "city": "Pasco",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/jobot-39b82e74/remote-software-engineer-scrum-master-8faaea81?lvk=0407XUOf7n58VSSOoCOyRQ.--M-WpHk0UJ",
        "posted": "2021-04-22T12:54:52.452Z",
        "lastScraped": "2021-04-25T12:54:52.452Z",
        "description": "<div><b>Calling all Software Engineers who are also SCRUM Masters</b><br><br>This Jobot Job is hosted by: Mordy Ornguze<br>Are you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.<br>Salary: $120,000 - $150,000 per year<br><br><p><b>A bit about us:</b></p><br><br>We are comprised of professional engineers who love what we do and have fun doing it! We have earned the trust of our customers and peers, and ... we are growing! We are an employee managed company that empowers our team to make decisions and seek the best solutions for our customers. We operate as a family and passionately protect our company culture. We thrive on challenging problems with mission critical applications. We do not shy from asking or answering hard questions. We value active voices and diverse teams.<br><br>Things we are doing:<br><br>· Created new insights for U.S. financial institutions into their massive amounts of data.<br>· Provided real-time, enterprise solutions on enterprise architectures for DoD and Military strategic and tactical decision making<br>· Developed federal, state, and local law enforcement forensic investigations leveraging OSINT<br><br><p><b>Why join us?</b></p><br><ul><li> Competitive Base Salary!</li><li> Comprehensive benefits package to include health benefits</li><li>Unlimited paid time off</li><li>internal employee micro-bonus program</li><li> Paid time off</li><li> 401K matching</li><li> Tuition reimbursement</li></ul><br><br><p><b>Job Details</b></p><br><br>Are you an awesome Software Engineer with strong development skills AND SCRUM Master experience? We are looking for a skilled Developer who will help facilitate the software development lifecycle (SDLC) by installing, maintaining, and troubleshooting test and production environments as well as help. This will be a REMOTE position. You will join our talented team of engineers who deliver mission critical capability to our clients and ensure the highest levels of availability, performance and security. You should have a background in IT, systems administration, computer systems engineering, or systems engineering and analysis. We also expect you to demonstrate superb technical competency and strong teamwork skills.<br><br>Technologies You’ll Be Using<br>· Backend: Java, Scala, Vertica, PostgreSQL, Go, Groovy, Coffeescript, Python, Shell, Vertica<br>· Front End UX : Typescript, Angular, JavaScript, Handlebars<br>· Environment: Linux, AWS, Puppet, Nagios, Foreman, PCF (Pivotal Cloud Foundry)<br>· Opensource frameworks: Spark, Vertx, Node.js, Play, Hadoop, Hive SpringBoot<br>· Builds and support provided with: Git, BitBucket, Gradle, Airflow, Circle CI, Docker, Confluence, Jira, Rundeck, Concourse, Jenkins<br><br>Your Qualifications:<br>· Unrestricted right to work in the US without requiring sponsorship<br>· The ability to pass a thorough background check and a drug test<br>. Applied SCRUM Master experience<br>· Bachelors Degree in Computer Science, Computer Engineering, or similar discipline AND 5 years applicable experience<br>· Strong software engineering and software development skills<br>· Strong systems administration skills in Linux<br>· Strong database skills including schema management and SQL development<br>· Problem solving skills and ability to break down complex concepts<br>· Great time management and interpersonal skills<br>· Excellent verbal and written communication skills for both technical and non-technical personnel<br>· Detail-oriented and a team-player<br>· A creative thinker and enjoy a collaborative environment<br>· Work independently and make decisions under minimal supervision<br><br>You Might Also Have:<br>· ACTIVE SECRET/TOP SECRET government clearance is preferred (not required for this position)<br>· SCRUM Master certification (or applied experience)<br>· Some mobile development and/or UX<br>· Experience with Scala backend APIs, and a sense for the finer points of the Mobile user experience<br>· AWS (Amazon Web Services) Certifications (Solutions Architect, Developer), and/or any Specialties<br>· Experience with EC2 (Elastic Computer Cloud), RDS (Relational Database Service), S3 (Simple Storage Service), VPC (Virtual Private Cloud), EMR (Elastic Map Reduce)<br>· Familiarity with data structures, storage systems, cloud infrastructure, front-end frameworks<br>· Understanding of how technical decisions impact the user of what you’re building<br>· Proficiency with object oriented languages<br>· Adaptability in a rapidly changing environment with dynamic objectives and iteration with users<br>· Enjoy continuously learning (we realize making mistakes means progress)<br>· Actively seeking opportunities to grow and develop<br><br>Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.</div>",
        "index": 8,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "angular",
            "java",
            "scala",
            "javascript"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "2021 Nestle USA Digital Analytics Internship (Remote)",
        "company": "Nestle USA",
        "location": {
            "city": "Arlington",
            "state": "Virginia",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/246a1fd542d3e4dbc0061097943ee7c1?lvk=T39oviHXxblJjUYH3hT9JQ.--M-mkyC05k",
        "posted": "2021-04-16T12:54:56.715Z",
        "lastScraped": "2021-04-25T12:54:56.715Z",
        "description": "<div><div><p>You know us as the food and beverage company behind a lot of your favorites like Stouffer's, Nesquik, Toll House, and Lean Cuisine, as well as new discoveries like Sweet Earth and Chameleon Cold-Brew coffee. Across our organization, we're building a workplace where collaboration is essential, courage is rewarded, speed is encouraged, and agility is the norm to delight our consumers every single day!</p><p>&nbsp;</p><p>Here at Nestle USA, you are empowered to become a student of the business and deliver the best to our consumers. We're inviting forward-thinking and courageous future leaders to embrace an entrepreneurial approach and start their journey of growth.</p><p>&nbsp;</p><p>If you're a current technologist and analytically focused graduate student eager to make an impact on an enormous scale, take strides into greatness by joining Nestle USA.</p><p>&nbsp;</p><p><b>What To Expect</b></p><p>&nbsp;</p><p>Our 12 week paid internship with the Digital Acceleration Team is an opportunity to drive high-visibility, high-impact global outcomes for Nestle. The environment will challenge you to think differently about problem solving and is a phenomenal way to get a feel for working at Nestle. You will have hands on involvement with a significant business project from start to finish and get experience you won't find in the classroom. You will apply the analytical and coding knowledge you have gained in school in a real world setting, while being supported by a team that includes a project manager, buddy, and mentor. You will have an opportunity to develop your professional network and extend your own portfolio of work.&nbsp;</p><p>&nbsp;</p><p>Our projects are challenging, engaging and represent current business challenges that need a fresh perspective. You showcase the work you have done on your project at an end-of-internship presentation to senior leaders in the Digital organization. The internship experience also provides interaction with senior management and collaboration with team members across the business.&nbsp;</p><p>&nbsp;</p><p>Interns experience life at Nestle in a hands-on environment. We encourage students to question why we do things the way we do, provide fresh ideas, and improve processes and products. You'll be part of the action and working from day 1.</p><p>&nbsp;</p><p><b>After Your Internship</b></p><p>&nbsp;</p><p>Our intern program is designed to bring High Achievers into the Digital organization at Nestle USA and is intended to be a feeder into a full time position. We match your skill sets and passion with positions in our Digital organization. High performing summer interns are offered the opportunity to join the Digital organization after graduation and start their careers at Nestle.</p><b>Education Requirements</b><ul><li> Graduate students pursuing Master of Science in Data Science, Computer Science, Engineering (Operations Research, Industrial), Economics, Applied Mathematics and/or Statistics. Graduating between December 2021 and June 2022.&nbsp; </li><li> Showcases a strong level of academic success (Cumulative GPA 3.0 ) </li></ul> &nbsp; <b>Preferred Skills</b><ul><li> Coding skills for analytics and data analysis (SQL, R Python, etc.) </li><li> Experience with large data sets.&nbsp; </li><li> Results focused and can clearly speak to projects they've executed.&nbsp; </li><li> Passionate lifelong learners who are agile and stay abreast of the evolving technology and data landscape.&nbsp; </li><li> Embraces courage to propose new ways of operating and challenges the status quo. </li><li> Leverages their intellectual curiosity to aid in problem solving and distills complex information into simple ideas </li><li> Resourceful, self-starter who applies varied means to uncover answers and arrive at conclusions.&nbsp; </li><li> Fire from within to execute and deliver a successful end product and do it better than the competition.&nbsp; </li><li> Strong communicators who encourage others and excel in a team environment. </li></ul> &nbsp; <b>Perks</b><ul><li> Competitive compensation package.&nbsp; </li><li> Exposure to senior leadership through project presentation and mentoring </li><li> Volunteer in a community service opportunity with one of Nestle's Share Valued Organizations (e.g. Boys &amp; Girls Club of America &amp; Nestle Adopt-A-School Program) </li><li> Potential employment opportunities after completion of degree&nbsp; </li></ul> &nbsp; <strong>The Nestle Companies are an equal employment opportunity and affirmative action employer seeking diversity in qualified applicants for employment.&nbsp; All applicants will receive consideration for ...</strong></div></div>",
        "index": 9,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "networks",
            "python",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Ticketing Services Internship",
        "company": "PGA TOUR",
        "location": {
            "city": "Boca Raton",
            "state": "Florida",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/113d88c4563e6df102ca5972f9510635?lvk=Pn-ptRxRn6_zhd8-CKrnlw.--M-mjViFl-",
        "posted": "2021-04-21T12:55:03.975Z",
        "lastScraped": "2021-04-25T12:55:03.975Z",
        "description": "<div><div><div><strong>About the internship:</strong></div><div>At the Boca Raton Champions Golf Charities (BRCGC), the host organization of the TimberTech Championship, we are passionate about growing the game of golf and celebrating the City of Boca Raton. The TimberTech Championship, a PGA TOUR Champions tournament eligible to professional golfers age 50 and over, is the semifinal playoff event in the season-long Charles Schwab Cup competition held November 1 - 7, 2021 at the Old Course at Broken Sound.</div><div></div><div><strong>Position Summary:</strong></div><div>This internship will focus on assisting the launch of a new ticket vendor partnership, educating our fanbase of our offerings, and driving attendance. This candidate will coordinate package execution with the ticket vendor, ensure the greatest level of customer service across all touchpoints by communicating the highest degree of courtesy, professionalism, thoughtfulness, and enthusiasm.</div><div></div><div><strong>Responsibilities:</strong></div><ul><li>Assist the development of ticket types, pricing plan, promotions, and distribution</li><li>Make product and process improvements that are designed to deliver amazing customer experiences</li><li>Leverage ticket vendor analytics to optimize decisions</li><li>Develop fan journey experiences including but not limited to on-site activations and shot spots </li><li>Support on-site box office and will call operations</li><li>Coordinate ticketing procedures including but not limited to terms and conditions and will-call protocol</li><li>Serve as a source of information for all spectators, managing in person questions, calls, and emails</li><li>Resolve customers' service or billing complaints by performing activities such as refunding purchases or adjusting bills</li><li>Complete contract forms, prepare change of address records, or issue service discontinuance orders</li></ul><div></div><div><strong>Qualifications:</strong></div><ul><li>Be knowledgeable about sports/event industry trends and use this knowledge to assist drive solutions for our product and our portfolio</li><li>Desire to work in a fast-paced environment while collaborating with team members</li><li>Organizational skills required to multitask, develop timelines, and meet deadlines</li><li>Strong verbal and clear writing presentation</li><li>Proficiency in Microsoft Office</li><li>1.5+ years of coursework in Computer Science, Sport Administration, Hospitality/Event Management, Business, or a related field</li></ul><div><br></div><div><strong>Internships are available to college students who are eligible to receive academic credit</strong></div><ul><li>Applicants should reside near Boca Raton or be willing to commute</li><li>A cover letter and resume must be submitted as attachments with the application</li></ul><div><br></div><div>*Please note internships are unpaid and students must receive academic credit. *BRGCGC is a not-for-profit, tax exempt 501(c)(3) organization who promotes the game of golf through the TimberTech Championship *We are an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. </div>Employment Type: Intern</div></div>",
        "index": 10,
        "skills": [
            "c and c++",
            "project management",
            "game design",
            "information technology",
            "cybersecurity"
        ],
        "compensation": "unpaid",
        "remote": false
    },
    {
        "position": "SW Engineer",
        "company": "CyberCoders",
        "location": {
            "city": "Ridgeland",
            "state": "Mississippi",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/cybercoders-06af0033/sw-engineer-e6b66e6d?lvk=B2QK2Hjq07stXaep3Xe7YQ.--M-c9F-1VZ",
        "posted": "2021-04-16T12:55:11.315Z",
        "lastScraped": "2021-04-25T12:55:11.315Z",
        "description": "<div>SW Engineer <div>If you are a SW Engineer with experience, please read on!This position is available as a Software Developer I- III; depending on experience<br><br>Work in the Billing and Corporate Applications department, Corporate Applications team to provide and maintain highly specialized software solutions. Perform a variety of technical work in the front end or back end development of new applications including analysis, design, coding, testing, debugging, and documenting as well as support of current applications and systems.</div>What You Will Be Doing<div>Development:<br><br>Demonstrated ability and solid work ethic to perform technical tasks including analysis, design, coding, debugging, and implementation of software applications.<br><br>Write new programs or create modifications to existing applications as necessary based on project requirements.<br><br>Follow established standards for the design, coding, and testing of software.<br><br>Testing:<br><br>Assist in performing unit and integration testing, present final test results, and obtain agreement and approval.<br><br>Work with users to validate system testing and conformity with functional requirements.<br><br>Implementation and Support:<br><br>Follow appropriate change management and implementation procedures.<br><br>Research, propose, and implement solutions to production issues and trouble tickets as assigned by Systems Analyst and/or Manager.<br><br>Prepare program and/or process documentation.<br><br>Perform additional duties as assigned by Systems Analyst and/or Manager.</div>What You Need for this Position<div>Baccalaureate degree in Information Systems, Computer Science, or equivalent experience in software development.<br><br>Extensive knowledge of commonly used concepts, practices, and procedures within the software development field is required.<br><br>Extensive knowledge of standard web languages (i.e. HTML, CSS, JavaScript, XML and JSON) required.<br><br>Excellent verbal and written communications skills are required.<br><br>PREFERRED<br><br>Extensive software development experience and experience in web-based technologies and in Java, SQL, Spring Framework, Web Services (RESTful and SOAP), UNIX and Windows operating system experience preferred.</div><div>So, if you are a SW Engineer with experience, please apply today!</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br><b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b><br><br> All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. <br><br><b>Your Right to Work</b> – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</div>",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "javascript",
            "java",
            "web development"
        ],
        "remote": false
    },
    {
        "position": "Data Scientist Summer Intern",
        "company": "Fiserv",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0be043ef8ff0355255498895a4533afc?lvk=ylwNGabbcJXTSMYSIeqRRg.--M-8PIqvd3",
        "posted": "2021-04-16T12:55:13.315Z",
        "lastScraped": "2021-04-25T12:55:13.315Z",
        "description": "<div><div><p></p><p><b>Job Title</b></p>Data Scientist Summer Intern<p></p><p><b>Job Purpose</b></p><p><b><b>Data Science Internship</b></b></p><p></p><p><b>Program Overview:</b></p><p>Our Summer Intern program offers hardworking college students an opportunity to go beyond the classroom to develop leadership skills and gain relevant hands on experience working as part of a global support team with professionals across the enterprise. Additionally, interns will participate in scheduled activities throughout the summer, including sessions with Senior Leaders, site tours, volunteer opportunities, and other social events. Fiserv interns are in session from June 2, 2021 - August 13, 2021 and work approximately 40 hours per week.</p><p></p><p><b>About Ondot</b></p><p>Ondot, now part of Fiserv, has helped over 4,500 financial institutions modernize their credit and debit cards with digital technology. Over the last 10 years, Ondot has won numerous awards for its technology, and is excited to bring this innovation to Fiserv.</p><p></p><p><b>What does the Data Science team do?</b></p><p>As a member of the Data Scientist team, you will have the opportunity to work on real industry use cases, use your data science skills to discover data insights for card holders based on the analysis of a variety of data context, including card data, transaction data, merchant data, and location data, and build Data Insight products that bring intelligence to the consumer's digital card management and card spending experience</p><p></p><p><b>As a Data Scientist you will: </b></p><p>The candidate will work on improving the Transaction Enrichment (TE) solution, and apply exploratory data analysis, statistical algorithms and machine learning algorithms to cleanse raw payment transaction data and enrich it with additional attributes, such as merchant names, locations, merchant contacts, merchant categories, logos, etc. The responsibilities include:</p><ul><li><p>Work with managers and cross-functional product teams to create the prioritized list of data use cases and data challenges</p></li><li><p>Conduct independent data analysis to gain thorough understanding of the main characteristics of the data, and identify the main gaps in algorithms or the main data issues to resolve</p></li><li><p>Leverage data warehousing and visualization methods to create dashboards and tools for effectively performing data analysis and model evaluation</p></li><li><p>Recommend statistical or machine learning methods to solve the data issues</p></li><li><p>Process data from multiple data sources to create clean and normalized datasets for training, validation and testing</p></li><li><p>Execute model training, hyperparameter tuning, feature selection, and performance evaluation</p></li></ul><p></p><p><b>Requirements of the Internship:</b></p><ul><li><p>Progress toward completion of Bachelor's or Master's degree in Mathematics, Statistics, Data Science, Computer Science, or other related fields. by December 2021/ May 2023 with demonstrated academic achievement. - <b>Master's preferred</b></p></li><li><p>Minimum GPA of 3.0 (3.5 or above preferred)</p></li><li><p><b>Must be passionate about data</b>: you feel a strong sense of achievement when you discover the hidden patterns within the data, the exceptions not dealt with before, the beauty of feature engineering, and the new model yielding best performance without overfitting</p></li><li><p>Experience or knowledge of data processing skills and abilities to deal with large amount of data</p></li><li><p>Experience with SQL, Python, and/or data processing pipeline</p></li><li><p>Experience or knowledge with machine learning models, such as classification, NLP, NER, neural network, and other deep learning algorithms using Tensorflow or PyTorch</p></li><li><p>Experience or knowledge in feature engineering, hyperparameter tuning, and model training</p></li><li><p>Extremely attentive to metric and details: precision, recall, accuracy, outliers, anomalies, trends, etc.</p></li><li><p>Respect data privacy and data governance rules and regulations</p></li><li><p>Ability to communicate clearly with different stakeholders</p></li><li><p>A team player who can learn and grow with other team members, while contributing to the success of the product</p></li></ul><p></p><p><b>Learn more about Fiserv:</b></p><p>To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options.</p><p></p><p>We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.</p><p></p><p>Life moves fast. And as it does, we know most people aren't thinking about \"financial services\". But we are.</p><p></p><p>We help people and businesses move money and information every minute of every day. Our solutions connect financial institutions, corporations, merchants and consumers to one another, millions of times a day, behind the scenes, reliably and securely.</p><p></p><p>We're Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The company's approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.</p><p></p><p>Our Aspiration is to move money and information in a way that moves the world. As a FORTUNE 500 company and one of FORTUNE Magazine World's Most Admired Companies for the seventh consecutive year, we are committed to excellence and purposeful innovation.</p><p></p><p>We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. </p><p></p><p>Explore the possibilities of a career with Fiserv and Find Your Forward with us.</p><p></p><p>#FINT</p><p></p><p>Thank you for considering employment with Fiserv.&nbsp; Please:</p><p></p><ul><li>Apply using your legal name</li><li>Complete the step-by-step profile and attach your resume (either is acceptable, both are preferable).</li></ul><p></p><p></p><p>Fiserv is an Equal Employment Opportunity Employer, and it is the Company's policy to make all employment decisions without regard to race, color, religion, creed, age, sex, national origin, veteran status, disability (as long as the individual is able to perform the essential functions of the job with or without reasonable accommodation), and any other characteristic protected by Law.</p></div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "information technology",
            "sql",
            "data visualization",
            "networks",
            "deep learning",
            "project management",
            "python"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "NANA SHAREHOLDER INTERNSHIP - Natural Resources Intern - Paid Internship (Open to NANA Shareholde...",
        "company": "NANA REGIONAL CORPORATION",
        "location": {
            "city": "Anchorage",
            "state": "Alaska",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d4bcc8ba2d0b9a1349c93e984edf52b1?lvk=ojdZS6USwgA9POrHb3IFGQ.--M-XTuTb17",
        "posted": "2021-04-17T12:55:42.652Z",
        "lastScraped": "2021-04-25T12:55:42.652Z",
        "description": "<div><div><p>Summary </p><p>The Natural Resources Intern will participate in multiple facets of the natural resources department work.&nbsp; Helping to learn about and tell the story of the importance of responsible natural resource development to NANA by participating in multiple department activities.&nbsp; The majority of the work will be in the Anchorage office, potentially including field work in the NANA region.&nbsp; </p><p>&nbsp;</p><p>The successful candidate will be able to take direction from multiple sources and use analytical skills to take the information collected to help put together a timeline and history of NANA's natural resources story.&nbsp; Helping to analyze historical data and interact with department members to help catalog and record what the department has done over the last 30 years, starting with ANCSA land selections and the Red Dog Mine.&nbsp; Learning about the various phases of a mining project.&nbsp; Participating in departmental meetings and shadowing department members on certain meetings.&nbsp; Including adding to, and utilizing archived data and items.</p><p>&nbsp;</p><p>The field work could support various programs currently being overseen by the department and may include multiple trips to communities in the NANA region including overnight stays. Examples of potential activities include: gravel pit remediation, seed harvest studies, and early stage mineral exploration.&nbsp; Anchorage office work will include analysis and write-ups for any of the field activities performed.&nbsp; </p><p>&nbsp;</p><p>Essential Duties and Responsibilities</p><ul><li>Ability to communicate clearly in both verbal and written communication.</li><li>Ability to analyze and interpret both quantitative and qualitative data.</li><li>Attention to detail.</li><li>This position has no supervisory responsibilities.</li><li>Other duties that are pertinent to the department or unit's success also may be assigned. </li><li>Ability to take direction and feedback.</li></ul><ul><li>Must be a NANA shareholder.&nbsp; NANA shareholders own stock in NANA Regional Corporation, Inc.</li><li>Must be currently enrolled in college and completed at least 1 year.</li><li>Must be currently pursuing or interested in pursuing a degree in Science, Technology, Engineering, or Mathematics (STEM) </li><li>Intermediate to advanced computer skills in Microsoft Office.</li></ul><p>&nbsp;</p><p>Preferred Requirements</p><ul><li>Curriculum focus on Science, Engineering or Mathematics.</li><li>Having participated in the GeoFORCE and/or ANSEP programs.</li></ul><p>&nbsp;</p><p>Competencies </p><ul><li>Desire to work with people.</li><li>Ability to encourage, motivate, and engage people.</li><li>Ability to analyze and problem solve.</li><li>Must have excellent oral and written communication, interpersonal and listening skills.</li><li>Ability to be flexible and adapt to change.</li><li>Must have a personality suitable to this position requiring strong teamwork skills.</li><li>Ability to prioritize and organize.</li><li>Ability to meet deadlines.</li></ul><p>&nbsp;</p><p>Working Conditions and Physical Requirements </p><p>Weather: Indoors - environmentally controlled; requires most or all work to be done inside.</p><p>Noise level: The noise level in the work environment is usually that of a standard office atmosphere.</p><p>Description of environment: Office building with standard office environment.</p><p>Physical requirements:&nbsp; Employee is required to occasionally lift and/or move up to 25 lbs. Frequently required to sit, stand, walk, use hands/fingers to handle or feel, climb, stoop, kneel, crouch or crawl, talk/hear, see, taste/smell, and carry weight/lift.</p><p>Travel: Employee may travel up to 25% to various locations within the U.S. and/or remote locations and may be required to use alternative modes of transportation, including but not limited to snow machines, boats, small airplanes and ATVs. </p><p>&nbsp;</p><p>Required Language</p><p>Equal Opportunity <span class=\"long-word\">Employer/Shareholder</span> Preference </p><p>NANA Regional Corporation is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected status or any other characteristic protected by applicable law. NANA grants employment preference to shareholders of NANA and their spouses and descendants to the extent allowed by law.</p><p>&nbsp;</p><p>It is NANA Regional Corporation policy to conduct background checks, drug testing and a physical assessment, as applicable, once an offer has been accepted, in accordance with company and/or contract requirements.</p><p>&nbsp;</p><p><i>Accommodation Request</i></p><p>If you are a job seeker with a disability and require accessibility assistance or an accommodation to apply for one of our jobs, please submit a request by telephone or via email. In order to appropriately assist you with an accommodation, we ask that you please specify the assistance needed in order to access our jobsite and post for a position. The dedicated email and telephonic options are listed below and are reserved only for individuals with disabilities needing accessibility assistance.</p><p>&nbsp;</p><p>To request an accommodation by telephone, contact us at: 1-800-478-2000</p><p>To request an accommodation by email, contact us at <span class=\"long-word\">recruiting@nana.com</span></p></div></div>",
        "index": 13,
        "skills": [
            "machine learning",
            "information technology",
            "project management",
            "software engineering"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "contact": "recruiting@nana.com, 1-800-478-2000",
        "remote": true
    },
    {
        "position": "JR0163021 - Computer Architecture Graduate Internship",
        "company": "Intel",
        "location": {
            "city": "Hillsboro",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2de6fb7e6af4252c53dc88879d398170?lvk=Bal7tht7u8QE2hn-W6GnNg.--M-VSTGy1g",
        "posted": "2021-04-16T12:55:47.629Z",
        "lastScraped": "2021-04-25T12:55:47.629Z",
        "description": "<div><p>Job ID: JR0163021 Job Category: Intern/Student Primary Location: Hudson, MA US Other Locations: US, California, Santa Clara;US, Oregon, Hillsboro;US, Texas, Austin Job Type: Intern Computer Architecture Graduate Internship Job Description Responsibilities may be quite diverse of a technical nature US experience and education requirements will vary significantly depending on the unique needs of the job. Responsibilities will include simulating Intel-based platforms to study and categorize the effects of errors on running systems and workloads. Intel internship job assignments are usually for the summer or for short periods during breaks from school Qualifications Must be pursuing a PhD degree in Electrical Engineering, Computer Engineering, Computer Science. </p><p>Minimum of 3 months experience with software and scripting programming languages (ie. C/C++, Python, Perl, etc.) Minimum of 3 months experience with computer architecture Preferred Qualifications: Knowledge of Intel Architecture Intel Internship in Architecture Organization Coursework or project work experience dealing with soft errors or reliability modeling. Working knowledge of Linux and tools such as GDB, Git, Shell scripts Knowledge of cache hierarchies and protocols specially in context of new emerging memory technologies Inside this Business Group Intel Architecture, Graphics, and Software (IAGS) brings Intel's technical strategy to life. </p><p>We have embraced the new reality of competing at a product and solution level-not just a transistor one. We take pride in reshaping the status quo and thinking exponentially to achieve what's never been done before. We've also built a culture of continuous learning and persistent leadership that provides opportunities to practice until perfection and filter ambitious ideas into execution. </p><p>Other Locations US, California, Santa Clara;US, Oregon, Hillsboro;US, Texas, Austin Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. <span class=\"long-word\">USInternJR0163021Hudson</span></p></div>",
        "index": 14,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "c and c++",
            "machine learning",
            "project management",
            "virtual reality"
        ],
        "remote": false
    }
]