[
    {
        "position": "Marketing Internship",
        "company": "The Forte Group",
        "location": {
            "city": "Pasadena",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/the-forte-group-c789c489/marketing-internship-c43a754b?lvk=zvosZ98PoAp80HIPS6124g.--M3G2U5Gec",
        "posted": "2018-09-14T04:31:42.603Z",
        "lastScraped": "2021-06-10T04:31:42.603Z",
        "description": "<div><p><strong>Executive Assistant and Marketing Intern </strong></p><p><strong>ABOUT US: </strong></p><p>We are a well established financial services company and insurance agency in Pasadena, seeking a paid or non-paid intern, for hands-on business experience. Founded in 1981, we specialize help people retire safely, educating our clients how to generate significantly more income in retirement.</p><p><strong>OUR OBJECTIVE: </strong></p><p>To identify a candidate who is bilingual and fluent in English and Spanish, detailed oriented and excited to learn about <span class=\"long-word\">investment/retirement</span> options most never learn. This position is always exciting, working on a myriad of different projects such as: communication with clients, client reviews, updates to social media platforms, zoom meetings, marketing correspondence with CPAs and business owner‘s, website edits with simple software, MailChimp, and creating short, educational YouTube videos.</p><p>You will learn about Wall Street, Tax Sheltered Annuities, Fixed Indexed Annuities, Long Term Care, Indexed Universal Life (tax free income), pros/cons of 401ks, Pension maximization, CalSTRS/CalPERS reviews, Deferred Sales Trusts (defer/reduce capital gains taxes), Cost Segregation, Monetized Installment Sales. <em>We are highly focused on educating and assisting our clients, and having a good time doing so. </em></p><p><strong>Position: </strong>executive assistant and marketing intern</p><p><strong>Location:</strong> Pasadena/virtual</p><p><strong>Hours:</strong> can vary, 10-15 hours/week</p><p><strong>Required competencies:</strong> highly organized, task oriented, strong verbal, writing, and computer skills, including Word, Power Point and Excel, and the ability to work effectively on their own.</p><p><strong>Position summary:</strong> one key objective is the Who Not How principle by Dan Sullivan, working alongside and under the guidance of the owners to carry out the tasks and responsibilities outlined. This is an excellent opportunity to obtain highly useful financial and business skills, not taught in school.</p><p><strong>Qualifications: </strong>be<strong> </strong>creative, sincere, genuine, reliable, eager to learn and help people</p><p><strong>How To Apply: Please </strong>submit your resume to Thomas R. Cassidy at <span class=\"long-word\">tcassidy@fortegroup1981.com</span></p></div>",
        "index": 1,
        "skills": [
            "machine learning",
            "project management",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "tcassidy@fortegroup1981.com",
        "remote": false
    },
    {
        "position": "Paid Internship - Water Resource and Land Use Planning",
        "company": "SWALE Inc.",
        "location": {
            "city": "Grass Valley",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/swale-inc-c10b80ea/paid-internship-water-resource-and-land-use-planning-9b7a87f3?lvk=UdAd8VgntfQB9LZ8XkJYjw.--M3KkRwBYR",
        "posted": "2021-05-29T04:31:46.719Z",
        "lastScraped": "2021-06-10T04:31:46.719Z",
        "description": "<div><p>Consulting firm is seeking an intern to work on a part-time and temporary (i.e. short-term) basis. </p><p>Training: The Intern will receive training in the following areas:</p><ul><li>Initial onboarding onto firms project management software</li><li>Initial onboarding onto firms payroll software</li><li>Brief training in how to use performance measures</li><li>Brief training regarding how local government agencies function</li><li>Brief training in land-use and water issues for a county in California</li></ul><p>Timeline: This internship will occur over a four-week time period at 28 hours per week (part-time basis). This assignment begins in June 2021 and lasts for 4 weeks. This is a temporary position which will end after the 4-week term. There is no funding to permit continuation beyond the 4-week timeframe. This is a micro-internship. </p><p>Duties: Interns will author a portion of a planning report on local government agency in a California county. Topics include land-use, population, and municipal services. Interns will utilize data from district plans and financial reports, on-line databases, and data from other government agencies. Geographic Information Systems (GIS) is an important tool to use for this project. Applicants must demonstrate they have taken at least one GIS class in college. </p><p>Other duties may include: participation in collaborative reading activities, creation of PowerPoint presentations, the provision of assistance with marketing by writing a blog post, and other related activities.</p><p>Professional Details: The intern will gain exciting real-world environmental planning experience at an active small consulting firm. We hope the intern will gain the following:</p><ul><li>Mentoring with a seasoned professional land-use planner.</li><li>Hands-on learning experience working on a complex, important issue at the crossroads of planning, water resources, water quality, and climate change. </li><li>A solid understanding about how local government agencies actually work and function.</li><li>A letter of recommendation to aid the intern in their future job searches.</li><li>At the end of the internship, the intern will have a professional real-world writing sample and maps to add to their portfolio and to share with future prospective employers. </li></ul><p><strong>Paid Internship Water Resource and Land Use Planning</strong></p><p></p><p><strong>Grass Valley, CA, </strong>United States <br> Position Open: Paid Internship for Recent College Graduate</p><p>Ad Date: June 8, 2021</p><p><strong>Requirements</strong></p><p>Workday Schedule: Although this internship can be completed remotely, interns are expected to fully attend and participate in on-line office hours conducted via on-line video chat tool (similar to Zoom). Attendance in daily on-line video call office hours are mandatory and will be collaborative and supervised. Office hours are Monday through Thursday from 8:00 a.m. to 3:30 p.m. </p><p>Qualifications: The ideal candidate will have the following:</p><ul><li>Ability to work as part of a team on a specific project.</li><li>Recent graduation from a university with a B.A. or B.S. degree in geography, environmental science, public administration, or land-use planning. A 4th year or 5th year Senior student status is also acceptable.</li><li>Familiarity with planning and social issues facing California, including climate change and disadvantaged communities. </li><li>Solid English writing skills. </li><li>Enjoys working with numbers and have solid basic math and statistics skills.</li><li>Ability to utilize the internet and on-line tools such as email and dropbox etc.</li><li>Excellent computer skills including knowledge of: 1] Microsoft Office products such as Word, Excel, and PowerPoint; (or related google docs) and 2] geographic information systems (GIS). </li></ul><ul><li>Able to provide their own desk, office supplies, telephone with service, and a computer.</li><li>Intern is also required to have an active email address and a good internet connection.</li><li>Must be a US citizen or legally able to work in the US. </li></ul><p><strong>Benefits</strong></p><p>Position Details: Part-time, Temporary Employee. Hourly pay rate is minimum wage approximately $13.00/hour. Additionally, employer will reimburse interns costs associated with computer, phone, desk, and internet connection at a combined rate of $1.00 per hour. Intern will be paid weekly. There are no insurance benefits or other benefits provided with this internship. </p><p>SWALE Inc. is a small woman-owned environmental consulting firm located in Grass Valley, CA. Please view our website at www.swaleinc.com. SWALE Inc values diversity; therefore, women and minorities are encouraged to apply. Entry level candidates are also encouraged to apply. <br></p></div>",
        "index": 2,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "Community Impact Internship - Denver Human Services (DHS)",
        "company": "Denver Int'l. Airport",
        "location": {
            "city": "Denver",
            "state": "Colorado",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3c45a0440cc8d84996a6f2ade6ffa065?lvk=X84PF-vrd6FIbaNVnys09A.--M3CTlq_9k",
        "posted": "2021-06-01T04:31:47.688Z",
        "lastScraped": "2021-06-10T04:31:47.688Z",
        "description": "<div><div><p>About Our Job</p><p>At Denver Human Services (DHS), we are creating an extraordinary human services organization that is equipped to carry out our vision of a healthy community where every person is connected, supported, safe, and well. Currently, DHS serves one in three Denverites, about a quarter million people, in the moments that matter most. We are driven every day to serve our community with integrity, kindness, and respect, and to seek out new ideas and opportunities so that over time we can prevent more people from needing our services in the first place. Our 1,100+ member workforce is our most important resource, and we embrace a values-driven culture focused on creating the conditions for our staff and partners to be bold in our thinking and achieve big results for our community.</p><p></p><p>We are excited to announce the first year of our Community Impact Internship program. Community Impact Interns work hand-in-hand with the Community Impact team at DHS to make a deep and powerful impact in the communities in which they serve. This versatile internship provides professional preparation for careers in areas such as government affairs, community outreach, strategic planning, equity, diversity, and inclusion, and leadership in government, nonprofits, and community organizations.</p><p></p><p>The Community Impact Team is seeking an Intern for the 2021 - 2022 academic year to manage a project visualization dashboard project. This project is an exciting opportunity to apply your skills and graduate coursework to build an interactive project visualization dashboard to communicate projects, investment, and impact in the community. The successful candidate will understand that behind every strategic plan is a story and that visualization is the key to telling that story. The Community Impact internship is a unique opportunity for graduate students to apply project management, program evaluation, and community engagement skills towards a project that will further equity in Denver communities.</p><p></p><p>The anticipated duration of this internship is one-year and the choose candidate will complete a nine-month field-based experience at Denver Human Services serving between 20 - 25 hours a week. Due to COIVD-19, the location of this position is flexible and may require a combination of remote and in person attendance that may change overtime. For remote positions, the city will provide a computer but you must have a consistent internet connection.</p><p></p><p>As an intern you will have the opportunity to experience:</p><ul><li><p>Creating and managing a project plan to complete the desired outcomes of the internship</p></li><li><p>For this project, you will design and develop a project visualization dashboard to help communicate and tell the story of the Community Impact Team internally to our staff, as well as externally to our community, this includes the following lanes of work:</p><ul><li><p>Strategic Planning &amp; Special Projects: Demonstrating progress on our strategic goals and various projects in process</p></li><li><p>Grants Management: Demonstrating impact and investment in the community through our grants program</p></li><li><p>Marketing campaigns: Demonstrating marketing and communications reach, both internally and externally</p></li><li><p>Equity, Diversity, &amp; Inclusion: Demonstrating progress on our internal equity action plan</p></li></ul></li><li><p>Other duties and projects as assigned</p></li></ul><p></p>About You<p>Our Ideal Candidate will have/be:</p><ul><li><p>Graduate student pursuing a degree in a relevant field including, but not limited to: Mathematics, Statistics, Economics, Data Science &amp; Analytics, Business Administration, Public Administration, Public Policy, Communications and Marketing, or related field</p></li><li><p>Exposure to Power BI and/or ArcGIS</p></li><li><p>Previous experience with data visualization techniques</p></li><li><p>Experience designing and building dashboards to help communicate a story</p></li><li><p>Passion for helping the most vulnerable populations within the Denver Community</p></li><li><p>Strong written and verbal communication skills, as well as excellent presentation skills</p></li><li><p>The ability to align with the mission and vision of our Department and is passionate about poverty-alleviation efforts and increasing equitable outcomes for our community</p></li><li><p>The ability to take initiative and work independently, as well as in a team environment, and consistently demonstrates a \"can-do\" attitude</p></li></ul><p></p><p>We realize your time is valuable so please do not apply if you do not have at least the following required minimum qualifications:</p><ul><li><p>Education Requirement: Current enrollment in an accredited college program leading to a certificate, licensure, associates, bachelor's, or higher degree in, or a recent graduate (completed specified program within 1 year of completion).</p></li><li><p>Experience: None</p></li><li><p>Education and Experience Equivalency: No substitution of experience for education is permitted</p></li></ul><p></p><p>Additional required documents that must be submitted at the time application to be considered for this position:</p><ul><li><p>College transcripts - either official or unofficial</p></li></ul>About Everything Else<p></p><p><b>Job Profile</b></p>TA3181 Professional Administration Intern<p>To view the full job profile including position specifications, physical demands, and probationary period, click here.</p><p></p><p><b>Position Type</b></p>Oncall<p></p><p><b>Position Salary Range</b></p>$18.84 - $21.21<p></p><p><b>Starting Pay</b></p>Based on Education<p></p><p><b>Agency</b></p>Denver Human Services<p></p><p><i>The City and County of Denver provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, national origin, disability, genetic information, age, or any other status protected under federal, state, and/or local law.</i></p><p></p><p>For information about right to work, click here for English or here for Spanish.</p></div></div>",
        "index": 3,
        "skills": [
            "project management",
            "data visualization",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "IT Internship",
        "company": "NORMA Group",
        "location": {
            "city": "Visalia",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/norma-group-479c615c/it-internship-5c7c7634?lvk=FQfStZJU8_f5sz9AA73wQQ.--M3KlByGQ7",
        "posted": "2021-06-05T04:31:48.963Z",
        "lastScraped": "2021-06-10T04:31:48.963Z",
        "description": "<div><p><strong>Objective:</strong></p><p>To provide first level support to users in solving computer software and hardware issues by providing outstanding customer service to users in NDS.</p><p><strong>Primary Responsibilities, other duties may be assigned:</strong></p><ul><li>Usually diagnoses and resolves most hardware and software problems, but will refer problems requiring specialized training to specialized personnel.</li><li>Work with the company ICT ticket system to ensure tickets are addressed in a timely manner and documented in the system.</li><li>Install and troubleshoot issues with Desktop and Laptop Computers</li><li>Manage ICT Hardware inventory, Help with disposing of old equipment and imaging new devices ready to deploy.</li><li>Support users on computer issues relating to email, network, printing, etc.</li><li>Troubleshoot and resolve issues on Windows 10 &amp; Office 365</li><li>Support and maintain Laser Printers, Label Printers, Handheld RF Scanners, Cell Phones and other computer related equipment</li><li>Willingness to perform occasional travel to other company sites in Lindsay &amp; Fresno.</li><li>Document IT Hardware and Software Assets in various tools.</li></ul><p><strong>Location:</strong></p><p>Visalia, California</p><p><strong>Education, Experience, Other Skills:</strong></p><ul><li>Student in Bachelors or Diploma program in ICT and completed a minimum of 1 year.</li><li>Interested in Computer hardware, taking it apart, troubleshooting.</li><li>Good Documentation Skills</li><li>Skills in MS-Access or MS -SQL desirable.</li></ul></div>",
        "index": 4,
        "skills": [
            "information technology",
            "sql",
            "hardware",
            "networks",
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "JR0168651 - Cloud Solutions Engineering Intern",
        "company": "Intel",
        "location": {
            "city": "Phoenix",
            "state": "Arizona",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/69748934d1b58e2f383708bf01853a93?lvk=EhNfi5fE1OXQHTSIFoqWsA.--M3CVPjbys",
        "posted": "2021-06-03T04:31:49.824Z",
        "lastScraped": "2021-06-10T04:31:49.824Z",
        "description": "<div><p>Job ID: JR0168651 Job Category: Intern/Student Primary Location: Phoenix, AZ US Other Locations: Job Type: Intern Cloud Solutions Engineering Intern Job Description Come intern with one of the largest engineering companies in the world! Join us to help develop new technology in Intel's Optane Group (IOG). Intel's unique Optane memory technology delivers industry leading low latency in both solid-state drive and persistent memory products, that are positioned to change how data is managed worldwide. </p><p>You can learn more about Intel Optane here: <span class=\"long-word\">https://www.intel.com/content/www/us/en/architecture</span>-and-technology/optane-memory.html During the Internship you will get real-world experience with ownership of projects from day one, as well as the opportunity to develop a network inside and outside of Intel. You will specifically be responsible for the following activities including, but not limited to: Performing customer issue reproduction and debug in Intel's lab environment Setting up systems for performance benchmark testing, including installing drives and RAID cards, setting BIOS configuration, installing OS, software, and benchmarking tools and databases. Executing performance benchmarking of Intel servers, SSDs, and software. </p><p>Assembling and configuring new server platforms Updating system BIOS and SSD firmware The ideal candidate should demonstrate the following behavioral traits: Self-motivated individual willing to take direction and deliver to schedule Written and verbal English communication and interpersonal skills Problem solving skills Effective prioritization and time management skills This is a 1-year internship, with a possibility of extension. The role will be full time during the summer and part time for the rest of the year. Qualifications You must possess the below minimum qualifications to be initially considered for this position. </p><p>Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your <span class=\"long-word\">schoolwork/classes/research</span> and/or relevant previous job and/or internship experiences. Minimum Qualifications: Must be pursuing a bachelor's degree in Computer Engineering, Computer Science or related field. </p><p>6+ months of experience or equivalent coursework in the following areas: Linux Software/Script Development Debugging This position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a master's or PhD degree, or a bachelor's degree with three years' related job experience. </p><p>This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a bachelor's degree and less than three years' experience. Preferred Qualifications: Experience with Customer Interfacing, Computer Hardware Setup, Enterprise/Cloud Environments, Caching Software, SSDs, NVMe, RAID, and Software Defined Storage Experience in Project Management / Product Management / Product Marketing Inside this Business Group The Data Center Group (DCG) is at the heart of Intel's transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies-spanning software, processors, storage, I/O, and networking solutions-that fuel cloud, communications, enterprise, and government data centers around the world. </p><p>Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. <span class=\"long-word\">USInternJR0168651Phoenix</span></p></div>",
        "index": 5,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "cloud computing",
            "hardware",
            "networks",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern (Laboratory)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/064c7fb462a0b483f77f42c3fdd530a5?lvk=-A0lNSojbeNPHLtBoANS4A.--M3EtIhgCw",
        "posted": "2021-06-07T04:31:50.806Z",
        "lastScraped": "2021-06-10T04:31:50.806Z",
        "description": "<div><div> THE POSITION: <p></p><div><strong></strong></div><div><br></div><div><br></div><div> This internship is working onsite while adhering to Agency guidelines and protocols in place to help prevent the spread of COVID-19. In order to successfully perform duties as an intern, this position requires the use of a personal computer with internet access, Microsoft Word and Microsoft Excel for the duration of the Internship or until you are asked to return to the office. <br><br>Upon hire, instructions will be provided to you on how you can use your personal computer to connect to the Agency network, including email and access to specific programs that may be required for your work duties. </div><br><br><div></div><div><br></div><div><br></div><div><strong>Open until filled, Apply Immediately<br>First Review of Applications scheduled for June 21, 2021<br><br>There is one (1) internship opportunity in the Water Quality Laboratory Department.</strong><br><br><strong>This recruitment is being conducted to fill (1) vacancy and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.<br><br>Internships are limited to 25 hours week and 960 hours per fiscal year<br>(July 1st to June 30th)<br><br>Note: &nbsp;Internship are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals interested in short term internships will not be considered.</strong></div><div><em>Work schedule is estimated to be approximately 10 to 20 hours a week;&nbsp;</em><br>&nbsp; <em>Office Hours are Monday through Friday from 7:00&nbsp;a.m. to 5:30 p.m.</em><br>&nbsp; </div><br><div><strong>FLSA: Non-Exempt</strong><br><br>The successful candidate will be a responsible, analytical and detailed oriented individual with excellent communication (written/oral) skills.&nbsp;Great time management skills with the ability to work on multiple projects simultaneously are required.&nbsp;Additionally, be willing to learn, and be flexible and assist with ad hoc projects as required in a fast paced and changing environment. </div><div> &nbsp; </div><div> Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. <br><br>&nbsp; </div><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p></p><div><strong>May include, but are not limited to the following:</strong></div>&nbsp; <div> Perform a wide variety of duties of semi-professional and technical duties in the Agency's laboratory that support the sampling and analysis of water, wastewater, biosolids, and industrial samples.&nbsp; </div><div><br></div><div> Assist preparing samples for various laboratory analyses. <br><br>Receives, organizes and maintains the inventory of laboratory and sampling supplies. </div><div><br>Prepares, sorts, washes, decontaminates, sterilizes and stores all laboratory glassware; prepares and preserves bottles prior to sample collection and analysis. </div><div><br>Maintains laboratory cleanliness. </div><div><br>Prepare reports and recommendations relative to assigned areas of responsibility. </div><div><br>Compile data or materials and create spreadsheets, prepare reports, manuals, and publications. </div><div><br>Participate in pulling documents, and filing information. </div><div><br>Perform other related duties as required including other <span class=\"long-word\">administrative/technical</span> requirements. </div><div><br>Limited travel to offsite locations may be required from time to time. </div><div><br>Perform other related duties as required. <br><br>&nbsp; </div><p></p> QUALIFICATION GUIDELINES: <p></p><div><strong>EXPERIENCE AND EDUCATION:</strong></div><div> Graduation from high school or G.E.D. equivalent. <br><br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with major course work in Chemistry, Biology, Environmental Sciences or closely related field. </div>&nbsp; <div> While no prior work experience is required, <strong>preference will be given to individuals with prior related professional work experience.&nbsp;</strong><br><br>Attention to detail, excellent oral and written communication skills and advanced computer skills are critical <br><br>&nbsp; <div><strong>LICENSES AND CERTIFICATES:</strong></div><div> A valid class \"C\" California driver's license. <br><br>&nbsp; <div><strong>KNOWLEDGE OF:</strong></div><div> Principles of data collection, and research techniques and methods; methods and techniques for basic report preparation and writing; modern office equipment including a computer and applicable software; proper English, spelling and grammar. <br>&nbsp; </div><div> &nbsp; </div><div><strong>ABILITY TO:</strong></div><div> Operate office equipment including a computer and applicable software; communicate effectively, both orally and in writing; understand and follow verbal and written instructions; analyze data, situations and research materials; formulate options and make recommendations; establish and maintain effective working relationships. <br><br>&nbsp; </div></div></div><p></p> SELECTION PROCESS: <p></p><div><div> All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job-related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span>&nbsp;examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. <br>&nbsp; </div><div><strong>Any applicant requiring reasonable accommodation during the selection process due to a qualified disability must inform the Human Resources Office at (909) 993-1674 or&nbsp;</strong> <strong>hrdept@ieua.org</strong> <strong>&nbsp;at least 72 hours in advance of the need for accommodation.</strong><br>&nbsp; <br>THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br>&nbsp; <br>&nbsp;\"The Agency's success is obtained by creating a positive and diverse work environment which recognizes individual differences and experiences\". </div></div><p></p></div></div>",
        "index": 6,
        "skills": [
            "project management",
            "networks",
            "c and c++",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer",
        "company": "Fast Metro Riyadh",
        "location": {
            "city": "Havertown",
            "state": "Pennsylvania",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/fast-metro-riyadh-576f349b/software-engineer-b8af8d9f?lvk=FEC-ib5KmIoLGBjKcdt_gg.--M3NGqmVPw",
        "posted": "2021-05-31T04:31:52.028Z",
        "lastScraped": "2021-06-10T04:31:52.028Z",
        "description": "<div><p>We're looking for a Software Engineer to use their expertise in big data and/or machine learning to solve problems like high performing serving and rendering, ads ranking, personalized targeting etc.</p><p>Experiment and build ad systems that help employers find the best candidates and help job seekers find their dream jobs.</p><p>Help scale a data pipeline for real-time processing of enormous amounts of user behavioral data.<br><br>Have ownership over the things you build, help shape the product and technical vision, direction, and how we iterate.</p><p>Work closely with the product managers and stakeholders so that they can leverage your components.</p><p>Get the satisfaction of knowing that you helped connect people to that perfect job that's just right for them.</p><p>Who You Are</p><p>Deep experience in big data and/or applied machine learning, preferably in digital advertising.</p><p>Passionate in using big data technologies to solve the challenging problems in advertising.</p><p>Passionate about your work and problems you solve.</p><p>Passion for collaboration and making others around you successful.</p><p>Has a strong sense of ownership in everything you build.</p><p>BS in Computer Science or related area, or relevant work experience</p></div>",
        "index": 7,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Law Enforcement Analyst - Intern",
        "company": "City of Eden Prairie",
        "location": {
            "city": "Eden Prairie",
            "state": "Minnesota",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7017b80e7b13250570f4a35842bb5224?lvk=Ow7xdX8H6q9f2Hrh8B2OBA.--M3L90a92-",
        "posted": "2021-05-18T04:32:04.604Z",
        "lastScraped": "2021-06-10T04:32:04.604Z",
        "description": "<div><div><strong>Law Enforcement Analyst-Intern</strong> Position Profile <p><strong>Status:</strong>&nbsp; Internship (PTS position: part-time, temporary, or seasonal)</p><p><strong>Salary:</strong>&nbsp; Starts at $18.00 per hour (Depending upon qualifications)</p><p><strong>Duration of Assignment</strong><strong>:&nbsp;</strong>Position begins in September 2021, working 2-5 days per week (negotiable depending on school schedule) through April 2022. (Position will likely average 20-25/hours a week)</p><p><strong>Location:</strong> Police Department, 8080 Mitchell Road, Eden Prairie, MN 55344</p><p><strong>Hours:</strong> Standard business hours (8:00am-4:30pm), may vary based on business needs</p><p><strong>Reporting Relationship:</strong> Reports to Adult Investigations Sergeant</p><strong>Police Department</strong><p>The Eden Prairie Police Department protects and serves the community of Eden Prairie through active and professional engagement. This department is committed to providing customized service to the community, exercising discretion and fairness in enforcement, building public trust in the department, and promoting the professional development of its members.</p><strong>Position Responsibilities</strong><p>The Law Enforcement Analyst Intern position assists in analyzing crime patterns and trends to assist with resource deployment for crime prevention and suppression and to aid the investigation process. The Law Enforcement Analyst Intern's primary position responsibilities and areas of impact are:</p><ul><li>Support Investigations by creating databases for analysis, extracting and verifying pertinent information, managing and organizing information, providing leads, performing data mining and proactively developing targets for further investigation.</li><li>Support Patrol by analyzing crime trends, crime patterns and accident statistics using mapping to identify and plan targeted enforcement activities.</li><li>Produce visual exhibits such as charts and timelines via computer applications.</li><li>Create Eden Prairie based <span class=\"long-word\">intelligence/activity</span> bulletins to share timely information with department staff, community members and local businesses.</li></ul><p>While these areas are the primary focus of the position, we believe strongly in teamwork and employees will be called upon to perform a variety of duties as a part of their role with the City.</p><strong>City of Eden Prairie Values</strong><p><em>We are a service organization. We take pride in what we do. We cultivate a supportive, encouraging and productive culture with a strong customer focus. We promote wellness and plan work/life balance into our goals. We value differences and foster inclusion. We achieve success by exhibiting our core values: <strong>collaboration, innovation, integrity, performance and relationships.</strong></em></p><strong>Position Requirements</strong><p><strong>Education: </strong>High school diploma required; must be pursuing or have recently completed a bachelor's or master's degree in a related field such Criminal Justice, Social Sciences, Analytics or similar.</p><p><strong>Work Experience:</strong>&nbsp;&nbsp;Must have experience working independently with minimal supervision in a busy environment; previous internship preferred; must be able to pass a law enforcement background check.</p><p><strong>Technical Skills:</strong> Proficiency in MS Office (Word, Excel, Access, PowerPoint, and Outlook); advanced word processing and composition skills required, <strong>a cover letter and resume must be attached with application</strong>; Experience mapping or or computer-based analysis programs is preferred.&nbsp;&nbsp;</p><p><strong>Physical Effort</strong>: Physical effort is light for the majority of work with lifting or carrying limited to 25 pounds intermittently. Report preparation and writing at times requires extended use of a keyboard.</p><p><strong>Working Conditions</strong>: Most work is performed in a normal office environment. Occasional travel to meetings or errands outside the office.</p><strong>Position Specific Expectations</strong><p><strong>Communication:</strong> Able to convey a message to get a point across; communicates in a clear and concise manner; able to write clearly and succinctly; tailors message to a variety of communication settings and styles.</p><p><strong>Attention to Detail:</strong> Able to find errors in work and solve problems; anticipates issues and performs at a high level of accuracy; sets up systems to ensure errors are not repeated.</p><p><strong>Accountability:</strong> Follows through on commitments; focuses on appropriate tasks throughout the shift; takes responsibilities for actions both as an individual and on behalf of the organization; actions and words are in sync; follows all policies and procedures; maintains confidentiality; is prepared and punctual to all scheduled shifts.</p><p><strong>Organization:</strong> Ability to coordinate several activities, responsibilities, and tasks simultaneously in a polite and professional manner; prioritizes what needs to get done; keeps things neat and orderly; utilizes tools for efficiency; factors several considerations when planning; establishes methods to ensure routine tasks are completed.</p><p><strong>Problem Solving:</strong> Ability to tackle a problem by using logical, systematic, sequential approach; makes a systematic comparison of two or more alternatives; notices discrepancies and inconsistencies in available information; identifies a set of features, parameters or considerations to take into account in analyzing a situation or making a decision.</p><strong>City of Eden Prairie Pre-employment Process</strong><p>The City of Eden Prairie conducts the following pre-employment checks for this position:</p><ul><li>Professional Reference Checks</li><li>Background Investigation and Criminal History Check</li><li>Education and work history verification</li></ul><p>All final candidates must successfully complete and pass the City's evaluation of the pre-employment process before their first day of employment.</p><strong>City of Eden Prairie Application Timeline </strong><p>To apply, complete an online application <span class=\"long-word\">(www.edenprairie.org</span> and click on the employment tab) by the application deadline.</p><p><strong>Position Posted</strong>:&nbsp; Monday, June 7, 2021</p><p><strong>Application Deadline</strong>: Wednesday, June 30, 2021 at 4:30pm</p><p><strong>Review Application:</strong> July 2, 2021</p><p><strong>Interviews:</strong> Week of July 12, 2021</p><p><strong>Final Interviews:</strong> Week of July 19, 2021</p><p><strong>Pre-Employment:</strong> Week of July 29, 2021</p><p><strong>Start Date:</strong> August 23, 2021</p><p><strong>&nbsp;</strong></p><p>&nbsp;</p></div></div>",
        "index": 8,
        "skills": [
            "data visualization",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2021-09-01T10:00:00.000Z",
        "due": "2021-06-07T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Summer school program teacher",
        "company": "Verano Learning Partners",
        "location": {
            "city": "Scottsdale",
            "state": "Arizona",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d66a58d366fb0e1c1bc0062a5e1a5d87?lvk=OdMYkmLr8ajO2lUaY3nZvQ.--M3L9s6rh3",
        "posted": "2021-06-06T04:32:05.511Z",
        "lastScraped": "2021-06-10T04:32:05.511Z",
        "description": "<div><div><p>Our part-time summer school teaching opportunity is for our upcoming summer program, with the potential to extend beyond. This is an ideal position for someone still in college looking for summer work, a high school student needing internship experience, or a teacher that wants part-time work during the summer!</p><p> We are looking for a Teacher who possesses&nbsp;knowledge in the field of Computer Science (preferred, <strong>not</strong> required). We want teachers to get to know each student, encouraging and influencing each one of them on an individual basis, while innovating, collaborating and creating technology. The summer school teacher is responsible for creating a fun and learning experience for students to achieve and master the iCode belt system.&nbsp; They deliver each instructional session while evaluating the progress of each student in the program.</p><p>Please note:&nbsp;This position is located in Goodyear, AZ and you must be able to be fully on-site.&nbsp;</p><p><strong>Key Responsibilities&nbsp;</strong></p><ul><li>&nbsp;Teach and educate students according to guidelines provided by iCode.</li><li>&nbsp;Manage an orderly classroom at all times.</li><li>&nbsp;Provide meaningful feedback about class material and student dynamics in the classroom in weekly status reports.</li><li>&nbsp;Assess, record and report on the development, progress, attainment and behaviour of students.</li><li>&nbsp;Provide weekly communication and updates to parents on a weekly basis.</li><li>&nbsp;Treats students equally and fairly.</li><li>&nbsp;Present a professional manner at all times.</li><li>&nbsp;Maintain exceptional classroom standards.&nbsp;</li><li>This position is located in Goodyear, AZ and you must be able to be fully on-site.</li></ul><p><strong>Qualifications&nbsp;</strong></p><ol><li><strong>Teaching certification is NOT required (although a nice to have).</strong></li><li>Positive attitude, outgoing and excellent people skills.</li><li>Dependable and flexible to work evenings and weekends.</li><li>Good written and verbal communication skills.</li><li>Ability to work with students ranging from K-12.</li><li>Strong problem-solving and analytical skills.</li><li>Ability to work independently as well as part of a team.</li><li>Being able to perform well under pressure.</li></ol></div></div>",
        "index": 9,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Administrative Assistant",
        "company": "Seattle University",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f267208042433295555ec0f15913ebd4?lvk=nqQtSQB8YHt0swP6P-6HMg.--M3DW8b5tN",
        "posted": "2021-06-03T04:32:06.396Z",
        "lastScraped": "2021-06-10T04:32:06.396Z",
        "description": "<div><div><p><b>Administrative Assistant</b></p><p><strong>FLSA Status</strong>: Nonexempt </p><p><strong>Months Per Year</strong>: 12 </p><p><strong>Hours Per Week</strong>: 20 <br><br>Position Description</p><p></p><p><b>PURPOSE:</b>&nbsp;&nbsp;&nbsp; The Master of Arts in Couples and Family Therapy (MACFT) Administrative Assistant provides half-time administrative support to the College of Arts and Sciences' (CAS) MACFT program. This position reports to the MACFT Program Director and assists the Program Coordinator and Clinical Director as needed. This is a part time, 12 months per year position.</p><p>&nbsp;</p><p><b>ESSENTIAL JOB FUNCTIONS:</b>&nbsp;&nbsp; </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Provide general administrative support related to MACFT, including correspondence, minute taking, and record keeping. </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Assist Program Coordinator and Clinical Coordinator with tracking and auditing clinical and program assessment data (e.g., clinical and supervision hours, educational outcomes assessment). </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Facilitate data collection and dissemination of data related to program's assessment cycle (benchmark data, review of resources, and clinical paperwork). </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Assist the Program Coordinator with admissions process (e.g., organizing group interviews).</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monitor and supply updates for the program web page and program-specific CANVAS page. Collaborate with Program Coordinator and Program Director to curate content for social media pages.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Communicate with student, faculty, and staff about deadlines, course offerings, and MACFT-related events.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Coordinate with Program Coordinator to maintain detailed records related to retention and tracking of current students using our CRM, InformSU (e.g., run active not registered reports, monitor course enrollments, and project enrollment). </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Track graduates' licensure and exam pass rate using software such as Excel. </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Collaborate with the Program Coordinator to survey program's Communities of Interest (COIs). Report related program changes back to the COIs.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Coordinate mentorship, scholarship, and student recognition programs. </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Organize special events and assist with planning of student events. Collaborate with conference event services (CES) to secure rooms and arrange other meeting logistics.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Plan new student academic and internship orientations, program meetings, and continuing education initiatives. Record minutes.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Verify student status or graduation status via memorandums for employers as needed.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Assist Program Director with budget planning and implementation. Collaborate with Seattle University's operations team.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Oversee scheduling, contracts, and payments to instructors, external partners, and vendors. Collaborate with CAS staff and registrar's office using official registration software (e.g., CLAS and AcALog). Communicate with faculty regarding logistics of course schedules, room assignments, and enrollment.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Update program catalogue; collaborate with CAS scheduler and the University Registrar.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Assist with preparing, editing, and distributing MACFT-related documents (annual review, self-study, assessment plans).</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Maintain records for student workers.</p><p><b>&nbsp;</b></p><p><b>MARGINAL JOB FUNCTIONS:</b>&nbsp;&nbsp;&nbsp; </p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Performs other duties as assigned.</p>Enter External Job Description here <p></p><p>Qualifications</p><p></p><p><b>MINIMUM QUALIFICATIONS:</b>&nbsp;&nbsp;&nbsp; </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Bachelor's degree and two or more years administrative office support experience or an equivalent combination of education and experience sufficient to successfully perform the essential duties of the job such as those listed above.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The candidate must be able to successfully complete an online computer skills assessment administered by the Office of Human Resources. Software included in the assessment: MS Word, MS Excel, MS Windows, MS Outlook and Internet Explorer.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to communicate effectively with others in writing, by phone, or in person. </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Excellent customer service skills including the ability to create a warm and welcoming environment and work with diverse populations. </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to organize and prioritize and able to perform multiple tasks successfully.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All candidates must show a demonstrated commitment to diversity and the university's mission, vision, and values.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This position requires a criminal history background check.</p><p><b>&nbsp;</b></p><p><b>PREFERRED QUALIFICATIONS:</b> &nbsp;&nbsp;&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience working in an academic environment.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with counseling-related accreditation, specifically the Commission on the Accreditation of Marriage and Family Therapy (COAMFTE).</p><p>&nbsp;</p>Enter minimum and preferred qualifications here&nbsp; <p></p><p>Benefits at a Glance<br><br>Consistent with its fundamental Jesuits value, Seattle University offers a wide range of benefits designed to care for the whole person. Choose from three different medical plans, a dental and vision insurance programs. You may also take advantage of 100% tuition remission benefits for the employee and dependents, a subsidized transportation benefit, a wellness program with an onsite fitness facility, and a wide variety of campus events. Enjoy a generous holiday schedule, including a paid Christmas break closure, vacation and paid sick leave, and paid community service leave.&nbsp;For more information explore the Benefits website at: <span class=\"long-word\">https://www.seattleu.edu/hr/benefits/</span>&nbsp;&nbsp;<br></p><p>Application Instructions</p><p>Applicants should attach an electronic cover letter and resume when applying. Persons who need assistance with the recruitment process may contact the Office of Human Resources at: 206-296-5870. Job postings are open until filled, unless otherwise specified.&nbsp;</p></div></div>",
        "index": 10,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "contact": "206-296-5870",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Clinician III - Full Time, MT Vernon",
        "company": "Compass Health",
        "location": {
            "city": "Mount Vernon",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-e685e2f8/mental-health-clinician-iii-full-time-mt-vernon-74eaee9f?lvk=0N-QGxCdk6GGfzmQSSJEgw.--M3G5aRhp3",
        "posted": "2021-06-05T04:32:07.695Z",
        "lastScraped": "2021-06-10T04:32:07.695Z",
        "description": "<div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div><div><div><div><div><p><strong>Mental Health Clinician</strong><strong> III (MOUNT VERNON)</strong><br></p><p>Compass Health is currently looking for a <strong>Mental Health</strong><strong> Clinician</strong> <strong>III</strong><strong> for our Emergenc</strong><strong>y Services program in MOUNT VERNON! </strong>The Clinician III works in conjunction with the Program Manager to ensure that clinicians have appropriate supervision and that clients receive high quality clinical care. </p><p>This position provides crisis intervention behavioral health services to persons of all ages experiencing acute behavioral health issues. These services will be provided primarily in community settings to individuals who are in crisis or for whom a crisis episode is deemed to be imminent. This position will also provide clinical supervision to MA or BA level clinicians, peers and/or interns.</p><p><br></p><p><strong>WHY WORK FOR US:</strong></p><p>As the region’s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesn’t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance.</p><p><em>(benefits pro-rated for part time employees)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays – 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul></div><p><br></p><div><strong>REQUIREMENTS</strong><br><br>• MA/MS/MSW Degree in a Behavioral Science related field. <br>• Current Washington State Licensure or equivalent in Social Work, Marriage &amp; Family Therapy, or Mental Health Counseling preferred. <br>• Qualifies as a Mental Health Professional (MHP) as defined by WAC. <br>• Experience in medical, mental health or social services field preferred. <br>• Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn. <br>• Valid Washington State Driver's License required including vehicle and appropriate insurance, if applicable. <br>• Ability to attend the DCR Academy by the time of the first annual review required. <br>• Familiarity with RCW 71.05 and 71.34 preferred.<br>• Ability to formulate an individual treatment plan and apply appropriate rehabilitation and treatment modalities. <br>• Ability to relate effectively with patients, agency staff, other community programs, and the general public. <br>• Ability to work independently without daily onsite supervision. <br>• Ability to work effectively with individuals with complex needs and multi-system involvement.<br>• Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems.<br>• Demonstrated organizational skills and the ability to multitask within a fast-paced environment.<br>• Excellent communication skills, written and verbal. <br>• Strong computer proficiency, including keyboarding skills and working knowledge of Microsoft Office products. <br>• Ability to utilize an electronic medical record for collaborative clinical documentation.<br>• Ability to pass pre-employment criminal background check.</div><p><br></p><div><strong>POSITION SUMMARY</strong><br><br>Job Title: Clinician III<br>Program: 500- 45550 – MCOT<br>Location: Mount Vernon<br>Hours: Full Time (40 Hours/Week) <br>Wage: DOE  $21.96 - $40.55<br><br></div><p><br></p><div><strong>ABOUT US</strong><br><br>Compass Health is the region’s largest private, non-profit organization providing mental health and substance use services in Snohomish, Skagit, Island, San Juan, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesn’t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org</span><br><br><p><em>Compass Health is an Equal Opportunity Employer</em><br></p><p></p></div></div></div></div></div>",
        "index": 11,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern-Research - Stowers Lab",
        "company": "Scripps Research",
        "location": {
            "city": "La Jolla",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6c14d3a10142b6cac55b2998abd93542?lvk=XEd_ZN5Rwam4tN3qzetHdA.--M3MTo5xm3",
        "posted": "2021-06-09T04:32:08.597Z",
        "lastScraped": "2021-06-10T04:32:08.597Z",
        "description": "<div><div><div><b>Position Title:</b> Intern-Research</div><div><br><b>Position Description:</b></div><div></div><div>Interns receive occupational experience, closely supervised training and are able to develop their professional skills. Duties include basic laboratory maintenance such as glassware washing; autoclaving; media, solution, and buffer prep; replenish supplies and follow experimental procedures assigned by laboratory staff.</div><div></div><div><div>The Stowers Lab <span class=\"long-word\">(https://www.stowerslab.com/)</span> at The Scripps Research Institute is looking for a computational undergraduate intern to help with data analysis for neuroscience experiments.</div><div></div><div>Our lab is interested in the neural mechanisms underlying social behaviors and internal states. We study how animal models (mice) respond to olfactory cues while recording their behavior and neural activity. We rely heavily on traditional data science but are also piloting new machine-learning based tools to discriminate posture, facial expressions, and other related measures in video and images. We are looking for an undergraduate intern with computational skills and an interest in neuroscience to join our team. This is a part-time (&amp;lt;19 hr/week), paid, and hybrid model (remote and in-person) position with flexible hours.</div><ul><li>Applicants should have a good background in statistics and tools for data processing, analysis and visualization (Python preferred).</li><li>A machine learning background would be a plus but we welcome all applicants who are enthusiastic about trying new tools and technologies.</li><li>Applicants should be able to think and work independently and able to communicate and generate new ideas for how to analyze data.</li><li>Applicants with an interest in neuroscience and social/emotional behavior in animal models are especially encouraged to apply.</li></ul></div><div></div><div><b>Additional Information:</b></div><div></div><div>Part-time: Up to 19 hours per week.<br>This position is not eligible for benefits.<br>This is a year-round position, not a summer intern or other short-term internship.</div><div></div><div><b>Physical Requirements:</b></div><div></div><div>This position works in a laboratory or vivarium environment. Further details of the physical requirements of established essential functions for this position will be <span class=\"long-word\">addressed/discussed</span> during the interview process.<br></div><div><b>Qualifications:</b><br></div><div>Requires current enrollment in either a high school or college/university educational program. Undergraduate enrolled in a relevant scientific program, e.g., biological or life science, strongly preferred.</div><div></div><div><div><i>The above statements describe the level of work performed and expected in general terms. The statements are not intended to list all the responsibilities, duties and/or skills required of employees so classified, and the content herein is subject to change due to the business needs of Scripps Research, with or without notice. Furthermore, nothing in this job description shall be interpreted to be in conflict with or to eliminate or modify in any way the employment-at-will status of Scripps Research staff.</i></div><div></div><div><b><i>EEO Statement: </i></b><i>Scripps is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.</i></div><div></div><div><b><i>COVID-19 update: </i></b><i>The safety and well-being of our candidates, our people and their families continues to be a top priority. Until restrictions change, interviews will be conducted virtually. New hires will work remotely, unless specifically authorized for campus access.</i></div>.</div><div></div><div><br></div></div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "information technology",
            "data visualization",
            "python",
            "virtual reality"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern, Ergonomics and Occupant Package - Fall 2021",
        "company": "Lucid Motors",
        "location": {
            "city": "Newark",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a7b208bbde02465a75e655753cc7bb0e?lvk=oAqQ9msH1wQxjnN8nnL6sQ.--M3BsIRkwV",
        "posted": "2021-06-02T04:32:09.499Z",
        "lastScraped": "2021-06-10T04:32:09.499Z",
        "description": "<div><div><div> Leading the future of luxury mobility</div><div><br></div><div> Lucid's mission is to inspire the adoption of sustainable energy by creating the most captivating luxury electric vehicles, centered around the human experience. Working at Lucid Motors means having a shared vision to power the future in revolutionary ways. Be part of a once-in-a-lifetime opportunity to transform the automotive industry.</div><div><br></div><div> We are currently seeking&nbsp;an&nbsp;Intern, Ergonomics and Occupant Package for this Fall. This position requires an experienced professional with a basic understanding of ergonomic concepts. Our ideal candidate exhibits a can-do attitude and approaches his or her work with vigor and determination. Candidates will be expected to demonstrate excellence in their respective fields, to possess the ability to learn quickly and to strive for perfection within a fast-paced environment.&nbsp;</div><div><br></div><div> <span class=\"long-word\">Role/Responsibilities:</span> <ul><ul><li>Conduct occupant layout benchmark [in CAD &amp; Physical measurements]</li><li>Develop ergonomic guidelines for in-car controls displays</li><li>Assist in physical ergonomic evaluations&nbsp;</li></ul></ul></div><div> Preferred Qualifications: <ul><ul><li>Prior experience or basic understanding of human factors and ergonomic concepts</li><li>Exposure to 3D CAD Tools</li><li>Good analytical &amp; problem-solving skills</li><li>Open to learn</li></ul></ul></div><div> Education: <ul><ul><li>Field(s) of study: Mechanical Engineering or related fields including but not limited to: Human Factors and Ergonomics, Industrial Design, and User Interface Design.</li><li>Will consider undergraduates at Sophomore level and above: Associate's, Bachelor's, Post-Secondary</li><li>Graduates are eligible for this internship up to 12 months after graduation</li></ul></ul></div><div> Programming Timing: <ul><ul><li>Start Date: September 7th, 2021</li><li>End Date: November 26th - December 23rd</li><li>Our internship program is 12 - 16 weeks; the end date is flexible based on individual needs.</li><li>Some flexibility with the start date is available as needed</li></ul></ul></div><div> Other <ul><ul><li><b>Availability:</b> Full-time preferred but Part-Time available</li><li><b>Location:</b> This position is in Newark, CA. You must be prepared to start on site for your first day of employment</li><li><b>Work Environment:</b> Production Lab </li><li><b>Anticipated Hours:</b> 8:30am - 5:30pm</li><li><b>Compensation:</b> Student compensation is based on location and current degree level, non-negotiable</li><li><b>Visa Sponsorship: </b>Lucid may but is not obligated to sponsor foreign national employees requiring company sponsorship for U.S. employment authorization</li><li><b>Medical benefits:</b> Dental and vision on day 1 for all interns working 30+ hours a week; medical for interns in California working 30+ hours a week</li><li><b>Housing:</b> No compensation for housing</li><li><b>Bonus:</b> No signing bonus, relocation bonus, equity, or other bonuses currently</li><li><b>Relocation:</b> Round trip flight from/to permanent residence</li><li><b><span class=\"long-word\">Housing/Transportation:</span></b> You must provide your own living arrangements and transportation in the local area</li><li><b>Background Check:</b> All offers of employment are contingent on clearing a background check</li></ul></ul></div><div><br></div><div><br></div><div> Be part of something amazing</div><div><br></div><div> Come work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we're providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.</div><div><br></div><div> At Lucid, we don't just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace and is an affirmative action employer. &nbsp;We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.</div><div><br></div><div><i>To all recruitment agencies: Lucid Motors does not accept agency resumes. Please do not forward resumes to our careers alias or other Lucid Motors employees. Lucid Motors is not responsible for any fees related to unsolicited resumes.</i> <b><i>&nbsp;</i></b></div></div></div>",
        "index": 13,
        "skills": [
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid",
        "start": "2021-09-07T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Strong Future Intern",
        "company": "City of Las Vegas",
        "location": {
            "city": "Las Vegas",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a1089520fd30f96076c949ddb54f14fe?lvk=RODIyW6otE9a53Pn1PqWQQ.--M3CehpW4Z",
        "posted": "2021-06-03T04:32:10.346Z",
        "lastScraped": "2021-06-10T04:32:10.346Z",
        "description": "<div><div> About the Position <p></p><div><strong>Job Opportunity</strong><br><br>The City of Las Vegas Youth Development &amp; Social Innovation Department,&nbsp;Safekey&nbsp;Division is seeking qualified Batteries Included interns for the Safekey program. The purpose of this recruitment is to establish an eligible list for future openings. <br><br><strong>What are the requirements for this position?</strong><ul><li>Senior in High School.</li><li>First Aid and CPR Certification at time of <span class=\"long-word\">hire/reclassification.</span></li><li>Computer experience required.</li><li>No credit deficiencies.</li><li>Student must have and maintain a&nbsp; 2.75 G.P.A.</li><li>Student must sign an agreement at the time of hire.</li><li>Attach a copy of current high school transcript to their application.</li><li>Complete Employability Training.</li><li>Completion of the Strong Future Las Vegas employability training is required in order to be eligible for employment.&nbsp;</li><li>Attach 1 page Essay: <ul><li>TOPIC: What area of the interviewing process would you like to improve on? If this area was improved, how would this affect your professional career? (Ex: Resume formatting, business attire or interviewing abilities)</li></ul></li></ul><br>&nbsp; </div><div><strong>What happens after I submit my application?</strong><br><br>You will be contacted by e-mail once your application has been accepted. Once you apply, almost all communication regarding the status of your application will be by email, so please add&nbsp; <span class=\"long-word\">noreply@governmentjobs.com</span> and&nbsp; <span class=\"long-word\">info@governmentjobs.com</span> to your address book <br>to prevent any emails from going to your Spam/Junk folder. <br><br>Due to the volume of applications received, we are unable to provide information regarding the status of your application over the phone. To check the status of your application, please log in to your account and click \"Application Status\". It is not necessary to contact the Human Resources Office to check the status of an application. <br><br>Any individual offered employment will be required to pass a pre-employment drug test, background check, and may be required to demonstrate the ability to perform the requirements of the position. Some positions may require preliminary background checks. <br>&nbsp; </div><p></p> EXAMPLE OF DUTIES <p><strong>Position Summary</strong><br><br>This position performs routine, entry-level work under close supervision. This position conducts programs for children aged from kindergarten through 5th&nbsp;grade at satellite&nbsp;Safekey&nbsp;elementary school sites. Programs include structured and unstructured activities to best meet participants' needs. Planned activities&nbsp;includes arts and crafts, storytelling, quiet games, recreational games, outside playtime, homework assistance, and other special activities.<br><br><strong>Duties include but are not limited to:</strong></p><ol><li>Assist&nbsp;with set-up and breakdown of equipment and supplies for program or special event and cleaning of area and equipment.</li><li>Ensures safety of participants during program events and activities.</li><li>Provides assistance to full-time or part-time classified staff or designee.</li><li>Performs other related duties as assigned.</li></ol><p></p> MINIMUM REQUIREMENTS <p></p><ul><li>Senior in High School.</li><li>No credit deficiencies.</li><li>Student must have and maintain a&nbsp; 2.75 G.P.A.</li></ul><p></p> KNOWLEDGE, SKILLS, AND ABILITIES <p></p><p><strong><strong>Competencies</strong></strong></p><p>Core Workforce Competencies</p><p>Professionalism - Demonstrates core values by being honest, respectful and positive.</p><p>Effective Communication - Expresses verbal and written thought in a clear and understandable manner.</p><p>Customer Focus - Demonstrates genuine concern and satisfies external and/or internal customers based on the CLV core purpose and values.</p><p>Adaptability - Able to effectively modify behavior to suit changing workforce demands.</p><p>Problem Solving - Solves problems by considering all causes, solutions and outcomes.</p><p>Productive Partnerships - Develops, maintains and strengthens partnerships with others.</p><p>Technical and Safety Expertise - Possesses a depth of knowledge, skill and ability in a technical (job) area.<br>&nbsp;</p><p></p></div></div>",
        "index": 14,
        "skills": [
            "game design",
            "information technology"
        ],
        "contact": "noreply@governmentjobs.com",
        "remote": false
    },
    {
        "position": "Center for the Humanities University Honors College Intern",
        "company": "Oregon State University",
        "location": {
            "city": "Corvallis",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/10bdacd3d3ef53713dac41c806770392?lvk=5RRaiILxiBqG6p3Y2Wa1lw.--M3JrWQ_oo",
        "posted": "2021-06-08T04:32:11.263Z",
        "lastScraped": "2021-06-10T04:32:11.263Z",
        "description": "<div><div><div> Position Title Student Technical Assistant Job Title Center for the Humanities University Honors College Intern Appointment Type Student Employee Job Location Corvallis Position Appointment Percent 100 Appointment Basis 12 Min Hourly Rate $12.00 (Standard); $11.50 (Non-Urban); $13.25 (Portland Metro) Max Hourly Rate $18.00 (Standard); $17.50 (Non-Urban); $18.50 (Portland Metro) Position Summary <p>This recruitment will be used to fill five part-time (a maximum of 20 hours per week during academic terms and a maximum of 40 hours per week during academic breaks) Summer Intern positions for the Honors College and Center for Humanities at Oregon State University (OSU).</p> Position Duties <p>Interns will work with faculty supervisors on tasks related to research in the humanities, arts, and social sciences.</p> Minimum Qualifications <p>Employment Eligibility Requirements <span class=\"long-word\">(http://fa.oregonstate.edu/stu</span>-manual/500-employment-eligibility-requirements)</p> Additional Required Qualifications <p>Must be enrolled in the Honors College</p> Preferred (Special) Qualifications Working Conditions / Work Schedule </div><div> Posting Number P07498SE Number of Vacancies 5 Anticipated Appointment Begin Date 06/16/2021 Anticipated Appointment End Date Posting Date 06/08/2021 Full Consideration Date 06/10/2021 Closing Date 06/10/2021 Indicate how you intend to recruit for this search Competitive / Student - open to ALL qualified/eligible students Special Instructions to Applicants <p>When applying you will be required to attach the following electronic documents:</p><p>1) A Resume/Vita</p><p>2) A cover letter indicating how your qualifications and experience have prepared you for this position.</p><p>For additional information please contact: <b>Christopher Nichols</b> at <b><span class=\"long-word\">christopher.nichols@oregonstate.edu</span></b></p><p>OSU commits to inclusive excellence by advancing equity and diversity in all that we do. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community.</p><p>Note: All job offers are contingent upon Human Resources final approval.</p></div></div></div>",
        "index": 15,
        "skills": [
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer - Partially Remote!",
        "company": "Wello",
        "location": {
            "city": "Addison",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/wello-51ced6e1/software-engineer-partially-remote-a33ee9fe?lvk=Vvu_zQyF2Ove7sdUkN9SGA.--M3KkWaZxZ",
        "posted": "2021-06-09T04:32:13.010Z",
        "lastScraped": "2021-06-10T04:32:13.010Z",
        "description": "<div><p>If you're looking to join a fast-paced team with a global mission, we have an exciting opportunity for you!</p><p>We are looking for an energetic Software Engineer to design, code, test, debug, and document software for our current and new innovative products.</p><p><strong>Who we are:</strong></p><p>Since 2014, our mission has been simple: to end the spread of contagious illness. We provide technology to lower the risk of spreading COVID-19 and other contagious illnesses in the workplace.</p><p><strong>What you get to do:</strong></p><ul><li>Design, develop, test and debug software</li><li>Work in multi-disciplinary group (onshore/offshore) to understand and implement interfaces between various software components.</li><li>Support software test, manufacturing, and customer support group to <span class=\"long-word\">troubleshoot/resolve</span> issues.</li><li>Write software engineering documents such as Software Architecture Document, Detailed Design Document, etc..</li></ul><p><strong>Requirements:</strong></p><ul><li>B.S in Computer Science, Electrical Engineering, Software Engineering, or similar discipline.</li><li>2-4 years of experience using C++ and Linux.</li><li>Strong understanding of SDLC, Object Oriented Programming, UML Modeling</li><li>Experience in User Interface development required.</li></ul><p><strong>What sets you apart:</strong></p><ul><li>QT experience strongly preferred.</li><li>Prior experience in embedded Linux preferred.</li><li>Experience in Medical Device or other highly regulated industry is strongly preferred.</li><li>Experience with GIT source control.</li></ul><p><strong>What's In It For You:</strong></p><ul><li>Competitive salary</li><li>Bonus</li><li>Stock options</li><li>Work remote part-time</li><li>Great medical benefits</li></ul><p><strong>So, if you are a Software Engineer with 2+ years of C++ and Linux experience, please apply today!</strong></p></div>",
        "index": 16,
        "skills": [
            "software engineering",
            "c and c++",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "IT Support Intern",
        "company": "BWX Technologies",
        "location": {
            "city": "Mount Vernon",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/90034f65b1b144f5bbf494bd17c70964?lvk=9PvmSPIdXH-sRK3f-jY4pA.--M3KV8PDrF",
        "posted": "2021-05-27T04:32:13.912Z",
        "lastScraped": "2021-06-10T04:32:13.912Z",
        "description": "<div><div><p>At BWX Technologies, Inc.&nbsp;(NYSE: BWXT), we are People Strong, Innovation Driven. Headquartered in Lynchburg, Va.,&nbsp;BWXT&nbsp;provides safe and effective nuclear solutions for national security, clean energy, environmental remediation, nuclear medicine and space exploration. With&nbsp;approximately 6,400 employees, BWXT has 12 major operating sites in the U.S. and Canada.&nbsp;We are the sole manufacturer of naval nuclear reactors for U.S. submarines and aircraft carriers. Our company supplies precision manufactured components, services and fuel for the commercial nuclear power industry across four continents. Our&nbsp;joint ventures provide environmental remediation and nuclear operations management at more than a dozen U.S. Department of Energy and&nbsp;NASA facilities. BWXT’s technology is driving advances in medical radioisotope production in North America and microreactors for various defense and space applications. Follow us on Twitter at @BWXTech and learn more at&nbsp;www.bwxt.com.</p><p><b>BWXT is currently seeking an IT Support Intern for its Mount Vernon, IN location!</b></p><p>&nbsp;</p><p><b>Job <span class=\"long-word\">Description/Duties:</span></b></p><p>&nbsp;</p><ul><li>Provide Tier 1 support role for customers and tracking performance through the IT Support Work orders. </li><li>Configure mobile phones and mobility solutions.</li><li>Assist with mobility usage and configuration reporting.</li><li>Provide customers with local desk side and telephone support resolving issues, prioritizing problems and escalating as needed. </li><li>Assist customers with desktop operating systems, email, Microsoft Office, PC hardware and Remote Access. </li><li>Communicate any current outage/critical incident status to callers and, if new <span class=\"long-word\">information/symptoms</span> reported notify IT management team. </li><li>Communicate with teams within IT to develop solutions to work orders.</li><li>Participate in teams to support IT projects.</li><li>Install hardware components, desktop operating system software, and application software (Windows 10, Microsoft Office, etc.).</li></ul><p>&nbsp;</p><p><b>Job <span class=\"long-word\">Qualifications/Requirements:</span></b></p><p>&nbsp;</p><ul><li>Must be currently enrolled and have completed some college coursework in an IT or Computer Science degree program. </li></ul><ul><li>Must be able to work 15-25 hours per week between 7:30 a.m. and 5:00 p.m. Must be willing to commit to working part time during the school year and full-time during summer and break periods.</li><li>Must be highly self-motivated with the ability to organize and prioritize work tasks</li><li>Must have awareness of the PC hardware components, desktop operating system software, application software and some network troubleshooting.</li><li>Must have strong analytical skills and the ability to troubleshoot and resolve hardware and software problems as well as have the ability to research and understand technical documentation. Experience in a technical call center, customer service team or IT/Help service desk is a plus. </li><li>Strong verbal, written, interpersonal, organizational and customer service skills is required. &nbsp;</li><li>Must have strong troubleshooting and problem-solving skills and the ability to improve processes to be more efficient. </li><li>Must have the ability to communicate complex problems and solutions to end users.</li><li>Must be able to work in local and remote teams.</li></ul><ul><li>Ability to obtain and maintain a DOE security clearance is required.</li></ul><ul><li>Must be a U.S. citizen with no dual citizenship.</li></ul><p>Applicants selected will be subject to a Federal background investigation&nbsp;and must meet eligibility requirements for access to classified information or matter. Position requires U.S. citizenship with (no dual citizenship)&nbsp;ability to obtain and maintain a Department of Energy (DOE) security clearance&nbsp;which involves an extensive criminal and financial background investigation,&nbsp;drug test&nbsp;and previous employment reference verifications.</p><p>BWXT supports diversity and is committed to the concept of Equal Employment Opportunity. We have established procedures to ensure that all personnel actions such as recruitment, compensation, career development, benefits, company-sponsored training and social recreational programs are administered without regard to race, color, religion, gender, national origin, citizenship, age, disability or veteran status.</p><p><span class=\"long-word\">https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf</span></p><p><span class=\"long-word\">https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf</span></p><p>&nbsp;</p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "information technology",
            "hardware",
            "networks",
            "machine learning",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Seasonal Employee - Research",
        "company": "NorthShore University Health System",
        "location": {
            "city": "Evanston",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ac116bffc53f20ab242a590b77b71871?lvk=OGu_F0BTiGfJThcTtqvE4A.--M3Dubxfe3",
        "posted": "2021-06-04T04:32:14.778Z",
        "lastScraped": "2021-06-10T04:32:14.778Z",
        "description": "<div><div><p><b>Position Highlights:</b></p><ul><li><b>Position</b>: Seasonal Employee </li><li><b>Location</b>: Evanston, IL</li><li><b>Full Time/Part Time</b>: Part Time, Resource, 6-10 hours a week</li><li><b>Hours</b>: Monday-Friday, Weekends, Some Evenings until 8pm</li></ul><ul><li><b>Required Trave</b>l: NorthShore sites</li></ul><p>&nbsp;</p><p><b>What you will need:</b></p><ul><li><b>Education</b>: College Students</li><li><b>Certification: </b>N/A</li><li><b>Experience</b>: 6 months minimum experience in mentored biomedical research</li><li><b>Skills</b>: Womens health knowledge preferred. Excellent organization, time management, problem solving and communication (both written and verbal) skills. Ability to interact in a professional and sensitive manner with medical personnel, research subjects, and other research staff. Must be able to work independently or with minimal supervision, and show initiative. Excellent computer skills and experience with Excel required.</li></ul><p>&nbsp;</p><p><b>What you will do:</b></p><p>&nbsp;</p><ul><li>Study how to improve management of pelvic pain</li><li>Assist in performing standard laboratory and research procedures following strict protocols</li></ul><p>&nbsp;</p><p>Our goal is to systematically define the pathophysiology of dysmenorrhea and develop new treatments, while simultaneously training exceptional scientists to investigate the neuroscience of Women's Health. We apply a combination of experimental sensory assays, EEG, MRI and Ultrasonography as part of our NIH funded program. We currently have projects studying women with dysmenorrhea and adolescents about to have their first period. Members of our lab develop valuable skills that can lead to long-term careers in healthcare or scientific research and gain critical experience in team and patient communication, following scientific protocols, and exposure to physiology and neuroscience.</p><p>&nbsp;</p><p>NorthShore University HealthSystem (NorthShore) is an integrated healthcare delivery system consistently ranked a Top 15 Major Teaching Hospital in the U.S. Headquartered in Evanston, Illinois, NorthShore comprises five hospitals (Evanston, Glenbrook, Highland Park, Skokie and Swedish), 140 Medical Group and Specialty Care offices, and more than 3,000 physicians, serving over 635,000 patients. The organization supports academics and research as the principal teaching affiliate for the University of Chicago Pritzker School of Medicine. Recognized for nursing excellence, NorthShore is a Magnet designated organization--the first system in Illinois to receive this prestigious honor. NorthShore has an established reputation and employs over 12,500 people.&nbsp;</p><p>&nbsp;</p><p>When you work for NorthShore, you will be part of an organization that encourages its employees to achieve career goals and maximize their professional potential.</p><p>&nbsp;</p><p>Please explore our website <span class=\"long-word\">(www.northshore.org)</span> to better understand how NorthShore delivers on its mission \"to preserve and improve human life\" through superior clinical care, academic excellence and innovative research.&nbsp;</p><p>&nbsp;</p><p>NorthShore is committed to working with and providing reasonable accommodation to individuals with disabilities. Please refer to the main career page for more information.</p><p>&nbsp;</p><p>EOE: <span class=\"long-word\">Race/Color/Sex/Sexual</span> Orientation/ Gender <span class=\"long-word\">Identity/Religion/National</span> <span class=\"long-word\">Origin/Disability/Vets,</span> VEVRRA Federal Contractor.&nbsp;</p><p>&nbsp;</p><p>#ZRNC</p></div></div>",
        "index": 18,
        "skills": [
            "project management",
            "information technology",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Healthcare Policy Intern (8739)",
        "company": "Methodist Healthcare Ministries of South Texas",
        "location": {
            "city": "San Antonio",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/df62f3f3b977b5b54daf775c077c1686?lvk=KtGkz51KSLUi7fGTXkYR2g.--M3BvA5tfw",
        "posted": "2021-06-04T04:32:15.784Z",
        "lastScraped": "2021-06-10T04:32:15.784Z",
        "description": "<div><div><p>The mission of Methodist Healthcare Ministries of South Texas, Inc. (MHM) is \"<em>Serving Humanity to Honor God</em>\" by improving the physical, mental and spiritual health of those least served in the Rio Texas Conference area of The United Methodist Church.</p><p>Part- Time Healthcare Policy Intern</p><p>4507 Medical Drive</p><p>&nbsp;</p><p><b>Organization's Mission and Commitment to Health Equity:</b></p><p>The mission of Methodist Healthcare Ministries of South Texas, Inc. (MHM) is \"<em>Serving Humanity to Honor God</em>\" by improving the physical, mental and spiritual health of those least served in the Rio Texas Conference area of The United Methodist Church. The Board of Directors approved a strategic plan in October 2019 that places health equity at the center of the work MHM wants to do. The Board of Directors approved the following statement:</p><p><em>Methodist Healthcare Ministries of South Texas, Inc. believes that to improve the wellness of the least served and fully live out its mission of \"Serving Humanity to Honor God,\" it must recognize the inequities inherent in its communities that contribute to poor health outcomes. Health Equity is both the process and goal by which Methodist Healthcare Ministries seeks to carry out that purpose. Health Equity is a framework of thought and action that strives to reduce racial and socio-economic disparities and create fair and just opportunity for every person to reach their full potential for health and life and contribute to that of others.</em></p><p><b>Essential Duties:</b></p><p>&nbsp;</p><ul><li>Assist with research and drafting advocacy documents used with organizations and legislative offices, including fact sheets, advocacy alerts, reports, position papers, presentations, newsletters, and coalition letters</li><li>Monitor and track legislative hearings, regulatory agencies and coalition meetings with expectation of developing notes, summaries, reports, and briefs in a timely manner</li><li>Assist with the scheduling and planning of legislative and advocacy meetings and events</li><li>Assist with outreach to community partners, healthcare stakeholders and elected officials on healthcare issues, meetings, and events</li><li>Assist the team with day-to-day logistics, including administrative responsibilities related to policy and advocacy work</li><li>Perform other duties as assigned<br> &nbsp;<br><b>Knowledge, Skills &amp; Abilities:</b></li></ul><p>This position requires: Skills necessary to read, analyze and interpret scientific and technical journals, and to identify, synthesize and communicate relevant scholarly information. Knowledge of the structure and content of the English language including the meaning and spelling of words, rules of composition and grammar. Ability to write in a manner that conforms to a prescribed style and format. Fluent in English. Strong interpersonal and collaboration skills with a team-oriented approach, proven ability to be flexible in job role, and adaptability to changing dynamics of a department. Effective communication with supervisor to ensure needs are met to perform the work effectively.</p><p><b>Opportunities for Intern</b></p><p>Intern will have the opportunity to improve: information gathering skills, ability to synthesize and communicate technical information with a lay audience, presentation skills, ability to work in office environment with standard office technology, ability to use research software, understanding of industry-specific health technology and IT.</p><p><b>Qualifications: </b></p><p>Individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.&nbsp;</p><p>&nbsp;<b><span class=\"long-word\">Education/Experience:</span></b></p><p>Applicant must be currently enrolled in a graduate program with a focus on healthcare and/or public policy.</p><p>&nbsp;<b>Reasoning Ability:</b></p><p>Must possess strong written and oral communication skills, and well as strong interpersonal skills. Ability to prioritize multiple assignments, sometimes with pressing time pressures. &nbsp;Ability to collect data, establish facts, and draw valid conclusions. Ability to interpret a variety of technical information with abstract and concrete variables.&nbsp; Ability to synthesize principles and trends from a broad array of information.</p><p>&nbsp;<b>Computer Skills: </b></p><p>Demonstrate working knowledge of the Internet and Microsoft Office Suite: Outlook, PowerPoint, Word and Excel applications. Experience with research software a plus.</p><p><b>Other: </b></p><p>Must be able to drive and have access to a vehicle; maintain valid driver's license and auto liability insurance.&nbsp; </p><p>Punctuality and attendance are essential. Must be able to work independently and be willing to ask team members for clarification to maintain effective workflow. Expected to know basic information about MHM services, willing to follow protocol and chain of command, and dress and speak professionally.</p><p>&nbsp;<b>Work Environment and Physical Demands: </b></p><p>The work environment characteristics described here are representative of those a team member encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p>While performing the duties of this job, the team member may be exposed to a medical office environment having direct contact with patients and clients. Position necessitates bending, stooping, twisting, turning, walking, climbing step stools, sitting and standing for periods of time. Must be able to lift and maneuver at least 25 pounds.</p><p><strong>Methodist Healthcare Ministries (MHM) and subcontractor(s) shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, protected veteran status or disability.</strong></p><p>Methodist Healthcare Ministries (MHM) provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.</p><p>MHM complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.</p><p>MHM expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability&nbsp;of MHM's employees to perform their expected job duties is absolutely not tolerated.</p><p>MHM makes reasonable accommodations for individuals with disabilities who are otherwise qualified to perform a job unless such accommodation would impose an undue business hardship.&nbsp; Please let us know if you need an accommodation to participate in the application process.&nbsp; We can be reached at 210-692-9423 or email Diane Rodriguez at <span class=\"long-word\">drodriguez1@mhm.org</span> or fax at 1888-653-3968.</p><p>Alternative application methods are available for individuals who are unable to use or access our online application system.&nbsp; For assistance, please contact our Corporate Recruiter Diane Rodriguez at 210-692-9423 or email her at <span class=\"long-word\">drodriguez1@mhm.org.</span></p><p>&nbsp;</p></div></div>",
        "index": 19,
        "skills": [
            "information technology",
            "software engineering",
            "cybersecurity"
        ],
        "contact": "210-692-9423",
        "remote": false
    },
    {
        "position": "Research Intern",
        "company": "Zymo Research",
        "location": {
            "city": "Irvine",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/zymo-research-e833eb0d/research-intern-e2bbf491?lvk=7-p9FUNjjGyGk0iuzCqTYQ.--M3NEzAZAR",
        "posted": "2021-06-04T04:32:17.011Z",
        "lastScraped": "2021-06-10T04:32:17.011Z",
        "description": "<div><p><strong>DESCRIPTION:</strong><br>Zymo Research Corporation (ZRC), a rapidly growing biotechnology company located in Southern California, is seeking a Research Intern for immediate hire. Zymo Research specializes in the design and manufacture of the most refined and efficient products used for the isolation, purification, and manipulation of DNA and RNA.<br><br><strong>Summary:</strong><br>Working side by side with some of the most talented people in biotechnology, the successful applicant will participate in semi-independent product research and development efforts. Interns will play a key role as members of project teams in research, development, and manufacturing that complement their college curricula with relevant hands-on experience.<br><br><strong>KNOWLEDGE, SKILLS, AND ABILITIES:</strong><br>Product Development</p><ul><li>Assist the Principal Investigator with research methods, experiments, data collection and data interpretation.</li><li>Carry out high-level, complex research activities.</li><li>Ensure products maintain consistent performance.</li></ul><p>Manufacturing</p><ul><li>Light manufacturing responsibility for chemical assembly of DNA, RNA ZRC kits.</li></ul><p>Quality Control</p><ul><li>Quality control over ZRC products through quality control experiments.</li></ul><p>Developing and writing project protocols</p><ul><li>Maintaining quality control measurements.</li><li>Filing and collating project documentation including ZRC Laboratory Notebook and quality control reports.</li></ul><p></p><p><strong>Qualifications:</strong></p><ul><li>Comfortable with lab research and lab surroundings</li><li>Ability to work 15-20hrs/week</li></ul><p><strong>Education:</strong></p><ul><li>To be eligible for this position, you must have completed your sophomore year at an accredited college or university</li><li>Education in Biology or Chemistry</li><li>Minimum 3.0 GPA for consideration</li></ul><p><strong>Core Competencies:</strong></p><ul><li>Interpersonal skills</li><li>Team Player</li><li>Communication skills - verbal and written</li><li>Listening skills</li><li>Problem analysis and problem-solving</li><li>Attention to detail and accuracy</li><li>Data collection and ordering</li><li>Adaptability</li><li>Initiative</li><li>Stress tolerance</li></ul></div>",
        "index": 20,
        "skills": [
            "project management",
            "cybersecurity"
        ],
        "remote": false
    }
]