[
    {
        "position": "Clinical Supervisor - Mental Health",
        "company": "Community Research Foundation",
        "location": {
            "city": "Oceanside",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/community-research-foundation-fd0c2678/clinical-supervisor-mental-health-bec38542?lvk=Yy-PFI7q6A1gRfDU3q9CLw.--M6gS139xw",
        "posted": null,
        "lastScraped": "2021-07-22T08:23:37.689Z",
        "description": "<div><p><strong>Clinical Supervisor (4723)</strong> (Regular Part-Time, Hourly)<br><strong>Program/Location:</strong> Turning Point Crisis Center (Oceanside)</p><p><strong>Clinical Supervisor – Mental Health Services for Transitional Residential Program</strong></p><p><strong>Hours</strong>: 18 hours per week; schedule is flexible and will be determined with program management. Some remote work may be available.</p><p><strong>Community Research Foundation (CRF) inspires and mentors the next generation of mental health professionals!</strong></p><p>At CRF, we are constantly evolving and developing fresh approaches to meet the needs of San Diego County’s residents who are experiencing mental/behavioral health challenges. You will work within a collaborative, supportive team structure so that you can provide fresh perspective and training to our students and staff.</p><p>You will be involved in helping people change their lives for the better! We have strong internal advancement options, so there are opportunities for you to grow within our company.</p><p></p><p><strong>Where will I work?</strong><br><br>Located in Oceanside, CA, Turning Point Crisis Center is a Short Term Acute Residential Treatment (START) program provides intensive, community-based crisis residential services for adults throughout San Diego County. We deliver a unique alternative to psychiatric hospitalization to clients who are experiencing a psychiatric crisis of such magnitude so as not to be manageable on an outpatient basis. Our services are provided in a home-like environment that specializes in the psychosocial rehabilitation of each individual.</p><p>Built around a bio-psychosocial approach, our multi-disciplinary team addresses each aspect of a client's unique situation, including mental health, co-occurring substance abuse, housing, medical/medication needs, and establishing connections to social service supports within the community to facilitate successful transition beyond the START program.</p><p><strong>Typical Duties of a Clinical Supervisor: </strong>You're a key part of our <span class=\"long-word\">mentoring/consulting</span> team for our interns and practicum students, including:</p><ul><li>Provides individual and group supervision of interns and practicum students from various local college programs</li><li>Follows Professional Board requirements and educational institution contracts and requirements</li><li>Participates in utilization management</li><li>Reviews and co-sign clinical records</li><li>Is available for on-call clinical consultation</li></ul><p><strong>Required Skills and Qualifications:</strong></p><ul><li>Current and valid license to practice as a LCSW, LMFT, LPCC, or PsyD/PhD in California and must be kept current during length of employment</li><li>Experience working with the severe and persistent mentally ill population and with adults/older adults is required; experience with co-occurring disorders also strongly preferred</li><li>Eligible to provide clinical supervision per Board of Behavioral Sciences criteria</li><li>Previous supervisory experience is preferred</li><li>Basic computer skills are required; proficiency in MS Office applications required</li><li>Ability to thrive in a fast-paced environment is essential</li><li>Ability to pass <span class=\"long-word\">criminal/background</span> clearance</li></ul><p>Be a part of our vibrant non-profit organization and make a difference in the lives of the people we serve!</p><p></p><p><strong>We are an Equal Opportunity Employer</strong></p></div>",
        "index": 1,
        "skills": [
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Marketing Intern",
        "company": "Entertainment Marketing Group",
        "location": {
            "city": "Santa Monica",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/entertainment-marketing-group-f449dd18/marketing-intern-3c5a4f0b?lvk=BtmYY6IQqlCp8f9PeHjNng.--M6_jVbpWg",
        "posted": "2021-07-21T08:23:39.612Z",
        "lastScraped": "2021-07-22T08:23:39.612Z",
        "description": "<div><p>Entertainment Marketing Group is looking for a highly motivated, outgoing and organized Marketing Intern to assist the company’s Head Marketing Assistant. Qualified candidates MUST have experience utilizing SEO tactics when executing marketing campaigns, as well as handling copious amounts of data. EMG is seeking a team player that is solutions and results oriented, as well as someone who can juggle multiple projects at once with high levels of enthusiasm.</p><p>Job Responsibilities:</p><p>· Help this Assistant with filing, data management, research, and other administrative tasks.</p><p>· Assist the CEO of the company, as well as other internal personnel, with administrative duties as assigned.</p><p>· Organize files and ensure that paperwork is handled with care; complete clerical duties thoroughly and efficiently.</p><p>· Occasionally create and/or edit copy and analyze the effectiveness of EMG’s various marketing strategies; work with Adobe software as needed.</p><p>· Draft reports and handle miscellaneous projects for clients and departments as assigned.</p><p>· Communicate regularly with high-level executives, clients, vendors and internal staff on a daily basis.</p><p>· Occasionally assist with graphic design projects and other marketing-related projects.</p><p>Required Qualifications:</p><p>· MINIMUM 1-2 years of administrative support experience.</p><p>· Preferred 1-2 years of experience in marketing, communications, and/or business administration.</p><p>· Must be pursuing a bachelor’s degree in a related field or have graduated within a year.</p><p>· Must be available 2-3 days a week. The Intern will be expected to come into the office each workday (located in Santa Monica, CA- COVID compliant).</p><p>· Must be computer literate and have extensive knowledge of/experience with Microsoft Outlook, Excel, Word and PowerPoint (knowledge of Google Suite and entire Adobe Creative Cloud is a BIG plus!).</p><p>· Must have excellent research and analysis skills.</p><p>· Must have refined written and verbal communication skills, as this position requires extensive collaboration with colleagues both internally and externally.</p><p>· The Intern will wear many hats within the company, so being a detail-oriented multitasker is key.</p><p>· Must be able to work well in a fast-paced environment under tight deadlines.</p><p>· Must be comfortable taking the initiative and working both independently and as part of a team.</p><p>· Must have excellent interpersonal skills and be able to maintain a positive attitude, even under stressful circumstances.</p><p>This internship will be unpaid, but college credit will be provided if necessary.</p><p>Please DO NOT APPLY if your experience does not meet the above requirements.</p><p>If interested in applying, please email <span class=\"long-word\">emgpostings@gmail.com</span> with your resume and cover letter detailing your qualifications, and how you think you stand apart from other applicants. You will NOT be considered for this internship if you do not submit both a resume and cover letter. Our office is very busy, and we will only be contacting the candidates with whom we would like to move forward.</p></div>",
        "index": 2,
        "skills": [
            "project management",
            "software engineering",
            "cloud computing"
        ],
        "compensation": "unpaid",
        "contact": "emgpostings@gmail.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "R&D FX Engineering Intern (Virtual), DreamWorks, Fall 2021",
        "company": "Comcast Sales",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8e1449c24b152890e950eb6c6abfe966?lvk=7ht7U_BzN72W8nO7Y9LDCw.--M6I8q4j8F",
        "posted": "2021-07-17T08:23:52.859Z",
        "lastScraped": "2021-07-22T08:23:52.859Z",
        "description": "<div><div><p>Job Title: R&amp;D FX Engineering Intern (Virtual), DreamWorks, Fall 2021 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: </p><p>DreamWorks is excited to announce that we are currently accepting resumes for our Fall 2021 Software Engineering Internship for FX/CFX&nbsp; within our Research &amp; Development and Creative Technologies teams. The engineering teams at DreamWorks develop state-of-the-art techniques, algorithms, and tools that are core to the production of our CG animated films. <br><br>During the course of a 10-week internship, interns will design, implement, and support aspects of the company's proprietary software tools. They will work closely with our world-class artists and top engineers in this field.&nbsp; Some of our engineers started themselves as interns here at Dreamworks and are now leading efforts that are recognized industry-wide. <br><br><b>Interns will learn to:</b></p><div>Create unique software solutions that unleash the highly ambitious and creative visions of our artists</div><div>Innovate to provide our world-class artists with the best tools and deliver a competitive advantage to the studio</div><div>Work hand-in-hand with the most talented artists anywhere and have an immediate, positive impact on their work</div><div>Work in a collaborative environment</div><div>Develop problem-solving skills</div><br>Job Number: 62033BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation TV Production <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> What We Are Looking For:<br> Current student/recent grad majoring in Computer Science, Computer Graphics, Physics, and Mathematics or related field(s)<br> Strong interest in animation; passion for how technology and art work together<br> Dedicated, resourceful, an excellent communicator, possesses critical thinking skills, and is a team player.<br> Ability to commit ten weeks part-time (16-24 hours/week) and work remotely from September 2021 - December 2021<br> Must be 18 years of age or older<br> Must have strong grades and excellent written and oral communication skills.<br> Must have own equipment (computer, webcam, headphones, etc.) and stable Internet connection<br> Must be authorized to work in the United States without visa sponsorship <br>Desired Characteristics: Your resume and cover letter <br> A link to any websites (Github, Stack Overflow, etc) or blog indicating technical skills such as math and programming. <br> Relevant coursework listed at the top of your resume is helpful as well. <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></div></div>",
        "index": 3,
        "skills": [
            "information technology",
            "virtual reality",
            "software engineering",
            "networks",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Treasury Management Internship",
        "company": "Fidelity Bank (KS)",
        "location": {
            "city": "Wichita",
            "state": "Kansas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2d2f4063703acd7d63a8ccea946a8019?lvk=VHIMkbfGrUFvMNU1MwKmLg.--M6gJOlbkZ",
        "posted": "2021-07-21T08:23:54.374Z",
        "lastScraped": "2021-07-22T08:23:54.374Z",
        "description": "<div><div><p><strong>TREASURY MANAGEMENT INTERNSHIP </strong></p><p>Our highly competitive internship program provides candidates with the opportunity to gain the best hands-on experience that banking has to offer. Fidelity Bank offers real-world opportunities to work in treasury management. The paid internship program will be completed over a sixteen-week period beginning August 16 to December 9, 2021, working a maximum of 20 hours a week. Tasks may include performing administrative and clerical tasks for the local headquarters.</p><p>Requirements for the position include a high school diploma (or equivalent), detail oriented, strong written and verbal communication skills and basic computer skills.</p></div></div>",
        "index": 4,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Retail Operations - Floater - Internship",
        "company": "Fidelity Bank",
        "location": {
            "city": "Wichita",
            "state": "Kansas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0fb2ba9ed68812b24c11403d84de8ad6?lvk=hs_4t4X-W2y0JH55D44XMQ.--M6gJ8eBpV",
        "posted": "2021-07-21T08:24:02.893Z",
        "lastScraped": "2021-07-22T08:24:02.893Z",
        "description": "<div><div><p><strong>RETAIL OPERATIONS - FLOATER INTERNSHIP</strong></p><p>Our highly competitive internship program provides candidates with the opportunity to gain the best hands-on experience that banking has to offer. Fidelity Bank offers real-world opportunities to work in retail operations. The paid internship program will be completed over a sixteen-week period beginning August 16 to December 9, 2021, working a maximum of 20 hours a week. Tasks may include assisting updating procedures and manuals, reviewing accounts and assisting with various special projects. &nbsp;&nbsp;</p><p>Requirements for the position include a high school diploma (or equivalent), detail oriented, strong written and verbal communication skills and basic computer skills.</p></div></div>",
        "index": 5,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "User Research Intern",
        "company": "MINDBODY",
        "location": {
            "city": "Remote",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/mindbody-ee7a2b6f/user-research-intern-31446d65?lvk=gkvprg1iZmccQbQcm9HISg.--M6CGoq6v-",
        "posted": "2021-07-15T08:24:05.568Z",
        "lastScraped": "2021-07-22T08:24:05.568Z",
        "description": "<div><div><div><p>The User Research Internship is a part-time, 6 month program that supports the academic growth of students enrolled in a college/university with an interest in the User Experience field, with the potential for full-time hire after graduation. Interns will gain practical, hands-on experience in various research methodologies, with a focus on survey creation, interviewing, usability testing, and <span class=\"long-word\">screening/recruiting</span> participants. Interns will work remotely for 20-25 hours per week on a set (but flexible) schedule. </p></div><div><p>Job Responsibilities </p></div><div><p>I. Prepare, Conduct, Analyze Research </p></div><div><ul><li><p>Create surveys using Alchemer </p></li></ul></div></div><div><div><ul><li><p>Run usability tests and interview clients on the zoom/in person </p></li><li><p>Analyze quantitative and qualitative research </p></li><li><p>Prepare research readouts/decks that effectively communicate research findings to stakeholders </p></li></ul></div><div><p>II. Recruit Research Participants </p></div><div><ul><li><p>Work with User Researchers to determine target-user traits/criteria </p></li></ul></div></div><div><div><ul><li><p>Create screeners to ensure participants meet the criteria </p></li><li><p>Pull lists of clients who qualify for research </p></li><li><p>Use Ethn.io tool to schedule the research meetings, most of which happen via Zoom </p></li><li><p>Schedule and invite team members to research sessions using Outlook </p></li><li><p>Compensate clients who have participated in a research study via our gift card platform </p></li></ul></div></div><div><div><p>III. Support the User Research Team </p></div><div><ul><li><p>Take detailed notes during research sessions and brainstorm meetings </p></li><li><p>Contact clients via email and phone to book research sessions in person or remotely </p></li><li><p>Support the workload of User Researchers &amp; Recruiters as needed </p></li></ul></div><div><p>Desired Research Experience </p></div></div><div><div><ul><li><p>Experience conducting research in the social sciences or humanities </p></li><li><p>Experience analyzing/coding qualitative and/or quantitative data </p></li><li><p>Experience interviewing research participants </p></li><li><p>Experience building rapport with research participants </p></li></ul></div><div><p>We’re looking for you to… </p></div></div><div><div><ul><li><p>Be excited about User Experience Research and a drive to learn about the broader UX field </p></li><li><p>Be outgoing and very comfortable talking to clients on the phone/interviewing them </p></li><li><p>Be incredibly organized and capable of juggling multiple projects at the same time </p></li><li><p>Be self-driven, finding innovative ways to help the team when there is lull in your task load </p></li><li><p>Fully own research projects from start to finish, while keeping manager up-to-date on their status </p></li></ul></div></div><div><div><ul><li><p>Be proficient in Google Docs and Spreadsheets </p></li></ul></div><div><p></p></div><div><p>Education </p></div><div><p>Be currently enrolled in a <span class=\"long-word\">college/university,</span> preferably in a UX or Research-related program (Psychology, Anthropology, Sociology, Computer Science, Graphic Design, Industrial Design) </p></div><div><p></p></div></div><div><p></p></div></div>",
        "index": 6,
        "skills": [
            "project management",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Engineering Intern",
        "company": "Sony Electronics",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/272ac4e6c8343fbb9c7981e804de49e0?lvk=VaJcD66lmJ0wel5FYjKBtg.--M6E94Geks",
        "posted": "2021-07-14T08:24:08.460Z",
        "lastScraped": "2021-07-22T08:24:08.460Z",
        "description": "<div><div><p>Sony Electronics, Inc. look for the risk-takers, the collaborators, the inspired and the inspirational. We want the people who are brave enough to work at the cutting edge and create solutions that will enrich and improve the lives of people across the globe. So, if you want to make the world say wow, let's talk.</p><p></p><p></p><p>Sony Electronics - Image Sensor Design Center (ISDC) is seeking a summer intern to join Spetctral Sensing Team based in San Jose, CA. This team is responsible for the application development using our new multi-spectral image sensor for new business exploration.</p><p></p><p>The ideal student candidate will have a strong interest and background in image signal processing algorithm and/or machine-learning.</p><p>Completion of an Computer Science or Electrical Engineering or equivalent is necessary.</p><p></p><p>The ideal student candidate will also be able to demonstrate a strong understanding of camera system, including the image signal processing or machine-learning.</p><p>Prior experience with CMOS image sensors is a plus.</p><p>The internship date is from July to September 2021.</p><p></p><p>Requirements:</p><ul><li><p>3rd, 4th, or 5th year undergraduate or current MS student in Computer or Electrical Engineering</p></li></ul><p></p><p>Candidate must have the following:</p><ul><li><p>Skills to write signal processing or machine learning programs using python etc.</p></li><li><p>Knowledge of algorithms in image processing or machine learning</p></li></ul><p></p><p></p><p></p><p></p><p></p><p></p><p>Sony Electronics is an Equal Opportunity Employer that values employees with a broad cross-cultural perspective. We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond. All applicants will receive fair and impartial treatment without regard torace, color, religion, sex, national origin, ancestry, citizenship status, age, legally protected physical or mental disability, protected veteran status, status in the U.S. uniformed services, sexual orientation, gender identity or expression, marital status, genetic information or on any other basis which is protected under applicable federal, state or local law.</p><p></p><p>Disability Accommodation for Applicants to Sony Electronics, Inc.</p><p>Sony Electronics, Inc. provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at <span class=\"long-word\">talenthelp@am.sony.com,</span> or you can mail your resume to: Sony Electronics, Human Resources Department, 16535 Via Esprillo, San Diego CA 92127.Please indicate the position you are applying for.</p><p></p><p>EEO is the Law</p><p>EEO is the Law Supplement</p><p>Right to Work (English/Spanish)</p><p>E-Verify Participation (English/Spanish)</p></div></div>",
        "index": 7,
        "skills": [
            "machine learning",
            "software engineering",
            "python",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Global Product Support Engineer",
        "company": "Intel",
        "location": {
            "city": "Folsom",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/08e19549e5e756be731162f03475827c?lvk=Lt5L88qzKDdNPawGhb1s_Q.--M6gJtg4G7",
        "posted": "2021-07-20T08:24:09.924Z",
        "lastScraped": "2021-07-22T08:24:09.924Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>Responsibilities may be quite diverse of a nonexempt technical nature. U.S. experience and education requirements will vary significantly depending on the unique needs of the job. Job assignments are usually for the summer or for short periods during breaks from school.</p><p></p><p></p><b>Qualifications:</b><p>This position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience.</p><p></p><p></p><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience would be obtained through a combination of prior education level classes, and current level school classes, projects, research and relevant previous job and/or internship experience.</p><p></p><p></p><p><b>Minimum Qualifications:</b></p><p></p><p>-Candidate should be pursuing a Bachelor's degree in Computer Science, Computer Engineering or related field.</p><p>-3+ month of working experience or knowledge in Graphics or Gaming technical knowledge.</p><p>-Minimum GPA: 3.0</p><p>Must be able to work part time (10-20 hours/week) during the school year with the option for full time in summer.</p><p></p><p><b>Preferred qualifications:</b></p><p></p><p>3+ months of working experience or knowledge:</p><p></p><p>-With customers.</p><p>-Participating and reading through or commenting on topic-oriented web community forums (Reddit, Twitch, etc.)</p><p>-Optimizing gaming performance with a PC.</p><p>-With Intel graphics or graphics, features and capabilities</p><p></p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, California, Folsom<p></p><p></p>Additional Locations:<p></p><p></p><p></p><p></p>Business group:Intel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. SMG works across business units to amplify the customers voice and deliver solutions that accelerate their business. Our teams work across the entire sales cycle, pushing ingredient products to our \"billings\" customers while also pulling end solutions through to \"consumption\". We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>",
        "index": 8,
        "skills": [
            "information technology",
            "software engineering",
            "project management",
            "game design"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Quality Assurance (QA) Laboratory Technician-Intern",
        "company": "Kroger",
        "location": {
            "city": "Winchester",
            "state": "Kentucky",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/25712d2f550d38c260c0e2ffa993db67?lvk=aEU-WhffRRMCfYuBFjLtPw.--M6gQq7I4R",
        "posted": "2021-07-15T08:24:11.016Z",
        "lastScraped": "2021-07-22T08:24:11.016Z",
        "description": "<div><div><p>Winchester Farms Dairy is looking for a food/biological science major for an internship in our QA Lab. This part-time position is scheduled around your major program and will give you hands-on experience in a dairy manufacturing setting, learning from talented QA professionals.</p><p></p><p><b>Company Name:</b>Winchester Farms Dairy<br><b>Position Type:</b>Intern<br><b>FLSA Status:</b>Non-Exempt<br></p><p></p> Position Summary: <p>Participate in programs to sustain compliance with Kroger Manufacturing Food Safety and Quality requirements. Responsible for product tests, audits and calibrations. Perform all jobs safely, efficiently and accurately to maintain and improve the performance of the entire plant in the areas of SQR and our Customer 1st strategy. Provide leadership that embodies our 7 Kroger Manufacturing High Performance Work System principles. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety.</p> Essential Job Functions: <ul><li>Perform required product tests, audits and calibrations to ensure food safety and ensure consistent quality.</li><li>Maintain accurate documentation.</li><li>Complete tasks on \"If down, do\" lists.</li><li>Complete safety observations as assigned.</li><li>Keep work area neat and clean.</li><li>Ability to work overtime.</li><li>Follow established programs, policies and practices to produce safe, quality foods that meet regulatory and company requirements.</li><li>Support the development, implementation, maintenance, and ongoing improvement of the SQF 2000 Systems.</li><li>Accountable to the Kroger Manufacturing Food Safety and Quality Principles.</li><li>Must be able to perform the essential functions of this position with or without reasonable accommodation.</li></ul> Minimum Position <span class=\"long-word\">Qualifications/Education:</span> <ul><li>Must be at least 18 years of age</li><li>High school diploma or GED</li><li>Basic math and computer skills</li><li>Strong oral and written communication skills</li></ul> Desired Previous Job <span class=\"long-word\">Experience/Education:</span> <ul><li>Associate degree in related field</li><li>Minimum of two years previous quality assurance lab experience</li><li>Knowledge of food safety programs, microbiological and sanitation concepts</li><li>Functional knowledge and use of Microsoft Office</li></ul><p></p><p><strong>Leadership Behaviors:</strong>Achieves Results through Teamwork, Coaches and Develops Others, Communicates Effectively and Candidly, Executes with Excellence, Leads Change and Innovation, Leads through Positive Influence, Provides Clear and Strategic Direction, Puts the Customer First. For more information on the Kroger Leadership Behavior model, clickhere.</p><p></p><p></p><p><strong>Education Level:</strong>High School Diploma/ GED Required<br><strong>Required <span class=\"long-word\">Certifications/Licenses:</span></strong>None<br><strong>Shift(s):</strong>Day; Evening; Overnight<br><strong>Regions:</strong>Midwest</p><p><br></p><p></p><p></p></div></div>",
        "index": 9,
        "skills": [
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Career Training Program (CTP) - Manufacturing Operations Leadership",
        "company": "Kroger",
        "location": {
            "city": "Irving",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1015ad703929ea110ae9dbf3456c20b6?lvk=n_HVW3c6WPA5MKDx7evy-Q.--M6gQV6lwc",
        "posted": "2021-07-21T08:24:12.504Z",
        "lastScraped": "2021-07-22T08:24:12.504Z",
        "description": "<div><div><p><b>Company Name:</b>America's Beverage<br><b>Position Type:</b>Employee<br><b>FLSA Status:</b>Non-Exempt<br></p><p>Are you ready to drive efficiency and sustainability, improve operations, and fuel our growth in the U.S.?We're looking for people who are resourceful - true problem solvers who challenge themselves to find the most effective and efficient solutions to complex challenges to join our Operations Career Training Program (CTP). This program is an exciting avenue to gain experience in manufacturing operations, quality control, supply chain, and engineering, in preparation for future leadership roles with us.</p><p></p><p>In this program, you'll experience cross-functional rotations designed to give you a solid foundation and on-the-job experience to enhance your understanding of critical business operations.You will learn from Kroger leaders, hear from industry experts, and roll up your sleeves experiencing all functions of the company. You will engage in challenging and dynamic experiences throughout various Kroger business locations, product lines, and functional groups (Finance, Marketing, Food Science, Supply Chain, Operations, Human Resources, Quality etc.).</p><p></p><p>If you love and want a career in Manufacturing Operations Leadership, the Career Training Program is for you.</p><p></p><p>PLEASE NOTE: Mobility for promotion to additional plants throughout the United States is expected. <br></p> Position Summary: <p>Entry level professional opportunity for recent college graduates. The CTP Program is designed to prepare candidates for first level leadership positions upon successful completion of the 12-24 month program. CTPs build technical and leadership competencies in the selected area of expertise while gaining a broad knowledge base of all core business functions critical to the manufacture of Kroger products. Relocation is a requirement of the CTP Program. Perform all jobs safely, efficiently and accurately to maintain and improve the performance of the entire division in the areas of Safety, Quality, Reliability (SQR) and our Customer 1st strategy. Provide leadership that embodies our 7 Kroger Manufacturing High Performance Work System Principles. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety.</p> Essential Job Functions: <ul><li>Initiate active development through interactions with team members, mentors, Corporate and Plant sponsors</li><li>Demonstrate excellence in project planning, execution, and timing through project evaluation and use of available resources to expedite project completion</li><li>Participate in the multi-faceted orientation process</li><li>Demonstrate commitment inthe plant safety process</li><li>Contribute and participate in practical, challenging and meaningful assignments</li><li>Follow established programs, policies and practices to produce safe quality foods that meet regulatory and company requirements</li><li>Support the development, implementation, maintenance, and ongoing improvement of the SQF Systems</li><li>Accountable to the Kroger Manufacturing Food Safety and Quality Principles</li><li>Must be able to perform the essential functions of this position with or without reasonable accommodation</li></ul> Minimum Position <span class=\"long-word\">Qualifications/Education:</span> <ul><li>Must relocate as a requirement of the CTP Program</li><li>Experience through internships, part time, or full time positions</li><li>Self-motivated; able to meet deadlines with limited supervision</li><li>Strong oral and written communication skills</li><li>Strong attention to detail, with high degree of accuracy and precision</li><li><strong>Administration</strong>: Bachelor's degree in Business or related field</li><li><strong>Engineering</strong>: Bachelor's degree in Mechanical or Electrical Engineering</li><li><strong>Finance</strong>: Bachelor's degree in Accounting/Finance</li><li><strong>Human Resources</strong>: Bachelor's degree in Human Resources or related field</li><li><strong>Manufacturing Information Technologist (MIT)</strong>: Bachelor's degree in Computer Engineering or Computer Science, Microsoft (MS) Certified IT Professional (MCITP) or MS Certified Systems Administrator (MCSA) with emphasis in MS Windows 2008 Server and MS SQL 2008 database management; or MS Certified Technology Specialist certifications in Windows 7, MS Windows 2008 Server, and MS SQL Server 2008</li><li><strong>Operations</strong>: Bachelor's degree in Operations Management or related field</li><li><strong>Quality Assurance</strong>: Bachelor's degree in Food Science, Biological or Chemical Sciences; knowledge of Dairy/ Bakery/Grocery Food Science or Product Development</li></ul> Desired Previous Job <span class=\"long-word\">Experience/Education:</span> <ul><li>Graduate degree in discipline related field</li><li>Experience in manufacturing environment</li><li>Experience in union environment</li></ul><p></p><p><strong>Education Level:</strong>Bachelor's Required<br><strong>Required Travel:</strong>Up to 25%<br><strong>Required <span class=\"long-word\">Certifications/Licenses:</span></strong>None<br><strong>Position Type:</strong> Full-Time<br><strong>Regions:</strong>South</p><p><br></p><p></p><p><strong>Jobs at Kroger Manufacturing:</strong>Through quality products, strong individual commitments and team spirit, Kroger has been established as a leader in the manufacturing industry. Kroger Manufacturing provides career development programs aligned with aspirations in Engineering, Process Management, Information Systems, Quality Assurance, Operations Management, Human Resources, Finance and Procurement. Our work force programs provide technically challenging rotations with cross-functional teams, plants and locations to allow our Associates to learn from some of the brightest minds in the business. Experience and training combined with mentoring and guidance from plant sponsors prepare our Associates with the skills and leadership behaviors needed to achieve a successful career at Kroger.</p><p></p><p><strong>Company Overview:</strong>Kroger Family of Companies employs nearly half a million associates who serve over 11 million customers daily through a seamless shopping experience under a variety of banner names. At The Kroger Co., we are Fresh for Everyone and dedicated to our Purpose: To Feed the Human Spirit. We are committed to creating <span class=\"long-word\">#ZeroHungerZeroWaste</span> communities by 2025. Careers with The Kroger Co. and our family of companies offer competitive wages, flexible schedules, benefits and room for advancement.</p><p>Posting Notes: TX||Irving|| 1331 E. Airport Frway ||75062 || America's <span class=\"long-word\">Beverage||None||Manufacturing</span>; Management; Operations ||Employee|| Non-Exempt || Full-Time|| None </p></div></div>",
        "index": 10,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "machine learning",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Performance Specialist",
        "company": "EXOS",
        "location": {
            "city": "El Segundo",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ee388001d86528edcd6ed6d714806be1?lvk=vhGHEfKRRcIYaoYYbvQTBQ.--M6bZQvjFw",
        "posted": "2021-07-20T08:24:13.609Z",
        "lastScraped": "2021-07-22T08:24:13.609Z",
        "description": "<div><div><p>EXOS is a leader in the field of human performance, a category it created more than 20 years ago. For two decades we've stood side by side with the very best, coaching individuals, teams, and communities to higher levels of performance. And we've done it all by pioneering and leveraging sports science and proprietary tools across mindset, nutrition, movement, and recovery.</p><p></p><p>Today, EXOS employs more than 4,000 people in over 400 locations worldwide. With award-winning facilities, sports medicine clinics, technology, and services, EXOS connects people to the solutions they need. We provide comprehensive game plans, regardless of skill and sport, based on time-tested fundamentals and research in order to help people take control of their health and performance. EXOS is trusted by hundreds of clients including leaders in business, technology, health, community organizations, and world champions in sports. Now we're leaning into our rich heritage to move the brand forward. In 2020, EXOS founder and president Mark Verstegen brought on industry vet Sarah Robb O'Hagan as CEO to lead the company into its next chapter.</p><p></p><p>Culturally, we promote and reward humility, one team and tenacity as some of our core values and we are committed to cultivating an inclusive work environment where all of our team members feel empowered to grow and bring their whole selves every day. We celebrate the diverse voices and perspectives of our team members, knowing that diversity of age, race, ethnicity, gender identity, sexual orientation, veteran status and national origin, among other social identities, drive innovation, belonging and fuel our work.</p><p></p><p></p><p><b>Job Summary:</b></p><p></p><p></p><p></p><b>Job Description: </b><p></p><p><b>Responsibilities:</b></p><p>We're looking to add a Performance Specialist to our team! As a Performance Specialist your primary duties will be:</p><ul><li><p>Instructing, motivating, and assisting clients in a safe, legal, moral, ethical manner to achieve their goals.</p></li><li><p>Conducting on-site assessments of clients' health utilizing our proprietary evaluation protocols.</p></li><li><p>Updating training plans and/or re-evaluating clients as needed to ensure optimal outcomes.</p></li><li><p>Maintaining constant communication with clients to ensure goals are being met.</p></li><li><p>Partnering with the employer to conduct various client engagement and educational activities and events, such as lunch &amp; learns, information fairs, campus activities, etc.</p></li><li><p>Presenting EXOS methodology through EXOS education programs.</p></li><li><p>Reporting various metrics to operations, such as attendance, engagement, outreach efforts, and activity level.</p></li><li><p>Participating in program planning and development, as well as design and/or carry out related research.</p></li><li><p>Leading and/or participating in staff education covering all aspects of EXOS methodology.</p></li><li><p>Perform all aspects of position held in a professional manner.</p></li><li><p>Follow established policies and procedures of the company.</p></li><li><p>Maintain professional credentials as required including attending necessary continuing education courses.</p></li><li><p>Some travel may be required.</p></li></ul><p></p><p></p><p><b>The Ideal Candidate will have:</b></p><ul><li><p>Minimum of two years of personal training/strength coaching experience or completion of EXOS Performance Specialist Internship</p></li><li><p>BA/BS Kinesiology or Sports Science or related degree</p></li><li><p>Currently hold industry certification, preferably NSCA-CSCS or NASM</p></li><li><p>Ability to exercise judgment and discretion in the development of exercise prescription</p></li></ul><ul><li><p>Master's Degree in Kinesiology, Sports Science, Rehabilitation or related field.</p></li><li><p>Excellent presentation skills in both small and large group settings</p></li><li><p>Strong customer service skills where servicing the \"client\" is top priority</p></li><li><p>Energy and passion for helping others achieve their personal goals</p></li><li><p>Must be able to work independently with little daily supervision</p></li><li><p>Excellent communication skills, both verbal and written</p></li><li><p>Experience teaching group fitness classes with emphasis on helping improve technique and ability</p></li><li><p>Excellent computer skills including Microsoft Office Suite or related products</p></li></ul><p></p><p><b>Physical Requirements:</b></p><p></p><p>Candidates applying for this position should be able to lift up to 50 pounds unassisted repeatedly throughout the workday. Also, the physical requirements of this job require frequent walking around and demonstrating and assisting with exercise movements; bending, stretching, lifting, pushing, pulling and squatting are movements performed daily</p><p></p><p></p><p><i>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us</i><i>!</i></p><p></p><b>We are an equal opportunity employer</b><p><br>EXOS is proud to be an affirmative action / equal opportunity employer. All qualified applicants will receive consideration without regard to race, creed, gender, marital status, sexual orientation, citizenship status, color, religion, national origin, age, disability, veteran status, or any other status protected under local, state, or federal laws. EXOS provides reasonable accommodation to employees and applicants for employment who have disabilities. You may request reasonable accommodation, in writing, by reaching out to our People Operations department at:</p><p></p><p>Attention: People Operations, Accommodations</p><p>2629 E. Rose Garden Ln.</p><p>Phoenix, AZ 85050</p><p></p><p>Learn more here:</p><ul><li>EEO is the Law</li><li>EEO is the Law Supplement</li></ul></div></div>",
        "index": 11,
        "skills": [
            "information technology",
            "machine learning",
            "game design",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Assistant Director of Athletic Performance",
        "company": "University of the Pacific",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c21269cdfcab00f1eed881d2099b2833?lvk=TLHhTo8pwQDholanT_ofiA.--M6ZgbyrWZ",
        "posted": "2021-07-20T08:24:14.742Z",
        "lastScraped": "2021-07-22T08:24:14.742Z",
        "description": "<div><div><div> Job Title Assistant Director of Athletic Performance Union Level Department Athletics - Administration Campus Stockton Posting Number 201302402P Full or Part Time Full Time Number of Months 12 Work Schedule <div> A non-traditional work week, hours and days will be required to fulfill department needs. Expected to work weekdays, weekends and may include holidays. </div> Position End Date 07/23/2021 Open Date 07/19/2021 Close Date Open Until Filled Yes Special Instructions to Applicants <div> For first consideration, please apply on or before July 23, 2021. </div></div><div> Primary Purpose <div> Under general direction from Director of Athletic Performance is responsible for teaching and instructing student-athletes how to perform in their sport, including sport-specific weight training, conditioning, skills, and safety practices. </div> Essential Functions <ol><li>Instructs and coaches student-athletes, emphasizing sport-specific weight training, conditioning, skills, and safety practices.&nbsp;</li><li>Exercises discretion and judgment in implementing instructional techniques designed to develop student-athlete capacities.&nbsp;</li><li>Integrates innovative technology into the instruction of student-athletes to facilitate learning and safety.&nbsp;</li><li>Identifies proper training levels and creates individual year-round sport-specific training programs for assigned sport teams.&nbsp;</li><li>Administers training sessions using coaching expertise to help reduce the risk of injury, ensure proper technique and manages time of sessions accordingly.&nbsp;</li><li>Develops and oversees student internship program for Athletic Performance. This involves working in conjunction with sports sciences department to assist with teaching labs and any other projects.&nbsp;</li><li>Identifies and responds to appropriate training and conditioning needs of student athletes.&nbsp;</li><li>Oversees weight room operations, which include daily maintenance, repairs and organization.&nbsp;</li><li>Represents and acts on behalf of the Director of Athletic Performance in his/her absence or when assigned or requested.&nbsp;</li><li>Assists Director of Athletic Performance with special projects such as camps, special fundraising events, community outreach, etc.&nbsp;</li><li>Performs other duties as assigned or requested.&nbsp;</li><p></p></ol><div> This position serves as Campus Security Authority ( CSA) as outlined by the Clery Act. CSA's have federally mandated responsibilities to report crimes that are reported to them. </div> Minimum Qualifications <ul><li>Bachelor's degree in a related field.&nbsp;</li><li>Two (2) years of experience in weight training and conditioning at the intercollegiate or professional level.&nbsp;</li><li>Professional certification from either the National Strength and Conditioning Association or Colligate Strength and Conditioning Coaches Association.&nbsp;</li><li>First Aid/CPR certification.</li></ul> Preferred Qualifications <ul><li>Master's degree in a related field.&nbsp;</li><li>Advanced knowledge of exercise <span class=\"long-word\">science/physiology,</span> athletics strength and conditioning practices and coaching techniques.&nbsp;</li><li>Proficient in and comfortable with public speaking.&nbsp;</li><li>Ability to assess athletic skills in student-athletes and develop action plans for desired results.&nbsp;</li><li>Ability to motivate students to achieve expected results.&nbsp;</li><li>Good time management and organizational skills.&nbsp;</li><li>Good written and verbal communication skills.&nbsp;</li><li>Understanding and knowledge of best practices to ensure student-athlete welfare.&nbsp;</li><li>Basic computer skills including basic proficiency with MS Office.&nbsp;</li><li>Solid knowledge of NCAA and conference rules and regulations.&nbsp;</li><li> USAW Level 1 certification.</li></ul> Physical Requirements <div> The physical demands described here are representative but not definitive of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.&nbsp; <br>&nbsp; <br>Requires extended periods of standing and walking. Occasional sitting, climbing stairs, bending, stooping and reaching. Frequent lifting in excess of 25 pounds.&nbsp; <br>&nbsp; <br>Work Environment/Work Week/Travel:&nbsp; <br>Work performed primarily in gymnasium or clinical environment. Outdoor and indoor work will be necessary on a regular basis. A non-traditional work week, hours and days will be required to fulfill department needs. Expected to work weekdays, weekends and may include holidays. Some travel required to attend conferences, offsite events.&nbsp; <br><br>Valid driver's license required. Incumbent must also be able to meet the University's fleet rules and be eligible to drive for University business. The University and its insurance carrier reserves the right to exclude applicants based on their driving record.&nbsp; <br><br></div> Hiring Range Commensurate with experience, exempt Background Check Statement <p>All applicants who receive a conditional offer of employment are required to execute a release and authorization for a background screening.</p> AA/EEO Policy Statement <p>University of the Pacific is an affirmative action and equal opportunity employer dedicated to workforce diversity. In compliance with applicable law and its own policy, Pacific is committed to recruiting and retaining a diverse faculty and staff and does not discriminate in its hiring of faculty and staff, or in the provision of its employment benefits to its faculty and staff on the basis of race, color, religion, national origin, ancestry, age, genetic information, sex/gender, marital status, military and veteran status, sexual orientation, medical condition, pregnancy, gender identity, gender expression, or mental or physical disability.</p></div></div></div>",
        "index": 12,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Clinical Supervisor",
        "company": "Compass Health",
        "location": {
            "city": "Mount Vernon",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-e685e2f8/mental-health-clinical-supervisor-52b7f5e2?lvk=AIp24-mQPBlgJQ3lGb7veA.--M6gGNUxtc",
        "posted": "2021-07-21T08:24:16.940Z",
        "lastScraped": "2021-07-22T08:24:16.940Z",
        "description": "<div><div><p></p></div> <strong>CLINICAL SUPERVISOR / CLINICIAN III (Mount Vernon - Part Time 20 hours/week)</strong> <div><p>The Clinical Supervisor / Clinician III works in conjunction with the Program Manager to ensure that clinicians have appropriate supervision and that clients receive high quality clinical care. This position provides a range of clinically indicated services including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults/older adults with behavioral health conditions. This position is responsible for assessing client functioning and needs, and partnering with the client to develop an individually tailored care plan designated to promote recovery. This position will also provide clinical supervision to MA or BA level clinicians and/or interns and provide crisis coverage as needed. </p><p><br></p><p><strong>EDUCATION / EXPERIENCE / CERTIFICATIONS / LICENSES</strong></p><ul><li>MA/MS/MSW Degree in a Behavioral Science related field. </li><li>Current Washington State Licensure or equivalent in Social Work, Marriage &amp; Family Therapy, or Mental Health Counseling. </li><li>Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn. </li><li>Washington State Approved Supervisor Training must be completed prior to providing clinical supervision. </li><li>Valid Washington State Driver’s License including vehicle and appropriate insurance, if applicable. </li></ul><p><br></p><p><strong>WHY WORK FOR US:</strong></p><p>As the region’s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesn’t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance. </p><p>(<em>Benefits pro-rated for part-time team members)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays – 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul><p><br></p><p><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES </strong><em>include the following, other duties may be assigned</em></p><ul><li>Complies with all accurate and appropriate charting, coding, and billing procedures as required by the regulatory organizations.</li><li>Documents delivery of services in the medical record. Completes all paperwork to agency standard and within required timelines.</li><li>Meets or exceeds service hour expectations and/or response time expectations established by the agency.</li><li>Develops expertise in Evidence-Based Practices, serious behavioral health disorders, and local community resources, and shares this expertise with other staff. </li><li>Completes client assessments in accordance with the DSM and other external and internal requirements. </li><li>Demonstrates respect for diversity and a commitment to developing multicultural competency and sensitivity.</li><li>Demonstrates commitment to Compass Health’s Strategic Intention, core Values and Core Competencies.</li></ul><p><strong> </strong></p><p><strong>KNOWLEDGE / SKILLS / ABILITIES</strong></p><ul><li>Ability to work effectively with individuals with complex needs and multi-system involvement.</li><li>Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems.</li><li>Demonstrated organizational skills and the ability to multitask within a fast-paced environment.</li><li>Excellent communication skills, written and verbal. </li><li>General computer proficiency, including the ability to utilize electronic medical record systems. </li><li>Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS.</li></ul><p> </p><p><strong>PHYSICAL DEMANDS / WORK ENVIRONMENT</strong></p><p>The employee will be working in a clinical office environment and will provide outreach to community settings as needed, which could include client homes, hospitals, medical facilities, schools, jails, community organizations, etc. While performing the duties of this job, the employee must occasionally lift and/or move up to 20 pounds and is regularly required to sit, stand, walk, talk, and use close vision. The noise level in the work environment is usually moderate. </p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job in the work environment. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. </p><p><br></p><p><strong>ABOUT US</strong><strong><br><strong> </strong></strong></p><p>Compass Health is the region’s largest private, non-profit organization providing mental health and chemical dependency services in Island, San Juan, Skagit, Snohomish, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesn’t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org.</span> </p><p> </p><p><em>Compass Health promotes equal treatment and equal employment opportunity to all applicants and employees regardless of race, creed, color, national origin, sex, religion, age, marital status, sexual minority status, sexual orientation, veteran status, or disability unless based on a bona fide occupational qualification</em></p><p> </p><p><br></p><p></p><p></p><p></p></div></div>",
        "index": 13,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Chemistry Intern 2021-C-002",
        "company": "Mirati Therapeutics Inc",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/mirati-therapeutics-inc-b6e9fec1/chemistry-intern-2021-c-002-94ff2c79?lvk=sa9lvDiYJdSeUsdGWFPlwQ.--M6fjwN3Jg",
        "posted": "2021-07-19T08:24:18.674Z",
        "lastScraped": "2021-07-22T08:24:18.674Z",
        "description": "<div><p><strong>Job Description Summary </strong></p><p>Mirati's internship program blends real world experience with an extensive overview of the drug discovery industry. Knowledgeable mentors will provide guidance as you gain professional hands-on experience. The internship offers a unique perspective into a top-class biotech. Our internship program also provides you the opportunity to network with people at Mirati through various planned events and activities.</p><p><strong>Your Responsibilities</strong></p><ul><li>Under supervision, synthesize, isolate, purify and characterize small molecules</li><li>Utilize modern synthetic and purification techniques</li><li>Design viable synthetic routes and perform literature searches in support of research</li><li>Collaborate closely with a broad group of scientists </li><li>Maintain all appropriate legal and corporate standards for lab safety and hazardous material management; execute daily chemistry operations with an approach designed to minimize risks and hazard waste streams.</li><li>Help to maintain the lab instruments including HPLC, ISCO, lyophilizer etc.</li><li>Maintain lab notebook, instrument and inventory records in accord with department guidance and regulatory requirements</li></ul><p><strong>What is Required</strong></p><p>Applicants must be enrolled in a U.S. accredited university for the semester before and immediately following the internship.</p><p>Applicants must be pursuing a Bachelor's degree and have completed at least their sophomore year or be a graduate level student pursuing a Master's degree</p><p>For Bachelor's and Master's degree students, a major in Chemistry (or Chemistry-related field) who have taken, or are currently enrolled in Organic Chemistry lectured and labs.</p><p>Applicants should be dependable, highly motivated, with a keen interest in chemistry research.</p><p>Must be deadline driven and have a high level of organizational and planning skills</p><p>The ideal candidate exhibits strong analytical, problem-solving, and oral and written communication skills; he or she also possesses the ability to work well in teams.</p><p>This is a part-time internship with about 20 working hour per week. The schedule could be flexible.</p><p><strong>About Mirati Therapeutics</strong></p><p>Mirati Therapeutics is a late-stage biotechnology company whose mission is to discover, design and deliver breakthrough therapies to transform the lives of patients with cancer and their loved ones. The company is relentlessly focused on bringing forward therapies that address areas of high unmet need, including lung cancer, and advancing a pipeline of novel therapeutics targeting the genetic and immunological drivers of cancer. Mirati is using its scientific expertise to develop novel solutions in two registration-enabling programs: adagrasib (MRTX849), an investigational small molecule, potent and selective KRAS G12C inhibitor, as monotherapy and in combination with other agents, and sitravatinib, an investigational spectrum-selective inhibitor of receptor tyrosine kinases in combination with checkpoint inhibitor therapies. Mirati is also advancing its differentiated preclinical portfolio, including MRTX1133, an investigational KRAS G12D inhibitor, and other oncology discovery programs. Unified for patients, Mirati's vision is to unlock the science behind the promise of a life beyond cancer. </p><p>For more information about Mirati Therapeutics, visit us at Mirati.com or follow us on LinkedIn. </p><p><strong>Why Join?</strong></p><p>At Mirati, we have an unapologetic and relentless focus on our mission to transform the lives of patients with cancer and their loved ones. Patients and their families motivate us to work smarter, faster and better. We are driven by the knowledge that our efforts can one-day deliver life-saving therapies for the people who need us most. Urgency, open-mindedness, accountability and collaboration ground our work. These shared values are central to who we are, what we do and how we do it. </p><p>Our people fuel our success. They are fearless and passionate in their daily pursuit of our mission. We are committed to continuing to create a company and experience that attracts and keeps the best people. When you want your days to count and the work you do to matter, discovering and delivering potentially life-changing therapies is more than a job, it's the chance to be part of something bigger. </p><p>We believe diverse professional experiences and an inclusive culture can drive better outcomes for patients. We want employees to be authentic and use their perspectives to contribute to our mission in a meaningful way. </p><p>Mirati cultivates an environment where: </p><ul><li>An entrepreneurial attitude is encouraged </li><li>Our people are empowered to speak up, embrace the gray and achieve solutions </li><li>Diverse experiences are an important of part making the best decisions</li><li>We laugh and have fun as a work family</li></ul><p>No matter the role, we are unified by our passion for helping patients, and are inspired by a single vision to unlock the science behind the promise of a life beyond cancer. Together, we own Mirati's success. </p><p>Learn more at <span class=\"long-word\">Mirati.com/careers.</span> </p><p>Mirati is an Equal Opportunity Employer (EOE) we celebrate diverse experiences without regard to race, color, religion, creed, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. </p><p><strong>Notice to Third Party Agencies</strong>: Please note that Mirati Therapeutics Inc. does not accept unsolicited resumes from recruiters or employment agencies.</p><br><br><b><i>Job Posted by ApplicantPro</i></b><br></div>",
        "index": 14,
        "skills": [
            "networks",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern (Engineering)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/32885625eca027302d862bd96fd8b993?lvk=oJD2JRCTlAKLD3iblfSRJw.--M6bJAS31g",
        "posted": "2021-07-19T08:24:19.844Z",
        "lastScraped": "2021-07-22T08:24:19.845Z",
        "description": "<div><div> THE POSITION: <p></p><div><div><div><div><div><div></div><div><br><br><strong>THE OPPORTUNITY:</strong><br>Do you enjoy utilizing creative thinking and out of the box thinking while working on &nbsp;complex projects? Are you interested in doing meaningful work to implement solutions and designs for complex projects such as state of the art wastewater treatment, renewable energy and water resources for an organization that is recognized for leadership in technology and water management? If so, the Inland Empire Utilities Agency has an exciting opportunity for you as an Intern! <br><br>The Inland Empire Utilities Agency's Engineering and Construction Management Department implements projects in wastewater, water, recycled water and renewable energy in order to enhance and preserve the quality of life throughout the region. The Agency is a regional wastewater treatment agency and wholesale distributor of imported water serving approximately 875,000 people over 242 square miles in western San Bernardino County. Over 300 personnel contribute to the success of the Agency. The Agency owns and/or operates, and maintains 5 water recycling facilities, 160 miles of sewer collection system, a potable water facility, 19 supply water well sites, 4 sewage lift stations, a recycled water distribution and storage system, 19 groundwater recharge sites, a 400,000-square foot indoor composting facility, and a 66,000 square foot Headquarters building. </div><div><br><br></div></div><div><br></div><div><br><div> As a result of the changing circumstances with the spread of COVID-19, to protect the Internship staff through increased social distancing, most Intern positions are working remotely. &nbsp;In order to successfully perform duties as an intern, this position requires the use of a personal computer with internet access, Microsoft Word and Microsoft Excel for the duration of the Internship or until you are asked to return to the office. <br><br>Upon hire, instructions will be provided to you on how you can use your personal computer to connect to the Agency network, including email and access to specific programs that may be required for your work duties. </div><div><br><strong>Open until filled, Apply Immediately<br>First Review of Applications scheduled for August 2, 2021</strong><br><br><strong>There is (1) internship opportunity in the Engineering and Construction Management Department.</strong><br><br><strong>This recruitment is being conducted to fill (1) vacancy and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.&nbsp;</strong></div></div></div></div><div> &nbsp; </div><div><strong>FLSA: Non-Exempt</strong><br>&nbsp; </div><div><strong>Internships are limited to 25 hours week and 960 hours per fiscal year<br>(July 1st to June 30th)</strong><br><br><strong>Note: &nbsp;Internship are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals interested in short term internships will not be considered.</strong><br><em>Work schedule is estimated to be approximately 10 to 20 hours a week;<br>Office Hours are Monday through Friday from 7 a.m. to 5:30 p.m.</em></div></div></div><div> &nbsp; </div><div> The successful candidate will be part of a team on various types of wastewater, recycled water, and energy projects. This position will provide the candidate with the opportunity to be involved with projects from design through construction, visit job sites, shadow project managers, assist in project budget tasks, and gain experience with working with design engineers, consultants, and contractors. <br>&nbsp; <br>The ideal candidate will have Junior level standing with major course work in Engineering, Construction Management,&nbsp;Construction Management Technology, or another related discipline (civil, mechanical, electrical, chemical, or similar). The desired candidate will be a self-starting individual who is eager to assume responsibilities and has experience using CAD/GIS, advanced computer skills using Microsoft Suite, on-line and web-based research experience, and excellent oral and written communication skills. <br>&nbsp; <br>Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. Timeliness and punctuality are key attributes of an ideal candidate. </div><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p></p><div><strong>May include, but are not limited to the following:</strong></div><div> &nbsp; </div><div> Work directly under the supervision of a Professional Engineer. <br>&nbsp; <br>Support Project Managers, Construction Project Managers, and Professional Engineers in various types of projects ranging from pre-design to construction closeout. <br>&nbsp; <br>Perform technical evaluations on water and wastewater systems. <br>&nbsp; <br>Review and comment on project control documents and project design drawings. <br>&nbsp; <br>Compile data or materials, create spreadsheets, and prepare reports, manuals, publications, and recommendations relative to assigned areas of responsibility. <br>&nbsp; <br>Perform research, budget tracking, and project administrative assignments. <br>&nbsp; <br>Perform other related duties as required. </div><p></p> QUALIFICATION GUIDELINES: <p></p><div><div><strong>EXPERIENCE AND EDUCATION:</strong><br>Graduation from high school or G.E.D. equivalent. <br>&nbsp; <br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with major course work in Engineering, Construction Management Technology, or closely related field. <br>&nbsp; <br>Current enrollment in undergraduate or graduate studies is preferred. <br><br>Attention to detail, excellent verbal and written communication skills as well as proficiency in computer applications such as Microsoft Word and&nbsp;Excel&nbsp;are critical.&nbsp; <br>&nbsp;&nbsp; <br><strong>LICENSES AND CERTIFICATES:</strong><br>A valid class \"C\" California driver's license. <br>&nbsp; <br><strong>KNOWLEDGE OF:</strong><br>Basic procedures involved in the following areas: design and construction engineering; construction techniques, practices and inspection criteria as related to plan reviews; operating policies and departmental organization structures; design and construction drafting techniques, terminology and equipment, including CAD and GIS; building codes and industrial safety regulations; standards for public works construction and traffic safety; nomenclature, symbols and techniques of mapping and surveying; engineering mathematics, including trigonometry; standard business English. <br><br><strong>ABILITY&nbsp;TO:</strong><br>Operate office equipment including a computer and applicable software; communicate effectively, both verbally and in writing; understand and follow verbal and written instructions; analyze data, situations and research materials; formulate options and make recommendations; make quantity mathematical calculations and prepare estimates; and establish effective working relationships. </div></div><p></p> SELECTION PROCESS: <p></p><div><div> All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job-related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span>&nbsp;examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. <br>&nbsp; </div><div><strong>Any applicant requiring reasonable accommodation during the selection process due to a qualified disability must inform the Human Resources Office at (909) 993-1674 or&nbsp;</strong> <strong>hrdept@ieua.org</strong> <strong>&nbsp;at least 72 hours in advance of the need for accommodation.</strong><br>&nbsp; <br>THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br>&nbsp; <br>&nbsp;\"The Agency's success is obtained by creating a positive and diverse work environment which recognizes individual differences and experiences\". </div></div><p></p></div></div>",
        "index": 15,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "networks",
            "c and c++"
        ],
        "remote": true
    },
    {
        "position": "Equipment Service Co-op/Intern - Spring 2022",
        "company": "AMERICAN HONDA MOTOR",
        "location": {
            "city": "Russells Point",
            "state": "Ohio",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0c07b199e5df6615969047f6d757a33f?lvk=lCy3KlqQBB7EdZtpYWX4WQ.--M6Hy1027R",
        "posted": "2021-07-14T08:24:20.976Z",
        "lastScraped": "2021-07-22T08:24:20.976Z",
        "description": "<div><div><p><b>Equipment Service Co-op/Intern - Spring 2022</b></p><p>This job description reflects potential openings for the <b>Spring 2022</b>&nbsp;<b>Co-op/Internship</b>&nbsp;Session. (January-April). This is a general job description and represents multiple openings in various departments.&nbsp;<b>Honda offers both single and multi-semester co-ops and internships. College students must apply to the requisition pertaining to their major and semester of interest.&nbsp;</b>&nbsp;</p><p><b>Please note:&nbsp;</b>Sponsorship for employment visa status for these positions is unavailable. Applicants requiring sponsorship for employment visa status now or in the future (e.g., F-1 CPT/OPT, H-1B, TN, etc.) will not be considered.</p><p><b>Honda Co-operative and Learning Internships</b></p><p>Here at Honda, we pride ourselves in the invaluable experience we provide our Co-ops and Interns with. Honda Co-ops/ Interns are tasked with hands on, project based worked relevant to their department of placements current needs (this means no coffee runs or stereotypical intern duties). Projects may be as large as developing a new test, designing systems, traveling to suppliers or serving as a project manager! In addition to the full-time associate work that our Co-ops/ Interns are given the access to work on, Honda Co-ops/ Interns are invited to participate in a variety of paid work events and experiences offered by the Honda Co-op and Internship program team. Events include but are not limited to Q&amp;A sessions with high level associates, tours of various Honda facilities, social events, volunteer opportunities and much more!</p><p><b>Dreams l Joy l Passion l Respect l Challenging Spirit</b></p><p>The ideal Honda Co-op/ Intern candidate feels connected to our core values and is looking to make an impact within a global organization with all 7 continents running Honda equipment or vehicles (yes, even Antarctica). You are a dreamer and often identify areas of opportunity and take initiative to improve them yourself. You are passionate about your work and respect others. You want to be a part of something larger than you- the joy of creating, selling and buying! These values define Honda and encapsulate our rich history and what continues to push us forward in a competitive era of mobility. It's a big team for a big effort, and we need individuals with varying perspectives to make our products great. Because different people, with different perspectives and ideas are the key to helping Honda bring the future!</p><p>&nbsp;<b>More about the Equipment Service and Die Service Technician&nbsp;Co-op/ Intern at Honda</b></p><p>Equipment Service and Die Service Technician co-op opportunities typically exist in the following areas and projects/tasks may include the following:</p><p>Assignments are focused on Honda safety procedures, quality policies, root cause and countermeasure analysis, preventative maintenance (P.M.) work orders, maintenance repair work, response to production downtime and work related documentation. Will work alongside a maintenance technician (mentor).</p><p><b>Building Maintenance</b>:&nbsp;Student may engage in multi-disciplinary projects encompassing electrical, mechanical and refrigeration disciplines. <span class=\"long-word\">Electrical/mechanical</span> analysis and planning for future replacement strategy. Hands-on support of preventative, predictive maintenance activities.</p><p><b>Weld</b>:&nbsp;Confirmation of actual and updating of line-side hardwire prints. Basic electrical wiring of proxy switch, limit switch, 24 V control wiring and installation of connectored and non-connectored cabling. Use of basic shop equipment, hand and power tools for repair and fabrication.</p><p><b>Paint</b>:&nbsp;Support fabrication <span class=\"long-word\">activities/projects.</span> Assist maintenance on emergency calls to troubleshoot and repair equipment failures.</p><p><b>Stamping</b>:&nbsp;Press inspections, breakdowns and repairs, line-side assistance for operators.</p><p><b>Facilities</b>:&nbsp;General building maintenance including heating, ventilation, and air conditioning (HVAC).</p><p><b>What you need to be successful in the role:</b></p><p>Required:</p><ul><li>Must have basic knowledge of mechanical, electrical, hydraulics, pneumatics, industrial safety and understanding of industrial math. Demonstrate a positive attitude and proactive approach with equipment maintenance. Basic PC skills (Microsoft Excel and Power Point applications). Ability to communicate effectively in verbal and written format.&nbsp;&nbsp;</li><li>Desired: PLC programming, Motor Controls, Industrial system networking, Servo systems (Robotics), Auto Cad, Machine design, Pumps.&nbsp;<i>Weld only</i>: Soldering, welding (MIG, TIG, Stick)</li><li>Minimum 2.5 Cumulative GPA or higher (You will be required to provide your current transcript)</li><li>Class Status: Freshman or above</li><li>Term: Minimum of 10 weeks required.&nbsp;</li><li>Shift/Hours: Must be able to work a minimum of three days per week and at least four hours per day. Full-time and part-time opportunities available on various shifts.</li></ul><p>Desired: PLC programming, Motor Controls, Industrial system networking, Servo systems (Robotics), Auto Cad, Machine design, Pumps.&nbsp;<i>Weld only</i>: Soldering, welding (MIG, TIG, Stick)</p><p>Degree: Candidate must be enrolled in an associate degree or certificate&nbsp;program studying Electrical, Mechanical, or Electro-Mechanical Engineering Technology, Industrial Maintenance, Multicraft Industrial Technology, &nbsp;Welding, or related field.</p><p><b>Position Locations</b></p><p><b>Equipment Service and Die Service Technician&nbsp;Co-op/ Intern</b> positions are offered in the cities/ states listed below, if you are selected to move forward in the process, you will be given the opportunity to make selections on your location preferences:</p><ul><li><p>Anna, Ohio (45 minutes north of Dayton, Ohio)</p></li><li><p>Marysville, Ohio (45 minutes northwest of Columbus, Ohio)</p></li><li><p>East Liberty, Ohio (55 minutes northwest of Columbus, Ohio)</p></li><li><p>Russells Point, Ohio (30 minutes northwest of Marysville, Ohio)</p></li></ul><p><b>Honda Co-operative and Learning Internships Program Benefits</b></p><p><b>Housing Accommodations:</b> Honda offers housing at a shared cost or a housing stipend <i>based on location</i> for our Co-ops and Interns. It is not required to opt-in to, but is available should you need housing at the time of your Co-op/ Internship with Honda.</p><p><b>Honda Business Resource Groups:</b> One of the ways Honda gives diversity a voice is through its business resource groups. The associate-led, company-supported groups have members aligned across different dimensions of diversity such as gender, ethnicity, ability, life stage and experiences. The groups provide networking opportunities, a chance to give back and professional development. Some groups have even given feedback on Honda products, making them more appealing to all. Embracing all views is what will drive us into the future. Honda wants passionate, driven people to be a part of that future.</p><p><b>Performance Feedback: </b>Honda Co-ops and Interns will have the opportunity to receive informal and formal feedback from their leaders, ask questions and express future interest in a scheduled mid-term and final evaluation.</p><p><b>Mentorship:</b> Each Co-op/ Intern is assigned a mentor in your department to help you navigate your time at Honda.</p><p><b>On-site Wellness Center: </b>Co-ops and Interns have access to join our Wellness Centers (varies by location). Our Wellness Centers are full gyms equipped with cardio machines, weights, basketball courts, pools, ...</p></div></div>",
        "index": 16,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "robotics",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern - Marketing",
        "company": "First Capital Bank of Kentucky",
        "location": {
            "city": "Cincinnati",
            "state": "Ohio",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/db4ed90e06775e373dca9eeb794a3478?lvk=unlejeIb-1tZhlBbcBihIQ.--M6bZ5kLYw",
        "posted": "2021-07-20T08:24:22.452Z",
        "lastScraped": "2021-07-22T08:24:22.452Z",
        "description": "<div><div><p>We do the right things, right now.&nbsp; We do them in a way that is relevant to our clients.&nbsp; Become a part of our history as it continues to be written!&nbsp;<br><br>If you are interested and qualified for this role, we invite you to apply.</p><p></p><p></p>The Marketing Intern will help the Marketing team in its work around customer acquisition, retention, and expansion goals through the development of digital &amp; traditional content, campaigns, communications, industry research, and go-to market strategies. This individual will be responsible for helping to support the coordination, creation, and execution of content, lead generation efforts, client engagement, advertising, and other support as directed. <br><br>This Marketing Internship role will support the bank's goals and objectives as described above. The Marketing Internship is a part-time, working 15-25 hours per week. This position will run up to 6 months and start as early as August 2021. The Marketing Intern is responsible for assisting Marketing Managers by completing multiple tasks assigned to them for ongoing Marketing projects. The assigned tasks will increase their knowledge of Marketing as well as the banking industry and the Bank. The Marketing Intern will develop interpersonal skills and build professional working relationships both in Marketing and with other internal associates, as well as external agencies and vendors. In addition, the Marketing Intern will further develop collaborative skills working in team settings as well as project management skills through the planning of projects and contribution to management of ongoing initiatives in our project management system (Workfront).<p></p><p></p><p></p><p><b>Essential <span class=\"long-word\">Functions/Responsibilities</span></b></p><ul><li>With the assistance of Marketing Managers, develop an understanding of the Bank's marketing plans, the banking industry and the needs of the Bank.</li><li>Help with project tracking and management within Workfront and with Line of Business team</li><li>Manage, review and update collateral across a variety of business lines, both Consumer and Commercial as well as systems, such as the BankStore, Seismic and PrintSF</li><li>Help with the support of ad requests, both resizing as well as creating</li><li>Assist with Events - planning, managing, and support</li><li>Assist with Ticket management and fulfillment</li><li>Support Wealth Management marketing activities, including, but not limited to, collateral needs, internal and external communications, research and content</li><li>Support the ongoing creation and management of Commercial Tombstone and Testimonials</li><li>Assist with Consumer Marketing projects, such as the development of multi-channel campaigns</li></ul><p><b>Minimum Knowledge, Skills and Abilities Needed to Perform Essential <span class=\"long-word\">Functions/Responsibilities</span> of the Job</b></p><ul><li>Pursuing a Bachelors in Communications, Marketing or Business or related field at an accredited college or university.</li><li>Two years of education with a minimum of 60 credit hours successfully completed.</li><li>Leadership experience through previous work and/or extracurricular activities.</li><li>Demonstrate effective verbal and written communication skills, critical thinking skills, ability to work in a team environment, efficient time management, analytical skills, resourceful in delivering high quality work and ability to multi-task given assignments.</li><li>Ability to navigate various computer applications, including Microsoft Office (i.e., Excel, Word, and PDF) and the ability to quickly lean other applications used at First Financial Bank.</li><li>Work location primarily in downtown Cincinnati. Must have access to reliable modes of transportation.</li></ul><p><b>Level of Complexity and Scope</b></p><ul><li>Entry level internship</li><li><b>Degree of Independence and Decision-Making</b></li><li>Basic</li><li><b>Physical Requirements</b></li><li>Occasionally lifts and carries up to 20 lbs.</li><li>Frequently sits, stands and walks.</li></ul><p><b>Compliance Statement</b></p><p>The associate is responsible for meeting all compliance requirements imposed on First Financial Bank by State and Federal law and regulation, as well as all related First Financial Bank policies and procedures. This includes all Bank Secrecy Act, Anti-Money Laundering, OFAC and Suspicious Activity reporting requirements, as well as all other lending and deposit compliance requirements.</p><p>It is our policy to not discriminate against any individual in violation of federal, state, and local laws as it relates to age, race color, religion, national origin, sex, marital status, pregnancy, gender identity, disability, sexual orientation, genetic information, veteran/military service, or any other characteristic protected by law.</p><p></p><p></p><p></p><p></p><p></p><p>It is our policy to not discriminate against any individual in violation of federal, state, and local laws as it relates to age, race, color, religion, national origin, sex, marital status, pregnancy, gender identity, disability, sexual orientation, genetic information, veteran/military service, or any other characteristic protected by law.</p><p></p><p>We are an E-Verify Employer.</p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "information technology"
        ],
        "start": "2021-08-01T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Training Intern (Virtual), DreamWorks, Fall 2021",
        "company": "NBC Universal, Inc.",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6892c7d3d22f396bc232a619a60d570f?lvk=F80H7UZYF5RMMiGZUA6R-A.--M6I8T_gBB",
        "posted": "2021-07-17T08:24:23.208Z",
        "lastScraped": "2021-07-22T08:24:23.208Z",
        "description": "<div><p>Job Title: Training Intern (Virtual), DreamWorks, Fall 2021 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: DreamWorks Animation seeks an Intern for the Training Department. In this role, the intern will learn the training process for various production departments. (Animation, Effects, Surfacing, Matte Painting, etc). Interns will gain knowledge on the role of the Training Department in the studio and an understanding of the training workflow for Features, TV and Overhead Departments.<br>&nbsp;<br>The intern will monitor virtual classes and provide help as needed, track attendance and enter data into Excel database. The intern will record various classes with screen capture software and occasionally edit recorded classes in Adobe Premiere. The intern will also need to take on various administrative tasks and design posters to promote training classes as needed.<br><br>In addition, the intern will be encouraged to attend virtual training classes to learn about the animation pipeline as well as the software used to create our movies and tv shows. The intern will have the opportunity to meet with artists and professionals from different departments and to further develop skills in areas of interest. The intern will also be able to virtually participate in ongoing studio artistic classes, lunchtime talks, special series workshops and activities <br>Job Number: 62034BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation Internships <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Pursuing an Associate, Bachelor or Graduate degree at a College/University (or equivalent), or be a recent graduate (within six months of graduation date)<br>Must be 18 years of age or older<br>Ability to commit ten weeks part-time (16-24 hours/week) and work remotely from September 2021 - December 2021<br>Must have own equipment (computer, webcam, headphones, etc.) and stable internet connection<br>Must be authorized to work in the United States without visa sponsorship<br>Confidently looks to solve problems, manages time efficiently, and pays close attention to details<br>A team player with a can-do attitude and proficient communication skills<br>Proactive and has strong multi-tasking and follow-up skills <br>Desired Characteristics: Interest in animation, tv or feature film production<br>Experience with <span class=\"long-word\">collecting/organizing</span> data using software like Excel or Google Sheet<br>Basic design skills using software like Photoshop<br>Basic video editing skills using software like Premiere<br>Customer service skills or relevant experience preferred <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></p></div>",
        "index": 18,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "project management",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Team Training Intern",
        "company": "Chuze Fitness",
        "location": {
            "city": "Anaheim",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/chuze-fitness-db65de83/team-training-intern-2a85560e?lvk=umWgw32wz8DkYjP16k4TUQ.--M6DqrrgH-",
        "posted": "2021-07-17T08:24:25.010Z",
        "lastScraped": "2021-07-22T08:24:25.010Z",
        "description": "<div>Chuze Fitness Team Training offers dynamic and motivating 60-minute personalized training sessions in a group environment of up to approximately 30 people. Our members love the individualized feedback and accountability the receive from our certified personal trainers along with the fun and energy that comes with working together as a team. Team Training sessions focus on both cardiovascular and strength training while using heart rate technology. We create a positive atmosphere and aim to meet our participants right where they are in their respective fitness journeys. Our coaching staff runs pre-programmed workouts, demonstrates exercises, times intervals and ensures members work out safely and effectively to achieve their desired results.<strong>The Role:</strong>The Chuze Team Training Intern position was created for fitness-focused students to observe and learn hands-on skills under the supervision of a trained coach. Chuze will provide ongoing training and support for these students in our Intern Program to gain real-life experience in a fun environment at our clubs. Interns learn about the structure and composition of Team Training sessions. They have the chance to build confidence by shadowing and obtaining hands-on experience potentially executing Team Training sessions. They are expected to provide members with outstanding customer service and support.<strong>Job Requirements:</strong><ul><li>Currently in pursuit of Associate’s or Bachelor’s Degree preferred (EX: Exercise Science, Physiology, Kinesiology)</li><li>Currently in pursuit of personal training or group exercise instructor certification from NSCA, ACSM, or NASM or ACE</li><li>Current CPR/AED certification</li><li>HIGHLY motivated self-starter who is looking for an opportunity and not a “job”</li><li>Ability to motivate and cultivate a collective environment of encouragement that facilitates connections and makes members feel like family</li></ul>If the initial qualifications are met, candidates will undergo Coach Training, which will consist of intensive instruction &amp; role play regarding culture, interactions, and how to coach Chuze Team Training sessions.&nbsp;<strong>Benefits:</strong><ul><li>Paid Internship (minimum wage)</li><li>Fun work environment</li><li>Free gym membership</li><li>Professional development</li><li>Volunteer opportunities</li></ul>&nbsp;Chuze Fitness is an Equal Opportunity Employer.&nbsp; Background checks are required for some positions.</div>",
        "index": 19,
        "skills": [
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Marketing Intern",
        "company": "Equifax",
        "location": {
            "city": "Boise",
            "state": "Idaho",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/faa7e73e35f078add1903a0ef8eccb27?lvk=dghhHYfXwBeNnDC-QC7IaQ.--M6E85Dr0B",
        "posted": "2021-07-15T08:24:26.691Z",
        "lastScraped": "2021-07-22T08:24:26.691Z",
        "description": "<div><div><p>Ready to accelerate your career in one of the fastest growing marketing fields? Kount is looking for an aspiring, naturally inquisitive, research driven professional at the beginning of his/her career. This person will get hands on experience using the most widely used tools (Asana, Salesforce, Confluence, Jira, and more) and best-in-class data methods used in the B2B world.</p><p>To be successful in this role you will have to be research driven by nature, be a self-starter, and be willing to utilize both quantitative as well as qualitative research strategies to assist Kount in better understanding the competitive landscape. </p><p>Great organizational, communication, and teamwork skills will be a must have for this role.</p><p></p><p></p>Responsibilities include, but are not limited to:<p></p><ul><li>Creating competitive battlecards, assessing emerging technologies, developing SWOT analysis reports, and working closely across departments to evaluate win/loss reports.</li><li>Proactively monitoring trends, assessing competitors' products and offerings, and relaying that information to product, sales, and marketing.</li><li>Analyzing data and distilling it into key takeaways.</li><li>Assist in developing processes, recommending strategies, and creating tools to ensure competitive messaging is focused and actionable.</li></ul>Requirements/About you:<ul><li>Excellent attention to detail and problem-solving skills.</li><li>Technological savvy, you love learning new things and how they work in a broader ecosystem.</li><li>Great verbal and written communication skills.</li><li>Familiarity with Excel and a desire to learn more.</li><li>Great organizational and task-tracking skills.</li><li>Strong analytical acumen.</li><li>Pursuing a degree in finance, accounting, data science, statistics, mathematics, or marketing.</li></ul><p></p><p></p><p><b>Primary Location:</b></p>USA-ID-Boise<p></p><p></p><p></p><p></p><p><b>Function:</b></p>Function - Internships<p></p><p></p><p><b>Schedule:</b></p>Part time</div></div>",
        "index": 20,
        "skills": [
            "information technology",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Game Development Intern",
        "company": "Bally Technologies",
        "location": {
            "city": "Reno",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/59cba62192dc3b7c3ca45a78ca1edfd7?lvk=vk2AJdxF_V8Z8acernyLgA.--M6IGT_C-F",
        "posted": "2021-07-15T08:24:27.426Z",
        "lastScraped": "2021-07-22T08:24:27.426Z",
        "description": "<div><div><p>Gaming:</p><p>Are you ready to level up your career?</p><p><br>At Scientific Games, we are committed to making the best games, platforms and systems in the world. We are looking for smart, passionate and creative people to join our team and help us transform the gaming world. We are a global, industry-leading gaming technology company that embraces challenge, fosters an inclusive culture, values integrity, innovation and winning, and is committed to developing and supporting its people.</p><p></p><p>Whether you are a member of our award winning game studios, our industry leading systems group, product management, manufacturing group, services or any of our other amazing Gaming teams, you will be creating compelling games played around the world. We are dedicated to being the industry's only COMPLETE global solutions provider with products that will enhance the entire gaming operation, both on the casino floor and behind the scenes.</p><p></p><p>If you are ready to play...Come join us and let's make games!</p><p></p><p></p><p></p>Scientific Games:<p>Scientific Games (SG) is a global leader focused on delivering an ever-expanding portfolio of lottery and gaming products and services to the world's government-regulated and government-sponsored entities. Scientific Games' global reach is made possible through the expertise, skill and dedicated efforts of its 8,000+ employees who serve lottery and gaming customers in more than 100+ countries on 6 continents.</p><p></p><p></p>Position Summary<ul><li>Learn how to conceptualize symbols, typography, and graphic designs for slot games through hands-on experience</li><li>Learn about the gaming industry and how games are made</li></ul>Job Requirements<p><i>Experience</i></p><ul><li>Must be at least 21 years of age</li><li>No industry experience required</li></ul><p></p><p><i>Knowledge, Skills, and Abilities</i></p><ul><li>Enjoy working in a creative environment</li><li>Have excellent communication, organization, and time-management skills</li><li>Familiarity with Adobe Illustrator and Adobe Photoshop</li><li>Must have a portfolio available for review</li></ul><p></p><p></p><p></p><p></p><p></p>Qualifications<p><b>Education</b></p><p>Current enrollment in related degree preferre</p><p></p><p><br><b>Physical Requirements</b></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit, stand, walk, bend, use hands, operate a computer, and have specific vision abilities to include close and distance vision, and ability to adjust focus working with computer and business equipment.</p><p><br><b>Work Conditions</b></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.<br><br>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.<br><br>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, ethnicity, gender, sexual orientation, veteran status, or on the basis of disability or any other federal, state or local protected class. If you'd like more information, please click on this link: EEO Poster</p><p></p><p></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.</p><p></p><p>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.</p><p></p><p>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law, please click here for EEOC Poster.</p></div></div>",
        "index": 21,
        "skills": [
            "information technology",
            "game design",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "Intern: Software Engineering",
        "company": "ArcSight",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7d18074e3f51ea1df287f33075f7d6e5?lvk=q4jW3w4t3abDTwWIXUAmJQ.--M6gKDsG6V",
        "posted": "2021-07-14T08:24:28.515Z",
        "lastScraped": "2021-07-22T08:24:28.515Z",
        "description": "<div><div><p>Intern: Software Engineering</p><p>&nbsp;&nbsp;</p><p><b>Job Description:</b></p><p>&nbsp;&nbsp;&nbsp;</p><p>Micro Focus is seeking a talented, strong, and motivated Software Engineer Intern to work on access governance and identity reporting software. We are looking for an individual with the right blend of skills, education, experience, and attitude to fill this position.</p><p></p><p>The successful candidate will have understanding and experience working with SQL. This individual will also demonstrate the ability to succeed with minimal supervision, and have the ability to think outside the box. This position will interact with other development, testing, and documentation teams to deliver software products.</p><p></p><p><b>The Work:</b></p><ul><li>Design, develop, test, and maintain identity and access reports</li><li>Work with software development, quality engineering, and documentation teams to design and implement features and capabilities</li><li>Create and execute test cases</li><li>Automation</li><li>Review and provide input for product documentation</li><li>Research and solve customer issues</li><li>Design and implement features and associated use cases using Agile methodologies</li></ul><p></p><p><b>Required Skills:</b></p><ul><li>Pursuing Bachelor's degree in Computer Science or Software Engineering</li><li>Programming experience in SQL and JavaScript</li><li>Excellent oral and written communication skills</li><li>Ability to work independently as well as on a team</li><li>Ability to quickly learn new technologies</li><li>Excellent organizational and time management skills</li><li>Possess a positive attitude and is a self-starter</li><li>Good problem solver, ability to identify key issues and barriers to success and to proactively resolve them</li><li>Ability to document technical processes</li><li>Detail oriented</li></ul><p></p><p><b>Desired Skills:</b></p><ul><li>Oracle</li><li>C#</li><li>Java</li><li>automation scripts</li></ul><p><b>Job:</b></p>Administration<p>&nbsp;&nbsp;&nbsp;&nbsp;</p><p><b>Micro Focus is proud to be an &nbsp;Equal Opportunity Employer.&nbsp; Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</b></p><p>&nbsp;&nbsp;&nbsp;</p><p></p><p></p></div></div>",
        "index": 22,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "javascript",
            "java",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]