[
    {
        "position": "Internship - DevOps Engineer",
        "company": "Quadient",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/430b174cad95474f280c6d3a842ae310?lvk=5x6nQpmPTb8lz1wKVYtqcQ.--MAXQAec37",
        "posted": "2021-09-07T06:50:52.312Z",
        "lastScraped": "2021-09-13T06:50:52.312Z",
        "description": "<div><div><p>Internship - DevOps Engineering (AI/Big data)</p><p></p><p><b>Scope </b></p><p></p><p>Within Quadient Strategic Operations, you will join the Analytics &amp; Business Intelligence (ABI) group whose primary objective is to provide all the entities of the Company with comprehensive analysis &amp; tools to support strategic decision-making and optimize operations.</p><p>To achieve its strategic goal the ABI group operates on a variety of systems and develops innovative approaches to address the most ambitious or critical challenges faced by Quadient in all the countries we are present.</p><p></p><p><b>Missions </b></p><p>Working in the heart of the team operations, you will use your appetite for developing pragmatic solutions with high impact.</p><p>Your missions will notably consist of:</p><ul><li>Developing intelligent autonomous agents &amp; systems for cutting edge analytical and AI initiatives;</li><li>Developing advanced automation and data access streaming techniques for high-availability on scalable platforms;</li><li>Understanding and optimizing the approaches used to access Group distributed resources;</li><li>Suggesting and designing improvements to existing architectures and connectors.</li></ul><p><b>Profile </b></p><ul><li>Pursing a B.Eng / B.Sc , M. Eng / M.Sc degree in computer science / software engineering;</li><li>Verbal and written communication skills;</li><li>Creative thinking, innovative and problem-solving skills;</li><li>Strong software engineering and development skills (Object Programming, Event Programming, Distributed architectures, Full Stack approaches);</li><li>Fluent in several of these languages (Python, C#, Java, NodeJs);</li><li>Good understanding of Database design and querying (ideally good to strong SQL skills);</li><li>Ability to work with and optimize complex and distributed architecture;</li><li>Knowledge of agile programming techniques and tools;</li><li>Knowledge of algorithmics, parallel processing and automation;</li><li>Experience with cloud infrastructure AWS, Azure;</li><li>Full working proficiency in English.</li></ul><p></p><p>Start date: ASAP</p><p>Contract: Part-time (adaptable to academic schedule)</p><p>Location: Remote/home office, USA</p><p>Duration: from 6 to 15 months</p><p></p><p><i>The above statements are intended to describe the general nature and levels of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. </i></p><p></p><p><i>Quadient is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</i></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p></div></div>",
        "index": 1,
        "skills": [
            "software engineering",
            "devops",
            "sql",
            "java",
            "python",
            "c and c++",
            "artificial intelligence"
        ],
        "remote": true
    },
    {
        "position": "Environmental Assessment Internship 2022",
        "company": "Hanson Professional Services",
        "location": {
            "city": "Springfield",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/104fcf3be333ace5fcd18b5a2bd045c4?lvk=5MR7mNlc2AHSS_BN_7KA7w.--MAXPVhSGV",
        "posted": "2021-09-07T06:50:53.189Z",
        "lastScraped": "2021-09-13T06:50:53.189Z",
        "description": "<div><div><p>Hanson Professional Services Inc. is a dynamic, employee-owned engineering consulting firm of more than 400 employees providing a full range of multi-disciplined engineering, scientific, and allied services throughout the USA.</p><p></p><p><b><i>We are proud to be a great place to work and a top company for internships!</i></b></p><ul><li>#18 in the multidiscipline category in the Zweig Group Best Firms to Work For.</li><li>#2 Best Places to Work in Illinois</li><li>#4 Best Places to Work in Florida.</li><li>#3 for Best Internships for Engineering</li><li>#8 for the Best Tech and Engineering Internships</li><li>#21 for Best Internship for compensation &amp; benefits</li><li>Check out our Vault rankings HERE</li></ul><p></p><p>Hanson is seeking candidates for our <b>Environmental Assessment 2022 Internship</b> programs. We have potential opportunities the following locations: Indianapolis and our corporate headquarters in Springfield, Illinois.</p><p></p><p>Our <b>Environmental Assessment</b> discipline is made up of environmental scientists and biologists who navigate local, state, and federal National Environmental Policy Act (NEPA) environmental regulations and permitting for primarily public sector projects including Departments of Transportation (DOTs) and local governments.</p><p></p><p><b><i>Click </i></b><b><i>HERE</i></b><b><i> to see examples of Hanson's Environmental projects.</i></b></p><p></p><p>General Assignments: Interns will perform routine <b>environmental assessment</b> tasks using standard procedures under supervision of professional environmental scientists and biologists and may assist Hanson engineers, designers and technicians in disciplines related to their field of study.</p><p></p><p>Interns will typically support one or more experienced professionals in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of <b>environmental assessment</b>. Interns may perform and/or participate in additional activities/events which help them build a strong network within the Hanson community and with fellow interns. Internships may require travel to suppliers, customers, or other Hanson locations.</p><p></p><p></p><p><b>Key Responsibilities: Environmental Assessment interns will be expected to perform the following key responsibilities with assistance from a Hanson professional:</b></p><p></p><ul><li>Prepare NEPA documentation primarily for categorical exclusion-level projects but also environmental assessments and environmental impact statements</li><li>Gather and provide data for the preparation of environmental reports and studies</li><li>Assist in conducting various environmental field surveys including threatened and endangered species habitat surveys, tree identification, stream characterizations and wetland delineations</li><li>Utilize software packages such as ArcGIS desktop or ArcGIS Pro for environmental data gathering and exhibit creation</li><li>Assist in the preparation of environmental permit applications</li><li>Perform related duties such as writing memoranda, letters or general reports; collecting and correlating data; maintaining records; attending meetings; and operating technical equipment</li></ul><p></p><p><b>Qualifications: </b></p><p></p><p>Intern must be actively enrolled in a relevant field of study such as Environmental Science, Environmental Biology, Natural Resources, Biology, Ecology or Environmental Engineering. The ideal candidate will have successfully completed their sophomore year, be actively enrolled in an accredited 4-year college or university and have familiarity with Geographical Information System software.</p><p></p><p><b>Key requirements are listed but not limited to the following:</b></p><ul><li>Strong written and oral communication skills</li><li>Strong analytical skills</li><li>Knowledge of Microsoft Office</li><li>Valid driver's license</li></ul><p></p><p></p><p></p><p></p><p>As <span class=\"long-word\">employers/governmental</span> contractors, we comply with government regulations, including affirmative action responsibilities where they apply. To assist us in meeting our affirmative action goals, employees are encouraged to refer minorities, women, individuals with disabilities and veterans.</p><p></p><p></p><p>AN EQUAL OPPORTUNITY - AFFIRMATIVE ACTION EMPLOYER</p><p>EEO / MINORITY / FEMALE / INDIVIDUALS WITH DISABILITIES / VETERANS</p><p></p><p></p><p></p></div></div>",
        "index": 2,
        "skills": [
            "software engineering",
            "networks",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Strategic Software Intern",
        "company": "Shure",
        "location": {
            "city": "Niles",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0139f7afece8bff9b1fdf819520aa316?lvk=vXhxVbNerKf7LPzC4YrULQ.--MAqSF7dmg",
        "posted": "2021-09-10T06:50:54.135Z",
        "lastScraped": "2021-09-13T06:50:54.135Z",
        "description": "<div><div><p>Overview </p><p><strong>SUMMER 2022</strong></p><p>&nbsp;</p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses for hyrbid or onsite internships. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p>&nbsp;</p><p>The data science team seeks a full-stack developer to help research, prototype, and demonstrate forward-leaning use cases in next generation technologies such as in machine learning and artificial intelligence - use cases that exceed customers' expectations by making products smarter, more performant, and more insightful.</p><p>&nbsp;</p><p>This internship will be 100% onsite or a combination of part-time remote/virtual and part-time in office.</p> Responsibilities <p> The intern will research, prototype, and demonstrate forward-leaning use cases in next generation technologies such as in machine learning and artificial intelligence <br> Target platforms range from next-generation device firmware, though Mac and PC applications, mobile apps, and cloud/IoT applications and services.</p> Qualifications <p> Master's degree in computer science, statistics, mathematics, or related field with coursework or experience in data science. <br> Experience with full stack development with languages such as Python, Java, JavaScript, and C++. <br> Experience with embedded software development, Mac &amp; PC application development, mobile apps, and cloud-based applications and services <br> Hands-on experience with machine learning and deep learning models and frameworks, and training deep learning models leveraging GPUs with tools such as Keras, TensorFLow, PyTorch, MXNet, Arm-NN, etc. <br> Experience with big data technologies and cloud-based services for data storage and processing. <br> Experience with embedded development is desired. <br> Creativity and curiosity for future technologies and a passion for realizing new capabilities</p></div></div>",
        "index": 3,
        "skills": [
            "machine learning",
            "software engineering",
            "deep learning",
            "javascript",
            "java",
            "c and c++",
            "python",
            "virtual reality",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Environmental Compliance Internship 2022",
        "company": "Hanson Professional Services",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/cdc698ccee2e2295ccd85142a256bf99?lvk=zjVOsKvpPG7AFYkkT7_90A.--MAXPX9L3R",
        "posted": "2021-09-07T06:50:55.139Z",
        "lastScraped": "2021-09-13T06:50:55.139Z",
        "description": "<div><div><p>Hanson Professional Services Inc. is a dynamic, employee-owned engineering consulting firm of more than 400 employees providing a full range of multi-disciplined engineering, scientific, and allied services throughout the USA.</p><p></p><p><b><i>We are proud to be a great place to work and a top company for internships!</i></b></p><ul><li>#18 in the multidiscipline category in the Zweig Group Best Firms to Work For.</li><li>#2 Best Places to Work in Illinois</li><li>#4 Best Places to Work in Florida.</li><li>#3 for Best Internships for Engineering</li><li>#8 for the Best Tech and Engineering Internships</li><li>#21 for Best Internship for compensation &amp; benefits</li><li>Check out our Vault rankings HERE</li></ul><p></p><p>Hanson is seeking candidates for our <b>Environmental Compliance 2022 Internship</b> programs. We have potential opportunities in the following locations: Texas (various cities), Florida (various cities), Seattle, WA; Kansas City, MO; Chicago, IL; Peoria, IL; St. Louis, MO; and Indianapolis, IN as well as our corporate headquarters in Springfield, IL.</p><p></p><p>Our <b>Environmental Compliance</b> discipline is made up of environmental scientists, geoscientists and engineers who navigate local, state, and federal regulations to prepare and obtain operating permits (waste disposal, wastewater, stormwater, air, etc.) and provide environmental compliance and remediation support for Phase I and II Environmental Site Assessments, Stormwater Pollution Prevention Plans (SWPPP), Spill Prevention Control and Countermeasures (SPCC) plans, site constraints analysis investigations, soil and groundwater sampling, contaminant fate and transport modeling, waste management, monitor well installations, and statistical evaluations of groundwater data.</p><p></p><p><b><i>Click </i></b><b><i>HERE</i></b><b><i> to see examples of Hanson's Environmental projects. </i></b></p><p></p><p>General Assignments: Interns will perform routine <b>environmental compliance </b>tasks using standard procedures under supervision of Hanson professionals and may assist designers and technicians in disciplines related to their field of study.</p><p></p><p>Interns will typically support one or more experienced professionals in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of <b>environmental compliance</b>. Interns may perform and/or participate in additional activities/events which help them build a strong network within the Hanson community and with fellow interns. Internships may require travel to suppliers, customers, or other Hanson locations.</p><p></p><p></p><p><b>Key Responsibilities: Environmental Compliance interns will be expected to perform the following key responsibilities with assistance from a Hanson professional:</b></p><p></p><ul><li>Preparing plans, designs, specifications, and cost estimates</li><li>Gathering and/or providing data for the preparation of engineering or environmental reports and studies</li><li>Performing and/or reviewing calculations</li><li>Conducting field investigations and/or survey assistance in order to gather information</li><li>Assist in the collection of various sample matrices (soil, groundwater, sediment, air)</li><li>Documenting and/or observing construction operations</li><li>Performing related duties such as writing memoranda, letters or general reports; collecting and correlating data; maintaining records; attending meetings; and operating sampling equipment</li></ul><p></p><p><b>Qualifications: </b></p><p></p><p>Intern must be actively enrolled in a relevant field of study such as Environmental Engineering, Environmental Science, Geology, Water Resources. The ideal candidate will have successfully completed their sophomore year and be actively enrolled in an accredited 4-year college or university.</p><p></p><p><b>Key requirements are listed but not limited to the following:</b></p><ul><li>Strong written and oral communication skills</li><li>Strong analytical skills</li><li>Knowledge of Microsoft Office</li><li>Valid driver's license</li></ul><p></p><p></p><p></p><p></p><p>As <span class=\"long-word\">employers/governmental</span> contractors, we comply with government regulations, including affirmative action responsibilities where they apply. To assist us in meeting our affirmative action goals, employees are encouraged to refer minorities, women, individuals with disabilities and veterans.</p><p></p><p></p><p>AN EQUAL OPPORTUNITY - AFFIRMATIVE ACTION EMPLOYER</p><p>EEO / MINORITY / FEMALE / INDIVIDUALS WITH DISABILITIES / VETERANS</p></div></div>",
        "index": 4,
        "skills": [
            "project management",
            "networks",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Summer 2022 Intern - Information Security",
        "company": "Federal Reserve System",
        "location": {
            "city": "Dallas",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5d08a6e00d755639d0b8228e4cc39447?lvk=vyhSNzrKLC9t8h8v2ZZB_A.--MAq_Ozs_w",
        "posted": "2021-09-07T06:50:56.134Z",
        "lastScraped": "2021-09-13T06:50:56.134Z",
        "description": "<div><div><p><strong>Company</strong> Federal Reserve Bank of Dallas</p><p>NOTE: This positing will close on Friday, October 29th.</p><p>A requirement of this position is that you must be vaccinated against COVID-19 or qualify for an accommodation from the Bank's vaccination policy; the Bank will provide accommodations as needed by law for individuals unable to be vaccinated because of medical condition or sincerely held religious belief.</p><p>The Federal Reserve Bank of Dallas believes in the diversity of our people, ideas and experiences, and we are committed to building an inclusive culture that represents the communities we serve.</p><p><strong>ABOUT THE DALLAS FED:</strong></p><p>At the Dallas Fed we serve the public by partnering with communities and businesses, promoting jobs and stable prices, and keeping your money safe and available. We welcome different perspectives, ideas, and experiences, and are committed to maintaining an inclusive and diverse culture. As part of the nation's central bank, we are committed to improving the economy and our communities. Are you ready to make a difference?</p><p>Learn more about the Dallas Fed: <span class=\"long-word\">www.dallasfed.org/fed</span> .</p><p><strong>ABOUT THE INTERNSHIP PROGRAM:</strong></p><p>We offer paid, full-time summer internships for many majors, with fulfilling work and opportunities to grow. To help launch your career, we provide dedicated staff mentors. You'll also learn from senior leaders and industry experts. As part of the Federal Reserve System, you'll be connected to a professional network that spans the nation. You will begin in early June and will be based in the Dallas office.</p><p>Learn more about our internship program: <span class=\"long-word\">www.dallasfed.org/internships</span> .</p><p><strong>ABOUT YOUR TEAM:</strong></p><p>The Information Security team in the Information Technology Services department is responsible for information security risk management and awareness activities as directed by National IT or initiated within the District.</p><p><strong>WHAT YOU'LL DO:</strong></p><p></p><ul><li> Provide analytical and administrative support to official staff including coordinating compliance efforts, assisting with risk assessments, and assisting with security incident investigation and forensics as need arises + Collect and analyze information using Microsoft Excel, SharePoint and Access + Work with Information Security Analysts, Engineers, and/or Risk Consultants in support of various operational and project work as assigned</li></ul><p></p><p><strong>WHAT YOU BRING:</strong></p><p></p><ul><li> Majoring in Computer Science (Engineering), Information Systems or Management Information Systems (Business), or equivalent + Proficient with Microsoft Excel, PowerPoint, Word, Outlook, and SharePoint + Proactive and solutions oriented business professional with the ability to interface with all levels of management across business units and functions + Ability to handle sensitive information with the highest degree of integrity and confidentiality + Equivalent education and/or experience may be substituted for any of the above requirements</li></ul><p></p><p><strong>OUR VIRTUAL BENEFITS:</strong></p><p></p><ul><li> Flexible location and hours + Free LinkedIn Learning account + Professional development opportunities + One-on-one Senior Management engagement across District + Broader networking opportunities across District</li></ul><p></p><p><strong>WORK HOURS:</strong></p><p>Monday - Friday, 8:00 a.m. - 5:00 p.m. (40 hours/ week). Some additional hours may be required</p><p><strong>NOTES:</strong></p><p>This is a security sensitive position. By federal law, this position requires that the candidate be a U.S. citizen.</p><p>Employment is contingent upon the selected candidate passing a background check and drug screen. Candidates will be required to submit at least three references and submit fingerprints prior to employment.</p><p>If you need special accommodations during your interview process, please notify your Talent Acquisition Consultant.</p><p><strong><i>We are proud to be an equal opportunity employer</i></strong></p><p><strong>Full Time / Part Time</strong> Full time</p><p><strong>Regular / Temporary</strong> Temporary</p><p><strong>Job Exempt (Yes / No)</strong> No</p><p><strong>Job Category</strong> Internship</p><p><strong>Work Shift</strong> First (United States of America)</p><p><i>The Federal Reserve Banks believe that diversity and inclusion among our employees is critical to our success as an organization, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. The Federal Reserve Banks are committed to equal employment opportunity for employees and job applicants in compliance with applicable law and to an environment where employees are valued for their differences.</i></p><p>Privacy Notice <span class=\"long-word\">(https://www.kansascityfed.org/documents/7797/Workday\\</span><i>Privacy\\</i>Notice.pdf)</p><p>OUR BANK has one of the most recognizable brands around the world. The Federal Reserve is the central bank of the United States-one of the world's most influential, trusted and prestigious financial organizations. The Federal Reserve is charged with the important mission of promoting a strong economy and a stable financial system and fulfills this responsibility by formulating national monetary policy, supervising and regulating banks and bank holding companies, and providing financial services for banks and the U.S. government.</p><p>OUR PEOPLE are diverse in background and ideas, which allows for ongoing creativity and innovation. Ultimately, they are the ones who push our high-performance, exchange-driven culture forward.</p><p>Why Our People Choose Us:</p><p>Our reputation precedes us There will always be room for personal growth Our people are first You'll find the right balance Your responsibilities will be meaningful</p><p>We hope that you will be our future colleague.</p></div></div>",
        "index": 5,
        "skills": [
            "project management",
            "information technology",
            "networks",
            "machine learning",
            "virtual reality",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Business Intelligence Intern",
        "company": "TDS",
        "location": {
            "city": "Madison",
            "state": "Wisconsin",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d5e4928c062e49e63e39285a4f8af270?lvk=pgpgkSN45Lfu1h_-um9lTg.--MAqVCdoPc",
        "posted": "2021-09-10T06:50:58.523Z",
        "lastScraped": "2021-09-13T06:50:58.523Z",
        "description": "<div><div><p>TDS, a Fortune 1000 national communications company, has a great opportunity for a <strong>Business Intelligence (BI) Intern</strong>.&nbsp;This internship provides the unique opportunity to learn about the inter-workings of a large IT organization, along with offering the ability to participate in job shadows, community volunteerism, and employee resource groups (ERG’s) - a student favorite being the Intern Employee Resource Group (ERG). The Intern ERG provides networking opportunities and exposure to Enterprise senior leaders. If you are driven and passionate with the desire to learn, come join and add value to our IT organization!&nbsp;</p><p>&nbsp;</p><p><strong>Duration and Work Schedule</strong></p><p>This internship is full-time (40 hrs/week) from May through August 2022. There may be an opportunity to stay on part-time during the academic school year of 2022-2023 depending on academic schedule and business needs. Start and end dates are flexible. </p><p>&nbsp;</p><p><strong><em>Due to current conditions we support virtual work OR in-person, once safe.&nbsp;</em></strong></p><br><p><strong>What opportunities does this internship offer?</strong></p><p>&nbsp;</p><p>As a <strong>Business Intelligence Intern, </strong>you will be mentored by subject matter experts on responsibilities depending on the team and role you are assigned.</p><p>&nbsp;</p><p>This position will help develop and support BI solutions in partnership with our customers. The <strong>BI Intern</strong> will support a broad base of internal customers ranging from accounting to engineering to shared services, and more. Work may include report and dashboard development, analytics, requirements gathering, and potentially predictive modeling &amp; data visualization projects.</p><br><p><strong>Required Qualifications:</strong><strong>&nbsp;</strong></p><ul><li>Currently pursuing an Associates or Bachelor’s Degree in information systems, computer science, programming or related field</li><li>Two or more semesters of related technology coursework&nbsp;</li></ul><p><strong>Preferred Qualifications:</strong>&nbsp;</p><ul><li>Exposure to or knowledge of ERP Systems, SAP preferred</li><li>Ability to research current and emerging information technologies</li><li>Some knowledge of software development life cycle </li><li>Knowledge of Relational Database Management System concepts and SQL</li><li>Proficiency with MS Office, specifically SharePoint, Excel and Access</li><li>Strong technical aptitude, initiative, creativity, and excellent customer service skills</li><li>Strong analytical problem-solving skills and critical thinking</li><li>Excellent interpersonal skills, including strong verbal and written communication</li><li>Ability to plan and organize multiple tasks</li><li>Solid work ethic and demonstrated ability to meet deadlines</li><li>Ability to work both independently and on team assignments</li><li>Must be assertive, proactive, and seek work and clarification on issues/concerns that arise </li><li>Self-motivated with the ability to act independently and demonstrate sound judgment</li><li>Dependable, accountable, responsive, and committed to follow-through activities</li></ul><p>#TDS provides wireless; cable and wireline broadband, TV and voice; and hosted and managed services to approximately 5.8 million customers nationwide through its business units, U.S. Cellular, TDS Telecom, OneNeck IT Solutions, BendBroadband and Suttle-Straus.</p><p>&nbsp;</p><p>To learn more about this internship or our company, please visit tds.jobs.&nbsp; </p><p>&nbsp;</p><p><strong>EEO</strong><strong>&nbsp;</strong></p></div></div>",
        "index": 6,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "sql",
            "data visualization",
            "networks",
            "machine learning",
            "virtual reality"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern - Software Developer",
        "company": "SECURA Insurance",
        "location": {
            "city": "Neenah",
            "state": "Wisconsin",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/34bfc996f80e04cb70029b8ce2d752ba?lvk=XRWOlIPMwGdHpAp1F7CpAQ.--MAX9wlh1g",
        "posted": "2021-09-08T06:51:00.085Z",
        "lastScraped": "2021-09-13T06:51:00.085Z",
        "description": "<div><div><p>RESPONSIBILITIES:</p><ul><li>Consistently write, translate, and code software programs and applications according to specifications</li><li>Work independently and assume ownership of all assigned deliverables</li><li>Perform assigned project tasks in a highly interactive team environment while maintaining a productive and positive atmosphere</li><li>Maintain and support solutions within the IT Claims team that supports our Claims division, including designing, creating and managing programs in .NET, MS SQL Server, C# and javascript (React and other libraries).</li><li>Other duties as assigned</li></ul><p>QUALIFICATIONS:</p><ul><li>Computer science or information systems course work or previous internship experience in related field</li><li>Programming experience in an object-oriented language, preferably .NET or Java</li><li>Exposure to both database and server configuration</li><li>Demonstrates an eagerness to learn</li><li>Detailoriented and ability to work collaboratively in a deadlinedriven environment</li><li>Excellent oral and written communication skills</li><li>Ability to work effectively both independently and as part of a team</li><li>Software Developer Internship</li><ul><li>understanding of messaging and APIs, including XML, JSON, SOAP, and REST</li></ul></ul></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "sql",
            "javascript",
            "java",
            "c and c++",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Intern - Research - Zwick Lab",
        "company": "Scripps Research",
        "location": {
            "city": "La Jolla",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/df899ef58ac640cf40e16cbf255fb87c?lvk=kIWx8f90itSd0RU6jVI08Q.--MAn_ajBy3",
        "posted": "2021-09-11T06:51:01.533Z",
        "lastScraped": "2021-09-13T06:51:01.533Z",
        "description": "<div><div><div><b>ABOUT US: </b>Scripps Research is ranked the most influential institution in the world for its impact on innovation. We expand basic knowledge in the biosciences, and use these fundamental advancements to develop profound innovations that improve wellbeing. Our educational and training programs mold talented and committed students and postdocs into leading edge scientists. Scientists in the institute’s five academic research departments work hand-in-hand with researchers of the Scripps Research Translational Institute and Calibr to merge foundational studies in biology, chemistry and computer science with translational science to produce pioneering drugs and advances in digital and precision medicine. Together, we cultivate new scientific leaders and expand the frontiers of knowledge to deliver medical breakthroughs to better human health around the globe. If you have a passion for making a difference, this could be your opportunity to join our transformative team.</div><div></div><div><b>POSITION TITLE:</b> Intern-Research</div><div><br><b>POSITION SUMMARY:</b></div><div></div><div>Intern will receive occupational experience, closely supervised training and will be able to develop professional skills. Duties include basic laboratory maintenance such as glassware washing; autoclaving; media, solution, and buffer prep; replenish supplies and follow experimental procedures assigned by laboratory staff.</div><div><ul><li>Part-time: Up to 19 hours per week</li><li>This position is not eligible for benefits.</li><li>This is a year-round position, not a summer intern or other short-term internship. </li></ul></div><div></div><div><b>REQUIREMENTS: </b></div><div></div><div>This position works in a typical office environment. With or without reasonable accommodation, employees in this position must be able to sit and type at a computer terminal for up to 8 hours per day with appropriate breaks and performs tasks that require fine dexterity and repetitive motions using the arms, hands, wrists, and fingers. Further details of the physical requirements of established essential functions for this position will be <span class=\"long-word\">addressed/discussed</span> during the interview process. </div><ul><li>Requires current enrollment in either a high school or college/university educational program. Undergraduate enrolled in a relevant scientific program, e.g., biological or life science, strongly preferred.</li></ul><div></div><div><div><i>The above statements describe the level of work performed and expected in general terms. The statements are not intended to list all the responsibilities, duties and/or skills required of employees so classified, and the content herein is subject to change due to the business needs of Scripps Research, with or without notice. Furthermore, nothing in this job description shall be interpreted to be in conflict with or to eliminate or modify in any way the employment-at-will status of Scripps Research staff.</i></div><div></div><div><b>EEO Statement:</b></div><div><i>The Scripps Research Institute is an Equal Opportunity Employer. All qualified applicants are encouraged to apply and will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other legally protected characteristic or status.</i></div><div></div><div><b>COVID-19 update:</b></div><div><i>The safety and well-being of our candidates, our people and their families continues to be a top priority. Until restrictions change, interviews will be conducted virtually. New hires will work remotely, unless specifically authorized for campus access</i><i>.</i></div></div></div></div>",
        "index": 8,
        "skills": [
            "virtual reality"
        ],
        "remote": true
    },
    {
        "position": "Graduate Cost Consultant (Available 2022)",
        "company": "Americas Region - Arup",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/644e9e2c3680965a7a1bde8ee2810fbf?lvk=5RND9xmJXpI_Oi6h7skExg.--MARxrj9is",
        "posted": "2021-09-08T06:51:03.935Z",
        "lastScraped": "2021-09-13T06:51:03.935Z",
        "description": "<div><div><p><strong>Start Here, Go Anywhere! &nbsp;&nbsp;</strong></p><p>Want to work for a company that invests in innovation and people who catalyze impact in the built environment? Arup is proud to be recognized by Fast Company in their third annual Best Workplaces for Innovators list, which honors businesses and organizations that demonstrate a deep commitment to encouraging innovation at all levels.&nbsp;</p><p>We find solutions for some of the world's most complex problems. From climate action to social value, we consider the broadest impacts of our work. We strive to build a more sustainable, resilient, and equitable future. This purpose shapes our culture and has made us leaders in sustainable development. You'd be joining our multi-disciplinary design teams focusing on technical excellence and innovative solutions that create a better future for people, places, and the planet.&nbsp;</p><p>During your career at Arup, you'll have the chance to engage in a fulfilling career and work with some of the most highly respected engineers and specialists in the world. You'll also get the opportunity to work on exciting and significant projects, delivering quality work that has a positive and lasting influence on the community and the environment. &nbsp;</p><p>We often find that there is overlap across the range of advisory services that we provide, and our team members have the opportunity to work across a broad range of activities as well as being able to focus on particular areas of interest. &nbsp;Responsibilities of this specific role therefore will include, but not be limited to, the following:&nbsp;</p><p><strong>Responsibilities of this specific role will include, but not be limited to the following:&nbsp;</strong></p><ul><li>Prepare and maintain project design and construction schedules using a variety of scheduling software e.g. Primavera, MS Project plus interfaces with associated software e.g. @Risk, HCSS&nbsp;</li><li>Work with a team of professional estimators to extract cost, labor, material and other resources to create resource-loaded schedules&nbsp;</li><li>Understand the estimates that form the basis of the work being scheduled&nbsp;</li><li>Present simplified, easy to visualize schedule roll ups for high level management reporting&nbsp;</li><li>Perform quantity take-offs&nbsp;</li><li>Develop high-level and detailed construction cost estimates&nbsp;</li></ul><p><strong>Qualifications &nbsp;</strong></p><p><strong>Required:&nbsp;</strong></p><ul><li>Bachelor's degree in Engineering, Construction Management, Economics, Business or Finance, Organizational Psychology, Computer Science, Logistics or similar with coursework in engineering, economics, business and/or applied math/sciences where relevant:&nbsp;</li><li>3.0 GPA or higher&nbsp;</li><li>Completion of at least one relevant internship while pursuing the above degree(s)&nbsp;</li><li>Strong interest in infrastructure project development, delivery and/or operations&nbsp;</li><li>Knowledge of basic business and operational concepts&nbsp;</li><li>Strong quantitative skills with good knowledge of MS Excel.&nbsp;</li><li>Proficient in MS Office suite.&nbsp;</li><li>The ability to prioritize effectively, balance assigned work and exceptional organization skills required for our constantly evolving environment&nbsp;</li><li>Strong interpersonal and communication skills essential for team-based working&nbsp;</li><li>Presentation skills with colleagues and clients at all levels&nbsp;</li><li>Analytical mindset and/or Strategic thinker&nbsp;</li><li>Willingness to travel both domestically and internationally&nbsp;</li><li>Must not require sponsorship, now or in the future to be considered for this role&nbsp;</li></ul><p><strong>Preferred:&nbsp;</strong></p><ul><li>Master's degree Construction Management, Economics, Business or Finance, Organizational Psychology, Computer Science, Logistics or similar&nbsp;</li><li>Bilingual (Spanish or Portuguese with English)&nbsp;</li><li>Familiarity with project management tools and techniques&nbsp;</li><li>Flexibility and Out-of-the-Box innovative thinking&nbsp;</li></ul><p><strong>Also:&nbsp;</strong></p><ul><li>Additional relevant work or internship experience with a contractor, design firm, or cost consulting firm.&nbsp;</li><li>Relevant experience across a variety of project types in both infrastructure and buildings e.g. rail, bridges, tunnels, large office/mixed use etc.&nbsp;</li><li>Working understanding of project development process and project finance&nbsp;</li><li>Coursework in construction economics or construction management&nbsp;</li><li>FE/EIT Certification, CCT/CST, LEED&nbsp;</li><li>Knowledge of AutoCAD, MicroStation, Revit, Primavera 6, Excel Financial Modeling techniques, VBA. Programming languages also a plus.&nbsp;</li></ul><p><strong>Notable Projects&nbsp;</strong></p><p>For over seven decades Arup has been at the forefront of the most ambitious and innovative design and engineering. From concert halls to national stadiums, renewable energy to driverless cars, we continue to add to that history every day. Notable projects from our Cost Consulting team include:&nbsp;</p><ul><li>Second Avenue Subway&nbsp;</li><li>Fulton Street Transit Center&nbsp;</li><li>JetBlue Airway's Terminal 5 at JFK Airport&nbsp;</li><li>Renovation of Lincoln Center&nbsp;</li></ul><p><strong>Flexible Working</strong></p><p>We believe that flexible arrangements create a more inclusive way of working that supports our diversity and the wellbeing of our people. Options include alternative schedules, part-time or reduced hours schedule, and/or the ability to work remotely for a portion of your work week.&nbsp;</p><p>&nbsp;<br><strong>Benefits&nbsp;</strong></p><p>Upon joining Arup your journey is likely to be varied and rewarding, giving you the opportunity to make a positive difference in the world. Arup offers many benefits to eligible FT employees, some of which are outlined below:&nbsp;</p><ul><li>Global Profit Share - paid out bi-annually&nbsp;</li><li>Personal Health Insurance&nbsp;</li><li>401(k) - with a dollar-for-dollar company match up to 10%&nbsp;</li><li>Paid Time Off (PTO)&nbsp;</li><li>Tuition reimbursement&nbsp;</li><li>Professional Membership and Certification reimbursement&nbsp;</li></ul><p>Arup is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, marital status, age, national origin, ancestry, disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law. Individuals with disabilities are provided reasonable accommodation. Should you require an accommodation in the job application or interview process please let us know by sending an email to americas@arup.com.&nbsp;</p></div></div>",
        "index": 9,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "data visualization"
        ],
        "compensation": "paid",
        "contact": "americas@arup.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Systems Integration Test Intern",
        "company": "KARL STORZ",
        "location": {
            "city": "Goleta",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e0514d3c98beede13ac7381987ee4a70?lvk=iTYE3qmKB-Ydt8nET1xJRg.--MASTQxcAk",
        "posted": "2021-09-08T06:51:04.956Z",
        "lastScraped": "2021-09-13T06:51:04.956Z",
        "description": "<div><div><p></p><p>Company:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; KARL STORZ Imaging, Inc. (KSI)</p><p>Job Code:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;11891</p><p>Pay Grade:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p><p><strong>Description</strong></p><p>KARL STORZ SE &amp; Co. KG based in Tuttlingen, Germany, is a family-owned, global company committed to benefiting humanity by advancing medical technology through innovation and education.</p><p>For more than 75&nbsp;years, KARL STORZ has been dedicated to earning its international reputation as a leader that designs, engineers, manufactures, and markets all its products with an emphasis on visionary design, precision craftsmanship, and clinical effectiveness.</p><p></p><p><b>SUMMARY OF JOB FUNCTION WITHIN DEPARTMENT:</b></p><p>Supports all phases of hardware and software integration and informal verification activities throughout the life cycle of a product.&nbsp; </p><p><b>ESSENTIAL DUTIES &amp; RESPONSIBILITIES:</b></p><p>Integration Test Engineer Responsibilities:</p><p>&nbsp;</p><ul><li>Help debug and characterize defects, providing detailed configuration and descriptions for passing and failing tests for product evaluation reports. <ol><li><ol><li><ol><li>Exploratory system testing</li></ol></li></ol></li></ol></li></ul><p><b>SKILLS, KNOWLEDGE, AND LICENSE OR CERTIFICATE REQUIRED:</b></p><ul><li>Knowledge of Linux, Windows.</li><li>Software development skills - working toward College degree in Electrical Engineering or Computer Science, junior level or greater preferred &nbsp;</li></ul><p><strong>&nbsp;</strong></p><p><strong>PHYSICAL REQUIREMENTS: (Describe the specific physical requirements necessary to accomplish the essential job functions, i.e. ability to sit or stand for long periods of time, lifting requirements, audio/visual requirements etc.)</strong></p><p>This position requires occasional lifting of test equipment such as a PC, monitor, camera, etc. up to approximately 30 lbs.&nbsp; The employee will also need to be seated and work in front of a monitor for extended periods of time.</p><p>&nbsp;</p><p><b><span class=\"long-word\">EDUCATION/EXPERIENCE:</span>&nbsp; (Typical pattern of education and experience that would provide the knowledge and skills indicative of successful job performance.)</b></p><p>1-2 years of experience with electronics and associated measurement equipment (desired)</p><p>2+ years of school toward a degree in Electrical Engineering or Computer Engineering (at an accredited college)</p><p>&nbsp;</p><p><strong>TRAINING REQUIREMENTS:&nbsp; (Safety, regulatory compliance, legal &amp; job specific)</strong></p><ul><li>Injury and Illness Prevention Program; annually - OSHA requirement</li><li>Quality System training</li><li>Job Specific - In house requirement</li></ul><p>#LI -SL1</p><p><strong>New career site for external applicants</strong> using Application form for external applicants (not MA)<br> Link to job posting: <span class=\"long-word\">https://phf.tbe.taleo.net/phf01/ats/careers/v2/viewRequisition?org=KARLSTORZENDO</span>&amp;cws=41&amp;rid=11891</p><p>&nbsp;</p><p></p><p><strong>Vaccine requirements at KARL STORZ due to COVID-19</strong><br> KARL STORZ is committed to maintaining a safe work environment for our employees and therefore we require the COVID-19 vaccine for all of our employees unless otherwise due to an underlying medical condition or <em>sincerely held</em> religious beliefs. During the interview process, we encourage you to ask how COVID-19 may impact the role you are seeking and if you require a reasonable accommodation regarding the vaccine requirement see below on the process for requesting accommodation. Please&nbsp;click here&nbsp;to learn more about our overall response to COVID-19.</p><p><strong>Employee Benefits Program Overview for U.S. Locations</strong></p><ul><li>Medical / Dental / Vision including a state of the art wellness program and pet insurance, too!*</li><li>3 weeks' vacation, 10 holidays plus paid sick time*</li><li>401K retirement savings plan providing a match of 60% of the employee's first 6% contribution</li><li>Section 125 Flexible Spending Accounts</li><li>Life, STD, LTD &amp; LTC Insurance</li><li>Tuition reimbursement of up to $5,250 per year</li><li>Fitness reimbursement up to $200 annually</li><li>Employee referral program of up to $2,000 per hire</li><li>And much more!</li></ul><p><em>*Field sales, internships and part-time employees are not eligible except for where required by state law.<br> Non-employees, including temporary workers and consultants, are not eligible to participate in KARL STORZ benefits program.</em></p><p>KARL STORZ reserves the right to change or modify the employee's job description whether orally or in writing, at any time during the employment relationship. Additionally, KARL STORZ, through its supervisors, may require an employee to perform duties outside their normal description within the sole discretion of the supervisor. Employee must comply will all applicable KARL STORZ policies and procedures.</p><p><strong>Equal Employment Opportunity &amp;&nbsp;</strong><strong>Reasonable Accommodation&nbsp;</strong><strong>Statement</strong><br> KARL STORZ is committed to creating an inclusive space where employees are valued for their skills and unique experiences.&nbsp; To achieve this goal, we are committed to diverse voices and all applicants will receive consideration without regard to race, color, sex, national origin, disability, veteran status or any other protected characteristic.&nbsp; KARL STORZ is also committed to providing reasonable accommodations during our recruitment process.&nbsp; Should you need assistance or accommodation please email us at <span class=\"long-word\">TaleoAdministrator@karlstorz.com.</span>&nbsp;</p><p><strong>Notice to Employment Agencies</strong><br> This recruitment assignment is being managed directly by KARL STORZ's Human ...</p></div></div>",
        "index": 10,
        "skills": [
            "information technology",
            "software engineering",
            "data visualization",
            "hardware",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "contact": "TaleoAdministrator@karlstorz.com",
        "remote": false
    },
    {
        "position": "Student Analyst - Center for Applied Systems & Software (CASS)",
        "company": "Oregon State University",
        "location": {
            "city": "Corvallis",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/90eb01228191d36412c5e92cb436fe56?lvk=sdMexEGK3mQuU8cC8-6jug.--MA9xgiJxg",
        "posted": "2021-09-05T06:51:05.918Z",
        "lastScraped": "2021-09-13T06:51:05.918Z",
        "description": "<div><div><div> Position Title Undergraduate Student Information Technology Job Title Student Analyst - Center for Applied Systems &amp; Software (CASS) Appointment Type Student Employee Job Location Corvallis Position Appointment Percent 100 Appointment Basis 12 Min Hourly Rate $12.75 (Standard); $12.00 (Non-Urban); $14.00 (Portland Metro) Max Hourly Rate $18.00 (Standard); $17.50 (Non-Urban); $18.50 (Portland Metro) Position Summary <div> This recruitment will be used to fill multiple part-time (a maximum of 20 hours per week) CASS Student Developer positions for the School of Electrical Engineering and Computer Science ( EECS) at Oregon State University ( OSU).&nbsp; <br><br>This is a pooled posting. That means it will stay open for several months and we will pull applicants from the \"pool\" for interviews as openings occur, until the closing date, and possibly beyond. Analysts are needed to start ASAP and potentially more in the coming months to meet client needs. </div><div><br></div><div> The Center for Applied Systems and Software ( CASS) exists as an on-campus student internship program. Hourly students are hired and trained by full time developers or student managers to perform computer hardware and software testing, and/or development projects for actual contracted clients-for real-world industry experience, without having to leave the realm of Oregon State University. </div><div><br></div><div> The analyst position averages 1-3 years in length, and most graduates are hired by technology companies. </div><div><br></div><div> In addition to the technical and development skills students gain, they also learn how to work as a member of a team, gain an appreciation of the importance of deadlines, and other facets of running a business such as planning, budgeting, resource allocation, documentation and communication. </div> Position Duties <div> Primary responsibilities for a Student Analyst include documentation development and software testing. </div><div> Writing documentation may require designing software mock-ups, developing vision and scope documents, and drafting technical specifications. </div><div> Testing software for clients requires test case writing, as well as functional testing of new features. You will be working in a development environment. </div><div> Each day, students receive their assignments from the full-time development staff. These assignments are relative to the projects currently being done by the CASS. Students are expected to keep up with these assignments and to be able to finish them in a reasonable amount of time. </div><div> They should be able to work in a team environment comprised of students and staff members </div> Minimum Qualifications <div> Employment Eligibility Requirements ( <span class=\"long-word\">http://fa.oregonstate.edu/stu</span>-manual/500-employment-eligibility-requirements) </div> Additional Required Qualifications <div> Must be proficient in technical writing. </div><div> Must be able to analyze and document business processes and system logic. </div><div> Must be proficient with Microsoft Office and other business software packages. </div><div> Need to have at least 9 months of schooling left. </div> Preferred (Special) Qualifications <div> Would like the applicant to have work experience (volunteer work can count). </div> Working Conditions / Work Schedule <div> Typical work schedule is at least 2-hour-consecutive periods between 8am - 6pm Monday -Friday Pacific Time. </div><div> Minimum 15-hours per week during academic term. </div><div> Possibility of up to 40 hours during breaks if there is work to be completed. </div></div><div> Posting Number P07789SE Number of Vacancies 2 Anticipated Appointment Begin Date Anticipated Appointment End Date Posting Date 09/20/2021 Full Consideration Date Closing Date 12/10/2021 Indicate how you intend to recruit for this search Competitive / Student - open to ALL qualified/eligible students Special Instructions to Applicants <div> When applying you will be required to attach the following electronic documents: </div><ul><li>A Resume/Vita</li><li>A cover letter indicating how your qualifications and experience have prepared you for this position.</li><li>A sample of your writing: This short sample can be written in the \"supplemental questions\" section, or an assignment from a writing class can be attached.</li><p></p></ul><div> For additional information please contact: <strong>Carrie Hertel</strong> at <span class=\"long-word\">info@CASS.oregonstate.edu.</span> </div><div> &nbsp; </div><div> Offers of employment are contingent upon meeting all minimum qualifications including the Criminal History Check requirement. </div><div> &nbsp; </div><div> OSU commits to inclusive excellence by advancing equity and diversity in all that we do. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community. <br><br></div><div> This position is designated as a critical or security-sensitive position; therefore, the incumbent must successfully complete a criminal history check and be determined to be position qualified as per OSU Standard 576-055-0000 et seq. Incumbents are required to self-report convictions and those in youth programs may have additional criminal history checks every 24 months. </div><div><br>&nbsp; <strong>Note:&nbsp; All job offers are contingent upon Human Resources final approval.</strong></div></div></div></div>",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "hardware",
            "machine learning"
        ],
        "contact": "576-055-0000",
        "remote": false
    },
    {
        "position": "MLS/Med Tech (Certified) Part Time Day/Pm Shift Park Ridge",
        "company": "Aurora Health Care, Inc.",
        "location": {
            "city": "Park Ridge",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/005eb4a50dd8ef6f2d573c05470b7e08?lvk=7qwtm16eR2x0XDg0Cts_5w.--MAqbIKHWV",
        "posted": "2021-09-09T06:51:06.822Z",
        "lastScraped": "2021-09-13T06:51:06.822Z",
        "description": "<div><div><b>Position Requirements:</b><br>Bachelor degree and graduation from a Medical Technology program approved by the National Accrediting Agency for Clinical Laboratory Sciences (NAACLS) or an equivalent program, in a science related field, or documented equivalent education and training. Previous experience with laboratory equipment and methodologies (preferably those related to areas of responsibility). Clinical internship may be equivalent to experience.<br>Basic computer literacy. <br> MLS(ASCP), MT(ASCP), MT(AMT) with baccalaureate degree. ASCP Board of Certification (BOC) categorical certification (BB, C, H, I, M) or a baccalaureate degree where categorical certification in specialty area is not available. Hazardous chemical exposure and contact with infectious biological specimens and sharps are experienced on a daily basis.<br><br>Ability to lift (medium~up to 20~50 pound occasionally and/or 10 ~25 pounds frequently) and use of keyboard and microscope extensively may be required, dependent upon job and shift assignment. Prolonged standing, lifting, bending, and telephone use. Some instrumentation and work counter are higher than table height.<br>Fast paced en environment with established time constraints.<br><br><b>Purpose:</b><br>Under general supervision, performs diagnostic testing and related responsibilities. Demonstrate understanding of scientific theories and techniques of procedures performed.<br><br><b>Accountabilities:</b><br>Performs moderately and/or highly complex analyses with accuracy and precision, understanding basic and complex principles of methodology<br>Participates in development and education<br>Maintains adequate inventory of supplies as required by the department.<br>Correlates various clinical laboratory test results, applies these results to clinical conditions and recognizes accepted normal ranges.<br>Performs, monitores, and evaluates quality control, applies the principles of quality control when reporting tests.<br>Identification and resolution of technical problems related to laboratory methodology, instrumentation, and procedures under direction of the Laboratory Manager.<br></div></div>",
        "index": 12,
        "skills": [
            "c and c++",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Med Lab Technician Certified .5 Days Christ Medical Center, Oaklawn",
        "company": "Aurora Health Care, Inc.",
        "location": {
            "city": "Oak Lawn",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b20e1fd2db08f95f1d65575736db1a55?lvk=IpFztJzYvmU9_qt_7erJsg.--MAqbO0GUN",
        "posted": "2021-09-07T06:51:07.854Z",
        "lastScraped": "2021-09-13T06:51:07.854Z",
        "description": "<div><div><p><b>Med Tech Certified .6 Days</b></p><p>Bonus $625 paid 90 days after start date.</p><p><b>Position Requirements:</b><br>Associate degree and graduation from a Medical laboratory technician program approved by the National Accrediting Agency for Clinical laboratory Sciences (NAACLS) or an equivalent program, or documented equivalent education and training.<br>(Clinical internship may be equivalent to experience.) Previous experience with laboratory equipment and methodologies (preferably those related to areas of responsibility).<br>Basic computer literacy. MLT (ASCP), MLT (AMT) with associate degree, or an associate degree where categorical certification in specialty area is not available. Hazardous chemical exposure and contact with infectious biological specimens and sharps are experienced on a daily basis.<br><br>Ability to lift (medium ~~up to 20 to 50 pounds occasionally and/or 10~25 pounds frequently and/or up to 10 pounds (constantly) and use of keyboard and microscope extensively may be required, dependent upon job and shift assignment. Prolonged standing, lifting, bending, and telephone use. Some instrumentation and work counters are high than table height.<br><br>Fast paced environment with established time constraints.<br><br><b>Purpose:</b><br>Under general supervision, performs diagnostic testing and related responsibilities.<br><br><b>Accountabilities:</b><br>Performs simple, moderately and/or highly complex analyses with accuracy and precision, understanding basic and complex principles of methodology.<br>Participates in development and education<br>Maintains adequate inventory of supplies as required by the department.<br>Correlates various clinical laboratory test results, applies these results to clinical conditions and recognizes accepted normal ranges.<br>Performs monitors and evaluates quality control, applies the principles of quality control when reporting tests.<br>Identification and resolution of technical problems related to laboratory methodology, instrumentation and procedures under the direction of Laboaratory Management.</p></div></div>",
        "index": 13,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "start": "2021-04-30T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Undergrad Research Assistant",
        "company": "Fred Hutchinson Cancer Research Center",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/dd59f57cca7210122c8df5d1a421ffd9?lvk=il3VNkrepe0BspGfQFdxdw.--MAbMRgd-Z",
        "posted": "2021-09-10T06:51:08.803Z",
        "lastScraped": "2021-09-13T06:51:08.803Z",
        "description": "<div><div><p>Overview </p><p><strong>Cures Start Here.&nbsp;</strong>At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network.&nbsp;<strong>Careers Start Here.</strong></p><p>&nbsp;</p><p>At Fred Hutch, we believe that the innovation, collaboration, and rigor that result from diversity and inclusion are critical to our mission of eliminating cancer and related diseases. We seek employees&nbsp;who bring&nbsp;different and innovative&nbsp;ways of seeing the world and solving problems.&nbsp;Fred Hutch is in pursuit of becoming an antiracist organization.&nbsp;&nbsp;We&nbsp;are committed to ensuring that all candidates hired share our commitment to diversity,&nbsp;antiracism, and inclusion.&nbsp;&nbsp;&nbsp;</p><p>&nbsp;</p><p>The environment is lively yet casual, with a strong emphasis on collaborative work between postdocs, PhD students, interns, and programmers.&nbsp;</p><p>&nbsp;</p><p>The Center is housed in a lovely campus on Lake Union a short walk from downtown, and a slightly longer walk from the University of Washington. The Matsen group is in the newly-remodeled Steam Plant building overlooking the lake. We believe that science is for everyone. We have had researchers with a variety of backgrounds, including Latinx, Black, Asian, and Middle Eastern. We have had women, men, gay, and straight, and we welcome people of all sexual orientations and gender identities. We have had successful high schoolers, postdocs, people who were the first in their family to attend college, and one who had decided that college wasn't for them. We have had researchers with backgrounds in biology, physics, statistics, math, and computer science.</p><p>&nbsp;</p><p>We acknowledge the historical and present barriers for underrepresented groups, and work to increase diversity, equity and inclusion in computational biology. Members of underrepresented groups are especially encouraged to apply.</p><p>&nbsp;</p><p>Please read our expectations of group members. By applying for this position, we expect that you will fulfill these expectations. We enthusiastically solicit feedback on these expectations or requests for clarification.</p><p>&nbsp;</p><p>You can find out more about our group by visiting the Matsen group website.</p><p>&nbsp;</p><p><em><strong>This is a part time position, 5-10 hours per week.</strong></em></p> Responsibilities <p>Our research group develops and applies methods to learn about evolution and immunology from molecular sequence data. This is a very dynamic field right now, with many opportunities.</p><p>&nbsp;</p><p>Our group is growing quickly! Currently, the lab head is responsible for all administrative tasks that require some technical expertise.&nbsp; As a lab assistant in the Matsen Group, you will work with the lab head to keep things moving smoothly. You will be primarily responsible for:</p><ul><li>Updating our group wiki site</li><li>Keeping the lab website up to date (it uses Jekyll, Bootstrap, and some Python scripts)</li><li>Onboarding new group members, including providing computing equipment, sending calendar, Slack, and GitHub invites, and orienting them at the office</li><li>Tracking, distributing, and ordering (computing) equipment</li><li>Coordinating group events</li><li>Updating calendars</li><li>Automating software builds with Docker</li></ul><p>This role will have the opportunity to work partially at our campus and remotely. On site requirements may include inventorying equipment and welcoming new group members when they arrive. For these you will need to come to the lovely Steam Plant building in South Lake Union. Of course, if you want to come more you would be absolutely welcome!</p><p>&nbsp;</p><p>Depending on your interests and ability, we would also love for this to include a significant research component, including:</p><ul><li>Attending group meetings</li><li>Contributing code to the group codebase, and participating in code review</li><li>In-depth involvement in one or more projects</li></ul><p>See our website for more information about what we do.</p> Qualifications <ul><li>Undergraduate student from any program with the right combination of skills</li><li>Organized</li><li>Familiar with the tools we use (Python, git, GitHub, Docker)</li><li>Willing to dive into administrative tasks</li><li>Able to communicate and approach tasks/challenges with confidence</li><li>Interested in the group's research, and excited to contribute</li></ul><p>Please include the following with your application:</p><ul><li>A CV summarizing your education and work experience so far.</li><li>The names and email addresses of two references.</li><li>A code sample showing work that you are proud of. This has to be nontrivial, but doesn't have to be long. Ideally it would be publicly accessible, e.g. on GitHub, but if that's not possible an emailed attachment is fine too.</li></ul><p><em>A statement describing your commitment and contributions toward greater diversity, equity, inclusion, and antiracism in your career or that will be made through your work at Fred Hutch is requested of all finalists.</em></p><p>&nbsp;</p> Our Commitment to Diversity We are proud to be an Equal Employment Opportunity (EEO) and Vietnam Era Veterans Readjustment Assistance Act (VEVRAA) Employer. We are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability (physical or mental), marital or veteran status, genetic information, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at <span class=\"long-word\">hrops@fredhutch.org</span> or by calling 206-667-4700.</div></div>",
        "index": 14,
        "skills": [
            "networks",
            "python",
            "machine learning",
            "project management",
            "information technology",
            "software engineering"
        ],
        "contact": "206-667-4700",
        "remote": true
    },
    {
        "position": "P&C Actuarial Analyst",
        "company": "ALLSTATE INSURANCE COMPANY",
        "location": {
            "city": "Remote",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f98c97e3a6c291b1606d41fee4f9ac6b?lvk=QBXbO_zTabwV0h6nf7XsIA.--MAX6QOwfo",
        "posted": "2021-09-08T06:51:09.878Z",
        "lastScraped": "2021-09-13T06:51:09.878Z",
        "description": "<div><div><p>The world isn't standing still, and neither is Allstate. We're moving quickly, looking across our businesses and brands and taking bold steps to better serve customers' evolving needs. That's why now is an exciting time to join our team. You'll have opportunities to take risks, challenge the status quo and shape the future for the greater good.</p><p>You'll do all this in an environment of excellence and the highest ethical standards - a place where values such as integrity, inclusive diversity and accountability are paramount. We empower every employee to lead, drive change and give back where they work and live. Our people are our greatest strength, and we work as one team in service of our customers and communities.</p><p>Everything we do at Allstate is driven by a shared purpose: to protect people from life's uncertainties so they can realize their hopes and dreams. For more than 89 years we've thrived by staying a step ahead of whatever's coming next - to give customers peace of mind no matter what changes they face. We acted with conviction to advocate for seat belts, air bags and graduated driving laws. We help give survivors of domestic violence a voice through financial empowerment. We've been an industry leader in pricing sophistication, telematics, digital photo claims and, more recently, device and identity protection. We are the Good Hands. We don't follow the trends. We set them.</p><div><div><div> Job Summary </div><div><p></p><p><b>This position can be fully home-based or hybrid (part-time in office/part-time remotein select locations:AZ &amp;IL)</b></p><p></p><p><b>*** Please note that our current Actuarial Analyst openings are for a June 2022 start date ***</b></p><p></p><p>This entry level role is responsible for executing projects in support of pricinginsurance business utilizing accepted actuarial and statistical standards, as well as methodologies and knowledge gained through on the job training. This role works closely with analytics management and key business partners to execute appropriate pricing, modeling and product strategies of low complexity to support business goals.</p><p></p></div></div><div><div> Key Responsibilities </div><div><p></p><ul><li>Uses best practices, with significant coaching, to review &amp; analyze business data using traditional actuarial, statistical and/or predictive modeling techniques to provide insights and meet business needs</li><li>With significant coaching, reviews and ensures quality of data used to perform actuarial and statistical services within multiple tools/applications</li><li>Communicates analysis results to management and non-technical users, making recommendations and providing support for assumptions and methodologies</li><li>Develops understanding of insurance business, products, and regulatory environments</li></ul><p><br> Supervisory Responsibilities:</p><ul><li>This job does not have supervisory responsibilities</li></ul><p></p></div></div><div><div> Job Qualifications </div><div><p></p><p>Education and Experience</p><ul><li>Bachelor's degree required - preferably in related field of study such as actuarial science, math/applied math, statistics/applied statistics</li><li>Actuarial internship preferred, but not required</li><li>0-2 years of experience</li></ul><p></p><p>Certificates, Licenses, Registrations</p><ul><li>Pursuing actuarial designation</li></ul><p></p><p>Functional Skills</p><ul><li>Basic knowledge in the use and ability to learn a wide variety of tools, data sources and computer applications</li><li>Strong written and verbal communication skills</li><li>Basic product, price, risk management and insurance knowledge, including professional standards of <span class=\"long-word\">actuarial/statistical</span> techniques, preferred but not required</li><li>Ability to complete multiple concurrent assignments in a timely manner</li><li>Work effectively in a team environment</li></ul><p></p><p>Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. People rarely meet 100% of the <span class=\"long-word\">qualifications.Allstate</span> encourages you to break that statistic and to apply. We look forward to your application. </p><p></p></div></div><div><div> Compensation Data </div><div><p></p><p>The minimum salary for this position is $63,200. The maximum salary is $84,250. The salary offered will be commensurate with experience.</p><p></p><p></p></div></div></div><p>The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.</p><p></p><p><strong>Good Work. Good Life. Good Hands. </strong></p><p></p><p>As a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.</p><p></p><p>Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.</p><p></p><p><strong>Allstate generally does not sponsor individuals for employment-based visas for this position.</strong></p><p></p><p>Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.</p><p></p><p>For jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.<br> For jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.</p><p></p><p>To view the \"EEO is the Law\" poster click \"here\". This poster provides information concerning the laws and procedures for filing complaints of violations of the laws with the Office of Federal Contract Compliance Programs</p><p></p><p>To view the FMLA poster, click \"here\". This poster summarizing the major provisions of the Family and Medical Leave Act (FMLA) and telling employees how to file a complaint.</p><p></p><p>It is the Company's policy to employ the best qualified individuals available for all jobs. Therefore, any discriminatory action taken on account of an employee's ancestry, age, color, disability, genetic information, gender, gender identity, gender expression, sexual and reproductive health decision, marital status, medical condition, military or veteran status, national origin, race (include traits historically associated with race, including, but not limited to, hair texture and protective hairstyles), religion (including religious dress), sex, or sexual orientation that adversely affects an employee's terms or conditions of employment is prohibited. This policy applies to all aspects of the employment relationship, including, but not limited to, hiring, training, salary administration, promotion, job assignment, benefits, discipline, and separation of employment.</p></div></div>",
        "index": 15,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2022-05-31T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Customer Success Intern - Part Time (Remote)",
        "company": "CrowdStrike",
        "location": {
            "city": "Irvine",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/90ace2759d8c5a5cce6e308936d9582f?lvk=qhVXiEskQZppgsV-ztQh6w.--MAgcsWpgk",
        "posted": "2021-09-10T06:51:10.827Z",
        "lastScraped": "2021-09-13T06:51:10.827Z",
        "description": "<div><div><p>At CrowdStrike we're on a mission - to stop breaches. Our groundbreaking technology, services delivery, and intelligence gathering together with our innovations in machine learning and behavioral-based detection, allow our customers to not only defend themselves, but do so in a future-proof manner. We've earned numerous honors and top rankings for our technology, organization and people - clearly confirming our industry leadership and our special culture driving it. We also offer flexible work arrangements to help our people manage their personal and professional lives in a way that works for them. So if you're ready to work on unrivaled technology where your desire to be part of a collaborative team is met with a laser-focused mission to stop breaches and protect people globally, let's talk.</p><p></p><p><b>About the Role:</b></p><p>Are you passionate aboutInternet Security and Informatics? Do you want to work where the people are as committed and as passionate as you are? As a Customer SuccessInternwith CrowdStrike you will work directly with the Customer Success team to develop and prototypeautomated ways to better understand and run the business - informatics. At CrowdStrike, you will be working with people who \"wrote the book\" on hacking andinternet security. To besuccessful in this role, you must be a motivated self-starter, be committed to ongoing self-education, possess strong project and analytical capacity and have excellent technical problem solving skills.</p><p></p><p><b>You will:</b></p><ul><li><p>Work with Customer Success Team to document and quantify current processes.</p></li><li><p>Develop and execute project plans to rapidly prototypeprocesses and tools.</p></li><li><p>Write up findings &amp; lessons learned.</p></li><li><p>Teach team members how to use &amp; apply new tools and processes</p></li><li><p>Participate in technical communications within the team to share best practices and learn about new technologies and complimentary storage applications.</p></li><li><p>Work with members of other teams (IT, Sales, Operations, Finance) to ensure linkages.</p></li></ul><p></p><p><b>What You'll Need:</b></p><ul><li><p>Pursuing Bachelor's Degree in business, informatics or computer science</p></li><li><p>Graduating between December 2022 and Spring 2023</p></li><li><p>Technical aptitude, preferably on Mac's and MS Office</p></li><li><p>Familiarity with Excel and Tableau</p></li><li><p>Excellent communication skills, written and verbal</p></li><li><p>Proven problem-solving skills</p></li><li><p>Collaborative attitude</p></li></ul><p></p><p><b>Bonus Points:</b></p><ul><li><p>Great team player - collaboration skills</p></li><li><p>Willingness / ability to learn new tools and processes</p></li><li><p>Light scripting skills</p></li></ul><p></p><p><b>What You Can Expect:</b></p><ul><li><p>Executive Speaker Series &amp; Tech Talks</p></li><li><p>Fun socials and give-back events (e.g. virtual trivia, escape rooms, etc.)</p></li><li><p>Development workshops to grow your soft and hard skills</p></li><li><p>Networking opportunities with fellow interns and CrowdStrikers</p></li><li><p>Owning impactful projects that move the company forward</p></li><li><p>Working alongside a diverse and global team</p></li><li><p>Assigned mentor and continuous feedback</p></li><li><p>Participation in our Employee Resource Groups (ERGs)</p></li><li><p>Access to our FalconFit Wellness Program and Employee Assistance Program</p></li><li><p>Fun Slack channels (e.g. food, gaming, sports, pets, etc.)</p></li><li><p>Paid holidays and 401k matching</p></li></ul><p></p><p>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives that encourage new ways of solving problems, so we strive to attract and develop talent from all backgrounds and create workplaces where everyone feels seen, heard and empowered to bring their full, authentic selves to work.</p><p></p><p>CrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.</p><p></p><p>CrowdStrike participates in the E-Verify program. </p><p> Notice of E-Verify Participation</p><p> Right to Work</p></div></div>",
        "index": 16,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "networks",
            "virtual reality",
            "game design"
        ],
        "compensation": "paid",
        "due": "2022-11-30T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Environmental Coordinator (Part-Time)",
        "company": "Coeur Mining",
        "location": {
            "city": "Lovelock",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/coeur-mining-8a6c960b/environmental-coordinator-part-time-d6ef57da?lvk=PZlsmhX-zq3j3iMpN7VPjg.--MAoonE4ew",
        "posted": "2021-09-03T06:51:12.205Z",
        "lastScraped": "2021-09-13T06:51:12.205Z",
        "description": "<div><div><p>Our purpose statement is, We Pursue a Higher Standard. Everything we do is fueled by this statement; it is our foundation and inspiration for our actions every day. At Coeur, we PROTECT our people, places and planet, DEVELOP quality resources, growth and plans, and DELIVER impactful results through teamwork.</p><p> </p><p>Coeur Mining, Inc. is a well-diversified growing precious metals producer with five operations in North America. Coeur’s wholly-owned operations include the Palmarejo gold-silver complex in Mexico, the Rochester silver-gold mine in Nevada, the Kensington gold mine in Alaska, the Wharf gold mine in South Dakota and the Silvertip silver-zinc-lead mine in British Columbia. In addition, the Company has interests in several precious metals exploration projects throughout North America. Coeur’s headquarters are located in Chicago, IL. </p><p><strong> </strong></p><p>Coeur Rochester is looking for a Part-Time Environmental Coordinator to join the Environmental Team at site. This role will report directly to the Environmental Manager. This Part-Time opportunity will have 2 shifts, 10 hours per day. This is a key role involving environmental monitoring, permits and regulatory reports, leading environmental training to staff, and beyond. </p><p><strong><br></strong>Responsibilities:</p><p> </p><ul><li>Assists the Environmental Manager with the review of compliance, data trends and reporting. Assists in the development and communication of improvement plans related to environmental management.</li><li>Provides input and assists the Environmental Manager and Operations personnel in the planning and response to environmental issues and concerns.</li><li>Assists with planning, schedules, and monitoring environmental aspects of capital projects. Helps ensure that resources are available for the timely completion of all capital projects.</li><li>Ensures compliance with the required environmental deliverables through inspections, physical audits, and timely correction of identified deficiencies. Assists with the implementation of the environmental management system.</li><li>Conducts field environmental monitoring activities related to air, water, wildlife, soils, vegetation, meteorology, and archaeology. Assist, formulate, document and implement environmental sampling routines and quality control procedures in compliance with regulatory requirements of applicable permits and company policy.</li><li>Assists in the preparation of permits, studies, or regulatory reports related to environmental compliance.</li><li>Develop and update monitoring and reporting protocols in accordance with state and federal statutes and regulations.</li><li>Supervise activities of external <span class=\"long-word\">contractors/consultants</span> involved with environmental and reclamation projects.</li><li>Provide Environmental training to staff as requested.</li></ul><p> </p><p><strong>Qualifications:</strong></p><ul><li>BS, MS, or Technical Degree in environmental, biological, or earth sciences.</li><li>Effective written and verbal communication skills. </li><li>Proficient in computer skills including Word, Excel, PowerPoint, and database applications. </li><li>Excellent interpersonal skills, including the ability to work well within a team environment. </li><li>Strong analytical ability, problem-solving skills, &amp; work ethic.</li><li>1-3 years of work experience required within the Environmental sector. Internships to be considered as well. </li><li>Environmental experience at an operational mine preferred.</li><li>Working knowledge of Federal and State regulations and permit requirements preferred.</li><li>Working knowledge of Nevada environmental regulations preferred.</li></ul><p> </p><p><strong> </strong></p><p><strong>Go to </strong><strong>www.coeur.com</strong><strong> to apply for this position.</strong></p><p> </p><p>It is the policy of Coeur Mining, Inc. and its direct and indirect United States subsidiaries (the</p><p>“Company”) to provide equal opportunity employment to all Employees and applicants for</p><p>employment. No person working at the Company's facilities in the United States is to be</p><p>discriminated against in employment because of race, religion, color, sex, age, national origin, disability, or veteran status.</p><p><strong> </strong></p><p></p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Accounting & Finance Rotational Program Intern, Summer 2022",
        "company": "Walt Disney",
        "location": {
            "city": "Burbank",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/66a6fd5a36bd40875c3484472b334114?lvk=WLa-GafHXteTTejJ1HIfUA.--MAcg0OTHw",
        "posted": "2021-09-09T06:51:13.108Z",
        "lastScraped": "2021-09-13T06:51:13.108Z",
        "description": "<div><div><p>Job Posting Title: Accounting &amp; Finance Rotational Program Intern, Summer 2022 <br>Job Description: Imagine working side-by-side with industry leaders in your field of study. Imagine building upon the skills you've learned in the classroom through real-world hands-on work experience. Now imagine yourself in a Professional Internship with Disney. When your extraordinary talents, our renowned legacy and the promise of an even brighter future unite, just imagine the stories you could be part of!<br><br>The summer Accounting &amp; Finance Rotational Program (AFRP) internship is an opportunity for students interested in a career in accounting or finance to get&nbsp;a summer preview&nbsp;of The Walt Disney Company's two-year Accounting &amp; Finance Rotational Program.<br>&nbsp;<br>The AFRP is a full-time entry-level program designed to provide recent college graduates a cross-functional, enterprise-wide learning experience within the Controllership and Finance departments at The Walt Disney Company. AFRP Analysts will participate in four distinct rotations designed to build key technical and leadership skills needed to succeed within the many businesses of Disney. Analysts will set goals for their program experience allowing them to develop, grow, and enhance the necessary skills to become strong accounting and finance professionals. Upon successful completion of the program, participants will be considered for various opportunities within the finance and accounting organizations within The Walt Disney Company.<br><br>What you can expect as part of the <strong>TWO YEAR</strong> program...<br>&nbsp;</p><ul><li><strong>Diverse Experiences:&nbsp;</strong> Participate in four 6-month rotations throughout the Controllership and Finance organizations, gaining exposure to the many different businesses of The Walt Disney Company and the Entertainment Industry. Rotations are available in the following areas: Corporate, Media Networks (Walt Disney Television &amp; ESPN), Disney Parks Experiences and Products,&nbsp;and Studio Entertainment.</li><li><strong>Building Your Expertise:&nbsp;</strong> Strengthen your Accounting and Financial Planning skills through concentrated work in the areas of: <span class=\"long-word\">Operational/Transactional</span> Accounting, Financial Reporting, Corporate Tax &amp; Audit, and Finance.</li><li><strong>Work Towards Your CPA:</strong>&nbsp; AFRP provides the necessary resources and tools to study and take the parts of the CPA exam, and will satisfy work-hour requirements to become licensed by the California State Board of Accountancy.</li><li><strong>Professional Development:</strong>&nbsp; Analysts will follow specialized curriculum to build communication, leadership, presentation, writing and other professional and management skills.</li><li><strong>Expanding Your Network:</strong>&nbsp; Opportunities to meet with peers and senior leaders from the many different businesses within the company and the industry.</li><li><strong>Formal Mentorship:</strong>&nbsp; Analysts will be matched with a senior-level manager who will provide ongoing development, leadership insights and direction to help make the two-year program even more valuable. Opportunities for informal mentorship and partnership will also happen throughout the program.</li></ul>Summer interns will be placed in&nbsp;ONE of the departments that typically host AFRP Analysts, which could include Corporate, Media Networks, Disney Parks Experiences &amp; Products, and Studio Entertainment.&nbsp; Functional areas include <span class=\"long-word\">Operational/Transactional</span> Accounting, Financial Reporting, Audit &amp; Compliance, and Finance.&nbsp; The internship is designed to build key technical and leadership skills needed to succeed in each segment and the Company. <br>Req ID: 856615BR <br>City: Burbank <br>Job Type: Temporary/Seasonal <br>Country / Region: US <br>State/Provice: CA <br>Segment: The Walt Disney Company (Corporate) <br>Internship Program Subtype: Professional Internship <br>Additional Information: <ul><li>Available full time for 12 weeks from May/June through August/September.</li><li>Ability to provide own relocation, housing and transportation.&nbsp; Positions are located in Burbank and Glendale, CA.</li><li>Interns will be sponsored by the AFRP and will be invited to participate in events specific to the program, as well as networking with current Analysts and executives associated with AFRP.</li><li>All Interns should graduate within one year of the internship experience.</li><li>All Interns should be pursuing or strongly considering a targeted talent development program upon graduation.</li><li>All interns will be considered at the end of the summer for possible offers for the post-graduate (AFRP) program.</li></ul><br>Category: Finance and Accounting <br>Basic Qualifications: What you bring to the table...<ul><li>A combination of academic aptitude, quantitative skills, personal motivation, and advanced written and oral communications skills</li><li>A desire to become licensed as a CPA</li><li>Dedication to building a career in accounting and finance</li><li>Business experience through internships or part-time work</li><li>Strong computer skills including Microsoft Word, Excel and PowerPoint</li><li>Proven ability to take on leadership positions and&nbsp;significant responsibility</li><li>Interest&nbsp;in The Walt Disney Company's two-year Accounting &amp; Finance Rotational Program after graduation</li></ul><br>Business: The Walt Disney Company (Corporate) <br>Required Education: <ul><li>Currently enrolled in a college or university and working towards a Bachelor's degree in Accounting</li><li>Current juniors (rising seniors during summer 2022)</li></ul><br>Postal Code: 91505 <br>Preferred Education: <ul><li>3.5 GPA or higher preferred</li></ul><br></div></div>",
        "index": 18,
        "skills": [
            "networks",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Aviation Planning Intern",
        "company": ".",
        "location": {
            "city": "Sacramento",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5025cb5ed94ebdb27b331627a9a2d0ea?lvk=UZacJdFJ5aBtR6IM9z3q6Q.--MAdr38Mls",
        "posted": "2021-09-10T06:51:14.123Z",
        "lastScraped": "2021-09-13T06:51:14.123Z",
        "description": "<div><div><p>Description</p><p>The C&amp;S Companies' Internship Program is designed to engage college students in the practical application of a major technical study and to familiarize them with the interactions and requirements of the A/E industry. Internships are designed to introduce and build essential hands-on skills that differ from those attained in the academic arena, and help to enhance the transition from student to professional. Interns are assigned duties that will provide a broad, well-rounded learning experience within their chosen discipline. Internship opportunities are available at most C&amp;S locations. Preferred office locations include Albany, NY; Buffalo, NY; Philadelphia, PA; Syracuse, NY; Sacramento, CA; and San Diego, CA.</p><p><strong>&nbsp;</strong><strong>Position Responsibilities</strong></p><ul><li>Perform, under close supervision, routine aspects of aviation planning, requiring knowledge and application of principles learned in course of study.</li><li>May use computer-assisted engineering software and equipment to perform tasks.</li><li>Collect and prepare data for evaluation.</li><li>Assist in the coordination of projects from conception (feasibility) through final plan preparations.</li><li>Provide support to staff members as needed.</li></ul><p><strong>Minimum Education &amp; Experience Required</strong></p><p>Must have completed sophomore year of Bachelor's degree program with a planning, environmental, aviation management, or other related aviation major. Knowledge of aviation planning is desirable.</p><p><strong>Required <span class=\"long-word\">Knowledge/Skills/Abilities</span></strong></p><ul><li>Strong desire to pursue a career in planning.</li><li>Solid analytical, conceptual, and problem solving skills.</li><li>Interest or course-work in sustainability and resiliency is helpful.</li><li>Resourceful and self-motivated.</li><li>Solid organizational skills with a focus on details.</li><li>Working knowledge of Microsoft Office.</li><li>Experience with AutoCAD/GIS preferred.</li><li>Strong written and verbal communication skills.</li><li>Ability to work and thrive in a team environment.</li><li>Ability to effectively interface with all levels of personnel and management.</li><li>Previous internship experience and/or involvement as an active member of related professional student association a plus.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</li></ul><p><strong>Visa Sponsorship is not available for this position.</strong></p><p><strong>WHO WE ARE:&nbsp;</strong>C&amp;S Companies, operating for more than 50 years, is a national planning, design and construction firm with nearly 500 employees and growing. C&amp;S Companies delivers critical infrastructure design, planning and construction services in aviation, civil/site infrastructure, construction and program management, <span class=\"long-word\">construction/design</span>-build, energy, environmental, facilities, architecture, planning, sustainability and transportation.</p><p>Our headquarters is in Syracuse, NY with offices in New York State, California, Arizona, Ohio, Michigan, Florida and Pennsylvania.</p><p>At C&amp;S Companies, we believe work environment, culture, and the opportunity to learn and grow are key elements when considering a new job. We are just the right size to provide the resources and support you need without the burdensome bureaucracy of a large corporate environment. To that end, we foster a family-friendly and supportive workplace, collaborative and employee-focused with an emphasis on quality, integrity, trust fun and accountability.</p><p>&nbsp;</p></div></div>",
        "index": 19,
        "skills": [
            "project management",
            "software engineering",
            "c and c++",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Customer Service Support Intern (Part-Time, Temporary) - Valli Kee (Kent)",
        "company": "King County Housing Authority",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/79b9d4141ad4d11f333ea1ec8bf2e41f?lvk=vXpR-O9OKQJGh0HLAu44ow.--MAmbulf9V",
        "posted": "2021-09-10T06:51:15.640Z",
        "lastScraped": "2021-09-13T06:51:15.640Z",
        "description": "<div><div> Job Summary <p>King County Housing Authority (KCHA), an independent municipal organization, is a high performing nationally recognized leader in affordable housing. &nbsp;KCHA provides innovative and effective housing solutions so that people and communities can prosper. &nbsp;Our vision is that all residents of King County have quality affordable housing. &nbsp;KCHA is the largest housing provider in the county, and annually, the agency serves over 55,000 low-income individuals.&nbsp;<br><br><strong><strong><em>We transform lives through housing.</em></strong><br><br></strong>We are currently recruiting for a Customer Service Support Intern to provide office and clerical support at our Valli Kee portfolio in Kent. The Customer Service Support internship is an ideal opportunity for a Housing Authority resident, student or recent graduate that has a passion for social work and providing support in the public sector. &nbsp;This internship will offer an opportunity to acquire hands-on experience by supporting diverse populations through positive customer service and administrative support.&nbsp;<br><br>The Customer Service Support Internship is an excellent opportunity for someone looking to gain experience in a flexible work environment. &nbsp;Core office hours for this portfolio are 8:00 a.m. to 4:30 p.m. Monday thru Friday; however, work schedule can be flexible based on the need of the successful candidate and business operations. &nbsp;This position will work up to 20-hours per week and is anticipated to last up to one year.&nbsp;</p> Essential Functions <p><strong>Typical job duties may include:&nbsp;</strong></p><ul><li>Provide polite customer service to residents, staff and the community.</li><li>Answer phones and direct callers to appropriate staff or department; answer basic questions.</li><li>Perform routine filing, scanning and proofreading documents.</li><li>Word processing, data entry, spreadsheet preparation, run reports, enter and look up information in databases.</li><li>Operate standard office equipment, such as a personal computer, telephone, fax machine, copier, etc.</li><li>Other duties as assigned.</li></ul><p></p> Qualifications and Competencies <p><strong>Required Qualifications:</strong></p><ul><li>Recent High School graduate&nbsp;<strong>OR</strong></li><li>Current student or recent graduate from a college/university program in Business, Social Work, or related field.</li><li>Clerical and/or customer service experience.&nbsp;</li></ul><strong>Required Knowledge, Skills, and Abilities:</strong> &nbsp; <ul><li>Basic experience with word processing and spreadsheet software.</li><li>Strong written and verbal communications skills with the ability to clearly and effectively communicate with individuals and groups.</li><li>Exceptional customer service skills with the ability to place a high priority on professional excellence; manage stress appropriately.</li><li>Strong organizational skills including prioritizing, keeping track of information or work in progress, ensuring accuracy, multi-tasking, attention to detail, time management skills, and handling interruptions appropriately.</li><li>Ability to work independently and in a team environment exhibiting a strong work ethic and accountability in completing work.</li><li>Work effectively and positively with individuals of diverse cultural and socioeconomic backgrounds and educationally diverse populations; values diversity; treats other with respect.&nbsp;</li></ul><strong>Special Requirements:</strong><ul><li>Consent to and pass required assessments.</li><li>Consent to and pass criminal records background check.</li></ul><p></p> Position Information and Application Process <p><strong>Application Requirements:&nbsp;</strong><br>To be considered for this opportunity, you must:</p><ul><li>Complete the online application profile in its entirety.</li><li>Upload a cover letter that addresses how your experience and education qualifies you to perform the essential functions listed in the job announcement.&nbsp;<strong><strong>(Cover Letter)</strong></strong></li><li>Upload a detailed resume of all educational and professional experience.<strong>&nbsp;<strong>(Resume)</strong></strong></li></ul><strong><strong>Physical Work Environment:</strong><br></strong> <em>Incumbent(s) must be able to meet the physical requirements of the classification and have mobility, balance, coordination, vision, hearing and dexterity levels appropriate to the functions performed. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</em> <strong><br>&nbsp;</strong><br> Work is performed primarily in an office environment. The incumbent frequently uses standard office equipment including personal computers, telephone and related equipment. Considerable filing and copying functions may require relevant physical demands. <br><br><strong><strong>Equal Opportunity:&nbsp;</strong><br></strong> King County Housing Authority is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. <p></p></div></div>",
        "index": 20,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Intern Appraisal",
        "company": "Compeer Financial",
        "location": {
            "city": "Normal",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a38a6355c35bf2738ece08e375b3f7cb?lvk=QFM-7H4S6vXlRfUP8nRuFQ.--MAq_tV8wZ",
        "posted": "2021-09-12T06:51:16.503Z",
        "lastScraped": "2021-09-13T06:51:16.503Z",
        "description": "<div><div><p><strong>This is a paid internship; however, the intern must provide their&nbsp;own housing and transportation. Business related transportation and expenses will be paid by the organization. <strong>This intern will work full-time&nbsp;during the summer of 2022, and&nbsp;part-time during the following&nbsp;school year&nbsp;out of our Normal, IL office.&nbsp;&nbsp;<strong><strong></strong></strong></strong></strong></p><p>Compeer Financial is seeking collaborative, innovative and dynamic professionals to be a part of our Top Workplace culture!</p><p><em>Tell me more about this opportunity.</em></p><p>Position Overview:<br> This internship will assist with chattel evaluations and market surveys, as well as obtain and analyze sales data information to accurately plat legal descriptions for sales and plat subject properties.</p><p>Essential Functions:</p><ul><li>Collect and analyze sales information to support appraisals and asset valuation.</li><li>Assist appraisers with property inspections.</li></ul>Minimum Qualifications &amp; Required Knowledge, Skills &amp; Abilities:<ul><li>Working towards completion of bachelor's or associate's degree in Agricultural Business, Business Administration, Finance or Economics.</li><li>Agricultural background required, with knowledge of agriculture economics and farm practices.</li><li>Strong oral and written communication skills, interpersonal skills, attention to detail and ability to meet deadlines.</li><li>Knowledge of values of machinery and equipment, typical to agriculture in the area.</li><li>Computer skills including MS Office applications (Word, Excel, Outlook), client databases and industry software (Facts, FEM or equivalent).</li></ul></div></div>",
        "index": 21,
        "skills": [
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern - Chicago Casualty",
        "company": "Milliman",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2587b178f42fa413237206d7018e8f2e?lvk=9oA31HrGxVrtGNX8aphE2w.--MAqF8jQ8k",
        "posted": "2021-09-09T06:51:17.472Z",
        "lastScraped": "2021-09-13T06:51:17.472Z",
        "description": "<div><div><p>The Chicago Casualty Department of Milliman is seeking a candidate for an actuarial internship for Winter 2022. This position will interact with all members of our staff as well as many clients. The primary challenges are the ability to handle multiple projects at the same time, the ability to interact with people with varied personalities and communication styles, and the flexibility to adjust resources as needed. This position provides an excellent entrance opportunity into actuarial analysis with a concentration in Casualty. If necessary, the internship will be remote.</p><p>Some of the specific duties are listed below:</p><ul><li>Preparing client deliverables (reports, letters, presentations) primarily with MS Excel, Word and PowerPoint</li><li>Responding to client requests for advice, information, explanations, or schedules through phone and e-mail</li><li>Spreadsheet creation and database analysis</li><li>Managing projects for clients by working with other consultants and support staff</li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li>Pursuing a B.S. or B.A.</li><li>GPA of 3.2 or greater with major in Actuarial Science, Accounting, Economics, Finance or Math</li><li>Previous experience within insurance preferred but not required.</li></ul></div></div>",
        "index": 22,
        "skills": [
            "project management",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "STRIDE Intern",
        "company": "STRIDE Crown Point",
        "location": {
            "city": "Crown Point",
            "state": "Indiana",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/stride-crown-point-96112a35/stride-intern-80a6ba0c?lvk=Nj5TZuksLnlNb68aknIriQ.--MAdPO3lV-",
        "posted": "2021-09-11T06:51:19.722Z",
        "lastScraped": "2021-09-13T06:51:19.722Z",
        "description": "<div>STRIDE is a boutique treadmill studio experience that is here to reinvent the definition of a runner. Coached running classes are led by expert trainers in a supportive and empowering environment with state-of-the-art equipment and electrifying music. STRIDE aims to create a space where running is understood at all levels to be an essential mode of fitness and recognized by everyone as one of the easiest, most engaging, and most effective ways to achieve your mental &amp; physical goals.<br>The STRIDE Intern assists the General Manager with community outreach, marketing, and lead generation. new membership sales as well the retention of current members. We expect you to be excited about meeting and greeting our prospects, business partners, and charitable organizations in support of building a strong STRIDE community.&nbsp;<br><br><strong>RESPONSIBILITIES:</strong><ul><li>Execute full process of lead generation</li><li>Meet and exceed community outreach goals as established by the General Manager</li><li>Conduct studio tours with new prospects to build rapport to facilitate sales</li><li>Be knowledgeable about products, programs and pricing</li><li>Emphasize and enforce objectives of the studio as a fitness and wellness provider</li><li>Book quality appointments to achieve monthly goals</li><li>Participate in <span class=\"long-word\">grassroots/community</span> events (health fairs, grand openings, marathons, and community and hospital events) to promote the studio</li><li>Assists with maintaining a clean, safe and inviting environment</li><li>Assumes responsibility for developing marketing and sales skills</li></ul><strong>JOB REQUIREMENTS:</strong><ul><li>Excellent sales, communication, and marketing skills</li><li>Goal-oriented with an ability to achieve sales targets</li><li>Strong customer service skills</li><li>Ability to learn and use the ClubReady software system</li><li>Must be fluent in English and have excellent communication skills via in person, phone and email</li><li>Must be able to work under pressure and meet tight deadlines</li><li>Must have proficient computer skills</li><li>Daily and/or occasional travel may be required</li><li>Attend special events and trainings as needed</li><li>A positive attitude and desire to be part of an incredible team and community</li></ul><strong>PHYSICAL REQUIREMENTS</strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of the job.<ul><li>May be required to sit or stand for up to four hours at a time</li><li>May be required to reach with hands and arms</li><li>Must be able to bend, lift, kneel, and drive a car</li><li>Must be able to climb up and down flights of stairs as elevators are not present at all locations</li><li>May be asked to occasionally lift up to 30 pounds.</li><li>Specific vision abilities required by this job include Close vision, Distance vision, Peripheral vision, Depth perception and the ability to adjust and focus</li><li>Must be able to effectively hear in person and via telephone</li></ul><strong>COMPENSATION &amp; PERKS:</strong><ul><li>STRIDE will provide documentation to support college/university internship and/or volunteer hour requirements</li><li>A discount on all in studio merchandise</li><li>A free membership for the duration of the internship</li></ul>&nbsp;&nbsp;<p><em> This franchise is independently owned and operated by a franchisee. Your application will go directly to the franchisee, and all hiring decisions will be made by the management of this franchisee. All inquiries about employment at this franchisee should be made directly to the franchise location, and not to Run with Stride. </em></p></div>",
        "index": 23,
        "skills": [
            "machine learning",
            "project management",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Manufacturing Engineering Intern",
        "company": "Badger Meter",
        "location": {
            "city": "Racine",
            "state": "Wisconsin",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/cbaa44f5cefb9f4b1a54bbe1e4dfad81?lvk=JzCPjHlh8Q2R7vtjVVB90A.--MAqekK4Us",
        "posted": "2021-09-07T06:51:20.705Z",
        "lastScraped": "2021-09-13T06:51:20.705Z",
        "description": "<div><div>Why Badger Meter?<br><p>Are you looking to join a dynamic team where you have the autonomy and challenge that lets you learn and grow your career? Are you energized when you know that your contributions matter and make a difference in business success? If yes, then Badger Meter may be a great place for you!<br></p><p>For more than 115 years, Badger Meter has provided strong, stable financial growth, in turn providing employees with the opportunity to build long, successful careers. As a leading manufacturer of flow measurement technology, Badger Meter offers many opportunities to measure what matters in protecting the world's water and other precious resources. Our company is large enough to continually drive market innovation, all while we maintain a collaborative and flexible working atmosphere.</p><br>What You Will Contribute:<br><p>The Badger Meter Internship Program provides hands-on, real-world experience to students through projects that make a difference! In addition to your projects, you will be given the opportunity to participate in our robust Intern program focused on Badger Meter Culture, professional development, community outreach and a final capstone project.</p><p></p><p>Badger Meter is hiring a Manufacturing Engineering Intern. This position will be exposed to a variety of manufacturing engineering disciplines such as electronics, electro-mechanical assembly, machining, and industrial engineering. The Manufacturing Engineering Intern will support a variety of people including Operators, Cell Techs, Supervisors, and Engineers. This position will be working hand-on in a shop environment where interns will support continuous improvement activities such as documenting process flow, implementing 5S, making process improvement, and investigating new technologies.</p><p></p><p><b>Essential Job Duties:</b></p><ul><li><p>Design fixtures and support production to maintain on time delivery and high quality</p></li><li><p>Must be willing to work equally on the manufacturing floor and in office</p></li><li><p>Utilize root cause analysis and lean tools to reduce waste</p></li><li><p>Participate in New Product Development team meetings and tasks</p></li><li><p>Conduct and create time studies, process maps, and capacity plans to help improve efficiencies</p></li><li><p>Work with Manufacturing Engineers to implement solutions to improve yield on production line</p></li><li><p>Additional projects, tasks, and/or assignments as assigned</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Currently pursuing a Bachelor's degree in Engineering or related field</p></li><li><p>Intermediate computer/technical skills in Microsoft Suite, emphasis on Word and Excel</p></li><li><p>Basic experience with CAD</p></li><li><p>Basic skills with Statistics, and lean principles</p></li><li><p>Natural curiosity for problem solving and ability to quickly learn new technologies</p></li></ul><p></p><p>An Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. This company considers candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Applicants can learn more about their rights regarding equal opportunity in employment by viewing the federal \"EEO is the Law\" poster and the \"EEO is the Law\" poster supplement at <span class=\"long-word\">http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm</span></p></div></div>",
        "index": 24,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "IT Intern",
        "company": "Workforce Enterprises",
        "location": {
            "city": "Santa Fe Springs",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/workforce-enterprises-55fd607a/it-intern-fdb8f564?lvk=qCKEp1NrqC_YfcfF7fFe-Q.--MAClOs0YV",
        "posted": "2021-09-04T06:51:22.037Z",
        "lastScraped": "2021-09-13T06:51:22.037Z",
        "description": "<div><p>IT Technical Support duties and responsibilities</p><ul><li>Provide technical assistance with computer hardware and software</li><li>Resolve issues for staff via phone, in person, or electronically</li><li>Log bugs and enhancement requests</li><li>Perform hardware and software installations, configurations and updates as needed</li><li>Create and maintain tips and tricks solutions for online database and web site</li><li>Provide introductory on-line &amp; classroom training for company products</li><li>Resolve technical issues in a timely manner using available resources within the company</li></ul><p>IT Technical Support requirements</p><ul><li>Excellent customer service skills</li><li>Strong troubleshooting and critical thinking skills</li><li>Previous working experience in IT support</li><li>Degree in Computer Science or Management Information Systems (MIS)</li><li>In depth knowledge of Windows 10, Mac OS, Microsoft Office 365</li></ul></div>",
        "index": 25,
        "skills": [
            "information technology",
            "hardware",
            "project management",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Access Your Future Parts Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Missoula",
            "state": "Montana",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/44afd5c117dd4c0ec75b0448de3e00f6?lvk=OX3fZ4irNT2DC6vjlYwlMA.--MASHGzgps",
        "posted": "2021-09-07T06:51:23.034Z",
        "lastScraped": "2021-09-13T06:51:23.034Z",
        "description": "<div><div><strong>Job Description</strong><p>The Access Your Future Parts Intern will allow this person to gain understanding of the skills necessary to advance into a parts role within RDO Equipment Co. They will learn RDO Equipment Co. processes and procedures used throughout the organization including an understanding of the Parts, Service, Sales, and Management departments. The Access Your Future Parts Intern will serve as a part-time position during college. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships. <br>This person will develop the knowledge and skills necessary to advance into a parts role within RDO Equipment Co. After successful completion of the intern and college graduation, management can offer full time employment and the student can transition into a Parts Specialist role. <br><br><strong>Specific Duties Include:</strong><br></p><ul><li> This position will rotate through temporary assignments in the dealership in order to obtain a complete picture of day-to-day duties and responsibilities of all departments and the importance of teamwork within our dealerships. <br></li><li> Day-to-day duties and responsibilities include but are not limited to; performing a variety of customer service, marketing, promoting, advertising, and stocking duties related to the parts sales, receiving and delivery of parts and accessories that contribute to the efficient, safe and profitable operation of the parts department. <br></li><li> Perform any other special duties as requested by field management or other department personnel to ensure customer satisfaction. <br></li><li> Assist customers by properly identifying needed items, using electronic parts catalogs and other available resources. They will merchandise, invoice and make any necessary entries to the inventory control system based on company guidelines. <br></li><li> Demonstrate a willingness to learn. <br></li><li> Demonstrate a willingness and interest to participate in our Customer Engagement Experience philosophy, and continually display passion around the principals outlined. <br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set. <br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts. <br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service. <br></li><li> Perform all other duties as assigned by management in a professional and efficient manner. <br><br><strong>Job Requirements:</strong><br></li><li> Must be a self-starter <br></li><li> Strong communication and interpersonal skills <br></li><li> Proficient computer skills, including Microsoft Office <br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> * Must be a self-starter * Strong communication and interpersonal skills * Proficient computer skills, including Microsoft Office * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Employment</span> Type: [\"PART_TIME\"]</li></ul></div></div>",
        "index": 26,
        "skills": [
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "IT Student Intern",
        "company": "University Enterprises Inc - Sacramento State",
        "location": {
            "city": "Sacramento",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/374c8caefd4af8abb14fb4a98f921752?lvk=z-lu1Xdmk9k8KemruIyYzw.--MA_15Rx8g",
        "posted": "2021-09-08T06:51:24.724Z",
        "lastScraped": "2021-09-13T06:51:24.724Z",
        "description": "<div><div><div> Job Title IT Student Intern Student Classification Student Assistant Job Code C50118 Posting Type <span class=\"long-word\">Student/nonbenefited</span> (NSTU) Posting Number PE407F21 Job Description Summary <div> The County of Sacramento ( SACCO) is seeking to hire an intern. The intern will learn and gain experience in Data warehouse designs, Business Intelligence, power bi, Tableau, SQL Server Analysis Services ( SSAS), C#, python and other software and technology to develop and design dashboards. The intern will work on and develop dashboards from beginning to end using all the technologies listed. </div> Conditions of Employment <div> This is a part-time, temporary, non-benefited, student position. Employment in all positions with University Enterprises, Inc. is dependent upon the mutual consent of University Enterprises, Inc. and the employee. This means that either University Enterprises, Inc. or the employee can, at any time, terminate the employment relationship at will, with or without cause.&nbsp; <br>&nbsp; <br>Depending on the type of position you are applying for, a pre-employment background check consisting of one or more of the following may be conducted: employment history, professional references, criminal check, educational verification (i.e., degree, license, or official transcript) and physical exam and drug urinalysis test. Applicants will be required to pass required pre-employment checks to the satisfaction of University Enterprises Inc., ( UEI) and the hiring Agency or Department. </div> Work Schedule <div> Flexible, Monday through Friday from 8:00am to 5:00pm. Final work schedule will be determined&nbsp; by student and supervisor,&nbsp; </div> Additional Work Schedule <p>Student Assistants and Graduate Student Assistants generally work up to 20 hours per work week (Sunday-Saturday) during the academic year and up to 40 hours per work week during breaks; (Winter, Spring and Summer).</p> Area Sacramento On/Off Sacramento State Campus Off Campus Worksite City Rancho Cordova Pay Range $15.00-$18.50 per hour Department/Agency County of Sacramento (SACCO) Unit/Division DHA ASB Section Project Description <div> The Sacramento County Department of Human Assistance brings together more than 2,000 skilled and dedicated employees each day to plan, implement and oversee a spectrum of programs and services designed to move people from public assistance to independence. DHA's mission of fostering self-sufficiency among those it serves touches every facet of daily life, from employment, housing and health care to transportation, education and child care. </div><div> Guided by the specific needs of the Sacramento community, DHA's primary goal is to create and carry out programs and activities that help families and individuals reach their highest potential. <br>For more information, please visit: <span class=\"long-word\">https://ha.saccounty.net/Pages/About</span>- DHA.aspx </div> Majors/Fields of Study Computer Information Systems, Computer Science and Engineering, Government Minimum Qualifications <ul><li>Knowledge and comfortable working with computers.</li><li>Able to install software.</li><li>Interested in the related field (engineering).</li><li>Motivation to learn.</li></ul> Prerequisites <div> Must be a college student attending classes during the regular term (Fall, Spring and Winter, if applicable), at an accredited college or university. <br><br>Students must be enrolled at a minimum in: six semester units or nine quarter units for undergraduate students; four semester units or six quarter units for graduate students.&nbsp; <br><br>Students declared major must match the major(s) listed in the job posting. </div></div><div> Preferred Qualifications Duties and Responsibilities <div> Design SSAS models, dashboards, data warehouse tables, power bi and tabular dashboards, use C# and python for ETL.&nbsp; The intern will support existing dashboards, projects, QA dashboards and support developers. </div> Physical Requirements <div> Sit for extended periods; frequently stand and walk; manual dexterity and hand-eye coordination; corrected hearing and vision to normal range; verbal communication; use of office equipment including computer workstations, telephones, calculators, copiers, printers and scanners with or without a reasonable accommodation. </div> Working Conditions <div> Work is performed in an office environment. </div> Hours Per Week Students (part-time) 0-20 hours per week during the academic year, up to 40 hours per week during breaks; (Winter, Spring and Summer). (NSTU) Posting Date 09/08/2021 Closing Date 09/17/2021 Open Until Filled No Special Instructions to Applicant <div> Please complete all fields of the employment application. Include your educational history in the \"Educational Experience\" section and any employment history in the \"Employment Experience\" section of our application. </div> Quick Link for Internal Postings <span class=\"long-word\">https://ueijobs.peopleadmin.com/postings/19405</span> </div></div></div>",
        "index": 27,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "python",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "due": "2021-09-07T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Project Engineer Intern",
        "company": "Truebeck Construction, Inc.",
        "location": {
            "city": "San Mateo",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d1e7e79fba8d40669236aebbf2286ab6?lvk=TY6YrrON8Q2qo7VGv0RSqw.--MAZnzeDyR",
        "posted": "2021-09-09T06:51:26.536Z",
        "lastScraped": "2021-09-13T06:51:26.536Z",
        "description": "<div><div><p><strong>About us&nbsp;</strong></p><p><strong>Who are we?</strong></p><p>Truebeck Construction is a full-service general commercial contractor in the SF Bay Area &amp; Portland specializing in technical building, complex projects, and interiors. Clients come to us when they have ambitious construction goals, and when they want certainty, predictable costs, and high-performance buildings. We specialize in the following market sectors; Corporate Office, Life Sciences, Data Centers, Healthcare, Education, Retail/Mixed use, Interiors.</p><p><strong>Why should you join us?</strong></p><p>Every company has a personality. At Truebeck, we find performing as a team and doing our best, while making it exciting and memorable all make the victory that much sweeter. We're not a traditional contractor; we're more integrated and focused on the experience.</p><p><strong>Job Details</strong></p><p> Coordinates with project architects, designers, owners, and field personnel.<br> Responsible for Request for Information (RFI) and submittal process.<br> Manages project subcontractors.<br> Acts as the \"information hub\" for project to office and field personnel to ensure continuity of work.&nbsp;<br> Offers technical information to project supervisor to insure work complies with applicable codes, drawings, and specifications.<br> May coordinate change orders, expedite material and job site equipment, assist in preparation of estimates, and compile data to assist in analyzing project progress.&nbsp;<br> Monitor and track project quality control metrics and activities on a regular basis, provide timely and accurate quality reports, and raise issues to PM or Superintendent as appropriate.&nbsp;<br> Inspects all work to assure compliance with plans and specifications.<br>&nbsp;Ensures project documents are complete, current, and stored appropriately.<br> Oversees performance of all trade contractors and reviews architectural and engineering drawings to ensure that all specifications and regulations are being followed.&nbsp;</p><p><strong>Qualifications</strong><br><br> Current student in a four-year degree program in construction management, construction science or civil engineering.<br> Full knowledge of computer software, i.e. MS Word, Excel, Project.<br> Working knowledge of Autocad or Revit a plus<br> Demonstrated analytical and problem solving skills.<br> Good oral and written communication skills.</p><p>Truebeck Construction is an equal opportunity employer. We celebrate differences and are committed to creating a diverse and inclusive environment for all employees.</p><p>&nbsp;</p></div></div>",
        "index": 28,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "remote": false
    }
]