[
    {
        "position": "IT Summer Internship",
        "company": "Stone Brewing Co.",
        "location": {
            "city": "San Marcos",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/stone-brewing-co-53124d5e/it-summer-internship-e746c606?lvk=MZneAsLQNl1J9Ti1cZnRmQ.--M69pFpCIZ",
        "posted": "2021-07-08T19:40:03.262Z",
        "lastScraped": "2021-07-15T19:40:03.262Z",
        "description": "<div><div><p><strong>Company Overview </strong></p></div><div><p>Founded by Greg Koch and Steve Wagner, Stone Brewing has come a long way since opening in San Diego County in 1996. Now the ninth-largest craft brewer in the U.S., we operate brewing facilities on both coasts - Escondido, California and Richmond, Virginia. On top of making badass beers for over two decades, we operate a number of restaurants and tap rooms as well as the largest craft-centric beer distribution business in the U.S. </p></div><div><p>We are the global standard bearer for independent craft beer. We put Team Stone first in order to create badass beer and amazing experiences. We're quality nuts and freshness fanatics, and we're head over heels for hops. We’re proud to be the largest employer in craft beer with a dynamic team. We have always been independent, and we will always be independent. We’re on the lookout for like-minded misfits who embody the things that have always made Stone special. </p></div><div><p></p></div><div><p><strong>Role Summary </strong></p></div><div><p>The I.T. intern will work on our large projects focused on helping us implement some of Azure application provisioning (i.e. individuals in role / department x get concur and help set up automatically. This intern will work with us, as well as our Microsoft partner, FMT. They will get introductory experience and training in Cloud, Azure and Business Analysis. This individual will have the opportunity to grow his/her skills and knowledge in the I.T. field while working in a fast-paced, exciting industry. </p></div><div><div><p></p></div><div><p><strong>Responsibilities include:</strong></p></div><div><ul><li><p>10 - 12 week that is flexible (A combo of full time or part time, in person or remote) </p></li><li><p>Assisting the I.T. team with deliverables with the ongoing Azure provisioning </p></li></ul></div><div><p></p></div></div><br><br><div><div><p><strong>Qualifications </strong></p></div><div><ul><li><p>Junior or Senior (preferred) pursuing a bachelor’s degree in I.T., Computer Science, or related field </p></li><li><p>Must be a motivated individual passionate about pursuing a career in I.T. and learning on the job experience </p></li><li><p>Ability to still have fun and be positive in high intensity situations </p></li></ul></div></div><div><ul><li><p>Demonstrates effective teamwork and collaboration skills </p></li><li><p>Strong interpersonal, verbal and written communication skills </p></li><li><p>Must be comfortable with being uncomfortable and doing things differently </p></li><li><p>Adaptable to a changing, fast-paced environment </p></li><li><p>Maintains high degree of integrity and confidentiality, always doing the right thing </p></li></ul></div></div>",
        "index": 1,
        "skills": [
            "machine learning",
            "project management",
            "cloud computing"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Internship",
        "company": "Cook Inlet Tribal Council, Inc.",
        "location": {
            "city": "Anchorage",
            "state": "Alaska",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/016df6fb71f7f494f0a0435dd05235bd?lvk=2ufnACWeymVOYh0LMPeg5g.--M67rIvr4k",
        "posted": "2021-07-07T19:40:04.114Z",
        "lastScraped": "2021-07-15T19:40:04.114Z",
        "description": "<div><div><div> &nbsp; <div><div><div><p>Cook Inlet Tribal Council Internship Program for qualified Alaska Native and American Indian students</p><p>&nbsp;<strong>*Deadline for applications is April 30, 2021.</strong></p><p>Cook Inlet Tribal Council's (CITC's) Internship Partner Program strives to align with our overarching mission of working with Alaska Native and American Indian people to develop educational opportunities that fulfill our endless potential. CITC seeks to deepen our relationship with our people and provide valuable work experience in a variety of fields of study for our future leaders. In alignment with our community partners, CITC proudly offers a 12-week paid temporary internship program for qualified Alaska Native and American Indian students. This program will provide college students with real life work experience and the opportunity to apply their education in a professional work environment, bridging the gap between students to working professionals.</p><p>Cook Inlet Tribal Council, Inc. (CITC) seeks highly motivated individuals currently enrolled as a full or part-time college student, or recently graduated from an <span class=\"long-word\">undergraduate/graduate</span> degree program/technical school in a related degree field.</p><p><br></p><p>Accounting / Finance / Economics / Business Mgmt.&nbsp;</p><p>Social Work / Sociology / Psychology / Nursing&nbsp;</p><p>Information Technology / Computer Science&nbsp;</p><p>Communications / Journalism / Marketing</p><p>Engineering / ANSEP Participants (Fab Lab)&nbsp;</p><p>Trans Alaska Pipeline System (TAPS) Industries&nbsp;</p><p>Construction / Project Management</p><p>Specifically, CITC recruits individuals seeking a future career-specific pathway to participate in a paid internship program for a 12 week term. Internship positions are available in Anchorage. Selected interns are responsible for providing their own transportation between their hometown/state and the internship work location. For example, if you attend the Mat-Su College and accept an internship in Anchorage, you are responsible for your own transportation to Anchorage.</p><p><strong>ELIGIBILITY</strong></p><p>Internship applicants must be eligible and qualified Alaska Native or American Indian pursuant to P.L. 93-638 Indian Self Determination Act. Alaska Native/American Indian CIRI shareholders and descendants are strongly encouraged to apply.</p><p><strong>PRE-EMPLOYMENT BACKGROUND CHECK INFORMATION</strong></p><p>As indicated on CITC's employment website, employment with CITC is contingent upon successfully passing a background investigation.</p><p><strong>Complete application packets submitted by APRIL 30th</strong><strong>, 2021 will be given priority consideration.</strong></p><p>Application packets are available on the CITC Career Center:&nbsp;</p><p><span class=\"long-word\">https://citci.org/citc</span>-careers/&nbsp;</p><p>Click on the Intern position to view the attached application.</p><p><strong>Please submit application packets and email questions to&nbsp;</strong><strong><span class=\"long-word\">alaskaspeople@citci.org</span></strong><strong>&nbsp;or call (907) 793-3467.</strong></p><p><br></p><p><br></p><p><br></p><p><br></p></div></div></div></div></div></div>",
        "index": 2,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2021-04-30T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Intern",
        "company": "Scientific Games",
        "location": {
            "city": "Las Vegas",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0e1cd77cd00093f5f9187e2f4f3bc47b?lvk=RsqkkdqZDpE7bcOK34w88w.--M68ic8-Ic",
        "posted": "2021-07-09T19:40:05.003Z",
        "lastScraped": "2021-07-15T19:40:05.003Z",
        "description": "<div><div><p>Corporate:</p><p>When you become a member of our Corporate team, you will work across the organization to provide the knowledge, resources and tools that help Scientific Games deliver outstanding service and support to our internal clients. Our Corporate Group includes Finance, Investor Relations, Legal, Compliance, Internal Audit, Facilities, Human Resources and Corporate Communications. We're always looking for team players who are customer centric, who seek to challenge themselves and have the drive to move our business forward.</p><p></p><p>If this sounds like you...Let's make games!</p><p></p><p></p><p></p>Scientific Games:<p>Scientific Games (SG) is a global leader focused on delivering an ever-expanding portfolio of lottery and gaming products and services to the world's government-regulated and government-sponsored entities. Scientific Games' global reach is made possible through the expertise, skill and dedicated efforts of its 8,000+ employees who serve lottery and gaming customers in more than 100+ countries on 6 continents.</p><p></p><p></p>Position Summary<p>Our IT team believes in investing in the future and is looking for interns to join our team this summer with the potential to lead to a year round internship opportunity. Our interns will get hands-on experience in areas of IT Infrastructure (Networking, Servers), Applications and Support. Our corporate business group provides global services and insights allowing for visibility into how business decisions and results impact the broader, world-wide business strategy.</p><p></p><p>Responsibilities may include:</p><ul><li><p>Answering customer support calls to the IT Service Desk</p></li><li><p>Prepare computers for deployment to end users</p></li><li><p>Provide direct customer support and IT product deployments</p></li><li><p>Assist with application and printer installations</p></li><li><p>Enable computers on the Company's network</p></li><li><p>Deploy desk phones to end users</p></li><li><p>Assist with conference room automation and video conference setup</p></li><li><p>Assist with backup procedures, including job monitoring and administration</p></li><li><p>Assist with maintenance of Company website content</p></li><li><p>Other duties related to IT Infrastructure, Applications, and Support fields</p></li></ul><p></p><p></p>Qualifications<p><b>Qualifications:</b></p><ul><li>Currently enrolled as a Junior or senior standing in a Bachelor's program in MIS, CS, IS, IT or similar field of study.</li><li>Master's degree a plus</li><li>A high level of proficiency in Microsoft Office products including Excel, Access and PowerPoint and an aptitude to learn now computer programs</li><li>Must enjoy working in a collaborative environment</li><li>Demonstrated communication skills (including active listening, writing, presenting, and emotional intelligence)</li><li>Demonstrated analytical skills and an inquisitive mind (including ability to ask curious questions and gather, compile, interpret &amp; analyze data quickly)</li><li>Detail oriented with demonstrated organizational skills and ability to manage multiple assignments simultaneously</li><li>Foreign language proficiency is a plus</li></ul><p></p><p>#LI-CS1</p><p></p><p></p><p></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.</p><p></p><p>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.</p><p></p><p>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law , please click here for EEOC Poster .</p></div></div>",
        "index": 3,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "game design"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Consumer Lending/Private Banking Internship",
        "company": "Fidelity Bank",
        "location": {
            "city": "Wichita",
            "state": "Kansas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7e6d8313d680733e255fe1f646b01aeb?lvk=82Fqy6wl7K9SKo_R3t5ilw.--M68HCu9U-",
        "posted": "2021-07-04T19:40:05.776Z",
        "lastScraped": "2021-07-15T19:40:05.776Z",
        "description": "<div><div><p><strong>CONSUMER LENDING / PRIVATE BANKING INTERNSHIP</strong></p><p>Our highly competitive internship program provides candidates with the opportunity to gain the best hands-on experience that banking has to offer. Fidelity Bank offers real-world opportunities to work with the Consumer Lending and Private Banking departments, assisting with daily tasks, projects and meetings. The paid internship program will be completed over a 16-week period beginning August 16 through December 9, 2021, working a maximum of 20 hours a week. Tasks may include performing administrative and clerical tasks, product research, updating internal department manuals and documents, assisting with assembling mailers, and prospect researching.</p><p>Requirements for the position include a high school diploma (or equivalent), strong customer service skills, the ability to prioritize projects and duties, basic computer skills and ten key.</p></div></div>",
        "index": 4,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Retail Operations Internship",
        "company": "Fidelity Bank",
        "location": {
            "city": "Wichita",
            "state": "Kansas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/14e46e6ce4110f8e5a0e1272c9a847ad?lvk=d2ArIIt3m8vxPGJ2um6Wsg.--M5os5QxiV",
        "posted": "2021-07-10T19:40:06.663Z",
        "lastScraped": "2021-07-15T19:40:06.663Z",
        "description": "<div><div><p><strong>RETAIL OPERATIONS INTERNSHIP</strong></p><p>Our highly competitive internship program provides candidates with the opportunity to gain the best hands-on experience that banking has to offer. Fidelity Bank offers real-world opportunities to work in Retail Operations. The paid internship program will be completed over a 16-week period beginning August 16 to December 9, 2021, working a maximum of 20 hours a week. Tasks may include performing administrative and clerical tasks for the local headquarters.</p><p>Requirements for the position include a high school diploma (or equivalent), strong customer service skills, the ability to prioritize projects and duties, basic computer skills and ten key. </p></div></div>",
        "index": 5,
        "skills": [
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "User Research Intern",
        "company": "MINDBODY",
        "location": {
            "city": "Remote",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/mindbody-ee7a2b6f/user-research-intern-31446d65?lvk=gkvprg1iZmccQbQcm9HISg.--M65AWNnv3",
        "posted": "2021-07-14T19:40:07.695Z",
        "lastScraped": "2021-07-15T19:40:07.695Z",
        "description": "<div><div><div><p>The User Research Internship is a part-time, 6 month program that supports the academic growth of students enrolled in a college/university with an interest in the User Experience field, with the potential for full-time hire after graduation. Interns will gain practical, hands-on experience in various research methodologies, with a focus on survey creation, interviewing, usability testing, and <span class=\"long-word\">screening/recruiting</span> participants. Interns will work remotely for 20-25 hours per week on a set (but flexible) schedule. </p></div><div><p>Job Responsibilities </p></div><div><p>I. Prepare, Conduct, Analyze Research </p></div><div><ul><li><p>Create surveys using Alchemer </p></li></ul></div></div><div><div><ul><li><p>Run usability tests and interview clients on the zoom/in person </p></li><li><p>Analyze quantitative and qualitative research </p></li><li><p>Prepare research readouts/decks that effectively communicate research findings to stakeholders </p></li></ul></div><div><p>II. Recruit Research Participants </p></div><div><ul><li><p>Work with User Researchers to determine target-user traits/criteria </p></li></ul></div></div><div><div><ul><li><p>Create screeners to ensure participants meet the criteria </p></li><li><p>Pull lists of clients who qualify for research </p></li><li><p>Use Ethn.io tool to schedule the research meetings, most of which happen via Zoom </p></li><li><p>Schedule and invite team members to research sessions using Outlook </p></li><li><p>Compensate clients who have participated in a research study via our gift card platform </p></li></ul></div></div><div><div><p>III. Support the User Research Team </p></div><div><ul><li><p>Take detailed notes during research sessions and brainstorm meetings </p></li><li><p>Contact clients via email and phone to book research sessions in person or remotely </p></li><li><p>Support the workload of User Researchers &amp; Recruiters as needed </p></li></ul></div><div><p>Desired Research Experience </p></div></div><div><div><ul><li><p>Experience conducting research in the social sciences or humanities </p></li><li><p>Experience analyzing/coding qualitative and/or quantitative data </p></li><li><p>Experience interviewing research participants </p></li><li><p>Experience building rapport with research participants </p></li></ul></div><div><p>We’re looking for you to… </p></div></div><div><div><ul><li><p>Be excited about User Experience Research and a drive to learn about the broader UX field </p></li><li><p>Be outgoing and very comfortable talking to clients on the phone/interviewing them </p></li><li><p>Be incredibly organized and capable of juggling multiple projects at the same time </p></li><li><p>Be self-driven, finding innovative ways to help the team when there is lull in your task load </p></li><li><p>Fully own research projects from start to finish, while keeping manager up-to-date on their status </p></li></ul></div></div><div><div><ul><li><p>Be proficient in Google Docs and Spreadsheets </p></li></ul></div><div><p></p></div><div><p>Education </p></div><div><p>Be currently enrolled in a <span class=\"long-word\">college/university,</span> preferably in a UX or Research-related program (Psychology, Anthropology, Sociology, Computer Science, Graphic Design, Industrial Design) </p></div><div><p></p></div></div><div><p></p></div></div>",
        "index": 6,
        "skills": [
            "project management",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "Public Safety College Internship",
        "company": "City of Duarte",
        "location": {
            "city": "Duarte",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/48c6192ad60830fcfc93cd846faf093b?lvk=dEWxCn0KFZP3XIJxEH390Q.--M68NckFL-",
        "posted": "2021-07-07T19:40:08.530Z",
        "lastScraped": "2021-07-15T19:40:08.530Z",
        "description": "<div><div> Position Summary <p></p><div><div><div><p>Under the supervision of a City Department Director or his/her designee, the College Intern will be given the opportunity to work on a variety of projects and receive a wide-range of experience in all areas of the department. This broad range of experience is intended to be an asset in preparing the intern for a career in public service.&nbsp;</p></div><br></div><p><strong>Examples of Typical Internship Duties:</strong></p>&nbsp;The Crime Prevention Intern will be given the opportunity to work on various projects and receive a wide range of experience in the areas of Youth Services within the Public Safety Office. The Intern may assist with a variety of crime prevention functions, including assisting with and/or taking the lead on special projects; day-to-day coordination and supervision and transportation of City youth participants and volunteers, and assisting with the planning and implementation of Regional Prevention and Intervention Programming in and around the City of Duarte. This broad range of exposure to Crime Prevention is intended to be an asset in preparing the Intern for a career in youth prevention and intervention services. </div><p></p> Duties <p></p><div><p>The following tasks are essential for this position. Incumbents in this classification may not perform all of these tasks, or may perform similar related tasks not listed here.</p><ol><li><p>Performs keyboarding, data entry, and filing.</p></li><li><p>Prepares a variety of moderately complex documents in draft and final form using a personal computer and word processing software.</p></li><li><p>Operates a variety of office equipment.</p></li><li><p>Provides complex clerical assistance to supported staff.</p></li><li><p>Assists in moderately complex research data collection and report preparation.</p></li><li><p>Performs other related duties as required.&nbsp;</p></li></ol></div><p></p> Minimum Qualifications <p></p><div><p><strong>Knowledge of:&nbsp;</strong></p><ul><li><p>Professional writing techniques.</p></li><li><p>Record keeping principles and procedures.</p></li><li><p>Relevant mathematical principles and functions.</p></li><li><p>Computers and office software applications.</p></li><li><p>Functions, policies, and procedures of relevant departments and/or operations.</p></li><li><p>English usage, spelling, grammar, and punctuation.</p><p><strong>Skill and Ability to:&nbsp;</strong></p></li><li><p>Deal with the public in person or on the telephone.</p></li><li><p>Understand and follow verbal and written direction.</p></li><li><p>Plan, organize, prioritizes, and perform duties as assigned with minimal supervision.</p></li><li><p>Operate standard office equipment, a personal computer, and relevant software in a Mac environment.</p></li><li><p>Interpret and apply department policies and procedures.</p></li><li><p>Communicate clearly and concisely, both orally and in writing.</p></li><li><p>Research and compile information.</p></li><li><p>Maintain records.</p></li><li><p>Establish and maintain effective working relationships with the public and all levels of staff and management.</p></li><li><p>Successfully adapt in a high-volume, fast-paced working atmosphere with multiple activities.</p></li></ul></div><div><p>&nbsp;Any equivalent combination of training and experience that provides the required knowledge, skills, and abilities could be considered qualifying. A typical way to obtain the knowledge, skills, and abilities would be enrollment in an undergraduate or graduate degree program in a related field to the department.</p></div><p></p> Supplemental Information <p></p><div><p><strong>Desirable Qualifications:</strong></p>&nbsp;Enrolled in an undergraduate or graduate degree program; desirous of entering the public sector workforce as a career goal; computer proficient; comfortable working in a Windows and Mac environment; excellent communication skills; community-oriented; basic knowledge of youth supervision and discipline process, knowledge and/or interest in the juvenile justice system; willingness to become a youth mentor and act as a role model; bi-lingual English-Spanish is a plus, but not required or expected. &nbsp;Must possess a valid California Driver's License and proof of insurance. Applicants will be required to obtain clearance to work with youth through a background check within 15 days of employment. </div><p><strong>Length of <span class=\"long-word\">Internship/Schedule:</span></strong><br>&nbsp;A minimum commitment of two semesters/quarters is expected. Depending on the successful candidate's availability and schedule, the position will be approximately 8-20 hours per week, occurring sometime during the Public Safety Office workweek, which is Monday through Thursday, 7:30am to 6pm and weekly nights and weekends.</p><p></p></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Intern - Internal Audit",
        "company": "First Baptist Church of Alamance",
        "location": {
            "city": "Cincinnati",
            "state": "Ohio",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2c721c1a2eaf345d51f4ba592ad46f7a?lvk=vBKNTXGRCP9XzrVFkql7zw.--M63EuuwI-",
        "posted": "2021-07-12T19:40:09.365Z",
        "lastScraped": "2021-07-15T19:40:09.365Z",
        "description": "<div><div><p>We do the right things, right now.&nbsp; We do them in a way that is relevant to our clients.&nbsp; Become a part of our history as it continues to be written!&nbsp;<br><br>If you are interested and qualified for this role, we invite you to apply.</p><p></p><p></p>The Internal Audit Department is an independent and objective assurance and consulting activity that is guided by a philosophy of adding value to improve operations of First Financial Bank (the Bank). It assists the Bank in accomplishing its objectives by bringing a systematic and disciplined approach to evaluate and improve the effectiveness of the Bank's governance, risk management and internal control environment. The Internal Audit Department will adhere to the Institute of Internal Auditors' mandatory guidance including the Core Principles for the Professional Practice of Internal Auditing, the Definition of Internal Auditing, the Code of Ethics and the International Standards for the Professional Practice of Internal Auditing (collectively the Standards). <br><br>The Internal Audit Internship role will support the Internal Audit Department's goals and objectives as described above. The Internal Audit Internship is a part-time, up to 4 months position (working 20-30 hours per week) starting as early as August 2021. The Internal Audit Intern is responsible for assisting audit seniors/managers by completing multiple tasks assigned to them for audit engagements or special projects. The assigned tasks will increase their knowledge of audit, risk assessments and internal controls. Beyond the basic auditing tasks, the Internship will provide an opportunity to learn about all operational aspects of the banking industry and the Bank. The Internal Audit Intern will develop interpersonal skills and build professional working relationships both in Internal Audit and with operational associates, including key managers and senior leaders at the Bank. In addition, the Internal Audit Intern will further develop collaborative skills working in team settings and writing skills through helping to draft deliverables to internal clients in our value-added audits and special projects.<p></p><p></p><p></p><p><b>Essential <span class=\"long-word\">Functions/Responsibilities</span></b></p><ul><li>With the assistance of audit seniors/managers, develop an understanding of the Bank's audit approach, the banking industry and the needs of the Bank.</li><li>Primarily assist with executing and documenting tests/assessments for internal controls over financial reporting (SOX). May assist with other areas within the Internal Audit department such as operational audits, information technology audits, compliance audits and special projects. In addition, may assist the Chief Internal Auditor, the Director of Strategy, Risk, Execution and Integration, and the Director of Quality Assurance with certain risk assessments, senior leadership reporting and quality assurance reviews and internal interviews.</li><li>Develop and implement effective audit techniques and procedures and utilize documentation skills, which adequately support audit findings within a timely manner.</li><li>Prepare summaries of findings for audit reports or internal control weaknesses and communicate findings and recommendations to appropriate levels within the audit engagement team.</li><li>Develop a high level of analytical skills and evaluate the effectiveness of procedures, segregation of duties and internal controls within the area subject to audit.</li><li>Assist with identifying the Bank's risks through review of financial statements, relevant external information and industry trends.</li><li>Adhere to the Bank's values and Code of Conduct.</li></ul><p></p><p><b>Minimum Knowledge, Skills and Abilities Needed to Perform Essential <span class=\"long-word\">Functions/Responsibilities</span> of the Job</b></p><ul><li>Pursuing a Bachelor of Science/Business Administration of Science degree in Accounting, Finance, Information Technology or related field at an accredited college or university.</li><li>Two years of education with a minimum of 60 credit hours successfully completed.</li><li>Leadership experience through previous work and/or extracurricular activities.</li><li>Demonstrate effective verbal and written communication skills, critical thinking skills, ability to work in a team environment, efficient time management, analytical skills, resourceful in delivering high quality work and ability to multi-task given assignments.</li><li>Ability to navigate various computer applications, including Microsoft Office (i.e., Excel, Word, and PDF) and the ability to quickly lean other applications used at First Financial Bank.</li><li>Work location primarily in Springdale, Ohio; however, may travel to other First Financial Bank locations. Therefore, must have access to reliable modes of transportation.</li></ul><p></p><p><b></b><b>Preferred Knowledge and Skills</b></p><ul><li>Basic Accounting, Finance, Information Technology and/or Auditing knowledge and terminology.</li><li>Basic Banking knowledge and terminology.</li></ul><p></p><p><b>Level of Complexity and Scope</b></p><ul><li>Entry level internship</li><li><p></p><p><b>Degree of Independence and Decision-Making</b></p></li><li>Basic</li><li><p></p><p><b>Physical Requirements</b></p></li><li>Occasionally lifts and carries up to 20 lbs.</li><li>Frequently sits, stands and walks.</li></ul><p></p><p><b>Compliance Statement</b></p><p>The associate is responsible for meeting all compliance requirements imposed on First Financial Bank by State and Federal law and regulation, as well as all related First Financial Bank policies and procedures. This includes all Bank Secrecy Act, Anti-Money Laundering, OFAC and Suspicious Activity reporting requirements, as well as all other lending and deposit compliance requirements.</p><p></p><p>It is our policy to not discriminate against any individual in violation of federal, state, and local laws as it relates to age, race color, religion, national origin, sex, marital status, pregnancy, gender identity, disability, sexual orientation, genetic information, veteran/military service, or any other characteristic protected by law.</p><p></p><p></p><p></p><p></p><p>It is our policy to not discriminate against any individual in violation of federal, state, and local laws as it relates to age, race, color, religion, national origin, sex, marital status, pregnancy, gender identity, disability, sexual orientation, genetic information, veteran/military service, or any other characteristic protected by law.</p><p></p><p>We are an E-Verify Employer.</p></div></div>",
        "index": 8,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "start": "2021-08-01T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Blockchain Engineering Graduate Program",
        "company": "Reesby IT",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/reesby-it-ea166b25/blockchain-engineering-graduate-program-ed8a601d?lvk=aKVW6ZT-sOJoxLln7TUXow.--M5ce0Gllo",
        "posted": "2021-07-09T19:40:11.508Z",
        "lastScraped": "2021-07-15T19:40:11.508Z",
        "description": "<div>About the position<p>Reesby are looking for Blockchain and Crypto Engineer to join us in a <strong>12 week internship </strong>to learn about the design, development and installation of software solutions. Your duties will include development, writing code, and documenting functionality.</p><p>You should be able to build high-quality, innovative and fully performing software in compliance with coding standards and technical design.</p><p>Part-time or full-time options</p><p>Remote</p><p>Internship</p><p></p>You will learn how to:<ul><li><p>Organize full lifecycle software development</p></li><li><p>Prepare specifications and determine operational feasibility</p></li><li><p>Write well designed, testable, efficient code</p></li><li><p>Prepare software verification plans and quality assurance procedures</p></li><li><p>Organize documenting and maintenance of software functionality</p></li><li><p>Integrate software components into a fully functional software system</p></li><li><p>Evaluate and deploy software tools, processes and metrics</p></li><li><p>Provide support and consulting on software systems usage</p></li><li><p>Ensure compliance with project plans and industry standards</p></li></ul><p></p>Requirements are:<ul><li><p>Knowledge or experience of working in Computer Software Engineering or blockchain</p></li><li><p>Significant experience in developing web applications using at least one popular web framework, such as JSF, Wicket, GWT or Spring MVC, react , java, python or cryptography</p></li><li><p>Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate)</p></li><li><p>Good experience in designing interactive applications and with test-driven development</p></li><li><p>Good knowledge to develop software in C, C++, C#, Java or other selected languages</p></li><li><p>Experience in documenting requirements and specifications</p></li><li><p>Close familiarity with software engineering tools, software development methodology and release processes</p></li><li><p>BS degree in Computer Science or Engineering</p><p></p><p>www.reesby.com.au for more jobs</p></li></ul></div>",
        "index": 9,
        "skills": [
            "software engineering",
            "sql",
            "cybersecurity",
            "java",
            "c and c++",
            "machine learning",
            "project management",
            "python",
            "information technology",
            "react"
        ],
        "remote": true
    },
    {
        "position": "Information Technology Specialist III (SR-24)",
        "company": "County of Kaua'i",
        "location": {
            "city": "Lihue",
            "state": "Hawaii",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1c5d77daafe573dfc1a5f3682d465997?lvk=gn8T1n_o7-baJSRUMWuolQ.--M65oZitd3",
        "posted": "2021-07-11T19:40:12.364Z",
        "lastScraped": "2021-07-15T19:40:12.364Z",
        "description": "<div><div> Recruitment Number <p>Please note that this recruitment will close at 4:30 p.m. HST on July 20, 2021.<br><strong>&nbsp;</strong><br>Salary rate is determined by collective bargaining agreements or Pay Administration Policy as applicable.<br><strong>&nbsp;</strong><br><strong>ELECTRONIC MAIL (EMAIL) NOTIFICATIONS:&nbsp;</strong>The Department of Human Resources will use ONLY electronic mail (email) to notify applicants of important information relating to the status, processing of their applications and examination notices due to the COVID-19 situation.<br>&nbsp;<br>Please ensure that the email address and contact information you provide is current, secure, and readily accessible to you. We will not be responsible in any way if you do not receive our emails or fail to check your emails in a timely manner. &nbsp;In addition, please be aware that you may no longer receive notification about applications submitted if you choose to disable the Job Application Emails feature.<br><strong>&nbsp;</strong><br>Recruitment No.: 2122-014 Intra Departmental; 2122-015 Inter Departmental; 2122-016 Open Competitive<br><br>Intra: Limited to civil service employees employed by the County of Kaua'i, Department of Water.<br>Inter: Limited to civil service employees employed by the County of Kaua'i.<br>Open: Includes all interested individuals including members of the general public. <br>&nbsp;<br>Eligible lists may be used for temporary and permanent vacancies for the class of work during the life of the eligible list. &nbsp;Temporary appointments may lead to conversion to permanent employment.</p> Duties Summary <p>Designs and develops Information Technology systems and procedures involving analysis, evaluation, and recommendations of existing systems (manual and automated), and operating requirements for a major area of County operation, requiring the integration and coordination of several systems or sub-systems; develops and implements project plans for the recommended systems; and performs other duties as required.</p> Qualification Requirements <p><strong>MINIMUM QUALIFICATION REQUIREMENTS</strong><br>Applicants must meet all the requirements for the position they are seeking as of the filing date of their application, unless otherwise specified. Therefore, please provide a complete application of all the information you would want considered in our review. &nbsp;Applicants may request an administrative review to provide clarifying information only on the information that was originally provided on the application at the time of filing; subsequent submittal of missing documents or new information that was not part of the original application submittal will not be considered in the Administrative Review.<br>&nbsp;<br>Please note that unless specifically indicated, internships that are required for graduation may not be credited for experience. Your possession of the required amount of experience will not in itself be accepted as proof of qualification for the position. Overall paid or unpaid experience must be of such scope and responsibility as to conclusively demonstrate that you have the ability to perform the duties of the position.<br>&nbsp;<br>Note: Calculation of experience is based on full-time, 40-hour work weeks. Part-time experience will be pro-rated. Example: Twelve months of experience at 20 hours per week is equivalent to six months of experience. In addition, hours worked in excess of 40 hours per week will not be credited. Example: Twelve months of experience at 60 hours per week is equivalent to one year, not one and one-half years.<br><br>Training &amp; Experience:A combination of education and experience substantially equivalent to graduation from an accredited college or university with a baccalaureate degree in information technology, computer science or a related field, and&nbsp;</p><ul><li>four (4) years of specialized work experience.</li></ul> Qualifying Specialized Work Experience: Professional work experience in Information Technology which include work in the areas of user and systems requirements and analysis, applications development and maintenance, computer systems support, network design and maintenance, and/or data/database <span class=\"long-word\">analysis/administration.</span> <br><br> Substitutions Allowed: <br>The following may be substituted for education: <br>General professional work experience or education credits can be substituted for up to two (2) years of the Bachelor's degree such as: <ol><li>Full time progressively responsible professional, technical or substantive work experience demonstrating the scope, level and quality of work comparable to a curriculum leading to an associate's, bachelor's or master's degree</li><li>Successful completion of semester credits in a curriculum leading to a degree or diploma at an accredited community college, trades school, college, or university. (15 semester credits = 6 months of experience).</li></ol><br>Specialized professional work experience in information technology, computer science or a related field or education credits in information technology, computer science or a related field can be substituted for up to two (2) years of the Bachelor's degree such as: <ol><li>Full time progressively responsible professional, technical or substantive work experience demonstrating the scope, level and quality of work comparable to a curriculum leading to an associate's, bachelor's or master's degree.</li><li>Successful completion of semester credits specific to information technology, computer science or a related field leading to a degree or diploma from an accredited community college, trades school, college, or university (15 semester credits = 6 months of experience).</li><li>A master's degree or PhD in information technology, computer science or a related field may be substituted for the education requirement.</li></ol>The following may be substituted for experience: <br><strong>SPECIALIZED EXPERIENCE</strong><ol><li>Successful completion of semester credits specific to information technology, computer science or a related field &nbsp;leading towards a Bachelor's/Master's/PhD degree from an accredited college or university, may be substituted up to one (1) year of the specialized work experience requirement. (15 semester credits = 6 months).</li><li>A Master's degree in information technology, computer science or a related field from an accredited college or university may be substituted for one (1) year of the specialized work experience requirement.&nbsp;</li><li>A Doctorate's degree information technology, computer science or a related field from an accredited college or university may be substituted for one (1) year of the specialized work experience requirement.</li></ol><br>If a degree is used to substitute for the education requirement, it may not be used again towards the experience requirement. If work experience is used to substitute for education, it may not be used again to meet the experience requirement. If the applicant holds more than one degree, transcripts must be provided and a thorough review will be conducted by the DHR staff in order for more than one degree to be credited towards the minimum qualification requirements. Additional degrees can be considered if obtained independently through mutually exclusive classes from another degree being considered. Substitutions will be used to the advantage of the applicant. <br>&nbsp; <br> Quality of Experience: Possession of the required number of years of experience will not in itself be accepted as proof of qualification for a position. The applicant's overall experience must have been of such scope and level of responsibility as to conclusively demonstrate that he/she has the ability to perform the duties of the position for which he/she is being considered. <br>&nbsp; <br> License Requirement: Possession of the appropriate licenses or certificates as required of the position. <br><br> Knowledge of: Principles and practices of administration and organization; process mapping; project leadership; programming, problem-solving, block-diagramming and flow charting; data sources and flow, interactions of complex systems, and capabilities and limitations of systems software and computer equipment. <br>&nbsp; <br> Ability to: Gather, analyze, correlate, and evaluate facts and make sound judgments; apply analytical reasoning; determine the feasibility of automating manual processes through the use of Information Technology; apply Information Technology to manual processes; integrate subsystems into the overall IT environment; troubleshoot post-installation problems; prepare concise reports and procedures; maintain confidentiality; supervise and work cooperatively with others. <br><br> Tests: Applicants may be required to qualify on an appropriate examination. <br><br> Health and Physical Condition Requirements: Persons seeking appointment to positions in this class must meet the health and physical condition standards deemed necessary and proper to perform the essential functions of the position with or without reasonable accommodations. <br>&nbsp; <br> Physical Effort Grouping: Light <br>&nbsp; <p></p> Additional Job Information <p>Required Forms and Documentation:</p><ol><li>Evidence of education (degree or transcript). &nbsp;A legible photo copy of an official transcript will be accepted. DHR reserves the right to request for an official copy.</li></ol><br>Note: Transcripts downloaded from the internet are not acceptable. Copy of your education degree or transcripts must be submitted in order to be given credit. &nbsp;Copies will not be returned. &nbsp;Supporting documents must be attached to the application postmarked or dropped off to: Department of Human Resources, 4444 Rice Street, Suite 140, Lihue, HI 96766 or emailed: <span class=\"long-word\">hrrecruitment@kauai.gov</span> within 10 c...</div></div>",
        "index": 10,
        "skills": [
            "information technology",
            "networks",
            "c and c++",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2021-07-20T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Graphics Hardware Signoff Student Worker",
        "company": "Intel",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c9b23b6307c32de6476122074de3a0b7?lvk=oZOiHrhMhBe-LG3R4nnMyA.--M5z8LwWxg",
        "posted": "2021-07-12T19:40:13.786Z",
        "lastScraped": "2021-07-15T19:40:13.786Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>If you are passionate about computer graphics and working with leading graphics engineers on Intel's latest GPU/CPU architecture, then our Graphics and Throughput Computing Hardware Engineering (GTCHE) team has opportunities for you. We are passionate about delivering best-in-class visual experiences for users to immerse themselves. The Visual and Machine Learning IP team is within GTCHE delivering discrete and integrated graphics IPs to client and datacenter market. In this position as a Graphics Hardware Signoff Student Worker you will be part a world-class IP physical design team developing groundbreaking high-performance GPU/GFX IPs that are targeted for High-End Graphics, Gaming, Artificial Intelligence, Media processing, and more. This is a great opportunity to join a talented team that is innovating in ASIC implementation and verification of multi-million gate designs in advanced process nodes across multiple foundries.</p><p></p><p>Your responsibilities may include, but not be limited to:</p><ul><li>Implementing signoff capabilities and flows for Static Timing Analysis, Electrical Rule Checkers, Parasitic Extraction, Reliability Verification across internal and external foundry processes</li><li>Developing timing tools, understand design <span class=\"long-word\">requirements/objectives</span> and develop signoff conditions and milestone checklists appropriate with the design project goals</li><li>Collaborating with 3rd party EDA vendors to resolve issues and drive feature improvements in signoff tools</li></ul><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school <span class=\"long-word\">work/classes/research</span> and/or relevant previous job and/or internship experiences.</p><p></p><p><b>Minimum Requirements </b></p><ul><li>Bachelor's degree student in <span class=\"long-word\">Electrical/Electronic</span> Engineering, Computer Science, Computers Engineering or related engineering field</li><li>Must be graduating in 1.5+ years</li><li>6+ months of academic experience in TCL, Perl and Python programming for robust flow automation</li><li>Availability to work at least 24 hours per week</li><li>Advanced English level</li><li>Candidate must have unrestricted permanent right to work in Costa Rica</li></ul><p><br><b>Preferred Qualifications:</b></p><ul><li>Master's degree student on mentioned engineering areas</li><li>Proficiency with one or more of the following Industry standard EDA tools: Redhawk, StarRC, Primetime</li><li>6+ months of academic experience on electrical and physical rules checkers for meeting design robustness</li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (Costa Rica)<p></p><p></p>Primary Location:&nbsp;Costa Rica, San Jose<p></p><p></p>Additional Locations:<p></p><p></p><p></p><p></p>Business group:Intel Architecture, Graphics, and Software (IAGS) brings Intel's technical strategy to life. We have embraced the new reality of competing at a product and solution level-not just a transistor one. We take pride in reshaping the status quo and thinking exponentially to achieve what's never been done before. We've also built a culture of continuous learning and persistent leadership that provides opportunities to practice until perfection and filter ambitious ideas into execution.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>",
        "index": 11,
        "skills": [
            "machine learning",
            "hardware",
            "software engineering",
            "data visualization",
            "python",
            "project management",
            "virtual reality",
            "game design",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Small Business Development Center Intern",
        "company": "International Rescue Committee",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2cc0923f80e1aaa7f98edf3dbd307dc7?lvk=qBG_xO_GN_ReOa5D7OMUqA.--M68XcdjKg",
        "posted": "2021-07-10T19:40:16.248Z",
        "lastScraped": "2021-07-15T19:40:16.248Z",
        "description": "<div><div><p>Requisition ID: req18847</p><p> Job Title: Small Business Development Center Intern</p><p>Sector: Employment</p><p>Employment Category: Intern</p><p>Employment Type: Part-Time</p><p>Open to Expatriates: No</p><p> Location: San Diego, CA USA</p><p></p><p> Job Description</p><p></p><p> TITLE:</p><p> Small Business Development Center (SBDC) Intern</p><p></p><p> LOCATION:</p><p> VIRTUAL STARTING - City Heights</p><p></p><p> START DATE: September 2021</p><p> DURATION:</p><p> 4 months starting; 10 - 20 hours per week</p><p></p><p></p><p> Important Note: This is an unpaid internship.</p><p></p><p></p><p> BACKGROUND: The International Rescue Committee (IRC) responds to the world's worst humanitarian crises, helping to restore health, safety, education, economic wellbeing and power to people devastated by conflict and disaster. Founded in 1933 at the call of Albert Einstein, the IRC is at work in over 40 countries and 26 U.S. cities helping people to survive, reclaim control of their future and strengthen their communities.</p><p></p><p></p><p> SCOPE OF SMALL BUSINESS DEVELOPMENT CENTER WORK: The IRC in San Diego has provided training, technical assistance, and loans to refugee, immigrants, and underserved entrepreneurs for nearly 15 years. The SBDC Intern will provide both administrative and direct service support to the program.</p><p></p><p></p><p> RESPONSIBILITIES: Based on intern skills and experience, responsibilities may include a combination of program support, <span class=\"long-word\">administrative/data</span> support, and direct service:</p><p></p><p></p><p></p><p></p><p></p><p>Create resources for the SBDC team and its clients, such as FAQ sheets and analysis of business opportunities, through analyzing past program data and researching current trends and opportunities.</p><p></p><p></p><p></p><p> Assist with facilitating the City of San Diego Community Development Block Grant (CDBG) program</p><p></p><p></p><p></p><p> Develop marketing and outreach materials, and collect success stories</p><p></p><p></p><p></p><p> Enter data and track outcomes through the IRC's Efforts to Outcomes (ETO) &amp; Neoserra databases</p><p></p><p></p><p></p><p> Monitor outcome pipeline for current client businesses</p><p></p><p></p><p></p><p> Conduct outreach initiatives to current and new clients, and assist in collecting follow up information for past clients</p><p></p><p></p><p></p><p> Assist with intake and support of walk-in clients, and assist clients with intake and application process for obtaining business loans</p><p></p><p></p><p></p><p> Provide program support for Business Women in Action program via outreach, class setup, and monitoring and evaluation</p><p></p><p></p><p></p><p> A good understanding of social media marketing techniques is desired. Social media require excellent writing, communication and computer skills.</p><p></p><p></p><p> LEARNING OBJECTIVES:</p><p></p><p> 1.Gain insight into the implementation of a microenterprise program and the workings of a grassroots Community Development Financial Institution (CDFI).</p><p></p><p> 2.Learn how microenterprise programs track outcomes and measure success</p><p></p><p> 3.Learn about the refugee resettlement process and needs of refugee entrepreneurs.</p><p></p><p></p><p></p><p>Qualifications</p><p></p><p> REQUIREMENTS:</p><p></p><p> Bachelor's degree in a related discipline (business, communication, economics, finance, public policy, public administration, social work, social sciences) or outstanding current undergraduate pursuing a relevant degree.</p><p></p><p>Experience with both administrative work and direct service with diverse populations</p><p></p><p> Excellent organization skills, strong communication and interpersonal skills, and ability to effectively collaborate</p><p></p><p> English fluency required, proficiency in a refugee language (Arabic, Farsi, Swahili, Vietnamese , Spanish, Creole, Karen, Burmese, Somali ) a plus</p><p></p><p>Strong working knowledge of MS Office, MS Excel, and MS Outlook.</p><p></p><p></p><p></p><p>This position reports to the Senior Microenterprise Business Counselor.</p><p></p><p></p><p></p><p></p><p></p><p></p></div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "virtual reality",
            "information technology"
        ],
        "compensation": "unpaid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "College Admit Lead (Remote)",
        "company": "Level Playing Field Institute",
        "location": {
            "city": "Oakland",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6707f1c714ed1c24e8426df53d27f935?lvk=dy7OlYdzQP1HgAW4WvSjVw.--M64ZkWh4Z",
        "posted": "2021-07-13T19:40:17.168Z",
        "lastScraped": "2021-07-15T19:40:17.168Z",
        "description": "<div><div><p>Organization: SMASH Program: SMASH Alumni Title: SMASH College Admit Lead Location: Remote/Virtual Reports to: SMASH College Director Position Type: Part-time, Temporary (August 2021- May 2022), Some Weekends Required, Remote</p><p> OVERVIEW ABOUT US AND OUR PHILOSOPHY</p><p>SMASH (http://smash.org) empowers brilliant, underrepresented students with rigorous science, technology, engineering, and math (STEM) education, culturally-relevant coursework, and access to resources and social capital that allow them to pave a successful career in tech and entrepreneurship. SMASH Academy, a year-round STEM-focused academic program that serves underrepresented high school students, has been described by US News and World Report as \"Perhaps the most ambitious program to encourage African American and Latino students in STEM fields\". Now in its 17th year, SMASH Academy is scaling through an ambitious expansion strategy to achieve national impact.</p><p> A research-based organization, SMASH informs and leverages research projects examining inequity in access and opportunity across K-12, higher education, and workplace contexts in order to improve the outcomes for underrepresented students in STEM fields. SMASH is funded by private donors, foundations, and corporate giving.</p><p> When SMASH scholars graduate from SMASH Academy, they enter their senior year of high school and officially become a part of our SMASH Alumni Program. The alumni program includes, but is not limited to: SMASH Admit <span class=\"long-word\">(http://smash.org/admit)</span> (college preparatory program), SMASH Rising <span class=\"long-word\">(https://www.smash.org/risingscholarintern)</span> (internship preparatory program), SMASH Persist (college persistence program), Career Placement Programming, SMASH Alumni Board, SMASH Alumni Summit, and the Alumni Newsletter.</p><p> Working at SMASH is about fast growth, personal commitment, and the tenacity to challenge the status quo. This is a pivotal time for SMASH as we build on the success of our education programs and scale our work dramatically. This is not for the faint of heart, but if you have what it takes to change the face of STEM, join us.</p><p> PROGRAM DESCRIPTION</p><p> Admit is our program supporting and preparing our SMASH seniors for the rigors of college. Admit provides seniors with the vital skills needed to embark upon all aspects of the college admissions process and make an informed college decision. In addition to one-on-one college coaching, Admit will host academic year workshops focused on (but not limited to): financial aid and scholarship support, college essay brainstorming, editing, and technical writing support, improving study skills and habits during senior year of high school, general college application support, and college fit.</p><p>THE OPPORTUNITY</p><p>Reporting to the College Director (COD), the College Admit Lead (CAL) will manage a group of up to 4 SMASH College Admit Coaches to deliver and sustain the transformative educational experience that SMASH seniors need to pursue, persist, and succeed in STEM. This will include, but is not limited to: leading and managing 4 Admit Coaches (Admit Group) who will be supporting up to 140 SMASH seniors from August to May, supporting the Admit Group to goal completion, while prioritizing stakeholder relationship management. The ultimate responsibility of the CAL is to ensure SMASH Admit runs smoothly and that seniors and coaches are set up for success with a critical lens to ensure that seniors: apply to SMASH colleges and universities, meet with their Admit Coach, attend workshops and celebration events, complete their financial aid documents and get access to as many scholarships as possible. This is approximately a 10-month assignment (late July to early May), with a part-time engagement throughout the duration of the program (August to May). Attendance at all training dates, workshops and events is mandatory. Although the majority of the position will function as described below, some aspects are subject to change due to evolving programmatic needs.</p><p> TIMELINE</p><p>Pre-Launch (August - September) | Part-Time (20 hours per week)</p><p>College Admit Coach Training Days | September 8-9 | 5 hours</p><p>Admit Kickoff Meeting | September 10 | 2 hours total</p><p>35-Week Program | September 11 - May 17 | Part-Time (20 hours per week)</p><p>Admit Debrief &amp; Wrap Up (May) | 2 hours total</p><p></p><p>*Attendance at all dates is mandatory. Please do not consider applying for this role if you are unable to attend all of the mandatory dates above.</p><p> This is a 100% remote position. The position can be done virtually, from a home office or, if feasible, from any virtual location with reliable Internet connection (at least 25 Mbps download speed). The responsibilities listed below demand a quiet space and we expect Leads to provide their own equipment. You will need a personal computer (desktop or laptop) that has a working webcam, speaker and microphone for video conferencing capabilities (i.e. Zoom, Google Hangouts, Cisco Webex, etc).</p><p> ESSENTIAL DUTIES</p><p>As an Admit Lead, you will be responsible for:</p><p></p><p>+ Supporting 4 Admit College Coaches (Admit Group) to assist SMASH seniors in their growth and development by constructing and executing meaningful college application plans. Your Admit Group will support up to 140 seniors (~35 seniors per coach) to apply for SMASH colleges and universities, complete financial aid applications, scholarship applications, ensure attendance at all programming events, among other key deliverables;</p><p> + Lead comprehensive hiring process for Admit Coaches;</p><p> + Support College Director (COD) to iterate Admit Coach training materials;</p><p> + Facilitate Admit Coach training;</p><p> + Collaborate with Alumni Operations Manager (AOM) to support the operational logistics of the Admit program including but not limited to: Admit Coach Training, Admit Kickoff, Admit Coach Meetings, Goal Completion, Workshops, Virtual Visits, Surveys, etc.</p><p> + Organize workshops to equip the ~140 seniors in your Admit Group with knowledge and skills necessary to successfully complete their program goals;</p><p> + Cultivate a strong relationship with SMASH Academy Site Directors to ensure alignment across Academy and Admit programming;</p><p> + Create a collaborative environment, working professionally with SMASH staff and various stakeholders under the direction of the College Director; timely communication with manager and all SMASH staff is critical, particularly in regards to senior behavior and progress</p><p> + Update Admit Team knowledge management platforms (e.g. updating documentation in drive, etc.)</p><p> + Collaborate with your Admit Lead counterpart to design &amp; implement a senior communication strategy to ensure seniors across regions are well-informed about and required program goals, dates, and new opportunities;</p><p> + Ensure that Admit Coaches maintain a detailed record of senior meeting attendance, goal completion and progress made by way of the Admit Tracker;</p><p> + Follow the detailed calendar that will provided in your Admit Lead Guide;</p><p> + Complete staff surveys and actively engage in all program evaluation activities;</p><p> Requirements</p><p>QUALIFICATIONS</p><p> + Demonstrated effectiveness working with underrepresented, low-income youth in diverse academic and professional fields</p><p> + Bachelor's degree in Education or a related field required; advanced degree preferred (completed or in progress)</p><p> + A minimum of two years college counseling and/or relevant work experience</p><p> + Highly flexible for an evolving program in its third year</p><p> + Exceptional project management skills with the ability to set clear goals, lead seniors/Admit Coaches/Admit Group to the finish line through seamless information flow, effective communication; an ability to \"read the room,\" influence and maintain strong team momentum through Admit goal completion</p><p> + Content competency and enthusiasm for subject area required</p><p> + Excellent oral and written communication skills, presentation skills</p><p> + Excellent critical thinking skills, self-starter with an entrepreneurial mindset</p><p> + Commitment to SMASH's mission; willingness to embrace goals/values is essential</p><p> + Desire to lead with technology and improve technological skills</p><p> + Excellent facilitation skills, community management and coaching skills; openness to various and/or new paradigms for learning and development</p><p> + Willingness to be self-reflective and deeply empathic; a critical thinker with strong problem-solving abilities who can make quick decisions and communicate directly</p><p> + Experience in collaboratively developing curriculum, project based learning</p><p> + Availability for all training and program dates listed above required</p><p></p><p> APPLICANT INFORMATION</p><p>Apply for this position below. The application includes a place to upload your resume and cover letter and to provide a written response to specific prompts:</p><p></p><p>+ What is your college coaching philosophy?</p><p> + How would you advise a coach to support a senior who has committed to two universities?</p><p> + How would you advise a coach to support a senior who received a full-tuition scholarship to a school they aren't excited about?</p><p></p><p> These positions will close when filled.</p><p> Benefits</p><p>COMPENSATION</p><p> The compensation for this position is $21.25/hr with a maximum of 688 hours for the entire duration of position. Should the employee miss any hours of required meetings or events, the total compensation will be adjusted accordingly. If your assignment ends earlier than we anticipate for any reason, your compensation may also be reduced accordingly. While we cannot offer a benefits package for this position, we can reimburse you for any approved work-related expenses. Access to ...</p></div></div>",
        "index": 13,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "virtual reality",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Assistant Program Director - Home Study",
        "company": "Southwest Key Programs",
        "location": {
            "city": "Austin",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/766ef79bdc69ddb22d095ce50b21ed59?lvk=raXqUa0i9dHAoeT443wM0g.--M65hd_Zu3",
        "posted": "2021-07-10T19:40:17.962Z",
        "lastScraped": "2021-07-15T19:40:17.962Z",
        "description": "<div><div><p>Job Summary: </p><p>&nbsp;</p><p></p><p>&nbsp;</p><p>The Assistant Program Director is responsible for assisting in the operational, managerial, and administrative duties relating to the program. The Assistant Program Director of Home Study is responsible for the oversight of the day to day operation of the home study department including assigning of caseloads, review of home study reports and internal audits of department staff. The Assistant Program Director of Home Study maintains a flexible, organized and efficient work schedule and is subject to work overtime and be on-call.</p> Essential Functions: <ul><li>Assist with collection, maintenance and submission of monthly, quarterly, and annual reports to the appropriate personnel at Southwest Key Programs' national headquarters and the Office of Refugee Resettlement (ORR).</li><li>Assist with overall supervision and management of program personnel including recruitment, hiring, training, and terminating.</li><li>Review monthly financials, with the Program Director, to ensure compliance with <span class=\"long-word\">operations/contract</span> requirements. Adhere to negotiated annual budget and spending requirements.</li><li>Assist with facilitating the established training guidelines and curriculum for employee training.</li><li>Monitor and maintain compliance with organization, and funding source for all program departments.</li><li>Develop corrective action plans or disciplinary memos to address performance issues of home study social worker staff in collaboration with Program Director.</li><li>Assign caseloads to home study workers.</li><li>Perform monthly audits of program case files, complete quarterly sponsor surveys and complete biyearly staff shadowing's to ensure compliance with SWK and federal guidelines.</li><li>Review and submit home study reports to ORR by deadlines.</li><li>Complete individual weekly case review with each home study worker.</li><li>Maintain a weekly updated list of the status for all cases to ensure that adequate progress has been made and timelines are being upheld.</li></ul> Other Functions: <ul><li>Review and submit post release reports to ORR by deadlines, as needed.</li><li>Assume the duties and responsibilities of the Program Director in his/her absence or as requested.</li><li>Attend all organizational required trainings.</li><li>Attend all departmental and program meetings to ensure that up-to-date information is received and/or information of policy changes or practice are adhered to.</li><li>Travel as needed for trainings and conference.</li><li>Maintain a safe work environment that is free from distractions.</li><li>Develop and maintain productive relations with local, state and federal stakeholders.</li><li>Able to react to change productively and handle other essential tasks as assigned.</li></ul> Qualifications and Requirements: <ul><li>A combination of one of the following: <ul><li>Master's degree in social work or an equivalent degree in behavior sciences or a social service field, with a minimum of three (3) years of progressive experience conducting home studies and working with immigrant populations, and should be knowledgeable about family preservation, kinship care, and/or general child welfare, may include part-time, volunteer or internship experience. Minimum of one (1) year supervisory experience.</li><li>Bachelor's degree in behavior sciences or social service field, with at least five (5) years of relevant supervisory and case management experience.</li></ul></li><li>Must possess excellent organizational, writing, analytical, and processing skills.</li><li>Should be able to perform conflict resolution or crisis intervention and have excellent communication skills.</li><li>Must possess excellent time management skills and be flexible to schedule changes.</li><li>Must be computer literate with working knowledge of Microsoft Windows (Word Perfect, Microsoft Word, Excel).</li><li>Maintain a clean driving record and must be eligible to drive on behalf of SWK.</li><li>Must possess a valid state driver's license, current driver's insurance and access to reliable transportation.</li><li>Must be available to travel.</li><li>Cleared Tuberculosis test results.</li><li>Cleared background check from appropriate entity.</li><li>Must be fluent in English and Spanish</li><li>Cleared drug test results (this one is for Texas programs only).</li><li>Must be at least 21 years of age at the time of hire.</li></ul> Physical Demands: <p>Job requires extended periods of sitting; use of various office equipment; traveling by car and plane for extended periods of time. </p> Work Environment: <p>This is a work from home job where high levels of self-motivation and organizational skills are needed. Employees must have a quiet, private space in which to work at home. The Assistant Program Director will work closely with staff in various time zones throughout the United States therefore early morning or after hour work may be needed.</p> Not ready to apply? Connect with us for general consideration.</div></div>",
        "index": 14,
        "skills": [
            "project management",
            "information technology",
            "react"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern II - Traffic",
        "company": "City of Corona",
        "location": {
            "city": "Corona",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7acf72550a18a526e0734d701d82e1ce?lvk=KZlv6iRYSRRGPn3IQsePiw.--M62yqKPhs",
        "posted": "2021-07-12T19:40:18.715Z",
        "lastScraped": "2021-07-15T19:40:18.715Z",
        "description": "<div><div> DESCRIPTION <p>The Traffic Engineering Division of the Public Works Department is seeking creative, highly talented and motivated <span class=\"long-word\">Civil/Transportation</span> Interns. The internship will provide university students with hands-on experience and on-the-job training through a paid internship related to their academic field of study. It is also an opportunity for students to learn about the transportation industry while applying classroom theories and concepts to \"real-world\" work situations at one of the Inland Empire's best cities.<br>&nbsp;<br>Candidates will work under supervision of a Senior Engineer in Traffic and mentor within the occupation and skill area that directly relates to their civil engineering degree. Candidates will assist Traffic Engineering in the preparation of traffic engineering designs and plans using computer assisted design software and equipment.<br><br>We offer a casual and energetic business environment. This position offers the applicant growth opportunities with exposure to transportation planning, engineering, analysis, field review, and design. The work days are Monday thru Friday and work hours 7am to 5pm are flexible with school schedule and may be modified every quarter. We would like a minimum of 16-hours per week commitment. This job requires both field and office work and does require minimal heavy lifting/labor. This internship is year-round.</p> ESSENTIAL DUTIES AND RESPONSIBILITIES <p>The duties listed below are intended only as illustrations of the various types of work that may be performed. The omission of specific statements of duties does not exclude them from the position if the work is similar, related or a logical assignment to this position.<br>&nbsp;</p><ol><li>Assist staff in preparing designs and performing plan checking of traffic control, traffic signals, signing and striping plans and exhibits.</li><li>Perform standard transportation engineering calculations, computations and analysis such as traffic studies.</li><li>Update and maintain various databases and logs.</li><li>Understand and interpret construction drawings.</li><li>Scan, copy, print, and transmit working drawings of current projects.</li><li>Efficiently utilize time in executing assigned tasks neatly and accurately.</li><li>Effectively communicate and coordinate with internal engineering team members.</li><li>Obtain and assemble data to complete engineering designs, visiting job sites to compile measurements as necessary.</li><li>Assist in the preparation of presentation drawings, design analysis, cost estimates, construction specifications, and various studies and reports.</li><li>Participate in the review of product or shop drawing submittals during the construction phase.</li><li>Performs other duties assigned.</li></ol><p></p> QUALIFICATIONS GUIDELINES <p><strong>Minimum Requirements:</strong><br>Officially be enrolled in an accredited institution of higher learning in an undergraduate program, and&nbsp;are expected to graduate no earlier than June 2023.<br>&nbsp;</p><ul><li>Experience with MS Office suite of tools (e.g.MS Word, MS Power Point, MS Excel, MS Access)</li><li>Experience with ArcMap GIS is a plus</li><li>Ability to organize and maintain project files.</li><li>Ability to participate in the engineering design process and develop alternative solutions and presentation graphics used to communicate concepts.</li><li>Excellent written and oral communication skills; must also be well organized.</li><li>Ability to work independently and as part of a team.</li><li>Proficiency in AutoCAD is desirable</li></ul><p></p> PHYSICAL/MENTAL DEMANDS AND WORK ENVIRONMENT <p>The physical and mental demands described here are representative of those that must be met by employees to successfully perform the essential functions of this class. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br><strong>Physical Demands&nbsp;</strong><br><br>While performing the duties of this class, employees are frequently required to sit, stand and walk; talk or hear, in person and by telephone; use hands repetitively to finger, handle, feel or operate standard office equipment; and reach with hands and arms. Employees occasionally lift and move records and documents weighing up to 25 pounds.<br><br>Specific vision abilities required by this job include close vision and the ability to adjust focus.<br><br><strong>Mental Demands</strong><br><br>While performing the duties of this class, employees are regularly required to use written and oral communication skills; read and interpret data, information and documents; analyze and solve problems; observe and interpret situations; learn and apply new information or skills; perform highly detailed work; work on multiple, concurrent tasks; work with frequent interruptions; work under intensive deadlines; and interact with City managers, staff, vendors, the public and others encountered in the course of work.<br><br><strong>Work Environment&nbsp;</strong><br><br>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this class. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>Employees work under typical office conditions, and the noise level is usually quiet. In certain assignments, the work environment is moderately noisy.</p></div></div>",
        "index": 15,
        "skills": [
            "project management",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Integrated Solutions & Systems Intern",
        "company": "Teledyne Scientific & Imaging",
        "location": {
            "city": "Thousand Oaks",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c13a1a41da42c975927c1630f5e1411c?lvk=r6-IdFtVsOde1rhTQWOLKA.--M68Ezr26V",
        "posted": "2021-07-08T19:40:19.511Z",
        "lastScraped": "2021-07-15T19:40:19.511Z",
        "description": "<div><div><p>Company Overview </p><p>Teledyne Technologies Incorporated specializes in providing a broad range of high technology solutions and products to the marketplace. Teledyne Scientific Company, the central Research Lab of Teledyne Technologies, is a cutting edge R&amp;D organization with more than 50 years of legacy of new technology development and transition. The company has world class laboratories and facilities, and a highly dynamic, multi-disciplinary work environment.</p> Position Summary and Responsibilities <p>Teledyne Scientific Company (TSC) has an immediate opening for a part time (up to 24 hours a week) summer intern position in the Optics group in the Integrated Solutions and Systems Division. </p><p>&nbsp;</p><p><strong>Essential duties</strong>:</p><ul><li>Assist opto-mechanical engineering lead in design, fabrication, rapid prototyping (3D printing) and verification of mechanical components</li><li>Work with the Optics team on optical bench test set up, fixturing, and alignment.</li><li>Create drawings for the machine shop, create bills of material (BOM) for various hardware assemblies.</li><li>Help streamline processes with respect to documentation and organization of laboratory hardware.</li></ul> Qualifications <p><strong>Desired skills, experience, and qualities</strong>: </p><ul><li>Hands on, mechanical design and hardware building skills</li><li>Ability to read and generate CAD drawings</li><li>Basic electronics skills is a plus</li><li>Well organized and detail oriented</li><li>Good communication skills and inquisitive mind</li></ul><p>&nbsp;</p><p><strong>Education: </strong></p><p>Associates degree in engineering, mechanical engineering undergraduate students</p><p>&nbsp;</p><p><strong>Citizenship Requirements</strong></p><p>Due to the type of work at the facility and certain access restrictions, successful applicants must be a U.S. Citizen.</p> Teledyne is an Affirmative Action/Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to <span class=\"long-word\">race,color,religion,religious</span> <span class=\"long-word\">creed,gender,sexual</span> orientation,gender identity,gender <span class=\"long-word\">expression,transgender,pregnancy,marital</span> status,national <span class=\"long-word\">origin,ancestry,citizenship</span> <span class=\"long-word\">status,age,disability,protected</span> Veteran Status,genetics or any other characteristic protected by applicable federal,state,or local law. If you need assistance or an accommodation while seeking employment,please email <span class=\"long-word\">teledynerecruitment@teledyne.com</span> or call (855)479-1480. Determinations on requests for reasonable accommodation will be made on a case-by-case basis. Please note that only those inquiries concerning a request for reasonable accommodation will receive a response.</div></div>",
        "index": 16,
        "skills": [
            "hardware",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "contact": "teledynerecruitment@teledyne.com",
        "remote": false
    },
    {
        "position": "Business Operations Intern",
        "company": "Epsilon Systems Inc",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e82b71094c0cbf13d59305cfccb47344?lvk=ViIKI8pfxs2-eda3MbZfeA.--M65eX6Q77",
        "posted": "2021-07-07T19:40:20.345Z",
        "lastScraped": "2021-07-15T19:40:20.345Z",
        "description": "<div><div><p>Epsilon C5I, <span class=\"long-word\">(www.epsilonsystems.com/c5i),</span> focused on software development and systems engineering for intelligence and combat systems, is seeking a Business Operations Intern to join our San Diego-based team.&nbsp; The primary focus of this internship will be support to our proposal/grant writing team so you must really enjoy writing.</p><p>There is an opportunity for this to be a year-round internship. Applicants must willing and able to work part-time (20+ hours) throughout the work week. Our work hours can be flexible to accommodate for your class schedule.</p><p><strong>Summary:</strong>&nbsp;Unique opportunity to gain insight into multiple facets of business operations and to assist in proposal and technical writing, market analysis and research, proposal management, and operations administration. Reports to Vice President and General Manager, C5I.</p><p><strong>Duties and Responsibilities:</strong></p><ul><li>Participate in the technical proposal lifecycle, including writing, editing, strategic themes, coordination, and production. Create proposal outlines, compliance matrices, and response templates based on the proposal requirements. Assist in the planning, definition, and execution of quantitative assessments of Epsilon Systems markets to include performing data analyses using statistical and database/query software, writing summaries of quantitative analyses, interpreting, and explaining methods and findings, and preparing presentation materials.</li><li>Prepare presentation materials that convey complex content. Basic graphic design required.</li><li>Aid in the identification and capture of new prime contracts that fit corporate vision by managing markets within the business development pipeline. Includes monitoring various resources (contracts, websites, memberships, etc.) to identify new opportunities to pursue.</li><li>Coordinate meetings across multi-organizational proposal teams.</li><li>Aid in the response to Requests for Proposal (RFPs)_, Requests For Information (RFIs), and white papers.</li><li>Elicit information from technical staff and translate the information into written form</li><li>Create and distribute data calls. Coordinate the collection of requested data and compile/analyze the results</li><li>Develop and report project schedules to include developing and maintaining schedules and associated tracking tools (list of actions, assignments, prioritized deadlines, etc.)</li><li>&nbsp;</li><li>Read and understand federal solicitations, contractual agreements, FAR clauses, or other applicable regulations.</li></ul><p><strong>Required Qualifications:</strong></p><ul><li>Pursuing bachelors degree in a humanities, business, or technical field.</li><li>Must have a strong desire to write.</li><li>Must know the difference between active and passive voice, what indefinite adjectives are, and what an Oxford comma is</li><li>Excellent oral and written communication skills.</li><li>Outgoing personality.</li><li>Critical thinking skills.</li><li>Strong work ethic</li><li>Flexibility and organizational skills.</li><li>Able to work well under pressure.</li><li>Ability to build relationships and trust.</li><li>Strong negotiation skills.</li><li>Strong analytical skills</li><li>Strong skills with various Microsoft Office Products including Project, and Adobe. Working knowledge of SharePoint and Salesforce a plus.</li></ul><p><strong>ADA Notations:</strong></p><ul><li>Regular communication <span class=\"long-word\">(hearing/speaking).</span></li><li>Prolonged use of computer <span class=\"long-word\">(typing/keyboarding).</span></li></ul><p>Epsilon Systems Solutions Inc., and its subsidiaries are proud to be Equal Employment Opportunity and Affirmative Action employers, <span class=\"long-word\">Minority/Female/Disabled/Veterans.</span></p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Field Intern",
        "company": "East Bay Regional Park District",
        "location": {
            "city": "Oakland",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0cfc430430aca1829cfed654eac0220a?lvk=lZNYKiPOpl5FY9H0W0qGFA.--M68NbV3YZ",
        "posted": "2021-07-07T19:40:21.181Z",
        "lastScraped": "2021-07-15T19:40:21.181Z",
        "description": "<div><div> The Position <p>The East Bay Regional Park District is a system of beautiful parklands, trails, rolling hills and lakes spanning Alameda and Contra Costa counties. &nbsp;Established in 1934, the Park District is the oldest and largest regional park system in the United States, managing over 122,000 acres of parkland within 73 regional parks, and encompassing over 1,300 miles of trails for hiking, biking, horseback riding, and nature learning.&nbsp;<br><br><strong><strong>What You'll Be Doing as&nbsp;a Field Intern:&nbsp;</strong></strong>As a Field Intern, you have the opportunity to receive hands-on occupational training ideal for those students seeking vocational careers. Under direction of the supervisor, the Field Intern assists with and performs unskilled and semi-skilled maintenance and other tasks on Park District properties and facilities. If you want to work outdoors, learn new skills, and make a real difference in your community, apply to be a Field Intern today!<br><br><strong>Vacancy Situation</strong>: &nbsp;The Park District currently has several vacancies located throughout Alameda and Contra Costa counties. &nbsp;Field Interns may work full-time (40 hours/week) for up to 90 days, or part-time (less than 30 hours/week) if the assignment is longer than 90 days. &nbsp;Maximum internship length is 600 hours.&nbsp;<strong><strong>Positions in this classification often include public contact and therefore bilingual candidates are encouraged to apply</strong>.</strong><br><br><strong>We're Looking For Someone Who</strong>:</p><ul><li>Enjoys being challenged and&nbsp;is self-motivated;</li><li>Enjoys public service;</li><li>Wants to be an integral part of a well-respected and recognized organization that impacts the communities it serves.</li></ul><br><strong>A Few Reasons Why You May Love This Job</strong>: <ul><li>Meaningful and valued work connected to our organizational mission;</li><li>Daily challenges as part of an excellent team;</li><li>Ability to work outdoors in a fast-paced and dynamic work environment.</li></ul><br><strong>Our Values</strong>: <ul><li>Respect:&nbsp;We honor each other, the park users we serve, and the land we steward.</li><li>Resilience: &nbsp;We creatively adapt to change. We address challenges with empathy, perspective, and determination.</li><li>Relationships:&nbsp;Our greatest strength lies in the trust, accountability, and teamwork we cultivate with our colleagues, partners, and the public we serve.</li><li>Responsiveness: We communicate openly, honestly and reliably.</li><li>Transparency: We hold the public's trust through meaningful stakeholder engagement and unfettered access to timely and reliable information on decisions and performance.</li></ul><p></p> Essential Functions <p><br></p><ul><li> As part of an internship program, a Field Intern works on various projects under the direction of and as assigned by the supervisor: </li><li>Assists and performs grounds maintenance tasks;</li><li>Assists and executes the maintenance of trails, trail heads, staging areas and Park District buildings;</li><li>Assists and completes administrative tasks, such as ordering and purchasing supplies;</li><li>Becomes familiar with Park District policies and practices along with the reasoning behind these procedures;</li><li>Gains insight into being an effective decision-maker within the context of projected career goals;</li><li>Develops the ability to use good judgment in situations presented;</li><li>Analyzes situations and facts pertaining to assigned project.</li><li>May assist with directing emergency response vehicles and may assist with communications during emergency situations;</li><li>Performs related duties as assigned.</li></ul><p></p> Minimum Qualifications <p><strong>Education</strong>: &nbsp;Equivalent to the completion of the twelfth grade,&nbsp;and<br><br><strong><strong>Current Educational Status</strong>: &nbsp;Must be enrolled in a Community College or Vocational School,&nbsp;</strong>and<br><br><strong>License</strong>: &nbsp;Must possess a valid California driver's license.&nbsp;</p> Additional Information <p></p> Field Interns must also have the ability to: <ul><li>Frequently lift and/or move up to 60 pounds;</li><li>Communicate effectively both orally and in writing;</li><li>Perform basic mathematical computations;</li><li>Work outside and under adverse working conditions;</li><li>Follow written and oral instructions;</li><li>Operate the use of office equipment, such as a personal computer;</li><li>Establish and maintain positive and cooperative working relationships with those contacted in the course of work at all levels, including a culturally diverse general public, with a focus on quality service to internal and external customers.</li></ul><br><strong>Conditions of Employment</strong>: <ul><li>Field Interns may be required to work unusual hours, weekends, and holidays.</li><li>The individual chosen for hire must be able to pass a Level 1 background check, which includes:&nbsp;Department of Justice fingerprinting and criminal history review.</li></ul><br><strong>Application materials for this position consist of&nbsp;</strong> <strong>two (2)&nbsp;</strong> <strong>required parts</strong>: <ol><li>A current East Bay Regional Park District application submitted online, and</li><li>Completed supplemental questions. <strong>Note: Question #10 asks for work location preference(s).&nbsp;</strong><strong>You may view an accompanying map by clicking here</strong><strong>.</strong></li></ol><br><strong>Notification</strong>: All applicants will be notified of the disposition of their application via email, generally within two to three weeks after applying. You may also sign into your GovernmentJobs.com account to view your current application status and notifications. <strong>&nbsp;</strong><br><br><strong>Selection Process</strong>: Application materials for all applicants meeting the minimum qualifications will be reviewed by a screening panel to select the best qualified for testing and/or interview. Human Resources will establish an eligible list as a result of this exam and candidates on the list are eligible for referral to the hiring supervisors for interviews and possible selection. <strong>Possession of minimum qualifications does not guarantee an invitation to test and/or interview.</strong> Pursuant to the Federal Immigration and Reform Act of 1986, all applicants who are hired will be required to provide proof of identity and appropriate work authorization documents prior to commencement of employment. <br><br><strong>Background Check</strong>: The individuals chosen for hire must be able to pass a background check, including fingerprint check prior to employment. <br><br><strong>Special Testing Arrangements</strong>: If you require special arrangements due to a verified disability or medical condition, please contact the Human Resources Department at 510-544-2154. &nbsp; &nbsp; <strong>Tentative Hiring Timeline</strong>: <br>5:00 p.m. Friday, July 23, 2021: &nbsp;Deadline to apply online <br>Late July-Early August: &nbsp;Interviews with hiring departments <br><br><strong>Equal Opportunity Employer</strong>: <br><em>The East Bay Regional Park District, as an equal employment opportunity employer, encourages applicants from diverse backgrounds to apply.</em><br><p></p></div></div>",
        "index": 18,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "due": "2021-07-23T10:00:00.000Z",
        "contact": "510-544-2154",
        "remote": false
    },
    {
        "position": "Casework Intern",
        "company": "International Rescue Committee",
        "location": {
            "city": "Salt Lake City",
            "state": "Utah",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/457e584bcbc65f9cc3874de83f06e11d?lvk=YOl8VCnxeRlb5-2GYUebJg.--M67om39og",
        "posted": null,
        "lastScraped": "2021-07-15T19:40:21.910Z",
        "description": "<div><div><p><strong>Requisition ID:</strong> req18784</p><p><strong>Job Title:&nbsp;</strong>Casework Intern</p><p><strong>Sector:&nbsp;</strong>Social Work</p><p><strong>Employment Category:</strong>&nbsp;Intern</p><p><strong>Employment Type:</strong>&nbsp;Part-Time</p><p><strong>Open to Expatriates:</strong>&nbsp;No<br><strong></strong></p><p><strong>Location:</strong>&nbsp;Salt Lake City, UT USA<br></p><p><strong>Job Description</strong></p><p></p><p><b>BACKGROUND:</b> Founded in 1933, the International Rescue Committee is a leading, non-sectarian, non-profit organization providing emergency relief, protection, rehabilitation assistance, resettlement services, and advocacy for refugees and victims of oppression or violent conflict.&nbsp; Domestically, our 26 offices across the U.S. ensure new arrivals have food, shelter, and clothing, and work with refugees to help them gain self-sufficiency. The resettlement office in Salt Lake City provides services to newly arrived refugees.</p><p>The <b>case management program</b> includes providing core services to new arrivals, and helping clients work towards self-sufficiency during their first two years in the U.S. in the areas of health, employment, finances, public benefits, education, housing, family, and community. Casework interns work closely with the casework supervisors and caseworkers throughout their internship, assisting and learning about all aspects of the resettlement program.</p><p><b>SCOPE OF INTERN WORK:</b> Under the supervision of the resettlement manager and the casework supervisors, the casework Intern will play a central role in assisting the casework team with providing core services and extended case management services to newly arrived refugees.This position reports to Resettlement Manager.</p><p><b>COMMITMENT:</b> 4-6 months starting in May 2021, 15-37.5 hours per week in 4+ hour blocks</p><p>&nbsp;</p><p><b>RESPONSIBILITIES: </b></p><p> Assist caseworkers with new arrival services: airport pickup, home safety orientation, grocery shopping, apply for social security card, apply for benefits at DWS, activate EBT card, lease signing, setting up utilities, office intake, furniture delivery, bus orientations, paying bills, home safety &amp; cleaning orientation, bus and community orientations, ESL &amp; public school enrollment, cultural orientation, housing applications, transportation to appointments</p><p> Assist caseworkers with needs assessment and action plans, home visits</p><p> Assist caseworkers with referral and connection to community services</p><p> Assist caseworkers with case files, case notes, data entry, </p><p> Participate in case staffing and staff meetings</p><p>&nbsp;<b>LEARNING OBJECTIVES:</b></p><p>1. The intern will deepen understanding of refugee resettlement process in SLC</p><p>2. The intern will gain professional experience working with clients from diverse cultural background and providing case management services</p> 3. The intern will learn about community resources available<br><br><p></p><p><strong>Qualifications</strong></p><p></p><p><b>REQUIREMENTS: </b></p><p> Currently enrolled in an accredited university. BSW/MSW encouraged.</p><p> Experience working with refugees/diverse populations</p><p> Motivated, flexible and ability to work independently, prioritize, and manage time effectively</p><p> Strong computer skills with proficiency in Microsoft Office (Word, Excel, and Outlook)</p><p> Demonstrated ability to communicate and work as a team member in a cross-cultural environment</p><p> Ability to work fully in person when needed and comfortable working with clients (with all COVID-19 safety &amp; precautions in place)<br><br></p><p><b>This is an unpaid internship position. No financial compensation, including compensation for relocation, is available.</b></p><p></p><p><br></p><p>&nbsp;</p></div></div>",
        "index": 19,
        "skills": [
            "machine learning",
            "project management"
        ],
        "compensation": "unpaid",
        "start": "2021-05-01T10:00:00.000Z",
        "due": "2021-05-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Technical Intern 2",
        "company": "BAE Systems USA",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3fc455fd8938b02af256c64d6026a922?lvk=SCT2CrLWxbydxZG2b-mDqw.--M64HRDO83",
        "posted": "2021-07-07T19:40:22.745Z",
        "lastScraped": "2021-07-15T19:40:22.745Z",
        "description": "<div><div><p>Job Title: Technical Intern 2 <br>Recruiter: Madeline Wren <br>Job Description: How does it feel to work on a team driven to make a big impact? Empowering. We believe your career should always be growing. And that's exactly what it will do at BAE Systems. You'll hit the ground running with a company truly committed to your growth as you enjoy a special camaraderie on a team dedicated to protecting what really matters. Build your future at BAE Systems.<br>&nbsp;<br>As an intern you will participate in our nationwide Internship &amp; Co-Op Program, LEAP, where you will have the opportunity to Learn, Engage, Apply, and Progress within the company. You will also have access to additional benefits such as, networking with BAE Systems employees and other students, participating in exciting real world projects, joining exclusive informational sessions with senior leaders, and expanding mentorship opportunities and career development.<br><br>In this position, you will be supporting the Ship Repair (SR) business&nbsp;at our San Diego, CA facility. This position will be onsite at our San Diego facility and will be full time for the remainder of summer, and part time in the fall. Relocation will not be offered, housing is not provided.<br><br>BAE&nbsp;Systems&nbsp;San&nbsp;Diego&nbsp;Ship Repair&nbsp;is&nbsp;seeking&nbsp;a&nbsp;Mechanical Engineering Intern or Co-Op for&nbsp;its&nbsp;17,500-ton&nbsp;floating&nbsp;steel&nbsp;dry-dock&nbsp;Pride&nbsp;of San&nbsp;Diego (POSD) and 55,000-ton floating steel dry-dock Pride of California (POCA).&nbsp;<br><br><strong>As a Dry Dock Mechanical Engineering Intern, you will:&nbsp;</strong></p><ul><li>Work under&nbsp;direction&nbsp;of&nbsp;Dockmaster</li><li>Supervise&nbsp;and schedule&nbsp;tasks&nbsp;and&nbsp;work&nbsp;items&nbsp;for other&nbsp;dock&nbsp;mechanics to&nbsp;complete</li><li>Assist with, create and maintain&nbsp;preventative&nbsp;and&nbsp;corrective&nbsp;maintenance&nbsp;files on POSD/POCA</li><li>Operate&nbsp;diesel&nbsp;generators&nbsp;and&nbsp;paralleling&nbsp;switchboards&nbsp;on&nbsp;POSD/POCA</li><li>Inspect,&nbsp;service,&nbsp;and&nbsp;maintain&nbsp;POSD/POCA&nbsp;mooring&nbsp;grippers</li><li>Possess&nbsp;and&nbsp;maintain&nbsp;all&nbsp;appropriate&nbsp;BAE&nbsp;safety&nbsp;and&nbsp;environmental&nbsp;certifications</li><li>Hook&nbsp;up and&nbsp;disconnect&nbsp;dock and&nbsp;ships&nbsp;temporary&nbsp;services&nbsp;in POSD/POCA</li><li>Assist&nbsp;Dockmaster&nbsp;in&nbsp;creating&nbsp;docking&nbsp;and&nbsp;undocking&nbsp;schedules&nbsp;for POSD/POCA</li><li>Attend&nbsp;docking&nbsp;and&nbsp;undocking&nbsp;conferences&nbsp;with&nbsp;Dockmaster</li><li>Assist Dockmaster&nbsp;in&nbsp;preparing&nbsp;ship&nbsp;for&nbsp;dry-docking&nbsp;and&nbsp;undocking</li><li>Work&nbsp;unsupervised&nbsp;on a daily basis trouble shooting and repairing mechanical, piping, and electrical systems</li></ul><br>Auto req ID: 69768BR <br>State/Province: California <br>Clearance Level - Must be able to obtain for position: None <br>Shift: 1st Shift <br>Business Area: Ship Repair <br>City: San Diego <br>Advertising Title: Dry Dock Mechanical Engineering Intern - Fall 2021 <br>Required Skills and Education: <ul><li>Currently enrolled in a Bachelor's Degree program pursuing&nbsp; a degree in Mechanical, Electrical, Structural&nbsp;Engineering, or related field</li><li>Strong computer&nbsp;skills&nbsp;in&nbsp;Microsoft&nbsp;Office</li></ul><br>About BAE Systems Platforms &amp; Services Posting: BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it's what we do at BAE Systems. Working here means using your passion and ingenuity where it counts - defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team-making a big impact on a global scale. At BAE Systems, you'll find a rewarding career that truly makes a difference.<br><br>The Platforms &amp; Services (P&amp;S) sector under BAE Systems, Inc does the big stuff: the armored combat vehicles, naval guns, missile launchers, and naval ship repair...just to name a few. Our employees take pride in the work they do and why they do it. They are on the front lines every day, building our products to protect the lives of those who serve. We may be biased, but we think P&amp;S does some of the coolest work around, and we think you will too.<br><br>At BAE Systems, we celebrate the array of skills, experiences, and perspectives our employees bring to the table. For us, differences are a source of strength. We're laser-focused on high performance, and we work hard every day to nurture an inclusive culture where all employees can innovate and thrive. Here, you will not only build your career, but you will also enjoy work-life balance, uncover new experiences, and collaborate with passionate colleagues. <br>Company: 252_BAE Systems San Diego Ship Rep <br>Postal Code: 92170-3308 <br>Regular or Temporary: Temporary <br>Posting Requirements: Internal/External <br>Department: 252209_Facilities <br>Country: United States <br>Job Family: Intern/Co-op <br>Preferred Skills and Education: <ul><li>Knowledge&nbsp;of safe&nbsp;rigging&nbsp;practices</li><li>Interpret&nbsp;blueprints,&nbsp;schematic&nbsp;drawings,&nbsp;and&nbsp;dock&nbsp;layouts</li><li>General&nbsp;understanding&nbsp;of&nbsp;marine&nbsp;terminology</li></ul><br>Travel Percentage: &lt;10% <br>EEO Career Site: Equal Opportunity Employer. Minorities . females . veterans . individuals with disabilities . sexual orientation . gender identity . gender expression <br>ITAR: U.S. Citizen or Green Card Required: Yes <br>Typical Education and Experience: . <br>Job Category: Engineering &amp; Technology <br></div></div>",
        "index": 20,
        "skills": [
            "information technology",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer",
        "company": "Amentum",
        "location": {
            "city": "Richland",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/382b0c01b81cd5953004253b017271e6?lvk=8wWA14150HQqXhe01Fh1KQ.--M68_ejnyg",
        "posted": "2021-06-25T19:40:23.545Z",
        "lastScraped": "2021-07-15T19:40:23.545Z",
        "description": "<div><div><p>Title Software Engineer</p><p> Position Number 34997</p><p> Company WA River Protection Solutions</p><p> City/State Richland, WA</p><p> Location Richland, WA</p><p> Posted 07/12/2021</p><p> Closes 07/19/2021</p><p> Regular/Temporary Regular</p><p> Full/Part-Time Full-Time</p><p></p><p> Job <span class=\"long-word\">Responsibilities/Duties</span> Washington River Protection Solutions (WRPS) seeks a Software Engineer to join the Software Projects &amp; Engineering Support group. The Engineer will support routine software &amp; database maintenance activities, troubleshooting, modifications, procedure reviews, as defined in TFC-PLN-03 and as assigned by manager. The software products being developed and maintained are management information systems that are web-based, C# applications developed using the MVC or MVVM framework. Duties include development of software integration, design inputs and requirements, architecture and overall look and feel of productivity tools, software design, development, testing using current software, database technology and platform, also provide software quality assurance &amp; maintenance support. Act as Technical Lead, guiding overall software design and direction of development to meet software requirements. May direct other engineers and junior engineers.</p><p>The Engineers responsibilities will include but are not limited to the following: * Accountable for safety based on the principals of no injuries to anyone; * Set challenging goals for personal and group accomplishments; * Set high standards of performance for self and others; * Develop and sustain productive customer relationships; * Ensure requirements meet software quality standards; * Perform software design, development, and testing; * Maintain cognizance of any changes to assigned software applications and database; * Review and approve new or changes to operating or maintenance procedures; * Review software applications, and establish testing requirements; * Perform software quality and configuration management activities; * Perform software and database operability evaluations, in support of daily activities; * Perform process software and database modification to include server application, system hardware and software development and testing; * Implement software configuration management program; * Implement process system computer security (as required); * Manage database configuration and coordinate creation of databases on development, test, and production servers; * Support manager in <span class=\"long-word\">technical/technological</span> decision-making; * Perform routine administrative activities/duties on time (routine training, safety meetings, TIS, continuing training, staff meetings); and * Perform other duties as assigned.</p><p>Required Qualifications Bachelor's Degree (BS) in Computer Science, Software Engineering, Computer Engineering, <span class=\"long-word\">Electrical/Electronics</span> Engineering or related technical discipline; and Five (5) years of related technical experience.</p><p>Desired Qualifications * Satisfactory knowledge of <span class=\"long-word\">technical/professional</span> skills in current development and trends, including MVC, MVVM, and Angular. * Must be familiar with server and network architecture including modification to software <span class=\"long-word\">application/database</span> and hardware/software development and testing systems. * Experience with GIS, BIS, or AR/VR is a plus.</p><p></p><p>Relocation Funding Provided Yes</p><p> U.S. Citizenship Required Yes</p><p> Clearance Required No</p><p> Job Classification Exempt</p><p> Shift Work Required No</p><p></p><p></p><p></p><p> This contractor shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, sexual orientation, gender identity, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability.</p><p>EEO It's the Law Poster</p><p>Applicants and employees are protected under federal law against discrimination. To view information regarding these rights, please click on these links:</p><p> + EEO is the Law Poster <span class=\"long-word\">(http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf)</span></p><p> + EEO is the Law Poster Supplement</p><p>+ Pay Transparency Policy Statement <span class=\"long-word\">(https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay</span>-<span class=\"long-word\">transp\\_English\\_unformattedESQA508c.pdf)</span></p><p></p><p></p><p></p><p></p><p></p></div></div>",
        "index": 21,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "angular",
            "hardware",
            "networks",
            "c and c++"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern: Software Engineering",
        "company": "ArcSight",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9121d8e8b66a1f9e58bee7e5cbfc2b51?lvk=lcQ7-4Q5lzmhXtWDHexcOw.--M63G2btDk",
        "posted": "2021-07-13T19:40:24.295Z",
        "lastScraped": "2021-07-15T19:40:24.295Z",
        "description": "<div><div><p>Intern: Software Engineering</p><p>&nbsp;&nbsp;</p><p><b>Job Description:</b></p><p>&nbsp;&nbsp;&nbsp;</p><p>Micro Focus is seeking a talented, strong, and motivated Software Engineer Intern to work on access governance and identity reporting software. We are looking for an individual with the right blend of skills, education, experience, and attitude to fill this position.</p><p></p><p>The successful candidate will have understanding and experience working with SQL. This individual will also demonstrate the ability to succeed with minimal supervision, and have the ability to think outside the box. This position will interact with other development, testing, and documentation teams to deliver software products.</p><p></p><p><b>The Work:</b></p><ul><li>Design, develop, test, and maintain identity and access reports</li><li>Work with software development, quality engineering, and documentation teams to design and implement features and capabilities</li><li>Create and execute test cases</li><li>Automation</li><li>Review and provide input for product documentation</li><li>Research and solve customer issues</li><li>Design and implement features and associated use cases using Agile methodologies</li></ul><p></p><p><b>Required Skills:</b></p><ul><li>Pursuing Bachelor's degree in Computer Science or Software Engineering</li><li>Programming experience in SQL and JavaScript</li><li>Excellent oral and written communication skills</li><li>Ability to work independently as well as on a team</li><li>Ability to quickly learn new technologies</li><li>Excellent organizational and time management skills</li><li>Possess a positive attitude and is a self-starter</li><li>Good problem solver, ability to identify key issues and barriers to success and to proactively resolve them</li><li>Ability to document technical processes</li><li>Detail oriented</li></ul><p></p><p><b>Desired Skills:</b></p><ul><li>Oracle</li><li>C#</li><li>Java</li><li>automation scripts</li></ul><p><b>Job:</b></p>Administration<p>&nbsp;&nbsp;&nbsp;&nbsp;</p><p><b>Micro Focus is proud to be an &nbsp;Equal Opportunity Employer.&nbsp; Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</b></p><p>&nbsp;&nbsp;&nbsp;</p><p></p><p></p></div></div>",
        "index": 22,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "javascript",
            "java",
            "c and c++",
            "machine learning",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]