[
    {
        "position": "Internship (Alaska's People)",
        "company": "Cook Inlet Tribal Council, Inc.",
        "location": {
            "city": "Anchorage",
            "state": "Alaska",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6be90c392ed1b89fca6c1b138de23f6e?lvk=CB_sLF3BbWxj0Cwcnqu7FQ.--M7BKwVeGc",
        "posted": "2021-07-24T07:32:37.562Z",
        "lastScraped": "2021-07-29T07:32:37.562Z",
        "description": "<div><div> &nbsp; <div><div><div><p>Cook Inlet Tribal Council Internship Program for qualified Alaska Native and American Indian students</p><p>Cook Inlet Tribal Council's (CITC's) Internship Partner Program strives to align with our overarching mission of working with Alaska Native and American Indian people to develop educational opportunities that fulfill our endless potential. CITC seeks to deepen our relationship with our people and provide valuable work experience in a variety of fields of study for our future leaders. In alignment with our community partners, CITC proudly offers a 12-week paid temporary internship program for qualified Alaska Native and American Indian students. This program will provide college students with real life work experience and the opportunity to apply their education in a professional work environment, bridging the gap between students to working professionals.</p><p>Cook Inlet Tribal Council, Inc. (CITC) seeks highly motivated individuals currently enrolled as a full or part-time college student, or recently graduated from an <span class=\"long-word\">undergraduate/graduate</span> degree program/technical school in a related degree field.</p><p><br></p><p>Accounting / Finance / Economics / Business Mgmt.&nbsp;</p><p>Social Work / Sociology / Psychology / Nursing&nbsp;</p><p>Information Technology / Computer Science&nbsp;</p><p>Communications / Journalism / Marketing</p><p>Engineering / ANSEP Participants (Fab Lab)&nbsp;</p><p>Trans Alaska Pipeline System (TAPS) Industries&nbsp;</p><p>Construction / Project Management</p><p>Specifically, CITC recruits individuals seeking a future career-specific pathway to participate in a paid internship program for a 12 week term. Internship positions are available in Anchorage. Selected interns are responsible for providing their own transportation between their hometown/state and the internship work location. For example, if you attend the Mat-Su College and accept an internship in Anchorage, you are responsible for your own transportation to Anchorage.</p><p><strong>ELIGIBILITY</strong></p><p>Internship applicants must be eligible and qualified Alaska Native or American Indian pursuant to P.L. 93-638 Indian Self Determination Act. Alaska Native/American Indian CIRI shareholders and descendants are strongly encouraged to apply.</p><p><strong>PRE-EMPLOYMENT BACKGROUND CHECK INFORMATION</strong></p><p>As indicated on CITC's employment website, employment with CITC is contingent upon successfully passing a background investigation.</p><p>Application packets are available on the CITC Career Center:&nbsp;</p><p><span class=\"long-word\">https://citci.org/citc</span>-careers/&nbsp;</p><p>Click on the Intern position to view the attached application.</p><p><strong>Please submit application packets and email questions to&nbsp;</strong><strong><span class=\"long-word\">alaskaspeople@citci.org</span></strong><strong>&nbsp;or call (907) 793-3467.</strong></p></div></div></div></div></div>",
        "index": 1,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Internal Sales Engineering Internship",
        "company": "Nord Gear Corporation",
        "location": {
            "city": "Waunakee",
            "state": "Wisconsin",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0328efd365b85216fdb53e478a9e47aa?lvk=4HHYxpXunVpjbiGZvts9Dw.--M724uuXSR",
        "posted": "2021-07-23T07:32:48.459Z",
        "lastScraped": "2021-07-29T07:32:48.459Z",
        "description": "<div><div><p><b>Position:</b>&nbsp;&nbsp;Internal Sales Engineering Internship</p><p><b>Location:</b>&nbsp;Waunakee, WI</p><p>The Waunakee, WI location of Nord Gear Corporation is currently looking for Internal Sales Engineering Interns to join our team! We are looking for students who can work full-time during their summer/winter breaks and part-time throughout the school year. The ideal candidates will be working towards earning a bachelor's degree in an Engineering related field of study. This is a paid internship opportunity! There may be potential to be hired on full-time after graduation as an Internal Sales Engineer! </p><p><b>Job Summary:</b></p><p>This position is responsible for receiving, processing, and confirming customer orders and supporting customer-related sales activity. It will also require customer or production contact to clarify orders, so our customers receive the correct product.</p><p><b>Essential Duties and Responsibilities:</b></p><ul><li>Enter orders into the manufacturing system (SAP)</li><li>Contact customers for information about purchase orders</li><li>Work with drafting on order information</li><li>File and maintain paperwork associated with each order</li><li>Assist the internal sales team by working on quotes from the quotes queue.</li><li>Assist the internal sales team by taking customer phone calls (in backup capacity).</li><li>Assist with any special projects as assigned</li></ul><p><b>Job Requirements:</b></p><ul><li>Working towards earning an Engineering degree</li><li>Strong computer skills; Experience working with SAP is preferred</li><li>Excellent phone skills, great attention to detail, and strong communication skills</li><li>Prior experience working in a manufacturing type environment is preferred</li><li>Must be able to work a minimum of 12 hours per week during the school year (Flexible hours) and full-time during summer &amp; winter breaks.</li></ul></div></div>",
        "index": 2,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Clinical Supervisor - Mental Health",
        "company": "Community Research Foundation",
        "location": {
            "city": "Oceanside",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/community-research-foundation-fd0c2678/clinical-supervisor-mental-health-bec38542?lvk=Yy-PFI7q6A1gRfDU3q9CLw.--M7A97X6SR",
        "posted": null,
        "lastScraped": "2021-07-29T07:33:01.160Z",
        "description": "<div><p><strong>Clinical Supervisor (4723)</strong> (Regular Part-Time, Hourly)<br><strong>Program/Location:</strong> Turning Point Crisis Center (Oceanside)</p><p><strong>Clinical Supervisor – Mental Health Services for Transitional Residential Program</strong></p><p><strong>Hours</strong>: 18 hours per week; schedule is flexible and will be determined with program management. Some remote work may be available.</p><p><strong>Community Research Foundation (CRF) inspires and mentors the next generation of mental health professionals!</strong></p><p>At CRF, we are constantly evolving and developing fresh approaches to meet the needs of San Diego County’s residents who are experiencing mental/behavioral health challenges. You will work within a collaborative, supportive team structure so that you can provide fresh perspective and training to our students and staff.</p><p>You will be involved in helping people change their lives for the better! We have strong internal advancement options, so there are opportunities for you to grow within our company.</p><p></p><p><strong>Where will I work?</strong><br><br>Located in Oceanside, CA, Turning Point Crisis Center is a Short Term Acute Residential Treatment (START) program provides intensive, community-based crisis residential services for adults throughout San Diego County. We deliver a unique alternative to psychiatric hospitalization to clients who are experiencing a psychiatric crisis of such magnitude so as not to be manageable on an outpatient basis. Our services are provided in a home-like environment that specializes in the psychosocial rehabilitation of each individual.</p><p>Built around a bio-psychosocial approach, our multi-disciplinary team addresses each aspect of a client's unique situation, including mental health, co-occurring substance abuse, housing, medical/medication needs, and establishing connections to social service supports within the community to facilitate successful transition beyond the START program.</p><p><strong>Typical Duties of a Clinical Supervisor: </strong>You're a key part of our <span class=\"long-word\">mentoring/consulting</span> team for our interns and practicum students, including:</p><ul><li>Provides individual and group supervision of interns and practicum students from various local college programs</li><li>Follows Professional Board requirements and educational institution contracts and requirements</li><li>Participates in utilization management</li><li>Reviews and co-sign clinical records</li><li>Is available for on-call clinical consultation</li></ul><p><strong>Required Skills and Qualifications:</strong></p><ul><li>Current and valid license to practice as a LCSW, LMFT, LPCC, or PsyD/PhD in California and must be kept current during length of employment</li><li>Experience working with the severe and persistent mentally ill population and with adults/older adults is required; experience with co-occurring disorders also strongly preferred</li><li>Eligible to provide clinical supervision per Board of Behavioral Sciences criteria</li><li>Previous supervisory experience is preferred</li><li>Basic computer skills are required; proficiency in MS Office applications required</li><li>Ability to thrive in a fast-paced environment is essential</li><li>Ability to pass <span class=\"long-word\">criminal/background</span> clearance</li></ul><p>Be a part of our vibrant non-profit organization and make a difference in the lives of the people we serve!</p><p></p><p><strong>We are an Equal Opportunity Employer</strong></p></div>",
        "index": 3,
        "skills": [
            "project management"
        ],
        "remote": true
    },
    {
        "position": "Clinical Laboratory Scientist - Clinical Laboratory *$5,000 Sign-On Bonus*",
        "company": "St. Jude Medical Center - St. Joseph Health",
        "location": {
            "city": "Fullerton",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a009304d544271dd36c1128de52ec31c?lvk=cTt-PGSkjTq7uch1_6bUSg.--M7DnduPXo",
        "posted": "2021-07-28T07:33:01.938Z",
        "lastScraped": "2021-07-29T07:33:01.938Z",
        "description": "<div><div><strong>We are looking for a Clinical Laboratory Scientist for the Clinical Laboratory Department&nbsp;at St. Jude Medical Center&nbsp;*$5,000 Sign-On Bonus* .</strong> &nbsp; Location: Fullerton, CA Work Schedule: Part Time - 40 Biweekly Hours Shift: 8-hour, Evenings <p>Apply Today!&nbsp; Applicants that meet qualifications will receive a text with some additional questions from our Modern Hire system.</p><strong>Job Summary:</strong><br> Under the direction of the Laboratory Supervisor, the clinical Laboratory Scientist uses professional knowledge and judgment to perform technical, analytical, clerical and quality assurance functions within laboratory department section(s) as assigned. &nbsp; <strong>Essential Functions:</strong><ul><li> Performs various chemical, microscopic, morphologic, microbiological and other tests as assigned, independently, and in accordance with established procedures and policies. </li><li> Evaluates the validity of results obtained; accurately records and reports results. </li><li> Performs quality control, standardization curves, calibration, and equipment maintenance procedures as directed; recognizes and reports problems and documents corrective action. </li><li> Responsible for the completion of all procedures scheduled during the work shift, and for maintaining a clean, neat and organized work area. </li><li> Performs various technical and clerical tasks related to receiving, processing, and/or obtaining specimens for laboratory analysis, taking into consideration the age specific needs of the patient, as required. </li><li> Demonstrates the ability to effectively use all computer equipment, programs, and instrument interfaces related to operating functions in the division. </li><li> Follows various federal and state laws, regulations, and <span class=\"long-word\">hospital/department</span> guidelines with respect to licensure, safety, universal precautions, fire and emergency procedures, dress code, attendance, time cards and all other personnel policies. </li><li> Participates in the Continuous Quality Improvement and Quality Assurance programs of the laboratory section(s) assigned and attends department meetings as directed. </li><li> Maintains necessary records and prepares various reports, as requested. </li><li> Keeps abreast of advances in the field of Medical Technology and attends continuing education programs as appropriate. </li></ul> &nbsp; <strong>Skills</strong>: <ul><li> Basic computer keyboard data skills. </li></ul> &nbsp; <strong>Minimum Position Qualifications:</strong> <strong>Education:</strong><ul><li> Bachelor's Degree </li><li> <span class=\"long-word\">Coursework/Training</span> - Completion of 1 year approved internship program in Medical Technology </li></ul><strong>Licenses and Certifications:</strong>&nbsp;Valid California Clinical Laboratory Science license. &nbsp; <strong>Preferred Position Qualifications:</strong> <strong>Experience</strong>: 3 years of experience in multiple laboratory science disciplines as licensed CLS/MT in acute care facility &nbsp; &nbsp; <p>St. Jude Medical Center is a faith-based, non-profit, 384-bed, tertiary care facility, and is one of Southern California's most-respected and technologically-advanced hospitals. With nearly 700 of the area's finest physicians on staff, St. Jude offers nearly every medical specialty and sub-specialty. &nbsp;Whether for the birth of a baby, life-saving surgery or a routine mammogram, St. Jude continues to set the standard for medical care and offers the community the most comprehensive array of services and programs.<br><br> St. Jude Medical Center provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, St. Jude Medical Center complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br><br> Positions specified as \"on call/per diem\" refers to employment consisting of shifts scheduled on as \"as needed basis\" to fill in for staff vacancies.</p></div></div>",
        "index": 4,
        "skills": [
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Technical Intern 3 - Data Analyst",
        "company": "BAE Systems",
        "location": {
            "city": "Roy",
            "state": "Utah",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b208e5b55e9619a6a5bd95b8d5bc4399?lvk=uBO0LeDaNh2zZc2h_E91Jg.--M7EI9Jd23",
        "posted": "2021-07-26T07:33:02.655Z",
        "lastScraped": "2021-07-29T07:33:02.655Z",
        "description": "<div><div><br><b>Job Description </b><br><p>BAE Systems is looking for a motivated, challenge seeking, and positive minded individual to assist in the application of data analytics to global supply chain data. The ideal candidate will perform data mining, interpretation, and reporting of analytical insights. Outputs of this effort will help inform decision making to reduce supply chain risk and minimize the impact of adverse events.<br><br>Tasking may include:</p><ul><li><p>Review of several disparate data sources</p></li><li><p>Identification of key factors and indicators for analysis</p></li><li><p>Implementation of analytic approaches to inform decision making</p></li><li><p>Definition of repeatable methods and processes</p></li><li><p>Validation of heuristic and learning approaches</p></li><li><p>Documentation of proven processes</p></li></ul><p><br>Our Intern Program offers current college students hands-on experience and development opportunities in technology, engineering, intelligence, and business.<br><br>In addition to on-the-job training, the Internship Program offers:</p><ul><li><p>Competitive Pay</p></li><li><p>Opportunity for Future Employment</p></li><li><p>Challenging and Meaningful Work</p></li><li><p>Networking and Development Opportunities</p></li></ul><br><br><b>Required Education, Experience, &amp; Skills </b><br><ul><li><p>Coursework in Data Analysis, Political Science, and Supply Chain Management</p></li><li><p>Prefer experience in Engineering, Physics, Computer Science or Logistics</p></li><li><p>Familiarity with analytic tools such as Python, R, Tableau or similar</p></li><li><p>Strong MS Office skills in Word, Excel and PowerPoint</p></li><li><p>Strong critical thinking and attention to detail</p></li><li><p>Effective documentation and presentation skills</p></li><li><p>Strong work ethic as an individual and team member, time management skills</p></li><li><p>Eligible for Government Clearance</p></li></ul><br><br><b>About BAE Systems Intelligence &amp; Security </b><br>BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it's what we do at BAE Systems. Working here means using your passion and ingenuity where it counts - defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team-making a big impact on a global scale. At BAE Systems, you'll find a rewarding career that truly makes a difference.<br><br>Intelligence &amp; Security (I&amp;S), based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we do-from intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. <br><br>At BAE Systems, we celebrate the array of skills, experiences, and perspectives our employees bring to the table. For us, differences are a source of strength. We're laser-focused on high performance, and we work hard every day to nurture an inclusive culture where all employees can innovate and thrive. Here, you will not only build your career, but you will also enjoy work-life balance, uncover new experiences, and collaborate with passionate colleagues. Employment Type: Part-Time</div></div>",
        "index": 5,
        "skills": [
            "information technology",
            "networks",
            "python",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Feature FX Intern (Virtual), DreamWorks, Fall 2021",
        "company": "NBC Universal, Inc.",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c369e2ab9d635faa0f08b5a48a4ad6ae?lvk=CAFyfHtjVsUsWQrKjK-wFQ.--M6jcgaS-c",
        "posted": "2021-07-21T07:33:03.439Z",
        "lastScraped": "2021-07-29T07:33:03.439Z",
        "description": "<div><div><p>Job Title: Feature FX Intern (Virtual), DreamWorks, Fall 2021 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: DreamWorks Animation seeks a Feature FX Intern for our virtual Internship Program! This Intern will be assigned to a feature film and gain insight into production responsibilities, workflows, and processes.<br><br><b>Day in the Life:</b><br>The Feature FX intern will be responsible for various activities under the direction of the FX Team and will have the opportunity to attend and contribute to FX team meetings. Ideal candidates will be willing to take on new challenges to gain more detailed knowledge of the animation industry, feature animation pipeline, and workflows.<br><br>Candidates should understand the basics of designing and creating images, elements, and effects (such as fire, smoke, water, destruction, magic, etc.) for CG. Additionally, candidates should be comfortable multitasking, working independently on assignments, discern priorities, and hit deadlines. Strong communication skills, the ability to interact professionally with others, and being respectful and punctual in meetings are necessary for a successful candidate.<br><br><b>Submission Requirements:</b></p><div>Upload Resume and Cover Letter </div><div>Include Link to Demo Reel/Breakdown on your resume (include password if protected)</div><br>Job Number: 62240BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation Internships <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Enrolled in an Undergraduate or Graduate program at a College/University (or equivalent), or be a recent graduate (within six months of graduation date).<br>Must be 18 years of age or older.<br>Must be authorized to work in the United States without visa sponsorship.<br>Ability to commit ten weeks part-time (16-24 hours/week) and work remotely from September 2021 - December 2021<br>Must be able to provide equipment (PC, webcam, headphones, etc.) and have a stable internet connection in order to remotely connect to DreamWorks workstations via remote software.<br>Working knowledge of animation principles.<br>Understanding of software like Houdini, Nuke, or similar 3D packages for use in particle systems, fluid simulation, rigid bodies, procedural geometry, and compositing.<br>Ability to self-critique creative work, address notes, and expand upon the art direction given.<br>Candidates should be well-organized, highly self-motivated individuals who function well in fast-paced production environments. <br>Desired Characteristics: Education in <span class=\"long-word\">animation/graphics/computer</span> science/VFX (or equivalent) program; traditional artistic training a plus.<br>Adobe Animate or Toon Boom knowledge is a plus.<br>Working knowledge of Shotgrid is a plus.<br>Experience in scripting and or programming is a plus. <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></div></div>",
        "index": 6,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Career Training Program (CTP) - Manufacturing Operations Leadership",
        "company": "Kroger",
        "location": {
            "city": "Portland",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c5b5b025506d193faa9d03003ed6a80a?lvk=m-GjUdaGLwhbTR2w8tcktQ.--M7BdV_h5g",
        "posted": "2021-07-21T07:33:04.489Z",
        "lastScraped": "2021-07-29T07:33:04.489Z",
        "description": "<div><div><p><b>Company Name:</b>Swan Island Dairy<br><b>Position Type:</b>Employee<br><b>FLSA Status:</b>Non-Exempt<br></p><p>Are you ready to drive efficiency and sustainability, improve operations, and fuel our growth in the U.S.?We're looking for people who are resourceful - true problem solvers who challenge themselves to find the most effective and efficient solutions to complex challenges to join our Operations Career Training Program (CTP). This program is an exciting avenue to gain experience in manufacturing operations, quality control, supply chain, and engineering, in preparation for future leadership roles with us.</p><p></p><p>In this program, you'll experience cross-functional rotations designed to give you a solid foundation and on-the-job experience to enhance your understanding of critical business operations. </p><p></p><p>You will learn from Kroger leaders, hear from industry experts, and roll up your sleeves experiencing all functions of the company. You will engage in challenging and dynamic experiences throughout various Kroger business locations, product lines, and functional groups (Finance, Marketing, Food Science, Supply Chain, Operations, Human Resources, Quality etc.). </p><p></p><p>If you love and want a career in Manufacturing Operations Leadership, the Career Training Program is for you. </p><p></p><p><b>PLEASE NOTE</b>: Mobility for promotion to additional plants throughout the United States is expected. </p> Position Summary: <p>Entry level professional opportunity for recent college graduates. The CTP Program is designed to prepare candidates for first level leadership positions upon successful completion of the 12-24 month program. CTPs build technical and leadership competencies in the selected area of expertise while gaining a broad knowledge base of all core business functions critical to the manufacture of Kroger products. Relocation is a requirement of the CTP Program. Perform all jobs safely, efficiently and accurately to maintain and improve the performance of the entire division in the areas of Safety, Quality, Reliability (SQR) and our Customer 1st strategy. Provide leadership that embodies our 7 Kroger Manufacturing High Performance Work System Principles. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety.</p> Essential Job Functions: <ul><li>Initiate active development through interactions with team members, mentors, Corporate and Plant sponsors</li><li>Demonstrate excellence in project planning, execution, and timing through project evaluation and use of available resources to expedite project completion</li><li>Participate in the multi-faceted orientation process</li><li>Demonstrate commitment inthe plant safety process</li><li>Contribute and participate in practical, challenging and meaningful assignments</li><li>Follow established programs, policies and practices to produce safe quality foods that meet regulatory and company requirements</li><li>Support the development, implementation, maintenance, and ongoing improvement of the SQF Systems</li><li>Accountable to the Kroger Manufacturing Food Safety and Quality Principles</li><li>Must be able to perform the essential functions of this position with or without reasonable accommodation</li></ul> Minimum Position <span class=\"long-word\">Qualifications/Education:</span> <ul><li>Must relocate as a requirement of the CTP Program</li><li>Experience through internships, part time, or full time positions</li><li>Self-motivated; able to meet deadlines with limited supervision</li><li>Strong oral and written communication skills</li><li>Strong attention to detail, with high degree of accuracy and precision</li><li><strong>Administration</strong>: Bachelor's degree in Business or related field</li><li><strong>Engineering</strong>: Bachelor's degree in Mechanical or Electrical Engineering</li><li><strong>Finance</strong>: Bachelor's degree in Accounting/Finance</li><li><strong>Human Resources</strong>: Bachelor's degree in Human Resources or related field</li><li><strong>Manufacturing Information Technologist (MIT)</strong>: Bachelor's degree in Computer Engineering or Computer Science, Microsoft (MS) Certified IT Professional (MCITP) or MS Certified Systems Administrator (MCSA) with emphasis in MS Windows 2008 Server and MS SQL 2008 database management; or MS Certified Technology Specialist certifications in Windows 7, MS Windows 2008 Server, and MS SQL Server 2008</li><li><strong>Operations</strong>: Bachelor's degree in Operations Management or related field</li><li><strong>Quality Assurance</strong>: Bachelor's degree in Food Science, Biological or Chemical Sciences; knowledge of Dairy/ Bakery/Grocery Food Science or Product Development</li></ul> Desired Previous Job <span class=\"long-word\">Experience/Education:</span> <ul><li>Graduate degree in discipline related field</li><li>Experience in manufacturing environment</li><li>Experience in union environment</li></ul><p></p><p><strong>Education Level:</strong>Bachelor's Required<br><strong>Required Travel:</strong>Up to 25%<br><strong>Required <span class=\"long-word\">Certifications/Licenses:</span></strong>None<br><strong>Position Type:</strong> Full-Time<br><strong>Regions:</strong>West</p><p><br></p><p></p><p><strong>Jobs at Kroger Manufacturing:</strong>Through quality products, strong individual commitments and team spirit, Kroger has been established as a leader in the manufacturing industry. Kroger Manufacturing provides career development programs aligned with aspirations in Engineering, Process Management, Information Systems, Quality Assurance, Operations Management, Human Resources, Finance and Procurement. Our work force programs provide technically challenging rotations with cross-functional teams, plants and locations to allow our Associates to learn from some of the brightest minds in the business. Experience and training combined with mentoring and guidance from plant sponsors prepare our Associates with the skills and leadership behaviors needed to achieve a successful career at Kroger.</p><p></p><p><strong>Company Overview:</strong>Kroger Family of Companies employs nearly half a million associates who serve over 11 million customers daily through a seamless shopping experience under a variety of banner names. At The Kroger Co., we are Fresh for Everyone and dedicated to our Purpose: To Feed the Human Spirit. We are committed to creating <span class=\"long-word\">#ZeroHungerZeroWaste</span> communities by 2025. Careers with The Kroger Co. and our family of companies offer competitive wages, flexible schedules, benefits and room for advancement.</p><p>Posting Notes: OR||Portland|| 4950 N. Basin Ave ||97217 || Swan Island <span class=\"long-word\">Dairy||None||Manufacturing</span>; Management; Operations ||Employee|| Non-Exempt || Full-Time|| None </p></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "machine learning",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Performance Specialist",
        "company": "EXOS",
        "location": {
            "city": "El Segundo",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ee388001d86528edcd6ed6d714806be1?lvk=vhGHEfKRRcIYaoYYbvQTBQ.--M6meDAfnF",
        "posted": "2021-07-20T07:33:05.307Z",
        "lastScraped": "2021-07-29T07:33:05.307Z",
        "description": "<div><div><p>EXOS is a leader in the field of human performance, a category it created more than 20 years ago. For two decades we've stood side by side with the very best, coaching individuals, teams, and communities to higher levels of performance. And we've done it all by pioneering and leveraging sports science and proprietary tools across mindset, nutrition, movement, and recovery.</p><p></p><p>Today, EXOS employs more than 4,000 people in over 400 locations worldwide. With award-winning facilities, sports medicine clinics, technology, and services, EXOS connects people to the solutions they need. We provide comprehensive game plans, regardless of skill and sport, based on time-tested fundamentals and research in order to help people take control of their health and performance. EXOS is trusted by hundreds of clients including leaders in business, technology, health, community organizations, and world champions in sports. Now we're leaning into our rich heritage to move the brand forward. In 2020, EXOS founder and president Mark Verstegen brought on industry vet Sarah Robb O'Hagan as CEO to lead the company into its next chapter.</p><p></p><p>Culturally, we promote and reward humility, one team and tenacity as some of our core values and we are committed to cultivating an inclusive work environment where all of our team members feel empowered to grow and bring their whole selves every day. We celebrate the diverse voices and perspectives of our team members, knowing that diversity of age, race, ethnicity, gender identity, sexual orientation, veteran status and national origin, among other social identities, drive innovation, belonging and fuel our work.</p><p></p><p></p><p><b>Job Summary:</b></p><p></p><p></p><p></p><b>Job Description: </b><p></p><p><b>Responsibilities:</b></p><p>We're looking to add a Performance Specialist to our team! As a Performance Specialist your primary duties will be:</p><ul><li><p>Instructing, motivating, and assisting clients in a safe, legal, moral, ethical manner to achieve their goals.</p></li><li><p>Conducting on-site assessments of clients' health utilizing our proprietary evaluation protocols.</p></li><li><p>Updating training plans and/or re-evaluating clients as needed to ensure optimal outcomes.</p></li><li><p>Maintaining constant communication with clients to ensure goals are being met.</p></li><li><p>Partnering with the employer to conduct various client engagement and educational activities and events, such as lunch &amp; learns, information fairs, campus activities, etc.</p></li><li><p>Presenting EXOS methodology through EXOS education programs.</p></li><li><p>Reporting various metrics to operations, such as attendance, engagement, outreach efforts, and activity level.</p></li><li><p>Participating in program planning and development, as well as design and/or carry out related research.</p></li><li><p>Leading and/or participating in staff education covering all aspects of EXOS methodology.</p></li><li><p>Perform all aspects of position held in a professional manner.</p></li><li><p>Follow established policies and procedures of the company.</p></li><li><p>Maintain professional credentials as required including attending necessary continuing education courses.</p></li><li><p>Some travel may be required.</p></li></ul><p></p><p></p><p><b>The Ideal Candidate will have:</b></p><ul><li><p>Minimum of two years of personal training/strength coaching experience or completion of EXOS Performance Specialist Internship</p></li><li><p>BA/BS Kinesiology or Sports Science or related degree</p></li><li><p>Currently hold industry certification, preferably NSCA-CSCS or NASM</p></li><li><p>Ability to exercise judgment and discretion in the development of exercise prescription</p></li></ul><ul><li><p>Master's Degree in Kinesiology, Sports Science, Rehabilitation or related field.</p></li><li><p>Excellent presentation skills in both small and large group settings</p></li><li><p>Strong customer service skills where servicing the \"client\" is top priority</p></li><li><p>Energy and passion for helping others achieve their personal goals</p></li><li><p>Must be able to work independently with little daily supervision</p></li><li><p>Excellent communication skills, both verbal and written</p></li><li><p>Experience teaching group fitness classes with emphasis on helping improve technique and ability</p></li><li><p>Excellent computer skills including Microsoft Office Suite or related products</p></li></ul><p></p><p><b>Physical Requirements:</b></p><p></p><p>Candidates applying for this position should be able to lift up to 50 pounds unassisted repeatedly throughout the workday. Also, the physical requirements of this job require frequent walking around and demonstrating and assisting with exercise movements; bending, stretching, lifting, pushing, pulling and squatting are movements performed daily</p><p></p><p></p><p><i>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us</i><i>!</i></p><p></p><b>We are an equal opportunity employer</b><p><br>EXOS is proud to be an affirmative action / equal opportunity employer. All qualified applicants will receive consideration without regard to race, creed, gender, marital status, sexual orientation, citizenship status, color, religion, national origin, age, disability, veteran status, or any other status protected under local, state, or federal laws. EXOS provides reasonable accommodation to employees and applicants for employment who have disabilities. You may request reasonable accommodation, in writing, by reaching out to our People Operations department at:</p><p></p><p>Attention: People Operations, Accommodations</p><p>2629 E. Rose Garden Ln.</p><p>Phoenix, AZ 85050</p><p></p><p>Learn more here:</p><ul><li>EEO is the Law</li><li>EEO is the Law Supplement</li></ul></div></div>",
        "index": 8,
        "skills": [
            "information technology",
            "machine learning",
            "game design",
            "cybersecurity"
        ],
        "remote": false
    },
    {
        "position": "Assistant Director of Athletic Performance",
        "company": "University of the Pacific",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c21269cdfcab00f1eed881d2099b2833?lvk=TLHhTo8pwQDholanT_ofiA.--M6jSn_I4B",
        "posted": "2021-07-20T07:33:06.023Z",
        "lastScraped": "2021-07-29T07:33:06.023Z",
        "description": "<div><div><div> Job Title Assistant Director of Athletic Performance Union Level Department Athletics - Administration Campus Stockton Posting Number 201302402P Full or Part Time Full Time Number of Months 12 Work Schedule <div> A non-traditional work week, hours and days will be required to fulfill department needs. Expected to work weekdays, weekends and may include holidays. </div> Position End Date 07/23/2021 Open Date 07/19/2021 Close Date Open Until Filled Yes Special Instructions to Applicants <div> For first consideration, please apply on or before July 23, 2021. </div></div><div> Primary Purpose <div> Under general direction from Director of Athletic Performance is responsible for teaching and instructing student-athletes how to perform in their sport, including sport-specific weight training, conditioning, skills, and safety practices. </div> Essential Functions <ol><li>Instructs and coaches student-athletes, emphasizing sport-specific weight training, conditioning, skills, and safety practices.&nbsp;</li><li>Exercises discretion and judgment in implementing instructional techniques designed to develop student-athlete capacities.&nbsp;</li><li>Integrates innovative technology into the instruction of student-athletes to facilitate learning and safety.&nbsp;</li><li>Identifies proper training levels and creates individual year-round sport-specific training programs for assigned sport teams.&nbsp;</li><li>Administers training sessions using coaching expertise to help reduce the risk of injury, ensure proper technique and manages time of sessions accordingly.&nbsp;</li><li>Develops and oversees student internship program for Athletic Performance. This involves working in conjunction with sports sciences department to assist with teaching labs and any other projects.&nbsp;</li><li>Identifies and responds to appropriate training and conditioning needs of student athletes.&nbsp;</li><li>Oversees weight room operations, which include daily maintenance, repairs and organization.&nbsp;</li><li>Represents and acts on behalf of the Director of Athletic Performance in his/her absence or when assigned or requested.&nbsp;</li><li>Assists Director of Athletic Performance with special projects such as camps, special fundraising events, community outreach, etc.&nbsp;</li><li>Performs other duties as assigned or requested.&nbsp;</li><p></p></ol><div> This position serves as Campus Security Authority ( CSA) as outlined by the Clery Act. CSA's have federally mandated responsibilities to report crimes that are reported to them. </div> Minimum Qualifications <ul><li>Bachelor's degree in a related field.&nbsp;</li><li>Two (2) years of experience in weight training and conditioning at the intercollegiate or professional level.&nbsp;</li><li>Professional certification from either the National Strength and Conditioning Association or Colligate Strength and Conditioning Coaches Association.&nbsp;</li><li>First Aid/CPR certification.</li></ul> Preferred Qualifications <ul><li>Master's degree in a related field.&nbsp;</li><li>Advanced knowledge of exercise <span class=\"long-word\">science/physiology,</span> athletics strength and conditioning practices and coaching techniques.&nbsp;</li><li>Proficient in and comfortable with public speaking.&nbsp;</li><li>Ability to assess athletic skills in student-athletes and develop action plans for desired results.&nbsp;</li><li>Ability to motivate students to achieve expected results.&nbsp;</li><li>Good time management and organizational skills.&nbsp;</li><li>Good written and verbal communication skills.&nbsp;</li><li>Understanding and knowledge of best practices to ensure student-athlete welfare.&nbsp;</li><li>Basic computer skills including basic proficiency with MS Office.&nbsp;</li><li>Solid knowledge of NCAA and conference rules and regulations.&nbsp;</li><li> USAW Level 1 certification.</li></ul> Physical Requirements <div> The physical demands described here are representative but not definitive of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.&nbsp; <br>&nbsp; <br>Requires extended periods of standing and walking. Occasional sitting, climbing stairs, bending, stooping and reaching. Frequent lifting in excess of 25 pounds.&nbsp; <br>&nbsp; <br>Work Environment/Work Week/Travel:&nbsp; <br>Work performed primarily in gymnasium or clinical environment. Outdoor and indoor work will be necessary on a regular basis. A non-traditional work week, hours and days will be required to fulfill department needs. Expected to work weekdays, weekends and may include holidays. Some travel required to attend conferences, offsite events.&nbsp; <br><br>Valid driver's license required. Incumbent must also be able to meet the University's fleet rules and be eligible to drive for University business. The University and its insurance carrier reserves the right to exclude applicants based on their driving record.&nbsp; <br><br></div> Hiring Range Commensurate with experience, exempt Background Check Statement <p>All applicants who receive a conditional offer of employment are required to execute a release and authorization for a background screening.</p> AA/EEO Policy Statement <p>University of the Pacific is an affirmative action and equal opportunity employer dedicated to workforce diversity. In compliance with applicable law and its own policy, Pacific is committed to recruiting and retaining a diverse faculty and staff and does not discriminate in its hiring of faculty and staff, or in the provision of its employment benefits to its faculty and staff on the basis of race, color, religion, national origin, ancestry, age, genetic information, sex/gender, marital status, military and veteran status, sexual orientation, medical condition, pregnancy, gender identity, gender expression, or mental or physical disability.</p></div></div></div>",
        "index": 9,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Performance Coach",
        "company": "EXOS",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/68da306767f31923809d4d844cd384a9?lvk=4o7yz1oPbU0HN_IgKkzUvA.--M6qxdWr6Z",
        "posted": "2021-07-22T07:33:06.812Z",
        "lastScraped": "2021-07-29T07:33:06.812Z",
        "description": "<div><div><p>EXOS is a leader in the field of human performance, a category it created more than 20 years ago. For two decades we've stood side by side with the very best, coaching individuals, teams, and communities to higher levels of performance. And we've done it all by pioneering and leveraging sports science and proprietary tools across mindset, nutrition, movement, and recovery.</p><p></p><p>Today, EXOS employs more than 4,000 people in over 400 locations worldwide. With award-winning facilities, sports medicine clinics, technology, and services, EXOS connects people to the solutions they need. We provide comprehensive game plans, regardless of skill and sport, based on time-tested fundamentals and research in order to help people take control of their health and performance. EXOS is trusted by hundreds of clients including leaders in business, technology, health, community organizations, and world champions in sports. Now we're leaning into our rich heritage to move the brand forward. In 2020, EXOS founder and president Mark Verstegen brought on industry vet Sarah Robb O'Hagan as CEO to lead the company into its next chapter.</p><p></p><p>Culturally, we promote and reward humility, one team and tenacity as some of our core values and we are committed to cultivating an inclusive work environment where all of our team members feel empowered to grow and bring their whole selves every day. We celebrate the diverse voices and perspectives of our team members, knowing that diversity of age, race, ethnicity, gender identity, sexual orientation, veteran status and national origin, among other social identities, drive innovation, belonging and fuel our work.</p><p></p><p></p><p><b>Job Summary:</b></p><p></p>OUR IDEAL CANDIDATE<br>You demonstrate the desired skills, behaviors, and mindset to create and deliver effective programs and experiences both in person and digitally. You must be able to work in a collaborative, fast-moving, and ambiguous environment while managing time effectively and be willing to lead a task or project to completion. Skills, behaviors, and mindset include but are not limited to: <br><br>Skills: <br>You efficiently design experiences with the users in mind<br>You deliver articulate and effective communications <br>Behaviors: <br>You influence others to achieve results<br>You develop an inclusive environment in person and digitally<br>Mindset: <br>You are motivated by being part of a team<br>You are adaptable and able to adjust on the fly without getting tripped up<p></p><p></p><b>Job Description: </b><p></p><p><b><b>PRIMARY RESPONSIBILITIES</b></b></p><ul><li><p>Design Programs- Using EXOS methodology, you successfully design programs for users of varying ability and goals with an emphasis on quality movement, careful instruction, and safe results.</p></li><li><p>Deliver Classes- You skillfully lead users through workouts both digitally and onsite, while demonstrating proper movement quality to ensure maximum levels of success for all participants.</p></li><li><p>Administer Assessments- Routinely schedule and perform consultations and assessments for users to better understand their abilities, goals, and limitations.</p></li><li><p>Build Communities - You lead by example in assisting with digital and onsite opportunities for connection. You actively take responsibility to help promote and participate in community events designed for maximum participation, and track engagement accordingly.</p></li><li><p>Maintain Facilities- When onsite, you take pride in the appearance of the facility and strive to maintain a clean and organized work area. You value efficiency and take pride in a safe space for users to utilize the equipment.</p></li><li><p>Represent the EXOS Brand- Proudly represent the team both digitally and in person during meetings, video, and special events. You clearly articulate the scope of service delivery to users in a creative and thoughtful manner.</p></li><li><p>Develop Skill Sets- Vigorously seek out opportunities to learn and grow. You utilize internal education resources such as EXOS University to hone skills, and collaborate with peers to stay on the cutting edge in the industry. You welcome feedback and dialogue around your own performance and work to build off of your strengths.</p></li><li><p>Solve Problems- Utilize creative solutions to provide the highest level of customer service and ensure no barrier stands in the way of users and their goals.</p></li><li><p>Share Insight- Effectively communicate to all stakeholders on the account. You are willing to share thoughts, concerns, and opportunities to those around you and work toward an identified common goal. </p></li></ul><p></p><p></p><p></p><p><b><b>PREFERRED QUALIFICATIONS</b></b></p><ul><li><p>Bachelor's Degree or higher</p></li><li><p>Nationally recognized certification, preferably NSCA-CSCS, NASM or ACSM</p></li><li><p>Minimum 2 years experience creating and executing fitness programs or completion of EXOS Performance Internship</p></li><li><p>Excellent computer skills including G Suite or related products</p></li><li><p>Effective interpersonal communication skills, both written and verbal</p></li><li><p>High energy, with ability to use your voice to motivate and inspire users of all fitness levels</p></li><li><p>Ability to create and deliver a class experience both in person and digitally via streaming platform</p></li></ul><p></p><p></p><p><i>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us</i><i>!</i></p><p></p><b>We are an equal opportunity employer</b><p><br>EXOS is proud to be an affirmative action / equal opportunity employer. All qualified applicants will receive consideration without regard to race, creed, gender, marital status, sexual orientation, citizenship status, color, religion, national origin, age, disability, veteran status, or any other status protected under local, state, or federal laws. EXOS provides reasonable accommodation to employees and applicants for employment who have disabilities. You may request reasonable accommodation, in writing, by reaching out to our People Operations department at:</p><p></p><p>Attention: People Operations, Accommodations</p><p>2629 E. Rose Garden Ln.</p><p>Phoenix, AZ 85050</p><p></p><p>Learn more here:</p><ul><li>EEO is the Law</li><li>EEO is the Law Supplement</li></ul></div></div>",
        "index": 10,
        "skills": [
            "project management",
            "machine learning",
            "game design",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Clinical Supervisor",
        "company": "Compass Health",
        "location": {
            "city": "Mount Vernon",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-e685e2f8/mental-health-clinical-supervisor-52b7f5e2?lvk=AIp24-mQPBlgJQ3lGb7veA.--M6jGhiZTo",
        "posted": "2021-07-21T07:33:07.824Z",
        "lastScraped": "2021-07-29T07:33:07.824Z",
        "description": "<div><div><p></p></div> <strong>CLINICAL SUPERVISOR / CLINICIAN III (Mount Vernon - Part Time 20 hours/week)</strong> <div><p>The Clinical Supervisor / Clinician III works in conjunction with the Program Manager to ensure that clinicians have appropriate supervision and that clients receive high quality clinical care. This position provides a range of clinically indicated services including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults/older adults with behavioral health conditions. This position is responsible for assessing client functioning and needs, and partnering with the client to develop an individually tailored care plan designated to promote recovery. This position will also provide clinical supervision to MA or BA level clinicians and/or interns and provide crisis coverage as needed. </p><p><br></p><p><strong>EDUCATION / EXPERIENCE / CERTIFICATIONS / LICENSES</strong></p><ul><li>MA/MS/MSW Degree in a Behavioral Science related field. </li><li>Current Washington State Licensure or equivalent in Social Work, Marriage &amp; Family Therapy, or Mental Health Counseling. </li><li>Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn. </li><li>Washington State Approved Supervisor Training must be completed prior to providing clinical supervision. </li><li>Valid Washington State Driver’s License including vehicle and appropriate insurance, if applicable. </li></ul><p><br></p><p><strong>WHY WORK FOR US:</strong></p><p>As the region’s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesn’t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance. </p><p>(<em>Benefits pro-rated for part-time team members)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays – 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul><p><br></p><p><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES </strong><em>include the following, other duties may be assigned</em></p><ul><li>Complies with all accurate and appropriate charting, coding, and billing procedures as required by the regulatory organizations.</li><li>Documents delivery of services in the medical record. Completes all paperwork to agency standard and within required timelines.</li><li>Meets or exceeds service hour expectations and/or response time expectations established by the agency.</li><li>Develops expertise in Evidence-Based Practices, serious behavioral health disorders, and local community resources, and shares this expertise with other staff. </li><li>Completes client assessments in accordance with the DSM and other external and internal requirements. </li><li>Demonstrates respect for diversity and a commitment to developing multicultural competency and sensitivity.</li><li>Demonstrates commitment to Compass Health’s Strategic Intention, core Values and Core Competencies.</li></ul><p><strong> </strong></p><p><strong>KNOWLEDGE / SKILLS / ABILITIES</strong></p><ul><li>Ability to work effectively with individuals with complex needs and multi-system involvement.</li><li>Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems.</li><li>Demonstrated organizational skills and the ability to multitask within a fast-paced environment.</li><li>Excellent communication skills, written and verbal. </li><li>General computer proficiency, including the ability to utilize electronic medical record systems. </li><li>Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS.</li></ul><p> </p><p><strong>PHYSICAL DEMANDS / WORK ENVIRONMENT</strong></p><p>The employee will be working in a clinical office environment and will provide outreach to community settings as needed, which could include client homes, hospitals, medical facilities, schools, jails, community organizations, etc. While performing the duties of this job, the employee must occasionally lift and/or move up to 20 pounds and is regularly required to sit, stand, walk, talk, and use close vision. The noise level in the work environment is usually moderate. </p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job in the work environment. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. </p><p><br></p><p><strong>ABOUT US</strong><strong><br><strong> </strong></strong></p><p>Compass Health is the region’s largest private, non-profit organization providing mental health and chemical dependency services in Island, San Juan, Skagit, Snohomish, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesn’t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org.</span> </p><p> </p><p><em>Compass Health promotes equal treatment and equal employment opportunity to all applicants and employees regardless of race, creed, color, national origin, sex, religion, age, marital status, sexual minority status, sexual orientation, veteran status, or disability unless based on a bona fide occupational qualification</em></p><p> </p><p><br></p><p></p><p></p><p></p></div></div>",
        "index": 11,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Chemistry Intern 2021-C-002",
        "company": "Mirati Therapeutics Inc",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/mirati-therapeutics-inc-b6e9fec1/chemistry-intern-2021-c-002-94ff2c79?lvk=sa9lvDiYJdSeUsdGWFPlwQ.--M6jfwpF0J",
        "posted": "2021-07-22T07:33:09.072Z",
        "lastScraped": "2021-07-29T07:33:09.072Z",
        "description": "<div><p><strong>Job Description Summary </strong></p><p>Mirati's internship program blends real world experience with an extensive overview of the drug discovery industry. Knowledgeable mentors will provide guidance as you gain professional hands-on experience. The internship offers a unique perspective into a top-class biotech. Our internship program also provides you the opportunity to network with people at Mirati through various planned events and activities.</p><p><strong>Your Responsibilities</strong></p><ul><li>Under supervision, synthesize, isolate, purify and characterize small molecules</li><li>Utilize modern synthetic and purification techniques</li><li>Design viable synthetic routes and perform literature searches in support of research</li><li>Collaborate closely with a broad group of scientists </li><li>Maintain all appropriate legal and corporate standards for lab safety and hazardous material management; execute daily chemistry operations with an approach designed to minimize risks and hazard waste streams.</li><li>Help to maintain the lab instruments including HPLC, ISCO, lyophilizer etc.</li><li>Maintain lab notebook, instrument and inventory records in accord with department guidance and regulatory requirements</li></ul><p><strong>What is Required</strong></p><p>Applicants must be enrolled in a U.S. accredited university for the semester before and immediately following the internship.</p><p>Applicants must be pursuing a Bachelor's degree and have completed at least their sophomore year or be a graduate level student pursuing a Master's degree</p><p>For Bachelor's and Master's degree students, a major in Chemistry (or Chemistry-related field) who have taken, or are currently enrolled in Organic Chemistry lectured and labs.</p><p>Applicants should be dependable, highly motivated, with a keen interest in chemistry research.</p><p>Must be deadline driven and have a high level of organizational and planning skills</p><p>The ideal candidate exhibits strong analytical, problem-solving, and oral and written communication skills; he or she also possesses the ability to work well in teams.</p><p>This is a part-time internship with about 20 working hour per week. The schedule could be flexible.</p><p><strong>About Mirati Therapeutics</strong></p><p>Mirati Therapeutics is a late-stage biotechnology company whose mission is to discover, design and deliver breakthrough therapies to transform the lives of patients with cancer and their loved ones. The company is relentlessly focused on bringing forward therapies that address areas of high unmet need, including lung cancer, and advancing a pipeline of novel therapeutics targeting the genetic and immunological drivers of cancer. Mirati is using its scientific expertise to develop novel solutions in two registration-enabling programs: adagrasib (MRTX849), an investigational small molecule, potent and selective KRAS G12C inhibitor, as monotherapy and in combination with other agents, and sitravatinib, an investigational spectrum-selective inhibitor of receptor tyrosine kinases in combination with checkpoint inhibitor therapies. Mirati is also advancing its differentiated preclinical portfolio, including MRTX1133, an investigational KRAS G12D inhibitor, and other oncology discovery programs. Unified for patients, Mirati's vision is to unlock the science behind the promise of a life beyond cancer. </p><p>For more information about Mirati Therapeutics, visit us at Mirati.com or follow us on LinkedIn. </p><p><strong>Why Join?</strong></p><p>At Mirati, we have an unapologetic and relentless focus on our mission to transform the lives of patients with cancer and their loved ones. Patients and their families motivate us to work smarter, faster and better. We are driven by the knowledge that our efforts can one-day deliver life-saving therapies for the people who need us most. Urgency, open-mindedness, accountability and collaboration ground our work. These shared values are central to who we are, what we do and how we do it. </p><p>Our people fuel our success. They are fearless and passionate in their daily pursuit of our mission. We are committed to continuing to create a company and experience that attracts and keeps the best people. When you want your days to count and the work you do to matter, discovering and delivering potentially life-changing therapies is more than a job, it's the chance to be part of something bigger. </p><p>We believe diverse professional experiences and an inclusive culture can drive better outcomes for patients. We want employees to be authentic and use their perspectives to contribute to our mission in a meaningful way. </p><p>Mirati cultivates an environment where: </p><ul><li>An entrepreneurial attitude is encouraged </li><li>Our people are empowered to speak up, embrace the gray and achieve solutions </li><li>Diverse experiences are an important of part making the best decisions</li><li>We laugh and have fun as a work family</li></ul><p>No matter the role, we are unified by our passion for helping patients, and are inspired by a single vision to unlock the science behind the promise of a life beyond cancer. Together, we own Mirati's success. </p><p>Learn more at <span class=\"long-word\">Mirati.com/careers.</span> </p><p>Mirati is an Equal Opportunity Employer (EOE) we celebrate diverse experiences without regard to race, color, religion, creed, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. </p><p><strong>Notice to Third Party Agencies</strong>: Please note that Mirati Therapeutics Inc. does not accept unsolicited resumes from recruiters or employment agencies.</p><br><br><b><i>Job Posted by ApplicantPro</i></b><br></div>",
        "index": 12,
        "skills": [
            "networks",
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Prototype Integration Engineering Intern - Fall 2021",
        "company": "BAE Systems",
        "location": {
            "city": "Sterling Heights",
            "state": "Michigan",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5e5276fad4c9634efb53ba1dc27bb03e?lvk=sUvy20fs5rTcpJ6OUwNpXA.--M7EIEkunw",
        "posted": "2021-07-28T07:33:09.944Z",
        "lastScraped": "2021-07-29T07:33:09.944Z",
        "description": "<div><div><br><b>Job Description </b><br>How does it feel to work on a team driven to make a big impact? Empowering. We believe your career should always be growing. And that's exactly what it will do at BAE Systems. You'll hit the ground running with a company truly committed to your growth as you enjoy a special camaraderie on a team dedicated to protecting what really matters. Build your future at BAE Systems.<br><br>As an intern you will participate in our nationwide Internship &amp; Co-Op Program, LEAP, where you will have the opportunity to Learn, Engage, Apply, and Progress within the company. You will also have access to additional benefits such as, networking with BAE Systems employees and other students, participating in exciting real world projects, joining exclusive informational sessions with senior leaders, and expanding mentorship opportunities and career development.<br><br>This Internship is for Fall starting in September, 2021<br>In this position, you will be supporting the Combat Mission Systems (CMS) Business at our Sterling Heights, MI facility. This position will be onsite at our Sterling Heights facility. Relocation will not be offered, and housing is not provided.<br><br>Engineering interns provide engineering support to one or more areas of ground combat vehicles: Vehicle assemblies including auxiliary subsystems, structure systems, and mobility systems. As an Engineering intern you will be part of an integrated product team in the development of a vehicle platform. You will perform roles similar in nature to our entry-level engineers. <br><br><strong>As a LEAP Prototype Integration Engineering Intern, you will:</strong><ul><li>Coordinate material needs for shop floor vehicle programs . Helps prioritize material needed by taking prioritized parts schedule list from build lead/shop floor parts table and works daily with Material Service Org (MSO) to provide what material to pick and issue</li><li>Coordinate with Shop Floor Material <span class=\"long-word\">POC/Engineering/Technicians</span> to ensure material is moved correctly between vehicles showing material removed from Work Order A and issued to Work Order B, for example</li><li>Ensure material that has a \"demand\" on a work order when received is picked and issued by coordinating with MSO and Shop/Build lead daily to ensure received material goes to the floor and not back to offsite warehouse</li><li>Create/Update tools such as presentations about system architecture, powertrain/cooling systems optimization, and design of current or future products</li><li>Research vehicle subsystems, such as structures, controllers, mounting architecture, engines, mechanical transmissions, and powertrain cooling systems to gain a general understanding of implementation in military vehicles</li><li>Gain hands on combat vehicle experience through review, installation, and/or testing</li><li>Aid in the documentation of existing 3D models as well as loading models to the document management system using PTC Creo</li><li>Assist in management of risks, coordination of projects, sort and align parts to factory orders, follow-up on team action items, as well as completion of engineering assignments in support of design reviews, processing change requests, and requesting support services</li></ul><br><br><b>Required Education, Experience, &amp; Skills </b><br><ul><li>Currently enrolled in an accredited college/university pursuing a degree in Mechanical, Industrial, or Manufacturing Engineering, or related field</li><li>Ability to use common shop &amp; general mechanics tools</li><li>Good oral and written communication skills</li><li>Good interpersonal skills and the ability to work effectively with others</li><li>Good organizational, planning and follow-up skills</li><li>Proficient with PC and MS Office Suite</li></ul><br><br><b>Preferred Education, Experience, &amp; Skills </b><br><ul><li>Can prioritize and execute, cover, move, simplify, and demonstrate accountability while operating autonomously</li><li>Driven to constantly learn and improve. Takes mistakes as opportunities to correct and improve.</li><li>Experience with CAD, specifically PTC Creo or Pro/Engineer</li><li>Hands-on experience <span class=\"long-word\">repairing/maintaining/building</span> mechanical systems</li><li>Interest in a career supporting the Armed Forces</li></ul><br><br><b>About BAE Systems Platforms &amp; Services </b><br>BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it's what we do at BAE Systems. Working here means using your passion and ingenuity where it counts - defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team-making a big impact on a global scale. At BAE Systems, you'll find a rewarding career that truly makes a difference.<br><br>The Platforms &amp; Services (P&amp;S) sector under BAE Systems, Inc does the big stuff: the armored combat vehicles, naval guns, missile launchers, and naval ship repair...just to name a few. Our employees take pride in the work they do and why they do it. They are on the front lines every day, building our products to protect the lives of those who serve. We may be biased, but we think P&amp;S does some of the coolest work around, and we think you will too.<br><br>At BAE Systems, we celebrate the array of skills, experiences, and perspectives our employees bring to the table. For us, differences are a source of strength. We're laser-focused on high performance, and we work hard every day to nurture an inclusive culture where all employees can innovate and thrive. Here, you will not only build your career, but you will also enjoy work-life balance, uncover new experiences, and collaborate with passionate colleagues. Employment Type: Part-Time</div></div>",
        "index": 13,
        "skills": [
            "project management",
            "software engineering",
            "information technology",
            "networks",
            "machine learning"
        ],
        "start": "2021-09-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Audit - Quality Assurance Intern - Los Angeles 2021",
        "company": "Elliot Horowitz & Co.",
        "location": {
            "city": "Los Angeles",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/800c21edf7aef38da59260a9f7b50800?lvk=76cTRs-HSdJZAHu2GAmCvw.--M79YJMmx3",
        "posted": "2021-07-27T07:33:10.707Z",
        "lastScraped": "2021-07-29T07:33:10.707Z",
        "description": "<div><div><p></p><p><b>Job Description:</b></p><p>Mazars is seeking high-performing graduates to join the Quality Assurance team in our Los Angeles office. As a Quality Assurance Intern, in this practice you will be responsible for providing the highest levels of client service excellence while working with other professionals and interacting with valued clients.</p><p></p><p>We may work with numbers, but accounting, tax and advisory is all about people. At Mazars, we pride ourselves on building long-lasting relationships with our teams, clients, and the community.</p><p></p><p>Mazars USA LLP is an independent member firm of Mazars Group, an international audit, tax and advisory organization with operations in over 90 countries. With roots going back to 1921 in the US, the firm has significant national presence in strategic geographies, providing seamless access to 26,000+ professionals around the world. Our industry specialists deliver tailored services to a wide range of clients across sectors, including individuals, high-growth emerging companies, privately-owned businesses and large enterprises.</p><p></p><p>Mazars works as a single, integrated team, committed to helping our clients and people succeed by respecting who they are and how they work, adapting our approach accordingly. We take pride in what we do and are committed to playing our part in building the economic foundations of a fair and prosperous world.</p><p></p><p><b>Start Date:</b> Early September</p><p><b>Internship Duration: </b>Ongoing, 25 per week</p><p><i>This is a 1 year internship and all applicable candidates (2022 graduates) are also eligible to be considered for full time Audit Associate roles that start September 2022. </i></p><p></p><p><b>Required Skills and Experience</b><b>:</b></p><ul><li>Willingness to work a minimum of25 hours a week</li><li>Enrolled in undergraduate or graduate degree in Accounting or Tax</li><li>Strong academic credentials (3.0 GPA minimum)</li><li>CPA eligibility upon Graduation (150 credit completion)</li><li>Strong organization, communication, and analytical skills</li><li>Motivated and hard working in order to meet client deadlines and to provide excellent client service</li><li>Able to work in a paperless environment and strong computer skills</li><li>Willingness to learn and be a team player</li></ul><p></p><p><b>Professional Responsibilities</b><b>:</b></p><ul><li>Assisting field auditors to comply with the firm's quality control procedures, including performing proof-reading and math checking of financial statements</li><li>Working closely with the supervisor and other members in the team to ensure that attest engagements are reviewed in a timely manner</li><li>Assisting in various research projects and other tasks as assigned</li><li>Keeping the firm's reference library on accounting and auditing up to date</li><li>Maintaining and updating the firm's engagement database (Microsoft Access)</li><li>Assisting in timely distribution of final deliverables to clients</li></ul><p></p><p><b>We Offer:</b></p><ul><li>Intensive training through in-house training programs, as well as on-the-job-training</li><li>A varied profession with a variety of market segments (industries) and significant career opportunities</li><li>A diverse, dynamic and exciting work environment</li><li>Significant career opportunities across a range of business advisory services</li></ul></div></div>",
        "index": 14,
        "skills": [
            "machine learning",
            "project management"
        ],
        "start": "2022-09-01T10:00:00.000Z",
        "due": "2022-09-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Engineer Intern",
        "company": "Southern California Gas Company",
        "location": {
            "city": "Redlands",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f14f447be1cef28adbedbf0c17f96dc7?lvk=uLbrh14STJxx7DGer4axSg.--M6llwURkB",
        "posted": "2021-07-20T07:33:11.437Z",
        "lastScraped": "2021-07-29T07:33:11.437Z",
        "description": "<div><div><p></p><p><b>Primary Purpose</b></p><p>SoCalGas is offering exciting new opportunities for hands-on training with skilled professionals. Student internships provide developmental opportunities for the right candidates, to put theory into practice and gain valuable work experience that is personally and professionally rewarding. Current enrollment in an engineering program as an undergraduate or graduate in a 4-year college or university. This is a year-round part time position and requires reliable transportation. </p><p>The Engineering Intern supports their department with reviews, analysis and recommendations for engineering requests from the field, planning office and headquarters. This position provides research support (data gathering utilizing company records stored in hard copy or computer form), engineering and cost benefit analysis for gas processing facility projects. Provides gas processing analysis support utilizing available simulation software.</p><p>Join SoCalGas today and share our vision of becoming the cleanest natural gas utility in North America. Headquartered in the heart of downtown Los Angeles, we deliver affordable and increasingly renewable energy to 22 million customers across central and Southern California.</p><p></p><p></p><ul><li>Sophomore/Junior or Senior with at least two semesters or quarters before graduation. </li><li>Full-time student in a College or University Engineering program, in the chemical, mechanical, or civil engineering disciplines preferred.</li><li>A 3.0 cumulative GPA or above is required and maintain the 3.0 throughout the internship. </li><li>Be able to work 16-24 hours per week on a year-﻿round basis, with a flexible work schedule.</li><li>Solid understanding of fluid flow, thermal dynamics, piping systems and computer applications preferable.</li><li>Must be able to analyze significant amounts of data and develop multiple options and scenarios in reaching decisions.</li><li>Must be able to manage and implement multiple projects and to coordinate assigned activities and individual projects.</li><li>Knowledge of project management software tools, PC operations, spreadsheets, CAD, mainframe, networks, and MS Office preferable.</li><li>Must clearly and concisely communicate technical information and concepts in formal and informal settings with other departments in the company.</li><li>Strong communications skills. This position requires constant communication with people of various levels of work experience; must be willing to learn from others, be self-motivated to perform tasks that are simple or complex.</li></ul><p></p><p><strong>Southern California Gas Companyisan EEO/AA Employer</strong></p><p></p></div></div>",
        "index": 15,
        "skills": [
            "project management",
            "software engineering",
            "networks",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Library Intern",
        "company": "City of Salem",
        "location": {
            "city": "Salem",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f6e062220b36331a8ac0dfdf85871d71?lvk=_FxtKejb-hqWvzAmLJ53Bg.--M7Bipk1Ng",
        "posted": "2021-07-26T07:33:12.207Z",
        "lastScraped": "2021-07-29T07:33:12.207Z",
        "description": "<div><div> Job Summary <p>Seeking superstars for the City of Salem Public Library team! The Library provides unique learning opportunities for college students and these relationships have provided many interns with career-building experience for future employers.<br><br>This recruitment will be used to fill four (4) Library Internships for eligible graduate or undergraduate students. Work will consist of up to 20 hours per week, various shifts across a seven day a week operation, including evenings and weekends. This position is a temporary position and is not eligible for benefits.<br>&nbsp;<br>The Intern Staff assist in processing library materials daily (think Amazon fulfillment center), register new and update library accounts, basic reader's advisory assistance, basic patron account assistance and assist customers with locating and checking out library materials.<br><br><strong>What are the minimum qualifications?</strong></p><ul><li>Must pass the pre-employment background check and drug test (including marijuana).</li><li>Must have an Oregon Driver license and a driving record that meets the City of Salem's driving standards.</li><li>High School Diploma or GED.</li><li>Current enrollment into an accredited school of higher education and one year experience in retail, grocery, office work, or other relevant customer service positions. <ul><li>Applicants that graduated within the last 6 months will still be considered.</li></ul></li><li>Bilingual skills preferred.</li></ul><strong>Our star candidate would have:&nbsp;</strong><ul><li>Relevant customer service experience.</li><li>Ability to work well with diverse populations.</li><li>Excellent written and verbal communication skills.</li><li>Computer skills and experience with MS Office products, especially Excel, and at least 35 WPM keyboarding skills.&nbsp;</li><li>Ability to work a flexible schedule of at least 20 hours a week, including Saturday and/or Sunday.</li><li>Good time management skills and the ability to adapt to change and changing work priorities.</li><li>Previous experience or knowledge of libraries.</li><li>Spanish language skills are not required but are a plus.&nbsp;</li></ul><strong>Where can I find out more about the position?</strong><br><br>Go to the menu option for Class Specifications and search for Library Intern or view by clicking here. <br><br><strong>How can I apply?</strong><br><br> The City of Salem invites individuals of all diverse communities and backgrounds to apply for our available job opportunities as we strive to provide the best service to everyone. The City of Salem is committed to providing equal employment opportunities to all and has a culture that values diversity, equity, and inclusion. We believe that by welcoming differences, encouraging new ideas and views, listening to and learning from each other, we are better able to serve the community. <br> &nbsp; <br> To apply, click on the green \"Apply\" button to complete your application. &nbsp;Make sure that you specify how you meet the qualifications outlined in the class specification and complete the application. <br> &nbsp; <br> Applicants that meet the minimum qualifications as outlined above but not selected for this position may be placed on an eligibility list, and candidates may be hired from the list. Eligibility lists are valid for six months. The City will send email notifications to eligible candidates about potential hiring opportunities so please ensure your email settings accept our system generated email notifications. <br><br> You may subscribe for automatic notification of job openings at the City through the&nbsp; Job Interest Cards &nbsp;- sign up today! <br><br> For more information about employment at the City of Salem, please visit our website at&nbsp; <span class=\"long-word\">www.cityofsalem.net/jobs</span> . <br><br> #DIV <br><br><p></p></div></div>",
        "index": 16,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Marketing Intern - Office Products",
        "company": "ACCO Brands",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ea0ab5433d6087b58dddfe46c5367fa4?lvk=mQCvZ46qDktxNJ_4uqF1XQ.--M6oeRYWnN",
        "posted": "2021-07-23T07:33:12.905Z",
        "lastScraped": "2021-07-29T07:33:12.905Z",
        "description": "<div><div> Description <p></p><div><p>Achieve. Create. Collaborate. Organize.&nbsp;</p><p>&nbsp;</p><p>Essential brands. Innovative products. Smart investment. Winning team. This is what you will find at ACCO Brands. We are passionate about building a culture that is committed to the success of our employees. If you are looking for an organization that offers rewarding opportunities and is dedicated to team orientation, learning and development, and flourishes with success, we invite you to be a part of building our company for the future.&nbsp;</p><p>ACCO Brands is seeking a creative, dependable, and enthusiastic&nbsp;Marketing Intern- Office Products&nbsp;to join our U.S. Marketing Team in Kettering, Ohio.&nbsp; As an intern you will have the opportunity to perform market analysis and research the latest trends, co-lead projects, and present new ideas. The invaluable learning experience, knowledge, and skills you develop will set the foundation for your future career.<br><br>Qualifications:</p><ul><li>No prior marketing experience is required; however, we do look for candidates who have a proven track record of success in balancing academics, employment and extracurricular activities.</li><li>Currently pursuing a Bachelor's or Master's degree in Marketing, Business Management, Communications, or a similar field.</li><li>Minimum 3.0 cumulative GPA (4.0 scale).</li><li>Ability to commit to a one-year internship, working full-time (40 hours) during the summer and part-time (minimum 15 hours) during the school year.</li><li>Strong computer skills (Word, Excel and PowerPoint required).</li><li>Ability to organize and prioritize in a deadline-oriented environment.</li><li>Excellent interpersonal communication skills.</li><li>Sound analytical and critical thinking skills.</li><li>Strong attention to detail.</li></ul><p>&nbsp;</p><p>About Us&nbsp;</p><p>You know our brands. You love our brands. You just may not know they are ours.&nbsp;</p><p>&nbsp;</p><p>If you have touched a Five Star notebook, aSwingline stapler, a Quartet dry erase board, or a Kensington computer mouse, you have touched part ofACCOBrands Corporation. With annual revenues of nearly $2 Billion, ACCO Brands (NYSE: ACCO) designs, markets, manufactures and sells branded academic, consumer and business products globally. The power of our brands, our unmatched global customer reach, and our strategic market strengths put us in a position to achieve global leadership and growth. We're proud of our long history of industry&nbsp;leadership and innovation and are focused on delivering exceptional value to our customers by providing unique, cutting-edge, branded products.&nbsp;</p><p>&nbsp;</p><p>Apply and build your future with ACCO Brands.&nbsp;</p><p>More information about ACCO Brands, the Home of Great Brands Built by Great People, can be found at <span class=\"long-word\">www.accobrands.com.</span></p><p></p><p>&nbsp;</p></div><p></p><p></p><p>Equal Opportunity Employer</p><p>ACCO Brands is an equal <span class=\"long-word\">opportunity/affirmative</span> action employer. The Company provides equal employment opportunity to all persons without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.</p><p>&nbsp;</p><p>AODA</p><p>Accommodation for applicants with disabilities will be provided in all parts of the recruiting process as required under the ACCO Brands Canada AODA policy.&nbsp; Applicants are asked to make their needs known in advance.</p><p></p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Part-Time Intern I - Economic Development",
        "company": "City of Moreno Valley",
        "location": {
            "city": "Moreno Valley",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ea9dcf5ac9441d2d2d0a90bed9bd0cf2?lvk=qL1uXUZ5oz4Vvbo-5TBaNA.--M7BiliWTo",
        "posted": "2021-07-27T07:33:13.641Z",
        "lastScraped": "2021-07-29T07:33:13.641Z",
        "description": "<div><div> Description <p><br><br></p><div></div><br>The <strong>City of Moreno Valley</strong> is seeking a talented college student to serve as an intern in our Economic Development Department. The current assignment will provide administrative and research support as well as assisting the department with administrative tasks, projects and duties. <br><br>The intern position will focus on career development and professional growth. This opportunity is designed to attract, develop and mentor individuals interested in pursuing a career in local government. <br><br><strong>Note:</strong> <strong>&nbsp;This is a part-time/temporary position averaging 20 hours per week. A minimum number of hours is not guaranteed. Scheduling is typically Monday through Friday during regular business hours. Hours of work are flexible to accommodate school schedules.</strong><p></p> Examples of Duties <p><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong><br><br><em>The duties listed below are intended only as illustrations of the various types of work that may be performed. &nbsp;The omission of specific statements of duties does not exclude them from the position if the work is similar, related or a logical assignment to this class.</em><br><br></p><ol><li>Researches and compiles data for specialized reports and records; ensures data accuracy; compiles and prepares reports.</li><li>Assist in the coordination of programs and events such as conferences, trade shows, briefings, tours and meetings.</li><li>Provide general support to staff as needed</li><li>Collect, summarize and analyze information and statistics.</li><li>Plan and implement programs, special projects, assignments and events.&nbsp;</li><li>Perform paraprofessional field assignments for Public Works, Parks &amp; Recreation and/or Community Development.&nbsp;</li><li>Perform related duties as assigned.</li></ol><p></p> Typical Qualifications <p><strong>QUALIFICATIONS<br>&nbsp; &nbsp; &nbsp;</strong><br><strong>Education, Training and Experience:</strong><strong><br>&nbsp;</strong>A typical way of obtaining the knowledge, skills and abilities outlined above is graduation from high school or G.E.D. equivalent; and be currently enrolled in an accredited college or university, with course work in Business Administration, Public Administration, Economic Development or a related field.<br><br><strong>Knowledge of:</strong></p><ol><li>Office practices and procedures.</li><li>Principles and practices of sound business communication; correct English usage, including spelling, grammar and punctuation.</li><li>City organization, functions, rules, policies and procedures applicable to assigned areas of responsibility.</li><li>Advanced uses of word processing, spreadsheet, database and other standard software to create complex documents and materials requiring the interpretation and manipulation of data.</li><li>Basic research techniques, methods and procedures.</li><li>Basic principles and practices of public administration, including budgeting, purchasing and maintenance of public records.</li></ol><strong>Ability to:</strong><ol><li>Operate a computer, word processing and spreadsheet software and other standard office equipment.</li><li>Type accurately at a speed necessary to meet the requirements of the position.</li><li>Organize, set priorities, take initiative and exercise sound independent judgment within areas of responsibility.</li><li>Interpret, apply, explain and reach sound decisions in accordance with regulations, policies and procedures.</li><li>Compose correspondence and prepare documents from brief instructions.</li><li>Communicate clearly and effectively, both orally and in writing.</li><li>Understand and follow written and oral instructions.</li><li>Prepare clear, accurate and concise records and reports.</li></ol><br><div><strong>IMPORTANT APPLICATION INFORMATION AND INSTRUCTIONS</strong></div><br>&nbsp; <strong>Applicants are required to submit the following items along with their application and supplemental questionnaire responses:</strong><br>&nbsp; <ul><li>A one page personal statement of interest describing their career goals and reasons for seeking an internship with the City of Moreno Valley</li><li>Most recent official or unofficial transcript(s)</li></ul>Applications will be accepted on a continuous basis until a sufficient number of qualified applications have been received. The deadline for the first review of applications is on <strong>Tuesday, August 10, 2021 at 5:00PM.</strong>&nbsp; <strong>Applicants are encouraged to apply early. &nbsp;Applicants that apply after the first review are not guaranteed to be considered for this recruitment. This recruitment may close at any time without notice after the first review date.</strong><br><br>Candidates must be specific and complete in describing their qualifications for this position. &nbsp;Failure to state all pertinent information may lead to elimination from consideration. &nbsp;Stating \"See Resume\" is not an acceptable substitute for a completed application. &nbsp; <br>&nbsp; &nbsp; <br>The successful candidate will be required to undergo a reference / background check (to include a conviction record) and pass a post-offer pre-employment medical examination (which will include a drug/alcohol screening). <br>&nbsp; &nbsp; <br>Communication regarding your application and/or status will be sent to the email address listed on your application. &nbsp;Please check your email regularly throughout the recruitment process. <p></p> Supplemental Information <p><strong>PHYSICAL AND MENTAL DEMANDS</strong><br><br>The physical and mental demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this class.&nbsp; Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br>&nbsp;<br><strong>Physical Demands</strong><br><br>While performing the duties of this job, employees are regularly required to sit, walk and stand; talk or hear, both in person and by telephone; use hands repetitively to finger, handle, feel or operate standard office equipment; reach with hands and arms; and lift up to 25 pounds.<br><br>Specific vision abilities required by this job include close vision and the ability to adjust focus.<br>&nbsp;<br><strong>Mental Demands</strong><br><br>While performing the duties of this job, an employee is regularly required to use written and oral communication skills; read and interpret data, information and documents; analyze and solve non-routine and difficult office administrative problems; observe and interpret people and situations; learn and apply new information or skills; perform highly detailed work on multiple, concurrent tasks; work under intensive deadlines with frequent interruptions; and interact with City management, staff, contractors, vendors, external agencies, the public and others encountered in the course of work.<br>&nbsp;<br><strong>WORK ENVIRONMENT</strong><br><br>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this class.&nbsp; Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br>&nbsp;<br>Employees work under typical office conditions, and the noise level is usually quiet.<br><br></p><div><strong>Equal Opportunity Employer</strong></div><p></p></div></div>",
        "index": 18,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "due": "2021-08-10T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Software Engineering Intern",
        "company": "Badger Meter",
        "location": {
            "city": "Los Gatos",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/123d5227b09328d4ad63738438e01bbd?lvk=d2tAzNBihA9165dp91w7Hg.--M6qwPIhNs",
        "posted": "2021-07-23T07:33:14.338Z",
        "lastScraped": "2021-07-29T07:33:14.338Z",
        "description": "<div><div>Why Badger Meter?<br><b>Are you looking to join a dynamic team where you have the autonomy and challenge that lets you learn and grow your career? Are you energized when you know that your contributions matter and make a difference in business success? If yes, then Badger Meter may be a great place for you!</b><br><b>For more than 115 years, Badger Meter has provided strong, stable financial growth, in turn providing employees with the opportunity to build long, successful careers. As a leading manufacturer of flow measurement technology, Badger Meter offers many opportunities to measure what matters in protecting the world's water and other precious resources. Our company is large enough to continually drive market innovation, all while we maintain a collaborative and flexible working atmosphere.</b><br>What You Will Contribute:<br><p>The purpose of this position is to for BEACON analytics create linear regression models to predict likelihood of failure in communication with IOT (Orion Cellular) devices.</p><p></p><p>BACKGROUND REQUIREMENTS:</p><p></p><p>- Currently enrolled in Computer Science program with focus on Data Science or AI.</p><p>- Experience with Python and Jupiter Notebooks.</p><p>- Experience with Github.</p><p>- Experience working with web application development.</p><p>- Experience with UNIX.</p><p>- Excellent communication skills, with the ability to speak and write in English.</p><p>- Ability to quicklylearn new technology.</p><p></p><p>40% Data collection and labeled data set creation.</p><p>50% Create models to predict reasons for endpoint communication issues.</p><p>n/a Additional projects, tasks, and/or assignments as assigned.</p><p></p><p><b><b>Due Date: <b><b>Learning Outcome:</b></b></b></b></p><p>Week 1 Development set-up: configure local computer to be able to do software development for BEACON</p><p>Week 3 Collect and document all data sources that will be used to create the model. Collect a labeled set that will web used to train the model.</p><p>Week 10 Create a couple of different models to predict the reasons for endpoints not communicating. Verify the accuracy of the model.</p><p>Week 12 Create a design paper on what was accomplished.</p><p></p><p></p><p>Badger Meter is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. This company considers candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Applicants can learn more about their rights regarding equal opportunity in employment by viewing the federal \"EEO is the Law\" poster and the \"EEO is the Law\" poster supplement at <span class=\"long-word\">http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm</span></p></div></div>",
        "index": 19,
        "skills": [
            "python",
            "software engineering",
            "machine learning",
            "project management",
            "information technology",
            "artificial intelligence"
        ],
        "remote": false
    },
    {
        "position": "Cloud Engineering Intern",
        "company": "Zscaler",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/zscaler-10bd9e62/cloud-engineering-intern-b9c18786?lvk=ZdScl7A5Om1w-9mqxMvWIw.--M7BGBtSmV",
        "posted": "2021-07-28T07:33:15.375Z",
        "lastScraped": "2021-07-29T07:33:15.375Z",
        "description": "<div>Company Description<br><br><p>Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. </p><p>With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. </p><p>Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.</p>Job Description<br><br><p>In this role, you will be responsible for hands-on technical research. You will execute proof of concepts for new cloud security features under research for Zscaler’s Cloud Security Posture management product. As a member of the engineering team, you will closely work with the Cloud Policy research team and Cloud Engineering teams to deliver whitepapers. This position will closely work and mentored by Engineering Architect’s.</p><p><br><strong>Responsibilities:</strong></p><ul><li>Perform security research on cloud services (AWS, Azure, GCP)</li><li>Explore the CLOUD API’s and extract vulnerabilities from cloud assets</li><li>Penetration testing on cloud solutions and record the successful exploits</li><li>Perform proof of concepts to test and design solutions</li><li>Develop technical design diagrams for the PoC</li><li>Setup a VULS DB ecosystem and integrate with multiple CVE DB in the public</li><li>Develop Plugins and Plugins designs for major CI / CD systems</li></ul>Qualifications<br><br><ul><li>Pursuing Master of Computer Science’s and candidate for graduation in December 2021</li><li>You would work 40 hrs/wk during the summer and we are looking for candidates who would be able to work part-time (20 hrs/wk) during the Fall. Conducive to candidates local to San Jose or who will be completing the rest of the Fall 2021 semester virtually</li><li>Technical experience in security</li><li>Affinity or experience to explore KALI LINUX Tools</li><li>Ability to write code in GO or PYTHON</li><li>Strong written and verbal communication skills</li><li>“Roll up sleeves and do what it takes” attitude and strong team player that is not afraid to present new, creative ideas.</li></ul><br><br>Additional Information<br><br><p>All your information will be kept confidential according to EEO guidelines.</p><div></div><p><strong>What You Can Expect From Us:</strong></p><ul><li>An environment where you will be working on cutting edge technologies and architectures</li><li>A fun, passionate and collaborative workplace</li><li>Competitive salary and benefits, including equity</li></ul><p><strong>Why Zscaler?</strong><br><br>People who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. <br><br>Additional information about Zscaler (NASDAQ: ZS ) is available at <span class=\"long-word\">https://www.zscaler.com.</span> </p><p>Zscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p></div>",
        "index": 20,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "cloud computing",
            "project management",
            "virtual reality"
        ],
        "compensation": "paid",
        "remote": false
    }
]