[
    {
        "position": "Quality Assurance Internship",
        "company": "Viewpoint",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a1a6bfad5563447f34199e3631cfd65d?lvk=X8BGJaHq9HcY937Ry2OlKg.--MCIXUYmNZ",
        "posted": "2021-09-29T09:22:29.529Z",
        "lastScraped": "2021-10-04T09:22:29.529Z",
        "description": "<div><div><p><b>Quality Assurance Intern</b><br><br>The Viewpoint Trimble Internship is a full time summer internship that will be approximately 12 weeks and will be based in our Seattle, Washington office. Viewpoint is a provider of innovative construction-specific software solutions to the global construction and capital project industries. For over 40 years Viewpoint has been committed to bringing information technology-based efficiencies to construction projects and their stakeholders, engaging in a highly collaborative process with customers to ensure every product and service addresses key industry issues.<br>The internship program provides college students the opportunity to learn and practice both job-specific skills, as well as communication and teamwork skills in an innovative work environment. Interns will gain first-hand experience with daily operations. Interns will receive hands-on experience working with agile teams of Engineers and Analysts with industry-leading, vertical software solutions in the construction market.<br><br>As a Quality Assurance Intern, you'll design tests used to ensure that software operates within defined requirements, develop validation strategies, implement test plans, and create the supporting test automation. You will identify and investigate issues found during testing. You will work closely with software developers and software quality engineers to resolve issues, and develop and maintain automated test scripts to reduce repetitive manual testing. <br><br><b>Required</b>:<br>College students working towards a degree in computer science, business intelligence, or web content management. Applicants should be in their junior or higher year and plan to continue working toward a degree.<br>Applicants should have an undergraduate GPA of 3.0 or better.<br>Demonstrates effective written and verbal communication skills.<br><br><b>Preferred</b>:<br>Knowledge of agile development methodologies.<br>Knowledge of Software Development, Quality Assurance, or User Experience principles and practices.<br>Ability to read and understand code used in typical frameworks.<br>Experience with relational databases (MS SQL Server, Oracle, etc.) and writing SQL queries.<br>Familiarity with the Microsoft Windows platform (server and workstation).<br>Basic understanding of computer networking (tcp/ip, routing, windows domains).<br>Basic troubleshooting and debugging skills.<br></p><p><b>Viewpoint is an Equal Opportunity Employer</b></p><p>DISCLOSURE for US-BASED POSITIONS ONLY: Viewpoint requires a criminal background investigation, and employment and education verification as a condition of employment.</p></div></div>",
        "index": 1,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "sql",
            "networks",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "Software Engineer Graduate Internship - ASIC Drivers",
        "company": "Intel",
        "location": {
            "city": "Santa Clara",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/946679097d07df9027d40558f6e2c24a?lvk=SwE6gPlu_z1IRcicOPn_oQ.--MCGGJP-bw",
        "posted": "2021-09-30T09:22:31.198Z",
        "lastScraped": "2021-10-04T09:22:31.198Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p></p><p>Come and join us for an Internship!</p><p></p><p>Intel is seeking highly motivated students to join the Barefoot Switching Division (BXD) in our application-specific integrated circuit (ASIC) Group as an Intern!</p><p></p><p>We're a vibrant team which helps drive Intel's programmable switching technology and products to position Intel Tofino as the switching platform of choice and for the Cloud, Data Center, Enterprise and Telco network deployments. We are looking for someone who aspire to become a system engineer. You will be working with an experienced team who is responsible for providing drivers the ASICS and provide APIs to access the ASIC.</p><p></p><p>The ideal candidate should exhibit the following behavioral traits:</p><ul><li><p>Strong Technical communication and interpersonal skills.</p></li><li><p>Strong problem-solving abilities.</p></li></ul><p></p><p>Length of internship: 3 to 6 Months</p><p></p><p></p><p></p><b>Qualifications:</b><p></p><p>You must possess the minimum qualifications to be initially considered for this position.</p><p></p><p>Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Relevant experience can be obtained through schoolwork, classes and project work, internships, military training, and/ or work experience.</p><p></p><p>This is an internship entry level position, and it will be compensated accordingly.</p><p></p><p>This position is not eligible for Intel immigration sponsorship.</p><p><br><b>Minimum Qualifications:</b></p><p><br>Candidate should be pursuing master's or PhD in Computer Science or Electrical engineering or related field.<br><br>6+ months of experience in some of following areas:</p><ul><li><p>Programming languages, C/C++</p></li><li><p>Linux</p></li><li><p>Networking Fundamental</p></li></ul><p><br><b>Preferred Qualifications:</b></p><p><br>6+ months experience in some of the following courses</p><ul><li><p>Data Structures</p></li><li><p>Analysis and Design of Algorithm</p></li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, California, Santa Clara<p></p><p></p>Additional Locations:Virtual US and Canada<p></p><p></p><p></p><p></p>Business group:The Data Center Group (DCG) is at the heart of Intel's transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies-spanning software, processors, storage, I/O, and networking solutions-that fuel cloud, communications, enterprise, and government data centers around the world.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A<p></p><p>Annual Salary Range for jobs which could be performed in US, Colorado:</p>$52,000.00-$147,000.00<p></p><p><b>Benefits:</b></p><p>We offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, and benefits programs. Find out more information about our Amazing Benefits here.</p></div></div>",
        "index": 2,
        "skills": [
            "information technology",
            "software engineering",
            "networks",
            "c and c++",
            "project management",
            "virtual reality"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Data Science Intern - Milliman Opportunity Scholarship Match Internship - Summer 2022",
        "company": "Milliman",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1b5caf57484b694174b17f1583e81a01?lvk=lUg8GU5bj8tNyNklNEKXLg.--MCKb1zoJF",
        "posted": "2021-10-01T09:22:33.143Z",
        "lastScraped": "2021-10-04T09:22:33.143Z",
        "description": "<div><div><p><strong>Job Summary:</strong></p><p>The Life &amp; Annuity Predictive Analytics (LAPA) business unit is a lean, agile, diverse, and geographically distributed data science startup within Milliman.&nbsp; We develop leading edge data products and deploy them on the cloud as web applications for the world's premiere life insurers.</p><p>As a data science intern on the LAPA team, the successful candidate will participate in software development activities for predictive modeling projects.&nbsp; This will include but will not be limited to development, testing, documentation, and delivery of software and data science infrastructure using a variety of data science programming languages and associated technologies.</p><p><strong>Primary Responsibilities:</strong></p><ul><li>Develop R and Python scripts for data preparation, data analysis, and data visualization</li><li>Document and communicate analysis results</li></ul><p><strong>Required education</strong>:</p><ul><li>BS degree student in a computational field (e.g. Data Science, Computer <span class=\"long-word\">Science/engineering,</span> etc.)</li></ul><p><strong>Required skills and attributes</strong>:</p><ul><li>Passion for software, technology, and data</li><li>Resourcefulness in solving problems and developing solutions</li><li>Ability to work in a highly collaborative environment as well as independently with minimum supervision</li><li>Ability to take ownership of a technical challenge and see it through to a successful conclusion</li><li>Excellent written and verbal communication skills</li></ul><p><strong>Preferred knowledge and experience</strong>:</p><ul><li>Proficiency in R and Python</li><li>Experience with SQL data retrieval</li><li>Experience with the RStudio's Shiny web application framework for R</li><li>Basic knowledge of HTML, CSS, and JavaScript</li><li>Exposure to cloud computing (Azure, AWS, Google)</li></ul><p><strong>&nbsp;</strong><strong>Location:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong></p><p>Seattle, Chicago, or remote with exception of CO</p><p><strong>About Milliman:</strong></p><p>Milliman is one of the world's largest independent professional services firms. Founded in 1947, the firm provides consulting services to clients in four practice areas: healthcare, life insurance and financial services, employee benefits and pensions, and property and casualty insurance. Today, Milliman has more than 3,500 employees, in excess of $1 billion in annual revenue, and more than 60 offices worldwide.</p><p>Interested candidates should submit their resume and cover letter.</p><p>Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time. Additionally, this job description reflects management's assignment of essential functions. It does not prescribe or restrict the tasks that may be assigned.</p></div></div>",
        "index": 3,
        "skills": [
            "data science",
            "project management",
            "software engineering",
            "sql",
            "data visualization",
            "javascript",
            "python",
            "information technology",
            "web development"
        ],
        "remote": true
    },
    {
        "position": "SUMMER 2022 INTERNSHIP",
        "company": "Grimmway Enterprises",
        "location": {
            "city": "Laguna Niguel",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/fedacbee4887f7037a77ab34158b9c18?lvk=B1Nc-mAW2up8lzhdN0TMfw.--MCHK8OmTo",
        "posted": "2021-10-01T09:22:35.223Z",
        "lastScraped": "2021-10-04T09:22:35.223Z",
        "description": "<div><div><p><strong>COMPANY SUMMARY: </strong></p><p>&nbsp;</p><p>Headquartered in Bakersfield, California, Grimmway Farms traces its roots to a Southern California produce stand opened by the Grimm brothers in the early 1960s. Grimmway is a global produce leader and the world’s largest producer of carrots. Grimmway also supplies more than 65 organic USA-grown crops, and brands include Cal-Organic Farms and Bunny-Luv. Grimmway is committed to caring for customers and employees, honoring sustainable practices and preserving natural resources for future generations.&nbsp; www.grimmway.com</p><p><strong>&nbsp;</strong></p><p><strong>JOB TITLE:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; SUMMER 2022 INTERNSHIP</strong></p><p><strong>WORK LOCATION:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong>BAKERSFIELD AREA</p><p><strong>REPORTS TO:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong>DEPARTMENT MANAGER</p><p>&nbsp;</p><p><strong>PURPOSE:</strong></p><p>&nbsp;</p><p>An internship at Grimmway Farms is meant to provide a current college student an opportunity to gain related work experience in their degree field of study through a project-based experience. A summer internship is typically a ten to twelve-week full-time experience between June and August. Fall and spring internships are typically part-time and last the duration of the semester or quarter. The hours and days can vary based on a student’s class schedule. Internships are paid. Requests for college credit are supported.</p><p>&nbsp;</p><p><strong>ESSENTIAL JOB FUNCTION:</strong></p><p>&nbsp;</p><p>One to three projects will be completed that support a business need or company priority. The projects may be a portion of a larger project or stand-alone. Projects may require team work and independent work. All projects will: have an identified outcome with results that can be measured, provide opportunity to build professional relationships, provide experience in navigating in a professional organization, provide opportunity to build and leverage problem solving skills and apply educational knowledge, contribute to real business needs and lastly, have an opportunity to develop business knowledge and soft skills in support of professional development.</p><p>&nbsp;</p><p><strong>PHYSICAL REQUIREMENTS:</strong></p><p>&nbsp;</p><p>Varies by position and may include: Ability to frequently move about inside the office, food processing facilities and/or farming fields. Ability to operate a computer and other office productivity equipment. Occasionally, must be able to remain in a stationary position throughout much of the working day. Ability to work outdoors. Must be able to work in different temperatures which range between 30° F and 110° F. Ability to inspect equipment and product. Must be able to work in a high noise area.</p><br><p><strong>JOB QUALIFICATIONS:</strong></p><p>&nbsp;</p><ul><li>Actively enrolled full-time college student. </li><li>Full time status is 12 or more credit hours. </li><li>Have successfully completed one full semester or two complete quarters with a GPA of 3.0 or higher. </li><li>Have at least one semester or quarter remaining prior to graduation. </li><li>Degree programs that support Agriculture, Accounting &amp; Finance, Food Science, Purchasing, Human Resources, Manufacturing Operations, Supply Chain/Logistics, Safety, Health &amp; Environmental, Agri-business, and Engineering programs focused on systems, equipment, and processes are preferred. </li><li>Candidates from all fields of study will be considered. </li><li>Must pass pre-placement drug/alcohol screen.&nbsp;</li></ul><br></div></div>",
        "index": 4,
        "skills": [
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern - Strategic Workforce Initiative (MSIPP) - R&D Undergraduate Summer",
        "company": "Sandia National Laboratories",
        "location": {
            "city": "Albuquerque",
            "state": "New Mexico",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8ad9eeb79915c377577be0a5b5794999?lvk=1Af9cXdwVUqi1ONYgWvh6Q.--MCVESwe3F",
        "posted": "2021-09-25T09:22:37.285Z",
        "lastScraped": "2021-10-04T09:22:37.285Z",
        "description": "<div><div><p>:</p><p> We are seeking Summer - R&amp;D Undergraduate Interns to join our dynamic team! The DOE/NNSA Minority Serving Institutions Partnership Program (MSIPP) is aimed at developing the next generation of experts in cyber and information security specialist. This internship program is designed specifically for students from Minority Serving Institutions (MSI) who are currently pursuing degrees in the field of Computer Science, Computer Architecture, Computer Engineering, or any closely related field of study and are interested in furthering their knowledge in the area of cyber security and information protection while working on their undergraduate degree. The MSIPP program also provides students with the opportunity to work on a diverse collection of ongoing Sandia projects focused exclusively on high-consequence information systems and various aspects of cyber security research, including conducting science-based computer security research and vulnerability analysis as well as developing computer security tools. The MSIPP program matches skills of qualified candidates with projects and provides mentorship. The goal of the MSIPP is to foster students' appreciation for the unique challenges of cyber security and encourages the exploration of original ideas necessary to keep pace with both the rapid changes in information security technology and the increasing sophistication of cyber threats.</p><p>Minority Serving Institutions (MSI) that qualify for this internship:</p><p> + University of Texas at San Antonio</p><p> + University of Nevada at Las Vegas</p><p> + Savanna State University</p><p> + North Carolina Agricultural &amp; Technology State University</p><p> : Sandia demonstrates its commitment to public safety in the national interest by requiring that all new hires attest to their vaccination status before commencing employment. The requirement also applies to those who are telecommuting and working virtually.</p><p>Any concerns about the ability to meet this requirement should be directed to HR Solutions at (505) 284-7400. : This posting will be open for application submissions for a minimum of seven (7) calendar days, including the 'posting date'. Sandia reserves the right to extend the posting date at any time. Required: You bring the confidence and skills to be eligible for the job by meeting these minimum requirements:</p><p> + Currently attending and enrolled full time (or scheduled to graduate in the spring) in an accredited undergraduate program</p><p> + Pursuing a science, engineering, or math major</p><p> + Minimum cumulative GPA of 3.0/4.0</p><p> + Ability to work up to 40 hours per week during the summer</p><p> + U.S. citizenship</p><p> Note: If you have not yet started your undergraduate program, please apply to a high school intern position. Desired:</p><p> + Desired skills in network programming, system testing, virus and malicious code defense and basic cryptography</p><p> + Desired skills in Computer hardware, knowledge such as FPGA, VHDL, Low Level Programming</p><p> + Desired skills in software tools such as IDA Pro, VMware, Wireshark</p><p> + Desired skills in programming and scripting languages such as C,C++,C#, Java, Python, Ruby, PHP, SQL</p><p> Additional Requirements for the MSIPP:</p><p> + Majoring in Computer Science, Electrical Engineering, Computer Engineering, Mathematics or a very closely related field of study</p><p> + Undergraduate students should have demonstrated knowledge and understanding of information security, computer architecture, and networking</p><p> + Demonstrated knowledge of at least one or more programming languages</p><p> + Ability to work with more than one operating system</p><p></p><p> Department Description:</p><p>The mission of Sandia National Laboratories' Information Operations (IO) Program is to conduct research to assess, design, implement, and influence the development of national-security information systems and technologies in support of the defense and intelligence communities. Sandia is a national leader in cyber threat-discovery techniques. The team's success is grounded in a half century of experience analyzing complex systems as well as their ability to leverage Sandia's wide-ranging expertise and capabilities in science, engineering, and technology.</p><p>About Sandia: Sandia National Laboratories is the nation's premier science and engineering lab for national security and technology innovation, with teams of specialists focused on cutting-edge work in a broad array of areas. Some of the main reasons we love our jobs: Challenging work with amazing impact that contributes to security, peace, and freedom worldwide Extraordinary co-workers Some of the best tools, equipment, and research facilities in the world Career advancement and enrichment opportunities Flexible work arrangements for many positions include 9/80 (work 80 hours every two weeks, with every other Friday off) and 4/10 (work 4 ten-hour days each week) compressed workweeks, part-time work, and telecommuting (a mix of onsite work and working from home) Generous vacations, strong medical and other benefits, competitive 401k, learning opportunities, relocation assistance and amenities aimed at creating a solid work/life balance*</p><p>World-changing technologies. Life-changing careers. Learn more about Sandia at: <span class=\"long-word\">http://www.sandia.gov*These</span> benefits vary by job classification. Security Clearance: Sandia is required by DOE to conduct a pre-employment drug test and background review that includes checks of personal references, credit, law enforcement records, and <span class=\"long-word\">employment/education</span> verifications. Applicants for employment need to be able to obtain and maintain a DOE L-level security clearance, which requires U.S. citizenship. If you hold more than one citizenship (i.e., of the U.S. and another country), your ability to obtain a security clearance may be impacted.</p><p>Applicants offered employment with Sandia are subject to a federal background investigation to meet the requirements for access to classified information or matter if the duties of the position require a DOE security clearance. Substance abuse or illegal drug use, falsification of information, criminal activity, serious misconduct or other indicators of untrustworthiness can cause a clearance to be denied or terminated by the DOE, resulting in the inability to perform the duties assigned and subsequent termination of employment. EEO Statement: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status and any other protected class under state or federal law. </p></div></div>",
        "index": 5,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "java",
            "hardware",
            "networks"
        ],
        "remote": false
    },
    {
        "position": "IT Quality Assurance Intern",
        "company": "Tractor Supply",
        "location": {
            "city": "Brentwood",
            "state": "Tennessee",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8d50053478146691d2b3d65607052204?lvk=SsYeOAwOoTfd6hRc1ClDPA.--MCBocbers",
        "posted": "2021-09-25T09:22:40.376Z",
        "lastScraped": "2021-10-04T09:22:40.376Z",
        "description": "<div><div><p>This&nbsp;<strong>Summer 202</strong><strong>2</strong><strong> Internship</strong>&nbsp;will be a 12-week internship starting on May 16th, 2022 and ending on August 5th, 2022. Working at our Store Support Center in Brentwood, Tennessee, as an intern, you will work alongside TSC professionals in a variety of areas to make a real impact on our business. You will have the opportunity to work on projects in the department, get exposure to day-to-day operations and have a successful and meaningful internship.</p><p>&nbsp;</p><p>Bring your ambition, enthusiasm and big ideas to this internship and you will have a great experience!</p><br><p><strong>Projects you will be working on will include:</strong></p><ul><li>Working with the Retail Systems group on new Point-of-Sale system, you will work in the&nbsp;</li><li>Assist QA Lab on the testing of TSC/Petsense Mobile and POS systems</li><li>Work&nbsp;with tools such Microsoft Office, QTest, JIRA and SQL Queries.&nbsp;</li></ul><br><ul><li>Knowledge of QA testing</li><li>Java programming knowledge</li><li>Pursuing computer science / software engineering or equivalent major</li><li>Problem solving skills</li><li>Willingness to try new things outside of their comfort zone.</li></ul><br><p><strong><em>Tractor Supply Company (TSCO),</em></strong><em> the largest rural lifestyle retailer in the United States, is dedicated to enhancing our strong company culture built on our Team Members’ commitment to our Mission and Values.&nbsp; With over 1,900 stores in 49 states and an innovative e-commerce platform, Tractor Supply ranks in the Fortune 400 with annual revenues of more than $11 billion and growing! Come grow your career with us as we serve those who live <strong>“Life out Here”!</strong></em></p><p>&nbsp;</p><p>Click Here to See Why We are a Great Place to Work!</p><p>&nbsp;</p><p><strong>Tractor Supply Company</strong> offers a competitive Benefits package, including Medical, Dental, &amp; Vision plans, to all Full-time Team Members as well as Part-time Team Members who are deemed eligible based on a minimum hours requirement. In addition, TSC offers access to other Benefits such as a Health Savings Account, Life Insurance, 401(k), and an Employee Stock Purchase Plan.</p></div></div>",
        "index": 6,
        "skills": [
            "software engineering",
            "sql",
            "java",
            "project management"
        ],
        "start": "2021-05-16T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Financial Analysis Internship - Year Long - Part Time/Full Time Open Now",
        "company": "Bosch Packaging Technology/Osgood Industries, Inc.",
        "location": {
            "city": "Mount Prospect",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2e1c748e0f98143a6334a22b4c09e699?lvk=WSHLBYUOd_YxcjYX7BhUvA.--MCG0_yndJ",
        "posted": "2016-10-30T09:22:42.565Z",
        "lastScraped": "2021-10-04T09:22:42.565Z",
        "description": "<div><div><div><p></p> Company Description </div><div><p><strong><em>GO WITH A VALUE-DRIVEN ORGANIZATION WHOSE PARENT EARNS REVENUES OF </em>$78 BILLION EUROS A YEAR.</strong></p><p>At the <strong>Robert Bosch Tool Corporation</strong>, we know that every career matters. Which is why you should conduct yours on a grand scale. Headquartered in the northwest Chicago suburb of Mount Prospect, we are a $990 million division of Bosch, a multinational engineering and electronics organization and the largest privately held employer in the world.</p><p>Guided by the principles of founder Robert Bosch, we offer a setting where social and environmental responsibility are part of our corporate DNA. Always mindful of our impact on the future, we are committed to sustainability, paying it forward, giving back, and lifelong learning. These are but a few of the reasons why our parent company has more than 400,000 associates and a legacy of success spanning 135+ years.<strong> </strong></p><p><strong><em>Preserving the financial independence essential to innovation, Robert Bosch Tool Corporation is responsible for $990 million in annual revenues.</em></strong></p><p>As a division of a large, privately held consumer packaged goods organization, our Mount Prospect location offers the financial resources and agility to remain flexible and responsive to changes in the marketplace. Within Accounting and Finance, you may have the opportunity to collaborate with our financial planning and analysis group to support four of our key business units and shared services departments with internal and external financial reports, forecasting, and the business-planning process.</p><p><strong><em>This is your chance to go big. Go bold. And secure the future of a large and powerful organization, with Robert Bosch Tool Corporation!</em></strong></p><p><strong><em>GO BOSCH, AND EXPERIENCE BIG REWARDS.</em></strong></p><p>Robert Bosch Tool Corporation offers the competitive compensation, career-development resources, and benefits you would expect of a world leader, including health, medical, and financial plans; work/life balance; and flexible work options.</p><p><strong><em>GO BIG. GO BOLD. GO BOSCH.</em></strong></p></div><div><p></p> Job Description </div><div><p><strong>This internship will be partially remote but the hired applicant will be expected to come into the Mount Prospect office. Only local applicants will be considered.</strong></p><ul><li>Prepare financial / operational reports and ad hoc financial analysis to support sales and margin analysis for the North American Region</li><li>Run critical financial reports and work with the finance team to identify and analyze strategic trends&nbsp;</li><li>Work on analysis projects including profitability and costing</li><li>Ad hoc projects as they arise</li></ul></div><div><p></p> Qualifications </div><div><ul><li>Working toward an accredited Accounting or Finance Degree and have completed courses within major</li><li>Minimum of 3.0 cumulative GPA</li><li>Proficiency in&nbsp; MS Excel and MS PowerPoint</li><li>Problem solving, mathematical and formulation skills, reasoning and analyzing skills</li><li>Strong written and verbal communication skills</li><li>Must be a team player, detail oriented, and very organized</li><li>Must be able to successfully complete a drug and background screen pre-employment</li><li>Position only open to students who will not now, nor in the future require sponsorship to work in the United States</li></ul></div><div><p></p> Additional Information </div><div><p><em>By choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.</em></p><p><em>BOSCH is a proud supporter of STEM (Science, Technology, Engineering &amp; Mathematics) Initiatives</em></p><ul><li><em>FIRST Robotics</em><em>&nbsp;(For Inspiration and Recognition of Science and Technology)</em></li><li><em>AWIM</em><em>&nbsp;(A World In Motion)</em></li></ul><p><strong>Future sponsorship for work authorization is not available.</strong></p></div>Qualifications: Working toward an accredited Accounting or Finance Degree and have completed courses within major Minimum of 3.0 cumulative GPA Proficiency in MS Excel and MS PowerPoint Problem solving, mathematical and formulation skills, reasoning and analyzing skills Strong written and verbal communication skills Must be a team player, detail oriented, and very organized Must be able to successfully complete a drug and background screen pre-employment Position only open to students who will not now, nor in the future require sponsorship to work in the United <span class=\"long-word\">StatesResponsibilities:</span> This internship will be partially remote but the hired applicant will be expected to come into the Mount Prospect office. Only local applicants will be considered. Prepare financial / operational reports and ad hoc financial analysis to support sales and margin analysis for the North American Region Run critical financial reports and work with the finance team to identify and analyze strategic trends Work on analysis projects including profitability and costing Ad hoc projects as they arise</div></div>",
        "index": 7,
        "skills": [
            "information technology",
            "robotics",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "remote": true
    },
    {
        "position": "Mobile SW Application Developer Co-Op (Spring 2022)",
        "company": "Sierra Nevada Corporation",
        "location": {
            "city": "Sparks",
            "state": "Nevada",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/81839884beed910468d1002fcd0de057?lvk=nq5YcILO9XuMpwkAZhCJfg.--MCGJW_3ac",
        "posted": "2021-09-30T09:22:50.863Z",
        "lastScraped": "2021-10-04T09:22:50.863Z",
        "description": "<div><div><p>Come start your career with some of the brightest and most innovative minds in the country. Get your hands on actual projects and at the same time, prepare for a truly awesome career in aerospace and defense. This is not your parent's co-op - you won't be getting coffee and ordering lunch. Our Co-ops have the unique experience of getting both mentoring and coaching while working side by side with recognized industry experts on real-world assignments directly related to their field of study. Bring your knowledge and desire to learn, and we will provide the experience. Co-op's are full time, 40 hour a week commitments and typically span an entire semester, with the possibility of starting the summer before (Fall Co-op) or extending into the summer after (Spring Co-op). Depending on satisfactory completion of certain criteria during your internship, you may be considered for a full-time position upon graduation. As a Co-op, you'll ask questions, get involved, bring your ideas, be part of an actual project team, attend planning meetings, complete assignments as tasked by your team, absorb and learn from your team and apply that learning to projects assigned. You'll have the opportunity to learn fundamental business processes and procedures, build your technical foundation through practice and mentorship, and participate in an in-depth program built by our University Recruiting team, that includes cross-functional workshops and meeting with leadership to gain understanding of the business and our culture.</p><p></p><p></p><p>The Mission Solutions and Technologies (MST) business area provides affordable, turn-key command/control, communications, integrated ISR, force protection and security solutions worldwide. The MST team has a long legacy of supporting the Department of Defense, Department of Homeland Security, commercial and international customers with years of experience in platform operations, engineering and full lifecycle management across domains - air, land, sea, space and cyber. Learn more about MST</p><p></p><p>Must-haves:</p><ul><li>Must be a Sophomore, Junior or Senior in college or technical school, with at least 6 months until graduation after end of internship</li><li>Android SW Development</li><li>User Experience/User Interface Design</li><li>Automated Testing</li><li>Agile Development process awareness</li><li>Strong skills in Word, Excel, PowerPoint </li><li>Ability to work in a highly collaborative team environment</li><li>Strong organization skills and work ethic; detail oriented</li></ul><p></p><p>Preferred:</p><ul><li>Pursuing a degree in computer science focused on mobile applications, testing and UX/UI</li><li>The ability to obtain and maintain a Security Clearance may be required Learn more about the background check process for Security Clearances<p></p></li></ul><p><b>IMPORTANT NOTICE:</b></p><p></p><p>To conform to U.S. Government international trade regulations, applicant must be a U.S. Citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State or U.S. Department of Commerce.</p><p>At Sierra Nevada Corporation (SNC) we deliver customer-focused technology and best-of-breed integrations in the aerospace and defense sectors. SNC has been honored as one of the most innovative U.S. companies in space, a Tier One Superior Supplier for the U.S. Air Force, and as one of America's fastest-growing companies. Learn more about SNC</p><p></p><p></p><p></p><p></p><p>SNC offers a generous benefit package, including medical, dental, and vision plans, 401(k) with 150% match up to 8%, life insurance, 3 weeks paid time off, tuition reimbursement, and more.</p><p></p><p></p><p>At Sierra Nevada Corporation (SNC), our mission is to dream, innovate, inspire and empower the next generation to transform humanity through technology and imagination. As an Equal Opportunity Employer, we welcome our employees to bring their whole selves to their work. SNC is committed to fostering an inclusive, accepting, and diverse environment free of discrimination on the basis of race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Contributions to SNC come in many shapes and styles, and we believe diversity in our workforce fosters new and greater ways to dream, innovate, and inspire.</p></div></div>",
        "index": 8,
        "skills": [
            "project management",
            "c and c++",
            "machine learning",
            "information technology",
            "software engineering",
            "mobile development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Clinical Exercise Physiologist - Per Diem",
        "company": "Swedish Covenant",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b6c59ba4ccb939421e150397bad127e7?lvk=SgN_dJTftUYwV4R4DJ43BA.--MBwfKM48w",
        "posted": "2021-09-27T09:22:52.047Z",
        "lastScraped": "2021-10-04T09:22:52.047Z",
        "description": "<div><div><p><strong><em>JOB SUMMARY</em></strong><em>:</em></p><ul><li>To provide a safe and effective exercise program for individuals with known coronary heart disease.</li><li>To provide diagnostic cardiology tests which include graded exercise tests, nuclear stress tests, stress echocardiogram and 24-hour dynamic ECG.</li></ul><p><strong><em>RESPONSIBILITIES</em></strong><em>:</em></p><p>Essential Functions - The percentage of time dedicated to a particular task is dependent on the needs of the departmental areas.</p><p><em>*Demonstrates a commitment to the mission of Swedish Hospital and demonstrates a service orientation and adheres to all responsibilities and standards of the Hospital.</em></p><ul><li>Assesses, plans, implements and evaluates the care of assigned patients based upon current standards and practices.</li><li>Teaches Cardiac Rehab education classes.</li><li>Administering of all variations of graded exercise tests.</li><li>Responsible for the application and scanning of Holter Monitors other Mobile Telemetry Cardiac Monitors.</li><li>Required to be part of the Low-Risk Chest Pain Pathway On-Call rotation.</li><li>Generation of reports. (i.e. statistics, cardiology section, test results, patient summaries, CQI and the double blind studies to CQI).</li><li>Responsible for maintaining and ordering supplies and equipment, including crash cart supplies needed for Cardiac Rehab/Non-Invasive Cardiology Services.</li><li>Seeks opportunity for educational experience that enhances own professional growth and development.</li><li>Any other function assigned by <span class=\"long-word\">Supervisor/Manager.</span></li></ul><p>Other Functions</p><ul><li>Miscellaneous office tasks (i.e. answering phones, scheduling patients, registration, billing, typing, copying).</li></ul><p><strong><em>PATIENT CARE/AGE SPECIFIC RESPONSIBILITIES AND QUALIFICATIONS</em></strong><em>:</em></p><p>This position will need to recognize needs and behaviors of a variety of age groups of patients treated and look for signs of normal aging.</p><p><strong><em><span class=\"long-word\">QUALIFICATION/BASIC</span> JOB REQUIREMENTS</em></strong><em>:</em></p><p>Education - Bachelor of Science or Masters of Science degree in clinical exercise physiology, kinesiology, exercise science or equivalent with knowledge of human anatomy, physiology, cardiovascular health and disease, <span class=\"long-word\">electrocardiography,</span> and exercise leadership.&nbsp;</p><p>Experience - It is desirable that the employee have some experience in health care. Cardiac rehab and/or stress testing experience is preferred.</p><p>Skills - Performs 12-lead and exercise ECG's, explains the benefits of risk reduction. Appropriately assesses patients for stress testing and cardiac rehab. Ability to maintain good relationship with patients, physicians and co-workers. Ability to observe and communicate accurately and effectively.&nbsp; Knowledge or willingness to learn dynamic (Holter) <span class=\"long-word\">electrocardiography.</span>&nbsp;&nbsp; Good computer skills are desirable.</p><p><span class=\"long-word\">Qualitative/Quantitative</span> production standards - Accuracy is essential since patient safety may be jeopardized otherwise. A positive, enthusiastic attitude towards the philosophies and activities of cardiac rehabilitation, health and fitness is extremely helpful.&nbsp; Personal involvement in a fitness program is a desirable asset.&nbsp; Willingness to participate in outside activities (such as road races) where patients are involved is desirable.</p><p><strong><em><span class=\"long-word\">LICENSE/CERTIFICATION</span></em></strong><em>:</em></p><p>CPR certification and American College of Sports Medicine (ACSM) Certified Clinical Exercise Physiologist or Registered Clinical Exercise Physiologist or equivalent is preferred. Advanced Cardiac Life Support (ACLS)&nbsp; required within 6 months of employment.</p><p><strong><em>MANAGEMENT RESPONSIBILITY</em></strong><em>:</em></p><p>Not applicable.</p><p><strong><em>INTERNAL AND EXTERNAL CONTACTS</em></strong><em>:</em></p><p>Extensive patient contact, both at the exercise testing laboratory and the exercise programs. May be in contact with patient's relatives and friends who may be at the laboratory or gym during the visit.&nbsp; Frequent contact with co-workers, staff physicians, physicians outside the hospital, student interns and personnel in other departments of the hospital.</p><p><strong><em>ACCESS TO PROTECTED HEALTH INFORMATION</em></strong></p><ul><li>Name, demographic and clinical</li><li>Computer system access is assigned based on manager's access level request and on the minimum necessary as described on this job description.&nbsp; Approval for level of access is given by the system administrator or manager of the department that has ownership of system/module.&nbsp; (See Computer System Access Controls Policy)</li></ul><p><strong><em>ENVIRONMENT</em></strong><em>:</em></p><p>Physical Effort - Primary body position at work is standing (60%); walking (12%); sitting (28%). Lifts/moves blood pressure stand (10 lbs.) and crash cart (50 lbs.).&nbsp; On occasion, also carries exercise equipment (100 lbs.), boxes of files (40 lbs.) and supplies (5-10 lbs.) to and from the hospital and the Galter LifeCenter.&nbsp; Repetitive activities include taking blood pressure and pulse; watching ECG monitor.</p><p>Work Hazards - Exposure to noise (combination of exercise equipment, music and people) - 50%. Possibility of exposure to Technetium-99m (Myoview) during Myoview stress testing (20%); blood exposure in assisting with IV's (20%); frequent exposure to sweat (60%).</p><p><em>&nbsp;</em></p><p><em>The above statements are intended to describe the general nature and level of work performed by employees assigned to this classification. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel to classify.</em></p></div></div>",
        "index": 9,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "SUPPLY TECH (INVENTORY)",
        "company": "Naval Supply Systems Command",
        "location": {
            "city": "96860",
            "state": "Hawaii",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f578094f2ced7173224197f48df3b1ae?lvk=m1EQnWCnoVGGVvRN2TtDyw.--MCGE2NveV",
        "posted": "2021-10-01T09:22:53.344Z",
        "lastScraped": "2021-10-04T09:22:53.344Z",
        "description": "<div><p>Summary You will serve as a Supply Technician (Inventory) of NAVSUP FLT LOGISTICS CNTR PEARL HARBOR (647th Logistics Readiness Squadron, Joint Base Pearl Harbor-Hickam) Responsibilities You will develop annual inventory schedule for the Air Force Stock Record Account and execute physical inventories and location surveys of account assets and other materiel/product on the Accountable Officer's records. You will input inventory counts into the Integrated Logistics System-Supply (ILS-S) or ILS-S Mobility Asset Management program, receive computer generated inventory summaries, and review summaries for analysis. You will conduct causative research investigations and analysis on all unresolved inventories of sensitive items, classified items, pilferable items, weapons, Communications Security, mobility, other commodities. </p><p>You will advise on ways to improve the efficiency and economy of supply operations. Requirements Conditions of Employment Qualifications Your resume must demonstrate at least one year of specialized Supply Technician experience equivalent to the next lower grade level (GS-06) or pay band in the federal service or equivalent experience in the private or public sector performing supply work which requires the knowledge of policies, procedures and techniques of inventory management in order to determine physical inventory and location requirements. I have experience utilizing automated supply and inventory databases to conduct investigations. </p><p>I also have experience performing causative research for inventory discrepancies, reviewing transaction histories and receipt documents in order to determine the cause of discrepancies. Examples of specialized experience may include: 1) Plan and prepare physical inventory schedules and location survey utilizing automated supply databases; 2) Prepare necessary computer inputs by establishing opening and closing dates for physical inventories, actual physical counts, matching counts with records, performing recounts and preparing adjustment inputs; 3) Coordinate and conduct scheduled inventory, and location survey to minimize disruption of operations and ensure accuracy of inventory or location audit; 4) Conduct investigations of inventory discrepancies, researching transactions through the supply cycle. Additional qualification information can be found from the following Office of Personnel Management website: <span class=\"long-word\">https://www.opm.gov/policy</span>-data-<span class=\"long-word\">oversight/classification</span>-<span class=\"long-word\">qualifications/general</span>-schedule-qualification-<span class=\"long-word\">standards/#url=List</span>-by-Occupational-Series Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). </p><p>Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. Education Additional Information This position is covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. </p><p>A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. A Cost-of-Living-Allowance (COLA) of 10.28% will be added to the stated salary. COLA is subject to change at any time. </p><p>This position is eligible for part time, full time or ad-hoc telework at the discretion of management. This position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required. </p><p>If you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: <span class=\"long-word\">http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf</span> ICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate for this vacancy, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category or higher. </p><p>For more information about ICTAP eligibility please review the following link: <span class=\"long-word\">https://www.usajobs.gov/Help/working</span>-in-government/unique-hiring-paths/federal-employees/ictap/ Military Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position. Only Military Spouse Preference applicants currently occupying positions for which a comprehensive training plan has been developed and authorized are entitled to exercise their priority status for this announcement. </p><p>The most common formal training positions are apprentices, formal interns, and scientist and engineering interns. Upward Mobility Positions that have equivalent training plans are also included when the positions have been pre-identified in an Affirmative Action or similar plan. You must provide documentation supporting you are in a formal training plan (e.g., SF50 and official signed training agreement between you and your command).</p></div>",
        "index": 10,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Senior Network Adminstrator",
        "company": "KARL STORZ",
        "location": {
            "city": "El Segundo",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2dd1fdd8d91c86b46edd79119a05fb08?lvk=T6Adh-1R7ovi9J_G9hoxtg.--MCGA55yP7",
        "posted": "2021-10-01T09:22:54.868Z",
        "lastScraped": "2021-10-04T09:22:54.868Z",
        "description": "<div><div><p></p><p>Company:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; KARL STORZ Endoscopy-America, Inc. (KSEA)</p><p>Job Code:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;11948</p><p>Pay Grade:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; TBD</p><p><strong>Description</strong></p><p>KARL STORZ SE &amp; Co. KG based in Tuttlingen, Germany, is a family-owned, global company committed to benefiting humanity by advancing medical technology through innovation and education.</p><p>For more than 75&nbsp;years, KARL STORZ has been dedicated to earning its international reputation as a leader that designs, engineers, manufactures, and markets all its products with an emphasis on visionary design, precision craftsmanship, and clinical effectiveness.</p><p></p><p>KARL STORZ is currently seeking a Senior Network Administrator to join the Global IT Department.&nbsp; The primary responsibility of this role is to ensure a high degree of quality designs for KARL STORZ network and systems by establishing architecture and design standards, reviewing processes for strategic vendors and internal administrators and the associated methodology to successfully deliver approved solutions to the enterprise. </p><p>This role will be based in our Auburn, MA location and offer the opportunity to work remotely 1-2 days a week.&nbsp;</p><p><b>Responsibilities</b></p><p>Key responsibilities will include, but may not be limited to:</p><ul><li>Provides guidance and leadership on the design and development across multiple technologies and platforms.&nbsp; </li><li>Minimizes risk of detrimental effects when technologies are adopted, improves the success of implemented technology infrastructure and maintains historical records of all technical designs and changes to the designs. </li><li>Updates, upgrades and installation of new network components.</li><li>Ensures Local Network and Wide Area Network are funning efficiently, patched and updated, and tuned to the highest level of performance.&nbsp; Collaborates with team members to ensure best practices are being used to maximize network uptime. </li><li>Performs system analysis and reporting of multiple systems within the network. </li><li>Creates proper documentation of current and new solutions to ensure repeatable run operations. </li><li>Remains abreast of industry standards and best practices for infrastructure technologies.</li><li>Assists with all Disaster Recovery System tests.</li><li>Coordinates with external vendors, service providers, consultants and experts.</li></ul><p>&nbsp;<b>Requirements</b></p><p>Our successful candidate will have excellent written and spoken English language business communication skills. They will also have demonstrated success working in a collaborative, service-oriented team environment.&nbsp;</p><p>&nbsp;Additional requirements include, but are not limited to:</p><ul><li>Bachelor's degree, preferably in Computer Science or related major.</li><li>3-5 years of experience in technical infrastructure, networking and system operations as an IT Network Administrator or equivalent role.&nbsp; Data Center and/or Network experience highly preferred. </li><li>Demonstrated experience with CISCO, Fortinet, WAN, LAN and VPN.</li><li>Experience with servers such as Cisco USC, IBM System X and Dell PowerEdge.</li><li>Experience with current Microsoft technologies. Working knowledge of Visio, MS Project and MS Office Suite. </li><li>Proven process and analysis and improvement skills.</li><li>Strong organizational skills and project management skills.</li><li>Ability to collaborate and work effectively within a team environment and also able to work independently. </li><li>Ability to work after business hours and weekends as requested for operational needs; available to be on-call once a month on a rotational basis.&nbsp; </li><li>Ability to travel domestically as well as internationally, approx. 10-15%. </li></ul><p>Preferred, but not required:</p><ul><li>MCSE certification</li><li>CISCO certifications</li><li>ITIL certification</li><li>German language skills a plus.</li><li>Experience working in a global company a plus.</li></ul><p>#LI-CW1 </p><p></p><p><strong>Vaccine requirements at KARL STORZ due to COVID-19</strong><br> KARL STORZ is committed to maintaining a safe work environment for our employees and therefore we require the COVID-19 vaccine for all of our employees unless otherwise due to an underlying medical condition or <em>sincerely held</em> religious beliefs. During the interview process, we encourage you to ask how COVID-19 may impact the role you are seeking and if you require a reasonable accommodation regarding the vaccine requirement see below on the process for requesting accommodation. Please&nbsp;click here&nbsp;to learn more about our overall response to COVID-19.</p><p><strong>Employee Benefits Program Overview for U.S. Locations</strong></p><ul><li>Medical / Dental / Vision including a state of the art wellness program and pet insurance, too!*</li><li>3 weeks' vacation, 10 holidays plus paid sick time*</li><li>401K retirement savings plan providing a match of 60% of the employee's first 6% contribution</li><li>Section 125 Flexible Spending Accounts</li><li>Life, STD, LTD &amp; LTC Insurance</li><li>Tuition reimbursement of up to $5,250 per year</li><li>Fitness reimbursement up to $200 annually</li><li>Employee referral program of up to $2,000 per hire</li><li>And much more!</li></ul><p><em>*Field sales, internships and part-time employees are not eligible except for where required by state law.<br> Non-employees, including temporary workers and consultants, are not eligible to participate in KARL STORZ benefits program.</em></p><p>KARL STORZ reserves the right to change or modify the employee's job description whether orally or in writing, at any time during the employment relationship. Additionally, KARL STORZ, through its supervisors, may require an employee to perform duties outside their normal description within the sole discretion of the supervisor. Employee must comply will all applicable KARL STORZ policies and procedures.</p><p><strong>Equal Employment Opportunity &amp;&nbsp;</strong><strong>Reasonable Accommodation&nbsp;</strong><strong>Statement</strong><br> KARL STORZ is committed to creating an inclusive space where employees are valued for their skills and unique experiences.&nbsp; To achieve this goal, we are committed to diverse voices and all applicants will receive consideration without regard to race, color, sex, national origin, disability, veteran status or any other protected characteristic.&nbsp; KARL STORZ is also committed to providing reasonable accommodations during our recruitment process.&nbsp; Should you need assistance or accommodation please email us at ...</p></div></div>",
        "index": 11,
        "skills": [
            "project management",
            "networks",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Chubb Associate, Westchester Financial Lines",
        "company": "Chubb",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/edad4c38bb99cc3a3d95403c2c408f23?lvk=VyK7h9mlZZzveGlobqrEbA.--MCUszZMao",
        "posted": "2021-09-25T09:22:56.203Z",
        "lastScraped": "2021-10-04T09:22:56.203Z",
        "description": "<div><div><p><b>Chubb Associate Program</b></p><p>Chubb is looking for an aspiring insurance professional with a Bachelor's Degree to join our Chubb Associate Program.&nbsp;</p><p>As the industry leader in Property &amp; Casualty insurance, Chubb is an employer of choice for a student aspiring to develop a meaningful career in a fast-paced, diverse company.&nbsp;This is a full-time position and a compelling opportunity to join a global, growing, financially stable and successful company.</p><p>&nbsp;</p><p>We have designed our Chubb Associate Program to hone your skills and talents and help you reach your career goals.&nbsp; By joining the Chubb Associate Program, you will be part of an experience that supports the well-rounded development of critical business skills which in turn contributes to the future success of our company. Our blended program is designed to include hands-on business assignments in a variety of disciplines, interactive classroom instruction, team assignments and direct interaction with other early career professionals as well as with many of our senior executives.&nbsp; As part of this program you will receive:&nbsp;</p><ul><li>Challenging assignments and the opportunity to contribute to the result of a team;</li><li>Business training unique to a career at Chubb;</li><li>Technical training to deepen your skill level within your chosen discipline; and an understanding of our broader industry;</li><li>Interpersonal effectiveness training to help you gain strong communication and interactive skills;</li><li>Access to additional training to compliment your professional development.</li></ul><p><b>We are excited about and committed to the Chubb Associate Program because we believe that we are developing talented professionals with the potential to become Chubb's leaders of the future.</b></p><p>&nbsp;</p><p>Qualifications</p><p><b>Who are we looking for?&nbsp;</b>&nbsp;</p><p>Successful professionals at Chubb come from many backgrounds and experiences and bring that rich diversity with them to our company.&nbsp; They also have some things in common and these attributes will lead to your success at Chubb:&nbsp;</p><ul><li><b>Results orientation:</b>&nbsp;a demonstrated ability to meet commitments under pressure</li><li><b>Practical intellectual agility:&nbsp;</b>capable and confident in absorbing new information</li><li><b>Personal capacity:</b>&nbsp;accepting and welcoming of additional responsibility over time</li><li><b>Communication skills:</b>&nbsp;an ability to communicate successfully in various settings</li><li><b>Interpersonal/team skills:</b>&nbsp;works effectively with all colleagues and collaborates within and across departments</li><li><b>Initiative:</b>&nbsp;an ability to take full ownership of work and show initiative as needed</li><li><b>Customer focused:</b>&nbsp;service oriented, recognizing the importance of understanding client needs</li><li><b>Integrity and work ethic:&nbsp;</b>a commitment to hard work and a high ethical conduct</li><li><b>Successful academic record:</b>&nbsp;Minimum GPA of 3.0</li></ul><p>Successful candidates will be:</p><ul><li>Curious; passionate about learning</li><li>Flexible and adaptable; a change agent</li><li>Resilient and resourceful</li><li>Collaborative; able to lead and follow</li></ul><p>Desired Qualifications</p><ul><li>Bachelor's degree; many majors will be considered; slight preference to Risk Management, Business, or Computer Science</li><li>Strong GPA; 3.3 or higher preferred</li><li>Prior work experience (including summer or part time roles) or internships preferred</li><li>Demonstrated active engagement in extracurricular activities</li><li>Some knowledge of insurance concepts, practice, and procedures is desirable</li><li>MS Office experience, including Word, Excel, and Outlook</li><li>Oral and written communication skills</li><li>Demonstrated skills in: <ul><li>Critical thinking</li><li>Influencing both formally and informally</li><li>Articulating a message / point of view in presentation and in writing</li></ul></li></ul><p>&nbsp;</p><p><b><i>Chubb strives to offer a diverse and inclusive and rewarding work environment.&nbsp; Teamwork and mutual respect are central to how Chubb operates and we believe the best solutions draw upon diverse perspectives, experiences and skills.&nbsp; We operate in such a way where everyone, regardless of their singular background has the opportunity to contribute to our collective success.</i></b><br> &nbsp;</p><p>Chubb offers a competitive compensation package and comprehensive benefits package including life, health and dental, vision, a generous retirement savings plan, disability coverage, stock purchase plan, flexible spending accounts, tuition reimbursement, and business casual dress. At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religion, age, sex, sexual orientation, transgender, national origin, disability, genetic information, veteran or marital status, or any other characteristic protected by law.</p></div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "AI Research Resident - Salesforce Research",
        "company": "Salesforce.com, Inc",
        "location": {
            "city": "Palo Alto",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e54690408c7a2d54a6368edba9633965?lvk=wF_AjOgC7KlwruP_QwVl-w.--MCGGD-DYg",
        "posted": "2021-09-29T09:22:57.543Z",
        "lastScraped": "2021-10-04T09:22:57.543Z",
        "description": "<div><div><p>_To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts._</p><p>**About Futureforce University Recruiting**</p><p>Our Futureforce University Recruiting program is dedicated to attracting, retaining and cultivating talent. Our interns and new graduates work on real projects that affect how our business runs, giving them the opportunity to make a tangible impact on the future of our company. With offices all over the world, our recruits have the chance to collaborate and connect with fellow employees on a global scale. We offer job shadowing, mentorship programs, talent development courses, and much more.</p><p>**Job Category** Intern</p><p>**Job Details**</p><p>**Position will be taken down** **November 1st @ 5:00 PM PT**</p><p>Salesforce Research is pioneering in the field of deep learning, natural language processing and artificial intelligence. At Salesforce, the research team is committed to collaborating with the wider research community; while research scientists have the opportunity to work directly on advancing technologies that customers use as part of the Einstein AI Platform, they may also focus exclusively on high-impact publications. We believe that making substantive progress on hard applications can drive and sharpen the research questions we study, and, in turn, scientific breakthroughs can spawn entirely new applications. With this in mind, the team maintains a portfolio of projects.</p><p>The Salesforce AI Residency Program will foster the next generation of AI researchers and applied engineers. This 12-month research training program is intended to kickstart or further one's experience in AI research. Residents will gain valuable hands-on experience in fundamental and applied AI research, working closely with Salesforce researchers. Our goal is to help propel residents and make them more qualified candidates for top PhD programs. All residents will have the opportunity to transition to full-time AI researchers in the industry.</p><p>The ideal candidate has a degree (MS or PhD) or equivalent experience in the STEM field such as CS, Math, Statistics, Economics, Bioinformatics, and related fields. We also highly encourage candidates with non-traditional backgrounds and experiences to apply to our program. Candidates will be highly motivated individuals eager to learn and have a strong interest and passion for machine learning research.</p><p><span class=\"long-word\">**Responsibilities:**</span></p><p>+ AI Residents to participate in Salesforce Research projects and areas of interest while earning their doctorate/graduate degree + Expected to spend at least 50% of time at Salesforce research facility to work on research projects + Develop innovative techniques and solutions for real world, large scale problems + Publish high quality research papers at top-tier conference or journal venues</p><p>**Requirements:**</p><p>+ Obtained Master or PhD degrees in STEM field such as CS, Math, Statistics, Economics, Bioinformatics, and related fields + Graduated from top local or global universities with excellent academic records + Passion in the research areas of Artificial Intelligence, Deep Learning, Machine Learning, Natural Language Processing (NLP), Computer Vision, Big Data, Data Mining and Business analytics, etc.</p><p>For more information on the program, visit our website (details to be shared soon)</p><p>**Accommodations**</p><p>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form <span class=\"long-word\">(https://careers.mail.salesforce.com/accommodations</span>-request-form) .</p><p>**Posting Statement**</p><p>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.</p><p>Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com <span class=\"long-word\">(http://salesfore.com/)</span> or Salesforce.org .</p><p>Salesforce welcomes all.</p><p>Founded in 1999, Salesforce is the global leader in Customer Relationship Management (CRM). Companies of every size and industry are using Salesforce to transform their businesses, across sales, service, marketing, commerce, and more by connecting with customers in a whole new way. We harness technologies that can revolutionize companies, careers, and, hopefully, our world.</p><p>Salesforce is built on a set of four core values: Trust, Customer Success, Innovation, and Equality. By making technology more accessible, we're helping create a future with greater opportunity and equality for all. This has taken our company to great heights, including being ranked by Fortune as one of the \"Most Admired Companies in the World\" and one of the \"100 Best Companies to Work For\" eleven years in a row, and named \"Innovator of the Decade\" and one of the \"World's Most Innovative Companies\" eight years in a row by Forbes.</p><p>There are those who choose to work with the best and brightest. And then, there are those who want to do more than just a job. They are the ones improving lives, not only their careers. Having an impact now instead of later. Doing something that's so much bigger than themselves, an industry, and their company.</p><p>We believe everyone can be a Trailblazer. Join Salesforce and discover a future of new opportunities.</p></div></div>",
        "index": 13,
        "skills": [
            "machine learning",
            "artificial intelligence",
            "project management",
            "information technology",
            "bioinformatics",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "SUT Finance Intern",
        "company": "Thermo Fisher Scientific",
        "location": {
            "city": "Carlsbad",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6d26f1cacb8ff95c98ee6495471be788?lvk=kf1z9-aAkDHgWtJO9lh-1g.--MCL6csRvo",
        "posted": "2021-10-02T09:22:58.529Z",
        "lastScraped": "2021-10-04T09:22:58.529Z",
        "description": "<div><div><p>Auto req ID: 175714BR <br>Job Description: </p><p><b><b>Job Title</b></b></p><p>SUT Finance Intern</p><p>&nbsp;</p><p><b><b>Summary of Internship</b></b></p><p>The SUT Finance internship position provides an opportunity for undergraduate students who are currently pursuing a finance, accounting, or related degree to get hands on experience working with finance professionals and business leaders in a fast-paced environment. The finance intern will contribute to reporting and data analysis for key decisions as well help to further drive efficiency. This position starts in May working 40 hours per week until September. Opportunity exists for the position to continue through the year on a part time basis to allow for class schedules.</p><p>&nbsp;</p><p><b><b>Crucial Functions</b></b></p><ul><li>Provide data support to SUT Finance team including generation of key reports and validation of <span class=\"long-word\">costs/categorization</span></li><li>Support a variety of business initiatives crafted to increase revenue and optimize profitability</li><li>Be involved in many aspects of financial review and decision-making tasks/processes</li><li>Learn about analytical standard methodologies and develop financial acuity through daily engagement</li><li>Accept feedback and look for areas of improvement</li><li>Specific task to be tailor the individual's experience level and abilities</li></ul><p>&nbsp;</p><p><b><b>Skills and Abilities</b></b></p><ul><li>Ability to work independently and as a member of a cross-functional team</li><li>Ability to learn, be mentored, and improve</li><li>Desire to contribute and improve design of financial reporting and processes</li><li>Outstanding customer mentality</li><li>Familiarity with financials</li><li>Strong attention to detail</li></ul><p>&nbsp;</p><p><b><b>Qualifications</b></b></p><ul><li>Pursuing a degree in finance, accounting, or related field</li><li>Experience with Microsoft Excel</li></ul><p>&nbsp;</p><p>To qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status.</p><p>&nbsp;</p><p>*TFSInternship2021</p><p><span class=\"long-word\">*TFSEarlyTalent2021</span></p><br>Position Title: SUT Finance Intern <br>Country / State - City: US - California - Carlsbad, US - Massachusetts - Waltham, US - Utah - Logan, US - Utah - Salt Lake City <br>Job Category: Internship &amp; Apprenticeship <br>Thermo Fisher Scientific: is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status. <br></div></div>",
        "index": 14,
        "skills": [
            "machine learning"
        ],
        "start": "2021-05-01T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "PHARMACIST 2 - OUTPATIENT INFUSION (PART-TIME, ROTATING/VARIABLE SHIFTS)",
        "company": "University of Washington",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5b2bd706a94bfc1b464494aeb989f0ed?lvk=VQ8LYfR4y-DfOLaw2g1uZA.--MCLFxPwWg",
        "posted": "2021-10-01T09:22:59.807Z",
        "lastScraped": "2021-10-04T09:22:59.807Z",
        "description": "<div><div><p>Req #: 196899</p><p> Department: SEATTLE CANCER CARE ALLIANCE / UW MEDICINE</p><p> Job Location Detail: SEATTLE CANCER CARE ALLIANCE</p><p></p><p>Posting Date: 09/29/2021</p><p></p><p>Closing Info: Open Until Filled</p><p></p><p> Salary: $8,917 - $12,758 per month</p><p></p><p> Shift: Alternate Work Shift</p><p></p><p> Notes: Our people are the most important asset in our pursuit of achieving excellence in education, research, and community service. Our staff not only enjoys outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, intellectual excitement, artistic pursuits, and natural beauty. This position provides opportunities to work in a fast-paced, challenging, diverse and rewarding environment. As an employee you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. <span class=\"long-word\">(http://hr.uw.edu/benefits/wp</span>-<span class=\"long-word\">content/uploads/sites/3/2018/02/benefits</span>-classified-staff-20191231.pdf)</p><p></p><p></p><p> The mission of University of Washington Medicine is to improve the health of the public by advancing medical knowledge, providing outstanding primary and specialty care to the people of the region, and preparing tomorrow's physicians, scientists and other health professionals. UW Medicine owns or operates the following: Harborview Medical Center, Valley Medical Center, UW Medical Center - Montlake, UW Medical Center - Northwest, a network of UW Medicine Neighborhood Clinics that provide primary care, UW Physicians, UW School of Medicine, Airlift Northwest, and other owned, operated, or affiliated entities as appropriate. In addition, UW Medicine shares in the ownership and governance of Children's University Medical Group and Seattle Cancer Care Alliance. The Seattle Cancer Care Alliance (SCCA) Oncology Pharmacist team provides extensive pharmaceutical care to inpatient and ambulatory patients. In addition to direct care, pharmacists participate in drug therapy consults, conduct clinical research protocols, provide <span class=\"long-word\">patient/family/staff</span> education, and precept pharmacy students and residents. SCCA combines the adult and pediatric oncology patient care services of three world-renowned cancer care institutions Fred Hutchinson Cancer Research Center, Seattle Children's, and UW Medicine. SCCA has an outstanding opportunity for a PART-TIME PHARMACIST 2 - OUTPATIENT INFUSION (50%, Rotating/Variable Shifts). The Pharmacist 2 will perform professional pharmaceutical dispensing and clinical functions in the Ambulatory Pharmacies. The Pharmacist 2 will also provide drug information and education to patients and family members, providers, nurses, and other healthcare professionals, in addition to providing pharmaceutical care to patients. RESPONSIBILITIES: Dispensing: Conduct a thorough patient profile review to assess the appropriateness of the prescribed medication, including monitoring for drug duplications, interactions, allergies, appropriate dose, strength, and route of administration at the time each order is received; document relevant information in medical record as required. Promote rational, cost-effective drug therapy by promoting the use of formulary items and optimizing patient care through appropriate selection of treatment options. Evaluate all provider orders and verify correctness of entry in the pharmacy computer system and computerized patient profiles. Direct pharmacy technicians in all areas of technical responsibilities. Ensure proper preparation and labeling of all medications. Ensure that controlled substances are properly stored, dispensed, recorded, and inventoried. Interview patients and provide education regarding their medications. Ensure that all bulk packaged items are properly prepared, labeled, and documented. Ensure correct aseptic preparation, labeling, and delivery of compounded sterile products. Perform routine visual observation and oversight to ensure proper garbing, handwashing, cleaning, and aseptic technique processes is followed during sterile compounding. Other duties: Provide drug information to patients, physicians, nurses, and other members of the healthcare team. Provide in-services to staff as requested. Participate in protocol development, exploratory projects and committees which contribute to improved patient care. Document clinical interventions as appropriate. Detect, monitor, document, and report any adverse drug reactions and medication errors. Assist in developing safe medication practices to prevent errors. Participate in teaching pharmacy students, interns, and technicians, and guiding experiential training. Comply with all state and federal pharmacy laws. Perform related duties as assigned. DESIRED: Strong customer service orientation. Demonstrated ability to effectively use computerization for efficient operations. Professional and effective verbal and written communication skills. University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sexual orientation, gender identity, sex, age, protected veteran or disabled status, or genetic information.</p></div></div>",
        "index": 15,
        "skills": [
            "data visualization",
            "networks",
            "project management",
            "information technology",
            "cybersecurity"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Tax FP&A and Modeling Intern - Spring 2022",
        "company": "Walt Disney",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6d831133da5a6606acac311d420f2c76?lvk=m4NBe78Z-HYKeuGE849nzA.--MCCFQiWWR",
        "posted": "2021-09-29T09:23:01.104Z",
        "lastScraped": "2021-10-04T09:23:01.104Z",
        "description": "<div><div><p>Job Posting Title: Tax FP&amp;A and Modeling Intern - Spring 2022 <br>Job Description: Be a part of an innovative team and culture...<br><br>Disney Tax Financial Planning &amp; Analysis and Modeling (\"Tax FP&amp;A\") is a key component of Disney Tax that provides team members with varied opportunities to build skills and empower the tax professional of the future. We are searching for innovative team members who thrive on change and discovery. This is an exciting opportunity to make an impact through meaningful change. <br>Req ID: 860822BR <br>City: Glendale <br>Job Type: Temporary/Seasonal <br>Country / Region: US <br>State/Provice: CA <br>Segment: The Walt Disney Company (Corporate) <br>Internship Program Subtype: Professional Internship <br>Additional Information: </p><div><strong>Internship Eligibility:&nbsp;</strong></div><ul><li>Must be at least 18 years of age</li><li>Must not have completed one year of continual employment on a Disney internship or program.</li><li>Must possess unrestricted work authorization</li><li>The approximate dates of this internship are January 2022 through June 2022.</li><li>Candidate must be available to work part-time&nbsp;hours (approximately 20 hours per week) for the duration of the internship</li><li>Able to provide own housing and transportation in the Los Angeles, CA or Orlando, FL area, Remote applicants also accepted</li></ul><br>Category: Finance and Accounting <br>Basic Qualifications: What we are looking for...<ul><li>Desire to learn</li><li>Experience as a good teammate with strong interpersonal skills</li><li>Excellent verbal and written communication skills</li><li>Detail oriented</li><li>Proficiency in Microsoft Suite of tools (i.e., Excel, PowerPoint, Word, Visio)</li></ul><br>Business: The Walt Disney Company (Corporate) <br>Required Education: <ul><li>Currently enrolled in an accredited college or university and taking at least one class, or be a recent graduate of an accredited college or university within the last six (6) months at time of application, or be currently participating in the Disney College Program, Disney Culinary Program or Disney Professional Internship Program</li></ul><br>Preferred Qualifications: <ul><li>Experience using SAP</li><li>Familiarity using Alteryx and/or other ETL tool(s)</li><li>Working knowledge of Microsoft PowerApps (i.e., Microsoft PowerQuery, Microsoft PowerPivot)</li></ul><br>Postal Code: 91201 <br>Preferred Education: <ul><li>Preferred focus on Accounting and/or Data Science</li></ul><br>Responsibilities: A Day in the Life...<br><br>Tax FP&amp;A is a dynamic group of tax planners who are passionate about making the tax world a better place via problem-solving and data analysis. Every day in Tax FP&amp;A will be different. On a given day you might:<ul><li>Assist in preparing a tax forecast</li><li>Work closely with Tax FP&amp;A team members to help Tax Compliance and Tax Operations teams to identify pain points and solutions to streamline efficiency</li><li>Develop tax models that tell the story of our present and point to the best path forward for our future</li><li>Engage in ad-hoc new projects</li><li>Become an architect of automation for various tax processes</li></ul><br></div></div>",
        "index": 16,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Impact Research Intern",
        "company": "Kiva",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/04b6674fb94c2506b457c858d3789911?lvk=DyxUQc_-Mg9SCnsFEN3QTg.--MCFqQfhiN",
        "posted": "2021-09-29T09:23:02.727Z",
        "lastScraped": "2021-10-04T09:23:02.727Z",
        "description": "<div><div><p><strong>About Kiva</strong></p><p>Kiva is the world's first and largest crowdfunding platform for social good. We run an online marketplace (www.kiva.org) for crowdfunded microloans that serves the financially excluded. Our organization combines the culture and technological passion of an internet start-up with the compassion and empathy of a non-profit to expand financial access at global scale. We aim to drive social impact and enable opportunity while providing a borrower-to-lender connection: \"Loans that change lives.\"&nbsp;&nbsp;</p><p>Our mission is to expand financial access to help underserved communities thrive. In just 13 years, we have raised more than $1.1 billion in loan capital for 2.7+ million borrowers in over 80 countries. Our lenders fund over $10 million in loans every month. Headquartered in San Francisco, with offices in Portland, New York City, Nairobi, and Bangkok, Kiva's team has 100+ employees and 500+ volunteers worldwide.&nbsp;</p><p><strong>Internship Program</strong></p><p>Since its founding, volunteerism has been an integral part of Kiva's foundation and success. As a Kiva Intern, you will contribute your passion, drive, ideas and expertise to expanding our reach and impact while taking on immediate and significant responsibilities within your team. In addition to learning on the job, you'll partake in a variety of educational, social, and professional development workshops and events that will accelerate your professional growth while learning about Kiva and the non-profit, technology, and microfinance sectors.&nbsp;</p><p>Through this volunteer internship, we aim to provide a high caliber learning experience. With the completion of our internship program, you will take away many in-demand job skills. Additionally, all Kiva interns will gain exposure to foundational microfinance concepts and ongoing professional development tailored to your career goals. This position will also put you in contact with a wide array of employees around the world, giving you a jump start on networking opportunities.</p><p><strong>Kiva is currently recruiting for our January 2022 through July 2022 internship class.&nbsp;</strong><strong>This Kiva Internship is a 6-month, part-time (24-32 hours per week), United States-based, remote volunteer position.&nbsp;</strong></p><p><strong>Placement Process</strong></p><p>During recruitment, we will evaluate your application and interests to match you to a specific team that will leverage your talents while providing you with an opportunity to develop and grow, this may be the team that you apply to or a similar intern role on a different team.</p><p>Although Kiva Interns range in age, work experience, and education backgrounds, a common theme among our participants is a \"can do\" attitude as well as a desire and willingness to contribute right away.</p><p><strong>Our team</strong></p><p>The Impact team is responsible for defining, measuring, analyzing, and sharing the social impact of Kiva, for both internal and external stakeholders.&nbsp; As Kiva continues to refine its model, the Impact team also plays a central role in testing and evaluating loan innovation toward deeper impact, at scale -- an initiative known as Kiva Labs.&nbsp;&nbsp;</p><p><strong>Your role</strong></p><p>Kiva Impact Interns will conduct varied desk research and data analysis in order to help inform Kiva's operations and strategy with an impact lens.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p><strong>Primary Responsibilities</strong></p><ul><li>This role will be centered around reading and summarizing literature as related to how different interventions affect poverty alleviation and livelihood improvements</li><li>Conduct and organize literature reviews to ensure Kiva has an informed, evidence-based perspective on each investment&nbsp;</li><li>Improve the operational efficiency of collecting and monitoring impact data</li><li>Collect &amp; analyze secondary data sources to help Kiva's impact investing strategy</li><li>Preparation of data collection tools for quantitative and qualitative data analysis</li><li>Support data analysis for key business questions around risk, cost, impact, and product design</li><li>Data cleaning and data management</li><li>Testing and refining impact metrics</li><li>Creating dashboard visualizations of key impact-related measurements</li></ul><p><strong>Qualifications</strong></p><p>Required:&nbsp;&nbsp;</p><ul><li>Must be 21 years of age or older by January 18th, 2022</li><li>Able to commit to the full 6-month term</li><li>Experience or education in a research or data driven field such as economics, business, sociology, psychology, political science, etc.</li><li>Interested in learning more about impact assessment, impact evaluation, and impact investing</li><li>Enthusiasm for creative problem solving in complex environments</li><li>Able to work independently as well as part of a cross-functional team</li><li>Flexible and able to contribute to multiple projects simultaneously, with the ability to meet deadlines</li><li>Comfortable managing complexity, ambiguity and change</li><li>Demonstrated ability in quantitative data management and analysis, report writing and editing, and visual presentation of research findings</li></ul><p>Preferred:</p><ul><li>Experience reading and communicating the results of academic research&nbsp;</li><li>Experience working with survey data</li><li>Experience in <span class=\"long-word\">microcredit/microfinance</span> and other financial products, economic empowerment and/or monitoring and evaluation</li><li>Familiarity with data visualization tools (Looker, Tableau, Excel Charts, Google Sheets Charts)</li></ul><p><strong>Perks:</strong></p><ul><li>Professional development and skills workshops</li><li>Access to Kiva's network of Kiva Fellowship and Internship Alumni</li><li>Optional participation in Kiva's Employee Resource Groups (ERGs) and social activities such as happy hours and coffee chats&nbsp;&nbsp;</li><li>References are gladly given for successful participants</li></ul><p>Kiva's Internship is a part-time volunteer position, however, to help offset some expenses, Kiva will provide a modest stipend of $800 a month (before taxes) to its volunteers. Please note that the stipend is considered taxable income and we expect interns to do their own research as to how this may affect their personal/tax implications.</p><p><strong>The weekly time commitment for a Kiva Internship is 24-32 hours per week, from January 18th, 2022 - July 29th, 2022. Please make sure you have the availability to commit for the entire internship period before submitting an application.</strong></p><p><em>A diverse and inclusive workplace where we learn from each other is an integral part of Kiva's culture.&nbsp; We actively welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!</em></p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "information technology",
            "data visualization",
            "networks",
            "machine learning"
        ],
        "remote": true
    },
    {
        "position": "GIS INTERN (UNPAID)",
        "company": "City of West Covina",
        "location": {
            "city": "West Covina",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/acb2c4f20776383e0ea29eb847919abd?lvk=pr9qMax6AinqoagBCTobYw.--MC7H6p_tF",
        "posted": "2021-09-27T09:23:03.599Z",
        "lastScraped": "2021-10-04T09:23:03.599Z",
        "description": "<div><div> Description <p></p><div><strong>Job Summary</strong><br> This is a Geographic Information System (GIS) internship opportunity in the Division&nbsp;of Information Technology. The primary function of this&nbsp;position is to perform GIS work, as assigned with an emphasis in cartography and database&nbsp;maintenance. <br><br> The ideal applicant will have strong attention to detail and should be familiar with Microsoft Excel and Microsoft Word. The ideal applicant will also need to possess knowledge of GIS principles, familiarity with computer software, especially ESRI Arc desktop.&nbsp;&nbsp; </div><p></p> Examples of Duties <p><strong>Essential Functions</strong></p><ul><li>Update the GIS utility layers&nbsp;</li><li>Perform data&nbsp;acquisition and maintenance&nbsp;on GIS and non-GIS datasets</li><li>Create maps and exhibits&nbsp;</li><li>Assist in the preparation of mapping requests for City Staff&nbsp;</li><li>Technical problem solving&nbsp;</li><li>Story Mapping&nbsp;</li></ul><p></p> Typical Qualifications <p><strong>QUALIFICATIONS</strong><br>Applicants should have completed or be enrolled&nbsp;in college course work in GIS, Geography, or a related field. Computer experience is required.&nbsp;<br><br></p> Supplemental Information <p>The City of&nbsp;West Covina&nbsp;is an Equal Opportunity Employer. In compliance with the Americans with Disabilities Act, the City will provide reasonable accommodation to qualified individuals with disabilities and encourages both prospective and current employees to discuss potential accommodations with the employer.<br>&nbsp;</p><p><strong><strong>Required Background <span class=\"long-word\">Screening/Reference</span> Check</strong><br>Prior to placement, applicants may be asked to submit contact information for reference checks. A&nbsp;LiveScan&nbsp;criminal record check through the California Department of Justice will be conducted. A Social Security number and valid state-issued driver's license are required for the&nbsp;LiveScan.<br><br><strong>Benefits Available to Intern</strong><br>Although this is an unpaid internship, students and recent graduates are offered an excellent opportunity to:</strong></p><ul><li><strong>Build resumes and explore career options.</strong></li><li><strong>Apply skills and knowledge to the workplace.</strong></li><li><strong>Fulfill college/university internship requirements.</strong></li><li><strong>Network in their field of interest with professionals who are dedicated to making a positive difference in local government.</strong></li><li><strong>Intern with one of the premier employers in the region.</strong></li></ul><strong><br><br>The City of West Covina is an Equal Opportunity Employer. In compliance with the Americans with Disabilities Act, the City will provide reasonable accommodation to qualified individuals with disabilities and encourages both prospective and current employees to discuss potential accommodations with the employer.</strong>&nbsp; <p></p></div></div>",
        "index": 18,
        "skills": [
            "information technology",
            "networks",
            "software engineering"
        ],
        "compensation": "unpaid",
        "remote": false
    },
    {
        "position": "Marketing Intern (Oakland)",
        "company": "Mettler-Toledo International",
        "location": {
            "city": "Oakland",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a362d58ebd49ac63c441e6413b5bd2ab?lvk=Kzh544IJz0Dkc1KUn23vPQ.--MCRH0_IYZ",
        "posted": "2021-09-29T09:23:05.969Z",
        "lastScraped": "2021-10-04T09:23:05.969Z",
        "description": "<div><div><p></p> Our Opening and Your Responsibilities <p></p><p>&nbsp;</p><p><br></p><p>&nbsp; Being a key member of the sustainability team&nbsp;</p><p>&nbsp; Lead localized sustainable marketing initiatives&nbsp;&nbsp;</p><p>&nbsp; Assisting in identifying, developing, and delivering&nbsp;marketing collateral as needed.&nbsp;</p><p>&nbsp; Provide marketing support for key account strategies.&nbsp;</p><p>&nbsp; Monitor, track and report impact of our sustainable efforts&nbsp;</p><p>&nbsp; Collaborate closely with sales and product marketing teams&nbsp;</p><br><p></p> What You Need to Succeed <p></p><p></p><p>&nbsp;</p><p><br></p><p>&nbsp; Must be pursuing a Bachelor's Degree&nbsp;in&nbsp;marketing, business,&nbsp;communication, environmental studies&nbsp;or similar&nbsp;from an accredited <span class=\"long-word\">college/university.</span>&nbsp;</p><p>&nbsp; Course work in sustainability&nbsp;is&nbsp;a huge plus.&nbsp;</p><p>&nbsp; Proficient-to-advanced M/S Office skills including Excel, Word, Outlook and PowerPoint.&nbsp;</p><p>&nbsp; The ability to present and communicate well in writing.&nbsp;</p><p>&nbsp; Excellent follow-through, ability to meet deadlines, decision making and multi-tasking skills.&nbsp;</p><p>&nbsp; Initiative/self-motivation and creativity.&nbsp;</p><p>Internship Details:</p><p><br></p><p>-&nbsp; 4-6 month internship beginning October 2021</p><p>-&nbsp; Full time or part time</p><p>-&nbsp; 100% remote</p><br><br><p></p> Our Offer to You <p></p><ul><li>Medical, dental and vision care coverage and a 401(k) savings plan with company matching - all starting on date of hire </li><li>Tuition reimbursement, educational matching gift program, perks and discounts </li><li>Parental and caregiver leave programs</li><li>All the usual benefits such as paid time off, flexible spending, short-and long-term disability, basic life insurance, business travel insurance, Employee Assistance Program, and domestic partner benefits </li><li>Global market strength and worldwide leadership in precision instrumentation </li><li>A brand name that is identified worldwide with precision, quality, and innovation</li><li>Thousands of patents, design and innovation awards across Mettler Toledo </li><li> Global recognition for the quality of our products and services</li></ul><p></p> About Mettler Toledo <p></p><p>Working at Mettler Toledo means you are impacting the world in important ways. Our precision measuring devices span the world's laboratories, production facilities, and retail stores. We manufacture, sell, and service instruments that detect, measure, and weigh - from the infinitely small to the largest of vehicles or airplanes. </p><ul><li>We help feed the world. We impact how food is produced, packaged and made safe. </li><li>We help keep you healthy. Our instruments make it possible for scientists to develop new drugs and bring life-saving medicines to the world. </li><li>Mettler Toledo products are important to the production and consistent quality of every kind of consumer product. </li></ul> Mettler Toledo Rainin manufactures pipettes, one of the most basic tools used in every type of chemistry laboratory and many kinds of biological laboratories. Rainin's pipettes consistently rank among the top premium pipette brands in North America, Europe, Asia and the Middle East. <p></p> Equal Opportunity Employment <p></p><p>We are an equal opportunity employer and value diversity at our company. We give consideration for employment without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity, genetic information, protected veteran status, or any other protected classification. If you'd like more information about your EEO rights as an applicant under the law, please click here. </p><p> Mettler Toledo endeavors to make www.mt.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at EEO@mt.com.</p><p>For those who prioritize precision, Mettler Toledo is precisely where you belong.</p><p> Job Reference # </p> 8462 <p> Location </p> California <p></p><p> Job Type </p> Full-time <p> Legal Entity </p> Mettler-Toledo Rainin, LLC [Delaware] <p></p> 7500 Edgewater Dr, Oakland, CA 94621 United States <p></p> +1 (800) 472-4646</div></div>",
        "index": 19,
        "skills": [
            "information technology"
        ],
        "compensation": "paid",
        "contact": "EEO@mt.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Engineering Student Intern - (Part-time) - Local Only",
        "company": "National Steel and Shipbuilding Com",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d4ceab83b97bce13d98bda7e37c346d4?lvk=wKuyySiT7cmY0yP6lNt6oQ.--MCAIAn17N",
        "posted": "2021-09-29T09:23:07.738Z",
        "lastScraped": "2021-10-04T09:23:07.738Z",
        "description": "<div><div><p><b>Job Posting End Date: 10/20/2021</b></p><p><b>Shift:&nbsp;</b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1st</p><p><b>Security Clearance:&nbsp; &nbsp; &nbsp;&nbsp;</b>No Clearance</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><b>SUMMARY</b></p><p>Interns will work with members of various engineering areas in support of ongoing and/or future shipbuilding programs. These activities will take place in Engineering.</p><p>&nbsp;</p><p>This position will be part-time - averaging&nbsp;20 hours/week, no more than 29 hrs/week.</p><p>&nbsp;</p><p><b>ESSENTIAL FUNCTIONS AND DUTIES</b></p><ul><li>Interns may be given the opportunity to review processes and documentation and participate in Process Improvement Teams.</li><li>As an engineering intern at General Dynamics NASSCO you will be responsible for assisting naval architects and marine engineering with their current projects. These projects range from the initial design of future vessels to the final outfitting of nearly completed ships. In the execution of these projects you will be tasked with creating and modifying CAD drawings, performing research using both online and printed resources, and using a variety of software to perform stability and structural calculations.</li><li>You will also accompany senior naval architects to support shipboard inspections and testing.</li><li>Actively participates in implementing and monitoring continuous improvement initiatives to improve safety, improve quality, reduce cycle time, and reduce costs.</li></ul><p>&nbsp;</p><p>Reports to department manager/supervisor on a regular basis to monitor status of assigned projects. Interacts with SOC Managers, General Supervisors, Trade Supervisors, Ship Managers, Superintendents, Engineers, Planners, Safety representatives, customers, vendors and subcontractors.</p><p>&nbsp;</p><p><b>SKILLS AND QUALIFICATIONS</b></p><ul><li><p>Junior or Senior majoring in&nbsp;Structural, Civil, Electrical or Mechanical</p></li><li><p>GPA of 3.0 or above</p></li><li>Must have experience using AutoCAD for 2D drafting.&nbsp;</li><li>Must have completed a class in at least one of the following: Solid Mechanics, Structural Statics, Dynamics, or Strength of Materials</li><li>Strong technical writing, presentation, and engineering analysis skills</li><li>Required commitment Summer to end of year</li><li>An interest and/or prior work experience in ship design, shipbuilding, construction management and manufacturing processes would be advantageous.</li><li>General understanding of maritime industry operations is desired but not required.</li><li>Proficiency in personal computer (PC) word processing, spreadsheets and graphics, as well as computer-aided design and engineering (CAD/CAE) systems, is desirable.</li><li>Must have ability to express ideas in oral and written formats and demonstrate a high degree of personal flexibility.</li></ul><p>&nbsp;</p><p><b>POSITION DEMANDS</b></p><p>Must be able to climb ladders and work in on-board shop and assembly production areas.&nbsp; Specific vision abilities required by this job include close, distance, and peripheral vision, depth perception, and the ability to adjust focus.&nbsp; The employee is regularly required to sit, use hands to fingers, handle or feel objects, controls, and to talk and hear.&nbsp; Must be physically able to walk to all yard locations. The noise level in this environment is usually moderate.</p><p>&nbsp;</p><p>General Dynamics NASSCO is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other basis protected by local, state, or federal law.</p><p>To learn more about applicant rights under federal law, click here:</p><p>EEO is the Law Poster</p><p>EEO is the Law Supplement</p><p>Pay Transparency</p><p>If you have a disability that impacts your ability to complete the job application process and would like to request an accommodation, please contact our Human Resources Department.</p><p>Call (619) 544-8511 or email <span class=\"long-word\">nasscohr@nassco.com.</span> This contact information is for accommodation requests only, not to inquire about the status of applications.</p></div></div>",
        "index": 20,
        "skills": [
            "project management",
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "contact": "nasscohr@nassco.com",
        "remote": false
    },
    {
        "position": "TV Development/Current Series Intern(Virtual), DreamWorks, Spring 2022",
        "company": "CNBC",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5785c382d9b0949f0e863475b4b0ec4e?lvk=pvrdJBcb5iv4R9Hfsto6sw.--MCCF1Q6CV",
        "posted": "2021-09-28T09:23:09.094Z",
        "lastScraped": "2021-10-04T09:23:09.094Z",
        "description": "<div><div><p>Job Title: TV <span class=\"long-word\">Development/Current</span> Series Intern(Virtual), DreamWorks, Spring 2022 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: </p><p>DreamWorks Animation TV seeks an Intern for the TV Development and Current Series departments. Interns will shadow and be able to share their creative point of view on content with high-level executives on both sides of Development and Production, gaining exposure to areas including but not limited to reading scripts, reviewing designs, and attending work-in-progress episode screenings. <br><br>As part of the program, they will research books, writers, and artists, and will be involved in building pitch decks and working with the production teams to source assets for department presentations, as well as submit&nbsp;writers and pitches into the department's databases. <br><br>The Intern will also have the opportunity to create a final presentation surrounding an approved theme they are passionate about and present it to executives at the end of their internship. This position will be exposed to the direct inner-workings of the television animation development and current process from beginning to end.</p><br>Job Number: 64111BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation TV Production <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Must have beginner Photoshop skills. <br>Must have an interest in programming for all demos. <br>Must have the ability to transcribe recordings of meetings. <br>Experienced with internet research.<br>Must have strong writing, communication and presentation skills.<br>Pursuing an Associate, Bachelor or Graduate degree at a College/University (or equivalent), or be a recent graduate (within six months of graduation date) <br>Must be 18 years of age or older<br> Ability to commit 12 weeks part-time (16-24 hours/week) and work remotely from January 2022 - April 2022<br>Must have own equipment (computer, webcam, headphones, etc.) and stable internet connection<br>Must be authorized to work in the United States without visa sponsorship <br>Desired Characteristics: Interest in animation is a plus.<br> Knowledge of programs like Word and PowerPoint is a plus; knowledge of programs like Excel, video editing software, and PhotoShop is preferred.<br> Current class standing of Junior or above (or equivalent) <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></div></div>",
        "index": 21,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Training Intern (Virtual), DreamWorks, Spring 2022",
        "company": "Comcast Sales",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ddb1aadfa3cd81503a1699ebf299431b?lvk=K9yScNVCPx957rMQU2kw9g.--MCCElnOF3",
        "posted": "2021-09-28T09:23:10.303Z",
        "lastScraped": "2021-10-04T09:23:10.303Z",
        "description": "<div><p>Job Title: Training Intern (Virtual), DreamWorks, Spring 2022 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: DreamWorks Animation seeks an Intern for the Training Department. In this role, the intern will learn the training process for various production departments (Animation, Effects, Surfacing, Matte Painting, etc). Interns will gain knowledge on the role of the Training Department in the studio and an understanding of the training workflow for Features, TV and Overhead Departments.<br>&nbsp;<br>The intern will monitor virtual classes and provide help as needed, track attendance and enter data into Excel database. The intern will record various classes with screen capture software and occasionally edit recorded classes in Adobe Premiere. The intern will also need to take on various administrative tasks and design posters to promote training classes as needed.<br><br>In addition, the intern will be encouraged to attend virtual training classes to learn about the animation pipeline as well as the software used to create our movies and tv shows. The intern will have the opportunity to meet with artists and professionals from different departments and to further develop skills in areas of interest. The intern will also be able to virtually participate in ongoing studio artistic classes, lunchtime talks, special series workshops and activities. <br>Job Number: 64105BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation Internships <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Pursuing an Associate, Bachelor or Graduate degree at a College/University (or equivalent), or be a recent graduate (within six months of graduation date)<br>Must be 18 years of age or older<br>Ability to commit 12 weeks part-time (16-24 hours/week) and work remotely from January 2022 - April 2022<br>Must have own equipment (computer, webcam, headphones, etc.) and stable internet connection<br>Must be authorized to work in the United States without visa sponsorship<br>Confidently looks to solve problems, manages time efficiently, and pays close attention to details<br>A team player with a can-do attitude and proficient communication skills<br>Proactive and has strong multi-tasking and follow-up skills <br>Desired Characteristics: Desired Characteristics:<br>Interest in animation, tv or feature film production<br>Experience with <span class=\"long-word\">collecting/organizing</span> data using software like Excel or Google Sheet<br>Basic design skills using software like Photoshop<br>Basic video editing skills using software like Premiere<br>Customer service skills or relevant experience preferred <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></p></div>",
        "index": 22,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "project management",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Feature Development Intern (Virtual), DreamWorks, Spring 2022",
        "company": "Comcast Sales",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/eca53d211c693748a7c52d17f071e869?lvk=dNwMb0ijs-x_WSQPhkmdcg.--MCCEox0jV",
        "posted": "2021-09-28T09:23:11.988Z",
        "lastScraped": "2021-10-04T09:23:11.988Z",
        "description": "<div><div><p>Job Title: Feature Development Intern (Virtual), DreamWorks, Spring 2022 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: </p><p>DreamWorks Animation seeks an Intern for the Feature Development Department. The goal of the internship will be to gain an appreciation of the development process and how a development department functions within a studio environment. The intern will work closely with departmental representatives on various tasks, including short &amp; long-term project research, script coverage, writers lists and competitive tracking. &nbsp;<br>&nbsp;</p><br>Job Number: 64109BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation TV Production <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Pursuing an Associate, Bachelor or Graduate degree at a College/University (or equivalent), or be a recent graduate (within six months of graduation date) <br> Must be 18 years of age or older<br> Ability to commit 12 weeks part-time (16-24 hours/week) and work remotely from January 2022 - April 2022<br> Must be authorized to work in the United States without visa sponsorship<br> Must have own equipment (computer, webcam, headphones, etc.) and stable internet connection<br> A cover letter is recommended but not required <br>Desired Characteristics: Familiar with Google Suite<br> Photoshop experience is a plus <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></div></div>",
        "index": 23,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Graduate Intern - Business Intelligence",
        "company": "Port of Seattle",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8fa7434d71c8ed86253713c93113772f?lvk=Evjq51kg661le5tKY7hShg.--MCAzG4Qmw",
        "posted": "2021-09-30T09:23:13.775Z",
        "lastScraped": "2021-10-04T09:23:13.775Z",
        "description": "<div><p><strong>Some of what you'll be doing:</strong> The Port of Seattle's Business Intelligence (BI) Department is seeking a graduate student passionate about data analytics to support the Department's work to advance the Port's capacity and capability to leverage data to power organizational success. The BI Department is a team of high-performance problem-solvers focused on creating a decision-making culture informed with insights to drive action. The BI Department is an enterprise support group, constantly challenged to work with a wide spectrum of complex data spanning the Port's aviation, maritime and support service divisions. </p><p>We want our data to tell a clear story, highlight insights we hadn't previously seen and do it all faster than we've been able to previously. Throughout your internship experience, you will own and drive relevant analytical projects to solve real world business challenges. As a key member of the Business Intelligence Department, you will gain insights into the key functions of your team as it relates to the Port's broader analytics and research strategy and vision. </p><p>Some of the things you'll be doing include: + Data manipulation: Create and curate data sets from disparate data that facilitate insight generation. + Data sensemaking: Identify and interpret trends and patterns in datasets requiring an in-depth evaluation of variables. + Analysis: analyze complex business problems using internal and external data. </p><p>Design and build automated reports, reporting tools and dashboards, as well as statistical models. + Project management: Manage project requests end-to-end including gathering requirements and collaborating with cross-functional teams. + Insights to action: Clearly present findings and recommendations to decision makers at various levels of the organization leveraging data visualization and storytelling best practices. </p><p> + Growth and development: improve your own performance in technical skills, analytical thinking, communications, performance measurement, and continuous improvement. <strong>Who you are:</strong> + <strong>A student</strong> - You must be currently enrolled in a Master's program or a recent graduate (&lt; 1 year ago) in a degree program such as business analytics, data science, statistics, information management, or a related discipline. + <strong>Experience</strong> - You have experience in data manipulation, knowledge of analytical methods and practices, and a good understanding of data visualization and information design concepts. </p><p> + <strong>Communication</strong> - You have strong interpersonal and communication skills, both written and verbal, and can effectively communicate findings to stakeholders. + <strong>Proactive</strong> - You are a self-starter motivated to make meaningful contributions and can effectively work in a team environment. + <strong>Organized</strong> - You are able to work on assignments and manage time independently to complete tasks, and also have strong organizational skills. </p><p> + <strong>Technical Skills</strong> - You have experience with a programming language (e.g. SQL, R), data modeling, and business intelligence tools (e.g. Tableau). </p><p><strong>What else you need to know:</strong> + <strong>Work Schedule</strong> - This is a part-time (up to 20 hours per week) position during the school year and a full-time (40 hours per week) position in the summer. Normal work hours will be scheduled Monday through Friday between the hours of 7:00 a.m. - 5:00 p.m. </p><p> + <strong>Work Environment</strong> - This role will primarily be conducted remotely in accordance with the Port's Flexible Work Arrangement policies during the Covid-19 pandemic. It may transition to primarily working in an office environment post pandemic. + <strong>Limited Duration</strong> - This is a limited duration position and is expected to last up to one year. </p><p> + <strong>Washington State Residency Requirement</strong> - Employees must establish a residence in Washington state within 30 days of their first day of employment and must maintain a residence in Washington State during their employment with the Port of Seattle. If a position is eligible to telework, work performed while teleworking must be performed in Washington State. + <strong>Covid-19 Vaccination Requirement -</strong> The Port of Seattle will require that at the time of hire, and as a condition of employment, the successful candidate will be able to provide proof of their full COVID-19 vaccination status, as part of the hiring process. </p><p>This is a condition of employment for all positions at the Port of Seattle. People are considered fully vaccinated two weeks after their second dose in a two-dose series or two weeks after a single-dose vaccine. Prior to employment, candidates may make requests for a reasonable accommodation based on a medical disability or for sincerely held religious beliefs. </p><p>Philosophical, political, scientific, or sociological objections to vaccination will not be considered for an exemption or accommodation. + <strong>Security Requirements</strong> - As the successful candidate, you will must pass a Transportation Security Administration (TSA) background check as well as a criminal history background check with the Federal Bureau of Investigation (FBI). Your employment will be contingent upon obtaining a Port of Seattle ID badge upon clearance. </p><p><strong>Why you'll love it here:</strong> + <strong>Getting to Work</strong> - Fully subsidized parking and a low-cost public transit card to get you here. + <strong>Diversity</strong> - We foster opportunities for employees to contribute to our communities and business success in a way that celebrates a fully inclusive and engaged work environment. + <strong>Work-Life Balance</strong> - We provide the resources to help you create habits to be healthy and balanced. </p><p> + <strong>Mission Driven</strong> - We are focused together in promoting economic opportunities and quality of life in the region by advancing trade, travel, commerce and job creation in an equitable, accountable and environmentally responsible manner <strong>Why the Port of Seattle:</strong> Every role at the Port of Seattle is vital to our thriving community. We are a leader in moving people and cargo across the country and around the world. With facilities and property ranging in scope from a half-acre park to one of the largest airports and container terminals on the West Coast, we maximize the public assets in our portfolio with an eye toward best uses and environmental sustainability. </p><p>Find out more here . <strong>Location:</strong> Seattle Tacoma International Airport <strong>Organization:</strong> Human Resources <strong>Employee Status:</strong> Temporary <strong>Schedule:</strong> Part-time <strong>Posting Expires:</strong> Oct 17, 2021, 11:59:00 PM <strong>Minimum Salary:</strong> 23.06 <strong>Midpoint Salary:</strong> 26.06<strong>Req ID:</strong> 000498The Port of Seattle is an equal opportunity employer that values diverse perspectives and life experiences. We encourage people of all backgrounds to apply, knowing decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex (including pregnancy), sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law, regulations and ordinances. </p><p>To help comply with all state and federal requirements, we appreciate you voluntarily answering the questions below. The information on this form will be kept confidential. Click <span class=\"long-word\">https://www.portseattle.org/page/ethnicity</span>-definitions for definitions and descriptions of the categories referenced below regarding Ethnicity and Race. </p><p>Click <span class=\"long-word\">https://www.portseattle.org/page/vevraa</span>-information for information and definitions of the categories referenced below regarding Protected Veterans status.</p></div>",
        "index": 24,
        "skills": [
            "project management",
            "sql",
            "data visualization",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "TV Music Intern (Virtual), DreamWorks, Spring 2022",
        "company": "CNBC",
        "location": {
            "city": "Glendale",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/38f05091a2434b3287bf2474eef921f2?lvk=TQt1ybnrqn6n-yGZevTyEw.--MCOqOsQ1N",
        "posted": "2021-09-29T09:23:15.271Z",
        "lastScraped": "2021-10-04T09:23:15.271Z",
        "description": "<div><p>Job Title: TV Music Intern (Virtual), DreamWorks, Spring 2022 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: <br>DreamWorks Animation seeks an Intern for the Music Administration department in Glendale, CA. The Intern will gain knowledge of the music administration process and how it is applied for film and TV. The Intern will learn the technical process of how the department processes cue sheets, manages assets, and handles music publishing requests.The intern will have an insight into day to day production needs and administrative duties essential to the process.<br>&nbsp; <br>Job Number: 64118BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation TV Production <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Pursuing an Associate, Bachelor or Graduate degree at a College/University (or equivalent), or be a recent graduate (within six months of graduation date)<br> Must be 18 years of age or older<br> Ability to commit 12 weeks to the internship<br> Ability to work part time (16-24 hours/week) and work remotely from January - April 2022<br> Must be authorized to work in the United States without visa sponsorship<br> Must be pop culture/media savvy with knowledge of artists and their work.<br> Must have strong computer proficiency, including knowledge of programs like Word, Excel, and Gmail.<br> Must have a professional manner and exceptional communication skills.<br> Must be detail oriented with strong organizational skills and have the ability to multitask. <br>Desired Characteristics: Current class standing of Junior or above (or equivalent)<br> Film/TV/Media majors or Music Industry majors preferred<br> Strong interest in a career in music <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></p></div>",
        "index": 25,
        "skills": [
            "networks",
            "virtual reality",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Professional Services Developer Intern",
        "company": "Calabrio",
        "location": {
            "city": "Minneapolis",
            "state": "Minnesota",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e0280f43fc28d9805cd9977c968aed68?lvk=bR538OCcYEvdtDeAPIpO3A.--MCB9kC5aN",
        "posted": "2021-09-28T09:23:16.684Z",
        "lastScraped": "2021-10-04T09:23:16.684Z",
        "description": "<div><div><p><b>POSITION SUMMARY</b></p><p>Be part of a team that works with companies around the world to create custom integrations between Calabrio ONE and various ACD, CRM, and other systems containing the customer data.</p><p></p><p><b>What you'll be doing</b><b>:</b></p><ul><li>Perform assigned programming and testing tasks</li><li>Participate in team meetings and some customer meetings</li><li>Assist in any design sessions with customers as opportunities allow</li><li>Assist with documentation of requirements and post build documentation of a solution</li></ul><p></p><p><b>EXPERIENCE WE'RE LOOKING FOR:</b></p><ul><li>Knowledge of programming in languages C# and/or Java.</li><li>Basic skills in troubleshooting and communication</li></ul><p></p><p><b>HOW YOU'LL STAND OUT:</b></p><ul><li>Ability to effectively write technical documentation describing systems and processes</li><li>Experience with REST APIs, JSON, data processing, SQL knowledge, or similar technologies</li><li>Computer science or engineering degree</li></ul><p></p><p><b>WHAT IS REQUIRED FOR YOU TO APPLY?</b></p><ul><li>Be enrolled in a bachelor's program or have a bachelor's degree.</li><li>Some programming classes and/or experience.</li></ul></div></div>",
        "index": 26,
        "skills": [
            "sql",
            "java",
            "c and c++",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    }
]