[
    {
        "position": "Systems Reliability Engineer - 2022 Summer Internship",
        "company": "Nutanix",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c60cf931715780c4410475f5bf5f4aad?lvk=WJ82yDOhMLA8KpXwBlCfWg.--MB9Sxbdv-",
        "posted": "2021-09-16T17:22:31.463Z",
        "lastScraped": "2021-09-20T17:22:31.463Z",
        "description": "<div><div><p>The Systems Reliability Engineering (SRE) team acts as our customer's champion and provides top level customer support. The team supports our customers and systems in the field to provide an enriched and successful product experience.&nbsp;<br><br>This is a full-time summer internship starting in May / June 2022.</p><p><strong>Responsibilities:</strong></p><ul><li>Work technical cases independently and as a team. This will include remotely troubleshooting customer's technical issues, searching documentation, testing features, and collaborating with our technology partners.</li><li>Assist SREs with recreates and lab set-up.</li><li>Validate and review knowledge base articles, under direction of a mentor.</li><li>Create and update engineering tickets based on feedback from customers and partner implementations</li><li>Create and review internal documentation. This can include new hire documents, training documents and problem determination documents.</li></ul><p><strong>Requirements:</strong></p><ul><li>Currently pursuing a Bachelors or Masters in Engineering or related field</li><li>Excellent verbal and written communication skills, problem solving skills, customer service and interpersonal skills.</li><li>Understanding of networking, virtualization, or Linux required. Understanding of all three preferred.</li><li>The passion &amp; ability to learn new things, while never being satisfied with the status quo.</li><li>Internship will be in-person in Durham and San Jose if indicated safe by CDC guidelines. If virtual, willingness to work east coast business hours (8am to 5pm ET) for Durham location, west coast business hours (8am to 5pm PT) for San Jose location.</li></ul><p><strong>Qualifications and Experience:</strong></p><p>Must be currently enrolled in a Bachelor's or Master's degree program in Networking, Systems Administration, Computer Information Technology, Computer Science, or a related discipline.<br><br>~~~~~~~~~~</p><p><b>About us</b><br> Founded in 2009 and headquartered in San Jose, California, Nutanix is a passionate team of 6000+ employees worldwide. Our people (we call ourselves \"Nutants\") are the heartbeat of #LifeAtNutanix&nbsp;and one of the many things that makes Nutanix a great place to work at. We share an intellectual curiosity, a bias for action, and an obsession for our customers. We are builders and problem solvers with an entrepreneurial spirit. Above all, we celebrate what makes each of us unique.<br><br> We are humbled to be recognized as one of Bloomberg's Top 50 Companies to Watch in 2020and one of the Fortune 100 Best Companies to Work For 2020.<br><br> We're growing fast and disrupting the computing industry. Join us and make your mark.<br><br><strong>About our business</strong><br> Nutanix is a global leader in cloud software and a pioneer in hyperconverged infrastructure solutions, making computing invisible anywhere. Companies around the world use Nutanix software to leverage a single platform to manage any app, at any location, at any scale for their private, hybrid, and multi-cloud environments.<br><br><b>We're an equal opportunity employer</b><br> Nutanix is an Equal Employment Opportunity and (in the U.S.) an Affirmative Action employer. Qualified applicants are considered for employment opportunities without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, marital status, protected veteran status, disability status, or any other category protected by applicable law. We hire and promote individuals solely on the basis of qualifications for the job to be filled.<br><br> We strive to foster an inclusive working environment that enables all our Nutants to be themselves and to do great work in a safe and welcoming environment, free of unlawful discrimination, intimidation, or harassment. As part of this commitment, we will ensure that persons with disabilities are provided reasonable accommodations. If you need a reasonable accommodation, please let us know by contacting&nbsp;<b>[email&nbsp;protected]</b></p><p>&nbsp;</p><p>--</p></div></div>",
        "index": 1,
        "skills": [
            "information technology",
            "software engineering",
            "networks",
            "machine learning",
            "project management",
            "virtual reality"
        ],
        "start": "2021-04-30T15:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    }
]