[
    {
        "position": "ZENworks Endpoint Security Management QA Internship",
        "company": "ArcSight",
        "location": {
            "city": "Provo",
            "state": "Utah",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/25e9310128f2cb57e651afeb2fc66950?lvk=3gZUjhrC0Srk3BEoQWDzIQ.--M0JpXSscR",
        "posted": "2021-05-01T04:46:17.883Z",
        "lastScraped": "2021-05-03T04:46:17.883Z",
        "description": "<div><div><p>ZENworks Endpoint Security Management QA Internship</p><p>&nbsp;&nbsp;</p><p><b>Job Description:</b></p><p>&nbsp;&nbsp;&nbsp;</p><p><b>ZENworks Endpoint Security Management QA Internship</b></p><p></p><p><b>Who we are:</b></p><p></p><p>Micro Focus is one of the world's largest enterprise software providers, delivering the mission-critical software that keeps the digital world running. We combine pragmatism, discipline, and customer-centric innovation to deliver trusted, proven solutions that customers need in order to succeed in today's rapidly evolving marketplace.<i>That's high tech without the drama. </i>www.microfocus.com</p><p></p><p><b>About the Role </b></p><p></p><p>This intern position is for a Quality Assurance (QA) engineer performing testing on Micro Focus's ZENworks Endpoint Security Management product line. This includes the following subproducts: Endpoint Security, Full Disk Encryption, Anti-Malware, and some Mobile Device Management. This QA role uses a mixture of manual and automated framework testing. The automation framework requires ongoing maintenance and expansion, which this QA Engineer will perform. The QA Engineer will work with senior software engineers who have developed security solutions using most of the current coding languages (C, C++, C#, Java) and the automation framework also uses VB.NET, WinBatch/WIL. Both the products and automation framework use the major Database types (SQL, SQLite, Oracle, Postgres). The test labs heavily rely on both \"real hardware\" and various Virtualization products (VMWare, VM ESXi, etc). These labs also leverage several hard-drive imaging techniques to create and deploy test Operation System (OS) images to the test devices.</p><p></p><p>In this role, the QA engineer will have the opportunity to test securing Microsoft Windows Operating Systems across server and client OSes. They will work with developers to expand various unit test code samples to use in the automation framework. The job will expose the QA Engineering to modern networking protocols and workflow, use of various hardware imaging techniques, use of virtualization platforms, minimal interactions with various Database types, and numerous \"policy driven\" aspects related to securing Microsoft Windows platforms. Product Line URL: <span class=\"long-word\">https://www.microfocus.com/en</span>-<span class=\"long-word\">us/portfolio/zenworks</span>-suite/overview</p><p></p><p><b>Education and Knowledge Required: </b></p><ul><li>Preferably enrolled in Junior Year in college/trade school program focusing on Computer Science, Electrical Engineer, or equivalent (with 3.5 GPA)</li><li>Some exposure to coding languages (Pascal, C, C++, C#, Java, or otherwise)</li><li>Some exposure to databases (SQL, Oracle, or otherwise)</li><li>Strong familiarity with Microsoft Windows Operating Systems</li><li>Strong communication (not afraid to ask questions and offer recommendations)</li><li>Comfortable working in a team environment</li><li>Strong individual work ethic (reliable and self-managed with minimal oversight at times)</li><li>Very detailed oriented (following test steps, documenting workflow and errors)</li><li>Willingness to learn new technologies and programming/coding</li><li>Familiarity with interacting with Web based applications</li></ul><p></p><p><b>Other Advantageous Job Skills:</b></p><ul><li>Understanding of Virtualization Software solutions</li><li>Understanding of hard drive imaging software solutions</li><li>Winbatch/Windows Interface Language (WIL) knowledge</li><li>VB.NET knowledge</li><li>Familiarity with security software like Encryption, Anti-Malware, 802.11 Wireless controls</li><li>Network infrastructure management (Layer 2/3 switches, routers, 802.11 Wireless routers, etc)</li></ul><p></p><p>If you want to be part of what's next andfind out more about ouravailable opportunities, visitMicro Focus Careers.</p><p></p><p>#DiceSD</p><p>#LI-SD1</p><p>#LI-Remote</p><p></p><p></p><p><b>Job:</b></p>Administration<p>&nbsp;&nbsp;&nbsp;&nbsp;</p><p><b>Micro Focus is proud to be an &nbsp;Equal Opportunity Employer.&nbsp; Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</b></p><p>&nbsp;&nbsp;&nbsp;</p></div></div>",
        "index": 1,
        "skills": [
            "information technology",
            "project management",
            "software engineering",
            "sql",
            "java",
            "hardware",
            "networks"
        ],
        "remote": true
    },
    {
        "position": "Electrical Engineer - 2021 Summer Internship Job",
        "company": "Peterbilt Motors Company",
        "location": {
            "city": "Kirkland",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/711db78414cf4b07b5283271790e6d4c?lvk=EwdPspoSkd-_By_eB4_FUg.--M0EUpo8DR",
        "posted": "2021-05-01T04:46:19.457Z",
        "lastScraped": "2021-05-03T04:46:19.457Z",
        "description": "<div><div><div> Electrical Engineer - 2021 Summer Internship Job <div> Apply now </div></div><p><strong>Date: </strong>Apr 30, 2021 </p><p><strong>Location:</strong> Kirkland, WA, US </p> #job-location.job-location-inline {display: inline;} <p><strong>Company: </strong> PACCAR </p><div><p><strong>Company Information</strong></p><p><strong>PACCAR is a Fortune 500 company established in 1905. PACCAR Inc is recognized as a global leader in the commercial vehicle, financial, and customer service fields with internationally recognized brands such as Kenworth, Peterbilt, and DAF trucks.&nbsp; PACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium-, and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates.&nbsp; PACCAR also designs and manufactures advanced diesel engines, provides financial services and information technology, and distributes truck parts related to its principal business. </strong></p><p>&nbsp;</p><p>Whether you want to design the transportation technology of tomorrow, support the staff functions of a dynamic, international leader, or build our excellent products and services - you can develop the career you desire with PACCAR. Get started!</p><p>&nbsp;</p><p>Kenworth Truck Company's Electrical Engineering team is seeking a skilled and driven intern this summer! Interns will have the opportunity to contribute to the team with hands on projects and learn from the industry's leading experts over the course of 8-10 weeks.</p><p>&nbsp;</p><p><strong>Here's what you will do in this internship:</strong></p><ul><li>Receive training on tools and processes Kenworth Electrical Engineers use every day</li><li>Work with a senior engineer on our team and collaborate with our entire team to gain insights into Electrical Engineering for heavy trucks</li><li>Implement a design project sized so that you can experience all phases of the design process</li><li>Participate in the launch of your project by installing it on a Kenworth Truck</li></ul><p>&nbsp;</p><p><strong>Qualifications:</strong></p><ul><li>Current graduate or undergraduate with junior or senior standing enrolled in an&nbsp;Engineering Program, preferrably Electrical Engineering or Computer Science</li><li>Drive to learn and be a team player</li></ul><p>&nbsp;</p><p><strong>Additional Job Board Information</strong></p><p>PACCAR promotes equal employment opportunities by implementing policies and practices that ensure employees and applicants are not discriminated against because of their race, color, religious creed, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, mental or physical disability, medical condition, genetic information, military or veteran status or other legally protected status. This applies to recruitment, selection, placement, promotion, termination, rates of pay, and other conditions of employment. </p><p><br><strong>Nearest Major Market: </strong>Seattle <br><strong>Nearest Secondary Market: </strong>Bellevue <br><strong>Job Segment: </strong> Medical, Part Time, Seasonal, Engineer, Electrical, Healthcare, Retail, Engineering </p></div><div><div> Apply now </div></div><div></div></div></div>",
        "index": 2,
        "skills": [
            "information technology",
            "software engineering",
            "machine learning",
            "project management"
        ],
        "remote": false
    },
    {
        "position": "RN, Pediatric Hematology/Oncology/BMT, PT, Nights",
        "company": "Oregon Health & Science University",
        "location": {
            "city": "Portland",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f6101ac094ab345df80d928a238affd6?lvk=5MQ5Ogn7pA69ItgMtHFtBg.--M-fLNj5fo",
        "posted": "2021-04-24T04:46:21.500Z",
        "lastScraped": "2021-05-03T04:46:21.500Z",
        "description": "<div><div><p>The PHOT provides Intermediate Level of Care to patients ages 0-18. Obstetric patients less than 18 with a new Hem/Onc/BMT diagnosis are case by case. Patients with specific pediatric oncology diagnosis may be followed until the age of 25 years. Presenting diagnosis may include leukemia, brain tumors, bone tumors, sarcoma, lymphomas, blood diseases, immunological diseases, storage diseases, Bone Marrow Transplants and Graft vs Host Disease patients. Nurses on this unit also provide support to Hem/Onc/BMT patients on other units, to include but not limited to chemotherapy support, expertise with BMT patients and central lines.</p><p>&nbsp;</p><p>The OHSU Clinical registered nurse (RN) provides compassionate, evidence-based, and efficient care to individuals, families, communities and patient populations. The Clinical RN's care delivery is consistent with the Oregon Nurse Practice Act, the ANA Scope and Standards of Practice, and the ANA Code of Ethics. The Clinical RN demonstrates the professional role obligations of scientist, leader, and knowledge transferor [Onsomble Model of the Professional Role™]. Professional accountability enriches the Clinical RN's engagement as a leader in promoting an inter-professional culture of collaborative decision-making, innovation, life-long learning, and teamwork. The Clinical RN exemplifies the principles of a Culture of Safety by committing to a Just Culture, a Reporting Culture, a Learning Culture, and an Engaged Informed Culture.</p><br><ul><li>External applicants: Baccalaureate of Science in Nursing Degree from a program accredited by Commission of Collegiate Nursing Education (CCNE), Accreditation Commission for Education in Nursing (ACEN) or Commission for Nursing Education Accreditation (CNEA)</li><li>Internal applicants: Associate's Degree in Nursing</li><li>Current, unencumbered Oregon State Registered Nurse License</li><li>BLS at time of hire and must be issued by the American Heart Association (AHA) or Military Training Network branch of AHA (upload documentation with online application)</li><li>BLS must not expire during orientation or probation period, and must have the same expiration date (upload documentation with online application)</li><li>Communication skills including fluency in oral and written English</li><li>Basic computer skills including the ability to send/receive email, navigate information technology associated with the position, and use Electronic Health Record information and tools</li><li>Current PALS certification</li><li>Must be able to perform the essential functions of the position with or without accommodation</li></ul><br><ul><li>Current OHSU employees: BSN preferred</li><li>One year <span class=\"long-word\">Hematology/Oncology/BMT</span> Experience or completion of a Pediatric <span class=\"long-word\">Hematology/Oncology/BMT</span> Internship program</li><li>APHON/ONS Chemotherapy Certification</li></ul><br><p><strong>Usual Orientation Time:&nbsp; &nbsp;</strong></p><ul><li>New Grads – 8 to 12 weeks</li><li>Specialty Experience – 4 to 8 weeks</li><li>Experience, but not in specialty area 8 – 12 weeks</li><li>Resource<strong> - </strong>previous experience in hem/onc/bmt with chemotherapy certification</li></ul><br>Oregon Health &amp; Science University values a diverse and culturally competent workforce. We are proud of our commitment to being an equal opportunity, affirmative action organization that does not discriminate against applicants on the basis of any protected class status, including disability status and protected veteran status. Individuals with diverse backgrounds and those who promote diversity and a culture of inclusion are encouraged to apply. To request reasonable accommodation contact the Affirmative Action and Equal Opportunity Department at 503-494-5148 or aaeo@ohsu.edu.</div></div>",
        "index": 3,
        "skills": [
            "information technology",
            "networks",
            "machine learning"
        ],
        "contact": "503-494-5148",
        "remote": false
    },
    {
        "position": "R&D - Internship",
        "company": "BD",
        "location": {
            "city": "Salt Lake City",
            "state": "Utah",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c8e026eae2b91e0ada2515dda7efda47?lvk=nXvjvjaKwP1Is7YHfA1lPg.--M0-dbJ_XN",
        "posted": "2021-04-26T04:46:25.332Z",
        "lastScraped": "2021-05-03T04:46:25.332Z",
        "description": "<div><div><p>Job Description SummaryThis temporary position assists with R&amp;D engineering activities and performs tasks associated with those activities.</p><p></p><p></p>Job Description<p><b>Summary of Position with General Responsibilities</b></p><p><i>The following duties and responsibilities are intended to be representative of the work performed by the incumbent(s) in this position and are not all-inclusive. The omission of a specific duty or responsibility will not preclude it from the position.</i></p><p></p><p>SCOPE</p><p>This internship position is for a candidate that is available for part time work (15-20 hrs/wk) throughout the year and requires the candidate be local to the greater Salt Lake City, UT area.</p><p></p><p>POTENTIAL TASKS AND ASSIGNMENTS</p><p>1. Initiates new or revised documentation and tracks through appropriate approval cycles and implementation</p><p>2. Maintains a professional working relationship with internal &amp; external team members</p><p>3. Participates on cross-functional teams.</p><p>4. Provides technical support on components, material methods, systems and equipment.</p><p>5. Assists in developing physical and functional test requirements to assure specifications &amp; regulations are met.</p><p>6. Writes and reviews protocols, reports and data.</p><p>7. Conducts testing outlined in protocols and test methods</p><p>8. Executes validation studies on equipment &amp; processes</p><p>9. Executes design controls</p><p>10. Analyzes design inputs</p><p>11. Trains on, understands and follows company procedures and regulatory requirements</p><p>12. Participates in and provides input to training on department &amp; division procedures, and policies</p><p>13. Prepares and presents oral and written project updates and technical discussions</p><p></p><p>KNOWLEDGE AND SKILLS:</p><p>1. Basic Technical writing skills</p><p>2. Basic interpersonal skills - active listening</p><p>3. Ability to read drawings</p><p>4. Good understanding of engineering principles</p><p>5. Demonstrated ability to apply engineering principles</p><p>6. Ability to perform testing per written directions</p><p>7. Demonstrated comprehension of basic descriptive statistics</p><p>8. Basic Software application skills</p><p>9. Basic problem solving skills</p><p>10. Ability to collect and analyze data and derive conclusions</p><p>11. Ability to make recommendations to reach a solution</p><p>12. Oral and written presentation skills</p><p>13. Ability to follow design controls</p><p>14. Ability to work independently</p><p>15. Detail and results oriented</p><p></p><p><b>Basic Qualifications</b></p><p>A student working towards a Bachelor degree in science or engineering.</p><p></p><p>The incumbent must demonstrate the ability to perform the essential functions of the job as outlined in the duties and responsibilities.</p><p></p><p></p><p><b>Physical Requirements</b></p><p>This position is in an office and/or laboratory environment and requires the incumbent to sit, stand and perform general office functions. The incumbent may also be required to lift up to twenty five pounds occasionally. The incumbent may be required to stand for extended periods of time. Bending, stooping and reaching are also frequently required.</p><p></p><p><i>Becton, Dickinson and Company is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. We do not unlawfully discriminate on the basis of race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status.</i></p><p></p><p></p>Primary Work LocationUSA UT - Salt Lake City BAS<p></p><p></p>Additional Locations<p></p><p></p>Work Shift</div></div>",
        "index": 4,
        "skills": [
            "software engineering",
            "project management",
            "cybersecurity"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Software Development Intern",
        "company": "SS&C Advent",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/026f567b360e79c30045ebe31bf9dd15?lvk=fuxnEtzVEmGotyMddkeIPA.--M-wuwR-pF",
        "posted": "2021-04-26T04:46:27.399Z",
        "lastScraped": "2021-05-03T04:46:27.399Z",
        "description": "<div><div><p>SS&amp;C is a global provider of investment and financial services and software for the financial services and healthcare industries. Named to Fortune 1000 list as top U.S. company based on revenue, SS&amp;C is headquartered in Windsor, Connecticut and has 20,000+ employees in over 90 offices in 35 countries. Some 18,000 financial services and healthcare organizations, from the world's largest institutions to local firms, manage and account for their investments using SS&amp;C's products and services.</p><p></p><p><b>Job Description</b></p><p></p><p>SS&amp;C Advent, a leading provider of award-winning software and services for the global investment management industry, is seeking 8 <b>Software Engineer Interns</b> for our San Francisco, Jacksonville, and NY offices. This role is part of the product development team focused on building the next generation of SS&amp;C Advent's award-winning products.</p><p><b>Duties:</b></p><ul><li>Work on a team that builds financial applications.</li><li>Work with the engineering team to assist in the implementation and testing of new features, extend the unit testing framework, and improve the continuous delivery process.</li><li>This is a hands-on internship with a focus on coding and testing.</li></ul><p><b>Required:</b></p><ul><li>A passion for programming learning new technologies and new skills!</li><li>Basic programming skills in Java, C#, C++, etc.</li><li>Working knowledge of Windows or Unix-like operating systems.</li><li>Interest in understanding the full software development life cycle and the responsibility of the software engineer.</li><li>Ability to execute on coding tasks within a large project.</li><li>Knowledge and Ability to check the quality of code through manual and unit testing.</li></ul><p><b>Desired Skills:</b></p><ul><li>Working knowledge of one or multiple of the following skills: <ul><li>Any Object Oriented Programming languages:Java, C#, C++, etc.</li><li>Any scripting language: JavaScript, Python, Perl, etc.</li><li>Any modern web UI framework: React, Angular, Vue, etc.</li><li>Any knowledge of reporting frameworks, Analytics/BI tools.</li><li>Any knowledge of building service-oriented architecture: rest API,gRPC, microservices, etc.</li><li>Any Big Data and Data Engineering knowledge with Hadoop, Spark, Hive, Presto, etc.</li><li>Any Machine Learning knowledge with NLP, NLG</li><li>Any knowledge of building scalable containerization structures using: Docker, Kubernetes, etc.</li><li>Any relational database: SQL Server, MySQL, PostgreSQL, etc.</li><li>Any non-relational database: MongoDB, Couchbase, etc.</li></ul></li><li>Working knowledge of source code control tools: Git, GitHub, SourceTree, etc.</li><li>Working knowledge of programming algorithms, data structures, and design patterns.</li></ul><p><b>Education:</b></p><ul><li>Majoring in computer science or engineering.</li></ul><p></p><p></p><p>Unless explicitly requested or approached by SS&amp;C Technologies, Inc. or any of its affiliated companies, the company will not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. SS&amp;C offers excellent benefits including health, dental, 401k plan, tuition and professional development reimbursement plan. SS&amp;C Technologies is an Equal Employment Opportunity employer and does not discriminate against any applicant for employment or employee on the basis of race, color, religious creed, gender, age, marital status, sexual orientation, national origin, disability, veteran status or any other classification protected by applicable discrimination laws.</p></div></div>",
        "index": 5,
        "skills": [
            "machine learning",
            "software engineering",
            "project management",
            "sql",
            "angular",
            "javascript",
            "java"
        ],
        "remote": false
    },
    {
        "position": "Software Development Intern",
        "company": "ICF",
        "location": {
            "city": "Lansing",
            "state": "Michigan",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9626e5013056ce40c9f79c44e025d7e7?lvk=mR77ul2TLjxCrxPNKrqcWw.--M04k_uyfV",
        "posted": "2021-04-29T04:46:28.261Z",
        "lastScraped": "2021-05-03T04:46:28.261Z",
        "description": "<div><div><p>We'recurrently hiring for Software Development Interns to join our teams remotely in Summer 2021.</p><p> As a Software Development Intern, you will: + Develop and implement digital technology solutions with appropriate software design methodology in a dynamic and fast paced team environment + Partner with the team to perform all phases of the software development life cycle including requirements analysis, application design, code development and testing and client interaction + Work with modern DevOps tooling including Infrastructure as Code, Configuration Management, and CI/CD + Write automated unit, integration, and end-to-end tests that run in mature CI/CD pipelines + Troubleshoot production support issues post-deployment and create solutions as required + Assist in creation of technical documentation as part of client deliverables + Collaborate and work in an agile team environment</p><p></p><p> As a Software Development Intern, you will have: + An ability to define and present conceptual technology solutions to both technical and non-technical clients while articulating the value of technology to drive creative marketing platforms + The ability to translate client goals into achievable technical specifications + Experience with hands-on development, including an understanding of applications architecture such as:</p><p> + Object-oriented design and design patterns</p><p>+ ORM libraries</p><p> + Database diagramming</p><p> + Systems diagramming</p><p> + Cloud native engineering</p><p> + Serverless and microservice based solutions + Experience with technology skills including:</p><p></p><p>+ Java, C#/.NET, TS/JS or equivalent</p><p> + One SQL database technology (MySQL, MSSQL, Oracle or equivalent)</p><p> + HTML, CSS,Javascript, JSP</p><p> + Angular, React, Vue</p><p> + AWS, Azure + Experience with source control: Git and/or SVN + Ability to integrate RESTful web services + Agile software development via SCRUM or Kanban + GitHub page or code sample preferred</p><p></p><p> Basic Qualifications: + Working towards a Bachelor's Degree in Computer Science, Computer Engineering, Management Information Systems, Mathematics, orrelated field</p><p></p><p></p><p></p><p> Working at ICF</p><p></p><p> Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you're seeking to make a difference in the world, visit <span class=\"long-word\">www.icf.com/careers</span> to find your next career. ICF-together for tomorrow.</p><p></p><p> ICF is an equal opportunity employer that values diversity at all levels. (EOE - <span class=\"long-word\">Minorities/Females/</span> Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity). For more information, please read our EEO &amp; AA policy <span class=\"long-word\">(https://www.icf.com/legal/equal</span>-employment-opportunity) .</p><p></p><p>Reasonable Accommodations are available for disabled veterans and applicants with disabilities in all phases of the application and employment process. To request an accommodation please email <span class=\"long-word\">icfcareercenter@icf.com</span> and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination: EEO is the law <span class=\"long-word\">(https://www.eeoc.gov/sites/default/files/migrated\\_files/employers/poster\\_screen\\_reader\\_optimized.pdf)</span> and Pay Transparency Statement <span class=\"long-word\">(https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay</span>-<span class=\"long-word\">transp\\_English\\_unformattedESQA508c.pdf)</span> .</p><p></p><p></p><p>Virginia Remote Office (VA99)Need help? We're <span class=\"long-word\">here:ICFCareerCenter@icf.com</span></p><p>About ICF</p><p>ICF (NASDAQ:ICFI) is a global consulting services company with over 7,000 full and part-time employees, but we are not your typical consultants. At ICF, business analysts and policy specialists work together with digital strategists, data scientists and creatives. We combine unmatched industry expertise with cutting-edge engagement capabilities to help organizations solve their most complex challenges. Since 1969, public and private sector clients have worked with ICF to navigate change and shape the future. Learn more at icf.com.</p></div></div>",
        "index": 6,
        "skills": [
            "information technology",
            "software engineering",
            "sql",
            "angular",
            "java",
            "devops"
        ],
        "contact": "icfcareercenter@icf.com",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "CASS Developer",
        "company": "Oregon State University",
        "location": {
            "city": "Corvallis",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8611ccf4f969c7cc6fbb0b398bb70f9c?lvk=Fidz6oPxN101fNPBBNSObw.--M0EYQR-W3",
        "posted": "2021-04-30T04:46:29.091Z",
        "lastScraped": "2021-05-03T04:46:29.091Z",
        "description": "<div><div><div> Position Title Student Technical Assistant Job Title CASS Developer Appointment Type Student Employee Job Location Corvallis Position Appointment Percent 100 Appointment Basis 12 Min Hourly Rate $12.00 (Standard); $11.50 (Non-Urban); $13.25 (Portland Metro) Max Hourly Rate $18.00 (Standard); $17.50 (Non-Urban); $18.50 (Portland Metro) Position Summary <p>This recruitment will be used to fill mulitple part-time (a maximum of 20 hours per week) CASS Student Developer positions for the School of Electrical Engineering and Computer Science (EECS) at Oregon State University (OSU).</p><p>The Center for Applied Systems and Software (CASS) exists as a student internship program. Hourly students are hired and trained by full-time developers or student managers, to perform computer development projects. Student jobs/internships average 1-3 years in length and most graduates are hired by technology companies. In addition to the technical and development skills students gain, they also learn how to work as a member of a team, gain an appreciation of the importance of deadlines, and other facets of running a business such as planning, budgeting, resource allocation, documentation and communication.</p><p>This position is responsible for reporting to work remotely at a scheduled time and reporting to their scheduled CASS manager.</p> Position Duties <p><b>Self-directed</b>-Student Developers are assigned a project or multiple projects by full-time staff. They are then expected to complete work items related to that project-either self-selected or assigned to them-within a reasonable amount of time. Student Developers can also expect to use task-tracking software to report their progress on work items.</p><p><b>Examples of work items</b>-include: Adding a new feature to an application, fixing a bug, updating documentation, or researching and making a recommendation about a particular technology.</p><p><b>Help is available and encouraged</b>-In order to complete these work items, Student Developers are expected to seek help when it is needed, either from full-time staff, other student developers in CASS, or from the internet.</p><p><b>Work as a team</b>-Student Developers operate in a team environment; they attend virtual meetings in order to report their progress, communicate issues that are blocking their progress, and to propose solutions to problems posed by stakeholders and other developers. For particularly difficult work items, Student Developers will pair-program with other Student Developers, or, if necessary, full-time staff.</p> Minimum Qualifications <p>Employment Eligibility Requirements <span class=\"long-word\">(http://fa.oregonstate.edu/stu</span>-manual/500-employment-eligibility-requirements)</p> Additional Required Qualifications <ul><li>Have at least 9 months of schooling left</li></ul><ul><li>Basic knowledge about OOP languages</li></ul><ul><li>Development experience, or classes taken, in one or more of the following technologies: <ul><li>C#</li><li>C++</li><li>SQL</li><li>HTML</li><li>XML</li><li>Java</li><li>TypeScript</li><li>JavaScript</li></ul></li></ul> Preferred (Special) Qualifications <ul><li>Would like the applicant to have work experience (volunteer work can count)</li></ul><ul><li>Experience with task-tracking software such as Azure DevOps Boards, Jira, or GitHub Issues</li></ul><ul><li>Experience using an Integrated Development Environment such as Visual Studio or Visual Studio Code</li></ul><ul><li>Experience with Git or another version-control technology</li></ul> Working Conditions / Work Schedule <p>Typical work-schedule is at least 2-hour-consecutive periods between 8am and 6pm, Monday through Friday.</p><p>Students will work remotely due to COVID-19 and then are expected to work on site as soon as OSU resumes on-site operations. (this policy may be negotiable)</p><p>Minimum 15-hours per week during the academic term. Possibility of up to 40 hours during breaks if there is work to be completed.</p></div><div> Posting Number P07369SE Number of Vacancies 2 Anticipated Appointment Begin Date 06/16/2021 Anticipated Appointment End Date Posting Date 04/30/2021 Full Consideration Date 05/24/2021 Closing Date 06/01/2021 Indicate how you intend to recruit for this search Competitive / Student - open to ALL qualified/eligible students Special Instructions to Applicants <p>When applying you will be required to attach the following electronic documents:</p><p>1) A Resume/Vita<br> 2) A cover letter indicating how your qualifications and experience have prepared you for this position.</p><p>For additional information please contact: Carrie Hertel at <span class=\"long-word\">info@CASS.oregonstate.edu.</span></p><p>OSU commits to inclusive excellence by advancing equity and diversity in all that we do. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community.</p><p>Note: All job offers are contingent upon Human Resources final approval.</p></div></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "sql",
            "java",
            "data visualization",
            "javascript",
            "devops"
        ],
        "remote": true
    },
    {
        "position": "JR0162101 - SOC Power Convergence - Graduate Intern",
        "company": "Intel",
        "location": {
            "city": "Santa Clara",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6b7528ef00f47f44eb49131d2f4233dc?lvk=9ydLzjhss2XEO-TeCi8lRA.--M02LkbUWR",
        "posted": "2021-04-28T04:46:29.958Z",
        "lastScraped": "2021-05-03T04:46:29.958Z",
        "description": "<div><p>Job ID: JR0162101 Job Category: Intern/Student Primary Location: Santa Clara, CA US Other Locations: US, Oregon, Hillsboro;Virtual US and Canada Job Type: Intern SOC Power Convergence - Graduate Intern Job Description Responsibilities may be quite diverse of a technical nature. U.S. experience and education requirements will vary significantly depending on the unique needs of the job. </p><p>Job assignments are usually for the summer or for short periods during breaks. Used for jobs with a higher market rate than standard tech jobs. Qualifications You must possess the below minimum qualifications to be initially considered for this position. </p><p>Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your schoolwork, classes, research and/or relevant previous job and/or internship experiences. Minimum Qualifications The candidate must be pursuing a Masters degree in <span class=\"long-word\">Electrical/Computer</span> Engineering or Computer Science 3+ months experience with: Scripting with Python, Perl, and/or TCL Preferred Qualifications Familiarity with Synopsys timing power tools PT PTPX Prime Power Fundamental understanding of Computer Architecture and/or Digital Circuit Design Inside this Business Group Xeon Performance Group (XPG) delivers custom server SoC design solutions to our data center customers. </p><p>It is chartered to deliver data centric silicon that is high-performing, cost-effective, high-quality, and on schedule in way that increases market share and drives the best solutions for our customers. Other Locations US, Oregon, Hillsboro;Virtual US and Canada Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. <span class=\"long-word\">USInternJR0162101Santa</span> Clara</p></div>",
        "index": 8,
        "skills": [
            "python",
            "virtual reality",
            "information technology",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Range Technician",
        "company": "Interior, Bureau of Indian Affairs",
        "location": {
            "city": "Harlem",
            "state": "Montana",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/15f590082f904f26d66f64b316c785cd?lvk=O3YF1XjbjBB83uootgBowA.--M0JoRm51J",
        "posted": "2021-05-02T04:46:30.894Z",
        "lastScraped": "2021-05-03T04:46:30.894Z",
        "description": "<div><p>Summary This position is located with the Bureau of Indian Affairs, Superintendent, Fort Belknap Agency in Harlem, Montana. Responsibilities Assist with vegetation data collection and gathering of soil, woodland, and range inventories. Provide guidance for all proposed actions on Tribal lands or federal funds, permitting, control and comply with Department of Interior, National Environmental Policy Act (NEPA), and Council on Environmental Quality (CEQ) regulations. </p><p>Develop plans for range and farm pasture leases. Utilize and interpret aerial photographs, topographic maps, remote sensing data, computer driven linear measuring system, GPS, GIS and personal knowledge of the reservation. Provide technical support and services to Federal, State, Tribal, local agencies, and the general public. </p><p>Requirements Conditions of Employment Qualifications Grade (04): 6 Months General Experience AND 6 months Specialized Experience: Education and Training For GS-4: Successful completion of 2 years of study that included at least 12 semester hours in any combination of courses such as forestry, agriculture, crop or plant science, range management or conservation, wildlife management, watershed management, soil science, natural resources (except marine fisheries and oceanography), outdoor recreation management, civil or forest engineering, or wildland fire science. No more than 3 semester hours in mathematics is creditable. Grade (05): For GS-5: Successful completion of a full 4-year course of study leading to a bachelor's degree (a) with major study in forestry, range management, agriculture, or a subject-matter field directly related to the position, or (b) that included at least 24 semester hours in any combination of courses such as those shown above For GS-4. </p><p>No more than 6 semester hours in mathematics is creditable. Specialized Experience: 1-year equivalent to at least next lower grade. Specialized Experience (for positions at GS-4 and above) In addition to the experience requirements described in the group coverage standard, seasonal experience may also be creditable. </p><p>A season of experience is considered to be a period of no less than 3 months of continuous employment on a seasonal basis. Shorter periods may be combined to make a season, provided a total of at least 3 months' experience is shown. For any period where the work exceeded 3 months, the excess work is credited towards an additional season. </p><p>Grade (06): Specialized Experience: 1-year equivalent to at least next lower grade. Education: Graduate education or an internship meets the specialized experience required above GS-5 only in those instances where it is directly related to the work of the position. One full year of graduate education meets the requirements for GS-7. </p><p>Two full years of graduate education or a master's degree meets the requirements for GS-9. One year of full-time graduate education is considered to be the number of credit hours that the school attended has determined to represent 1 year of full-time study. If that information cannot be obtained from the school, 18 semester hours should be considered as satisfying the 1 year of full-time study requirement. </p><p>Part-time graduate education is creditable in accordance with its relationship to a year of full- time study at the school attended. Specialized Experience (for positions at GS-4 and above) In addition to the experience requirements described in the group coverage standard, seasonal experience may also be creditable. A season of experience is considered to be a period of no less than 3 months of continuous employment on a seasonal basis. </p><p>Shorter periods may be combined to make a season, provided a total of at least 3 months' experience is shown. For any period where the work exceeded 3 months, the excess work is credited towards an additional season. All qualification requirements must be met by the closing date of this announcement. </p><p>Merit Promotion candidates must also meet time-in-grade requirements by the announcement closing date. Education If you are qualifying based on your education, you MUST provide transcripts or other documentation to support your educational claims. Unless otherwise stated: (1) official or unofficial transcripts are acceptable, or (2) you may submit a list with all of your courses, grades, semester, year, and credit for the course. </p><p>All materials must be submitted by the closing date of the announcement. If more than 10 percent of your undergraduate course work (credit hours) were taken on a pass/fail basis, your claim of superior academic achievement must be based upon class standing or membership in an honor society. One academic year of graduate education is considered to be the number of credits hours your graduate school has determined to represent one academic year of full-time study. </p><p>Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study. If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education which shows the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. </p><p>education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: FOREIGN EDUCATION Additional Information All new hires earn the beginning salary of their pay grade (Step 1). </p><p>See 2021 Salary Tables and select the pay chart for Harlem, Montana. If no specific chart is listed for this geographic location, see the \"rest of U.S.\" chart. The full performance level of this position is GS-6. </p><p>Promotion potential in this announcement does not constitute a commitment or an obligation on the part of management to promote the employee selected at some future date. A career ladder promotion is at the discretion of management, and in no way guaranteed. Career Transition Assistance Programs: These programs apply to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. </p><p>To receive selection priority for this position, you must: (1) meet CTAP or ICTAP eligibility criteria; (2) be rated well-qualified for the position with a score of 85 or above; and, (3) submit the appropriate documentation to support your CTAP or ICTAP eligibility. For more information visit: <span class=\"long-word\">http://www.opm.gov/rif/employee\\_guides/career\\_transition.asp</span> . Under the Land Management Workforce Flexibility Act (LMWFA) two groups of individuals are eligible to apply under this announcement: current and/or former employees serving or who have served under time-limited competitive appointments at land management agencies. </p><p>Land Management Agencies include: Bureau of Indian Affairs, Bureau of Land Management, Bureau of Reclamation, U.S. Fish and Wildlife Service, National Park Service, and U.S. Forest Service. </p><p>Current appointees: 1) must have been hired under competitive examining procedures to a time limited appointment with a land management agency; 2) must have served under one or more time limited appointment(s) by a land management agency for a period totaling more than 24 months without a break in service of 2 or more years; AND 3) must have performed at an acceptable level during each period of service. Former appointees: 1) must have been hired under competitive examining procedures to a time limited appointment with a land management agency; 2) must have served under one or more time limited appointment(s) by a land management agency for a period totaling more than 24 months without a break in service of 2 or more years; 3) must have separated for reasons other than misconduct or performance; AND 4) must have performed at an acceptable level through the service period. Certain candidates may be eligible to apply under a special hiring authority including those for disabled individuals, Peace Corps employees, Foreign Service employees, veterans, etc. </p><p>For more information, visit the following OPM websites: USAJOBS Information Center: <span class=\"long-word\">https://www.usajobs.gov/Help/</span>; Vets Info Guide: <span class=\"long-word\">http://www.fedshirevets.gov/.</span> Former Federal Employees are required to indicate whether they received a Voluntary Separation Incentive Payment (VSIP) buyout in their previous employment with the Federal government, and are required to submit a copy of the applicable Notification of Personnel Action (SF-50) regarding the VSIP. Most individuals who accept reemployment with the Federal government within 5 years of receiving the VSIP amount, must repay the gross amount of the separation pay prior to reemployment.</p></div>",
        "index": 9,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Medical Technologist",
        "company": "Cancer Care Northwest",
        "location": {
            "city": "Spokane",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/cancer-care-northwest-8aa87daf/medical-technologist-8a8fbf55?lvk=RY0VqufMR-2fxBxLhj1YJA.--M0Gx1lquk",
        "posted": "2021-05-02T04:46:32.103Z",
        "lastScraped": "2021-05-03T04:46:32.103Z",
        "description": "<div><p>Cancer Care Northwest is hiring part time Medical Technologist, responsible for accurately performing evaluating, and submitting results on specimens received for laboratory analysis for the purpose of aiding the physician in diagnostic and therapeutic treatment of our patients. </p><p>To perform this job successfully, an individual must have:</p><ul><li>Bachelor's degree from an accredited Medical Technology program or a Bachelor's Degree in a science related field with a 12 month Medical Technology Clinical Internship and an ASCP or AMT certification. </li><li>Minimum of one to five years of experience hematology experience.</li><li>Computer skills needed. </li><li>Work week is Monday thru Friday, no weekends or holidays. </li></ul><br><br><b><i>Job Posted by ApplicantPro</i></b><br></div>",
        "index": 10,
        "skills": [
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Community Research Assistant",
        "company": "University of Southern Mississippi",
        "location": {
            "city": "Hattiesburg",
            "state": "Mississippi",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3ba32ce68211d3c3d423ae011a6c1187?lvk=o6iiilDZhulIKqhsa_1qXA.--M0Ml84TEF",
        "posted": "2021-01-05T04:46:32.937Z",
        "lastScraped": "2021-05-03T04:46:32.937Z",
        "description": "<div><div><p><strong>Community Research Assistant</strong></p><p> The University of Southern Mississippi is currently accepting applications for the position of Community Research Assistant. </p><br><strong>Position Details</strong> Location Hattiesburg<br><br>118 College Drive<br>Hattiesburg, Mississippi, 39406-0001<br>United States Division School of Biological, Environmental, and Earth Sciences Position Type Staff Employment Status Part Time Grant Funded Yes Salary Range 10.00 - 10.00 Posting Close Date Open Until Filled <p></p><p><strong>Job Summary:<br></strong>Mississippi INBRE Community Engagement &amp; Training Core is hiring part-time (10 hours per week) Research Interns to support research activities of a grant project. The position is temporary and will be remote.<br><br><strong>Primary Job Duties and Responsibilities:<br></strong>1.&nbsp; Work with a team to create survey on an online platform and manage survey related activities as well as data collection and analysis.<br><br>2.&nbsp; Plan and execute survey deployment and execution.<br><br>3.&nbsp; Manage distribution of survey incentives.&nbsp;<br><br>4.&nbsp; Complete required trainings and participate in regular team communication and meetings.<br><br>5.&nbsp; Collaborate and maintain professional relationship with program coordinator, faculty members, staff, community and other project partners.<br><br>6.&nbsp;&nbsp; Performs other miscellaneous tasks to support the project, as needed, and performs other duties as assigned.</p><p></p><p></p><div><strong>Minimum Qualifications&nbsp;</strong></div><div> &nbsp;&nbsp; Currently enrolled as a student at a community college or university<br>&nbsp;&nbsp; Has fundamental knowledge of survey research<br><br></div><div></div><div><strong>Knowledge, Skills &amp; Abilities</strong></div><div> &nbsp;&nbsp; Proficiency in use of a personal computer and software such as Microsoft Office (Word, PowerPoint, Outlook, and Excel, Teams) and Zoom.<br>&nbsp;&nbsp; Ability to gather data, compile information, and prepare reports&nbsp;<br>&nbsp;&nbsp; Skill in organizing resources and establishing priorities&nbsp;<br>&nbsp;&nbsp; Good interpersonal, organizational, oral, and written communication skills&nbsp;<br>&nbsp;&nbsp; Ability to handle multiple tasks, multiple deadlines, and organizational strategies<br><br></div><div></div><div><strong>Preferred Qualifications&nbsp;&nbsp;</strong></div><div> Has previous research experience and familiarity with Qualtrics. </div><p></p><hr><p><strong>About The University of Southern Mississippi</strong><br>The University of Southern Mississippi (USM) is a comprehensive public research institution delivering transformative programs on campuses in Hattiesburg and Long Beach, at teaching and research sites in central and southern Mississippi, as well as online. Founded in 1910, USM is one of only 130 universities in the nation to earn the Carnegie Classification of Institutions of Higher Education's \"R1: Doctoral Universities - Very high research activity\" designation, and its robust research enterprise includes experts in ocean science and engineering, polymer science and engineering, and sport venue safety and security, among others.&nbsp; USM is also one of only 40 institutions in the nation accredited in theatre, art and design, dance and music. As an economic driver, USM generates an annual economic impact of more than 600 million across the state. USM welcomes a diverse student body of approximately 15,000, representing 71 countries, all 50 states, and every county in Mississippi. USM students have collected four Truman Scholarships and 36 National Science Foundation Graduate Research Fellowships, while also leading Mississippi with 24 Goldwater Scholarships, an honor that recognizes the next generation of great research scientists. Home to the Golden Eagles, USM competes in 17 Division I sports sponsored by the National Collegiate Athletic Association (NCAA). For more information, visit&nbsp;www.usm.edu. </p><p> As an Affirmative Action/Equal Employment Opportunity employer/Americans with Disabilities Act institution, The University of Southern Mississippi encourages minorities, women, veterans and persons with disabilities to apply. </p><br></div></div>",
        "index": 11,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Data Analytics Intern (Summer 2021)",
        "company": "Jam City",
        "location": {
            "city": "San Francisco",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e934d79656f5a1bfc9798d7b468d741f?lvk=CP09LKFe8PA4x4DPOBdRYA.--M0EQwe4Y7",
        "posted": "2021-05-01T04:46:33.830Z",
        "lastScraped": "2021-05-03T04:46:33.830Z",
        "description": "<div><div><div> Are you interested in using data to help drive product decisions? We are looking for a motivated <b>Data Analytics Intern</b> who has an interest in mobile games to remotely join our team for the Summer 2021 Internship Program. In this exciting internship, you will get the opportunity to learn and work with some of the industry's top product &amp; analytics professionals as well as collaborate with creative and product teams. This is an excellent opportunity for someone who thrives in a fast-paced environment, while getting immersed in analytics that drive business decisions, from game economies to the user experience of our mobile games. <b>Our Summer 2021 Internship Program will be entirely remote.</b></div><div> Internship Program Qualifications: <ul><ul><li>Must be currently enrolled in an undergraduate or graduate university program in the U.S (upcoming Juniors or Seniors) and able to intern remotely through late August 2021</li><li>Applicants must be legally authorized to work in the US during the Summer 2021 session. Visa sponsorship is not available for our internship positions.</li><li>Be able to work on a part-time basis (up to 30 hours per week)</li></ul></ul></div><div> WHAT YOU WILL DO: <ul><ul><li>Partner with product managers and designers to provide analysis of and insights into player behavior and overall game performance to drive product decisions using our top-of-the-line data warehouse.</li><li>Create easily interpretable live dashboards to allow for rapid analysis of product health, feature prioritization, event performance, and monetization.</li><li>Identify and drive analytics projects that you want to work on that will provide positive ROI for the studio and company.</li><li>Collaborate on machine learning/other data science projects to improve monetization and engagement.</li><li>Work side by side with our Data Analytics team to analyze player trends and behaviors</li></ul></ul></div><div> WHO YOU ARE: <ul><ul><li>Must be currently enrolled in an undergraduate or graduate college program in the U.S. (upcoming Juniors or Seniors)</li><li>Be able to work on a part-time basis (up to 30 hours per week)</li><li>Majoring in a business or quantitative discipline (Economics, Statistics).</li><li>Some experience using SQL (experience with statistics software, Python, R a plus), Excel and data visualization tools.</li><li>Knowledge of statistics and statistical models (linear/logistic regression, cluster, factor analysis). </li><li>Strong communication skills to articulate quantitative analysis in a way that broad game teams and executives can understand.</li><li>Ability to plan, execute, present results on analysis projects.</li><li>Ability to work in a fast-paced, collaborative environment</li><li>Passion for mobile games and interest in a career within the gaming industry</li></ul></ul></div><div><b>About Jam City's Internship Program:</b></div><div><br></div><div> &nbsp; Jam City's Summer 2021 Digital Internship Program will take place from June 14th&nbsp; - August 27, 2021 and will be entirely remote. Students can expect a paid, part-time (25-30 hours per week) internship working alongside Jam City's business and studio development teams. Within internships, students gain valuable insights into our products, players, and industry. Our program allows students to work on impactful projects, collaborate with industry professionals, and develop problem-solving skills through real hands-on experiences. We're looking for students that bring curiosity, creativity, and an interest in mobile games.</div><div><br></div><div> #LI-Remote</div><div><br></div><div><b>OUR COMMITMENT TO EQUITY, DIVERSITY, &amp; INCLUSION</b></div><div><br></div><div> We believe in creating games that unite people across the world and that showcase our commitment to providing an environment that is both inclusive and diverse for our players and employees. We strive to create a workforce that is reflective of our global player community as we know that we are stronger and better when we play together. To help promote an inclusive culture, we celebrate the visible and invisible diversity of our Jam Citizens through initiatives including Employee Resource Groups, cultural events, trainings, speaker series, and more.&nbsp;</div><div><br></div><div> Jam City is an equal opportunity employer. We enthusiastically accept our responsibility to make employment decisions without regard to race, age, sex (including pregnancy), national origin, ancestry, religion, ethnicity, marital, or domestic partnerships status, disability, genetic information (including the refusal to submit to genetic testing), predisposing genetic characteristics, military status, veteran status, domestic violence victim status, sexual orientation, gender identity or expressions, or any other classification protected by federal, state, and local laws. Our management is committed to following this policy with respect to hiring, placement, promotion, transfer, demotion, layoff, termination, recruiting, pay, and other forms of compensation, training, and general treatment during employment.</div><div><br></div><div><b>ABOUT JAM CITY</b></div><div><br></div><div> Jam City is an award-winning mobile entertainment studio providing unique and deeply engaging games that appeal to a broad, global audience.</div><div><br></div><div> Led by CEO Chris DeWolfe, former MySpace co-founder and CEO, and COO Josh Yguado, former 20th Century Fox executive, Jam City is the creative powerhouse behind some of the highest-grossing and most enduring mobile games. Jam City's global franchise Cookie Jam has generated more than half a billion dollars, and Panda Pop has more than 120 million downloads to date.</div><div><br></div><div> The company also is the go-to studio for Hollywood, having developed immersive, narrative-rich mobile games around iconic entertainment brands. The company's popular RPG game Harry Potter: Hogwarts Mystery was the #1 game in more than 40 countries at its launch in April 2018.</div><div><br></div><div> Jam City has nine studios located in Los Angeles (HQ), Berlin, Buenos Aires, Bogota, Burbank, Cedar Falls, San Diego, San Francisco, and Toronto.</div></div></div>",
        "index": 12,
        "skills": [
            "machine learning",
            "project management",
            "sql",
            "data visualization",
            "python",
            "game design",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Consumer Insights Intern (Graduate Student - Summer 2021)",
        "company": "Jam City",
        "location": {
            "city": "Culver City",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/65eae662ed59d7a68bbe02d1771ca156?lvk=F96vn-7tFSEtm_xI7TGVlA.--M0EQzaZTw",
        "posted": "2021-05-01T04:46:34.694Z",
        "lastScraped": "2021-05-03T04:46:34.694Z",
        "description": "<div><div><div> Los Angeles' premier mobile games studio, Jam City is seeking a remote <b>Consumer Insights Graduate Intern</b> to join our team for the Summer 2021 Internship Program. A unique opportunity to join an award-winning gaming company, this is the perfect opportunity for an ambitious <i>graduate student</i> eager to break into the mobile gaming space and gain valuable experience in the field of market research. Jam City is the creator of leading games like; Harry Potter: Hogwarts Mystery, Disney Frozen Adventures, Disney Emoji Blitz, and Cookie Jam</div><div> Internship Program Qualifications: <ul><ul><li>Must be currently enrolled in a graduate university program in the U.S and able to intern remotely through late August 2021 (preference for December 2021)</li><li>Applicants must be legally authorized to work in the US during the Summer 2021 session. Visa sponsorship is not available for our internship positions.</li><li>Be able to work on a part-time basis (up to 30 hours per week)</li></ul></ul></div><div> WHAT YOU WILL DO: <ul><ul><li>Analyze player survey data, clean survey data, and assist with writing and presenting reports.</li><li>Partner with Consumer Insights managers to create in-depth player profiles to deepen our understanding of players across our portfolio of games.</li><li>Create player profiles from a combination of qualitative and quantitative data.</li><li>Elevate our market segmentation research by identifying behaviors, motivations, and frustrations of Jam City segments across our portfolio of games. This will include conducting ad hoc survey research and qualitative research with current players.</li><li>Partner with Product Managers and Data Science to enrich research findings with analytics and behavioral data.</li><li>Review reports, surveys, screeners, and other research to ensure a high level of quality and accuracy.</li><li>Take initiative to stay current with industry trends and best practices in the mobile games industry and in the market research industry.</li></ul></ul></div><div> WHO YOU ARE: <ul><ul><li>Must be currently enrolled in a graduate program (Master's or PhD)</li><li>Preference for students interested in interning through December 2021</li><li>Passion for research and consumer insights.</li><li>Must be passionate about mobile games.</li><li>Ability to work collaboratively in a fast-paced environment.</li><li>Excellent written and verbal communication skills.</li><li>Excellent Excel &amp; PowerPoint proficiency.</li><li>Understanding of data analysis, SPSS proficiency a plus.</li><li>Some experience with survey tools (Qualtrics, Survey Gizmo, Survey Monkey, etc.) is preferred.</li><li>Some qualitative research experience is preferred (focus groups, IDIs).</li><li>Strong attention to detail, written and oral communications skills.</li><li>Comfortable working with large quantitative and qualitative datasets.</li><li>Can organize, clarify and communicate complex ideas quickly, succinctly, and accurately.</li><li>Has quick intelligence, is fast on the feet, and quickly responds to inquiries and questions.</li></ul></ul></div><div><b>About Jam City's Internship Program:</b>&nbsp;</div><div><br></div><div> Jam City's Summer 2021 Digital Internship Program will take place from June 14th&nbsp; - August 27, 2021, and will be entirely remote. Students can expect a paid, part-time (25-30 hours per week) internship working alongside Jam City's business and studio development teams. Within internships, students gain valuable insights into our products, players, and industry. Our program allows students to work on impactful projects, collaborate with industry professionals, and develop problem-solving skills through real hands-on experiences. We're looking for students that bring curiosity, creativity, and an interest in mobile games.</div><div><br></div><div> #LI-Remote</div><div><br></div><div><b>OUR COMMITMENT TO EQUITY, DIVERSITY, &amp; INCLUSION</b></div><div><br></div><div> We believe in creating games that unite people across the world and that showcase our commitment to providing an environment that is both inclusive and diverse for our players and employees. We strive to create a workforce that is reflective of our global player community as we know that we are stronger and better when we play together. To help promote an inclusive culture, we celebrate the visible and invisible diversity of our Jam Citizens through initiatives including Employee Resource Groups, cultural events, trainings, speaker series, and more.&nbsp;</div><div><br></div><div> Jam City is an equal opportunity employer. We enthusiastically accept our responsibility to make employment decisions without regard to race, age, sex (including pregnancy), national origin, ancestry, religion, ethnicity, marital, or domestic partnerships status, disability, genetic information (including the refusal to submit to genetic testing), predisposing genetic characteristics, military status, veteran status, domestic violence victim status, sexual orientation, gender identity or expressions, or any other classification protected by federal, state, and local laws. Our management is committed to following this policy with respect to hiring, placement, promotion, transfer, demotion, layoff, termination, recruiting, pay, and other forms of compensation, training, and general treatment during employment.</div><div><br></div><div><b>ABOUT JAM CITY</b></div><div><br></div><div> Jam City is an award-winning mobile entertainment studio providing unique and deeply engaging games that appeal to a broad, global audience.</div><div><br></div><div> Led by CEO Chris DeWolfe, former MySpace co-founder and CEO, and COO Josh Yguado, former 20th Century Fox executive, Jam City is the creative powerhouse behind some of the highest-grossing and most enduring mobile games. Jam City's global franchise Cookie Jam has generated more than half a billion dollars, and Panda Pop has more than 120 million downloads to date.</div><div><br></div><div> The company also is the go-to studio for Hollywood, having developed immersive, narrative-rich mobile games around iconic entertainment brands. The company's popular RPG game Harry Potter: Hogwarts Mystery was the #1 game in more than 40 countries at its launch in April 2018.</div><div><br></div><div> Jam City has nine studios located in Los Angeles (HQ), Berlin, Buenos Aires, Bogota, Burbank, Cedar Falls, San Diego, San Francisco, and Toronto.</div></div></div>",
        "index": 13,
        "skills": [
            "project management",
            "game design",
            "information technology"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "2021 - 2022 Second Chance Program Training Specialist Intern",
        "company": "Chicago Transit Authority",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a0158a7c28103f30151e7d53498f16b1?lvk=PEKB0JfQ0RwH8YaFt2ZuBA.--M0L0DXKpZ",
        "posted": "2021-05-01T04:46:35.540Z",
        "lastScraped": "2021-05-03T04:46:35.540Z",
        "description": "<div><div><p>You might be thinking, \"What opportunities does CTA have for students with my degree and credentials?\" </p><p>You may be surprised to learn that we hire interns with a diverse skill set and a multitude of majors. In fact, we hire students in good academic standing with a variety of degrees that you may not have expected, and we want to consider you for available opportunities! </p><p>Interns at CTA work in a range of departments including: </p><ul><li>Administration Departments ranging from Diversity/EEO, Human Resources, Training and Workforce Development and more </li><li>Board and President's Office </li><li>Communications </li><li>Finance and Purchasing</li><li>Infrastructure </li><li>Law </li><li>Legislative Affairs and Government and Community Relations </li><li>Safety and Security </li><li>Technology </li><li>Transit Operations </li></ul><p>Our internships are project-based; therefore, the skills that we seek vary based on the needs of the projects during each term. All majors are welcome to apply, but please see education <span class=\"long-word\">experience/requirements</span> for specifics about what disciplines each internship project is seeking. </p><p>Internships are part-time (15 hours a week) during the school year and full-time (40 hours a week) during the summer.</p><p>In this role within the Workforce Partnerships - Second Chance Programs unit, interns will:</p><ul><li>Create professional development curriculum and facilitate monthly workshops.</li><li>Contribute to the goal of providing Second Chance Participants with the skills needed to be successful as transit professionals.</li></ul><p><b>Educational <span class=\"long-word\">Experience/Requirements:</span> </b></p><p>Minimum Level of Education: Graduate student</p><p>Preferred Major(s): Social Work, Public Relations, Education, Public Administration</p><p><b>Physical Requirements: </b></p><p>The demands associated with the normal office environment</p><p>Light physical activity, including walking outdoors and climbing stairs</p><p><b>Knowledge, Skills and Abilities: </b></p><p>Strong Microsoft Office and computer skills </p><p>Good oral and written communication skills </p><p>Good analytical and critical thinking skills </p><p>Good organizational skills with attention to detail </p><p>Good project management skills</p><p>Facilitation&nbsp;curriculum writing</p></div></div>",
        "index": 14,
        "skills": [
            "project management",
            "machine learning",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Systems Programmer Intern",
        "company": "Intel",
        "location": {
            "city": "Folsom",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/fef6804b4bb44f9c75f55c35ce3bfb33?lvk=ausOT1QP7p4MqJETFlQloA.--M04ha4gPV",
        "posted": "2021-04-27T04:46:36.477Z",
        "lastScraped": "2021-05-03T04:46:36.477Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>We are looking for a highly motivated Software Development Intern for an exciting opportunity to work for the High Performance Compute Federation Engineering Team!<br><br>The High Performance Compute Federation Engineering is a team of Software Developers who build and manage software tools and automation needed for effectively managing the large HPC compute infrastructure planning and execution.<br><br>As an Intern for Intel, your responsibilities will include but not be limited to:</p><ul><li>Responsible for functions in support of computing hardware for design engineering in Intel data-centers.</li><li>Executes and coordinates multi-team install process for computing hardware.</li><li>Tests and troubleshoots computer hardware/software issues.</li><li>Executes break-fix and process within specified service level agreements.</li><li>Installs operating systems and troubleshoots basic install issues.</li><li>May perform operational test and fault isolation on systems and equipment.</li><li>Works with asset management and ticketing systems.</li><li>Executes regular equipment audits.</li><li>Interfaces with and manages working relationships with hardware vendor technicians.</li><li>May script or program solutions to improve productivity.</li><li>Adheres to physical and electronic security standards, work performed within generally defined parameters.</li></ul><p></p><p>The ideal candidate should exhibit the following behavioral traits:</p><ul><li>Self-motivated individual willing to take and follow directions with little supervision and deliver to schedule.</li><li>Quantitative analytical and problem conflict resolution skills.</li><li>Effective prioritization and time management skills.</li><li>Demonstrated customer communications skills with internal/external customer.</li></ul><p></p><p>This position will be for a long-term internship open to Part Time candidates.</p><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work research and/ or relevant previous job and / or internship experiences.</p><p></p><p><b>Education:</b></p><ul><li>Currently pursuing a Bachelor's degree in Software Engineering, Computer Engineering or any other related field.</li></ul><p></p><p><b>Minimum Qualifications:</b><br>Understanding or coursework in:</p><ul><li>Programming in Java Web Development using HTML JavaScript.</li></ul><p><br><b>Preferred Qualifications:</b></p><ul><li>Understanding of web app development and REST API service development in AngularJS.</li><li>Familiarity with any QA Automation tools, for example: Selenium.</li></ul><p></p><p>This position is <b>not</b> eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience. </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, California, Folsom<p></p><p></p>Additional Locations:Virtual US and Canada<p></p><p></p><p></p><p></p>Business group:Intel's Information Technology Group (IT) designs, deploys and supports the information technology architecture and hardware/software applications for Intel. This includes the LAN, WAN, telephony, data centers, client PCs, backup and restore, and enterprise applications. IT is also responsible for e-Commerce development, data hosting and delivery of Web content and services.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>",
        "index": 15,
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "hardware",
            "project management",
            "virtual reality"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Marketing Intern",
        "company": "Signs.Com",
        "location": {
            "city": "Salt Lake City",
            "state": "Utah",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/signs-com-d5db8326/marketing-intern-a89e5d86?lvk=kv1X9HrIBVQNvuK5BsAfeg.--M0AjCZy7Z",
        "posted": "2021-05-01T04:46:37.921Z",
        "lastScraped": "2021-05-03T04:46:37.921Z",
        "description": "<div><p>What are your summer plans? Do you have a job that will improve your resume for college and future work? How about working for one of the fastest-growing tech companies in the heart of Silicon Slopes? Come work with us at Signs.com.</p><p>Signs.com is seeking hard-working individuals to contribute to our growth this summer. This internship will focus on data entry and marketing research. The primary responsibility of the role is to analyze Signs.com customers and orders and enter descriptive data points about them for future marketing purposes. </p><p>This is a summer internship. We will provide valuable training and mentorship. You will contribute as a part of a team to provide the Signs.com marketing team with valuable data. We provide a great work environment including free snacks and other perks!</p><p></p><p><strong>Job Type</strong></p><ul><li>Full-Time or Part-Time</li><li>Remote work possible </li></ul><p><strong>Responsibilities</strong></p><ul><li>Data entry</li><li>Marketing research</li><li>Analytical decision making</li><li>Critical thinking </li></ul><p><strong>You should be someone who has:</strong></p><ul><li>A desire to improve your resume this summer</li><li>Computer competency</li><li>Typing proficiency</li><li>Microsoft Word &amp; PowerPoint skills</li><li>A high school degree or working towards it</li><li>A laser-like focus on the task at hand</li><li>A competitive spirit</li><li>A hard-working attitude </li></ul><p><strong>Pay</strong></p><ul><li>$11/hr </li></ul><p><strong>Perks</strong></p><ul><li>Flexible scheduling around summer vacations and camps</li><li>Free snacks and drinks</li><li>Signs.com t-shirt</li><li>Company events</li></ul><p><strong>Start date/End date</strong></p><ul><li>May-September 2021</li></ul></div>",
        "index": 16,
        "skills": [],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Mass Spectrometry Marketing Intern",
        "company": "Agilent",
        "location": {
            "city": "Santa Clara",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/bb6efb26a932120cc6c18d10a279979f?lvk=1ROwbGoc7FyCtba6PRdv9g.--M01fgIww7",
        "posted": "2021-04-28T04:46:38.762Z",
        "lastScraped": "2021-05-03T04:46:38.762Z",
        "description": "<div><div><p>Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek -- so they can do what they do best: improve the world around us. Information about Agilent is available at www.agilent.com.</p><p><span class=\"long-word\">https://www.youtube.com/watch?v=t7UHkWJU52A</span></p><p></p><p>The Mass Spectrometry Marketing team is looking for a talented individual to join the team as Marketing intern. As an Intern, you will apply coursework knowledge to a variety of marketing hands-on projects. At the same time, you will gain and apply knowledge about Agilent's industry and products in your projects. This is an opportunity to develop real world experience within a dynamic team with highly experienced professionals in a company that is a leader in the markets it serves. The Internship is full-time during the summer months and part-time (15-20 hours) during the academic year.</p><p></p><p>You will have a direct impact on how our products are viewed by the internal teams and customers. You will assist in the launch of programs to support our products. Through collaboration with product management, and other marketing teams you will gather information and gain insight to enhance product information.</p><p></p><ul><li>Work on marketing projects to enable eCommerce related programs</li><li>Maintain and enhance the content for the products in the current portfolio on internal field portal</li><li>Enable product managers in development of more content rich product pages</li><li>Work with product manager on the ecommerce and web strategy on identified new opportunities as part of SEO and optimization of product pages</li><li>Work on product content updates including submission of content via web operation requests</li><li>Manage competing priorities through effective communication and time management skills</li><li>Participate in collaborative team meetings</li><li>Learn and apply the theory obtained during your program in a professional environment</li></ul><p>Note: This position is open for remote until a clear to return to the Santa Clara, CA site.</p><p>﻿<br>The Hourly range for this position in Colorado is currently [ min of $19.11 and a max of $34]<br><br></p><p>For this intern role, we are looking for a motivated individual with an aptitude for marketing along with a technical background.</p><ul><li>The candidate must be pursuing a scientific degree (biomedical, life sciences or analytical chemistry)</li><li>Hands-on experience in a LC, GC, or mass spectrometry is desired</li><li>Understanding of SEO/SEM and ecommerce is preferred</li><li>Excellent written and verbal communications skills and enjoy working in a fast paced, dynamic team environment. Have excellent interpersonal skills, strong oral communication skills.</li><li>Experience or the desire to learn what it takes to launch successful products and/or programs</li><li>Organized, self-motivated, able to manage priorities &amp; to work independently</li><li>Ability to handle multiple projects and tasks</li><li>Be detail-oriented and have a strong level of accountability.</li><li>Good understanding of the principles of marketing, Microsoft Excel and PowerPoint.</li><li>Analyze &amp; present marketing data<br></li></ul><p><b>Note</b>: Due to the restrictions of the pandemic you must be able to successfully work remotely and accommodate Pacific Time day shift hours .</p><p><br></p><p>Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.</p><p>Agilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please email <span class=\"long-word\">job_posting@agilent.com</span> or contact +1-262-754-5030.</p><p>For more information about equal employment opportunity protections, please see all of our notices for EEO below.</p><p><br></p><p><br></p><p></p></div></div>",
        "index": 17,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "contact": "job_posting@agilent.com, 1-262-754-5030",
        "remote": true
    },
    {
        "position": "Access Your Future Service Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Mankato",
            "state": "Minnesota",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/bf29f406ce8128d7fdd9530047698de7?lvk=QJIySpWnvSrku_vjGUuLwQ.--M0EX22MXJ",
        "posted": "2021-04-27T04:46:40.047Z",
        "lastScraped": "2021-05-03T04:46:40.048Z",
        "description": "<div><div><strong>Job Description</strong><p>Access Your Future is a sponsorship program for students interested in a career in the equipment industry as a Service Technician. This program provides a career path for a qualified student and an educational incentive upon successful completion of an approved diesel program. <br>The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships. <br><br><strong>Specific Duties Include:</strong><br></p><ul><li> Enrolled or attending an approved Diesel Technology program or another program approved in writing by RDO Equipment Co. <br></li><li> Part time paid employment at sponsoring store (if store location permits) while attending college. <br></li><li> Possible full time paid employment between college academic years at sponsoring store location. <br></li><li> This program offers sponsored students graduating, an educational incentive over a two or four year period while they maintain full time employment with RDO Equipment Co. <br></li><li> Company provided work uniforms. <br></li><li> Eligible for the RDO Equipment Co. tool discount program with Matco upon full time employment. <br></li><li> Maintain a GPA of 3.0 (on a 4.0 scale) while in program. <br></li><li> Maintain acceptable attendance record while in program. <br></li><li> It is the student's responsibility to provide a copy of their transcripts to RDO Equipment Co. after each quarter or semester and a diploma in order to receive reimbursement upon full time employment. <br></li><li> Adhere to academic policies, rules and regulations set forth by the higher learning center the student is attending. <br></li><li> Document machine information and repairs completed on work order, including parts and fluids used. <br></li><li> Maintain a clean work area, as well as care for all shop tools, machines, and equipment. <br></li><li> Identify and communicate solutions for customer service opportunities in the dealership's area of responsibility. <br></li><li> Maintain technical and product knowledge on all equipment sold within the dealerships area of responsibility. <br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set. <br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts. <br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service. <br></li><li> Perform all other duties as assigned by management in a professional and efficient manner. <br><br><strong>Job Requirements:</strong><br></li><li> Mechanical skills <br></li><li> Trade specific tooling, including hand and pneumatic tools <br></li><li> Strong computer skills <br></li><li> Excellent customer service skills <br></li><li> Ability to assemble and perform maintenance functions on equipment <br></li><li> Excellent communication and written skills <br></li><li> Strong organizational skills <br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships., * Mechanical skills * Trade specific tooling, including hand and pneumatic tools * Strong computer skills * Excellent customer service skills * Ability to assemble and perform maintenance functions on equipment * Excellent communication and written skills * Strong organizational skills * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Employment</span> Type: [\"PART_TIME\"]</li></ul></div></div>",
        "index": 18,
        "skills": [
            "machine learning",
            "information technology",
            "c and c++",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Image Analyst Intern",
        "company": "Jacobs",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c474e3a194cd1dd051ff44a9842c6a23?lvk=dCCGl8rpMDAJ8OopcyFAIA.--M0Jn9oFfc",
        "posted": "2021-05-02T04:46:41.593Z",
        "lastScraped": "2021-05-03T04:46:41.593Z",
        "description": "<div><div><p>Critical Mission Solutions</p><p>_Your mission is our mission._</p><p>We're invested in you and your success. Everything we do - whether Aerospace, Defense, Intelligence, Information Technology, Cybersecurity, Nuclear, Automotive, or Telecommunications - is more than just a project. It's our challenge as human beings, too. That's why we bring a thoughtful and collaborative approach to every one of our partnerships.</p><p>It's our promise to challenge the status quo as we redefine how to solve the world's greatest challenges, and transform big ideas into intelligent solutions for a more connected, sustainable world.</p><p>Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed -today and into tomorrow.</p><p>**Your Impact:**</p><p>Are you passionate about human space exploration, understanding the origins of the universe, and working with a passionate and diverse team to make a difference? If you are, we need you!</p><p>We need your talent, teamwork, and energy to help us achieve great things that inspire people all over the globe. We need you to bring creative ideas and diverse backgrounds to help us envision, shape, and deliver systems that will enable the exploration of space while benefiting people here on Earth. We are excited about what we do, and we need you on our team as we take on exciting challenges for NASA's pursuits in deep space exploration. Jacobs is NASA's largest engineering solutions provider working together with NASA at centers across the United States.</p><p>We are looking for an **Image Analyst Intern** to join our team. Do you have the following skills?</p><p>_This is a temporary, part-time role not to exceed 14 weeks._</p><p>The Image Analysis Intern will provide support to the Image Science and Analysis Lab (ISAL) on various projects. The ISAL unit performs world class engineering image analysis in support of the International Space Station, the Orion Multi-Purpose Crew Vehicle, various Commercial Space efforts and other NASA programs. ISAL areas of expertise include photogrammetry, imagery enhancement and restoration, data visualization, imagery inspection and surveys, and imagery acquisition planning.</p><p>Machine learning can serve as a tool to automatically identify certain features, such as areas of interest (holes or anomalous spots, representative of micrometeoroid impacts on spacecraft surfaces, or potentially hazardous dust contamination on spacesuits). The neural network procedure requires a lot of training imagery that needs to be classified by hand in order to train neural networks, which can then be used to search the rest of the image set for areas of interest. Intern responsibilities would include: Preparing training images for neural networks to enable detection and/or categorization of areas of interest; Identifying and labeling the areas of interest; Learning about machine learning and computer vision techniques, in general.</p><p>The intern will learn how to work with imagery of spacecraft surfaces and surface material test articles (with and without impact damage), as well as spacesuit candidate fabric (with and without dust contamination), and how machine learning techniques such as neural networks can be useful in identifying such potentially hazardous features. The intern will provide a report as well as any source code generated to add to ISAL core capability in machine vision-based hazardous feature detection.</p><p>**Here's What You'll Need:**</p><p>**Required <span class=\"long-word\">Education/Experience/Skills:**</span></p><p>Applicants should have good analytical skills, with the ability to work independently while functioning within a team environment. Students should have an interest in imaging science as well as computational science, computer vision, or machine learning. Some knowledge of Differential Equations and Linear Algebra is desirable. Experience with python or another coding language is a plus. Applicants should be currently enrolled at an accredited university. Additionally, the completion of at least 60 credit hours with a minimum of a 2.8 GPA.</p><p>**Why Work on Our Team?**</p><p>Click on the below links to view just a small sample of all that we do! Come join our team and be part of our future. We look forward to seeing you!</p><p>See What We Do <span class=\"long-word\">(https://app.frame.io/presentations/225c1d41</span>-60d8-58cc-bf8c-fd204fb246d9)</p><p>Jacobs Aerospace Solutions Overview (Please view in Chrome or Microsoft Edge)</p><p>In addition to exciting career opportunities, we also have:</p><p>+ Excellent personal and professional career growth + 9/80 work schedule (every other Friday off) + Onsite cafeteria (breakfast &amp; lunch) + Much, much more!</p><p>For more information on our partnership with NASA at Johnson Space Center, please visit <span class=\"long-word\">www.wehavespaceforyou.com</span></p><p>+ Proof of U.S. Citizenship or US Permanent Residency is a requirement for this position. + Must be able to complete a U.S. government background investigation. + Management has the prerogative to select at any level for which the position is advertised.</p><p>**Essential Functions**</p><p>**Work Environment**</p><p>Generally, an office environment, but can involve inside or outside work depending on task.</p><p>**Physical Requirements**</p><p>Work may involve sitting or standing for extended periods (90% of time). May require lifting and carrying up to 25 lbs. (5% of time).</p><p>**Equipment and Machines**</p><p>Standard office equipment (PC, telephone, printer, etc.).</p><p>**Attendance**</p><p>Regular attendance in accordance with established work schedule is critical. Ability to work outside normal schedule and adjust schedule to meet peak periods and surge requirements.</p><p>**Other Essential Functions** Professional behavior that enhances productivity and promotes teamwork and cooperation. Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others.</p><p>Jacobs is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws <span class=\"long-word\">(https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf)</span> and supplemental language. <span class=\"long-word\">(https://www.eeoc.gov/sites/default/files/migrated\\_files/employers/eeoc\\_gina\\_supplement.pdf)</span></p><p>At Jacobs, we're challenging today to reinvent tomorrow by solving the world's most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.</p></div></div>",
        "index": 19,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "data visualization",
            "networks",
            "python",
            "virtual reality"
        ],
        "remote": false
    },
    {
        "position": "FINANCE PROJECT INTERN (TEMPORARY, PART-TIME, DAYS)",
        "company": "University of Washington",
        "location": {
            "city": "Seattle",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0b0e5c69bd4a73aebef59e3017f462f9?lvk=QepJKGoNRo8JN-9YByfZkA.--M0EoLw7C7",
        "posted": "2021-05-01T04:46:43.125Z",
        "lastScraped": "2021-05-03T04:46:43.125Z",
        "description": "<div><div><p>Req #: 189826</p><p> Department: UW MEDICINE FINANCE</p><p> Job Location Detail: UW Tower (4333 Brooklyn Avenue NE, Seattle). Ability to work remotely</p><p></p><p> Posting Date: 04/28/2021</p><p></p><p>Closing Info: Open Until Filled</p><p></p><p> Salary: Salary is commensurate with education and experience.</p><p></p><p> Shift: First Shift</p><p></p><p></p><p> A higher degree of healthcare. All across UW Medicine, our employees collaborate to perform the highest quality work with integrity and compassion and to create a respectful, welcoming environment where every patient, family, student and colleague is valued and honored. UW Medicine's mission is to improve the health of the public by advancing medical knowledge, providing outstanding primary and specialty care to the people of the region, and preparing tomorrow's physicians, scientists and other health professionals. Become part of our team <span class=\"long-word\">(https://www.uwmedicine.org/about/career</span>-opportunities) , and join our mission to make life healthier for everyone in our community. UW Medicine Finance has an outstanding opportunity for a temporary, part-time, day shift, FINANCE PROJECT INTERN. RESPONSIBILITES Provide project analyst services to the UW Medicine Finance &amp; Accounting COVID-19 cost recovery project. The UW Medicine Finance &amp; Accounting COVID-19 project team is responsible for gathering documentation, including invoices and payment support, for costs associated with COVID-19. The Finance Project Interns duties and responsibilities are: + Under the direction of UW Medicine Director or Manager, extracting and validating data from OnBase or other systems + Other duties as assigned REQUIREMENTS + In the process of obtaining either a Bachelor's or Graduate degree in Finance, Accounting or Health Care Management Experience in a finance organization, performing analysis or implementing quality and/or process improvement projects. + Strong leadership skills, high interpersonal skills, exceptional verbal and written communication skills, demonstrated ability to efficiently prioritize and ability to work independently. + Demonstrated data collection and analytical skills. + Experience and proficiency in using Excel, Word, PowerPoint and Visio. + An equivalent combination of education and experience may substitute for stated requirements. DESIRED + Application of finance and accounting experience in a work environment + Expanded understanding of finance and accounting principles + Understanding of organizational change management principles and techniques + Increased understanding of data and information management principles, applications, tools and challenges + Understanding of program and project management principles UW Medicine includes Harborview Medical Center, UW Medical Center - Montlake, UW Medical Center - Northwest, Valley Medical Center, UW Neighborhood Clinics, UW Physicians, UW School of Medicine, and Airlift Northwest. University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sexual orientation, gender identity, sex, age, protected veteran or disabled status, or genetic information.</p></div></div>",
        "index": 20,
        "skills": [
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Quality and Development Intern",
        "company": "Zevia",
        "location": {
            "city": "Los Angeles",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7eb4e67ee78a526e931478cc54353f27?lvk=FpPc8Q8r0XfWptNDF_Q8Mg.--M0JSQQy0V",
        "posted": "2021-04-30T04:46:43.980Z",
        "lastScraped": "2021-05-03T04:46:43.980Z",
        "description": "<div><div><p><strong>The Culture<br></strong></p><p>Zevia is the leading zero calorie, naturally sweetened beverage brand. We were the first to create Sodas sweetened with stevia, a plant-based sweetener. We have since introduced Energy, Mixers and Organic Tea platforms to our beverage portfolio, and all of the Zevia beverage platforms are growing at a rapid pace. Our office is a fun, entrepreneurial environment, full of fiercely passionate and talented people determined to work together, have fun and make consumer packaged goods history. Our Team Members are collaborative and supportive, with an insatiable hunger to change the beverage game.</p><p><strong>Summary</strong></p><p>The Quality &amp; Development Intern will report to the Sr. Product Development Manager</p><p>under the Technical Services Department and will work directly with the technical services team. &nbsp;This person will be responsible for receiving, organizing and maintaining all production quality samples.&nbsp; The Quality &amp; Development Intern will assist in administering sensory testing related to quality and/or product development needs.&nbsp; The intern is responsible for reviewing and filing quality reports in our internal database, regulatory documentation and production paperwork.&nbsp; This role requires excellent organizational skills, time management capability, and the ability to multi-task.&nbsp; The intern will work cross-functionally with the product development, quality, packaging and regulatory teams.</p><p>&nbsp;</p><p><strong>Essential Functions</strong></p><p>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>Assist in sensory test administration and analysis of results.</li><li>Maintain accurate and organized records of quality activities.</li><li>Organize and maintain production and supplier samples and documentation with the utmost efficiency.</li><li>Ability to analyze and deduce data.</li><li>Conduct analytical tests on products including brix, CO2, TA, pH, O2, etc.</li><li>Participates in the testing and reporting of internal product analysis, as well as reviewing any documentation from external sources.</li><li>Review artwork and packaging proofs for product development team.</li><li>Assist in development of improvement strategies for quality and reliability objectives.</li><li>Communicate with internal teams on any discrepancies in specifications and/or reports.</li></ul><p><strong>Competencies </strong></p><ul><li>Proficient in reviewing, analyzing and reporting information.</li><li>Proficient computer skills, PowerPoint, Word, Excel.</li><li>Ability to analyze and deduce data.</li><li>Detail oriented and highly organized.</li><li>Thrives in a busy environment, can self-prioritize and work independently when applicable.</li><li>Has a passion for natural products.</li><li>Is a great listener, team player and an overall, positive \"yes we can!\" person.</li><li>Would be described as creative, looking for ways to improve and create efficiencies.</li><li>Calm under pressure.</li><li>Ensures quality of output.</li><li>Good deductive reasoning.</li></ul><p>&nbsp;</p><p><strong>Supervisory Responsibility</strong></p><p>This position has no direct supervisory responsibilities.</p><p>&nbsp;</p><p><strong>Work Environment</strong></p><p>This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.</p><p>&nbsp;</p><p><strong>Physical Demands</strong></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.</p><p>The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch or crawl. The employee must frequently lift and/or move up to 20 pounds and occasionally lift and/or move up to 30 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.</p><p>&nbsp;</p><p><strong>Position Type/Expected Hours of Work</strong></p><p>This is a part-time, hourly role with flexibility as needed.&nbsp;</p><p>15-24 hours/week preferred.</p><p>Opportunities to grow within the company.</p><p>&nbsp;</p><p><strong>Travel</strong></p><p>This position does not require travel.</p><p>&nbsp;</p><p><strong>Required Education and Experience</strong></p><ul><li>High school diploma</li></ul><p>&nbsp;</p><p><strong>Preferred Education and Experience</strong></p><ul><li>Some College Education.</li><li>Food Science, Chemistry, Nutrition or similar education preferred.</li><li>Minimum 1-2 years' experience in a detailed administrative position.</li><li>Physically capable of lifting 30lbs with frequency.</li><li>Proficient in Microsoft office: &nbsp;PowerPoint, Word, Excel</li><li>Excellent interpersonal skills - will need to collaborate up, down and across the organization to achieve results.</li><li>Food, beverage or similar industry experience, a plus!</li></ul><p>&nbsp;</p><p><strong>Additional Eligibility Qualifications</strong></p><p>None.</p><p>&nbsp;</p><p><strong>Work <span class=\"long-word\">Authorization/Security</span> Clearance </strong></p><p>Must be eligible to work in the U.S.</p><p>&nbsp;</p><p><strong>EEO Statement</strong></p><p>We are committed to providing equal employment opportunities for all qualified job candidates and employees.&nbsp; To that end, Zevia maintains a workplace free of discrimination and harassment on the basis of an individual's race (including traits historically associated with race, such as hair texture and protective hairstyles such as braids, locks, and twists), color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical condition), gender (including gender identity, gender expression, change of sex, and transgender status), sexual orientation, age, physical or mental disability, pregnancy (including childbirth and breastfeeding), medical condition, national origin, ancestry, marital status (including registered domestic partnership status), civil union status, familial status, military or veteran status, genetic information, caregiver status, citizenship status, immigration status, Civil Air Patrol status, status as a victim of domestic violence, assault, or stalking, or any other characteristic protected by applicable local, state, or federal law (each, a \"Protected Characteristic\").</p><p>&nbsp;</p><p><strong>Other Duties</strong></p><p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.</p></div></div>",
        "index": 21,
        "skills": [
            "machine learning",
            "project management",
            "game design",
            "information technology"
        ],
        "qualifications": [
            "Eligible to work in the U.S"
        ],
        "remote": false
    }
]