[
    {
        "position": "IT Summer Internship",
        "company": "Stone Brewing Co.",
        "location": {
            "city": "San Marcos",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/stone-brewing-co-53124d5e/it-summer-internship-e746c606?lvk=MZneAsLQNl1J9Ti1cZnRmQ.--M5_4Wylmk",
        "posted": "2021-07-04T08:27:07.405Z",
        "lastScraped": "2021-07-08T08:27:07.405Z",
        "description": "<div><div><p><strong>Company Overview </strong></p></div><div><p>Founded by Greg Koch and Steve Wagner, Stone Brewing has come a long way since opening in San Diego County in 1996. Now the ninth-largest craft brewer in the U.S., we operate brewing facilities on both coasts - Escondido, California and Richmond, Virginia. On top of making badass beers for over two decades, we operate a number of restaurants and tap rooms as well as the largest craft-centric beer distribution business in the U.S. </p></div><div><p>We are the global standard bearer for independent craft beer. We put Team Stone first in order to create badass beer and amazing experiences. We're quality nuts and freshness fanatics, and we're head over heels for hops. We’re proud to be the largest employer in craft beer with a dynamic team. We have always been independent, and we will always be independent. We’re on the lookout for like-minded misfits who embody the things that have always made Stone special. </p></div><div><p></p></div><div><p><strong>Role Summary </strong></p></div><div><p>The I.T. intern will work on our large projects focused on helping us implement some of Azure application provisioning (i.e. individuals in role / department x get concur and help set up automatically. This intern will work with us, as well as our Microsoft partner, FMT. They will get introductory experience and training in Cloud, Azure and Business Analysis. This individual will have the opportunity to grow his/her skills and knowledge in the I.T. field while working in a fast-paced, exciting industry. </p></div><div><div><p></p></div><div><p><strong>Responsibilities include:</strong></p></div><div><ul><li><p>10 - 12 week that is flexible (A combo of full time or part time, in person or remote) </p></li><li><p>Assisting the I.T. team with deliverables with the ongoing Azure provisioning </p></li></ul></div><div><p></p></div></div><br><br><div><div><p><strong>Qualifications </strong></p></div><div><ul><li><p>Junior or Senior (preferred) pursuing a bachelor’s degree in I.T., Computer Science, or related field </p></li><li><p>Must be a motivated individual passionate about pursuing a career in I.T. and learning on the job experience </p></li><li><p>Ability to still have fun and be positive in high intensity situations </p></li></ul></div></div><div><ul><li><p>Demonstrates effective teamwork and collaboration skills </p></li><li><p>Strong interpersonal, verbal and written communication skills </p></li><li><p>Must be comfortable with being uncomfortable and doing things differently </p></li><li><p>Adaptable to a changing, fast-paced environment </p></li><li><p>Maintains high degree of integrity and confidentiality, always doing the right thing </p></li></ul></div></div>",
        "index": 1,
        "skills": [
            "machine learning",
            "project management",
            "cloud computing"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Internship",
        "company": "Cook Inlet Tribal Council, Inc.",
        "location": {
            "city": "Anchorage",
            "state": "Alaska",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/016df6fb71f7f494f0a0435dd05235bd?lvk=2ufnACWeymVOYh0LMPeg5g.--M5_J5nXgg",
        "posted": "2021-07-07T08:27:08.138Z",
        "lastScraped": "2021-07-08T08:27:08.138Z",
        "description": "<div><div><div> &nbsp; <div><div><div><p>Cook Inlet Tribal Council Internship Program for qualified Alaska Native and American Indian students</p><p>&nbsp;<strong>*Deadline for applications is April 30, 2021.</strong></p><p>Cook Inlet Tribal Council's (CITC's) Internship Partner Program strives to align with our overarching mission of working with Alaska Native and American Indian people to develop educational opportunities that fulfill our endless potential. CITC seeks to deepen our relationship with our people and provide valuable work experience in a variety of fields of study for our future leaders. In alignment with our community partners, CITC proudly offers a 12-week paid temporary internship program for qualified Alaska Native and American Indian students. This program will provide college students with real life work experience and the opportunity to apply their education in a professional work environment, bridging the gap between students to working professionals.</p><p>Cook Inlet Tribal Council, Inc. (CITC) seeks highly motivated individuals currently enrolled as a full or part-time college student, or recently graduated from an <span class=\"long-word\">undergraduate/graduate</span> degree program/technical school in a related degree field.</p><p><br></p><p>Accounting / Finance / Economics / Business Mgmt.&nbsp;</p><p>Social Work / Sociology / Psychology / Nursing&nbsp;</p><p>Information Technology / Computer Science&nbsp;</p><p>Communications / Journalism / Marketing</p><p>Engineering / ANSEP Participants (Fab Lab)&nbsp;</p><p>Trans Alaska Pipeline System (TAPS) Industries&nbsp;</p><p>Construction / Project Management</p><p>Specifically, CITC recruits individuals seeking a future career-specific pathway to participate in a paid internship program for a 12 week term. Internship positions are available in Anchorage. Selected interns are responsible for providing their own transportation between their hometown/state and the internship work location. For example, if you attend the Mat-Su College and accept an internship in Anchorage, you are responsible for your own transportation to Anchorage.</p><p><strong>ELIGIBILITY</strong></p><p>Internship applicants must be eligible and qualified Alaska Native or American Indian pursuant to P.L. 93-638 Indian Self Determination Act. Alaska Native/American Indian CIRI shareholders and descendants are strongly encouraged to apply.</p><p><strong>PRE-EMPLOYMENT BACKGROUND CHECK INFORMATION</strong></p><p>As indicated on CITC's employment website, employment with CITC is contingent upon successfully passing a background investigation.</p><p><strong>Complete application packets submitted by APRIL 30th</strong><strong>, 2021 will be given priority consideration.</strong></p><p>Application packets are available on the CITC Career Center:&nbsp;</p><p><span class=\"long-word\">https://citci.org/citc</span>-careers/&nbsp;</p><p>Click on the Intern position to view the attached application.</p><p><strong>Please submit application packets and email questions to&nbsp;</strong><strong><span class=\"long-word\">alaskaspeople@citci.org</span></strong><strong>&nbsp;or call (907) 793-3467.</strong></p><p><br></p><p><br></p><p><br></p><p><br></p></div></div></div></div></div></div>",
        "index": 2,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2021-04-30T10:00:00.000Z",
        "remote": false
    },
    {
        "position": "Marketing Sciences Intern",
        "company": "National Research Group",
        "location": {
            "city": "Los Angeles",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/national-research-group-b6d618dc/marketing-sciences-intern-9911dc61?lvk=lAqZYxQUhd9tgYI6IsF1hA.--M5S_aMln-",
        "posted": "2021-07-02T08:27:09.138Z",
        "lastScraped": "2021-07-08T08:27:09.138Z",
        "description": "<div><p><strong>Who We Are</strong></p><p>National Research Group (NRG) is a leader in data driven insights and strategic consultation to the global entertainment and technology industries. Working at the confluence of technology, content, and culture, NRG offers bold insights for storytellers everywhere. Our consultants have experience working across all facets of media and technology. </p><p><strong>Why You'll Love It Here</strong></p><p>We are inspired by working with storytellers that challenge us to think differently and see the world in new ways. As a result, our business is driven by creative, curious, and inventive people who have a passion for culture and technology. We work as a collective across disciplines and geographies to bring together the best thinking for every assignment, delivering insights to bold storytellers everywhere.</p><p><strong>The Opportunity</strong></p><p>NRG is seeking a Marketing Sciences Intern to join us for our 2021 fall internship program. Our internship is an opportunity for students to be provided with a hands-on experience to work in research, shaping strategy for the world's most powerful entertainment and technology brands. By assisting our Data/Marketing Sciences department, the intern will be able to develop proficiency in analytical techniques with structured and unstructured data sets which can be applied to future data analytics/data science roles. The intern will develop an understanding of how research is conducted and how our entertainment and technology clients use it to inform their business strategy. Below is general information on the internship.</p><ul><li>Start Date: Mid-September</li><li>Commitment: 12 weeks</li></ul><p><strong>The Role</strong></p><ul><li>Support Data/Marketing Science team with a wide range of data analytic needs, including questionnaire design (including MaxDiff and conjoint techniques), multivariate analysis, segmentation, machine learning techniques and integrating 3rd party data sources (such as digital clickstream data, <span class=\"long-word\">receipt/transaction</span> data, movie and TV consumption data) with quantitative survey data.</li><li>Assist team in using various statistical software and tools to evaluate data and develop both custom and productionized client solutions.</li><li>Work with and draw conclusions from large diverse data sets, via data fusion or other techniques.</li><li>Assist data processing team with taking respondent level data collected through surveys and assist them with the tabulation process.</li><li>Assist with developing frameworks, models, tools, processes, visualizations, simulators and analyses to ensure continuous data driven results are provided for internal and external clients.</li><li>Attend weekly meetings and share your opinions.</li><li>Potential career training opportunities where interns will learn about various lines of the business such as our Client Services and Business Development teams as well as our Research Operations teams including but not limited to Data Management, Marketing Sciences and Design.</li></ul><p><strong>Who You Are</strong></p><ul><li>Intellectually curious, analytically rigorous with a strong work ethic and solid business intuition.</li><li>Entrepreneurial, enthusiastic self-starter with an amiably competitive spirit.</li><li>Able to explain complex ideas to non-technical audiences, both verbally and visually.</li><li>Organized and able to plan projects efficiently including an ability to set priorities, problem solve and multi-task in a dynamic, rapidly changing environment, often with tight deadlines.</li><li>Highly motivated, self-directed, collaborative creative thinker. </li><li>Excited by data.</li><li>Critical thinker.</li></ul><p><strong> Ideal Candidate</strong></p><ul><li>Strong interest in entertainment and technology industries.</li><li>1+ year(s) of relevant coursework and/or experience working in Data Science, Mathematics, Statistics, Quantitative Behavior Science, Computer Science or related quantitative discipline.</li><li>Experience learning about analytics, statistical or data science academically or through previous internships.</li><li>Experience or familiarity with SPSS, R and SQL queries.</li><li>Advanced excel skills.</li><li>Candidates must be actively working toward an undergraduate or graduate degree and must be eligible to work in the US. Graduates may qualify if they have finished school within six months of the start of the internship.</li></ul><p><strong>Position Type</strong></p><p>This is a temporary non-exempt remote position (for LA based employees there is the possibility of working out of our Culver City office depending on COVID-19 capacity guidelines). The minimum requirement to work for this team would be 3 days a week (full time availability is preferred). The hours of this position will be 9am-6pm PT.</p><p><strong>Work Environment</strong></p><p>This job typically operates in a professional office environment but will be remote due to circumstances of COVID-19. This role routinely uses standard office equipment.</p><p><strong>Required Application Materials: </strong></p><ul><li>Resume</li><li>Cover Letter which should include:</li><ul><li>Why do you want to work at NRG?</li><li>Why are you interested in data science?</li><li>What kind of training or experience have you had that has prepared you for this internship?</li><li>What do you hope to gain through this internship?</li></ul><li>Assessment (if you move forward in the hiring process)</li></ul></div>",
        "index": 3,
        "skills": [
            "machine learning",
            "project management",
            "information technology",
            "sql",
            "data visualization",
            "software engineering"
        ],
        "qualifications": [
            "Eligible to work in the U.S"
        ],
        "remote": true
    }
]