[
    {
        "position": "Internship, Information Technology",
        "company": "College of Western Idaho",
        "location": {
            "city": "Nampa",
            "state": "Idaho",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/41cc90393df5552798fce4389fec55a4?lvk=xmVVUWViQiBoeA-tx-Z-jQ.--MBuWDvwBs",
        "posted": "2021-09-26T01:31:17.371Z",
        "lastScraped": "2021-09-27T01:31:17.371Z",
        "description": "<div><div><p>Internship, Information Technology Nampa - Student Workers</p><p>Apply now <span class=\"long-word\">(https://secure.dc4.pageuppeople.com/apply/1005/gateway/default.aspx?c=apply</span>&amp;lJobID=493475&amp;<span class=\"long-word\">lJobSourceTypeID=796</span>&amp;sLanguage=en-us) Job no: 493475 School:Information Technology <span class=\"long-word\">Division:Enterprise</span> Application Service Categories: Information Technology Advertised: Sep 21 2021 MST Applications close: Oct 05 2021 MST</p><p> Reports To: IT Manager II, User Services Position Status: Student Part-time, Non-Benefited Posted Pay Range: $11 per hour</p><p> About Us: The College of Western Idaho (CWI) expands learning and life opportunities, encourages individual advancement, contributes to Idaho's economic growth, strengthens community prosperity, and develops leaders.</p><p>We are a comprehensive community college providing higher education programs. We offer a full range of academic and career-technical courses leading to an Associate of Arts or Science degree, Associate of Applied Science degrees, continuing education, and certifications. CWI also offers Basic Skills Education to help prepare for a GED, Dual Credit for high school students, and fast-track career training for working professionals.</p><p>At CWI we are proud of our talented and dedicated faculty and staff. Our employees have an opportunity to make a difference in students' lives every day. We are excited for you to join us and share our passion for higher education.</p><p> Position Summary: The College of Western Idaho is seeking a motivated intern who is ready to apply their knowledge of end-user technology support to assist the Information Technology User Services department with a focus on Apple technical support. You'll contribute your creativity and great ideas, working alongside innovative colleagues and mentors who will push you to be your very best and support you along the way. We'll give you hands-on projects and the chance to make an immediate impact. Upon completion of the internship, you will be able to walk away with applicable knowledge of IT end-user support technologies and how they are deployed within a higher education institution.</p><p>Duties include diagnosing and repairing computer hardware and software issues while also providing exceptional customer support to the end-users.</p><p>Hours per week: 19.5</p><p></p><p> Essential Functions: Provide technical assistance and operational support for all technology users at CWI for hardware, software, first-level audio/video in an Active Directory environment to ensure minimal downtime. Maintain timely and appropriate documentation of technical service provided to the end-user as required by CWI Maintain timely and appropriate documentation of systems, applications, and hardware used by the Help Desk and IT Determine the cause of computer, software, network, and audio/video malfunctions through evaluation and testing, and then resolve via additions, modifications, repair, or external support assistance Support open computer labs, and computer classrooms to include imaging, software installation, printing and copying supply replenishment and support, Deep-Freeze management, and troubleshooting Monitor the help desk queue and respond to help desk tickets in a professional and timely manner. This includes the creation of detailed technical notes to communicate steps toward a solution for end-users and technical information for escalation Maintain end-user confidence and protect operations by following the security and privacy policies and keeping information confidential Other duties as assigned.</p><p> Minimum Qualifications: Must be a CWI student in good academic standing, with a minimum GPA of 2.5. Maintain good (digital) citizenship. Must uphold, enforce, and abide by all institutional policies. Strong writing and verbal skills. Preference given to students with working knowledge of MacOS, iPadOS, and iOS configuration and administration. Preference given to CWI students enrolled in Computer Science and Technology programs. Preference given to CWI students with a basic understanding of Computer Networking protocols; DHCP, DNS, TCP/IP.</p><p> Additional Instructions for Applicants: Please attach a copy of your cover letter and resume.</p><p></p><p> All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, gender identity, or sexual orientation.</p><p></p></div></div>",
        "index": 1,
        "skills": [
            "project management",
            "information technology",
            "hardware",
            "networks",
            "c and c++",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid",
        "due": "2021-10-04T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Fall Intern - Information Technology Support (San Francisco/REMOTE)",
        "company": "University Enterprises Inc - Sacramento State",
        "location": {
            "city": "Sacramento",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/09343754033497a662b3c40ee19262cc?lvk=wd6gvYWopxtUnk0azZdNuA.--MBoBP7lLZ",
        "posted": "2021-09-24T01:31:21.042Z",
        "lastScraped": "2021-09-27T01:31:21.042Z",
        "description": "<div><div><div> Job Title Fall Intern - Information Technology Support (San Francisco/REMOTE) Student Classification Student Assistant or Graduate Assistant Job Code C501SF Posting Type <span class=\"long-word\">Student/nonbenefited</span> (NSTU) Posting Number PE445F21 Job Description Summary <div> The Energy Division of the California Public Utilities Commission ( CPUC) is seeking a student intern for Fall 2021. The CPUC oversees investor-owned electric and natural gas utilities in California. The intern will provide support to Energy Division's Information Technology Lead, including website updates and provision of IT equipment to employees. </div> Conditions of Employment <div> This is a part-time, temporary, non-benefited, student position. Employment in all positions with University Enterprises, Inc. is dependent upon the mutual consent of University Enterprises, Inc. and the employee. This means that either University Enterprises, Inc. or the employee can, at any time, terminate the employment relationship at will, with or without cause.&nbsp; <br><br> UEI is not a multi-state employer. UEI only employs candidates who live and work in the state of California. If selected for the position you must reside in California and all worked must be performed in the state of California.&nbsp; <br><br>Depending on the type of position you are applying for, a pre-employment background check consisting of one or more of the following may be conducted: employment history, professional references, criminal check, educational verification (i.e., degree, license, or official transcript) and physical exam and drug urinalysis test. Applicants will be required to pass required pre-employment checks to the satisfaction of University Enterprises Inc., ( UEI) and the hiring Agency or Department. </div> Work Schedule <div> Fall semester internship is a 16 week project. An option to extend internship into the Spring 2021 semester is available.&nbsp; <br>Students will work up to 20 hours per week within the hours of 8:00am - 5:00pm, Monday through Friday. Schedules will be determined between student and supervisor.&nbsp; </div> Additional Work Schedule <p>Student Assistants and Graduate Student Assistants generally work up to 20 hours per work week (Sunday-Saturday) during the academic year and up to 40 hours per work week during breaks; (Winter, Spring and Summer).</p> Area Bay Area On/Off Sacramento State Campus Off Campus Worksite City San Francisco Pay Range $16.50 - $21.50 per hour Department/Agency Public Utilities Commission (PUC) Unit/Division Project Description <div> The CPUC regulates privately owned electric, natural gas, <span class=\"long-word\">telecommunications,</span> water, railroad, rail transit, and passenger transportation companies, in addition to authorizing video franchises. Our five Governor- appointed Commissioners, as well as our staff, are dedicated to ensuring that consumers have safe, reliable utility service at reasonable rates, protecting against fraud, and promoting the health of California's economy. <br>To learn more visit www. cpuc.ca.gov </div> Majors/Fields of Study Computer Information Systems, Computer Science and Engineering Minimum Qualifications <ul><li>Experience installing and troubleshooting hardware/software.</li><li>Knowledge of Windows 10 and configuring and/or modifying software program.</li></ul> Prerequisites <div> Must be a college student attending classes during the regular term (Fall, Spring and Winter, if applicable), at one of the accredited colleges or universities on our affiliation list. <br><br>To view our current affiliation list please paste the following URL into your browser: <span class=\"long-word\">http://www.calinterns.org/wp</span>-<span class=\"long-word\">content/uploads/Affiliation_List.pdf</span>&nbsp; <br><br>Students must be enrolled at a minimum in: six semester units or nine quarter units for undergraduate students; four semester units or six quarter units for graduate students.&nbsp; <br><br>Students declared major must match the major(s) listed in the job posting. </div></div><div> Preferred Qualifications Duties and Responsibilities <ul><li>Assist Energy Division's Information Technology lead.</li><li>Update CPUC webpages using Sitecore content management system.</li><li>Troubleshoot IT issues.</li><li>Provide support to Energy Division staff, including distributing IT equipment to staff.</li></ul> Physical Requirements <div> Sit for extended periods; frequently stand and walk; manual dexterity and hand-eye <br>coordination; corrected hearing and vision to normal range; verbal communication; <br>use of office equipment including computer workstations, telephones, copiers, <br>printers, and scanners, with or without a reasonable accommodation </div> Working Conditions <div> For the Fall semester, student will work remotely most days and must have access to <br>computer, secure internet connection, and phone. The student may come to the CPUC's San Francisco office one day per week to help with IT equipment. If interviews are needed for this position, they will be conducted via phone or teleconference. </div> Hours Per Week Students (part-time) 0-20 hours per week during the academic year, up to 40 hours per week during breaks; (Winter, Spring and Summer). (NSTU) Posting Date 09/24/2021 Closing Date 11/08/2021 Open Until Filled No Special Instructions to Applicant <div> Please complete all fields of the employment application. Include your educational history in the \"Educational Experience\" section and any employment history in the \"Employment Experience\" section of our application. </div> Quick Link for Internal Postings <span class=\"long-word\">https://ueijobs.peopleadmin.com/postings/19559</span> </div></div></div>",
        "index": 2,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "hardware",
            "machine learning"
        ],
        "compensation": "paid",
        "due": "2021-09-23T15:00:00.000Z",
        "remote": true
    },
    {
        "position": "Intern - IT Service Desk (59895)",
        "company": "Plantronics",
        "location": {
            "city": "Santa Cruz",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3c3b611a59581f9f90fd63c9fe9ca88c?lvk=8OEnSG_MG0P_IM_GJAUKYg.--MBioNQVZR",
        "posted": "2021-09-25T01:31:21.935Z",
        "lastScraped": "2021-09-27T01:31:21.935Z",
        "description": "<div><div><div><p>Work is no longer a place. It's what you do. And how you do it. More fluid, more flexible, powered by your imagination and by some amazing technology! That's where we come in. We're Poly. We're a global outfitter of pro-grade audio and video technology so that employees everywhere can look and sound their best from anywhere. Join us as we pursue our disruptive vision to bring professional audio and video meeting technology and services to everyone. Be a part of our journey!<br> &nbsp;</p><p>Poly's intern experience offers students the opportunity to explore a career in IT/Help Desk.&nbsp; This fall Internship runs mid-October through the end of the year and provides the opportunity to learn new skills through training and on the job learning. </p><p>&nbsp;</p><p>We are looking for someone who is passionate about technology and has the ability to resolve technical problems.&nbsp; Our hope is that the right candidate might consider working part-time schedule not to exceed 25 hours. </p><p>&nbsp;</p><p>This is an exciting opportunity for any aspiring Information Technology major, or related field, to come into a high growth, fast paced environment and get real hands-on experience.</p><p>&nbsp;</p><p><b>Your day to day:</b><br> &nbsp;</p><ul><li><p>Learn to identify, research, and resolve technical problems or requests</p></li><li><p>Gain valuable experience with computer imaging</p></li><li><p>Handle Active Directory (AD) administration and troubleshooting</p></li><li><p>Respond to telephone calls, instant messages, email and walk-ups for Technical support</p></li><li><p>Document, track, and monitor all problems using existing ticketing system to ensure a timely resolution of the incident or request</p></li><li><p>Support, monitor, test, and troubleshoot hardware and software problems</p></li><li><p>Interface with vendors to schedule hardware repairs</p></li><li><p>Install and configure associate's workstations using standard imaging process.</p></li><li><p>Provide end users support for all standard applications</p></li><li><p>Assist with data recovery, using backup or data recovery tools</p></li><li><p>Virus / Malware remediation</p></li><li><p>Perform other duties or special projects as requested related to area of responsibility</p></li><li><p>The ability to work onsite in our offices in Santa Cruz, CA</p></li></ul><p>&nbsp;</p><p><b>What you bring to the team:</b></p><ul><li><p>You are currently enrolled in a college or university Computer Science or Information Technology program</p></li><li><p>You are familiar with basic computer and networking technology</p></li><li><p>You have some great foundational troubleshooting skills</p></li></ul><p>&nbsp;</p><p><b>It would also be helpful if you had:</b></p><ul><li><p>General knowledge of Microsoft Windows 10, Mac OS X</p></li><li><p>General knowledge of Microsoft Office 365 and Office 2016</p></li><li><p>Familiarity with computer networking (LAN, Wi-Fi,VPN)</p></li><li><p>A strong work ethic, organization skills, the desire to learn and is not afraid to ask questions</p></li><li><p>Excellent communication skills (written and verbal)</p></li><li><p>Ability to maintain confidentiality at all times</p></li><li><p>Multi-lingual ability</p></li></ul><ul></ul><p><br><b>Our Culture</b><br><br> At Poly, leadership principles aren't just something we talk about, they're something we live and breathe. We believe in creating a work environment where people feel empowered, supported, and included -where trust and transparency are built into the way we work - where creativity, curiosity, and continuous improvement are encouraged and nurtured every day.</p><p>&nbsp;</p><ul><li><b>C3 - Customer. Customer. Customer:</b> &nbsp;Customer obsession is everyone's job. You enjoy solving customers' problems - big or small. &nbsp;You work closely with customers, channel partners and their teams to deliver innovative solutions.&nbsp;</li><li><b>Raise the Bar: </b>&nbsp;You take pride in your work and know details matter. You know that shavings make a pile. &nbsp;You seek every opportunity to continuously improve teams, products, and processes. &nbsp;</li><li><b>Communicate Courageously:</b> &nbsp;You speak with candor but aren't a jerk. You constructively challenge your teammates to get to the best possible outcome or decision. Once a decision is made, you fully align and stay aligned.&nbsp;</li><li><b>Onward and Upward:</b> &nbsp;You learn from the past but focus on the future. You rapidly adapt to changes in the marketplace. You help to create solutions that move the company forward with energy, momentum, and results.&nbsp;</li><li><b>Own It:</b> &nbsp;You know your business, your customers, and your team - inside and out. You don't sacrifice long-term value for short-term results. You act with integrity, spend money like it's your own, and put Poly first.</li><li><b>Take the Leap:</b> &nbsp;Speed matters in business. You encourage and require those around you to think strategically and act decisively. Poly values calculated risk taking.&nbsp;</li><li><b>Ride Together:</b> &nbsp;We are one team. We do what we say we'll do, we treat each other with respect, we have each other's back, and we hold each other accountable.</li><li><b>Leaders Lead: </b>&nbsp;You know you are part of a larger global community and make decisions as good stewards of the earth, its resources and its people.</li></ul><p><br><b>Our Commitment as an Equal Opportunity Employer</b><br><br> All qualified applicants will receive consideration for employment without regard to sex, gender identity or expression, race, age, religious creed, national origin, physical or mental disability, ancestry, color, marital status, sexual orientation, military or veteran status, status as a victim of domestic violence, sexual assault or stalking, medical condition, genetic information, accessibility needs, or any other protected class or category recognized by applicable equal employment opportunity or other similar laws.<br> &nbsp;<br> No matter where you're based, you'll experience a company that believes that teamwork and collaboration drive maximum impact, seeks well-rounded talent to focused on providing the best customer experience, and understands that this is a marathon, not a sprint. And, top of mind to us is continuously and purposefully building an inclusive culture that empowers all of our team members, across the globe, to do their best work and be the best version of themselves.</p></div></div></div>",
        "index": 3,
        "skills": [
            "information technology",
            "hardware",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Fall Engineering Intern",
        "company": "Northrop Grumman Corporation",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/26a3dc1547e15fa2057bc7dab8805a12?lvk=lzSkMnlgXme9ZaMzM5_Gvw.--MBliWdpSc",
        "posted": "2021-09-23T01:31:22.855Z",
        "lastScraped": "2021-09-27T01:31:22.855Z",
        "description": "<div><div><p>US CITIZENSHIP REQUIRED FOR THIS POSITION: Yes</p><p></p><p></p>RELOCATION ASSISTANCE: No relocation assistance available<p></p><p></p>CLEARANCE TYPE: None<p></p><p></p>TRAVEL: No<p></p><p></p><b>Description</b><p></p>Join Northrop Grumman on our continued mission to push the boundaries of possible across land, sea, air, space, and cyberspace. Enjoy a culture where your voice is valued and start contributing to our team of passionate professionals providing real-life solutions to our world's biggest challenges. We take pride in creating purposeful work and allowing our employees to grow and achieve their goals every day by Defining Possible. With our competitive pay and comprehensive benefits, we have the right opportunities to fit your life and launch your career today.<p></p><p></p><p></p>Job Description<p>Northrop Grumman is seeking Engineering Interns to join the Aeronautics Systems Intern Program. This position will be located in San Diego, CA.</p><p>The qualified candidate will become part of Northrop Grumman's Autonomous Design Center of Excellence.</p><p></p><p>The selected candidate will work in a dynamic people-focused environment where he/she will interact with users, customers and other developers.</p><p>As an intern, you'll participate in a summer internship program to develop competencies in a variety of engineering specializations that may include:</p><ul><li>Construct, troubleshoot, calibrate, adjust, test, and maintain equipment, components, devices, or systems.</li><li>Work from engineering drawings and written or verbal instructions.</li><li>Operate related equipment; conduct tests and report data in prescribed format.</li><li>Perform calibration and alignment checks; make adjustments, modifications, and replacements as directed.</li><li>Prepare prescribed compounds and solutions.</li></ul><p></p><p><b>Basic Qualifications</b></p><p><b>A candidate, regardless of age and hiring source, must meet ALL of the below criteria. The candidate must:</b></p><p></p><ul><li>Be enrolled in a community college and pursuing an Associate degree from an accredited community college with a STEM (Science, Technology, Engineering or Mathematics) emphasis such as: math and science, computer programming, mechanical design, engineering technology or computer-aided drafting and design</li></ul><ul><li>Maintain an overall cumulative GPA of 3.0/4.0 or higher (academic transcripts must be provided at the end of each semester to your NG manager)</li></ul><ul><li>Be available to work part-time (up to 19 hours per week)</li><li>Be able to obtain and maintain a U.S. Government security clearance (U.S. citizenship is a pre-requisite)</li></ul><p></p><p></p><p><b>Preferred Qualifications</b></p><ul><li>Have an overall cumulative GPA of 3.25/4.0 or higher.</li></ul><ul><li>Previous internship/co-op experience, leadership &amp; teamwork capabilities, interpersonal communication skills, and activities <span class=\"long-word\">(professional/community/extracurricular)</span></li></ul><p></p><p>Pay Range: $24.00 - 29.75</p><p></p><p></p><p></p><p></p>Salary Range: $24.00 - $29.75<p></p><p>Employees may be eligible for a discretionary bonus in addition to basepay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results.Employees in Vice President or Director positions may be eligible for Long Term Incentives.In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO)for vacation and/orpersonal business.</p><p></p><p></p><p>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit <span class=\"long-word\">http://www.northropgrumman.com/EEO.</span> U.S. Citizenship is required for most positions.</p></div></div>",
        "index": 4,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "compensation": "paid",
        "qualifications": [
            "U.S Citizen"
        ],
        "remote": false
    },
    {
        "position": "Intern (Records Management)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c8fe5c3798473b56fa787d5bca0ad93d?lvk=Qc3TYqOzmePnJD_UKUZHcQ.--MBahtiI93",
        "posted": "2021-09-20T01:31:23.757Z",
        "lastScraped": "2021-09-27T01:31:23.757Z",
        "description": "<div><div> THE POSITION: <p></p><div><strong></strong><div><br></div><div><br></div><div> As a result of the changing circumstances with the spread of COVID-19, to protect the Internship staff through increased social distancing, most Intern positions are working remotely. &nbsp;In order to successfully perform duties as an intern, this position requires the use of a personal computer with internet access, Microsoft Word and Microsoft Excel for the duration of the Internship or until you are asked to return to the office. <br><br>Upon hire, instructions will be provided to you on how you can use your personal computer to connect to the Agency network, including email and access to specific programs that may be required for your work duties. </div><br><strong>There&nbsp;is&nbsp;(1)&nbsp;internship opportunity in the Records Management Group.</strong><br>&nbsp; <br><strong>This recruitment is being conducted to fill (1) vacancy and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.</strong><br>&nbsp; <div><strong>FLSA: Non-Exempt</strong></div>&nbsp; <div><strong>Internships are limited to 25 hours week and 960 hours per fiscal year. (July 1st to June 30th)<br><br>Note: &nbsp;Internship are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals interested in short term internships will not be considered.</strong></div>&nbsp; <div><em>Work schedule is estimated to be approximately 20&nbsp;to 25&nbsp;hours a week;<br>Office Hours are Monday through Thursday from 7 a.m. to 5:30 p.m</em></div><em>.</em><div> The successful candidate will perform a variety of technical and administrative duties in support of the Records Management program. Must be a responsible, analytical and detailed oriented individual with excellent communication (written/oral) skills. Great time management skills with the ability to work on multiple projects simultaneously and ability to work with all levels of Agency staff Additionally, be willing to learn, and be flexible and assist with ad hoc projects as required in a fast paced and changing environment. Advanced computer skills in Word, Excel, Access and Publisher are critical. <br><br>Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. <br><br>&nbsp; </div></div><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p><strong>May include, but are not limited to the following:</strong><br>Perform the full array of duties assigned including professional records management work.<br><br>Receive, scan and upload documents into the Agency's Electronic Records Management System (ERMS).<br><br>Participate in the summarization and indexing of a wide variety of documents for electronic and hard copy storage.<br><br>Perform quality control checks on documents uploaded by others.<br><br>May conduct records research, retrieval of documents and assist with Public Records Request<br><br>Data input of taxonomies, spreadsheets, databases.<br><br>Assist with training and production of training materials.<br><br>Perform other related duties as required.&nbsp;<br><br>&nbsp;</p> QUALIFICATION GUIDELINES: <p></p><div><strong>EXPERIENCE AND EDUCATION:</strong><br>Graduation from high school or G.E.D. equivalent. <br><br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with&nbsp;course work in public administration, business administration, organizational administration or closely related field. <br><br>While no prior work experience is required, <strong>preference will be given to individuals with prior related professional work experience.</strong></div><br><strong>LICENSES AND CERTIFICATES:</strong><br>A valid California Class C driver's license. <br>&nbsp; <div><strong>KNOWLEDGE OF:</strong></div><div> Principles, practices, methods and techniques of records management; local, state and federal laws relating to retention requirements for a wide variety of documents; procedures, techniques and methods of document preservation; computer applications and database applications used in records management, word processing and&nbsp;standard computerized business programs;&nbsp;imaging processes, equipment and quality standards; the general functions of a municipal water/wastewater utility and associated record keeping requirements; information storage and retrieval systems; standard office practices and equipment; correct English usage, including spelling, grammar and punctuation; business mathematics; fundamentals of supervision; effective safety practices and procedures. </div><div> &nbsp; </div><div><strong>ABILITY TO:</strong></div><div> Operate a personal computer and other standard office equipment; analyze records management problems, reach sound conclusions and recommend improved procedures and facilities;&nbsp;organize work, set priorities and provide advice and support to meet records management needs; exercise sound judgment within established guidelines; maintain information and generate reports utilizing computer equipment; code, file and retrieve a wide variety of <span class=\"long-word\">materials/documents</span> under a comprehensive records management system; prepare clear and accurate reports and other written correspondence; read and interpret documents such as operating instruction, journals, governmental regulation, federal and state laws, training materials, etc.;&nbsp;establish and maintain effective working relationships with department managers, staff, vendors, members of the public and others encountered in the course of work. <br><br>&nbsp; </div><p></p> SELECTION PROCESS: <p></p><div> &nbsp;All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job-related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span>&nbsp;examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. </div>&nbsp; <div><strong>Any applicant requiring reasonable accommodation during the selection process due to a qualified disability must inform the Human Resources Office at (909) 993-1674 or&nbsp;hrdept@ieua.org&nbsp;at least 72 hours in advance of the need for accommodation.</strong><br>&nbsp; <br>THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br>&nbsp; <br>&nbsp;\"The Agency's success is obtained by creating a positive and diverse work environment which recognizes individual differences and experiences\". </div><p></p></div></div>",
        "index": 5,
        "skills": [
            "project management",
            "networks",
            "c and c++",
            "machine learning",
            "information technology"
        ],
        "remote": true
    },
    {
        "position": "Internships",
        "company": "Dis-Tran",
        "location": {
            "city": "Pineville",
            "state": "Louisiana",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/becc55cd5b81b60186bc4c6ba5c6468a?lvk=PanuDfbZfm-TqQVz-xSWPA.--MBghO4PwJ",
        "posted": "2021-09-24T01:31:24.902Z",
        "lastScraped": "2021-09-27T01:31:24.902Z",
        "description": "<div><div><p>Crest Industries has openings for internships in Pineville, LA within our various business units. &nbsp;Fields include, but are not limited to, the following:</p><ul><li>Civil Engineering</li><li>Electrical Engineering</li><li>Mechanical Engineering</li><li>Computer Science</li><li>Engineering Technologies</li><li>Project Management</li><li>Estimating</li><li>Accounting</li><li>Human Resources</li><li>Finance</li><li>Drafting and Design</li><li>Manufacturing</li><li>Marketing</li></ul><p>Junior or Senior level class status is preferred.</p><p>Crest Industries offers paid internships and provides our intern with exposure to a variety of projects and technical skills. &nbsp;We have set agreements with local colleges and housing facilities for month-to-month rentals for the course of internships.</p><p>&nbsp;</p><p>Crest Industries is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information.</p><p>Crest Industries is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request information regarding reasonable accommodation, contact your Human Resource Business Partner.</p><p>&nbsp;</p></div></div>",
        "index": 6,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Sweet Corn Breeding Program Intern",
        "company": "Syngenta",
        "location": {
            "city": "Boise",
            "state": "Idaho",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/edade18d9bb6038d36ba80913703318b?lvk=vMthj2vqfueM8kYVHWgyMA.--MBnwzsDT3",
        "posted": "2021-09-25T01:31:26.381Z",
        "lastScraped": "2021-09-27T01:31:26.381Z",
        "description": "<div><div><p><strong>About this Job:&nbsp;&nbsp;</strong></p><p>We invite you to help us shape the future of agriculture. At Syngenta, we believe every employee has a role to play in safely feeding the world and taking care of our planet. To support that challenge, the&nbsp;Sweet Corn R&amp;D&nbsp;Processing&nbsp;Market&nbsp;team is currently seeking a&nbsp;Research&nbsp;and Development&nbsp;Intern. As an intern you&nbsp;will have the opportunity to work in a sweet corn plant breeding program, assisting in designing experiments, planting,&nbsp;participating in field and lab preparations,&nbsp;collecting data,&nbsp;noting&nbsp;field observations,&nbsp;and analyzing data related to a selected breeding project of interest.&nbsp;&nbsp;Through this internship you will be&nbsp;exposed&nbsp;to research&nbsp;activities,&nbsp;provided the opportunity to&nbsp;apply&nbsp;your&nbsp;academic background and ultimately be exposed to&nbsp;an active vegetable breeding program&nbsp;R&amp;D&nbsp;Vegetables&nbsp;at Syngenta.&nbsp;</p><p>As an intern at Syngenta, you&nbsp;will&nbsp;have the opportunity to work alongside some of the brightest minds in the industry, and work on real projects finding real solutions. Work with us and you'll get:&nbsp;&nbsp;</p><ul><li>Competitive wages&nbsp;&nbsp;</li><li>Ongoing career development resources&nbsp;&nbsp;&nbsp;</li><li>The opportunity to work on cutting-edge projects&nbsp;&nbsp;</li><li>Meaningful projects that solve problems&nbsp;</li></ul><p><strong>Duration:</strong>&nbsp;May 2022-August 2022&nbsp;</p><p><strong>Accountabilities:&nbsp;</strong></p><ul><li>Support plant breeding scientists&nbsp;in&nbsp;both&nbsp;field related activities&nbsp;and analytical activities&nbsp;required for maintaining an active&nbsp;hybrid sweet corn&nbsp;breeding program&nbsp;</li><li>Perform activities&nbsp;related to planting,&nbsp;note taking throughout plant life cycle,&nbsp;thinning&nbsp;and&nbsp;rouging,&nbsp;sweet corn eating stage assessments, and&nbsp;safety&nbsp;&amp;&nbsp;training&nbsp;</li><li>Assist with managing and developing part time workers&nbsp;</li><li>Analyze data and prepare a report and presentation for&nbsp;an&nbsp;assigned project&nbsp;focusing on&nbsp;applying innovative&nbsp;methodology and technology&nbsp;improvements to&nbsp;the sweet corn&nbsp;breeding program&nbsp;</li><li>Make sure all activities are developed according to the Company safety procedures and recommendations, and promote environmentally sustainable solutions&nbsp;</li></ul><p><strong>Education &amp; Experience:&nbsp;</strong></p><ul><li>Requires a High School diploma or equivalent&nbsp;</li><li>Must be pursuing a&nbsp;Bachelor's Degree&nbsp;in Agronomy, Biology, Ag Business, or another closely related field of study&nbsp;with a 3.0 GPA or higher&nbsp;</li><li>Must have a valid Driver's License&nbsp;</li><li>All applicants must&nbsp;be eligible to work in the US&nbsp;</li></ul><p><strong>Requirements:&nbsp;</strong></p><ul><li>Communication-The ability to communicate information well (both written and spoken) is highly desired&nbsp;</li><li>Detail Oriented-All procedures and policies must be understood and followed&nbsp;</li><li>Autonomous-An independent individual who is self-motivating and needs little supervision&nbsp;</li><li>Familiarity with working on a farm, working with crops, or working outdoors is preferred but not required&nbsp;</li><li>Confidence-&nbsp;Not afraid to ask bold questions and be curious&nbsp;</li><li>Eagerness to learn and grow in the role&nbsp;</li><li>Excellent computer skills&nbsp;including proficiencies in both Microsoft Excel and Microsoft Word&nbsp;</li><li>Innovative - To always look to implement new procedures or technologies to improve work&nbsp;efficiencies&nbsp;&nbsp;</li><li>Detail/Accuracy Oriented - All procedures and policies must be understood and followed.&nbsp;&nbsp;</li><li>Ability to perform basic math functions&nbsp;</li><li>Willing to work long hours outside (~75% of role is outdoors)&nbsp;</li></ul><p><strong>What We Offer: &nbsp;</strong><br> A culture that celebrates diversity &amp; inclusion, promotes professional development, and offers flexible work options to meet both your work and personal needs &nbsp;<br> &nbsp;<br><strong>About Syngenta&nbsp;</strong><br> Syngenta is a global leader in agriculture; rooted in science and dedicated to bringing plant potential to life. Each of our 28,000 employees in more than 90 countries work together to solve one of humanity's most pressing challenges: growing more food with fewer resources. A diverse workforce and an inclusive workplace environment are enablers of our ambition to be the most collaborative and trusted team in agriculture. Our employees reflect the diversity of our customers, the markets where we operate and the communities which we serve. No matter what your position, you will have a vital role in safely feeding the world and taking care of our planet. Join us and help shape the future of agriculture. &nbsp;&nbsp;</p><p>#LI-EF1&nbsp;</p><p>Syngenta is an Equal Opportunity Employer and does not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status.&nbsp;</p><p>Family and Medical Leave Act (FMLA) &nbsp;<br> <span class=\"long-word\">(http://www.dol.gov/whd/regs/compliance/posters/fmla.htm)</span>&nbsp;</p><p>Equal Employment Opportunity Commission's (EEOC)&nbsp;<br> <span class=\"long-word\">(http://webapps.dol.gov/elaws/firststep/poster_direct.htm)</span>&nbsp;</p><p>Employee Polygraph Protection Act (EPPA)&nbsp;<br> <span class=\"long-word\">(http://www.dol.gov/whd/regs/compliance/posters/eppa.htm)</span>&nbsp;</p><p><strong>Apply To:&nbsp;</strong><br> <span class=\"long-word\">https://syngenta.taleo.net/careersection/unitedstates/jobdetail.ftl?job=18033808</span>&amp;tz=GMT-05:00&nbsp;</p></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "information technology",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree",
            "Eligible to work in the U.S"
        ],
        "remote": false
    },
    {
        "position": "Technology Intern",
        "company": "Engility",
        "location": {
            "city": "Crown Point",
            "state": "Indiana",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9aeed0bc9eb99a63d68cb91c03fb851e?lvk=GAWKaOZkdpxkL9aXZsMjjQ.--MBak0n3BF",
        "posted": "2021-09-21T01:31:27.287Z",
        "lastScraped": "2021-09-27T01:31:27.287Z",
        "description": "<div><div><p>SAIC is seeking a Part-time <b><span class=\"long-word\">technical/technologist</span> student intern</b> position at our facility in <b>Crown Point, IN</b>. </p><p>Note: This position is open to <b>local area students only</b> as it will require on site work during the school year at our facility in Crown Point, IN. </p><p><b>JOB DESCRIPTION</b>: </p><ul><li>This internship will average 15-20 hours per week during the school year, flexible to accommodate class schedules. </li><li>Higher number of hours per week (to a maximum of 40) are possible during term and summer breaks. </li><li>Positions will be opening September 1, 2021. End date TBD</li><li>Intern needed with majors or experience in electrical engineering, mechanical engineering, and materials science. </li><li>The intern will be needed for at least one semester, but preference is for longer.</li><li>Desire intern to be interested in electronics industry assembly, particularly printed circuit boards, electronic components, defense electronics, electronic manufacture, and advanced electronic materials.</li><li>Intern needs to have a basic understanding of manufacturing processes, especially for electronic components, ideally based on some experience with electronics manufacture, assembly or repair of electronics hardware. </li><li>Training materials will include manufacturing handbooks and video demonstrations. </li><li>Military electronics or tech experience is particularly welcome. </li><li>An existing or recent security clearance is a plus.</li><li>The location is remote from most corporate or government support functions, and the ability to create work-around solutions to accomplish assigned tasks SAFELY is highly desirable.</li><li>Adherence to chemical, mechanical, and electrical safety requirements, including personal protective equipment, environmental, and reportage requirements appropriate to an investigative laboratory setting is absolutely mandatory.</li><li>The intern MUST be a US Citizen or documented permanent resident due to DoD client requirements. </li><li>Demonstrated language and communication skill, especially writing, is a requirement, as is reasonable MS Office skills.</li></ul><p>&nbsp;</p><p><b>JOB DUTIES</b>: </p><p>In a mixed lab/office environment, duties will include:</p><p>1) Compilation of existing data about counterfeit electronic components. Data will principally be from published reports of counterfeit components. Interns must demonstrate capability to take information from public sources such as electronic component batch numbers, dates of manufacture, and final component order dates.</p><p>2) Using microscopes and other laboratory analytical equipment, examine and categorize electronic assemblies, components, and materials</p><p>3) Careful documentation of observations and results in supplied standardized formats (when trained) to support determinations of genuine vs altered or counterfeit electronic components, assemblies, or materials</p><p>4) Literature, internet, telephone research to gather data regarding current and potential manufacturers and suppliers of electronics to the DoD for immediate needs and long-term reporting requirements</p><p>5) Other duties may occasionally be assigned in support of a remote location which may be of a technical, maintenance, or heavy lifting nature, depending on the individual's capabilities and/or limitations.</p><p><b>REQUIRED EXPERIENCE AND EDUCATION</b>: </p><ul><li>Must be currently enrolled in a bachelor program with a focus in electrical engineering, mechanical engineering, and materials science from an accredited university. </li><li>College Sophomore and Juniors are preferred but will consider Freshman and Seniors for internship.</li><li>Candidates must be local to Crown Point, IN area and willing to work a Part Time casual schedule at our facility in Crown Point, IN.</li><li>The intern MUST be a US Citizen or documented permanent resident due to DoD client requirements. </li></ul><ul><li>Intern candidate must be fully vaccinated against COVID-19 to be considered for employment.</li></ul><p>&nbsp;</p><p><b>Graduation Date</b></p><p>No Graduation Date set</p><p><b>School Years</b></p><p>Sophomore, Junior</p><p><b>Majors</b></p><p>Nautical/Naval Engineering, Mechanical Engineering, Materials Science &amp; Engineering, Electrical Engineering, Chemical Engineering</p><p><b>GPA</b></p><p>No GPA preference set</p><p><b>Work Authorization</b></p><p>US work authorization is required</p><p>&nbsp;</p></div></div>",
        "index": 8,
        "skills": [
            "hardware",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ],
        "remote": true
    },
    {
        "position": "Marketing Intern",
        "company": "Essentials PetCare",
        "location": {
            "city": "Remote",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/be6d3ba70c3a2f900f91c57a5789ec33?lvk=XZEUMh8lMbcoYqfVRD5yMQ.--MBbD-PVW3",
        "posted": "2021-09-21T01:31:28.240Z",
        "lastScraped": "2021-09-27T01:31:28.240Z",
        "description": "<div><div><div><b>Marketing Intern</b></div><div>Essentials PetCare is an innovative network of veterinary clinics. Our mission is to extend high-quality and affordable preventative veterinary care to more pet families across the country. We have an exciting marketing internship program. You will acquire hands on experience in diverse marketing disciplines, including digital marketing, advertising, public relations, and branding. This is an ideal role to help brilliant aspiring marketers break into the coveted pet industry. Even although this is a remote position, candidates must be based in Florida.</div><div></div><div><b>What Youâ€™ll Do</b></div><div>Help with content creation</div><div>Assist with marketing campaigns and activations</div><div>Manage the brand's TikTok &amp;amp; Snapchat accounts</div><div>Support client communications</div><div>Update social channels and website as needed</div><div>Copyediting</div><div>Media monitoring</div><div>Perform research</div><div>Compile data and produce reports</div><div>Implement marketing plans as assigned</div><div></div><div><b>Role Requirements</b></div><div>Must love pets.</div><div>Be enrolled as a Junior or Senior in an accredited four-year undergraduate program in marketing, communications, journalism, public relations, or related field.</div><div>Possess a reliable computer, internet connection, and the ability to work remotely.</div><div>Prior experience is a plus, but not required.</div><div>A 3.0 or higher GPA.</div><div>Must live within EST or CST time zones</div><div></div><div><b>Basic Requirements for All Positions</b></div><div>Must have a positive attitude and work well in collaboration with others.</div><div>Must be detail-oriented and able to multi-task in a fast-paced environment.</div><div>Must be eager to learn and follow direction.</div><div>Must display a professional demeanor.</div><div>Must be digital-native.</div><div>Bilingual and bicultural English &amp;amp; Spanish preferred.</div><div></div><div><b>What is it like to work at Essentials PetCare? How is the culture?</b></div><div>By offering only preventative and minor illness care, we naturally have a positive atmosphere. We also take great care to find very friendly, hard-working, and trustworthy staff members who operate proficiently as a team.</div><div></div><div><b>Compensation</b></div><div>This is a paid internship. The compensation is $10/hr.</div><div></div><div><b>Hours</b></div><div>Regular hours are Monday-Friday, 9am-6pm.</div><div>We are able to accommodate your schedule to fit your course load.</div><div>Full-time and part-time positions available.</div><div></div><div><b>Important Info</b></div><div>*Please note before applying: As a condition of employment, Essentials PetCare requires full vaccination against COVID-19. *</div><div></div><div>We are a drug-free workplace. All applicants will be required to pass a drug screen, as well as a background check prior to employment.</div><div></div><div>Whether you want to work part-time or full-time with our friendly team, you can make a difference in the lives of pets and people with opportunities to grow in the veterinary field at Essentials PetCare!</div><div></div><div>Do we sound like a pack you want to run with? Apply now!</div><div><br></div></div></div>",
        "index": 9,
        "skills": [
            "networks",
            "machine learning",
            "project management"
        ],
        "compensation": "paid",
        "remote": true
    },
    {
        "position": "Intern (Recycled Water - GIS)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/df25537156cfbc74cc9df5647ee222a4?lvk=VOc4wf1ZWf-xJkX5dY7ZnQ.--MBahrm3ms",
        "posted": "2021-09-20T01:31:29.737Z",
        "lastScraped": "2021-09-27T01:31:29.737Z",
        "description": "<div><div> THE POSITION: <p></p><div><div><div><div><div><br></div><div><br></div><div> &nbsp; <div> Are you an undergraduate or graduate with major course work in Computer Science or Geographic Information Systems? &nbsp;Do you want a meaningful internship that enhances and preserves the quality of life throughout the region? The Inland Empire Utilities Agency is seeking a motivated student or graduate to join our team as an Intern (Recycled Water - GIS)! <br>&nbsp; <br>&nbsp;The Chino Basin Recycled Water distribution system consists of approximately 90 miles of pipeline and hundreds of &nbsp;individual control structures. The distribution system supports direct use customers and the Groundwater Recharge (GWR) program whose infrastructure consists of a network of streams and pipelines that direct stormwater run-off, imported water from the State of California Water Project, and IEUA recycled water to recharge sites consisting of several individual recharge basins. These recharge basins are located throughout the IEUA service area (approximately 245 square miles) and are designed to hold the water so that it can percolate into the ground and replenish the groundwater supply held within the Chino Basin's alluvial aquifers. <br>&nbsp; </div>&nbsp; <div></div><br><br><strong>There is (1) internship opportunity in the Recycled Water Groundwater Recharge section of the Operations Division.</strong><br><br><strong>This recruitment is being conducted to fill (1) vacancy and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.</strong></div></div></div></div><div><div><br></div><div><strong>Open until filled, Apply Immediately<br>First Review of Applications scheduled for October 4, 2021</strong>&nbsp; </div><div><br><strong>Internships are limited to 25 hours week and 960 hours per fiscal year<br>(July 1st to June 30th)</strong><br><br><strong>Note: &nbsp;Internship are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals only interested in short term internships will not be considered.</strong></div></div></div><div><div><br><em>Work schedule is estimated to be approximately 15 to 20 hours a week;&nbsp;</em><br><em>Office Hours are Monday through Friday from 8:00 a.m. to 5:00 p.m.</em><br>&nbsp; </div></div><div> &nbsp; </div><div><div><strong>FLSA: Non-Exempt</strong><br><br>Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. <br>&nbsp; <br>The successful candidate will be a responsible, analytical, and detailed oriented individual with excellent communication (written/oral) skills. time management skills with the ability to work in the office and field on multiple projects simultaneously; must be flexible and be able to learn and distinguish components of the recycled water distribution system, and assist with ad hoc projects as required in a fast-paced environment.&nbsp; </div></div><br><br><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p></p><div><div><strong>May include, but are not limited to the following:</strong></div><div> Assist Recycled Water Distribution operations in verifying asset locations and types using GPS and GIS equipment and software (ArcMap GIS and Trimble or Geo Explorer GPS devices); compiling field data into databases; updating distribution system maps; providing KPI (Key Performance Index) reports and updates; assisting in asset management tracking in both field and office settings.&nbsp; </div><br><div> Field data collections includes both working independently and working in teams, working in variable weather conditions, reviewing on-line monitoring systems, taking field notes, walking on unimproved slopes and on wet surfaces, photographing conditions, and communicating with supervisor. May be requested to occasionally work outside normal Agency hours of operation if work hour limits and school schedule allows. <br>&nbsp; <br>Must be able to drive Agency vehicles (e.g., sedan, light duty truck, heavy duty vehicle) on a variety of road surfaces (e.g., asphalt, concrete, unimproved, wet, dry, rough, smooth) dimensions, and orientations throughout the service area and recognize limits in ability to do so to prevent accidents. <br>&nbsp; <br>Occasionally conduct water sampling, which includes coordinating with the groundwater recharge department and IEUA laboratory, organizing of priorities, following protocols, meeting deadlines, lifting and loading full sample coolers, and navigating/driving within the service area. <br>&nbsp; <br>Perform the full array of duties assigned including professional <span class=\"long-word\">administrative/technical</span> work on special projects. <br>&nbsp; <br>Prepare reports and recommendations relative to assigned areas of responsibility; prepare and update manuals and protocols. <br>&nbsp; <br>Participate in pulling documents and filing information. <br>&nbsp; <br>Travel to offsite locations is required. <br>&nbsp; <br>Perform other related duties as required. </div></div><div><div><br></div></div><br><p></p> QUALIFICATION GUIDELINES: <p></p><div><div><strong>EXPERIENCE AND EDUCATION:</strong><br>Graduation from high school or G.E.D. equivalent. </div><div><br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with major course work in Computer Science, Geographic Information Systems, or a closely related field. <br>&nbsp; <br>While no prior work experience is required, <strong>preference will be given to individuals with prior related professional work experience.</strong><br><strong>&nbsp;</strong><br>Interns will have the ability to communicate clearly and concisely, to establish and maintain effective working relationships. <br>&nbsp; <br>Proficiency in necessary computers and computer applications. </div><br></div><div><div><br><strong>LICENSES AND CERTIFICATES:</strong></div>A valid class \"C\" California driver's license. &nbsp; <br>&nbsp; <div><div><br><strong>KNOWLEDGE OF:</strong></div>Basic knowledge of data collection, the practices and principles of GIS theory and function, tabular and spatial data analysis; GIS programming languages, development tools, technologies and ESRI application software; GIS data handling and conversion techniques and methods and techniques for basic report preparation and writing; modern office equipment including a computer; database structures and applicable software; the ability to read or learn basic engineering design drawings, use of &nbsp;proper English, spelling, and grammar. <br>&nbsp; <br>Practices of cartography and geography are required. Knowledge of AutoCAD, Visual Basic and Global Positioning System (GPS) is desirable. <br>&nbsp; </div><div> &nbsp; </div><div><div><strong>ABILITY TO:</strong></div>Work in a variety of GIS applications; perform moderately complex technical computations and compile/analyze GIS data and statistics; utilize Agency computer hardware (PC's, scanners, digitizers, etc.) and software required for assigned duties; interpret requirements, coordinate necessary work with customers, and prepare maps, reports and other GIS-related reports in a timely manner; perform technical analysis; participate on a team focused on producing high quality results; communicate clearly and concisely, both orally and in writing; understand and follow verbal and written instructions; analyze data, situations and research materials; formulate options and make recommendations; establish and maintain effective working relationships with those contacted in the course of work; and handle stress in a professional manner. <br><br>&nbsp; </div></div><p></p> SELECTION PROCESS: <p></p><div><div><div> All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span> examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. <br>&nbsp; </div><div><div><strong>Any applicant requiring reasonable accommodation during the selection process due to a qualified disability must inform the Human Resources Office at (</strong> <strong>909</strong> <strong>) 993-1674 or hrdept@ieua.org at least 72 hours in advance of the need for accommodation.</strong><br>&nbsp; </div><div><div> THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br>&nbsp; </div></div></div></div></div></div></div>",
        "index": 10,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "data visualization",
            "hardware",
            "networks",
            "c and c++",
            "machine learning"
        ],
        "remote": false
    },
    {
        "position": "CC Construction Science-Engineering Technology Intern",
        "company": "Citgo Petroleum Corporation",
        "location": {
            "city": "Corpus Christi",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8ae453abac089224b49907be66110d42?lvk=mlZMBbiKKje9cMvHGb7Nwg.--MBhB0_Adk",
        "posted": "2021-09-25T01:31:31.071Z",
        "lastScraped": "2021-09-27T01:31:31.071Z",
        "description": "<div><div><p>Employer will not sponsor visas for position<br></p><p>&nbsp;</p><p>The CC&nbsp;Construction Science-Engineering Technology&nbsp;Intern will be assigned maintenance planning activities and/or projects&nbsp;in the Maintenance&nbsp;Department. A&nbsp;presentation to senior leadership at the end of term is expected covering all aspects of the internship experience and accomplishments.</p><p>&nbsp;</p><p>CITGOâ€™s Attractive benefits:<br>* Sliding salary scale based on classification<br>* Relocation assistance available</p><p>&nbsp;</p><p>*CITGO is an equal opportunity employer.*</p><p>&nbsp;</p><p>&nbsp;</p><br><p>Required:</p><p>â€¢ Full-time Industrial Management student</p><p>â€¢ GPA of 3.0 or above (A=4.0)</p><p>â€¢ Must be at least a junior level Construction Science student</p><p>&nbsp;</p><p>â€¢ Completion of the following courses is preferred:&nbsp; Industrial Electronics, OSHA for General Industry, Industrial Plastics, Fluid Power, Industrial Controls, Leadership and Supervision, Quality Assurance.</p><p>&nbsp;</p><p>&nbsp;</p><p>*If enrolled in a graduate level program, must be enrolled part time&nbsp;in&nbsp;Industrial Management.</p><p>&nbsp;</p><p>&nbsp;</p><p>ELIGIBILITY REQUIREMENTS:<br>The Maritime Transportation Security Act requires all persons who will need unescorted access to a regulated facility to have a valid Transportation Worker Identification Credential (TWIC), issued in accordance with the rules established by the United States Coast Guard and the Transportation Security Administration. Candidates selected for employment must meet eligibility criteria to obtain a TWIC card.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>The following link lists the eligible criteria for all persons trying to obtain a<br>TWIC card&nbsp;<span class=\"long-word\">https://universalenroll.dhs.gov/</span>&nbsp;</p><p>&nbsp;</p><p>*Current Valid Driver's License Required*</p><br><ul><li>The Construction <span class=\"long-word\">Science/Engineering</span> Technology Co-op or Intern works in the Maintenance&nbsp;Department and under direction is assigned maintenance planning activities/tasks.</li><li>Assigned special projects within the Maintenance Department.</li><li>Provides support with scheduling and procurement.</li><li>Assists with ongoing project work.</li><li>Assists with the maintenance of equipment information to improve planning and material procurement.</li></ul></div></div>",
        "index": 11,
        "skills": [
            "project management",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Sales Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Hewitt",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ff2da3e3df8f6c5980aef0eef4fd36b0?lvk=nmUcI1iVeU1WWku6WY7rjw.--MBdHfkbf3",
        "posted": "2021-09-21T01:31:31.987Z",
        "lastScraped": "2021-09-27T01:31:31.987Z",
        "description": "<div><div><strong>Job Description</strong><p>The Access Your Future Sales Intern will allow this person to gain understanding of the skills necessary to advance into a sales role within RDO Equipment Co. They will learn RDO Equipment Co. processes and procedures used throughout the organization including an understanding of the Parts, Service, Sales, and Management departments. The Access Your Future Sales Intern will serve as a part-time position, typically before the start of a student's senior year in college.</p><p><strong>Specific Duties Include:</strong><br></p><ul><li> This position will rotate through temporary assignments in the dealership in order to obtain a complete picture of day-to-day duties and responsibilities of all departments and the importance of teamwork within our dealerships.<br></li><li> Day-to-day duties and responsibilities include but are not limited to; learning relationship development, sales skills, product knowledge, inventory management, company computer systems, processes and procedures.<br></li><li> Complete the Access Your Future Sales Program curriculum. <br></li><li> Perform any other special duties as requested by field management or other department personnel to ensure customer satisfaction. <br></li><li> Demonstrate a willingness to learn.<br></li><li> Demonstrate a willingness and interest to participate in our Customer Engagement Experience philosophy, and continually display passion around the principals outlined.<br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set.<br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts.<br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service.<br></li><li> Perform all other duties as assigned by management in a professional and efficient manner.<br><strong></strong><p><strong>Job Requirements:</strong><br></p></li><li> In order to be considered for the Access Your Future Sales Intern path, the student must currently be enrolled in college and available to complete a summer internship<br></li><li> Must be a self-starter<br></li><li> Strong communication and interpersonal skills<br></li><li> Proficient computer skills, including Microsoft Office<br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> * In order to be considered for the Access Your Future Sales Intern path, the student must currently be enrolled in college and available to complete a summer internship * Must be a self-starter * Strong communication and interpersonal skills * Proficient computer skills, including Microsoft Office * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Education:</span> UnknownEmployment Type: [\"PART_TIME\"]</li></ul></div></div>",
        "index": 12,
        "skills": [
            "c and c++",
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "IT Quality Assurance Intern",
        "company": "Tractor Supply",
        "location": {
            "city": "Brentwood",
            "state": "Tennessee",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8d50053478146691d2b3d65607052204?lvk=SsYeOAwOoTfd6hRc1ClDPA.--MBocqTZEs",
        "posted": "2021-09-25T01:31:32.870Z",
        "lastScraped": "2021-09-27T01:31:32.870Z",
        "description": "<div><div><p>This&nbsp;<strong>Summer 202</strong><strong>2</strong><strong> Internship</strong>&nbsp;will be a 12-week internship starting on May 16th, 2022 and ending on August 5th, 2022. Working at our Store Support Center in Brentwood, Tennessee, as an intern, you will work alongside TSC professionals in a variety of areas to make a real impact on our business. You will have the opportunity to work on projects in the department, get exposure to day-to-day operations and have a successful and meaningful internship.</p><p>&nbsp;</p><p>Bring your ambition, enthusiasm and big ideas to this internship and you will have a great experience!</p><br><p><strong>Projects you will be working on will include:</strong></p><ul><li>Working with the Retail Systems group on new Point-of-Sale system, you will work in the&nbsp;</li><li>Assist QA Lab on the testing of TSC/Petsense Mobile and POS systems</li><li>Work&nbsp;with tools such Microsoft Office, QTest, JIRA and SQL Queries.&nbsp;</li></ul><br><ul><li>Knowledge of QA testing</li><li>Java programming knowledge</li><li>Pursuing computer science / software engineering or equivalent major</li><li>Problem solving skills</li><li>Willingness to try new things outside of their comfort zone.</li></ul><br><p><strong><em>Tractor Supply Company (TSCO),</em></strong><em> the largest rural lifestyle retailer in the United States, is dedicated to enhancing our strong company culture built on our Team Membersâ€™ commitment to our Mission and Values.&nbsp; With over 1,900 stores in 49 states and an innovative e-commerce platform, Tractor Supply ranks in the Fortune 400 with annual revenues of more than $11 billion and growing! Come grow your career with us as we serve those who live <strong>â€œLife out Hereâ€!</strong></em></p><p>&nbsp;</p><p>Click Here to See Why We are a Great Place to Work!</p><p>&nbsp;</p><p><strong>Tractor Supply Company</strong> offers a competitive Benefits package, including Medical, Dental, &amp; Vision plans, to all Full-time Team Members as well as Part-time Team Members who are deemed eligible based on a minimum hours requirement. In addition, TSC offers access to other Benefits such as a Health Savings Account, Life Insurance, 401(k), and an Employee Stock Purchase Plan.</p></div></div>",
        "index": 13,
        "skills": [
            "software engineering",
            "sql",
            "java",
            "project management"
        ],
        "start": "2021-05-15T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Intern - Database Management",
        "company": "Approved Networks",
        "location": {
            "city": "Lake Forest",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/approved-networks-83e6d4a5/intern-database-management-a8b7d2ce?lvk=44Lrnii89LL8Zr7ql3fhsw.--MBcHzQBOR",
        "posted": null,
        "lastScraped": "2021-09-27T01:31:43.921Z",
        "description": "<div><p>This is a part-time position for an Intern to work 15-20 hours per week. This position requires work in our office in Lake Forest, CA. Hours are somewhat flexible during the work week, Monday-Friday.</p><p>The Database Intern will audit and correct product information on thousands of the companyâ€™s product offerings. This is an opportunity to learn about our highly technical products and assist with database management and clean up.</p><p><strong><span class=\"long-word\">Duties/Responsibilities:</span></strong></p><ul><li>Audit part numbers for accurate product attributes.<ul><li>For example: Copper/RJ45 parts cannot be â€œDOMâ€ enabled.</li><li>Form Factor, Reach, Connector, Bandwidth, Wavelength, DWDM Channel/ITU Channel, etc. -- all need to be audited and accurate.</li><li>Review/audit CPQ application output to ensure accuracy.</li></ul></li></ul><p><strong>Education and Experience:</strong></p><p>Candidate should be pursuing a bachelorâ€™s degree in a quantitative field (e.g. Business, Commerce, Economics, Engineering, Statistics, Mathematics, Computer Science, etc.)</p><p><strong>Required Skills/Abilities: </strong></p><ul><li>Ability to apply field of study to database management.</li><li>Excellent organizational skills and attention to detail.</li><li>Proficient with Microsoft Office Suite or related software.</li></ul></div>",
        "index": 14,
        "skills": [
            "software engineering",
            "project management",
            "machine learning",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Intern - Crump Life Insurance Services",
        "company": "Truist",
        "location": {
            "city": "Los Angeles",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0afd7118476b806b01451c1e21523cf2?lvk=vOfOkd4h6zcFFnn6DEkBTQ.--MBtOef6xk",
        "posted": "2021-09-20T01:31:44.845Z",
        "lastScraped": "2021-09-27T01:31:44.845Z",
        "description": "<div><div><p><b>The position is described below. If you want to apply, click the Apply button at the top or bottom of this page. You'll be required to create an account or sign in to an existing one.</b></p><p></p><p>Need Help?</p><p></p><p><i>If you have a disability and need assistance with the application, you can request a reasonable accommodation. Send an email to Accessibility or call 877-891-2510 (accommodation requests only; other inquiries won't receive a response).</i></p><p></p><p><b>Regular or Temporary:</b></p>Temporary<p></p><p><b>Language Fluency: </b>English (Required)</p><p></p><p><b>Work Shift:</b></p>1st shift (United States of America)<p></p><b>Please review the following job description:</b><p></p>Works with various employees to expand knowledge of company and aid the learning process.<p></p><p></p><p><b>Essential Duties and Responsibilities:</b><br>Following is a summary of the essential functions for this job. Other duties may be performed, both major and minor, which are not mentioned below. Specific activities may change from time to time.<br>1. Work with various areas of the company and different teammates to expand knowledge of company and aid the learning process.<br>2. Complete specific projects for departments related to operations, sales support, business and analysis and other areas as needed.<br>3. Assist department staff with various tasks in support of business.<br>4. Participate in internship meetings and discussions across Truist, Insurance Holdings and Crump.<br></p><p><b>Required Skills and Competencies:</b><br>The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br>1. Must be a current high school or college student<br>2. Strong verbal and written communications skills<br>3. Ability to effectively interact with teammates at all levels of the organization and with a variety of people from diverse backgrounds<br>4. Ability to work with minimal supervision<br>5. Ability to handle multiple tasks and details<br>6. Ability to operate a computer with Windows knowledge; Word and Excel preferred<br>7. Ability to adhere to all organizational policies and procedures<br>8. Ability to work virtually or in an assigned company office</p><p></p><p><i><b>Truist supports a diverse workforce and is an Equal Opportunity Employer who does not discriminate against individuals on the basis of race, gender, color, religion, national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law. Drug Free Workplace.</b></i></p><p></p><p></p><p>Thank you for your interest in Truist! BB&amp;T and SunTrust have come together in a transformational merger of equals to create Truist, the premier financial organization in the country. You may notice references to our legacy company names, BB&amp;T and SunTrust, in places throughout this site. All such references should be understood to refer to Truist moving forward while we continue to transition to the Truist name.</p><p></p><p>EEO is the LawPay Transparency Nondiscrimination ProvisionE-Verify</p></div></div>",
        "index": 15,
        "skills": [
            "machine learning",
            "project management",
            "virtual reality"
        ],
        "contact": "877-891-2510",
        "remote": false
    },
    {
        "position": "2022 Software Engineering Co-op",
        "company": "terex",
        "location": {
            "city": "Redmond",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/404ffbfd249adf10b28cdd891b80f1ad?lvk=AKC8tp1SS2eYqIXxbGSRKA.--MBbeq9udo",
        "posted": "2021-09-21T01:31:46.318Z",
        "lastScraped": "2021-09-27T01:31:46.318Z",
        "description": "<div><div><p><b>Co-op Pr</b><b>ogram Overview:</b></p><p>The Terex Co-op Program immerses high potential students in challenging real-world projects which directly help drive business results at our global organization. Our rich beliefs in innovation and continuous improvement, paired with the diverse and creative mindsets of our students, leads to the development of our best-in-class products, positively impacting the lives of people all around the world.</p><p>We are committed to the personal and professional development of our students and are proud to encourage their growth into our leaders of tomorrow.</p><p>&nbsp;</p><p><b>Highlights:</b></p><ul><li>Partner with team members from global locations - more than 7 manufacturing locations worldwide.</li><li>Intern/Co-op opportunities can lead to full time careers</li></ul><p>&nbsp;</p><p><b>Real World Responsibilities:</b></p><p>During your time with us you will:</p><ul><li>Design and develop embedded software that controls complex, safety-critical hydraulic and electrical control systems</li><li>Contribute to all aspects of the software development process including specification, development, design reviews and testing</li><li>Participate in meetings and presentations, brainstorming ideas and communicating engineering concepts to individuals from all disciplines</li></ul><p>As part of our team we will:</p><ul><li>Provide you with real-work assignments that will provide you valuable experience as you begin your career</li><li>Create and improve the next generation of control system for Genieâ€™s family of products</li></ul><p>&nbsp;</p><p><b>Must haves:</b></p><ul><li>Currently pursuing an ABET accredited degree in a Computer Engineering, Computer Science, Electrical Engineering, or similar credited certificate </li><li>Solid understanding of object-oriented design in C++ including the use of STL</li><li>Ability to work full-time for 6 months, part-time for 12 months, or a combination of the two</li><li>Ability to work in Redmond, WA</li><li>Excellent communication skills, both verbal and written</li></ul><p>&nbsp;</p><p><b>Nice to haves:</b></p><ul><li>Familiarity with GCC, Git, and the agile software development process</li><li>Understanding of the mechanics of real-time embedded operating systems</li><li>Familiar with developing and debugging hardware device drivers</li><li>If you have a Stack Overflow profile, please provide your user ID</li></ul><p>&nbsp;</p><p><strong>Location: </strong>US-WA Redmond-B33 (HUB) HR&nbsp;</p><p><strong>Department:&nbsp;</strong>Engineering&nbsp;</p><p><strong>Job ID: </strong>24903&nbsp;</p><p>&nbsp;</p><p><strong>Terex Overview:</strong></p><p>Terex Corporation is a $3.1 billion publicly traded global manufacturer of lifting and material processing products and services. We are passionate about producing equipment that helps improve the lives of people around the world, and providing our team members with a rewarding career and the opportunity to make an impact. While our operations are global, each office or factory is a close-knit community. We value diversity, equity and inclusion, safety, integrity, respect, servant leadership, courage, citizenship, and continuous improvement. Itâ€™s an exciting time to be part of the expanding manufacturing sector â€“ come join us!</p><p>&nbsp;</p><p><strong>Additional Information:</strong></p><p>It is the policy of the company to attract and retain the best qualified employees. We are committed to providing employment opportunities to the most qualified internal or external candidate based on work-related factors and without regard to non work-related factors including race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability, or veteran status as a special disabled veteran, Vietnam Era Veteran, or other qualifying veteran.</p><p>&nbsp;</p><p>The Company offers competitive salaries, advancement opportunities, and a full range of benefits, including paid vacation, 401(k), medical, dental, and vision.</p><p>&nbsp;</p><p>Terex Corporation is an Equal Opportunity Employer and Affirmative Action Employer M/F/D/V.</p></div></div>",
        "index": 16,
        "skills": [
            "software engineering",
            "hardware",
            "c and c++",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Graduate Analytic Internship",
        "company": "Humana",
        "location": {
            "city": "Louisville",
            "state": "Kentucky",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5fcbf959fbd303baacf8a34ad2d21b4e?lvk=ccC_NtjKspJff_B-HtEXlw.--MBi3LlzUc",
        "posted": "2021-09-21T01:31:47.285Z",
        "lastScraped": "2021-09-27T01:31:47.285Z",
        "description": "<div><div><p><b><b><b>Description</b></b></b></p><p></p><p></p><p><b><b>Responsibilities</b></b></p><p></p><ul><li></li></ul><p>As an Analytics Intern, you will collect and analyze data related to various clinical populations, assessing clinical quality, health outcomes, quality of life, and cost. Your work will support Humana's strategic and tactical progress; improving the health of the members we serve 20% by 2020.</p><p></p><p><b>Job Description</b></p><p>Are you ready to create something different that will positively affect the healthcare industry in a noble and purposeful way? Here, within Humana, we are poised to do just that. If you are interested in taking the next step in your career within in the data and analytics arena - we'd like to talk with you.</p><p>We are seeking summer interns who will contribute to the digital health and analytics community by working with business partners, data scientists, and subject matter experts across the organization to develop and reinforce the data driven culture within Humana.</p><p></p><p><b>Responsibilities</b></p><ul><li>Develop analytical constructs based on addressing business challenges</li><li>Perform exploratory data analysis, modeling and insights generation in areas related to consumer health and well-being</li><li>Combine and analyze diverse types of data to extract fresh, actionable discoveries about our members and their healthcare and health-related behavior</li><li>Develop predictive models to drive acquisition, retention, loyalty, wellness, consumer engagement, satisfaction and sustainable measureable health related behavior change</li><li>Ensure full and clear documentation of all processes</li><li>Collect and document business requirements for reporting and analysis initiatives</li><li>Identify and troubleshoot data anomalies and irregularities</li></ul><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p><b>Required Qualifications</b></p><ul><li>Pursuing a master's Degree in Epidemiology, Economics, Mathematics, Statistics, Biostatistics, Engineering, Actuarial Science, or related fields</li><li>Graduate from your program August 2022 or later</li><li>Excited at the prospect of working with extremely large datasets that cover millions of members over multiple years</li><li>Strong understanding of techniques such as linear and non-linear regression, survival analysis, longitudinal analysis, etc.</li><li>Genuine and authentic communication skills and the ability to effectively deliver crisp messages to a broad audience</li><li>Solid organizational skills including attention to detail and multitasking skills</li><li>Demonstrated programming skills in at least one language such as Python, R, SAS, Java, or Scala.</li><li>Team player with strong interpersonal relationship, team building, collaboration and facilitation skills</li><li>Excellent MS Office skills including Excel and PowerPoint</li></ul><p></p><p><b>Preferred Qualifications</b></p><ul><li>Experience in Azure, GCP, AWS or other cloud ecosystems.</li><li>Experience with state-of-the-art techniques in machine learning algorithms, including deep neural networks, NLP, dimensionality reduction, ensemble methods, graph algorithms.</li><li>Big data experience (Hive, Spark, HDFS) a big plus!</li></ul><p></p><p></p><p></p><p></p><p></p><p><b><b><b>Scheduled Weekly Hours</b></b></b></p><p></p>40</div></div>",
        "index": 17,
        "skills": [
            "machine learning",
            "java",
            "scala",
            "networks",
            "python",
            "software engineering"
        ],
        "remote": false
    },
    {
        "position": "Data Science / Analytics Intern - BioSciences",
        "company": "Thermo Fisher Scientific",
        "location": {
            "city": "Carlsbad",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/fa19d0b01dc6f5a69ae3ee05c0226f38?lvk=JuveSle8spxDs9XRs_9cpA.--MBdFInYG7",
        "posted": "2021-09-23T01:31:48.481Z",
        "lastScraped": "2021-09-27T01:31:48.481Z",
        "description": "<div><div><p>Auto req ID: 174715BR <br>Job Description: </p><p>When you're part of the team at Thermo Fisher Scientific, you'll do important work. You'll have the opportunity to grow and learn in a culture that empowers your development. We have created an inclusive, global environment that values the power of diverse talent, backgrounds, and experiences to drive speed, efficiency, innovation, and growth.</p><p>Our internship program will give you a chance to get real world business experience and build your network before graduation. We are seeking an upbeat, responsible intern to join our growing organization.</p><p></p><p><b>Location/Division Specific Information</b></p><p>The position is based in Carlsbad, CA working with the Biosciences Division. It starts in May, paid working 40 hours per week through August. Opportunity exists for this position to continue through the academic year on a part-time basis to allow for class schedules.</p><p></p><p><b>How will you make an impact?</b></p><p>As a Data Science Analytics Intern, we will work together as a team dedicated to growing business efficiency of a Fortune 200 Company. This position provides an exciting way for an intern to employ a cross section of machine learning and analytic processes to develop algorithms that will improve productivity and drive revenue growth using Power BI.</p><p>We will translate business priorities into algorithms and communicate the results to partners with varying degree of technical background. You will use strong data mining and modeling skills to integrate multiple complex data sources, such as marketing, finance and supply chain etc. and translate them into easily consumable visualizations and support data science initiatives.</p><p></p><p><b>Key responsibilities</b>:</p><ul><li>Collect feedback and specifications from customers, iterating through agile development sprints</li><li>Build data pipelines and transform data sets in AWS data lake infrastructure</li><li>Enhance existing databases, cloud platforms, visualization platform preferably Power BI for more effective business decision making</li><li>Work on automation and productivity initiatives that will provide exposure to automation tools and approaches</li><li>Create predictive models and data science algorithms to tackle business problems and present results to customers through presentations, data flow diagrams, email, and meeting structures</li><li>Troubleshooting and debugging: Validate the data in the central database by identifying any gaps with original source data and investigating the root cause.</li></ul><p></p><p><b>Knowledge, Skills and Abilities</b></p><ul><li>Understanding of dimensional modeling and AWS cloud platform</li><li>Knowledge of SQL and Power BI Platform</li><li>Strong analysis skills</li><li>Knowledge of R, Python and interoperability between different programming languages is a plus</li><li>Ability to work independently and as a member of a cross-functional team</li><li>Willingness to learn, be mentored, and improve</li><li>Ability to communicate optimally with a cross functional team verbally and in writing</li></ul><p></p><p>At Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and impact to our singular mission-enabling our customers to make the world healthier, cleaner and safer. Apply today!</p><p></p><p>Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science. With revenues of $20 billion and the largest investment in R&amp;D in the industry, we give our 70,000 employees the resources and opportunities to make significant contributions to the world. The customers we serve fall within pharmaceutical and biotech companies, hospitals and clinical diagnostic labs, universities, research institutions and government agencies. Our products and services help accelerate the pace of scientific discovery, and tackle challenges ranging from complex research to routine testing to field applications.</p><p>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.</p><p></p><p></p><p>*TFSInternship2021</p><p><span class=\"long-word\">*TFSEarlyTalent2021</span></p><br>Position Title: Data Science / Analytics Intern - BioSciences <br>Country / State - City: US - California - Carlsbad <br>Job Category: Internship &amp; Apprenticeship <br>Thermo Fisher Scientific: is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status. <br></div></div>",
        "index": 18,
        "skills": [
            "data science",
            "machine learning",
            "sql",
            "data visualization",
            "networks",
            "python",
            "information technology"
        ],
        "compensation": "paid",
        "start": "2021-04-30T15:00:00.000Z",
        "remote": false
    },
    {
        "position": "Water Quality Intern",
        "company": "Orange County Water District",
        "location": {
            "city": "Fountain Valley",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/292239587bf6bb7eef9ca452c73e1fc0?lvk=56QxMzkwVKdlzJVgKOTogg.--MBtLGuIA7",
        "posted": "2021-09-22T01:31:53.271Z",
        "lastScraped": "2021-09-27T01:31:53.271Z",
        "description": "<div><div> Description <p></p><p>Under supervision, the qualified candidate will provide administrative and occasional field support to the Water Quality Department. Responsibilities of this position include both administrative (e.g., organizing, &nbsp;filing, sorting, documenting, composing, digitizing, computing, etc.) and will assist with routine outdoor field work (e.g., surface water and groundwater sample acquisition, depth to groundwater measurements, field meter measurements, sample deliveries to laboratories, etc.) throughout the Santa Ana River watershed and primarily in the north-central Orange County area. Other duties of a similar nature or level may be assigned, as needed. &nbsp;</p><p></p> Typical Qualifications <p></p><p>Must be currently enrolled in a full-time, accredited Bachelor or Graduate degree program with emphasis in physical, life or engineering sciences, environmental studies, and/or related fields. Must have a current GPA of 2.0 or higher and be available for at least one year. &nbsp;Basic science background and PC computer literacy, including experience with Microsoft Office suite, especially Excel. Good organizational skills and ability to follow directions. Experience performing basic laboratory tasks and knowledge of basic safety procedures.&nbsp;</p><br><p><strong>Special requirements:</strong><br>This position requires the incumbent to be physically able to operate outdoors on both land and, infrequently, within shallow water bodies.&nbsp;</p><p>Must be available to work 15-25 hours a week.&nbsp;</p><p>Possession of a valid California Class \"C\" Driver's license and proof of automobile insurance.</p><p></p> Supplemental Information <p></p><p><strong>Internships&nbsp;are&nbsp;to&nbsp;provide&nbsp;meaningful&nbsp;training&nbsp;and&nbsp;work&nbsp;experience&nbsp;for&nbsp;college&nbsp;students&nbsp;pursuing&nbsp;academic&nbsp;studies&nbsp;related&nbsp;to&nbsp;the&nbsp;District's&nbsp;mission&nbsp;and&nbsp;goals.&nbsp;Interns&nbsp;must&nbsp;submit&nbsp;proof&nbsp;of&nbsp;full-time&nbsp;enrollment, class schedules and grades each semester/quarter.&nbsp;Interns are not eligible for employee&nbsp;benefits. Interns are \"at will\" and can be terminated at the discretion of the Department Manager with or&nbsp;without&nbsp;cause&nbsp;and&nbsp;with&nbsp;or&nbsp;without&nbsp;prior&nbsp;notice.</strong></p><p><strong>&nbsp;</strong></p><p><strong>Please attach or include the following documents to your application:</strong></p><ul><li><strong>Cover Letter&nbsp;</strong>with your expected graduation date, your hours available to work (Mon-Fri), and an explanation of how your schooling relates to this internship.</li><li><strong>Class <span class=\"long-word\">Schedule/Unofficial</span> Transcript&nbsp;</strong>showing your current enrollment in a Bachelor's or graduate degree program. The document must list your name and school name, current GPA, units, and your current or upcoming class schedule.</li></ul><p><strong>&nbsp;Hourly Rate:&nbsp;</strong>Undergraduate:&nbsp;$15&nbsp;per&nbsp;hour&nbsp;&amp;&nbsp;Graduate:&nbsp;$17&nbsp;per&nbsp;hour</p><p><strong>&nbsp;</strong></p><p>Candidates given an offer of employment will be required to pass a medical examination and background check. You must submit an OCWD online employment application to be considered.<strong>&nbsp;</strong>Please click <strong>Apply&nbsp;</strong>to complete an application.<strong>&nbsp;</strong>Applications will be accepted until a sufficient number apply. EOE</p><p></p></div></div>",
        "index": 19,
        "skills": [
            "c and c++",
            "project management",
            "information technology",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "ADMINISTRATIVE INTERN",
        "company": "City of Long Beach",
        "location": {
            "city": "Long Beach",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/656bc8d78f9aee42e876226715eaaaef?lvk=D6KpVtwSGI8AKmmNkwuudg.--MBoB56uLB",
        "posted": "2021-09-24T01:31:54.252Z",
        "lastScraped": "2021-09-27T01:31:54.252Z",
        "description": "<div><div> DESCRIPTION <p></p><p>The Technology and Innovation Department is seeking two (2) Administrative Interns to perform tasks related to the planning, administration, and technology of the Department. &nbsp;One (1) intern will be assigned to the Business Operations Bureau and one (1) intern will be assigned to the Enterprise Information Services Bureau.<br><br>The Technology and Innovation Department (TID) plans and develops the technology infrastructure for the City and provides a centralized resource for technology deployment and support throughout the City. The Department integrates people, processes, and technology to increase the efficiency and effectiveness of City services. TID is organized into five bureaus: Business Information Services, Business Operations, Customer Services, Enterprise Information Services, and Infrastructure Services. Additional information about the department is available at <span class=\"long-word\">www.longbeach.gov/ti</span></p><br><p></p> EXAMPLES OF DUTIES <p></p><div><strong>Business Operations Bureau (1 Intern)</strong>&nbsp; </div><ul><li>Utilizes Microsoft Office programs such as PowerPoint, Excel, Word, and Outlook, to create materials;&nbsp;</li><li>Schedules, participates, facilitates, and takes notes at status meetings;&nbsp;</li><li>Provides general administrative and clerical assistance including, but not limited to:&nbsp; <ul><li>Scheduling interviews;&nbsp;</li><li>Preparing interview binders for interview panelists;&nbsp;</li><li>Drafting recruitment flyers;&nbsp;</li><li>Maintaining the TID recruitment and TID invoice mailboxes;&nbsp;</li><li>Assisting accounts payable/receivable staff with invoice and purchase order process;&nbsp;</li><li>Performs other related duties as assigned. &nbsp;&nbsp;</li></ul></li></ul><strong>Enterprise Information Services Bureau (1 Intern)</strong>&nbsp; <ul><li>Meets with City departments to provision and validate employees and processes such as locations, workflows, deductions, profile elements, workflows for Payroll modules;&nbsp;</li><li>Integrates users into different environments through the time entry module;&nbsp;</li><li>Works closely with the LBCOAST Payroll Project Team in monitoring the quality and scheduling of meetings as it relates to Payroll;&nbsp;</li><li>Reviews reports, and works with various reporting systems to develop reporting as needed;&nbsp;</li><li>Corresponds and communicates with other LBCOAST project employees and consultants via email, phone and live meetings;</li><li>Performs other related duties as assigned.&nbsp;</li></ul><p></p> REQUIREMENTS TO FILE <p></p><div><strong>QUALIFICATIONS:</strong></div><div> Current enrollment from an accredited college or university in an Associate's or Bachelor's program with a focus/emphasis in computer science, engineering, information systems, business administration, public administration, or a related field <strong>&nbsp;(proof required).</strong></div><div><br></div><div><strong>DESIRABLE QUALIFICATIONS</strong><br><ul><li>Proficiency with the Microsoft Office Product Suite e.g. Word, Excel, PowerPoint, and Visio;</li><li>Strong work ethic and history of dependability;</li><li>Excellent oral, written, and interpersonal skills;</li><li>Strong organizational skills;</li><li>Ability to quickly learn new applications and follow detailed instructions;</li><li>Ability to deal tactfully and effectively with employees and management without technical backgrounds;</li><li>Ability to take direction and work independently, or as part of a team;</li><li>Experience with business process reengineering, documenting workflows, and developing specifications.</li></ul></div><p></p> SELECTION PROCEDURE <p></p><div> To apply, please click on the \"Apply\" link and submit your application online.&nbsp;Incomplete applications will not be considered. <br><br>The Technology and Innovation Department will&nbsp;review the applications to determine the most qualified candidates. Those determined most qualified will be invited to interview online. </div><div><br>The Technology and Innovation Department intends to provide reasonable accommodations in accordance with the Americans with Disabilities Act of 1990. &nbsp;If a special accommodation is desired or if you would like to request this information in an alternative format, please call (562) 570-6274/(562) 570-6272 or email <span class=\"long-word\">TIRecruitments@longbeach.gov</span> </div><div><br>In support of the City's Language Access Policy, bilingual skills (Spanish, Khmer and/or Tagalog) are desirable for positions interacting with the public. <br><br>For technical issues with your application, please call (877) 204-4442. <br><br>The City of Long Beach is an Equal Opportunity Employer. </div><p></p></div></div>",
        "index": 20,
        "skills": [
            "project management",
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Access Your Future Service Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Osseo",
            "state": "Minnesota",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d767545e1a4d5943ecca6987f57afbee?lvk=8f7_pPLZ0yLEUj1YoKLThg.--MBdHgU7cs",
        "posted": "2021-09-21T01:31:55.250Z",
        "lastScraped": "2021-09-27T01:31:55.250Z",
        "description": "<div><div><strong>Job Description</strong><p>Access Your Future is a sponsorship program for students interested in a career in the equipment industry as a Service Technician. This program provides a career path for a qualified student and an educational incentive upon successful completion of an approved diesel program. <br>The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships.<br><br><strong>Specific Duties Include:</strong><br></p><ul><li> Enrolled or attending an approved Diesel Technology program or another program approved in writing by RDO Equipment Co.<br></li><li> Part time paid employment at sponsoring store (if store location permits) while attending college.<br></li><li> Possible full time paid employment between college academic years at sponsoring store location.<br></li><li> This program offers sponsored students graduating, an educational incentive over a two or four year period while they maintain full time employment with RDO Equipment Co. <br></li><li> Company provided work uniforms.<br></li><li> Eligible for the RDO Equipment Co. tool discount program with Matco upon full time employment.<br></li><li> Maintain a GPA of 3.0 (on a 4.0 scale) while in program.<br></li><li> Maintain acceptable attendance record while in program.<br></li><li> It is the student's responsibility to provide a copy of their transcripts to RDO Equipment Co. after each quarter or semester and a diploma in order to receive reimbursement upon full time employment. <br></li><li> Adhere to academic policies, rules and regulations set forth by the higher learning center the student is attending.<br></li><li> Document machine information and repairs completed on work order, including parts and fluids used. <br></li><li> Maintain a clean work area, as well as care for all shop tools, machines, and equipment.<br></li><li> Identify and communicate solutions for customer service opportunities in the dealership's area of responsibility.<br></li><li> Maintain technical and product knowledge on all equipment sold within the dealerships area of responsibility.<br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set.<br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts.<br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service.<br></li><li> Perform all other duties as assigned by management in a professional and efficient manner.<p><strong>Job Requirements:</strong><br></p></li><li> Mechanical skills<br></li><li> Trade specific tooling, including hand and pneumatic tools<br></li><li> Strong computer skills<br></li><li> Excellent customer service skills<br></li><li> Ability to assemble and perform maintenance functions on equipment<br></li><li> Excellent communication and written skills<br></li><li> Strong organizational skills<br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships., * Mechanical skills * Trade specific tooling, including hand and pneumatic tools * Strong computer skills * Excellent customer service skills * Ability to assemble and perform maintenance functions on equipment * Excellent communication and written skills * Strong organizational skills * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Employment</span> Type: [\"PART_TIME\"]</li></ul></div></div>",
        "index": 21,
        "skills": [
            "machine learning",
            "information technology",
            "c and c++",
            "project management"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Lab Analyst",
        "company": "Actalent",
        "location": {
            "city": "Woodland",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/43f6140d7c76d6a4c7b2af06e803be6e?lvk=difad-feDh82prO6GLPU7Q.--MBuWxukIV",
        "posted": "2021-09-25T01:32:00.337Z",
        "lastScraped": "2021-09-27T01:32:00.337Z",
        "description": "<div><div><p>Hiring a Lab Analyst in Woodland area! Description:</p><p>The primary purpose is to assist on tasks related to insect bioassay data management within Pest Control Research. This will include data management of insect bioassay results and procurement of research materials. To a lesser extent, simple wet bench tasks will be assigned to support laboratory operations. Qualifications: Scientific Degree</p><p> Key Working Relation: This position works mainly with internal stakeholders at Pest Control Biologics.</p><p> Qualification &amp; Competencies:</p><p>Bachelor Science degree in entomology, biology or zoology, with 2+ years of relevant experience</p><p> Relevant experience is defined as research experience gained from internships, part time or full time work in research facilities such as academic or industry laboratories, greenhouse or field settings.</p><p> Excellent proficiency in using computer word and spreadsheet processing programs to manage data.</p><p> Proactive in learning, with excellent planning and organizational skills.</p><p> Excellent communication skills in both oral and written format.</p><p> Ability to work independently on given tasks, as well as a team player with peers and supervisors.</p><p> Experience with electronic notebook, statistic software tools or enterprise lab information management systems would be added value.</p><p> Good understanding of scientific principles, preferably in the field of entomology, biology, zoology or environmental sciences would be added value.</p><p> Key Tasks:</p><p>Collect, collate and record insect bioassay results in a timely and standardized manner using computer word/excel processing programs, database system and electronic notebook. This may include registration of test samples and assays in formalized database systems may be included.</p><p></p><p> Ability to perform data visualizations and simple data quality control checks using statistical tools (example, excel, JMP, SAS, or R) is desirable.</p><p></p><p> Communicate and deliver written internal reports to supervisors for review and approval, ensuring speedy decision-makings.</p><p></p><p> Procuring research materials to support laboratory operations. This comprised of insect eggs, diet plates, and other research materials.</p><p></p><p> To a lesser extent, support some wet bench tasks related to laboratory operations, for example insect diet preparation, plate labelling, insect infestations, etc.</p><p></p><p> Adhere to Bayer and laboratory safety policies, best practices and compliance.</p><p></p><p></p><p></p><p>About Actalent: Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We're supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions.</p><p> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. </p></div></div>",
        "index": 22,
        "skills": [
            "software engineering",
            "data visualization",
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Counselor/Clinician II - FT - Bellingham",
        "company": "Compass Health",
        "location": {
            "city": "Bellingham",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-d5dd3696/mental-health-counselor-clinician-ii-ft-bellingham-03e564f5?lvk=Wsj2FeX_i104Mg_BA5gAKw.--MB_nO7Qlw",
        "posted": "2021-09-22T01:32:01.851Z",
        "lastScraped": "2021-09-27T01:32:01.851Z",
        "description": "<div><p>Compass Health is currently looking for a <strong>Mental Health Counselor / Clinician II for our Adult Outpatient program in Whatcom County. </strong>Our new Clinician will be provide a range of clinically indicated services, including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults with behavioral health conditions and their families/natural supports. . This position is responsible for assessing client/family functioning and needs, and partnering with the client/family to develop an individually tailored care plan designed to address the client/families goals. This position may also provide clinical support to Interns as appropriate.</p><p></p><p><strong>The team you will be joining</strong></p><p>The Bellingham Adult Outpatient team is a close and inclusive bunch that work together to provide wellness, hope and recovery to our community while also having fun as a team. We are looking for someone to join our team that shares our passion and mission to the community. We are passionate about serving adults in Whatcom county with dignity and respect. We pride ourselves in providing quality care to this population while also caring for each other on the team.</p><p></p><p><strong>What we can offer:</strong></p><p>As the regionâ€™s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesnâ€™t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance.</p><p><em>(benefits pro-rated for part time employees)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays â€“ 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul><p><br><br><strong>What you will bring with you:</strong><br>â€¢ MA/MS/MSW Degree in a Behavioral Science related field.<br>â€¢ Qualifies as a Mental Health Professional (MHP) as defined by WAC preferred.<br>â€¢ Meets educational and training requirements for designation as a Child Mental Health Specialist preferred.<br>â€¢ Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn.<br>â€¢ Individuals who do not already hold a license or associate license through the Washington State Department of<br>Health must submit Agency<br>Affiliated Counselor application upon hire and be approved by the DOH.<br>â€¢ Valid Washington State Driverâ€™s License including vehicle and appropriate insurance, if applicable.<br>â€¢ Ability to work effectively with individuals with complex needs and multi-system involvement.<br>â€¢ Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems.<br>â€¢ Demonstrated organizational skills and the ability to multitask within a fast-paced environment.<br>â€¢ Excellent communication skills, written and verbal.<br>â€¢ General computer proficiency, including the ability to utilize electronic medical record systems.<br>â€¢ Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS.</p><p><br><br><strong>The organization you will be a part of:</strong><br>Compass Health is the regionâ€™s largest private, non-profit organization providing mental health and chemical dependency services in Island, San Juan, Skagit, Snohomish, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesnâ€™t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org.</span> </p><p><em>Compass Health promotes equal treatment and equal employment opportunity to all applicants and employees regardless of race, creed, color, national origin, sex, religion, age, marital status, sexual minority status, sexual orientation, veteran status, or disability unless based on a bona fide occupational qualification</em></p><p></p><p></p><p><strong>POSITION SUMMARY</strong><br>Job Title: Clinician II<br>Program: 205-21280 â€“Mental Health 2<br>Location: Bellingham<br>Hours: Full-Time, 40Hours/Week<br>Wage: $19.53 - $36.12/hour, DOE</p><p><strong>KEYWORDS</strong>: Mental Health Counselor, Mental Health Therapist, Therapist, Counselor, Trauma Specialist, LMHC / LMHCA, LMFT / LMFTA, MSW / LICSW / LSWAIC, LMFT / LMFTA Supervision, LMHC / LMHCA Supervision</p></div>",
        "index": 23,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Associate Software Engineer (Remote)",
        "company": "Planted",
        "location": {
            "city": "Bodega Bay",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/planted-214376ba/associate-software-engineer-remote-075a3db4?lvk=RhgyzFPp6GGfYCV_BtlImQ.--MBhI3FpVJ",
        "posted": "2021-09-25T01:32:03.195Z",
        "lastScraped": "2021-09-27T01:32:03.195Z",
        "description": "<div><p><strong>Job Description:</strong></p><p>This position is available on a Full-Time or Part-Time basis. Working with the core R+D team, the software engineer will develop algorithms and applications that make solar power plants more efficient, more productive, and faster to build. Software projects will include a mix of algorithm design and performance evaluation, API development, data processing, and production optimizations. </p><strong>Qualifications</strong><ul><li>Bachelor's degree in computer science, electrical engineering, or similar</li><li>At least one year of experience (including project or internships), focused on application software development</li><li>Proficient in a modern programming language, e.g. python, C#, Go</li><li>Demonstrated experience of creative problem solving in software applications</li><li>Understanding of data structures and best coding practices</li><li>Idea generation and execution, mostly unsupervised</li><li>Hands-on aptitude, strong debugging and system analysis skills</li><li>Desire to work in a fast paced startup environment</li></ul><strong>Bonus Qualifications:</strong><ul><li>Experience in a startup environment</li><li>Experience developing production code and contributing to large production code bases</li><li>Experience building multi-threaded and/or real-time systems</li><li>Knowledge of classical robotics theory and coordinate transformations</li></ul></div>",
        "index": 24,
        "skills": [
            "software engineering",
            "python",
            "robotics",
            "c and c++",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Chubb Associate, Westchester Financial Lines",
        "company": "Chubb",
        "location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8b6e548289c9108950bca4b75e12eaed?lvk=k_sjdDMKu2hcKKoP_rF6ow.--MBnvTGw3V",
        "posted": "2021-09-25T01:32:04.154Z",
        "lastScraped": "2021-09-27T01:32:04.154Z",
        "description": "<div><div><p><b>Chubb Associate Program</b></p><p>Chubb is looking for an aspiring insurance professional with a Bachelor's Degree to join our Chubb Associate Program.&nbsp;</p><p>As the industry leader in Property &amp; Casualty insurance, Chubb is an employer of choice for a student aspiring to develop a meaningful career in a fast-paced, diverse company.&nbsp;This is a full-time position and a compelling opportunity to join a global, growing, financially stable and successful company.</p><p>&nbsp;</p><p>We have designed our Chubb Associate Program to hone your skills and talents and help you reach your career goals.&nbsp; By joining the Chubb Associate Program, you will be part of an experience that supports the well-rounded development of critical business skills which in turn contributes to the future success of our company. Our blended program is designed to include hands-on business assignments in a variety of disciplines, interactive classroom instruction, team assignments and direct interaction with other early career professionals as well as with many of our senior executives.&nbsp; As part of this program you will receive:&nbsp;</p><ul><li>Challenging assignments and the opportunity to contribute to the result of a team;</li><li>Business training unique to a career at Chubb;</li><li>Technical training to deepen your skill level within your chosen discipline; and an understanding of our broader industry;</li><li>Interpersonal effectiveness training to help you gain strong communication and interactive skills;</li><li>Access to additional training to compliment your professional development.</li></ul><p><b>We are excited about and committed to the Chubb Associate Program because we believe that we are developing talented professionals with the potential to become Chubb's leaders of the future.</b></p><p>&nbsp;</p><p>Qualifications</p><p><b>Who are we looking for?&nbsp;</b>&nbsp;</p><p>Successful professionals at Chubb come from many backgrounds and experiences and bring that rich diversity with them to our company.&nbsp; They also have some things in common and these attributes will lead to your success at Chubb:&nbsp;</p><ul><li><b>Results orientation:</b>&nbsp;a demonstrated ability to meet commitments under pressure</li><li><b>Practical intellectual agility:&nbsp;</b>capable and confident in absorbing new information</li><li><b>Personal capacity:</b>&nbsp;accepting and welcoming of additional responsibility over time</li><li><b>Communication skills:</b>&nbsp;an ability to communicate successfully in various settings</li><li><b>Interpersonal/team skills:</b>&nbsp;works effectively with all colleagues and collaborates within and across departments</li><li><b>Initiative:</b>&nbsp;an ability to take full ownership of work and show initiative as needed</li><li><b>Customer focused:</b>&nbsp;service oriented, recognizing the importance of understanding client needs</li><li><b>Integrity and work ethic:&nbsp;</b>a commitment to hard work and a high ethical conduct</li><li><b>Successful academic record:</b>&nbsp;Minimum GPA of 3.0</li></ul><p>Successful candidates will be:</p><ul><li>Curious; passionate about learning</li><li>Flexible and adaptable; a change agent</li><li>Resilient and resourceful</li><li>Collaborative; able to lead and follow</li></ul><p>Desired Qualifications</p><ul><li>Bachelor's degree; many majors will be considered; slight preference to Risk Management, Business, or Computer Science</li><li>Strong GPA; 3.3 or higher preferred</li><li>Prior work experience (including summer or part time roles) or internships preferred</li><li>Demonstrated active engagement in extracurricular activities</li><li>Some knowledge of insurance concepts, practice, and procedures is desirable</li><li>MS Office experience, including Word, Excel, and Outlook</li><li>Oral and written communication skills</li><li>Demonstrated skills in: <ul><li>Critical thinking</li><li>Influencing both formally and informally</li><li>Articulating a message / point of view in presentation and in writing</li></ul></li></ul><p>&nbsp;</p><p><b><i>Chubb strives to offer a diverse and inclusive and rewarding work environment.&nbsp; Teamwork and mutual respect are central to how Chubb operates and we believe the best solutions draw upon diverse perspectives, experiences and skills.&nbsp; We operate in such a way where everyone, regardless of their singular background has the opportunity to contribute to our collective success.</i></b><br> &nbsp;</p><p>Chubb offers a competitive compensation package and comprehensive benefits package including life, health and dental, vision, a generous retirement savings plan, disability coverage, stock purchase plan, flexible spending accounts, tuition reimbursement, and business casual dress. At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religion, age, sex, sexual orientation, transgender, national origin, disability, genetic information, veteran or marital status, or any other characteristic protected by law.</p></div></div>",
        "index": 25,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Therapist/Clinician III - PT - Edmonds/Everett",
        "company": "Compass Health",
        "location": {
            "city": "Edmonds",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-d5dd3696/mental-health-therapist-clinician-iii-pt-edmonds-everett-00e30b02?lvk=2GFvnSnb1jrKUyi9zZLYiQ.--MB_rLuEEJ",
        "posted": "2021-09-18T01:32:05.951Z",
        "lastScraped": "2021-09-27T01:32:05.951Z",
        "description": "<div><p><strong>Mental Health <span class=\"long-word\">Therapist/Clinician</span> III - Temporary - Opportunity to convert to regular Employee</strong></p><p><strong>20Hrs Per Week</strong></p><p><strong>Edmonds/Everett, WA</strong></p><p></p><p>Compass Health is currently looking for a <strong>Mental Health <span class=\"long-word\">Therapist/Clinician</span> III for our Aurora House &amp; Greenhouse locations!</strong></p><p>Our Residential Treatment Facilities (RTFs) serve adults age 18 and over diagnosed with severe and persistent psychiatric disorders. Services include assessment, psychiatric evaluation, medication monitoring, case management, counseling, groups, mental health education, crisis resolution, and skills training regarding activities of daily living. The program focuses on helping residents reach increasing levels of recovery in order to successfully transition back into the community.</p><p></p><p><strong><strong>What you will be performing</strong></strong></p><p>The Clinician III works in conjunction with the Program Manager to ensure that staff of the Residential Treatment Facilities (RTF) have appropriate supervision and that clients receive high quality clinical care. This position provides a range of clinically indicated services including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults/older adults with behavioral health conditions. This position is responsible for assessing client functioning and needs, and partnering with the client and the care team to develop an individually tailored care plan designated to promote recovery. This position is responsible for ensuring consistent and appropriate clinical programming at the RTFs. This position will also provide clinical supervision to mental health technicians and/or interns as needed.</p><p></p><p><strong><strong>What you will </strong></strong><strong><strong>be </strong></strong><strong><strong>carrying along</strong></strong></p><ul><li>MA/MS/MSW Degree in a Behavioral Science related field. </li><li>Current Washington State Li-censure or equivalent in Social Work, Marriage &amp; Family Therapy, or Mental Health Counseling required. </li><li>Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn. </li><li>Washington State Approved Supervisor Training must be completed prior to providing clinical supervision. </li><li>Valid Washington State Driverâ€™s License including vehicle and appropriate insurance, if applicable. </li><li>Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS.</li></ul><p></p><p><strong><strong>What you will </strong></strong><strong><strong>be </strong></strong><strong><strong>sharing</strong></strong></p><ul><li>Ability to work effectively with individuals with complex needs and multi-system involvement. </li><li>Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems. </li><li>Demonstrated organizational skills and the ability to multitask within a fast-paced environment. </li><li>Excellent communication skills, written and verbal. </li><li>General computer proficiency, including the ability to utilize electronic medical record systems. </li></ul><p></p><p><strong><strong>What we will </strong></strong><strong><strong>be </strong></strong><strong><strong>offering</strong></strong></p><p>As the regionâ€™s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesnâ€™t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance.</p><p><em>(benefits pro-rated for part time employees)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays â€“ 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul><p></p><p><strong><strong>The organization you will be joining</strong></strong><br>Compass Health is the regionâ€™s largest private, non-profit organization providing mental health and chemical dependency services in Island, San Juan, Skagit, Snohomish, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesnâ€™t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org.</span></p><p></p><p><em><em>Compass Health promotes equal treatment and equal employment opportunity to all applicants and employees regardless of race, creed, color, national origin, sex, religion, age, marital status, sexual minority status, sexual orientation, veteran status, or disability unless based on a bona fide occupational qualification</em></em></p><p></p><p></p><p><strong>POSITION SUMMARY</strong></p><p>Job Title: Clinician III<br>Program: 350-52250 â€“ Aurora House &amp; Green House<br>Location: Edmonds (Aurora House ) &amp; Everett (Green House)<br>Hours: Part Time (Temporary) 20 Hours/Week<br>Wage: DOE</p></div>",
        "index": 26,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "compensation": "paid",
        "remote": false
    }
]