[
    {
        "position": "STUDENT TRAINEE (COMPUTER SCIENCE)",
        "company": "Air Force Materiel Command",
        "location": {
            "city": "Kirtland Air Force Base",
            "state": "New Mexico",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/dc09f66bc84fa8df4da7c15d2e7ccc15?lvk=A_WDcYN_fhSXDgeET0Nonw.--M4ii6fYkN",
        "posted": "2021-06-26T18:08:34.480Z",
        "lastScraped": "2021-06-28T18:08:34.480Z",
        "description": "<div><p>Summary Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position STUDENT TRAINEE (COMPUTER SCIENCE), GS-1599-04, is to provide a student trainee who has been appointed to the Pathways Program with on-the-job training and guidance to further student technical development. Responsibilities Perform selected tasks and phases of routine studies and projects that require application of basic occupational field theory and principles in the technical area of Computer Science. </p><p>Participate with senior personnel in conducting non-routine projects. Provide assistance in planning, monitoring, and conducting special studies, projects, and initiatives. Requirements Conditions of Employment Qualifications PLEASE NOTE: This is not a developmental opportunity, this position may be filled at the GS-04 grade level. </p><p>Interns may be non-competitively converted to a career-conditional appointment in the competitive service upon successful completion of all experience and education requirements. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. </p><p>VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. </p><p>Education This position has an education requirement. You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. </p><p>Department of Education. <span class=\"long-word\">http://www2.ed.gov/admins/finaid/accred/index.html</span> To qualify for a GS-04: You must have successfully completed 2 full academic years (60 credit hours or 90 quarter hours) of post-high school study or an associate's degree. NOTE: You must submit a copy of your transcripts. </p><p>FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. </p><p>It is your responsibility to provide such evidence when applying. Additional Information Kirtland Air Force Base, New Mexico, in southeast Albuquerque, is nestled between the Sandia and Manzano mountain ranges. It is home to Air Force Materiel Command's Nuclear Weapons Center and its subordinate wings. </p><p>It is also home to the Directed Energy and Space Vehicle Directorates of the Air Force Research Laboratory. This is a Pathways Student Internship opportunity managed by the Force Renewal Program and centrally funded by the Air Force's Central Salary Account (CSA). The Internship offers valuable work experience directly related to your academic field of study. </p><p>This is your opportunity to begin a successful Federal civilian career with the United States Air Force. As an Intern, you will be given the opportunity to gain the knowledge, skills and abilities needed to pursue a successful career with the US Air Force and upon completing your degree and meeting conversion eligibility requirements, be eligible for placement in a permanent position. However, it is important to remember that eligibility for conversion does not guarantee you will be offered a permanent position. </p><p>The length of Internship is normally two years or when you complete your academic program and degree requirements. This internship is to provide a learning opportunity for a student enrolled in a field of study relating to their career path, to enhance their future goals and improve their knowledge with work experience in a working environment The entire period served under the Internship Program counts as the participant's trial period. Interns may work part-time or full-time schedules Non-citizens may be eligible for employment if permitted by the DoD Appropriation Act NOTE: U.S. </p><p>citizenship is required for a noncompetitive conversion to a permanent or term appointment with the Department of the Air Force. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. </p><p>Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11154348. </p><p>If you have questions regarding this announcement and have hearing or speech difficulties click here.</p></div>",
        "index": 1,
        "skills": [
            "project management",
            "machine learning",
            "information technology",
            "web development"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Marketing Intern",
        "company": "Loop Inc.",
        "location": {
            "city": "El Segundo",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/loop-inc-7c3f8b45/marketing-intern-3f3c7d24?lvk=5mjhhtIP45vNlMozOcJC3g.--M4oKUgcH7",
        "posted": null,
        "lastScraped": "2021-06-28T18:08:40.803Z",
        "description": "<div><p><strong>JOB DESCRIPTION: </strong></p><p>Loop, Inc. is seeking to hire a Marketing Intern to join our El Segundo, CA team who will help the company achieve its goals and objectives by being a team member advocate, change leader and work with other product leaders. The ideal candidate has a strong passion for digital marketing, research analytics, and product marketing. In addition to being an excellent communicator, this candidate should have keen attention to detail, as well as excellent multitasking and organizational abilities.</p><p>This paid internship will provide significant hands-on insight into a fast-paced role and invaluable learning about the fast-growing Electric Vehicle (EV) charging industry.</p><p><strong>RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO: </strong></p><ul><li>Assist with social media management on Instagram and Facebook</li><li>Design and present new social media campaign ideas</li><li>Create and evaluate methods for gathering data, including surveys, questionnaires, and opinion polls to engage with customers</li><li>Support digital marketing campaigns, initiatives, executions, and all marketing administrative needs</li><li>Perform market analysis and research industry trends, and relevant competitor insights, highlighting opportunities for new initiatives and promotions</li><li>Research customers’ opinions, buying habits, preferences, wants and needs</li><li>Convert complex data findings into understandable text, tables, graphs and/or data visualizations</li><li>Manage and update company content management system (CMS)</li></ul><p><strong>REQUIRED QUALIFICATIONS: </strong></p><ul><li>Strong desire to learn along with professional drive</li><li>Solid understanding of different marketing techniques</li><li>Excellent verbal and written communication skills</li><li>Organization and time management skills</li><li>Excellent knowledge of Microsoft Office</li><li>Excellent knowledge of Facebook, Instagram, and LinkedIn (or other social media platforms) and are up to date on latest trends</li><li>Familiarity with marketing computer software and online applications (e.g. CRM tools, Online analytics, and Google Ads)</li><li>Knowledge of Adobe Creative Suite is a plus</li><li>Data mining and data visualization is a plus</li></ul><p><strong>COMPANY INFORMATION &amp; CULTURE:</strong></p><p>Loop, Inc. is one of the nation's fastest growing electric vehicle charging station hardware &amp; software solution providers for the public and private real estate sector. We provide turnkey EV charging network and energy management construction solutions for large-scale property owners. www.evloop.io</p><ul><li>Diverse - We are a team of cool people with diverse backgrounds and ethnicities</li><li>Detail-oriented -- Quality and precision-focused</li><li>Innovative -- Innovative and risk-taking</li><li>Aggressive -- Competitive and growth-oriented</li><li>Outcome-oriented -- Results-focused with strong performance culture</li><li>Stable -- Traditional, stable, strong processes</li><li>People-oriented -- Supportive and fairness-focused</li><li>Team-oriented -- cooperative and collaborative</li></ul><p><strong>EQUAL OPPORTUNITY EMPLOYER:</strong></p><p>In compliance with the Americans with Disabilities Act, the company provides reasonable accommodation to qualified individuals with disabilities and encourages both prospective and current employees to discuss potential accommodations with the employer.</p></div>",
        "index": 2,
        "skills": [
            "information technology",
            "data visualization",
            "hardware",
            "networks",
            "machine learning",
            "project management",
            "software engineering"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Intern, Mass Management, Vehicle Integration",
        "company": "Lucid Motors",
        "location": {
            "city": "Newark",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a68de578d1a918e3b5e15aedbea9dee3?lvk=k5Bu6-OgwCvxnx_B48r5Fw.--M4P7-7hHF",
        "posted": "2021-06-23T18:08:41.544Z",
        "lastScraped": "2021-06-28T18:08:41.544Z",
        "description": "<div><div><div> Leading the future of luxury mobility</div><div><br></div><div> Lucid's mission is to inspire the adoption of sustainable energy by creating the most captivating luxury electric vehicles, centered around the human experience. Working at Lucid Motors means having a shared vision to power the future in revolutionary ways. Be part of a once-in-a-lifetime opportunity to transform the automotive industry.</div><div><br></div><div> We are actively seeking&nbsp;an&nbsp;Intern to join our Vehicle Integration team. Our ideal candidate exhibits a can-do attitude and approaches his or her work with vigor and determination. Candidates will be expected to demonstrate excellence in their respective fields, to possess the ability to learn quickly and to strive for perfection within a fast-paced environment.&nbsp;</div><div><br></div><div> Responsibilities <ul><ul><li>Develop a key tracking tool to feed several departments across the organization</li><li>Understand the whole process leading to the tool need and usage</li><li>Document the creation process, implementation, and way to evolve the tool</li><li>Work with engineering tools (CAD/PLM, Digital Factory, etc.) and IT to understand their applicable capabilities and limitations for each team</li><li>Troubleshoot manufacturing tool issues with the service team</li><li>Support the Service Engineers with various technical issues</li><li>Grow the team's knowledge bank through thorough documentation of issue resolution</li><li>Support PLM Analysts with review and documentation of product changes</li><li>Utilize Tableau to manage large data sets\\</li><li>Some projects include:</li><li>PLM Enterprise System interfaces</li><li>Program kickoff of new vehicle programs (e.gt., gravity)</li><li>Implementation of many new CAD/manufacturing software tools</li></ul></ul></div><div> Qualifications <ul><ul><li>Associate's, Bachelor's, or Post-Secondary Degree in Mechanical Engineering, Computer Science, or Data Science or related fields (Recent graduates are eligible up to 12 months after graduation)</li><li>Some CAD (Solidworks, Fusion 360, Catia) and PLM (ENOVIA, TeamCenter) experience </li><li>Strong organizational skills</li><li>Experience with managing large data sets</li><li>Experience with Catia (<b><i>v5and/ or V6) </i></b>is preferred</li><li>Experience with Tableau is preferred</li><li>Experience with Python, C++, or other related programming languages is preferred</li></ul></ul></div><div> Other <ul><ul><li><b>Programming Timing: </b>September 7th - November 26th, 2021 (12 weeks); End date can be extended up to December 23rd, 2021 based on individual needs; Some flexibility with start date is available if needed</li><li><b>Availability:</b> Full-time preferred but Part-Time available</li><li><b>Location:</b> This position is in Newark, CA. You must be prepared to start on site for your first day of employment</li><li><b>Work Environment: </b>Production Lab</li><li><b>Anticipated Hours:</b> 8:30 am - 5:30 pm</li><li><b>Compensation:</b> Student compensation is based on location and current degree level, non-negotiable</li><li><b>Visa Sponsorship: </b>Lucid may but is not obligated to sponsor foreign national employees requiring company sponsorship for U.S. employment authorization</li><li><b>Medical benefits:</b> Dental and vision on day 1 for all interns working 30+ hours a week; medical for interns in California working 30+ hours a week</li><li><b>Housing:</b> No compensation for housing</li><li><b>Bonus:</b> No signing bonus, relocation bonus, equity, or other bonuses currently</li><li><b>Relocation:</b> Round trip flight from/to permanent residence</li><li><b><span class=\"long-word\">Housing/Transportation:</span></b> You must provide your own living arrangements and transportation in the local area</li><li><b>Background Check:</b> All offers of employment are contingent on clearing a background check</li><li><b>Publications:</b> This internship may involve access to and/or knowledge of Lucid confidential and proprietary information. As a requirement of accepting an offer of employment with Lucid Motors, you will agree to keep all such information confidential and not disclose such information to any third party including but not limited to research papers, thesis, dissertation, school papers or any other publication in any form without prior written approval from Lucid Legal Department.</li></ul></ul></div><div> Be part of something amazing</div><div><br></div><div> Come work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we're providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.</div><div><br></div><div> At Lucid, we don't just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace and is an affirmative action employer. &nbsp;We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.</div><div><br></div><div><i>To all recruitment agencies: Lucid Motors does not accept agency resumes. Please do not forward resumes to our careers alias or other Lucid Motors employees. Lucid Motors is not responsible for any fees related to unsolicited resumes.</i> <b><i>&nbsp;</i></b></div></div></div>",
        "index": 3,
        "skills": [
            "project management",
            "information technology",
            "software engineering",
            "python",
            "c and c++",
            "machine learning"
        ],
        "compensation": "paid",
        "start": "2021-11-26T10:00:00.000Z",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Business Intelligence Student Worker",
        "company": "Intel",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9fc2f577d72c4f684a59d505da31a64a?lvk=4ZXf3GqyxkKQnQxoBQOUZw.--M4ips3L-3",
        "posted": "2021-06-21T18:08:42.309Z",
        "lastScraped": "2021-06-28T18:08:42.309Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>The Infrastructure Design Enabling team within Visual and Machine Learning IP group, provides the Graphics Back-end Execution teams with the necessary Infrastructure related Tools, Flows and Methodologies. As part of our activities, we are in charge of extracting and managing Execution technical and operative metrics as well as generating PowerBI based dashboards for multiple areas of Graphics Design.<br><br>In this position, the candidate will have the opportunity to have a direct impact on efficiency and productivity of Graphics design process while learning from applied Business Intelligence, Database Management and query optimization.</p><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school <span class=\"long-word\">work/classes/research</span> and/or relevant previous job and/or internship experiences.<br><br><b>Minimum Qualifications</b>:</p><ul><li>Bachelor degree student in Computer Science, Computers Engineering or <span class=\"long-word\">Electrical/Electronics</span> Engineering or related engineering field.</li><li>6+ months of academic experience in SQL/mySQL database knowledge.</li><li>Availability to work at least 24 hours per week (remotely).</li><li>Intermediate English level.</li><li>Candidate must have unrestricted permanent right to work in Costa Rica</li></ul><p><br><b>Preferred Qualifications:</b></p><ul><li>Masters degree student in Computer Science with Computers Engineering or <span class=\"long-word\">Electrical/Electronics</span> Engineering degree.</li><li>Experience with Agile/Scrum, Python, SQL/mySQL and MS PowerBI.</li><li>Advanced English level.</li><li>VLSI knowledge.</li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (Costa Rica)<p></p><p></p>Primary Location:&nbsp;Costa Rica, San Jose<p></p><p></p>Additional Locations:<p></p><p></p><p></p><p></p>Business group:Intel Architecture, Graphics, and Software (IAGS) brings Intel's technical strategy to life. We have embraced the new reality of competing at a product and solution level-not just a transistor one. We take pride in reshaping the status quo and thinking exponentially to achieve what's never been done before. We've also built a culture of continuous learning and persistent leadership that provides opportunities to practice until perfection and filter ambitious ideas into execution.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>",
        "index": 4,
        "skills": [
            "machine learning",
            "software engineering",
            "sql",
            "data visualization",
            "python",
            "project management",
            "virtual reality",
            "information technology"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": true
    },
    {
        "position": "Graphics Structural Design Engineer Student",
        "company": "Intel",
        "location": {
            "city": "San Jose",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/49c56669fd903f688131e9b10e39ad8e?lvk=nEiEBklvo-pFPzw8aCpGNg.--M4dmnDG4N",
        "posted": "2021-06-25T18:08:43.077Z",
        "lastScraped": "2021-06-28T18:08:43.077Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>If you are studying to get an engineering major or master's degree in Electric-Electronic Engineering, computer sciences or embedded systems, you are within 2 year of getting your university degree then you want to take a look at this position.<br>Our group: IAGS (Intel Architecture, Graphics and Software) Supergroup, is responsible for design and development of Graphics, Media and Display IPs as well as discrete Graphics SoCs (GPUs), targeting both Client Device and Datacenter markets. In this position you will be part of a world-class Silicon design organization working with a team of highly talented engineers working on cutting-edge IP architectures, advanced Silicon design and process technologies, with tremendously exciting opportunities for industry-leading engineering innovations.<br>Job Description: Working on Synthesis with Synopsys Design Compiler DCT. Driving Multiple Power Domain Analysis using standard Power Formats UPF/CPF.Drive Place and Route and clock tree synthesis with Synopsys ICC2 Perform Static Timing Analysis with Synopsys PrimetimeDrive Formal equivalence. Perform Layout Verification and DRC analysis.DFT, Scan Insertion, and coverage analysis</p><p></p><p>The candidate should possess the below soft skills:</p><ul><li>Be able to follow self-paced trainings</li><li>Effectively communicate, interact, and align with business partners, team members and customers in fluent written and spoken English.</li><li>Able to handle ambiguity, dynamic environments, and schedule pressure</li><li>Problem solving skills</li><li>Work in large teams and collaborate</li></ul><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school <span class=\"long-word\">work/classes/research</span> and/or relevant previous job and/or internship experiences.</p><p></p><p><b>Minimum Qualifications:</b></p><ul><li>Studying Bachelor's Degree, \"Licenciatura\" or Master's Degree in Electronic, Electrical engineering, Computer Science</li><li>Graduating in approximately 1 year</li><li>Proven experience of at least 6 months in any related topic such as but not limited to: VLSI, APR tools, ASIC design, digital design, DRC convergence (School or previous assignment)</li><li>Fluency in written and spoken English (Intermediate to Advanced Level)</li><li>Immediate availability for part time work</li><li>Experience (academic) scripting languages: Python and TCL.</li><li>Candidate must have permanent unrestricted right to work in Costa Rica</li></ul><p><br><b>Preferred Qualifications:</b></p><ul><li>Experience with Synopsys suite basics or PERL</li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (Costa Rica)<p></p><p></p>Primary Location:&nbsp;Costa Rica, San Jose<p></p><p></p>Additional Locations:<p></p><p></p><p></p><p></p>Business group:Intel Architecture, Graphics, and Software (IAGS) brings Intel's technical strategy to life. We have embraced the new reality of competing at a product and solution level-not just a transistor one. We take pride in reshaping the status quo and thinking exponentially to achieve what's never been done before. We've also built a culture of continuous learning and persistent leadership that provides opportunities to practice until perfection and filter ambitious ideas into execution.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>",
        "index": 5,
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "machine learning",
            "virtual reality"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Scholarly Activity Coordinator",
        "company": "University of California Riverside, Bourns College",
        "location": {
            "city": "Riverside",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/4e8b99c52ddf38ad5281373de36c0ace?lvk=dtXKlp8WodY9G5nl73YNZw.--M4ijhI0A3",
        "posted": "2021-06-26T18:08:43.811Z",
        "lastScraped": "2021-06-28T18:08:43.811Z",
        "description": "<div><div><p>Scholarly Activity Coordinator</p><p></p><p></p><p> Job Number Full/Part Time Schedule Salary</p><p></p><p> 23206224 Full Time 8AM - 5PM $45,300 - $78,400</p><p></p><p></p><p>Position Information</p><p>Responsibilities for the Scholarly Activity Coordinator to include overall support for scholarly projects to include Practice Improvement Projects (PIP's), tracking and monitoring of submission and approval of IRB applications by students. Provide support for the Director of Scholarly Activity, students in the MD/PhD program, Evidence Based Medicine (EBM) thread, and Med Ed Research endeavors by faculty. Coordinate and support for the Stroberg research seminar series. Assist with duties within pre-clerkship and support the threads and emphasis.</p><p> Education</p><p> Education Requirements</p><p> Degree Requirement</p><p></p><p>Bachelor's degree in related area and/or equivalent <span class=\"long-word\">experience/training.</span> Required</p><p></p><p></p><p></p><p>Experience</p><p></p><p> Experience Requirement</p><p> 2 - 4 years of related experience. Required</p><p></p><p> Prior experience working with medical students. Preferred</p><p></p><p> Years of related experience can be satisfied by working with postgraduate students, internship placement, scheduling of students, working within a clerkship program, graduate education program or by performing work in an administrative role coordinating programs and schedules. Required</p><p></p><p></p><p></p><p>Minimum Requirements</p><p>Basic knowledge of administrative analysis and operations research. Acquiring skills in developing and implementing processes and systems. Familiarity with the administrative and operational implications in a program. Investigative, data analysis, and reporting skills. Ability to generate computer reports, checking for errors, correcting and submitting accurate reports. Skills include entering, maintaining, extracting, and analyzing data in electronic systems. Basic knowledge of relevant policies and regulatory requirements. Basic knowledge of health professions education industry. Communication skills; includes verbal, written and active listening. Service oriented and responsive to questions and requests. Ability to interact in a professional, resourceful, and courteous manner. Demonstrated interpersonal skills. Demonstrated ability to develop working relationships within department and with learners. Excellent organizational skills, analytical, and demonstrated attention to detail. Ability to work with extremely complex faculty <span class=\"long-word\">calendars/schedules</span> requires extremely well organized and detail oriented precision. Ability to multi-task. Skills in judgment, decision-making and problem solving. Ability to demonstrate professional behavior by exhibiting sound work habits, having thorough knowledge of <span class=\"long-word\">policies/procedures,</span> employing proper communication between programs and departments. Promotes teamwork and provides a sense of leadership by participating in various integral committees with the department and the institution.</p><p> Preferred Qualifications</p><p>Knowledge of educational technology and systems. Ability to troubleshoot and triages related technology issues.</p><p>Knowledge of college/school policies, procedures and requirements.</p><p></p><p>Additional Information</p><p>In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel.</p><p>UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.</p><p></p><p> + UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.</p><p></p><p> + UC Riverside is the top university in the United States for social mobility. - U.S. News 2020</p><p></p><p> + UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.</p><p></p><p> + Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019</p><p></p><p> + Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings</p><p></p><p> + UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.</p><p></p><p></p><p> The University of California is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.</p><p> For information about our generous employee benefits package, visit: Employee Benefits Overview <span class=\"long-word\">(https://ucnet.universityofcalifornia.edu/compensation</span>-and-benefits)</p><p></p></div></div>",
        "index": 6,
        "skills": [
            "information technology",
            "project management"
        ],
        "compensation": "paid",
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Pharmacist",
        "company": "PeaceHealth",
        "location": {
            "city": "Bellingham",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c52da873ba2b70dd134335ee8382b576?lvk=rBJWoXcsxn0o4o0j7xJHsQ.--M4ihUUqEg",
        "posted": "2021-06-21T18:08:44.543Z",
        "lastScraped": "2021-06-28T18:08:44.543Z",
        "description": "<div><div><p>Description</p><p> PeaceHealth is seeking a Pharmacist for a Part Time, Night position. Hourly compensation starts at $55.23, more depending on experience.</p><p> Summary:This position is responsible for performing all necessary functions to ensure optimal use of medications to achieve specific outcomes that improve a patient's quality of life. Functions included in providing compassionate pharmaceutical care are both cognitive and medication distribution related and include: dispensing and distributing drugs; advising physicians and patients regarding proper usage of prescribed drugs; collaboration with other healthcare professional to plan, monitor, review and evaluate patient effectiveness; monitoring patients for side effects and drug interactions.</p><p> Detailed responsibilities:* Detect, monitor and report adverse drug events and medication errors (EIR).* Dispenses the final product for administration and performs patient counseling.* Evaluates drug therapy for appropriateness and makes drug therapy recommendations to clinician.* Interprets, clarifies and rectifies physician medication and IV orders, including the medication reconciliation process.* Interprets, clarifies and rectifies prescriptions and selects medications for outpatient dispensing.* Monitors all patients on specified target drugs and initiates pharmacokinetic dosing protocols.* Participate in development of drug protocols and clinical pathways.* Perform drug usage evaluations on selected drugs and reports results to the Pharmacy &amp; Therapeutics Committee. Completes quality assurance auditing as required for prescriptive authority.* Prescribes drug therapy per collaborative drug therapy management agreements/Medical Executive Committee approved protocols.* Reviews medication orders for appropriateness and accuracy including, but not limited to: contraindications, allergies, dose, route, frequency, duplicate therapy and formulary status.* Supervise and train pharmacy technicians to assure accurate order entry, preparation and proper technique.* Supervise and trains pharmacy interns and externs. May serve as preceptor for the intern or extern as defined by the State Board of Pharmacy.* Current Registered Pharmacist license required in the state of WA on date of hire.* Performs other duties as assigned.</p><p> Qualifications <span class=\"long-word\">Education:Essential:*</span> Bachelor's Degree Education equivalent <span class=\"long-word\">experience:Essential:*</span> Graduate of an Accreditation Council for Pharmacy Education (ACPE)- accredited School of Pharmacy with a Bachelor of Science degree in Pharmacy/Doctor of Pharmacy (PharmD) degree required. Education <span class=\"long-word\">specialization:Essential:*</span> Bachelor of Science in Pharmacy</p><p> <span class=\"long-word\">Credentials:Essential:*</span> Pharmacist - Washington</p><p></p><p>Other <span class=\"long-word\">information:Experience/Training</span> Requirements-Demonstrated basic pharmacy clinical skills. -Demonstrated customer services skills.-BLS and ACLS/PALS certification preferred.Other <span class=\"long-word\">Skills/Requirements</span>-Basic computer and keyboarding skills including MS Office applications-Ability to identify medications and to read graduation marks on syringes and flasks-Strong planning, prioritizing and organizational skills-Excellent communication skills both verbal and written-Ability to think and act independently-Strong mathematical and analytical skills</p><p> Working Conditions Work is performed under normal working conditions with adequate lighting and ventilation. Reasonably anticipated exposure to blood and body fluids. Work involves exposure to hazardous medication and/or sharp instruments. Ability to lift objects weighing 30 lbs. or less. Duties require the ability to concentrate and pay close attention to detail (more than 65% of work time). Work requires fairly light physical exertion up to 33% of the time.</p><p> See how PeaceHealth is committed to Inclusivity, Respect for Diversity and Cultural Humility <span class=\"long-word\">(https://www.thecaregiver.org/wp</span>-<span class=\"long-word\">content/uploads/2017/05/PeaceHealth</span>-Statement-of-Commitment-to-Diversity-and-Inclusion-vFINAL.pdf) .</p><p> For full consideration of your skills and abilities, please attach a current resume with your application. EEO Affirmative Action <span class=\"long-word\">Employer/Vets/Disabled</span> in accordance with applicable local, state or federal laws. REQNUMBER: PH-INFOR-7843</p></div></div>",
        "index": 7,
        "skills": [
            "project management",
            "information technology",
            "cybersecurity"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "ENGINEERING TECHNICIAN",
        "company": "Naval Sea Systems Command",
        "location": {
            "city": "Silverdale",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/59584c7f4112ee3a21a3c90a7cafcb98?lvk=W5WwIXZ4wxUXgTd9R9yNSg.--M4p8U-4gs",
        "posted": "2021-06-10T18:08:45.259Z",
        "lastScraped": "2021-06-28T18:08:45.259Z",
        "description": "<div><p>Summary You will serve as an ENGINEERING TECHNICIAN in the Range Operations Branch of the Pacific Northwest Range Management and Operation Division of the Systems Acceptance and Operational Readiness Department of NAVUNSEAWARCENDIV KEYPORT WA. Pay Ranges: GS-09: $58,535 to $76,094 GS-10: $64,460 to $83,803 Responsibilities You will identify problems and propose solutions and communicate the impact of these to the Senior or Lead Engineering Technician. You will be responsible for project execution and the proper use of project funds and project tasking as assigned. </p><p>You will use state-of-the art electrical, pneumatic, mechanical, electrohydraulic, acoustic, computer based programs and solve engineering problems that are complex in nature. You will provide fire control technical support for the projects and have knowledge of the processes and the external environment associated with the fire control competency area. You will have knowledge of engineering test plans, and be able to maintain technical competency and qualifications to apply this knowledge on and off Pacific Northwest ranges in order to achieve customer objectives. </p><p>You will be able to work and perform in a fast-paced, high stress environment while maintaining control of the myriad of systems supporting the Pacific Northwest range operations. Requirements Conditions of Employment Qualifications FOR THE GS-10: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level in the Federal service or equivalent experience in the private or public sector applying a wide range of technical engineering principles in support of work in the preparation and maintenance of range systems such as Undersea Weapon systems, launch platforms, torpedoes, (MK48, MK48 ADCAP, MK54), mines, (MK60, SLMM, ISLMM), mobile targets, (MK30), and/or specially designed one-of-a-kind test vehicles, (GTV, XTV, R&amp;D UUV). FOR THE GS-09: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-08 grade level in the Federal service or equivalent experience in the private or public sector applying technical engineering techniques and practices to evaluate methods for problem resolution for preparation and maintenance of undersea range systems. </p><p>Additional qualification information can be found from the following Office of Personnel Management website: <span class=\"long-word\">https://www.opm.gov/policy</span>-data-<span class=\"long-word\">oversight/classification</span>-<span class=\"long-word\">qualifications/general</span>-schedule-qualification-standards/#url=GS-TECH. <span class=\"long-word\">https://www.opm.gov/policy</span>-data-<span class=\"long-word\">oversight/classification</span>-<span class=\"long-word\">qualifications/general</span>-schedule-qualification-<span class=\"long-word\">standards/0800/engineering</span>-technical-series-0802/ Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. </p><p>Education Additional Information This position is covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. </p><p>If you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: <span class=\"long-word\">http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf</span> Only Military Spouse Preference applicants currently occupying positions for which a comprehensive training plan has been developed and authorized are entitled to exercise their priority status for this announcement. </p><p>The most common formal training positions are apprentices, formal interns, and scientist and engineering interns. Upward Mobility Positions that have equivalent training plans are also included when the positions have been pre-identified in an Affirmative Action or similar plan. You must provide documentation supporting you are in a formal training plan (e.g., SF50 and official signed training agreement between you and your command). </p><p>This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Vacancies filled from this announcement may be filled at any grade level listed. If selected below the full performance level, you may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. </p><p>Promotion is neither implied nor guaranteed. This position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.</p></div>",
        "index": 8,
        "skills": [
            "project management",
            "software engineering",
            "information technology"
        ],
        "compensation": "unpaid",
        "remote": false
    },
    {
        "position": "Mental Health Therapist - Clinician III - (Edmonds/Everett)",
        "company": "Compass Health",
        "location": {
            "city": "Edmonds",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-e685e2f8/mental-health-therapist-clinician-iii-edmonds-everett-5a95b769?lvk=8uNu_yi7qMdulC3TgTcDbQ.--M4RrLEq6F",
        "posted": "2021-06-23T18:08:46.430Z",
        "lastScraped": "2021-06-28T18:08:46.430Z",
        "description": "<div><div><div><div></div></div></div><div><div><div><div><div><div><p><strong>CLINICIAN III (EDMONDS &amp; EVERETT) </strong></p><p>Compass Health is currently looking for a <strong>Clinician III for our Aurora House &amp; Greenhouse locations!</strong> </p><p>The Clinician III works in conjunction with the Program Manager to ensure that staff of the Residential Treatment Facilities (RTF) have appropriate supervision and that clients receive high quality clinical care. This position provides a range of clinically indicated services including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults/older adults with behavioral health conditions. This position is responsible for assessing client functioning and needs, and partnering with the client and the care team to develop an individually tailored care plan designated to promote recovery. This position is responsible for ensuring consistent and appropriate clinical programming at the RTFs. This position will also provide clinical supervision to mental health technicians and/or interns as needed. </p><p><strong>POSITION SUMMARY</strong> </p><p>Job Title: Clinician III <br>Program: 350-52250 – Aurora House &amp; Green House <br>Location: Edmonds (Aurora House ) &amp; Everett (Green House) <br>Hours: Part Time (Temporary) 20 Hours/Week<br>Wage: DOE </p><p><strong>REQUIREMENTS</strong> </p><ul><li>MA/MS/MSW Degree in a Behavioral Science related field.  </li><li>Current Washington State Li-censure or equivalent in Social Work, Marriage &amp; Family Therapy, or Mental Health Counseling required. </li><li>Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn. </li><li>Washington State Approved Supervisor Training must be completed prior to providing clinical supervision.  </li><li>Valid Washington State Driver’s License including vehicle and appropriate insurance, if applicable.  </li></ul><p> <strong>KNOWLEDGE / SKILLS / ABILITIES</strong> </p><p> · Ability to work effectively with individuals with complex needs and multi-system involvement. </p><ul><li>Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems. </li><li>Demonstrated organizational skills and the ability to multitask within a fast-paced environment. </li><li>Excellent communication skills, written and verbal.  </li><li>General computer proficiency, including the ability to utilize electronic medical record systems.  </li><li>Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS. </li></ul><p><strong>ABOUT COMPASS HEALTH:</strong> </p><p>Compass Health is the region’s largest private, non-profit organization providing mental health and substance use services in Snohomish, Skagit, Island, San Juan, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesn’t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org</span> </p><p> </p><p><em>Compass Health is an Equal Opportunity Employer</em> </p><p></p></div></div></div></div></div></div></div>",
        "index": 9,
        "skills": [
            "machine learning",
            "project management",
            "information technology"
        ],
        "remote": false
    },
    {
        "position": "Mental Health Counselor- Adult OP (Everett)",
        "company": "Compass Health",
        "location": {
            "city": "Everett",
            "state": "Washington",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f225b083e0a530eb19f058ffe1e8baea?lvk=eFBb3uCXk5h5FBeZi51nkw.--M4P96Pl-B",
        "posted": "2021-06-23T18:08:47.197Z",
        "lastScraped": "2021-06-28T18:08:47.197Z",
        "description": "<div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><p><strong>MENTAL HEALTH COUNSELOR (EVERETT)&nbsp;</strong> - 40 Hours/week</p><p><strong>THE ORGANIZATION</strong></p><p>Compass Health was established in 1902 as Parkland Lutheran Children's Home. &nbsp;For more than 10 decades we have grown to providing more than 22,000 people with comprehensive behavioral healthcare, housing, and integrated healthcare each year. &nbsp;We are committed to serving the vulnerable members of our community, including those who are overlooked and underserved by traditional health systems, by creating hope, promoting recovery, and advancing whole person health. &nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>THE TEAM</strong></p><p>The Everett Adult Outpatient team is a close and inclusive bunch that work together to provide wellness, hope and recovery to our community while also having fun as a team. We are looking for someone to join our team that shares our passion and mission to the community. We are passionate about serving adults in Snohomish county with dignity and respect. We pride ourselves in providing quality care to this population while also caring for each other on the team.</p><p><strong>&nbsp;C<strong><strong><em>ompass Health is able to provide supervision hours for the licensed social work and mental health counselor licensing requirements.</em></strong></strong></strong></p><p><strong>THE LOCATION:</strong></p><p>The Everett Adult Outpatient building is in a great location in Downtown Everett within walking distance to various restaurants and coffee shops. &nbsp;Often our team will take a lunchtime stroll through the historical neighborhoods in nice weather.&nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>POSITION SUMMARY</strong></p><p>Compass Health is currently looking for a <strong>Clinician II / Mental Health Counselor for our Everett Adult Outpatient facility</strong>. The Clinician II / Mental Health provider provides a range of clinically indicated services including but not limited to individual psychotherapy, group therapy, and case management services for adults/older adults with behavioral health conditions. This position is responsible for assessing client functioning and needs, and partnering with the client to develop an individually tailored care plan designed to promote recovery. This position may also provide clinical support to Interns as appropriate.&nbsp;</p><p>&nbsp;<br>&nbsp;</p><p><strong>OTHER REASONS TO JOIN THE TEAM:</strong></p><ul><li>16 days of paid vacation the first year<em>&nbsp;(Pro-rated based on number of hours worked for part time)</em></li><li>12 days of sick leave the first year <em>(Pro-rated based on number of hours worked for part time)&nbsp;</em></li><li>10 paid holidays - 8 regular and 2 that you choose</li><li>Medical, Dental &amp; Vision Plans <em>(Employee premium paid in full for 30 hours a week and above)</em></li><li>3% contribution after one year <strong><em>plus</em></strong> up to 2% match for the 403B Retirement plan the first year</li><li>100% Vested in the 403B Retirement plan on first contribution</li></ul><p><br></p><p>Job Title: Clinician II / Mental Health Counselor<br>Program: 200-52700 - Everett Adult OP<br>Location: Everett<br>Hours: Full-Time (40 hours/week)<br>Wage: $19.53 - $36.12/hour, DOE<strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>REQUIREMENTS</strong><br><br> MA/MS/MSW Degree in a Behavioral Science related field.<br> Qualifies as a Mental Health Professional (MHP) as defined by WAC.<br> Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn.<br> Individuals who do not already hold a license or associate license through the Washington State Department of Health must submit Agency Affiliated Counselor application upon hire and be approved by the DOH.<br> Ability to work effectively with individuals with complex needs and multi-system involvement.<br> General computer proficiency, including the ability to utilize electronic medical record systems.<br> Ability to pass pre-employment criminal background check.</p><p><br></p><p><strong>WORK SCHEDULE:</strong></p><p>This is a full-time position that offers some flexibility in work schedule. &nbsp;We have a traditional work week and we do not typically have appointments with clients after 5pm. We have excellent COVID safety protocols!</p><p><br></p><p><em>Compass Health is an Equal Opportunity Employer</em></p><p>&nbsp;</p><p><br>&nbsp;&nbsp;</p></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div>",
        "index": 10,
        "skills": [
            "c and c++",
            "machine learning",
            "project management",
            "cybersecurity"
        ],
        "compensation": "paid",
        "remote": false
    },
    {
        "position": "Information Technology Intern",
        "company": "City of Ontario",
        "location": {
            "city": "Ontario",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9fd52fbdab69fba087e7bd0d515752cf?lvk=1k2xPMGHkya1WR4PJ0OG2A.--M4UGlxXjw",
        "posted": "2021-06-21T18:08:47.961Z",
        "lastScraped": "2021-06-28T18:08:47.961Z",
        "description": "<div><div> The Position <p></p><div> &nbsp; </div><div><strong>Information Technology Intern</strong></div><br>The City of Ontario Information Technology Department has an excellent part-time, internship opportunity for a motivated individual interested in gaining valuable training and experience needed to enter the field of Information Technology. The Information Technology Intern will assist with supporting IT staff with operational assignments and tasks. This position plays a vital role in the City's ability to effectively and professionally communicate with the public as well as to create a convenience alternative for conducting City business. <br>&nbsp; <br>The ideal candidate will have a passion for learning and a desire to gain valuable, hands-on IT experience in a public sector setting. Working alongside technical support staff, the IT&nbsp;Intern will be exposed to a wide range of technical assignments and IT projects including the City's IT Help Desk, asset management, e-waste processing, hardware, computer peripherals, desktop rollouts, and software upgrades. <br><br>The Administrative Intern is a part-time/temporary position, scheduled to work no more than 29 hours per week, and&nbsp;is not eligible to participate in the City's health insurance or retirement plans.&nbsp;Interns have the ability to observe in and participate in a variety of tasks that support the overall operation of the assigned department. As with any internship&nbsp;experience, individuals with a&nbsp;desire&nbsp;to learn as much as&nbsp;possible from experienced employees&nbsp;will&nbsp;have&nbsp;the greatest benefit from&nbsp;their internship&nbsp;experience. <br><br><div><em>The City of Ontario reserves the right, if necessary, to accept applications from the first one hundred (100) qualified applicants for this position.</em></div><br><strong>Background Check Requirement</strong><br><br>As part of their&nbsp;duties, Administrative Interns assigned to&nbsp;Information Technology may be assigned to work in the Ontario Police Department facilities and will have access to Police Department information systems. As a result, employment&nbsp;in this&nbsp;position is&nbsp;subject to&nbsp;the satisfactory completion of a background investigation conducted by the Ontario Police Department. This background investigation&nbsp;will include the passing of a polygraph test. Candidates may be disqualified from further consideration during the background investigation for a variety of reasons including but not limited to: an excessive number of traffic citations and/or collisions; arrests and/or convictions; a history of illegal substance abuse; poor credit history (factors include bankruptcy, foreclosures, liens, repossessions, and recency); or thefts from a previous employer. For clarification of any of the above disqualifying reasons, please call Police Department Background Unit at (909) 408-1820. The following list describes some areas that are covered in the background investigation: <br>&nbsp; <ul><li>Your relatives, references, and acquaintances are asked to comment on your suitability for this position.</li><li>The information supplied regarding your educational history is examined and verified.</li><li>You must list a history of your residences.</li><li>Your work history and experience are examined with regard to your dependability, relationships with fellow workers, trustworthiness, and general job performance.</li><li>Military service records are subject to verification.</li><li>The background investigation considers your management of personal finances (however, being in debt does not automatically disqualify you).</li><li>Your criminal, driving, and insurance records are evaluated.</li></ul>&nbsp; <div><strong>The City of Ontario&nbsp;</strong><br><br>The City of Ontario is a dynamic leading community in the Inland Empire with a variety of full-time and part-time employment and volunteer opportunities. Ontario enjoys the reputation of being a progressive City which provides solid leadership to its citizens and to the business community. The City provides a full range of services to the community including; Police, Fire, Administrative Services, Community Services, Development, Economic Development, Housing, and the Ontario Municipal Utilities Company. The City's team is staffed with approximately 1,100 full-time and 200 part-time diverse and talented employees who work to support a common goal of providing excellent service to the community. <br><br>We invite you to learn more about the City of Ontario by reviewing the City's website. A few useful links are also listed below: <br><br> Approach to Public Service (Core values for City of Ontario employees) <br><br> <span class=\"long-word\">OntarioCityEmployees.org</span> (Information about City of Ontario employee benefit plans) <br><br> The Ontario Plan (The City's Comprehensive Business Plan for Development) </div>&nbsp; <div> &nbsp; </div><p></p> Examples of Essential Functions <p>The essential functions typically performed by the Administrative Intern assigned to the Information Technology Department include the following:<br><br></p><ul><li>Images and&nbsp;configures computers and other related equipment for City staff.</li><li>Assists with answering the HelpDesk phone line and monitoring online request tickets.</li><li>Troubleshoots technical issues related to computers, laptops, phones, and other devices.</li><li>Maintains and reviews City equipment asset database.</li><li>Assists with maintaining City surplus and e-waste equipment.</li><li>Assists members of management, professional, and technical staff by performing basic administrative and technical assignments.</li></ul><p></p> Qualification Guidelines <p><strong>Education</strong><br><br>Equivalent to completion of two years of college at an accredited college/university with major course work in&nbsp;Business Administration, Computer Science, Computer Information Technology, or a related field.<br><br><strong>Licenses</strong><br><br>Valid California Class C driver's license and an acceptable driving record at the time of appointment and throughout employment.&nbsp;<br><br><strong>Special Requirements</strong><br><br>Basic knowledge of devices such as computers, laptops, mobile phones, and printers. Knowledge of operating systems and programs including Windows and Microsoft Office.&nbsp;<br><br><strong>Desirable</strong><br><br>Current enrollment in upper division courses of a Bachelor's Degree program related to Computer Science, Computer Information Technology, or a related field. Previous work or internship experience with a local, county, or other government agency. Experience with SQL queries, mapping with the ArcGIS software suite, and/or programming with Python, JavaScript or similar programming languages.<br><br><strong>Background Investigation</strong><br><br>Candidates must demonstrate the ability to successfully complete a comprehensive background investigation conducted by the Ontario Police Department.</p><div> &nbsp; </div><p></p> Supplemental Information <p><strong>How to Apply</strong><br><br>Apply online by clicking on the \"Apply\" link at the top of this announcement. If this is the first time applying for a position using&nbsp;<span class=\"long-word\">governmentjobs.com,</span>&nbsp;you will be prompted to create a new user account, otherwise log in with your user name and password. Your application and responses to any supplemental questions will be used to evaluate your qualifications for this position.&nbsp;It is suggested that your application include the following:</p><ul><li>List any relevant experience and education that demonstrates that&nbsp;you&nbsp;qualify for the position.</li><li>List all periods of employment for at least the past 10 years, beginning with your most recent or present employer (including, if applicable, all employment with the City of Ontario).</li><li>Separately list each position held, including different positions with the same employer.</li></ul><br>A resume may be attached to your application&nbsp;but will not substitute for the&nbsp;proper completion of your application. Applications that are not properly completed&nbsp;may be&nbsp;rejected.&nbsp; <br><br><strong>NOTE:&nbsp;</strong>Transcripts from colleges, universities or technical schools&nbsp;outside of the United States must be assessed for U.S. equivalency by a&nbsp;NACES&nbsp;educational credential evaluation service. Failure to provide a transcript or credential evaluation report will result in your application being rejected and you will not be able to continue in the selection process for this position. <br><br><strong>Email Notices</strong><br><br>Email is the primary way that the Human Resources or Hiring Department will communicate with you. Please check your email account (including the SPAM folder) on a regular basis for any emails related to the application or selection process. Emails from the City of Ontario will come from \"@ontarioca.gov\" or \"<span class=\"long-word\">governmentjobs.com.</span>\" If you change your email address after submitting your application please visit governmentjobs.com and update your profile. <br><br><strong>Frequently Asked Questions</strong><br><br>If&nbsp;you have any additional questions regarding the application process, please refer to our&nbsp; Frequently Asked Questionspage. <div> &nbsp; </div>&nbsp; <div> &nbsp; </div><p></p></div></div>",
        "index": 11,
        "skills": [
            "project management",
            "information technology",
            "sql",
            "javascript",
            "hardware",
            "c and c++",
            "python",
            "machine learning"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "RF Engineering Intern",
        "company": "Cubic",
        "location": {
            "city": "San Diego",
            "state": "California",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a1de7110b32a69a1aad012451c652510?lvk=Nncbn7d0-kK8VzcNearP2A.--M4dmUW613",
        "posted": "2021-06-25T18:08:48.794Z",
        "lastScraped": "2021-06-28T18:08:48.794Z",
        "description": "<div><div><b>Business Unit:</b><p></p><p></p>Cubic Mission and Performance Solutions<p></p><p></p><b>Company Details:</b><p></p>Cubic offers an opportunity to provide innovative technology for government and commercial customers around the globe, helping to solve their future problems today. We're the leading integrator of payment and information technology and services for intelligent travel solutions worldwide, and the leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations. If you have an entrepreneurial spirit and thrive in an innovative environment, we want to talk to you about your next role at Cubic! We are seeking employees inspired by technology, and motivated by the rewards of hard work, commitment, teamwork, quality, integrity, and respect. We invite you to explore opportunities with Cubic.<p></p><p></p><b>Job Details:</b><p></p><p><b>Job Summary:</b></p><p></p><p>While seeking a degree in electrical engineering, supports the analysis, design, modification and testing of electronic systems for designated products and/or customer applications.&nbsp; This position typically works under close supervision and direction.</p><p></p><p><b>Essential Job Duties and Responsibilities:</b></p><p></p><p> Supports the analysis, design, modification and testing of electronic systems for designated products and/or customer applications<br> Assists in technical support<br> Assists with system tests<br> Obtains, correlates and analyzes technical information<br> Prepares engineering documentation&nbsp;<br> Supports, as required, total quality <span class=\"long-word\">management/continuous</span> process improvement teams</p><p><br><b>Minimum Job Requirements:</b></p><p></p><p>Enrolled in at least the second year of a Bachelor of Science degree program in engineering, computer science or other related technical discipline.&nbsp; Effective written and oral communication skills.&nbsp; Ability to use typical office automation products such as word processing and spreadsheets.&nbsp; Must be able to work in a lab environment and be able to use a computer.</p><p></p><p>The description provided above is not intended to be an exhaustive list of all job duties, responsibilities and requirements.&nbsp; Duties, responsibilities and requirements may change over time and according to business need.</p><b>Worker Type:</b><p></p>Employee</div></div>",
        "index": 12,
        "skills": [
            "information technology",
            "software engineering",
            "networks",
            "project management"
        ],
        "qualifications": [
            "Bachelor's degree"
        ],
        "remote": false
    },
    {
        "position": "Sodexo Intern",
        "company": "Sodexo Inc.",
        "location": {
            "city": "Houston",
            "state": "Texas",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5474115ff553fa7339925c3b63a9b13d?lvk=DgeHF9PaaNw-Pz3snbr3gQ.--M4mDhgnx3",
        "posted": "2021-06-26T18:08:49.495Z",
        "lastScraped": "2021-06-28T18:08:49.495Z",
        "description": "<div><div><p><strong>Position Summary</strong></p><p>The Sodexo Intern will perform and train in various responsibilities under their career concentration. The general responsibilities of the position include those listed below, but Sodexo may identify other responsibilities of the position. These responsibilities may differ among accounts, depending on business necessities and client requirements.</p><p><strong>General Responsibilities:</strong></p><p></p><ul><li> Assists maintenance workers, foodservice employees engaged in cleaning, maintaining, cooking or serving at facilities of commercial, health care, school, residence hall or other establishments. + Assists in daily operations. + Learns how to operate and maintain equipment on an as-needed basis. + Performs day-to-day assignments. + Maintains and observes department's guidelines. + May provides feedback on guidelines. + May be assigned special projects. + May assist in calculating recipes and preparing special formulas. + May assist with the checking of patient trays and Feeding Program boxes. + May update patient lists/labels on a daily basis. + Attends weekly menu group and assists patients in filling out menus. + Completes formula inventory as assigned. + May be part of a formal Sodexo internship program. Complies with all company safety and risk management policies and procedures. + Reports all accidents and injuries in a timely manner. + Participates in regular safety meetings, safety training and hazard assessments. + Complies with all Sodexo HACCP/OSHA and/or local policies and procedures. + Complies with all company safety and risk management policies and procedures. + Attends training programs (classroom and virtual) as designated. + May perform other duties and responsibilities as assigned.</li></ul><p></p><p><strong>Qualifications &amp; Requirements</strong></p><p></p><ul><li> Willingness to be open to learning and growing. + Maturity of judgment and behavior. + Maintains high standards for work areas and appearance. + Maintains a positive attitude. + Ability to work a flexible schedule helpful. + Must comply with any dress code requirements. + Must be able to work nights, weekends and some holidays. + Attends work and shows up for scheduled shift on time with satisfactory regularity.</li></ul><p></p><p><strong><span class=\"long-word\">Experience/Knowledge:</span></strong></p><p></p><ul><li> In pursuit of a degree. + No experience required.</li></ul><p></p><p><strong>Skills/Aptitude:</strong></p><p></p><ul><li> Presents self in a highly professional manner to others and understands that honesty and ethics are essential. + Ability to maintain a positive attitude. + Ability to communicate with co-workers and other departments with professionalism and respect. + Maintains a professional relationship with all coworkers, vendor representatives, supervisors, managers, customers, and client representatives. + Ability to use a computer.</li></ul><p></p><p><strong>Physical Requirements:</strong></p><p></p><ul><li> Close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus, with or without corrective lenses. + Significant walking or other means of mobility. + Ability to work in a standing position for long periods of time (up to 8 hours). + Ability to reach, bend, stoop, push and/or pull, and frequently lift up to 35 pounds and occasionally lift/move 40 pounds.</li></ul><p></p><p><strong>Working Conditions (may add additional conditions specific to defined work location):</strong></p><p></p><ul><li> Generally in an indoor setting; however, may supervise outside activities and events. + Varying schedule to include evenings, holidays, weekends and extended hours as business dictates. + While performing the duties of this job, the employee is primarily in a controlled, temperate environment; however, may be exposed to heat/cold during support of outside activities. + The noise level in the work environment is usually moderate to loud.</li></ul><p></p><p>Sodexo is an <span class=\"long-word\">EEO/AA/Minority/Female/Disability/Veteran</span> employer.</p><p><strong>Job Locations</strong> <i>US-TX-HOUSTON</i></p><p><strong>System ID</strong> <i>700728</i></p><p><strong>Category</strong> <i>Marketing</i></p><p><strong>Employment Status</strong> <i>Part-Time</i></p><p><strong>Unit Name</strong> <i>TEXAS SOUTHERN UNIVERSITY</i></p><p><strong>Unit Contact</strong> <i>Denise Guidry</i></p></div></div>",
        "index": 13,
        "skills": [
            "project management",
            "machine learning",
            "virtual reality"
        ],
        "remote": false
    },
    {
        "position": "Data Analyst Intern",
        "company": "Homie",
        "location": {
            "city": "Remote",
            "state": "Oregon",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/homie-45e66623/data-analyst-intern-b3030486?lvk=99fg9hstigopi0-WaVAQgw.--M4QMFrgeJ",
        "posted": "2021-06-23T18:08:50.579Z",
        "lastScraped": "2021-06-28T18:08:50.579Z",
        "description": "<div><p><strong>What does it mean to be a Homie? </strong></p><p><strong>Being a Homie means compassionately looking out for others, doing the right thing even if it’s the hard thing, and showing up as your true, authentic self. At Homie, we’re a friendly group of curious dreamers and expert operators who believe the status ain’t quo. For too long, the way homes have been bought and sold has been outdated, costly, and overcomplicated. We’re here to change that. </strong></p><p></p><p><strong>Through a combination of technology and expert, full-service agent support, Homie is simplifying the real estate process and eliminating high fees and commissions.</strong></p><p><strong>Homie launched in 2015. Five years later, we're one of the fastest-growing technology companies in the country and the #1 listings brokerage in the great state of Utah. </strong></p><p></p><p><strong>With real estate, home loans, title, and insurance services under one roof, Homie is disrupting an industry and paving the way for what real estate can, and should, become. We’re on a mission to make homeownership affordable, easy, and accessible for all — and we’re just getting started.</strong></p><p></p><p><strong>Homie Values</strong></p><p><strong>Disruption: Real estate is ready. The time is now.</strong></p><p><strong>Loyalty: Homies come first — our customers, team members, and communities.</strong></p><p><strong>Balance: Work is an important part of your life, but it’s not your life.</strong></p><p><strong>Humility: Grateful isn’t dead. And there’s always more to learn. </strong></p><p></p><p><strong>Work at one of the country’s fastest-growing and most disruptive tech startups. Over the past six months, Homie has hired more than 100 new employees. Are you part of the next 100?</strong></p><p></p><p><strong>Job Description</strong></p><p><strong>Candidates should be currently enrolled in an undergraduate or graduate program and working towards a degree. Areas of study can include but are not limited to: finance, accounting, economics, entrepreneurship, statistics, physical sciences, computer science, information systems, and engineering. This is a full or part-time role depending on availability. </strong></p><p></p><p><strong>As a Data Analyst Intern, you assist the Data Analysts working on Homie’s FASD team (finance, accounting, strategy, data) in close collaboration with the data engineering team on the technology development side. This position requires you to work with multiple data sources to combine, clean, and analyze data while recognizing trends and providing valuable insights to fuel data driven decisions that will be transformative to Homie’s business. You will be dedicated to data integrity, data accessibility, and data visualization for Homie leadership on the marketing team, finance team, ops team, sales team, etc. This is an opportunity to play a big part in Homie’s mission to be a data-driven company.</strong></p><p><strong> </strong></p><p><strong>Responsibilities</strong></p><ul><li><p><strong>Provide data and analytics to company leaders and cross-functional teams</strong></p></li><li><p><strong>Research, data-gathering, and analysis on projects that fuel company operations and strategic decisions</strong></p></li><li><p><strong>Regularly communicate with and report results to Analysts and Business Heads</strong></p></li></ul><p></p><p><strong>Qualifications</strong></p><ul><li><p><strong>Strong technical and analytical skills </strong></p></li><li><p><strong>Strong writing and presentation skills</strong></p></li><li><p><strong>Ability to manage time and workflow effectively </strong></p></li><li><p><strong>Strong communication skills</strong></p></li></ul><p><strong> </strong></p><p><strong>Our Commitment to Diversity and Inclusion</strong></p><p><strong>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunities to excel.</strong></p></div>",
        "index": 14,
        "skills": [
            "project management",
            "information technology",
            "data visualization",
            "machine learning",
            "software engineering"
        ],
        "remote": true
    }
]