[
    {
        "position": "Director's Summer Program (DSP)/Cryptanalysis and Signals Analysis Summer Program (CASA SP)",
        "company": "National Security Agency (NSA)",
        "location": {
            "city": "Fort Meade",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=218622253",
        "posted": "2020-07-15T01:18:46.367Z",
        "skills": [
            "information technology",
            "software engineering",
            "matlab",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:46.367Z",
        "description": "The Director's Summer Program (DSP) and the Cryptanalysis and Signals Analysis Summer Program (CASASP) are paid 12-week programs that run from the end of May through mid-August each year. The DSP is looking for students who have distinguished themselves in undergraduate research or national mathematics competitions. At the beginning of the summer, students are presented with introductory lectures on modern cryptography and a set of problems that NSA mathematicians are actively investigating. Each student chooses one of these problems as the focus of their research. The CASASP gives undergraduate mathematicians and computer scientists a chance to contribute to mission-essential technical operations at the National Security Agency (NSA). The CASA mission is to transform collected data into a format analysts can readily consume for intelligence purposes by analyzing signals and protocols, and overcoming security measures. Each summer we invite students to learn, use, and further NSA's tradecraft as they work on operational problems of national importance.\nThe Director's Summer Program (DSP) and the Cryptanalysis and Signals Analysis Summer Program (CASASP) are paid 12-week programs that run from the end of May through mid-August each year. The DSP is looking for students who have distinguished themselves in undergraduate research or national mathematics competitions. At the beginning of the summer, students are presented with introductory lectures on modern cryptography and a set of problems that NSA mathematicians are actively investigating. Each student chooses one of these problems as the focus of their research. The CASASP gives undergraduate mathematicians and computer scientists a chance to contribute to mission-essential technical operations at the National Security Agency (NSA). The CASA mission is to transform collected data into a format analysts can readily consume for intelligence purposes by analyzing signals and protocols, and overcoming security measures. Each summer we invite students to learn, use, and further NSA's tradecraft as they work on operational problems of national importance.\nApplicants applying to this job opening will be considered for the Director's Summer Program and the Cryptanalysis and Signals Analysis Summer Program.\nDirector's Summer Program (DSP):\nThe Director's Summer Program (DSP) is a highly competitive program that seeks to reach the nation's most outstanding undergraduate mathematics majors. Each summer, we invite exceptional undergraduate students to put their skills to the test solving problems in mathematics, cryptology and communications technology in support of the national security mission. These problems often involve applications of abstract algebra, geometry, number theory, analysis, probability, statistics, combinatorics, graph theory, algorithms, and computer science. State-of-the-art computing resources are available to all students. Computational algebra packages, including Mathematics, MATLAB, Magma and MAPLE are available, in addition to a variety of statistics packages.\nThe DSP is looking for students who have distinguished themselves in undergraduate research or national mathematics competitions. At the beginning of the summer, students are presented with introductory lectures on modern cryptography and a set of problems that Agency Mathematicians are actively investigating. Each student chooses one or two problems as the focus of his or her research. Throughout the summer, students are mentored by Agency experts, collaborate to solve challenging problems, and present their work in both technical talks and papers, which are internally published at NSA.\nAbout the Program:\nThe DSP is a 12-week program that runs from the end of May through mid-August each year and is open to students majoring in mathematics. Computer science and Physics majors with either a minor in math or a strong math curriculum may also apply. Applicants should have demonstrated superior mathematical aptitude. One full year of upper level mathematics (abstract algebra or analysis) is strongly recommended. Some computer programming experience is desirable.\nApplication Deadline:\nApplications are accepted May 1, 2020 - October 15, 2020. Admissions are on a rolling basis and applicants are encouraged to apply as soon as is practical to allow sufficient time for security processing and review of their application.\nThe application period runs from 1 May - 15 October 2020. However, the Agency will be making selections for early acceptance into the program on a rolling basis throughout the application period and anticipates filling approximately 1/3 of the available positions prior to the closing of the application period.\nCryptanalysis and Signals Analysis Summer Program (CASA SP):\nThe Cryptanalysis and Signals Analysis Summer Program (CASASP) gives undergraduate mathematicians and computer scientists a chance to contribute to mission-essential technical operations at the National Security Agency (NSA). Our mission is to transform collected data into a format analysts can readily consume for intelligence purposes by analyzing signals and protocols, and overcoming security measures. Each summer we invite twelve students to learn, use, and further NSA's tradecraft as they work on operational problems of national importance. If you possess imagination, initiative and intellectual curiosity, apply for the CASASP.\nAbout the Program\nThe CASASP runs from the end of May through the middle of August and is open to students majoring in mathematics, computer science, or a related field. Some programming experience is desirable. CASASP begins with classified briefings on modern cryptography and on operational projects which will form the basis for research throughout the summer. Problems involve applications of math, statistics, computer science, reverse engineering, and software development. We work with data from many sources, analyze a wide range of technologies, and provide access to cutting-edge computing resources. Results are integrated into production systems to provide new capabilities to our organization.\nApplication Deadline:\nApplications are accepted May 1, 2020 - October 15, 2020.\nEarly Acceptance Incentive:\nThe CASASP will fill up to 1/3 of the available positions via an early acceptance incentive.\nAll applications that are complete as of July 31, 2020 will be reviewed for early acceptance. Candidates will be notified in early September regarding whether they will move forward for further processing in accordance with the early acceptance timeline.\nAny candidates not selected for early acceptance will remain in the candidate pool and will be re-evaluated after the October 15th application deadline. Note that candidates who applied early, but were not selected for the early acceptance timeline, may submit updated application materials (e.g. updated transcripts and resumes) up through the October 15th deadline.\nPlease note, this is a current description of the internships as of the date this advertisement was written. Please monitor the website for any changes to the program description or status.\nThe National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS). All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.\nApplications must be submitted online on or before October 15th, 2020. Applications received after the deadline, as well as incomplete packages, will not be considered. Please note that you will receive a confirmation email once your online application has successfully been submitted.\nTo submit a resume online during open season, click any \"Apply Online\" link. Under \"Basic Job Search,\" type in keywords \"Director's Summer Program\" or \"Cryptanalysis and Signals Analysis Summer Program\" and click on \"Search.\" Select \"Director's Summer Program/Cryptanalysis and Signals Analysis Summer Program\" and click \"Apply Now.\" Follow the directions as prompted.\nRequired Documentation:\nTo be considered, you must submit a complete application package that includes:\n- Two letters of recommendation from faculty members who can speak directly to your mathematics background.\n- Transcripts from ALL colleges and universities attended through current academic year, to include transferred credits.\n- A resume. A well-written resume will include:\n- Your contact information\n- Current and past degree seeking programs to include:\n- Major\n- Cumulative GPA\n- Anticipated graduation date\n- Degree concentration\n- Lists of relevant courses taken, including the current semester's course list\n- Computer languages known (indicate skill level ' i.e. beginner, advanced, fluent, etc.)\n- Awards, honors, and recognitions\n- Relevant experiences or projects\n- Relevant work experiences\nTranscripts -\nTranscripts can be unofficial or official and can be sent via email, mail, or fax. If sent via email please have your College or University send to MathSummer@nsa.gov Alternatively, you can email a scanned PDF copy as an attachment in your application materials. If sent by mail, transcripts must be postmarked no later than October 15th, 2020. If you are faxing transcripts, please make clean photocopies and then fax the photocopies as some of the security features can render faxes of official transcripts unreadable. Please note that only originals via mail, scanned copies of originals (in PDF format) via email, faxed copies, and copies sent electronically by your College or University will be accepted.\nIMPORTANT: When applying online, you may only submit your resume. It is also requested that you submit a soft copy of your current resume/CV via email to MathSummer@nsa.gov Please see job posting between May 1st and October 15th for the email and postal addresses to send transcripts and letters of recommendation.\n**Applications are not complete without the requested documentation. If you have applied to multiple positions, you MUST follow the instructions on each posting and send your requested documents to each program separately. Documents (including transcripts) will NOT be shared between programs.\nIf you have questions about the Director's Summer Program, please contact us at 1-866-NSA-HIRE. You may also e-mail Summer_Interns@nsa.gov\n- Students are paid a salary commensurate with their education level.\n- Receive annual leave, sick leave, and paid federal holidays.\n- Participation in agency-wide extracurricular programs.\n- Students who attend schools in excess of 75 miles from Ft. Meade, MD, are eligible for a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is not provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available but is NOT guaranteed.\n- Subsidized housing accommodations are available upon request if school is located in excess of 75 miles from NSA main HQs campus.",
        "compensation": "paid",
        "due": "2020-05-01T10:00:00.000Z"
    },
    {
        "position": "Software Engineering/Development Intern",
        "company": "Kratos Defense & Security Solutions",
        "location": {
            "city": "Londonderry",
            "state": "NH",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=1f6a9411-b3c4-4f9b-80f1-5945a44e19cc",
        "posted": "2020-07-14T01:18:46.909Z",
        "skills": [
            "software engineering",
            "angular",
            "react"
        ],
        "lastScraped": "2020-07-15T01:18:46.909Z",
        "description": "Job Description\n\nTeam-oriented individual that excels in a highly technical environment. Collaborate with software engineers to perform entry level software development tasks.\n\nUser interface development utilizing modern web development frameworks, such as Angular or React (entry level)\nExperience and Skills\nDetail oriented\nWriting and verbal skills\nAgile, analytical, able to successfully navigate through ambiguity, identify inefficiencies, and propose streamlined documentation solutions\nAbility to work independently, proactively and connect the dots\nBasic understanding of computer programming (entry level)\nSome College"
    },
    {
        "position": "Machine Learning Engineer, Intern",
        "company": "Brambles USA Inc",
        "location": {
            "city": "Orlando",
            "state": "FL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=218465035",
        "posted": "2020-06-23T01:18:47.443Z",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "python",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:18:47.443Z",
        "description": "Brambles companies, including CHEP, help move more goods to more people, in more places than any other organisation on earth. Our 330 million pallets, crates and containers are continuously in motion, forming the invisible backbone of the global supply chain and the world’s biggest brands trust us to help them transport their goods more efficiently, sustainably and safely. As pioneers of the sharing economy, Brambles created one of the world's most sustainable logistics businesses through the share and reuse of its platforms under a model known as ‘pooling’. Brambles primarily serves the fast-moving consumer goods (e.g. dry food, grocery, and health and personal care), fresh produce, beverage, retail and general manufacturing industries. The Group employs more than 10,000 people and operates in over 60 countries with its largest operations in North America and Western Europe. For further information, please visit www.brambles.com\n\nJob Description\n\nPOSITION PURPOSE\n• Dedicated to delivering Machine Learning projects within the CHEP Supply Chain.\n• Dedicated to driving industry and market exploration into Machine Learning capabilities, assessing, leading feasibility study and applications of how it can be used in CHEP to further enhance our platform inspection capability across all CHEP platforms.\n\nMAJOR / KEY ACCOUNTABILITIES\n• Develop computer vision applications using Machine Learning for CHEP business across all platforms\n\n• Demonstrate an ongoing understanding of Machine Learning technologies in current marketplace and how they can be applied to the CHEP business\n\n• Research and on-board of technology suppliers for machine learning development and in particular those that work in Machine Learning applications.\n\n• Facilitate and assist in data gathering efforts and support testing during validation process\n\nMEASURES\n\n• Delivery of Machine Learning projects based on strategy and business need.\n\nSCOPE\n• Countries: Global to all CHEP Pallet business units\n• Suppliers: Minimum of 2\n\nAUTHORITY / DECISION MAKING\n• Development of vision and machine learning projects.\n\nCHALLENGES\n• Utilizing existing hardware and images in addition to new image data gathering techniques to produce innovative image analysis models and algorithms.\n• Development of ML approaches that improve the speed and accuracy of image algorithm development for inspection and quality control methods.\n\nKEY CONTACTS\nInternal: Process Engineering, including existing machine vision development team, Operations and Quality team\n\nExternal: External Technology Development and Data Annotation Suppliers\n\nQUALIFICATIONS\n• MS or PhD in Computer Science, Engineering, Mathematics or Statistics, with specialization in machine learning\n• Proficient in Python or C/C++\n• Proficiency in CV/ML libraries (OpenCV, Scikit-learn, Numpy, Pandas)\n• Proficiency in Deep Learning frameworks (Tensorflow and Keras)\n• Proficiency in implementing deep learning architectures for Image classification, Object detection and Object segmentation\n• Demonstrated experience in scientific research related to Computer vision and Deep learning\n• Scientific thinking and the ability to invent, implement, and lead technology developments in the field of computer vision and machine learning.\n• Solid software development experience.\n• Excellent written and spoken communication skills.\n\nEXPERIENCE\n• Experience in developing Computer Vision and Deep Learning applications in Python\n• Experience in multi-facility, international organizations desired\n• Experience in a diverse multi-cultural corporate environment desired\n• Successful delivery of machine learning applications to internal or external customers\n\nSKILLS AND KNOWLEDGE\n\nMandatory:\n\n• Strong Python/C++ programming capabilities\n• Scientific understanding of Computer Vision algorithms and Deep learning architectures\n• Ability to read scientific publications, understand and implement proposed solution\n• Project Management\n• Leadership: Ability to operate with little supervision and can make presentations at leadership level.\n• Self-driven and strong problem-solving skills\n• Team work\n• Strong analytical skills and process focus\n\nDesirable:\n• Publications in top CV conferences and Journals (CVPR, ICCV, ECCV, NIPS, ICML, PAMI, etc.)\n• Proficiency in Activity recognition and Object tracking\n• 3D image algorithms experience\n• Ability to work in a Matrix Organization\n\nLANGUAGES\nEnglish\nDesirable: Spanish\n\nPreferred Education\n\nMasters\n\nPreferred Level of Work Experience\n\n1 - 3 years\n\nWe are an Equal Opportunity Employer and we are committed to developing a diverse workforce in which everyone is treated fairly, with respect, and has the opportunity to contribute to business success while realizing his or her potential. This means harnessing the unique skills and experience that each individual brings and we do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state, or local protected class.\n\nIndividuals fraudulently misrepresenting themselves as Brambles or CHEP representatives have scheduled interviews and offered fraudulent employment opportunities with the intent to commit identity theft or solicit money. Brambles and CHEP never conduct interviews via online chat or request money as a term of employment. If you have a question as to the legitimacy of an interview or job offer, please contact us at recruitment@brambles.com.",
        "contact": "recruitment@brambles.com"
    },
    {
        "position": "Application Developer Internship",
        "company": "ASRC Federal Holding Company LLC",
        "location": {
            "city": "Fort Collins",
            "state": "CO",
            "zip": "80526"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=218793670",
        "posted": "2020-07-10T01:18:48.026Z",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:48.026Z",
        "description": "ASRC Federal is actively seeking an Application Developer Intern to join our team and support development efforts for a government client in Fort Collins, CO.\n\nWould you like to be part of a dynamic team of dedicated software professionals? Are you concerned about protecting our Nation's natural resources? We need people who are committed to action. People who want to apply their education and experience to make sure that all of us enjoy the benefits of productive soil, clean water, clean air, and abundant wildlife that come from a healthy environment.\n\nNatural resource conservation is an effort of Federal and State agencies, universities, and professional societies to deliver science-based information to land owners. Join us to build the technology to help people understand, preserve and increase the productivity of our natural resources.\n\nResponsibilities:\n\nASRC Federal is looking for strong developers who have a passion for building quality software solutions. As a team member you would participate in the complete development application life cycle, which includes requirements analysis, design, implementation, unit testing, continuous integration and sustainment engineering.\n\nThe ideal candidate would have the following characteristics:\n\n* Passion for software development\n\n* Extremely strong problem-solving skills\n\n* Highly analytical and flexible, views roadblocks as an opportunity for learning and attacks them from multiple directions until a solution is found\n\n* Desire to work in fast-paced agile environment\n\n* Ability to work on multiple projects at once and switch contexts quickly\n\n* Ability to quickly absorb complicated frameworks and business rules\n\n* Can work without heavy direction\n\n* Be able to participate and contribute to a team approach to software development and problem solving using Agile/SAFe practices working with System and Business Analyst as well Quality Assurance team members.\n\nEducation and Experience:\n\n* Majoring or recent graduate in a relevant degree, such as information systems, or computer science\n\n* Excellent written and oral communication skills; actively collaborates with team members\n\n* Highly analytical and flexible, views roadblocks as an opportunity for learning and attacks them from multiple directions until a solution is found\n\n* Object-oriented programming language experience a plus (e.g. JavaScript, java, HTML, CSS, jQuery, Bootstrap, .NET MVC with C#, React or Vue)\n\n* Database and/or automated testing experience is a plus\n\n* Knowledge GIS concepts and design is a plus\n\nSuccessful candidate is subject to a background investigation by the government and must be able to meet the requirements to hold a position of public trust.\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"
    },
    {
        "position": "Graduate Mathematics Program (GMP) Summer Internship",
        "company": "National Security Agency (NSA)",
        "location": {
            "city": "Fort Meade",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=218622250",
        "posted": "2020-07-15T01:18:48.590Z",
        "skills": [
            "information technology",
            "python",
            "matlab",
            "machine learning",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:18:48.590Z",
        "description": "The Graduate Math Program (GMP) is a highly competitive program for exceptional mathematics and statistics graduate students. It is a 12-week paid work assignment that runs from the end of May through the middle of August. This program provides students with the opportunity to work directly with NSA Mathematicians and Statisticians on mission-critical problems and experience the excitement of the NSA Mathematics Community first-hand.\nThe Graduate Math Program (GMP) is a highly competitive program for exceptional mathematics and statistics graduate students. It is a 12-week paid work assignment that runs from the end of May through the middle of August. This program provides students with the opportunity to work directly with NSA Mathematicians and Statisticians on mission-critical problems and experience the excitement of the NSA Mathematics Community first-hand.\nIn the Graduate Mathematics Program (GMP), you'll collaborate with top Mathematicians and Statisticians in the country, solving problems critical to the success of our missions. You'll have the opportunity to learn and develop mathematical theory and to apply the theory to operational problems. GMP participants work together on problems involving mathematics, statistics, data science, cryptology, and communications technology. Participants document their work in technical papers which are internally published at the Agency. State-of-the-art computing resources are available, as well as computational software packages such as, Python, R, Sage, Magma, MATLAB, and others.\nAbout the Program:\nThe GMP is a highly competitive program for exceptional mathematics and statistics graduate students. It is a 12-week paid work assignment that runs from the end of May through the middle of August. This program provides students with the opportunity to work directly with NSA Mathematicians and Statisticians on mission-critical problems and experience the excitement of the NSA Mathematics Community first-hand.\nApplication Deadline:\nThe application period is May 1, 2020 - October 15, 2020. Late applications will continue to be accepted through October 15, 2020. Admissions are on a rolling basis and applicants are strongly encouraged to apply as early as possible to allow sufficient time for security processing and review of their application. Applications received after the October 15th deadline, as well as incomplete packages, will not be considered.\nThe National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS). All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.\nApplications must be submitted online on or before October 15th. Applications received after the deadline, as well as incomplete packages, will not be considered. Please note that you will receive a confirmation email once your online application has successfully been submitted.\nTo submit a resume online during open season:\n' Click any \"Apply Online\" link.\n' Under \"Basic Job Search,\" type in keywords \"Graduate Mathematics Program\" and click \"Search.\"\n' Select \"Graduate Mathematics Program\" and click \"Apply Now.\"\n' Follow the directions as prompted.\nRequired Documentation:\nTo be considered, you must submit a complete application package that includes:\n1. At least two (2) letters of recommendation from faculty members or supervisors who can speak directly to your mathematics or statistics background\n2. Transcripts from ALL colleges and universities attended through the current academic year, to include transferred credits\n3. Current resume. A well-written resume will include:\n' Your contact information.\n' Current and past degree seeking programs to include:\n' Major\n' Cumulative GPA\n' Anticipated graduation date\n' Degree concentration\n' Lists of relevant courses taken, including the current semester's course list\n' Computer programming experience (for each computer language, indicate skill level 'beginner, advanced, etc.)\n' Awards, honors, and recognition\n' Published papers and formal presentations\n' Relevant research experiences or research projects\n' Relevant work experiences\nTranscripts:\nTranscripts can be unofficial or official and can be sent via email, mail, or fax.\n' Email: Have your College or University send transcripts directly to MathSummer@nsa.gov\n' Scan and Email: You may email a scanned PDF copy as an attachment in your application materials.\n' Mail: Transcripts must be postmarked no later than October 15th, 2020. Please see job posting for the postal address.\n' Fax: Please make clean photocopies first and then fax the photocopies. (Some of the security features can render faxes of official transcripts unreadable.)\nIMPORTANT: When applying online, you must complete the online resume builder and are given the option to also upload your resume. It is also requested that you submit a soft copy of your current resume/CV via email to MathSummer@nsa.gov Please see job posting for the email and postal addresses to send transcripts and letters of recommendation.\nApplications are not complete without all of the requested documentation.\nPlease note, this is a current description of the internships as of the date this advertisement was written. Please monitor the website for any changes to the program description or status.\nIf you have questions about the Graduate Mathematics Program, please contact us at 1-866-NSA-HIRE. You may also e-mail Summer_Interns@nsa.gov\n- Students are paid a salary commensurate with their education level.\n- Receive annual and sick leave, and paid federal holidays\n- Participation in agency-wide extracurricular programs\n- Students who attend schools in excess of 75 miles from Ft. Meade, MD, are eligible for a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is not provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available but is NOT guaranteed.\n- Subsidized housing accommodations are available upon request if school is located in excess of 75 miles from NSA main HQs campus.",
        "compensation": "paid",
        "due": "2020-05-01T10:00:00.000Z"
    },
    {
        "position": "Fall 2020-Software Engineering/Computer Science Intern",
        "company": "Edupoint",
        "location": {
            "city": "Mesa",
            "state": "AZ",
            "zip": "85204"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=6d5f5bf7-28de-482c-8aaf-7a97afd97108",
        "posted": "2020-07-08T01:18:49.145Z",
        "skills": [
            "data visualization",
            "software engineering",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:18:49.145Z",
        "description": "Edupoint Educational Systems, a \"Top Companies to Work For\" recipient is currently seeking Fall Software Developer Interns with experience in C# (Object Oriented). Experience gained in a classroom setting and through personal application will be accepted. Edupoint is an established and rapidly expanding leader in the education systems industry providing state of the art software and support services to K – 12 school districts across the nation. At Edupoint we are constantly evolving our state of the art web framework (built on the .NET framework) to provide innovative products for the K-12 Education market. This opportunity is available in Mesa, AZ.\n\n\n\n\n\nJob Summary:\n\n\n\n\n\nEdupoint develops cutting edge Student Information Systems in the K-12 market. This position requires you to work within a proprietary framework using C# .NET to extend the business layer of our suite of web based applications.\n\n\n\n\n\nJob Responsibilities:\n\n\n\n\n\n\nWrite C# code to correct defects and extend existing products\n\n\nLearn and improve current C# coding skills as directed by management\n\n\nFollow coding standards to meet guidelines created by Edupoint\n\n\nDevelop and execute thorough unit testing scripts to verify code changes\n\n\nParticipate in receiving peer code reviews\n\n\nProvide feedback to management on status of job tasks\n\n\n\n\n\n\nJob Requirements:\n\n\n\n\n\nGeneral Knowledge\n\n\n\n\n\nC# Knowledge\n\n\n\n\n\n\nBasic:\n\n\n\n\n\n\nWorking knowledge of the language with the ability to create classes, interfaces, properties and methods. Understanding Object-Oriented concepts is a plus: Inheritance, Encapsulation, Polymorphism, Collections, Objects, Generics.\n\n\n\n\n\nSQL Knowledge\n\n\n\n\n\n\nBasic:\n\n\n\n\n\n\nSelect, Update, Delete, Inner Join, Outer Join, Order, Where\n\n\n\n\n\nDebugging\n\n\n\n\n\n\nBasic:\n\n\n\n\n\n\nUnderstanding of debugging techniques and the ability to find issues.\n\n\n\n\n\nSoftware Knowledge\n\n\n\n\n\n\nExperience using Visual Studio 2010 and above or equivalent\n\n\nFamiliarity with Microsoft Team Foundation Server is a plus\n\n\nMicrosoft SQL Server Management Studio or equivalent\n\n\nFamiliarity with Internet Explorer, Firefox, Safari or Chrome\n\n\nOracle knowledge is a plus\n\n\n\n\n\n\nEDUCATION AND/OR EXPERIENCE:\n\n\n\n\n\n\nCourses in Computer Science, programming with a B average.\n\n\nAt least one class in an Object Oriented Language\n\n\nAbility to demonstrate proficiency in C#\n\n\n\n\n\n\nTypical Physical Demands and Work Environment:\n\n\n\n\n\nWork may require sitting for long periods of time, bending and stretching for files and supplies, and occasionally lifting files, objects, or paper weighing up to 30 pounds. Sufficient manual dexterity is required to operate a keyboard, telephone, copier and other office equipment, as necessary. Hearing must be in the normal range for telephone and video conferencing contacts. Vision must be acute in order to work extended hours on computer screens. Work environment is a typical office environment with moderate noise and which can be fast-paced and project-intensive. \n\n\n\n\n\nCompany Disclaimer:\n\n\n\n\n\nThe statements herein are intended to describe the general nature and level of work being performed by employees, and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the employer.\n\n\n\n\n\nEdupoint Educational Systems is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."
    },
    {
        "position": "Computer Science Intern",
        "company": "Optimized Thermal Systems",
        "location": {
            "city": "Beltsville",
            "state": "MD",
            "zip": "20705"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=f05acb5d-6513-4164-82b0-6b4fb452fd7c",
        "posted": "2020-07-12T01:18:50.558Z",
        "skills": [
            "software engineering",
            "data visualization",
            "matlab",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:18:50.558Z",
        "description": "Optimized Thermal Systems, Inc. (OTS) is looking for a part-time computer science intern to provide assistance to junior and senior level engineers on software development projects. This includes modifying existing tools to incorporate new features, developing user interfaces, and building new programs entirely from scratch.\n\nQualifications\n\nMust be current junior/senior undergraduate or graduate student\nExperience in developing and testing Windows Desktop and/or Web Applications based on .NET Framework and the Microsoft Technology Stack. Specifically: Visual Studio 2010/2013, C#, .NET Framework, C/C/CLI, WinForms, MS SQL Server, ASP.NET WebForms/MVC\nBasic Knowledge of Networking, Cryptography, Computer Security, Windows Server Administration is a plus\nExperience in Agile Development, Software Engineering and Software Quality Control is a plus\nAny experience/knowledge of Mechanical Engineering, Modeling & Simulation, Numerical Analysis, Data Visualization is a plus\nAbility to learn and work quickly with a small team\nFamiliarity with other simulation platforms such as Transys, Matlab, EES, Simulink, CoilDesigner, VapCyc, and LabVIEW a plus"
    },
    {
        "position": "Research Chemist-Lab Intern",
        "company": "IFDC- International Fertilizer Development",
        "location": {
            "city": "Muscle Shoals",
            "state": "AL",
            "zip": "35661"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=dfb35e5c-965d-419e-9955-03892fb4d425",
        "posted": "2020-07-09T01:18:51.140Z",
        "skills": [],
        "lastScraped": "2020-07-15T01:18:51.140Z",
        "description": "Research Chemist-Lab Intern\n\nThe Organization:\n\nIFDC is an independent non-profit organization that combines innovative research, market systems development, and strategic partnerships to spread sustainable agricultural solutions for improved soil health, food security, and livelihoods around the world.\n\nJob Description:\n\nThis internship is for the summer 2020. The intern will serve 240 hours and receive a stipend of $1,000. This position involves analyzing the chemical components of various materials (e.g.,agrominerals, soil samples, plant tissues, fertilizers). Duties may include:\n\nAssist in the analyses of various materials related to fertilizers (e.g.,splitting, grinding, drying and preparing samples for analysis; labeling, weighing and chemically treating samples; determining the sample compounds using various instruments; analyzing quantitative and qualitative methods of isotopic and non-isotopic fertilizer materials; interpreting data)\n\nAssisting in setting-up, conducting and monitoring various experiments in cooperation with senior analysts or scientists (e.g.,assisting with initiating and harvesting greenhouse experiments, performing quality control and process control analyses for researchers in bench-scale and pilot plant operations, assisting in experiments for the nitrogen program)\n\nWillingness to perform research projects involving fertilizer and related materials\n\nCalculating, tabulating and maintaining record of analytical determinations (e.g.,entering data into worksheets, preparing experiment reports)\n\nMaintaining a neat, clean and safe working environment\n\nJOB REQUIREMENTS\n\nThis position requires knowledge of qualitative, quantitative and general chemistry to perform fertilizer, plant and soil analyses. This position requires the ability to work meticulously to carryout analyses according to established procedures. This job may involve the following:\n\nKnowledge of chemistry to properly follow established chemical procedures for analysis in a safe manner\n\nAbility to operate a computer to enter and tabulate analysis results and prepare\n\nsummary reports\n\nChemistry, Biology, or related field of study\n\nPreferably current undergraduate juniors or seniors, or recent graduates\n\nProof of medical insurance required\n\n\nRequired Skills\n\n\nRequired Experience"
    },
    {
        "position": "Harvest Intern Lab Technician - Clos Pegase Winery",
        "company": "Vintage Wine Estates, Inc.",
        "location": {
            "city": "Calistoga",
            "state": "CA",
            "zip": "94515"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=48b49e72-8bee-4702-a8ca-efb32f62e2c6",
        "posted": "2020-07-09T01:18:51.732Z",
        "skills": [
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:18:51.732Z",
        "description": "The Harvest Laboratory Technician is a fantastic opportunity to work alongside our highly skilled and enthusiastic team at the Clos Pegase Winemaking Laboratory. The individual chosen for this position will be responsible for performing critical wine chemistry analyses in an accurate, timely manner in accordance with good lab practice. They will be given the responsibility of data management, reporting results to the winemaking team and monitoring individual fermentations throughout harvest. Candidates for this position should have knowledge of chemistry, winery terminology, wine production and be good team players.  \n\n \n\nIf you are the right candidate, you’ll get to experience the harvest first hand, working side by side our Enologist and the rest of our dedicated and passionate Winemaking team. The idea is to come away with more winemaking experience than you had when you started. You’ll be able to taste through the wines at every stage throughout the harvest season, ask questions and very likely get some bottling experience to round things off.\n\n\n\n\nYour work day will take you from caves to crush pad, as you help monitor fermentations in barrels and tanks. You’ll have the opportunity to conduct analysis of free sulfur dioxide, ethanol, titratable acidity, volatile acidity, residual sugar, turbidity and pH as we perform weekly QC.\n\n\nAll this data will be yours to manage in our winemaking software which alongside preparing R&D projects with our Enologist will keep you more than busy. We need someone that is a self-starter, who can strategize but also has the ability to pivot and maintain the flexibility needed during harvest when the unexpected winemaking situations often arise.\n\n \n\nJOB REQUIREMENTS:\n\nBS or BA in Microbiology, Food Science, Biology, Chemistry, Enology, or a related degree.\nShould possess good spoken and written English skills.\nMust be detail-oriented, and computer literate (Word, Excel, and database systems).\nSpanish language skills are a plus, but not required.\nPrior production experience in a wine lab environment is a plus.\nRequires work schedule flexibility.\nMust be able to lift 35 lbs, and able to stand for long periods of time."
    },
    {
        "position": "Research Chemist-Lab Intern",
        "company": "IFDC",
        "location": {
            "city": "Muscle Shoals",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=e7ee1fe1-9da2-42af-9d1a-87f90f6f1cee",
        "posted": "2020-07-08T01:18:52.313Z",
        "skills": [],
        "lastScraped": "2020-07-15T01:18:52.313Z",
        "description": "Research Chemist-Lab Intern\n\nThe Organization:\n\nIFDC is an independent non-profit organization that combines innovative research, market systems development, and strategic partnerships to spread sustainable agricultural solutions for improved soil health, food security, and livelihoods around the world.\n\nJob Description:\n\nThis internship is for the summer 2020. The intern will serve 240 hours and receive a stipend of $1,000. This position involves analyzing the chemical components of various materials (e.g.,agrominerals, soil samples, plant tissues, fertilizers). Duties may include:\n\nAssist in the analyses of various materials related to fertilizers (e.g.,splitting, grinding, drying and preparing samples for analysis; labeling, weighing and chemically treating samples; determining the sample compounds using various instruments; analyzing quantitative and qualitative methods of isotopic and non-isotopic fertilizer materials; interpreting data)\n\nAssisting in setting-up, conducting and monitoring various experiments in cooperation with senior analysts or scientists (e.g.,assisting with initiating and harvesting greenhouse experiments, performing quality control and process control analyses for researchers in bench-scale and pilot plant operations, assisting in experiments for the nitrogen program)\n\nWillingness to perform research projects involving fertilizer and related materials\n\nCalculating, tabulating and maintaining record of analytical determinations (e.g.,entering data into worksheets, preparing experiment reports)\n\nMaintaining a neat, clean and safe working environment\n\nJOB REQUIREMENTS\n\nThis position requires knowledge of qualitative, quantitative and general chemistry to perform fertilizer, plant and soil analyses. This position requires the ability to work meticulously to carryout analyses according to established procedures. This job may involve the following:\n\nKnowledge of chemistry to properly follow established chemical procedures for analysis in a safe manner\n\nAbility to operate a computer to enter and tabulate analysis results and prepare\n\nsummary reports\n\nChemistry, Biology, or related field of study\n\nPreferably current undergraduate juniors or seniors, or recent graduates\n\nProof of medical insurance required"
    },
    {
        "position": "GIS/Engineer Intern (98621)",
        "company": "American Water",
        "location": {
            "city": "Alexandria",
            "state": "VA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=fe87d1b3-a1d2-45e6-9708-a8998700a46b",
        "posted": "2020-07-03T01:18:52.918Z",
        "skills": [
            "information technology",
            "software engineering",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:52.918Z",
        "description": "Virginia American Water, serving about 320,000 people and part of theAmerican Water Family, is seeking an Intern for thespring 2021 season. American Wateris the largest and most geographically diverse publicly traded U.S. water and wastewater utility company. With headquarters in Camden, NJ, the company employs over 7,100dedicated professionals who provide regulated and market-based drinking water, wastewater and other related services to an estimated 15 million people in 46states.\n\nPrimary Role\n\nIdentify assets, update or create maps and customized geographic information systems (GIS) applications and manipulate data to serve a variety of purposes. Read and interpret maps, and as-built drawings to locate, obtain, manipulate and understand digital land data, and manage data entered into a GIS database.\n\nKey Accountabilities\nAssist in managingas-built plans of completed projects and update system maps.\nResponsible for reviewing engineering plans, and interpreting aerial imagery including maps that are sometimes inaccurate.\nMust be able to orient oneself within said map using GPS position, perform deadreckoning, compare reality, GIS, GPS, & sketches and route tables to assign the correct assets in the map to GPS positions taking.\nThoroughly review each block surveyed for items in map that areincorrect or need to be captured.\nResponsible for performing basic IT troubleshooting to address typical or unexpected computer communication problems that might affect GPS signal strength, Mobile Broadband, Bluetooth, Networks, etc.\nResponsible for reviewing engineering plans, and interpreting aerial imagery including maps that are sometimes inaccurate.\nProvide active feedback to GPS project manager. Due to the highly sensitive nature of the technology involved the workflow does not work with the same quality/ consistencyeverywhere all the time.\nResponsible to adjust workflow / learn new techniques as the process is improved through feedback.\nAbility to perform these tasks while maintaining a culture of elevated safety through risk reduction in challenging work environments including poor weather, proximity to traffic, searching for assets in and under landscaping and other obstructions, etc.\nKnowledge/Skills\nKnowledge of water and wastewater construction techniques preferred.\nFamiliar with survey GPS equipment,ESRI Collector, RTK networks, and GNSS. Skills: ArcGIS suite of software.\nMust be detail oriented.\nExcellent written and oral communication skills.\nWorks well within a team, outstanding listening skills, ability to follow directions, and good customer service skills.\nAbility to learn and understand the basic water and wastewater network structures as it applies to a network GIS configuration.\nExperience/Education\nMinimum 1 year of GPS/GIS or related field work.\nWorking towards a Bachelors degree in Geographic Information Systems (GIS), Engineering or related field, Recently completed Bachelors degrees will also be considered.\nWork Environment\n\nIndoor and outdoor environment.\n\nTravel Requirements\n\nPeriodic local travel; occasional national travel (e.g., User's conference, etc.)\n\nTo learn more about American Water andadditionalcareer opportunities, visit www.amwater.com.\n\nJoin American Water...We Keep Life Flowing™\n\nAmerican Water is firmly committed to Equal Employment Opportunity (EEO) and prohibits employment discrimination for employees and applicants based on his or her age, race, color, pregnancy, gender, gender identity, sexual orientation, national origin, religion, marital status, citizenship, or because he or she is an individual with a disability, protected veteran or other status protected by federal, state, and local laws.",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Intern - Machine Learning Scientist",
        "company": "Kebotix",
        "location": {
            "city": "Cambridge",
            "state": "MA",
            "zip": "02139"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=f97b01e7-655d-414c-9e98-daa99968e471",
        "posted": "2020-06-25T01:18:53.509Z",
        "skills": [
            "machine learning",
            "information technology",
            "deep learning",
            "robotics"
        ],
        "lastScraped": "2020-07-15T01:18:53.509Z",
        "description": "Kebotix is a tech company leading the materials industry towards the age of high-speed innovation using artificial intelligence and robotic automation. Our technology is centered around smart algorithms that allow for discoveries of new materials that solve the problems around us. \n\n\nAre you a self-motivated learner? Do you enjoy solving problems? Want to build something with big impact? Then the dynamic environment at Kebotix is the right place for you. Join us and create the materials for tomorrow, today!\n \nWe are looking for a Machine Learning Scientist - Intern who will be a member of a multi-disciplinary team working in a fast-paced startup environment.  You will be responsible for investigating state of the art techniques in machine learning and probabilistic modeling. This includes the design, development, and deployment of scalable systems for innovative analytics applications in the field of functional materials, chemistry, and pharma.  Further, you will work on integrating the machine learning tools into the data and workflow pipelines and implement interfaces with automation systems. You will help Kebotix to prepare presentations and progress reports and keep at pace with the current research literature. \n\nWe are looking for a passionate applicant with strong communication skills and the human enthusiasm for Machine Learning.\n\nQualifications and Experience\ngraduate student or equivalent in Physics, Chemistry, Computer science, Statistics or a related field \nexperience with machine learning methods and model selection concepts as well as with at least one deep learning framework (e.g., Tensorflow, PyTorch, Keras, ...) \npassionate learner with problem-solving skills\n\n\nWe offer an excellent career opportunity and an exciting working environment. With an entrepreneurial spirit and a dynamic friendly environment, we strive to ensure that the success of our company brings both professional and financial rewards to all of our employees. We look forward to receiving your application! \n\n\nKebotix is an Equal Opportunity Employer committed to no discrimination because of race, color, creed, marital status, age, religion, sex, national origin, citizenship, sexual orientation, gender identity or expression, genetic information, disability, protected veteran, or any other legally protected characteristic."
    },
    {
        "position": "Transportation Engineer/GIS Internship",
        "company": "Tindale-Oliver & Associates",
        "location": {
            "city": "Fort Lauderdale",
            "state": "FL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=7fe19465-cd68-4359-9acc-347b246f3d5c",
        "posted": "2020-07-09T01:18:54.073Z",
        "skills": [
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:18:54.073Z",
        "description": "Tindale-Oliver & Associates, Inc., a planning and engineering firm, is seeking a Transportation Engineer/GIS Intern for their Fort Lauderdale, FL office. In this role, the Transportation Engineer/GIS Intern will provide technical support and assistance to Project Managers on the production of transportation engineering designs, maps, and technical reports.\n\nEssential Functions:\n\nSupport technical analysis in project work including traffic impact analysis reviews, capacity analyses, design traffic estimates, traffic signal design, travel demand modeling, traffic simulation modeling, and access analysis/design.\nAssist with transportation engineering activities, working with staff at all levels to ensure data is accurately represented in project graphics.\nCompile and analyze planning/engineering data and prepare written summaries of analyses and conclusions.\nAssist with preparing presentation materials.\nOther duties as assigned.\n\nJob Qualifications:\n\nUndergraduate or graduate student seeking a degree in Civil Engineering, Transportation/Traffic Engineering or GIS/Geography.\nPrior work experience or internship preferred but not required.\n\nPhysical Requirements:\n\nMust be able to push, pull, bend, kneel, crouch, stoop, lift, carry or otherwise move and position objects weighing up to 25 pounds when stocking supplies and setting up equipment for up to 10% of the day.\nMust be able to sit for up to 75% of the day.\nMust be able to walk and stand for up to 30% of the day.\nMust be able to type up to 50% of the day.\n\nOther Skills/Abilities:\n\nMust be able to participate in field data collection activities.\nMust have excellent communications abilities.\nMust be able to communicate in English verbally and in writing.\nMust have knowledge of ArcGIS.\nKnowledge of major transportation software such as AutoCAD, Synchro, HCS, and Cube/FSUTMS preferred but not required.\nMust have strong organizational skills, attention to detail, and ability to multi-task.\nMust be able to work both independently and collaboratively in a team environment.\nMust be highly computer literate and have strong Microsoft Office skills.\nMust be honest and ethical.\nMust be able to pass a drug test.\nMust have valid driver's license.\n\nSince 1989, Tindale Oliver has provided industry-leading transportation, community planning, transit, and public finance solutions to public sector clients throughout the United States and has earned a national reputation for exceptional client service and insightful, actionable solutions. Tindale Oliver is headquartered in Tampa and has offices/staff in Fort Lauderdale, Jacksonville, Miami, and Baltimore.\n\nTindale Oliver offers our employees not just a job but an opportunity to shape the world for generations to come through innovative and sound design. Our employees enjoy a robust employment package that includes a competitive salary and benefits that include medical, dental, vision, life, and disability insurance, 401(k) with employer match, paid holidays and time off, tuition reimbursement, flexible work schedule, commuter benefits program,professional and career development opportunities, and other valuable voluntary options.",
        "compensation": "paid"
    },
    {
        "position": "Undergraduate Engineering or Physical Science Internship - Hydrogen Production, Power, and Storage",
        "company": "National Renewable Energy Laboratory",
        "location": {
            "city": "Golden",
            "state": "CO",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=dbdaccd2-1eb6-424b-97f8-248b4bee40fa",
        "posted": "2020-06-24T01:18:54.617Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "matlab",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:54.617Z",
        "description": "Posting Title\n\n\nUndergraduate Engineering or Physical Science Internship - Hydrogen Production, Power, and Storage\n\n.\n\n\nLocation\n\n\nCO - Golden\n\n.\n\n\nPosition Type\n\n\nIntern (Fixed Term)\n\n.\n\n\nHours Per Week\n\n\n20\n\n.\n\n\nJob Description\n\nNREL's Hydrogen Production, Power, and Storage team is looking for an undergraduate intern enrolled in an engineering or science fields to support the team in hydrogen infrastructure developments. The primary role of the position is expected to be in data management and analysis and this positions is eligible to be completed remotely. The team is seeking support for the compilation of historical (5-year) project data and consolidation of the data into a single database that is easy to reference programmatically through generated scripts and common programming language(s) such as Matlab and Python. In addition, the position will also collect and compile national scale weather data and other information to support the identification of new hydrogen station designs, quantify regional impacts on energy use for stations, and explore approaches based on local or regional knowledge. Finally, the position will work with staff engineers to support the development of hydrogen infrastructure siting scenarios by leveraging the team's knowledge of medium- and heavy-duty hydrogen fueling infrastructure. The scenarios will explore station footprint, capability, and logistics around fuel deliveries. Scenarios will include a number of delivery technologies including gaseous tube trailer, liquid hydrogen transport, and pipeline. Internal NREL models will be leveraged to evaluate station performance and cost across all scenarios. An ideal candidate is someone who is excited about hydrogen technologies and has some experience in data management, analysis, and/or computer programming. The position will allow for a flexible work schedule with variable hours throughout the summer and school semesters, with the expectation that a minimum number of agreed upon hours are met on a weekly basis.\n\n.\n\n\nBasic Qualifications\n\nMust be enrolled as a full-time student in a Bachelor's, Master's or PhD degree program, or graduated in the past 12 months from an accredited institution. Internship period cannot exceed 12 months past graduation. Minimum of a 3.0 cumulative grade point average.\n\n\nPlease Note:\n\n•You will need to upload official or unofficial school transcripts as part of the application process.\n\n•If selected for position, a letter of recommendation will be required as part of the hiring process.\n\n.\n\n\nAdditional Required Qualifications\n\n\nPreferred Qualifications\n\n\n.\n\n\nSubmission Guidelines\n\n\nPlease note that in order to be considered an applicant for any position at NREL you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application.\n\n\n.\n\n\nEEO Policy\n\n\nNREL is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard basis of age (40 and over), color, disability, gender identity, genetic information, marital status, military or veteran status, national origin/ancestry, race, religion, creed, sex (including pregnancy, childbirth, breastfeeding), sexual orientation, and any other applicable status protected by federal, state, or local laws.\n\n\nEEO is the Law at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm | Pay Transparency Nondiscrimination at https://www.dol.gov/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf | Reasonable Accommodations at http://www.nrel.gov/careers/employment-policies.html\n\n\nE -Verify www.dhs.gov/E-Verify |For information about right to work, click here at http://www.justice.gov/sites/default/files/crt/legacy/2013/08/13/FinalOSCPosterEN08_01_2013.pdf for English or here at http://www.justice.gov/crt/file/813271/download for Spanish.\n\n\nE-Verify is a registered trademark of the U.S. Department of Homeland Security. This business uses E-Verify in its hiring practices to achieve a lawful workforce.\n\n\nThe National Renewable Energy Laboratory (NREL) is a leader in the U.S. Department of Energy’s effort to secure an environmentally and economically sustainable energy future. With locations in Golden and Boulder, Colorado, and a satellite office in Washington, D.C., NREL is the primary laboratory for research, development, and deployment of renewable energy technologies in the United States.\n\n\nNREL is subject to Department of Energy (DOE) access restrictions. All candidates must be authorized to access the facility per DOE rules and guidance within a reasonable time frame for the specified position in order to be considered for an interview. DOE rules for site access during the interview process are the same regardless of whether the candidate is interviewed on-site, off-site, or via telephone or videoconference. Additionally, DOE contractor employees are prohibited from participating in certain Foreign Government Talent Recruitment Programs (FGTRPs). If a candidate is currently participating in an FGTRP, they will be required to disclose their participation after receiving an offer of employment and may be required to disengage from participation in the FGTRP prior to commencing employment. Any offer of employment is conditional on the ability to obtain work authorization and to be granted access to NREL by the Department of Energy (DOE). We understand that COVID-19 may have caused delays or closures at offices, consulates, and embassies. However, NREL cannot make exceptions to work authorization and access requirements, and exceptions to these requirements are not being made for COVID-19 related delays.\n\n\nPlease review the information on our Hiring Process at https://www.nrel.gov/careers/hiring-process.html website before you create an account and apply for a job. We also hope you will learn more about NREL at https://www.nrel.gov/about/ , visit our Careers site at https://www.nrel.gov/careers/ , and continue to search for job opportunities at https://nrel.wd5.myworkdayjobs.com/NREL at the lab.",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Transportation Engineer/GIS Internship",
        "company": "Tindale-Oliver & Associates",
        "location": {
            "city": "Fort Lauderdale",
            "state": "FL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=7973f267-fd39-471a-8493-6144d07c0aab",
        "posted": "2020-07-09T01:18:55.225Z",
        "skills": [
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:18:55.225Z",
        "description": "Tindale-Oliver & Associates, Inc., a planning and engineering firm, is seeking a Transportation Engineer/GIS Intern for their Fort Lauderdale, FL office. In this role, the Transportation Engineer/GIS Intern will provide technical support and assistance to Project Managers on the production of transportation engineering designs, maps, and technical reports.\n\nEssential Functions:\n\nSupport technical analysis in project work including traffic impact analysis reviews, capacity analyses, design traffic estimates, traffic signal design, travel demand modeling, traffic simulation modeling, and access analysis/design.\nAssist with transportation engineering activities, working with staff at all levels to ensure data is accurately represented in project graphics.\nCompile and analyze planning/engineering data and prepare written summaries of analyses and conclusions.\nAssist with preparing presentation materials.\nOther duties as assigned.\n\nJob Qualifications:\n\nUndergraduate or graduate student seeking a degree in Civil Engineering, Transportation/Traffic Engineering or GIS/Geography.\nPrior work experience or internship preferred but not required.\n\nPhysical Requirements:\n\nMust be able to push, pull, bend, kneel, crouch, stoop, lift, carry or otherwise move and position objects weighing up to 25 pounds when stocking supplies and setting up equipment for up to 10% of the day.\nMust be able to sit for up to 75% of the day.\nMust be able to walk and stand for up to 30% of the day.\nMust be able to type up to 50% of the day.\n\nOther Skills/Abilities:\n\nMust be able to participate in field data collection activities.\nMust have excellent communications abilities.\nMust be able to communicate in English verbally and in writing.\nMust have knowledge of ArcGIS.\nKnowledge of major transportation software such as AutoCAD, Synchro, HCS, and Cube/FSUTMS preferred but not required.\nMust have strong organizational skills, attention to detail, and ability to multi-task.\nMust be able to work both independently and collaboratively in a team environment.\nMust be highly computer literate and have strong Microsoft Office skills.\nMust be honest and ethical.\nMust be able to pass a drug test.\nMust have valid driver's license.\n\nSince 1989, Tindale Oliver has provided industry-leading transportation, community planning, transit, and public finance solutions to public sector clients throughout the United States and has earned a national reputation for exceptional client service and insightful, actionable solutions. Tindale Oliver is headquartered in Tampa and has offices/staff in Fort Lauderdale, Jacksonville, Miami, and Baltimore.\n\nTindale Oliver offers our employees not just a job but an opportunity to shape the world for generations to come through innovative and sound design. Our employees enjoy a robust employment package that includes a competitive salary and benefits that include medical, dental, vision, life, and disability insurance, 401(k) with employer match, paid holidays and time off, tuition reimbursement, flexible work schedule, commuter benefits program,professional and career development opportunities, and other valuable voluntary options.",
        "compensation": "paid"
    },
    {
        "position": "Transportation Engineer/GIS Internship",
        "company": "Tindale-Oliver & Associates",
        "location": {
            "city": "Fort Lauderdale",
            "state": "FL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=5737742b-c52f-43cf-8c41-696b8f3a173c",
        "posted": "2020-07-09T01:18:55.868Z",
        "skills": [
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:18:55.868Z",
        "description": "Tindale-Oliver & Associates, Inc., a planning and engineering firm, is seeking a Transportation Engineer/GIS Intern for their Fort Lauderdale, FL office. In this role, the Transportation Engineer/GIS Intern will provide technical support and assistance to Project Managers on the production of transportation engineering designs, maps, and technical reports.\n\n \n\nEssential Functions:\n\nSupport technical analysis in project work including traffic impact analysis reviews, capacity analyses, design traffic estimates, traffic signal design, travel demand modeling, traffic simulation modeling, and access analysis/design.\nAssist with transportation engineering activities, working with staff at all levels to ensure data is accurately represented in project graphics.\nCompile and analyze planning/engineering data and prepare written summaries of analyses and conclusions.\nAssist with preparing presentation materials.\nOther duties as assigned.\n\n \n\nJob Qualifications:\n\nUndergraduate or graduate student seeking a degree in Civil Engineering, Transportation/Traffic Engineering or GIS/Geography.\nPrior work experience or internship preferred but not required.\n\n \n\nPhysical Requirements:\n\nMust be able to push, pull, bend, kneel, crouch, stoop, lift, carry or otherwise move and position objects weighing up to 25 pounds when stocking supplies and setting up equipment for up to 10% of the day.\nMust be able to sit for up to 75% of the day.\nMust be able to walk and stand for up to 30% of the day.\nMust be able to type up to 50% of the day.\n\n \n\nOther Skills/Abilities:\n\nMust be able to participate in field data collection activities.\nMust have excellent communications abilities.\nMust be able to communicate in English verbally and in writing.\nMust have knowledge of ArcGIS.\nKnowledge of major transportation software such as AutoCAD, Synchro, HCS, and Cube/FSUTMS preferred but not required.\nMust have strong organizational skills, attention to detail, and ability to multi-task.\nMust be able to work both independently and collaboratively in a team environment.\nMust be highly computer literate and have strong Microsoft Office skills.\nMust be honest and ethical.\nMust be able to pass a drug test.\nMust have valid driver's license.\n\nSince 1989, Tindale Oliver has provided industry-leading transportation, community planning, transit, and public finance solutions to public sector clients throughout the United States and has earned a national reputation for exceptional client service and insightful, actionable solutions. Tindale Oliver is headquartered in Tampa and has offices/staff in Fort Lauderdale, Jacksonville, Miami, and Baltimore.\n\nTindale Oliver offers our employees not just a job but an opportunity to shape the world for generations to come through innovative and sound design. Our employees enjoy a robust employment package that includes a competitive salary and benefits that include medical, dental, vision, life, and disability insurance, 401(k) with employer match, paid holidays and time off, tuition reimbursement, flexible work schedule, commuter benefits program, professional and career development opportunities, and other valuable voluntary options.",
        "compensation": "paid"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Leidos",
        "location": {
            "city": "Orlando",
            "state": "FL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=f6b84d0a-0121-4fc8-9b9c-594a9e29f087",
        "posted": "2020-07-15T01:18:57.029Z",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:57.029Z",
        "description": "Description\n\n\n\n\nJob Description:\n\nLeidos is seeking a talented Software Engineer Intern at our Orlando, FL office.\n\n\n\n\nThe candidate will work with our software innovation teams as we develop and produce cutting-edge solutions to challenging development problems. As an intern, you will work with experienced engineers in a hands-on environment which offers the opportunity to work on real-world problems. You will apply what you have already learned while gaining additional skills and knowledge.\n\n\n\n\nPrimary Responsibilities\n\n\n-Assist in programming on software development projects-Participate in the full software development lifecycle\n\n\n-Support Software Engineers in designing and implementing situational awareness tools\n\n\n-Assists in developing test routines and data.\n\n\n-Maintain accurate and complete project documentation\n\n\n\n\nBasic Qualifications\n\n\n-Pursuing a Bachelor's Degree in Computer Science or comparable with min 3.0 GPA.\n\n\n-Understanding of JavaScript, Typescript, Java, C++ or C#.\n\n\n-Prior experience using Git, SVN, or Mercurial.\n\n\n-Able to obtain a DoD Secret Security Clearance- US Citizenship required.\n\n\n\n\nPreferred Qualifications\n\n\n-Personal projects in Java, JavaScript or ReactJS.-Experience with Linux and/or Unix.-Experience with Atlassian tools including JIRA, Confluence and Jenkins.-Prior experience with virtualization using Amazon Web Service (AWS).-Familiarity with network protocols, routing and subnet masking.\n\n\n\nExternal Referral Bonus:Ineligible\n\n\nPotential for Telework:No\n\n\nClearance Level Required:None\n\n\nTravel:No\n\n\nScheduled Weekly Hours:40\n\n\nShift:Day\n\n\nRequisition Category:Intern\n\n\nJob Family:Intern Technical\n\nLeidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world's toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company's 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $10.19 billion for the fiscal year ended December 28, 2018. For more information, visit www.Leidos.com.\n\n\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.\n\n\nLeidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.\n\n\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n\n\n\n\n\nREQNUMBER: R-00036347\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet.",
        "compensation": "paid",
        "contact": "leidos@leidos.com",
        "qualifications": [
            "Bachelor's degree",
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Engineer Intern - Summer 2021",
        "company": "Belvedere Trading",
        "location": {
            "city": "Chicago",
            "state": "IL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=4e7767d8-1b64-427b-8eb5-6a938488b956",
        "posted": "2020-07-15T01:18:57.561Z",
        "skills": [
            "software engineering",
            "java",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:18:57.561Z",
        "description": "Software Engineer Intern at Belvedere Trading\n\nAt Belvedere Trading, our pragmatic Software Engineer Interns work directly with full-time Software Engineers and other interns to develop our low latency, high-performance, proprietary trading systems. They participate in all aspects of our software development lifecycle, from design to testing to deployment, and have both a love of technology and a demonstrated interest in the financial markets. We’re looking for college juniors who fit this bill.\n\nDon’t know a lot about finance or trading? No sweat. Learn as much as you can in the meantime (here are some resources to get you started) but know our Belvedere Trading University (BTU) program will teach you everything you need to know once you join the team.\n\nCore Values\n\nThe secret to our award-winning culture is our Core Values: Team Belvedere, Me In Team, Own It, Iterative Innovation, and Passionate Discourse. We live and breathe these values every day. Take a moment to learn more and see if our values align with yours.\n\nWhat our Software Engineer Interns do\n\nCollaborate – Work in a collaborative team environment which encourages constant learning and innovation from all levels of the company to build the future of technology and finance\nBTU – Participate in our in-house learning and development curriculum via peer-lead lectures to obtain knowledge about the fundamentals of trading and our proprietary trading systems\nPartner with team members to design, implement, and debug complex trading applications, ensure our software meets requirements and is testable\nCommunicate with project managers and team leadersto develop work strategies\n\nKey qualities in great candidates\n\nHigh performer – Experience developing efficient, user-friendly, extensible programs, preferably with an object-oriented programming language such as C, C#, or Java\nOwnership – Thrive in a collaborative, entrepreneurial environment\nIntellectual curiosity and passion – Desire to continuously learn in a team environment and solve challenging problems\nStrong Communication – Effectively communicate project updates to teammates and product managers\nGraduation date of December 2021 or May/June 2022 (start date of June 2021)\nExtra credit: Experience with hardware optimization and/or the financial industry!\n\nWho we are\n\nBelvedere Trading is a leading proprietary trading firm proudly headquartered in downtown Chicago. Our traders work hard to provide liquidity to the market through their market-making activities and are the masters of a diverse set of commodities, interest rates, exchange-traded fund (ETF), and equity index options. This wouldn’t be possible without the dedicated efforts of our technology teams who utilize and perfect our innovative technology solutions.\n\nOur Stance\n\nBelvedere is an Equal Opportunity Employer and is committed to providing a non-discriminatory employment environment for its employees. Discrimination against employees and applicants due to race, color, religion, sex, national origin, disability, age, military, and veteran status is prohibited. Belvedere encourages initiatives to increase diversity and provide equal opportunity to all applicants and employees. Belvedere is committed to providing a positive environment in which team members are treated with respect, dignity, and courtesy. Our firm believes in a dynamic culture of inclusion and diversity, where people thrive on individual and organizational characteristics, values, experiences, and backgrounds.\n\nPlease note that Belvedere Trading does not accept unsolicited resumes from search firms or employment agencies. Any unsolicited resumes will become the property of Team Belvedere. No phone calls, please.\n\nJob Status: Full-Time Intern\n\n\t\n\nSponsorship: Not available for this position\n\n\n\n\nWork Schedule: Regular and reliable attendance during business hours\n\n\t\n\nAmount of Travel Required: None\n\nThrough our efforts to provide a safe environment for you and our team members, all interviews for this position will be conducted virtually via phone or video. We will continue to actively hire and onboard new team members virtually through the remainder of the year unless otherwise noted. Any questions regarding the virtual recruiting process, please reach out to recruiting@belvederetrading.com.",
        "contact": "recruiting@belvederetrading.com"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Matrix Research, Inc.",
        "location": {
            "city": "Beavercreek",
            "state": "OH",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=cfe2529f-47da-4140-80e4-79d428554203",
        "posted": "2020-07-14T01:18:58.185Z",
        "skills": [
            "software engineering",
            "python",
            "matlab",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:18:58.185Z",
        "description": "Software Engineer Intern\n\nMatrix Research is a rapidly-growing, employee-owned, small business comprised of industry leaders who are advancing the state of the art in radar systems, radio frequency, and sensor exploitation technologies. We develop highly-optimized, innovative software with intuitive graphical user interfaces to meet unique requirements. Our programs span basic research through low-volume production of advanced sensing systems, subsystems, and components. Located in Dayton, Ohio, and Ft. Walton Beach, FL, Matrix offers extremely competitive salaries and benefits.\n\nMatrix Research Inc. is seeking Software Engineers Interns with experience in C++ development in our Dayton, OH location to function in the following role:\n\nDuties\n\nDevelop optimized software solutions based upon algorithmic requirements, end user needs, and runtime specifications.\nDevelop robust user interfaces for technical and non-technical users.\nAdhere to the software development lifecycle, including requirements definition, derived implementation, testing, and maintenance.\n\nRequirements:\n\nExperience with C++.\nExperience with Qt or MATLAB a big plus.\nExperience with CUDA, GPGPU, OpenCL, OpenMP, MPI a plus.\nAbility and willingness to learn new software languages (we have projects using Julia, MATLAB, Python).\nKnowledge and ability to debug coding, compiling, and linking errors.\nComfortable with multiple operating systems (we work with Linux, macOS, and Windows), development environments, and debuggers.\nAbility to obtain and maintain a U.S. DoD Security Clearance (must be U.S. Citizen).\n\nOur environment:\n\nJoel Test: https://www.joelonsoftware.com/2000/08/09/the-joel-test-12-steps-to-better-code/\n\nSource control: yes: on-premise GitLab\nOne-step build: yes: CMake-based builds\nDaily builds: yes: GitLab continuous integration (CI) builds and tests every commit\nBug database: yes: aggressively-used Jira-based bug tracker\nBugs fixed before writing new code: yes\nUp-to-date schedule: yes\nSpecs: yes\nQuiet working conditions: yes\nBest tools money can buy: yes\nTesters: yes\nCode screening: yes\nHallway usability testing: yes\n\n12 out of 12 on the Joel Test\n\nMatrix Research is an Equal OpportunityEmployer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, marital status, veteran's status, disability, sexual orientation, gender identity, national origin or any other protected class set forth by federal or state law.\n\nMatrix is a Drug-Free Workplace\n\nThis job description is designed to provide general guidance in job tasks and is not meant to be all-inclusive of the responsibilities, duties, and skills required of this position. As business demands and needs change, the essential functions of this position may be updated to reflect the needs of Matrix Research, Inc.",
        "compensation": "paid"
    },
    {
        "position": "Software Developer Intern  (Fall 2018 - Spring 2019)",
        "company": "ClearVision Optical",
        "location": {
            "city": "Hauppauge",
            "state": "NY",
            "zip": "11788"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=362c5caa-8c8f-4db9-a60d-89e79560ea2e",
        "posted": "2020-07-12T01:18:58.909Z",
        "skills": [
            "information technology",
            "software engineering",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:18:58.909Z",
        "description": "Are you a talented college student looking for a hands-on, paid internship?\n\nCould you benefit from joining an award-winning internship program?\n\nAre you a problem solver who enjoys learning in a dynamic environment?\n\nClearVision Optical was awarded Best Companies to Work in New York State the past four years in a row for small to mid size companies, and was recently recognized as Gold medalists by the Stevie award. Throughout our history, CVO has focused on customer service excellence. Come work for a values-based organization that takes pride in its culture and invests in its talent.\n\nClearVision Optical is seeking undergraduate and graduate students for select internships. We have been recognized by One Day, One Job, for our outstanding program, tailored to provide students with continuous learning opportunities. ClearVision attracts students who have demonstrated leadership (academic, athletic, artistic), are socially conscious, and have shown a commitment to giving back to others. These qualities align with our fast-paced, family-owned organization.\n\nThe intern program combines real-world experiences with mentorship, training, community service, and fun! We have hosted activities, case studies and discussions, including Speed Networking, the Science of Shopping, Social Media brainstorming, the Importance of Connectivity, and a book club with the President. This is truly a unique opportunity for top students to engage and grow within our organization. To further explore our program, please visit our online video.\n\nClearVision Optical Company Inc. Background (www.cvoptical.com):\n\nClearVision Optical (CVO) has 66 years as an optical designer and wholesaler. The company started as a small, family business. Today ClearVision is a global enterprise, serving optical professionals throughout the U.S. and in 40 countries. We offer an impressive selection of superior quality fashion optical brands, including BCBGMAXAZRIA, Ellen Tracy, Marc Ecko, IZOD, and our ClearVision house brands.\n\nWe are a values-based culture with a strong philanthropic commitment to helping the community. We pride ourselves on attracting and retaining top talent who share the same vision and dedication to making each day better for someone else. We foster a positive and meaningful working atmosphere with an emphasis on collaboration and cross-training. ClearVision is award winning for excellence in customer service and for our innovative approach to talent management. Our organization provides an entrepreneurial atmosphere with an emphasis on nurturing career development. Visit us on Facebook to see the fun that awaits you.\n\n\nInternship Program Requirements:\n\nApplicants must be enrolled in an Undergraduate or Graduate program and have a minimum GPA of 3.3\nPositions will require a commitment of:\n20 hours per week during the school semester\n30 hours per week during the summer session\nMust be responsible, organized, and goal-oriented\nProficient at using Microsoft Word and Excel\nA proven ability to initiate and maintain strong personal relationships\nPossess strong written and verbal communication skills\n\n\nSoftware Developer Intern\n\nClearVision Optical is seeking a talented college student who is looking for a hands-on Technology Internship. This is a great opportunity for a student majoring in Computer Science, Engineering, or Management Information Systems. We are looking for a detail-oriented and analytical individual with outstanding problem-solving skills. S/He should be self motivated, trust-worthy, and have proven success in multi-tasking. This role will involve participation in the full development cycle for development programs including design of software components, developing code, updating technical documents, generating test plans, ensuring code meets requirements through unit testing, and resolving discrepancy reports. The intern would be working with the IT team to participate in peer reviews and to ensure successful integration with other software components. S/He would help drive the development of cutting-edge algorithms to further our business and technology needs.\n\nInterested students can contact mmoeller@cvoptical.com!",
        "compensation": "paid",
        "contact": "mmoeller@cvoptical.com"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Alignment Healthcare",
        "location": {
            "city": "Orange",
            "state": "CA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=9aeaf79e-083b-4c8c-9e52-67be82feb4f1",
        "posted": "2020-07-11T01:18:59.887Z",
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "data visualization",
            "python",
            "javascript"
        ],
        "lastScraped": "2020-07-15T01:18:59.887Z",
        "description": "Alignment Healthcare is a data and technology driven healthcare product company focused partnering with health systems, health plans, and provider groups to provide care delivery that is preventive, convenient, coordinated, and that results in improved clinical outcomes for seniors.\n\nWe are experiencing rapid growth (backed by top private equity firms) and our engineering team is looking for the best and brightest leaders. Data and technology inform the way we make decisions. We love our customers and understanding them better makes it possible to provide the best clinical outcome and care experience.\n\nWe seek front-end engineering interns, who have a passion for learning and experimentation. The products and services that we develop will enable next generation care delivery models for seniors. We are looking for talented engineers to execute amazing web & mobile app experiences for our users. The ideal candidate will enjoy working alongside a diverse team that includes other engineers, data scientists, designers, users, and clinicians.\n\nSkills & Requirements\n\nYou’re passionate about writing code, building amazing products and delivering the highest caliber of code.\nYou like working with teammates to innovate and build products you will be proud of.\nYou love learning new skills and working on a variety of projects.\nYou have hands-on experience with Javascript and any related frameworks (React, Vue, Node, etc).\nYou have hands-on development experience using C#, Java, Python or Go.\n\nResponsibilities:\n\nCollaborate with product management, engineering, and clinical leads to define and implement innovative solutions for the product direction, visuals and experience.\nTranslate concepts into wireframes and mockups that lead to intuitive user experiences.\nOwn feature quality throughout the development, testing and deployment phases to ensure quality delivery expectations are met.\nConduct new technology research, proof of concept, and design work that will provide direction for the enhancement of the overall system and products.\nContribute to software engineering best practices for design, coding standards, performance, security, delivery, and maintainability.\n\nMinimum Qualifications:\n\nStrong analytical and problem-solving skills.\nAlready possess or are working toward a Bachelor’s Degree in Computer Science or related field\n1+ years of work or academic experience with the Web Services lifecycle (design, build, test, deploy).\nExperience (academic or work) in designing and developing software, including object-oriented design or object-oriented programming, in course-assigned and/or hobby projects.\nUnderstands the fundamentals of data structures, algorithm design and analysis.\nExposure to software development best practices through academic study, architectural reviews, CI/CD build automation & deployment, automated test frameworks and continuous performance monitoring\nProficiency in Javascript, HTML and CSS\nKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\nExperience (work or academic) designing, creating, testing, and consuming REST APIs.\nExperience building Web forms from JSON Schema that can be rendered after retrieval from a database.\nExcellent oral and written communication skills.\nHunger to learn, particularly an intense usability curiosity.\nAble to dive into the source code of front-end libraries to debug, patch, and extend them when necessary.\nCritical thinker and solutions-oriented.\n\nPreferred Qualifications:\n\nExperience in React JS \nMobile development experience\nProficient in a broad range of software design approaches and common UX patterns.\nExperience in view layout and rendering technologies\nExperience in lazy loading assets, CDNs, caching and compression.\nUnderstands how to be efficient with resource usage (e.g., application impact on memory and CPU, caches appropriately, respectful of customer’s devices, etc.).\nExperience with scrum methodology.",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Software Engineer Intern",
        "company": "Pinnacle Solutions, Inc.",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=51b80842-c781-4f81-8d68-d46957364199",
        "posted": "2020-07-11T01:19:00.548Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:00.548Z",
        "description": "COMPANY DESCRIPTION\n\nPinnacle is seeking a Software Engineer Intern to support our Engineering business area. Pinnacle, headquartered in Huntsville, AL, is a leading innovator, developer, and provider of defense and aerospace products and services. Pinnacle fosters a corporate culture with many opportunities for advancement and career progression. We are a dynamic, fast-paced organization that is experiencing exponential growth. Pinnacle has been on the Inc. 5000 Fastest Growing Companies list in 2012, 2013, 2015, 2016, 2017, 2018 and 2019!  Pinnacle offers competitive, traditional benefits, and we are excited about our Employee Stock Ownership Program (ESOP)!\n\nAbout Huntsville -\n\nMilitary, space, telecommunications, biotechnology, diversified manufacturing and a variety of emerging specialties provide challenging work in delightful surroundings. The area enjoys a favorable cost of living and quality of life. Mountains, lakes, woodlands and the Tennessee River accommodate numerous recreational activities. A temperate climate enhances the season for outdoor sports, including world-class golf, hiking, biking, and fishing. Major concerts, Broadway and symphony performances, extensive permanent collections and traveling exhibitions contribute to a wonderful way of life.\n\nHuntsville, Alabama is one of the most recognized cities in the Southeast - consistently named as one of the best places to live and work by a variety of national publications. Our city is regularly named as a premier location for both business and quality of life.\n\n\nJOB DESCRIPTION\n\nPinnacle is looking for software engineering interns to support our Virtual and Web-Based programs team in the development of\nSerious Games, Virtual Laboratories, and Virtual Maintenance/Operator Training for aviation and ground vehicle platforms! The\nselected candidates will work with experienced engineers and support various software engineering activities such as requirements\nanalysis, design, development, documentation, integration, debugging and test.\nThis is an intern position scheduled to end December 11, 2020.\n\nSKILLS/EXPERIENCE REQUIREMENTS:\n\n1) Self-motivated, willing to learn, and interested in working in a team environment\n2) Proficient in Microsoft Office applications is required\n3) Exposure to an object-oriented programming language such as C#, Java, Python, etc.\n4) Knowledge of web development languages/tools such as Javascript, CSS, React a plus.\n5) Solid verbal and written communication skills are desired\n6) Demonstrated team work experience is desired\n7) Self-motivated, willing to learn, and interested in working in a team environment\n8) Previous internship/co-op experience is a plus\n9) Demonstrated professional, community, and/or extracurricular activities are desired\n\nEDUCATION REQUIREMENTS\n\nMust be a student who is in enrolled and pursuing an undergraduate or graduate degree from an accredited college/university.\nMust be majoring in an engineering or computer science related field.\nHave an overall cumulative GPA of 3.0 (on a 4.0 scale) or higher.\n\nSPECIAL REQUIREMENTS (Certifications, Etc.)\n\nMust be a US Citizen. \nMust be available to work 20 hours/per week during normal business hours until December 11, 2020.\nMust be able to telework until OPCON 3 is reduced.\nMust be a US citizen\n\nADDITIONAL INFORMATION\nPinnacle Solutions is an equal opportunity employer. Minorities/Females/Disabled/Veterans",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Engineering Intern",
        "company": "Schweitzer Engineering Laboratories",
        "location": {
            "city": "Pullman",
            "state": "WA",
            "zip": "99163"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=629a89b3-0d52-45cb-b987-10aae0890caa",
        "posted": "2020-07-10T01:19:01.162Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:01.162Z",
        "description": "Essential Duties and Responsibilities1. Support SEL's software development process 2. Verify that software meets requirements.3. Implement firmware/software design.4. Provide support to engineering staff as needed.5. Follow engineering quality assurance procedures.6. Continuously identify, measure, and improve processes.7. Follow and apply SEL Values, Principles of Operations, and World Class Manufacturing Principles.8. Understand. Create. Simplify.9. Other duties as assigned.\n\nRequired QualificationsCurrent student pursuing a degree in computer science or equivalent with at least one year of technical coursework completedProgramming experience in C#, C++, Java or equivalent OO programming languageAbility to execute and document defined testing proceduresStrong writing, documentation, and speaking skillsAbility to learn new skills and assume new responsibilitiesAbility to work cooperatively in a team environmentBackground check results satisfactory to SELNegative drug test result(s)\n\nPreferred QualificationsExperience using scripting languages, such as Python, Javascript, Perl, Ruby Practical knowledge of developing Microsoft Windows applications Knowledge of SQL and database concepts Experience using revision control and source code management systems such as Git, Mercurial, SVN, and Rational ClearCase Physical RequirementsNone\n\nSEL is an Equal Opportunity Employer: M/F/Vets/Disabled.\n\nSEL invents, designs, and builds digital products and systems that protect power grids around the world. This technology prevents blackouts and enables customers to improve power system reliability and safety at a reduced cost. A 100 percent employee-owned company headquartered in Pullman, Washington, SEL has manufactured products in the United States since 1984 and now serves customers worldwide. Our mission is simple: to make electric power safer, more reliable, and more economical.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran."
    },
    {
        "position": "Machine Learning and Artificial Intelligence Intern - Downtown Austin",
        "company": "ThisWay",
        "location": {
            "city": "Austin",
            "state": "TX",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=2b425062-b0d2-440b-8174-cf5ff1bde424",
        "posted": "2020-07-09T01:19:01.786Z",
        "skills": [
            "java",
            "machine learning",
            "information technology",
            "software engineering",
            "artificial intelligence"
        ],
        "lastScraped": "2020-07-15T01:19:01.786Z",
        "description": "Description\n\nThisWay Global is an Austin-based startup in the recruitment space and we are looking for engineering interns to work with large datasets that will help people find jobs.\n\nWe have a suite of products designed to streamline and reduce the headache of sourcing top qualified candidates.Our company builds artificial intelligence and automation technology for the HR tech space, servicing SME and enterprise customers. We are currently looking for a talented Engineering Intern to join the team in our Austin, TX office. For this internship you must be living in the US and also be a US Citizen. Due to the current hiring freeze this is an unpaid, volunteer intern position.\n\n\n\n\nOn a daily basis you may be asked to do any one of the following jobs :\n\nAnalyze datasets and determine best approaches for normalization\nDefine and perform comparative analysis to determine the best algorithms to use for each dataset\nPropose and code/build (using Kotlin/Java and supporting libraries and systems) various ML/AI/computational algorithms for normalizing the datasets\nRequirements\nCurrently pursuing BSc/MSc in Computer Science or related major\nFluent in at least one JVM based programming language (Java/Kotlin – Kotlin preferred)\nConversant with Spring/SpringBoot and/or willing to learn\nExperience with AI (ML, Deep Learning) and data science would be a plus, especially Java/Kotlin libraries like Smile, DeepLeaning4J, Jenetics, Krangle\nHighly motivated to learn and be up-to-date with technology\nYou must be a self-starter with the ability to work autonomously.\nYou need to be able to stay calm and positive when solving a problem with a team.\nBenefits\nYou will be developing products that will help people find jobs with great companies, without using outdated job search processes.\nTailor-made mentorship program - we are interested in hiring full-time after the internship.\nFlexible in terms of working schedule.\nWorking with a top-level team that is experienced in building successful startups.\nWe have a great office located downtown Austin. close to restaurants, hike/bike and running trails.\nApply for this job",
        "compensation": "unpaid",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Development Intern",
        "company": "The Social Station",
        "location": {
            "city": "Coopersburg",
            "state": "PA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=7d05946c-2026-47aa-a15c-12da93eb8668",
        "posted": "2020-07-07T01:19:02.516Z",
        "skills": [
            "software engineering",
            "java",
            "mobile development"
        ],
        "lastScraped": "2020-07-15T01:19:02.516Z",
        "description": "Description\n\nMUST BE LOCAL OR WILLING TO WORK IN THE AREA FOR INTERNSHIP OVER THE SUMMER!\n\n\n\n\n\nThe Social Station is looking for a summer intern for our software development team. The candidate should currently be seeking a degree in Computer Science, Computer Engineering or a related field and should have development experience. At The Social Station you will have an opportunity to work on production level software systems as well as use modern tools and frameworks. Our ideal candidate is self motivated, able to understand how broad requirements translate to functional features and has experience working in a team environment as well as owning a full feature themselves.\n\nRequirements\nPrevious Java/JavaEE development experience\nAn understanding of Database design and SQL\nPrevious Android development experience\nGit/GitHub experience\nComfortable working on a Mac\nAn understanding of how API’s work and how to integrate with them\nSocial Media API experience is a plus\nAngularJS experience is a plus\nPrevious Spring/Hibernate experience is a plus\nApply for this job"
    },
    {
        "position": "Software Engineer Intern",
        "company": "ShareThis, Inc",
        "location": {
            "city": "Palo Alto",
            "state": "CA",
            "zip": "94304"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=546caeec-e052-49a3-b77a-1810dde1919a",
        "posted": "2020-07-03T01:19:03.188Z",
        "skills": [
            "machine learning",
            "software engineering",
            "java",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:03.188Z",
        "description": "About Us:\n\nShareThis is a data company that is focused on providing the highest quality Internet user audiences to marketers. To fulfill this objective, the company hires and trains top notch engineers, who are capable of developing terabyte scale architectures and building cutting edge machine learning models. This summer, the ShareThis Data Science team is looking to hire several unpaid interns to help with these architectures and models, while learning about advertising technology and real-world applications of Apache Spark, NLP, text embeddings, and Neural Networks. An exceptional candidate with stellar performance will be given an offer to join ShareThis after the internship, subject to hiring availability.\n\nNOTE: This is an UNPAID summer internship with ShareThis.\n\n\nResponsibilities:\n\n\n\nBuild, evaluate, and deploy cutting edge models in machine learning and NLP\n\n\n\n\nContribute to design, architecture, and development of terabyte scale real-time and batch architectures\n\n\n\n\nDeliver software projects using agile development processes\n\n\n\n\nDrive product quality and direction by collaborating with users, product managers, and other engineers\n\n\n\n\nParticipate in code reviews and architecture discussions\n\n\n\n\nWork with and learn from top scientists and engineers in high tech industry\n\n\n\n\nLearn and understand the advertising technology industry and ecosystem\n\n\n\n\nLearn and utilize big data tools, such as Apache Spark, BigQuery, and AWS\n\n\n\n\nMake a presentation at the end of the summer about your progress and achievements\n\n\n\nRequirements:\n\n\n\nStudents in STEM with at least a bachelor’s degree or near graduation from top STEM programs\n\n\n\n\nGPA of 3.5 or higher\n\n\n\n\nStrong coding experience in Scala or Java\n\n\n\n\nPrior experience with building and evaluating machine learning algorithms\n\n\n\n\nUnderstanding of Apache Spark, MapReduce, HDFS, Cassandra, and Kafka\n\n\n\n\nStrong understanding of algorithms and data structures\n\n\n\nPreferred Qualifications:\n\n\n\nGPA 4.0\n\n\n\n\nStudent near completion of their MS or PhD in STEM from a top program \n\n\n\n\nStrong record of publications and conference talks",
        "compensation": "unpaid",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Software Engineer, Intern/Co-op",
        "company": "Facebook",
        "location": {
            "city": "Pittsburgh",
            "state": "PA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=d85f9626-2c8b-4d80-ab40-2853fa7c2a38",
        "posted": "2020-06-30T01:19:15.695Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:15.695Z",
        "description": "Intro:\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nSummary:\n\nWant to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems? Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately. Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n\nRequired Skills:\n\n1. Code high-volume software using primarily C++ and Java\n\n2. Create web applications using primarily PHP\n\n3. Implement web interfaces using XHTML, CSS, and JavaScript\n\n4. Build report interfaces and data feeds\n\nMinimum Qualifications:\n\n5. 1 or more years of experience with perl, java, php, python, or c++\n\n6. Must be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\n\n7. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nPreferred Qualifications:\n\n8. Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications\n\n9. Intent to return to degree-program after the completion of the internship/co-op\n\n10. High levels of creativity and quick problem-solving capabilities\n\nIndustry: Internet\n\nEqual Opportunity: Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "contact": "ext@fb.com",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "(Fall 2020) - Computer Vision, NLP and Machine Learning Intern",
        "company": "Matician, Inc.",
        "location": {
            "city": "Palo Alto",
            "state": "CA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=deeb820b-21ab-450e-a702-e8306310f689",
        "posted": "2020-06-25T01:19:16.237Z",
        "skills": [
            "machine learning",
            "python",
            "deep learning",
            "robotics",
            "information technology",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:16.237Z",
        "description": "About Us\nThere are products that customers think are cool at the moment, and then there are products that customers cannot live without because they are so incredibly useful. At Matician, we are building the latter because these are the products worth spending our lives on. We want to build great products to solve real problems.\n\n\nWe believe that sensors and algorithms are finally good enough to reimagine home devices and apply Level 5 autonomy and mobility so that people can save time and energy bypassing repetitive and mundane tasks inside the home.\n\n\nWe're a small team with a singular focus on product that combines technologies such as vision, ML, structure-from-motion, and robotics. Our goal is to ship products that people love. \n\nJob Description\nComputer Science/Engineering Student to join our early core team in the process of receiving a BS/BEng or MS/MEng or related discipline. \n\n\nWe are looking for someone who is:\nAn out-of-box thinker and doer, unafraid of solving really-hard-problems, and willing to do whatever it takes to ship extremely useful products. \nCurious, asks lots of questions, challenges conventional wisdoms, and doesn’t shy from contrarian opinions/approaches.\nSomeone who prioritizes user needs, functionality, and usefulness\nDetail-oriented and has pride in their work. \n\n\nQualifications\nAbility to solve problems and identify areas of improvement\nAbility to write clean, reliable code that can be easily maintained\nExperience with Python, Experience with Tensorflow, PyTorch or Numpy a plus \nExperience with working on computer vision, machine learning or NLP problems \nAbility to work in a fast-paced, autonomously driven, and demanding start-up atmosphere.\n\n\nResponsibilities\nCollaborate with the HW, SW and Algorithms team to bring product vision to life.\nEverything involved in applying an ML model to a production use case\nDesigning and coding up the neural network architecture, gathering and refining data, training and tuning the model\nDeploying it at scale with high throughput and uptime\nAnalyzing the results in order to continuously update and improve accuracy and speed"
    },
    {
        "position": "Software Developer Intern",
        "company": "APN Software Services Inc.",
        "location": {
            "city": "Houston",
            "state": "TX",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=d6e0cc50-7bbc-41e2-be90-e8e7947150f2",
        "posted": "2020-06-25T01:19:16.959Z",
        "skills": [
            "software engineering",
            "data visualization",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:16.959Z",
        "description": "We have Job Opportunity for Software Developer Intern at Houston, TX with direct client. Please go through Detailed Job description below. \nDuration: 6-9 months. Contract only    \nHere is a brief Job description:\nResponsibilities: \nCreate a web service front end for new and existing API(s). Use one’s strong knowledge of .NET Core Web API and C# to create a web service front end utilizing those API(s). Document code to the satisfaction of the project team lead. Practice good code management using tools such as Visual Studio and Gitlab. Interact with developers and other staff to define, design, and implement. \n \nRequirements: \nStrong knowledge of .NET Core Web API and C#. Computer programming experience and knowledge of software development process. Prefer college junior or higher but will consider other applicants with demonstrated programming experience in the relevant technologies. Computer science background preferred but other technical degrees will be considered; it is the elite coding skills that matter most. Critical thinking skills essential. Candidate will work with staff members so interpersonal skills are a must. GPA of 3.0 or better. Be a quick learner, think logically, and be open minded and creative. Good communication skills in English. Familiarity with Microsoft Windows family including Windows Server and Windows 10. Familiarity with or ability to learn Postman. Familiarity with Selenium or other automated web testing frameworks is a plus. Knowledge of Power Systems transmission or distribution industry is a big plus: if you are a power systems engineer who can work wonders with web APIs or if you are a web services guru who happens to know a bit about power systems, you have the kind of cross-discipline skills which is a core of our business success. \n\n\nIf you have the above qualification and interested to apply please reply with your updated resume, contact no. and expected pay rate and I will contact you to discuss further."
    },
    {
        "position": "Intern Robotics + AI Engineer",
        "company": "Kiwi Campus Inc",
        "location": {
            "city": "Berkeley",
            "state": "CA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=9f80b7a7-07eb-4e8d-b4db-914ff09f7540",
        "posted": "2020-06-25T01:19:17.692Z",
        "skills": [
            "machine learning",
            "robotics",
            "software engineering",
            "python",
            "artificial intelligence",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:17.692Z",
        "description": "Kiwibot is a sustainable robotic delivery infrastructure that offers cities and companies an array of product mobility. Kiwibot aims to revolutionize the mobility of atoms within cities and campuses by empowering restaurants and carriers with contactless, more efficient, and affordable transportation of food, CPG, and any product transportation options that improve urban sustainability.\n\nWe believe robotics can play a significant role in the final solution for the last mile delivery problem, we want to further develop the areas of control, perception, vision, and analysis systems for making delivery easier, faster, and safer for people and or robots.\n\nWe're looking for a Robotics, Control, and Systems AI intern, that will work closely with roboticists, hardware, software developers, and machine learning engineers. You will ensure robotic system requirements are achieved through design analysis and characterization, controller design, system integration, and test programs to deliver robust and performant kiwibots.\n\n\nReport to the Head of AI & Robotics\n\n\nWhat you'll do?\nDrive architectural and design decisions including sensor and actuator selection from a holistic perspective to produce controllable systems.\nDesign and implement controllers and estimators for robotic subsystems and integrated systems. Lead system integration and bring-up efforts. Validate performance, expose issues, and identify root causes. Assess the impact of issues on the Robot's system.\nDirectly support systems engineering efforts, participate in safety analyses, and contribute to design, and reviews.\n\n\nWhat we need from you?\nExperience with robot geometry, kinematics, dynamics, and control.\nCoding experience (including C/C++, and Python, Git).\nROS, ROS2(Desired)\nGood programming and documentation practices\n\n\nPreferred Qualifications:\nExperience with engineering systems\nExperience designing and controlling robust electro-mechanical and robotic systems. Electro-mechanical test and code debugging experience.\nExperience with cameras, LIDARs, and IMUs.\nDevelopment and production applications and environments.\n\nWhat you get from us?\n-A very innovative company that will grow as you grow \n-Challenging problems that will make you leverage your data skills in the short term \n-Since we are highly focused on results you can manage your own time and work from home some days of the week \n-Be a part of a young group of people that is willing to change global scenario of the last-mile delivery challenges \n-Understanding of the processes involved in entrepreneurship and growing a company from scratch (very important if you are thinking about building your own business in the future)"
    },
    {
        "position": "Software Engineer (Intern)",
        "company": "Platform9 Systems, Inc.",
        "location": {
            "city": "Mountain View",
            "state": "CA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=7eaccdfa-a7c1-4f6a-bb51-0d5b051feae2",
        "posted": "2020-06-25T01:19:18.442Z",
        "skills": [
            "javascript",
            "software engineering",
            "python",
            "java",
            "C and C++",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:18.442Z",
        "description": "We need hackers who are versatile, breathe technology and capable of taking on challenging problems across the stack.\n\n\nAre you passionate about scalable distributed systems? Want to solve challenges in security and networking? How about delivering an amazing user experience through a modern Web UI? Or just hack up great tools and frameworks under the mentorship of some the industry’s greatest talent? Then Platform9 has interesting internship opportunities for you. As a key member of our engineering team, you have the opportunity to experience and contribute to a real world private cloud product.\n\n\nRequirements\n\n\nCurrently pursuing BS, MS or PhD in computer science, engineering, math or related field. Prefer 8-12 months to graduation. PhD candidates can be in any year. Preferred Qualifications:\n\n\nCoursework in one or more areas: operating systems, distributed systems, networks, security or user interface design\nKnowledge of Linux/Unix Systems\nProgramming proficiency in any one language: python, javascript, C/C++, java, golang\nGPA 3.5 and above\n\nBenefits\n\n\nStartup culture with the freedom to innovate and take initiative\nRapidly growing company\nPeriodic company paid lunches, massages and happy hours",
        "compensation": "paid"
    },
    {
        "position": "Software Engineering Intern",
        "company": "RevolutionParts, Inc.",
        "location": {
            "city": "Phoenix",
            "state": "AZ",
            "zip": "85034"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=28f975c4-71f4-4a6f-bb7d-e32b622e2cc4",
        "posted": "2020-06-25T01:19:18.992Z",
        "skills": [
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:18.992Z",
        "description": "We are RevolutionParts, and we are on a mission to disrupt and innovate the auto parts e-Commerce industry creating the most active dealer network in North America empowering 1 billion in annual in GMV. Our ongoing focus is to build THE essential tool for dealers that keeps customers coming back. We believe that things are better when each and every one of us is working towards the same set of goals, and we are beyond excited that you’d consider joining us on our mission. \n\n\nRevolutionParts launched in 2014 with a simple g oal: use our decades of experience to revolutionize an archaic industry, empowering people to stay mobile by transforming the way parts buyers and sellers connect.  Make the process dramatically more efficient. Make it hassle-free. Provide the best solution. And of course, do it online. The automotive industry is primed for a revolution and we are leading that call.  \n\n\nWelcome to RevolutionParts!\n\n\n\n\n\nWe’re looking for our next software engineering intern to join our team to learn, innovate, and grow and do some coding along the way. You will work with our engineering team on creating, developing and maintaining highly-available distributed systems that power our RevolutionParts stores and our automotive parts Catalog APIs. You will also gain hands-on experience creating internal tools to improve and automate our tech operations. Get the opportunity to report directly to our Director of Engineering.\n \nYour Impact on Our Mission\n\n\nObjective (why does this internship exist)\nGain exposure and contribute to building THE industry-leading eCommerce a platform that revolutionizes how auto parts are bought and sold. \n\n\nKey Result (how does the internship contribute to our mission)\nLearn how to work with an agile engineer teaming to develop innovative, simple, yet cutting-edge SaaS solutions that WOW our customers\n\n\nLearning Outcomes  (what will the learning opportunities be for this role)\nGain hands-on experience using a full tech stack and receive guided mentoring and education from Sr. and Staff engineers with years of experience working at high tech, fast-paced SaaS and technology environments.   \n\n\nWho You Are\n\n\nAgile with the ability to communicate and collaborate within the team and cross-functionally\nNo Ego, no fear...the best idea wins, period!\nTenacious learner...you relish learning new things and practicing those things in a dynamic and fast-paced company \nCurious...you love to ask why and enjoy creative “solutioning” via an innovative approach. \nResponsible with a high level of self-management and organizational skills\n\n\nDay in the Life\n\n\nParticipate in the Agile/SCRUM meetings and sprints\nAnalyze & identify system-level integration issues\nDevelop & integrate new features\nDevelop & execute test scenarios\nWork closely with Sr. and Staff engineers on creative solutioning\nParticipate in code reviews\n\n\nWhat You Have\n\n\nMust be working towards a degree in Computer Science or a related discipline\nFamiliarity with at least one scripting language\nOO design background\nSome Experience with Linux/Unix\nGreat written and oral communication skills\n\n\n\nThe Details\n\n\nAre you willing to work with the school to ensure college credit? Yes!  We know the forms you need to be completed, and what needs to be signed off on.  We are happy to support your learning. \nWhat’s the schedule? The schedule is flexible around your classes. Let’s design it together. \n\nIf this is you, then please: (share your resume along with any relevant uploads or links to your work)\n\n\nPlease Note: Before applying for the internship, know that we take hiring very seriously. Interviewing with us may include video, phone, and on-site interviews, projects, and scenario-based situations. Although we are unable to follow up with each and every candidate, we do our best to run a thorough process for candidates with whom we identify a potential fit.\n\n\nWe Offer\n\n\nFlexible Scheduling\nRecognition and Rewards for a job well done\nCasual Dress where Jeans are welcome\nThe opportunity to make a difference in a fast-growth startup environment with lots of potential for growth\nA fun and focused atmosphere where we think big and own it together\nA great space with food...lots of food\n\n\nBuilding a diverse and inclusive workplace is core to who we are. We realize the power of diverse perspectives, experiences, and backgrounds. RevolutionParts is dedicated to creating an environment focused on inclusion and education—we invite and welcome people of all different backgrounds, experiences, perspectives, and abilities.\n\n\nAbout Us\n\n\nWe are grateful and proud of the company we’ve built so far.  Our people are our biggest competitive advantage and we’ll continue investing in our “Revolutionaries” and people-first culture. We are looking for our next intern teammate to join a community that is dedicated to revolutionizing the automotive industry.  We have a dream to disrupt and challenge old notions by thinking big and wowing our customers. By prioritizing the customer and crafting an experience based on their feedback, we have created THE e-Commerce platform solution, kicking off a series of industry-disrupting changes showing our customers that there is a better way. Together, we are radically reshaping how auto dealers think about selling parts and creating a great shopping experience to boot—and we’re just getting started.\n\n\nWe are a growth culture!  What that means is you will be expected to learn, innovate, and adapt in our fast-moving, start-up environment.  We are looking for teammates, not employees, who will embrace a collaborative partnership mentality, lead by example, think big and own it to deliver innovative results.  We succeed as a team with no room for ego. If you want to be part of something historic, and you are ready to take up our mission as your own by adding direct value to our cause, we want to invite you to share your unique knowledge and gifts with our community.  We look forward to hearing from you!"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Experian",
        "location": {
            "city": "Costa Mesa",
            "state": "CA",
            "zip": "92626"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=93808ffd-7d26-4d5f-bc68-50de6e2b292d",
        "posted": "2020-06-21T01:19:20.488Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "java",
            "DevOps",
            "machine learning",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:20.488Z",
        "description": "JOB DESCRIPTION | Software Engineering Intern\n\nThe Experian Summer Internship Program is a unique opportunity to apply your knowledge and experience in a fast-paced, innovative company. As an Experian intern, you will work on challenging assignments with a clear understanding of your contribution to our organization, all while working with the latest technology and tools. Our program includes weekly \"intern-only\" events including meeting executive leaders, career development workshops, and opportunities to network with your 100+ fellow interns.\n\nOur internship program is virtual this year, running from June 15 - August 21. To be eligible, you must be pursuing a four-year degree and able to start with one of the cohorts.\n\nWhat you'll be doing\n\nThis is a software engineering internship position with the DevOps group of North America's Decision Analytics business unit. You will develop an application to aggregate transaction information from multiple systems and implement a reporting interface to automate the generation of metrics and reports. Your activities will include:\n\n\nReview current transaction availability metrics monthly process and understand goals/definitions\nReview all existing automation solution, and assess strengths/weaknesses\nFor each existing system, meet with technical resources to understand and document data sources\nDocument requirements to clarify all reporting data points / dimensions / granularity needs.\nUnder the direction of our senior engineers, design a data aggregation architecture and data store (DynamoDB)\nImplement the selected architecture, and work with the DevOps team to integrate all data sources\nSelect a data presentation tool and create sample reports / dashboards that are readily usable\n\nWhat you'll need to bring to the party\n\n\nInterest and enthusiasm. We are a passionate group of software engineers and love to apply our knowledge and debate our decisions. Come willing to learn and share.\nWillingness to learn. Our team is populated by engineers with a breadth of experience. Bring an open-mindedness and desire to sit and learn and contribute to our day to day.\nBring a sense of humility and humor. None of us are perfect, but we're always willing to listen and learn.\nAbility to work independently and resourceful finding solutions to complex problems\n\nMore about you\n\nComputer Science major in a leading college with superior GPA\nKnowledge/experience in relational databases and nosql data stores. DynamoDB a strong plus.\nKnowledge/experience in leading programming languages such as Java, Python, C++, etc.\nTechnology-focused extra-curricular activities a strong plus.\n\nWhy interns are critical to our success\n\nOur business only thrives if we're constantly innovating new and better ways of doing things. We look to interns to keep us up-to-date on industry trends and new ways of working.\nInterns are critical to our early career talent strategy. We think of our internship program as an extra-long interview process. We are selective, because we know we are hiring future Experian employees!\nMany interns pick up projects that teams would normally need extra hands to complete. Interns play a critical role in closing the loop on long standing projects or starting something smaller with a big impact!"
    },
    {
        "position": "Lojix Software Development Intern",
        "company": "Canvas Inc.",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=a403bbfd-b106-405e-9b0c-162401ae2285",
        "posted": "2020-06-19T01:19:21.334Z",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "web development"
        ],
        "lastScraped": "2020-07-15T01:19:21.334Z",
        "description": "If being part of an emerging software and technology company where you can gain exciting, hands on technical experience, in a laid-back environment is exciting to you, this may be your perfect opportunity! We are looking for an undergraduate or graduate level student who is ambitious, hard-working, and ready to gain first hand experience working on an enterprise software tool.\n\nLocated in the historical Times Building downtown, Canvas is just a short walk to all of the exciting growth and development in downtown Huntsville.\n\nJob Duties:\n\nResponsibilities will vary based on the student's knowledge base and team needs. Tasks may include but are not limited to:\n\nSoftware Development\nSupporting the development team by writing code and resolving bugs in the system\nAttending and participating in SCRUM meetings\nDocumentation\nAssist the team in keeping technical documentation up to date and accurate\nQA and Testing\nWriting automated unit and functional tests\n\nRequired Qualifications\n\nCandidates must be enrolled in a degree program in a relevant discipline (i.e. Computer Science, Mathematics, Information Systems, etc)\nSome software development experience (any language)\nUnderstanding of core computer science principles and best practices (i.e. Object Oriented Programming)\nExcellent communication, team participation, and prioritization skills\nUS Citizenship is required\n\nPreferred Qualifications:\n\nExperience with:\nHTML, CSS, JavaScript, JQuery\nPHP, Java\nMySQL or any relational database\nGCP (Google Cloud COmpute)\nGit",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Applications Engineer Intern",
        "company": "Apex Microtechnology",
        "location": {
            "city": "Tucson",
            "state": "AZ",
            "zip": "85741"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=5e8601f4-a455-4605-a9cb-12950241906e",
        "posted": "2020-06-19T01:19:22.139Z",
        "skills": [
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:22.139Z",
        "description": "The Applications intern performs tasks related to support of Apex’s leading-edge power analog and voltage reference products. The tasks are selected to develop practical skills and training in applications of power operational amplifiers, pulse width modulation (PWM) switching amplifiers and precision voltage references. Working closely with seasoned analog applications engineers the intern gains valuable work experience in real world power analog applications.\n\nEssential functions and Responsibilities:\n\nAssist in real world application support cases through lab work to help the application engineer resolve customer support request.\nParticipate in the design and validation of evaluation kits to support new product introductions.\nAssist in failure analysis to determine the root cause of field failures.\nPerform other related duties as requested or required"
    },
    {
        "position": "Software Engineer - INTERN",
        "company": "TransEnterix, Inc.",
        "location": {
            "city": "Raleigh",
            "state": "NC",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=ec15bed0-651f-4ddc-9f75-4d10417b695b",
        "posted": "2020-06-17T01:19:23.040Z",
        "skills": [
            "software engineering",
            "robotics",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:23.040Z",
        "description": "TransEnterix is looking for a Software Intern to join our new technology development team for the summer. This is a unique opportunity to be a part of the development of a next-generation surgical robotics system. This role would provide opportunities to integrate new complex technologies, develop applications and learn about robotic systems. Must be willing to learn and adhere to good software practices and be able to work in a team environment. The successful candidate will have a background programming in a C based language, and a strong desire to learn new technologies.\n\nQUALIFICATIONS:\n\nRising Junior or Senior majoring in Computer Science, Computer Engineering or Equivalant\nC\nC#/C experience a plus"
    },
    {
        "position": "Fall IOC Intern",
        "company": "Q2 Software, Inc",
        "location": {
            "city": "Austin",
            "state": "TX",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=45913046-f72c-4d76-b3a4-1f90c09ab856",
        "posted": "2020-07-14T01:19:23.904Z",
        "skills": [
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:23.904Z",
        "description": "Internship Program Description:\n\n\nQ2 is seeking energetic, innovative, “out-of-the-box” thinkers with a passion for software and technology to join our Integrated Operations Center for 2020.  \n\nThe Internship program is 4-6 months long, and all positions are paid hourly with an average workweek of fewer than 29 hours per week.  In addition to your project-based internship role, you will be given the opportunity to learn and shadow from other IOC and Hosting employees and have the opportunity to present on your internship experience to the team at the end of the program.\n\nRole description:\nWe are seeking an IOC Analyst Intern to join our IT team to assist and provide first escalation support in the monitoring, troubleshooting and support of various Linux and Windows operating systems, databases, utilities, system tools and the hardware on which they reside. As an IOC Analyst, you will respond to monitoring alerts and cases, drive investigations and provide triage during incidents and outages for services that the IOC supports across Q2. You will join a passionate and collaborative team of people who are focused on providing exceptional support to our customers and internal teams.\n\nResponsibilities:\n\nProactively respond to alerts generated by monitoring systems to maintain environment health and stability\nResolve issues by following documented processes and pre-defined standard operating procedures\nMonitor and analyze logs and alerts from a variety of different technologies across multiple platforms in order to identify and mitigate security incidents and maintain the integrity of corporate information\nLeverage network security tools and capabilities to analyze potential cyber threats from a variety of intakes taking appropriate response actions to include threat containment and/or escalation\nDocument troubleshooting results and remediation actions, provide regular status updates to impacted customers\nIdentify and escalate critical impact to on-call teams\nCreate and maintain operational runbooks in support new and changing infrastructure\nPerform daily IOC tasks, including managing a case workload, responding to escalated issues and operational checklists\nEnsure proper transition during shift change",
        "compensation": "paid"
    },
    {
        "position": "Fall 2020 Refrigeration Application Designer, Intern/Co-op 1",
        "company": "The Kroger Company",
        "location": {
            "city": "Cincinnati",
            "state": "OH",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=89210b67-1ddf-482c-b595-46f38fe9cdfc",
        "posted": "2020-07-12T01:19:24.553Z",
        "skills": [
            "software engineering",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:24.553Z",
        "description": "Company Name: Kroger General Office\nPosition Type: Intern\nFLSA Status: Non-Exempt\n \n\n \n\nPosition Summary:\n\nComplete a three, six, nine or twelve month session between or in conjunction with college semesters or quarters working as a member of the Facility Engineering team. Under the guidance of a manager, the intern/co-op will manage mechanical application projects through direct communication with project managers in the divisions and general office departments.  Draw mechanical plans with AutoCAD (Computer Aided Design), and produce technically accurate design sets in a timely manner that is consistent with division requirements and construction schedules.  Demonstrate the company’s core values of respect, honesty, integrity, diversity, inclusion and safety.\n\nEssential Job Functions:\nProduce appropriate and creative mechanical plans utilizing AutoCAD consistent with company objectives\nEnsure all materials are available (e.g., redlines, sketches, and written work scopes) to complete mechanical applications prior to starting a plan\nUnderstand and follow redlines, rough sketches and written work scopes to produce mechanical plans\nPrioritize, coordinate and communicate completion dates for assigned projects\nManage projects through direct communication with project managers, store planning, and procurement\nUtilize traditional sources (e.g., equipment catalogs, vendor software, websites, etc.) of information and technical data\nInteract with project managers to prioritize project needs\nMust be able to perform the essential functions of this position with or without reasonable accommodation\nMinimum Position/Education Qualifications: \nCommitted to working toward a 4-year degree in mechanical/electrical/civil engineering/architecture chemical or construction management\nHigh school graduate or equivalent\nMinimum 2.5 GPA\n18 years of age (if on a construction worksite)\nAutoCAD experience\nProficient with Microsoft Office\nStrong organizational skills\nAbility to work under minimal supervision\nEffective oral and written communication skills, including the ability to clearly express thoughts to others and exchange information\nProven ability to work in a fast-paced, high change environment\nAbility to establish a course of action for self and others to ensure that work is completed efficiently and in line with the department’s objectives\nAbility to work effectively and cooperatively with others, establishing and maintaining good working relationships\nDesired Previous Job Experience/Qualifications:\nRefrigeration application background\nUnderstanding of heating, ventilating and air conditioning (HVAC) fundamentals\nAbility to read and understand mechanical plans\nProficient with Excel\nExperience with Sitefolio\n\n \n\nEducation Level: High School Diploma/ GED Required\nRequired Certifications/Licenses: None\nPosition Type: Intern \nShift(s): [[mfield4]]\n Regions: General Office- Cincinnati\n\nStates: Alabama; Alaska; American Samoa; Arizona; Arkansas; California; Colorado; Connecticut; Delaware; District of Columbia; Federated States of Micronesia; Florida; Georgia; Guam; Hawaii; Idaho; Illinois; Indiana; Iowa; Kansas; Kentucky; Louisiana; Maine; Marshall Islands; Maryland; Massachusetts; Michigan; Minnesota; Mississippi; Missouri; Montana; Nebraska; Nevada; New Hampshire; New Jersey; New Mexico; New York; North Carolina; North Dakota; Northern Mariana Islands; Ohio; Oklahoma; Oregon; Palau; Pennsylvania; Puerto Rico; Rhode Island; South Carolina; South Dakota; Tennessee; Texas; Utah; Vermont; Virgin Islands; Virginia; Washington; West Virginia; Wisconsin; Wyoming\nKeywords:\n\n \n\nJobs at Kroger: At Kroger, we hire people who have a passion for helping others and who want to build a relationship with our Customers. No matter what stage of your career, you can build your future at Kroger. We look for people who want more, aspire to be more and work hard to achieve their goals. Our focus on keeping the Customer first is what makes us successful. As the largest traditional grocery chain in the U.S. and one of the world's largest retailers, we employee nearly half a million Associates across 35 states. We offer many opportunities not only in our stores, but in Manufacturing, Logistics, Marketing, Finance, Human Resources, and many other fields.\n\n \n\nCompany Overview\nKroger Family of Companies employs nearly half a million associates who serve customers in 2,782 retail food stores under a variety of local banner names in 35 states.  Our Family of Companies also operates 2,268 pharmacies, 274 fine jewelry stores, 1,489 supermarket fuel centers and 38 food production plants in the United States.  Kroger is dedicated to our Purpose: to Feed the Human Spirit™ by serving America through food inspiration and uplift and creating #ZeroHungerZeroWaste communities by 2025.  Careers with The Kroger Co. and our family of companies offer competitive wages, flexible schedules, benefits and room for advancement.\n\n \n\n Posting Notes:  OH || Cincinnati || 1014 Vine Street || 45202 || Kroger General Office || [[mfield2]] || Facility Engineering || Intern || Non-Exempt|| Intern || None"
    },
    {
        "position": "Algorithms Test Engineer Intern",
        "company": "Formlabs",
        "location": {
            "city": "Somerville",
            "state": "MA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=f5d00336-e9d2-46c8-bd96-2dbdad551fa5",
        "posted": "2020-07-09T01:19:25.132Z",
        "skills": [
            "machine learning",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:25.132Z",
        "description": "Software is at the center of our product development, as it bridges the transition from digital models to beautiful physical form in 3D printing.\n\nWe’re looking for a problem solving engineer to decrease the time to resolve software issues. From finding bugs in their infancy, to triple checking release builds, to interfacing with our Customer Support team - we’re looking for someone with a passion for making exceptional machines robust.\n\nIf you’re a meticulous and creative problem solver who thrives in interdisciplinary environments, join the Form Team as our Algorithms Test Engineering Intern.\n\nThe Job:\n\nAssist Software Team in investigating and debugging software issues\nSupport the team in writing scrips to help automate the testing process\nTest software releases and help design & build our test suite and procedures, to ensure a high level of quality is maintained\n\nYou:\n\nAre studying engineering (CS preferred) \nHave programming experience through other internships\nA driven problem-solver, who is able to deeply investigate issues and find solutions\nPassionate about helping customers get up and running, and get the most value out of their Formlabs product\nReady to dive in and learn whatever code / software infrastructure you don’t already know (application logging, Windows drivers, test suites, etc.)\nReady to work on self-directed projects with a high-caliber team\n\n \n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. \n\nEven if you don't check every box, but see yourself contributing, please apply. Help us build an inclusive community that will change the face of 3D printing."
    },
    {
        "position": "Quantum Computing Developer (2020 PHD Intern PT) Yorktown Heights NY",
        "company": "IBM",
        "location": {
            "city": "YORKTOWN HEIGHTS",
            "state": "NY",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=cbef2076-dfa1-4288-9fd2-47e985d20f5d",
        "posted": "2020-07-09T01:19:25.719Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:25.719Z",
        "description": "Introduction\n\nIBM Q interns are researchers, engineers, and developers from around the world who drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, IBM Q interns gain valuable skills and experiences essential for future professional opportunities as well as continued studies\n\n\nYour Role and Responsibilities\n\nIBM Q is an industry-first initiative to build universal quantum computers for business, engineering, and science. With a worldwide network of Fortune 500 companies, academic institutions, researchers, educators, and enthusiasts, we are committed to driving innovation for our clients in the IBM Q Network and the extended IBM Q Community. The IBM Q team is recruiting software developers, user experience designers, and community builders who will help advance the field of quantum computing and explore applications to make quantum computing broadly usable and accessible.\n\n\nWe are now accepting applications for graduate student developers (including software developers, user experience designers, and community builders) to become IBM Q interns and work with a team of researchers, engineers, and other developers, designers, and community builders to drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack by exploring applications to make quantum computing broadly usable and accessible. IBM Q interns will have the opportunity to focus on experiments, theory, software, or community building. Areas of development could include quantum software architecture, quantum algorithms, quantum software development, quantum community building, and quantum user experience design (among other areas).\n\n\nGraduate students from around the world with varying backgrounds and professional interests and curiosities are encouraged to apply for this unique paid internship experience. The IBM Q internship program connects students with each other, with university programs, with IBM Q Network organizations, and with IBM Q Community members. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, students will have the opportunity to gain valuable skills and experiences essential for future professional opportunities as well as continued studies.\n\n\nIBM Q interns will have the opportunity to:\n\n\n• Learn how companies conduct quantum computing research\n\n• Work on meaningful problems in the field of quantum computing\n\n• Receive mentorship from IBM researchers and others\n\n• Collaborate with peers working in the field of quantum computing\n\n• Get access to state-of-the-art quantum processors and devices at IBM\n\n• Gain a broad experience in quantum research, from fundamental to applied\n\n• Get exposure to the wide range of research happening at IBM\n\n• Receive training on Qiskit and mentorship on contributing to open source\n\n\nThis is a Part TIme position for the remainder of 2020.\n\n\nThis position is located in Yorktown Heights, NY or Remote.\n\nQuant18\n\n\nRequired Technical and Professional Expertise\n\n• Experience in a graduate or undergraduate program related to quantum computing or other applicable area of study\n\n• Experience in research, engineering, software development, design, community building, or other applicable area\n\n• Quantum computing fundamentals through formal education or informal exposure\n\n\nPreferred Technical and Professional Expertise\n\n• Experience with the Python programming language\n\n• Use of (or exposure to) the Qiskit quantum computing framework\n\n• Participation in the Qiskit Advocates Program\n\n• Coursework or projects in quantum information, computation, or algorithms\n\n\nAbout Business Unit\n\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n\n\nYour Life @ IBM\n\nWhat matters to you when you’re looking for your next career challenge?\n\n\nMaybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\n\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\n\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\n\nBeing You @ IBM\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "compensation": "paid"
    },
    {
        "position": "Algorithmic Trader Intern",
        "company": "TransMarket Group",
        "location": {
            "city": "Chicago",
            "state": "IL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=ce894e74-cea2-4c16-a588-3a7f638cf92d",
        "posted": "2020-06-25T01:19:29.455Z",
        "skills": [
            "python",
            "C and C++",
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:29.455Z",
        "description": "Responsibilities\nWork with Senior Algorithmic Traders to assist and learn all facets of automated trading\nDevelop expertise in market microstructure, tick data, and automated trading systems\nBuild and maintain trading quantitative model tools and analytics\nDevelop, code, maintain and support production quality automated trading strategies\n\n\nDesired Skills and Experience\nStrong work ethic and willingness to do what it takes to get the job done\nPassion for math and software applied to markets and trading\nStrong understanding of computing, math, probability, statistics, and finance\nProgramming proficiency and experience (C++, C#, Python, R).  Linux scripting a plus\nExcellent verbal and written communication skills\nAbility to work within a team in a fast paced environment\nPursuing BS, MS, or PhD in technical field or pertinent industry experience\n\n\nTransMarket Group is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status."
    },
    {
        "position": "Software Engineering Intern",
        "company": "Leidos",
        "location": {
            "city": "Rockville",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=c448527b-0e18-4507-863c-f7935aaf54c5",
        "posted": "2020-07-15T01:19:30.713Z",
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:30.713Z",
        "description": "Description\n\n\n\n\nJob Description:\n\nSoftware Engineering Intern – Baltimore/Rockville, MD\n\n\nThe Leidos Health group is seeking the best and brightest minds, with a passion for technology, to join our Intern Program. As a technology intern at Leidos, you will be immersed in a rich technical experience where you will work side-by-side with senior leaders, architects, developers, fellow interns, and others. In addition to hands-on experience, the program will also provide career development opportunities that include a summer series of events and various networking engagements across the organization.\n\n\n\n\nPrimary Responsibilities\n\n\nAs a software engineer intern you will work on developing/testing software for our federal health clients. This work will include supporting various types of development testing such as GUI, Data/ETL, workflows, accessibility, as well as test automation. The project will require learning and using skills in JAVA, Selenium, SQL, Oracle and/or related technologies, as well as learning about the internal software life cycle processes and tools used in the program. The Systems for Inspections, Recalls, Compliance Enforcement (SIRCE) and Imports program supports the Food and Drug Administration (FDA) Office of Regulatory Affairs’ (ORA) critical work to safeguard the foods, drugs, devices, biologics, and veterinary products that the Agency regulates. These systems continue to evolve to meet emerging business needs and to support new mandates and initiatives. It is important to analyze and implement advances in technologies that will improve efficiency and performance leading to greater user satisfaction and reducing the cost of operations and maintenance (O&M). Effort is underway to develop state of the art applications that can be used on various platforms and to retire some of the legacy systems with modern and efficient applications.\n\n\nBasic Qualifications\n\n\n\n+ Must be US Citizen or Green Card Holder with the ability to obtain a Public Trust security clearance\n\n\n+ Must be enrolled in an accredited college/university pursuing a BS degree in Computer Engineering, Computer Science, or Electrical Engineering, or similar\n\n\n+ Good analytical skills\n\n\n+ Good written and verbal communication skills\n\n\n\nPreferred Qualifications\n\n\n\n+ Experience with software development/testing\n\n\n+ Experience with test automation\n\n\n\n\n\nLeidosInternship\n\n\n\nExternal Referral Bonus:Ineligible\n\n\nPotential for Telework:No\n\n\nClearance Level Required:Public Trust\n\n\nTravel:No\n\n\nScheduled Weekly Hours:40\n\n\nShift:Day\n\n\nRequisition Category:Intern\n\n\nJob Family:Intern Technical\n\nLeidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world's toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company's 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $10.19 billion for the fiscal year ended December 28, 2018. For more information, visit www.Leidos.com.\n\n\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.\n\n\nLeidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.\n\n\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n\n\n\n\n\nREQNUMBER: R-00036216\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet.",
        "compensation": "paid",
        "contact": "leidos@leidos.com",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Engineering Intern",
        "company": "Matrix Research, Inc.",
        "location": {
            "city": "Beavercreek",
            "state": "OH",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=05347ed2-75ba-4d35-bd3f-348c245f8746",
        "posted": "2020-07-12T01:19:33.314Z",
        "skills": [
            "software engineering",
            "python",
            "matlab",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:33.314Z",
        "description": "Software Engineer Intern\n\nMatrix Research is a rapidly-growing, employee-owned, small business comprised of industry leaders who are advancing the state of the art in radar systems, radio frequency, and sensor exploitation technologies. We develop highly-optimized, innovative software with intuitive graphical user interfaces to meet unique requirements. Our programs span basic research through low-volume production of advanced sensing systems, subsystems, and components. Located in Dayton, Ohio, and Ft. Walton Beach, FL, Matrix offers extremely competitive salaries and benefits.\n\nMatrix Research Inc. is seeking Software Engineers Interns with experience in C development in our Dayton, OH location to function in the following role:\n\nDuties\n\nDevelop optimized software solutions based upon algorithmic requirements, end user needs, and runtime specifications.\nDevelop robust user interfaces for technical and non-technical users.\nAdhere to the software development lifecycle, including requirements definition, derived implementation, testing, and maintenance.\n\nRequirements:\n\nExperience with C.\nExperience with Qt or MATLAB a big plus.\nExperience with CUDA, GPGPU, OpenCL, OpenMP, MPI a plus.\nAbility and willingness to learn new software languages (we have projects using Julia, MATLAB, Python).\nKnowledge and ability to debug coding, compiling, and linking errors.\nComfortable with multiple operating systems (we work with Linux, macOS, and Windows), development environments, and debuggers.\nAbility to obtain and maintain a U.S. DoD Security Clearance (must be U.S. Citizen).\n\nOur environment:\n\nJoel Test: https://www.joelonsoftware.com/2000/08/09/the-joel-test-12-steps-to-better-code/\n\nSource control: yes: on-premise GitLab\nOne-step build: yes: CMake-based builds\nDaily builds: yes: GitLab continuous integration (CI) builds and tests every commit\nBug database: yes: aggressively-used Jira-based bug tracker\nBugs fixed before writing new code: yes\nUp-to-date schedule: yes\nSpecs: yes\nQuiet working conditions: yes\nBest tools money can buy: yes\nTesters: yes\nCode screening: yes\nHallway usability testing: yes\n\n12 out of 12 on the Joel Test\n\nMatrix Research is an Equal OpportunityEmployer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, marital status, veteran's status, disability, sexual orientation, gender identity, national origin or any other protected class set forth by federal or state law.\n\nMatrix is a Drug-Free Workplace\n\nThis job description is designed to provide general guidance in job tasks and is not meant to be all-inclusive of the responsibilities, duties, and skills required of this position. As business demands and needs change, the essential functions of this position may be updated to reflect the needs of Matrix Research, Inc.",
        "compensation": "paid"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Pinnacle Solutions, Inc.",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=68885e6b-dcf5-4132-8128-55c02856dd00",
        "posted": "2020-07-10T01:19:36.347Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:36.347Z",
        "description": "COMPANY DESCRIPTION\n\nPinnacle is seeking a Software Engineer Internto support our Engineeringbusiness area. Pinnacle, headquartered in Huntsville, AL, is a leading innovator, developer, and provider of defense and aerospace products and services. Pinnacle fosters a corporate culture with many opportunities for advancement and career progression. We are a dynamic, fast-paced organization that is experiencing exponential growth. Pinnacle has been on the Inc. 5000 Fastest Growing Companies list in 2012, 2013, 2015, 2016, 2017, 2018 and 2019! Pinnacle offers competitive, traditional benefits, and we are excited about our Employee Stock Ownership Program (ESOP)!\n\nAbout Huntsville -\n\nMilitary, space, telecommunications, biotechnology, diversified manufacturing and a variety of emerging specialties provide challenging work in delightful surroundings. The area enjoys a favorable cost of living and quality of life. Mountains, lakes, woodlands and the Tennessee River accommodate numerous recreational activities. A temperate climate enhances the season for outdoor sports, including world-class golf, hiking, biking, and fishing. Major concerts, Broadway and symphony performances, extensive permanent collections and traveling exhibitions contribute to a wonderful way of life.\n\nHuntsville, Alabama is one of the most recognized cities in the Southeast - consistently named as one of the best places to live and work by a variety of national publications. Our city is regularly named as a premier location for both business and quality of life.\n\n\nJOB DESCRIPTION\n\nPinnacle is looking for software engineering interns to support our Virtual and Web-Based programs team in the development of\nSerious Games, Virtual Laboratories, and Virtual Maintenance/Operator Training for aviation and ground vehicle platforms! The\nselected candidates will work with experienced engineers and support various software engineering activities such as requirements\nanalysis, design, development, documentation, integration, debugging and test.\nThis is an intern position scheduled to end December 11, 2020.\n\nSKILLS/EXPERIENCE REQUIREMENTS:\n\n1) Self-motivated, willing to learn, and interested in working in a team environment\n2) Proficient in Microsoft Office applications is required\n3) Exposure to an object-oriented programming language such as C#, Java, Python, etc.\n4) Knowledge of web development languages/tools such as Javascript, CSS, React a plus.\n5) Solid verbal and written communication skills are desired\n6) Demonstrated team work experience is desired\n7) Self-motivated, willing to learn, and interested in working in a team environment\n8) Previous internship/co-op experience is a plus\n9) Demonstrated professional, community, and/or extracurricular activities are desired\n\nEDUCATION REQUIREMENTS\n\nMust be a student who is in enrolled and pursuing an undergraduate or graduate degree from an accredited college/university.\nMust be majoring in an engineering or computer science related field.\nHave an overall cumulative GPA of 3.0 (on a 4.0 scale) or higher.\n\nSPECIAL REQUIREMENTS (Certifications, Etc.)\n\nMust be a US Citizen.\nMust be available to work 20 hours/per week during normal business hours until December 11, 2020.\nMust be able to telework until OPCON 3 is reduced.\nMust be a US citizen\n\nADDITIONAL INFORMATION\nPinnacle Solutions is an equal opportunity employer. Minorities/Females/Disabled/Veterans",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Engineer, Intern/Co-op",
        "company": "Facebook",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=d1138883-2d03-4187-9217-8e967bf95079",
        "posted": "2020-06-30T01:19:37.058Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:37.058Z",
        "description": "Intro:\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nSummary:\n\nWant to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems? Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately. Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n\nRequired Skills:\n\n1. Code high-volume software using primarily C++ and Java\n\n2. Create web applications using primarily PHP\n\n3. Implement web interfaces using XHTML, CSS, and JavaScript\n\n4. Build report interfaces and data feeds\n\nMinimum Qualifications:\n\n5. 1 or more years of experience with perl, java, php, python, or c++\n\n6. Must be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\n\n7. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nPreferred Qualifications:\n\n8. Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications\n\n9. Intent to return to degree-program after the completion of the internship/co-op\n\n10. High levels of creativity and quick problem-solving capabilities\n\nIndustry: Internet\n\nEqual Opportunity: Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "contact": "ext@fb.com",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Application Engineering Intern",
        "company": "Schweitzer Engineering Laboratories",
        "location": {
            "city": "King of Prussia",
            "state": "PA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=b2adbb97-80a1-42e6-bee9-7fd97b9bca00",
        "posted": "2020-06-24T01:19:37.845Z",
        "skills": [
            "information technology",
            "software engineering",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:37.845Z",
        "description": "Schweitzer Engineering Laboratories (SEL) seeks a professional, innovative, and detailed student for our Application Engineering Intern position located in King of Prussia, PA. If you are looking for an opportunity to work with state of the art technology on power system protection, then this position is for you!\n\nEssential Duties and Responsibilities\n1. Provide support for communication/automation/protection test beds.\n2. Perform testing on existing and new technology.\n3. Document test bed activities and results.\n4. Support Sales and Customer Service and product development activities related to communication/automation/protection.\n5. Support applications engineers to develop best practice application guides for SEL technology that provide secure and compliant solutions.\n6. Continuously identify, measure, and improve processes.\n7. Follow and apply SEL Values, Principles of Operations, and World Class Manufacturing Principles.\n8. Understand. Create. Simplify.\n9. Other duties as assigned.\n\nRequired Qualifications\nCurrent student pursuing a degree in Electrical Engineering with an emphasis in power systems\n\nTwo years of undergraduate experience in related field\n\nAbility to work part time during the school year and full time during the summer\n\nSelf-motivated/self-starter\nStrong writing, documentation, and speaking skills\nAbility to learn new skills and assume new responsibilities\nAbility to work cooperatively in a team environment\nBackground check results satisfactory to SEL\nNegative drug test result(s)\n\nPreferred Qualifications\nFamiliarity with power system basics\n\nPhysical Requirements\nNone\n\nLocation Information\n\nKing of Prussia, PA- This position is located in King of Prussia, PA. Located just twenty miles from Philadelphia, its close proximity allows residents to enjoy all that the big city has to offer. Enjoy easy access to trails along the river, or attend sporting events nearby. The diverse options make King of Prussia the perfect place to call home.\n\nAn Award Winning Company\n\nSchweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets in many different industries, markets, and geographies around the world.\n\nCommunication with Applicants\n\nSEL sends an initial e-mail response to all applicants at time of résumé or CV submittal. If you do not receive this communication, please check your SPAM filter and make sure your system is not blocking e-mails from SEL. It is important that you ensure your receipt of this e-mail as SEL may communicate future position updates via e-mail. \n\nSEL is an Equal Opportunity Employer: M/F/Vets/Disabled.\n\nSEL is an Equal Opportunity Employer: M/F/Vets/Disabled."
    },
    {
        "position": "Lojix Software Development Intern",
        "company": "Canvas Inc.",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=5d10c037-a124-4aa1-8140-de72c8e627fa",
        "posted": "2020-06-19T01:19:38.689Z",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "web development"
        ],
        "lastScraped": "2020-07-15T01:19:38.689Z",
        "description": "If being part of an emerging software and technology company where you can gain exciting, hands on technical experience, in a laid-back environment is exciting to you, this may be your perfect opportunity! We are looking for an undergraduate or graduate level student who is ambitious, hard-working, and ready to gain first hand experience working on an enterprise software tool.\n\nLocated in the historical Times Building downtown, Canvas is just a short walk to all of the exciting growth and development in downtown Huntsville.\n\nJob Duties:\n\nResponsibilities will vary based on the student's knowledge base and team needs. Tasks may include but are not limited to:\n\nSoftware Development\nSupporting the development team by writing code and resolving bugs in the system\nAttending and participating in SCRUM meetings\nDocumentation\nAssist the team in keeping technical documentation up to date and accurate\nQA and Testing\nWriting automated unit and functional tests\n\nRequired Qualifications\n\nCandidates must be enrolled in a degree program in a relevant discipline (i.e. Computer Science, Mathematics, Information Systems, etc)\nSome software development experience (any language)\nUnderstanding of core computer science principles and best practices (i.e. Object Oriented Programming)\nExcellent communication, team participation, and prioritization skills\nUS Citizenship is required\n\nPreferred Qualifications:\n\nExperience with:\nHTML, CSS, JavaScript, JQuery\nPHP, Java\nMySQL or any relational database\nGCP (Google Cloud COmpute)\nGit",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Quantum Computing Developer (2020 PHD Intern PT) Yorktown Heights NY",
        "company": "IBM",
        "location": {
            "city": "YORKTOWN HEIGHTS",
            "state": "NY",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=8280c96b-327c-4061-b39b-d19342276a0e",
        "posted": "2020-07-09T01:19:39.538Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:39.538Z",
        "description": "**Introduction**\n\nIBM Q interns are researchers, engineers, and developers from around the world who drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, IBM Q interns gain valuable skills and experiences essential for future professional opportunities as well as continued studies\n\n\n\n**Your Role and Responsibilities**\n\nIBM Q is an industry-first initiative to build universal quantum computers for business, engineering, and science. With a worldwide network of Fortune 500 companies, academic institutions, researchers, educators, and enthusiasts, we are committed to driving innovation for our clients in the IBM Q Network and the extended IBM Q Community. The IBM Q team is recruiting software developers, user experience designers, and community builders who will help advance the field of quantum computing and explore applications to make quantum computing broadly usable and accessible.\n\n\n\nWe are now accepting applications for graduate student developers (including software developers, user experience designers, and community builders) to become IBM Q interns and work with a team of researchers, engineers, and other developers, designers, and community builders to drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack by exploring applications to make quantum computing broadly usable and accessible. IBM Q interns will have the opportunity to focus on experiments, theory, software, or community building. Areas of development could include quantum software architecture, quantum algorithms, quantum software development, quantum community building, and quantum user experience design (among other areas).\n\n\n\nGraduate students from around the world with varying backgrounds and professional interests and curiosities are encouraged to apply for this unique paid internship experience. The IBM Q internship program connects students with each other, with university programs, with IBM Q Network organizations, and with IBM Q Community members. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, students will have the opportunity to gain valuable skills and experiences essential for future professional opportunities as well as continued studies.\n\n\n\nIBM Q interns will have the opportunity to:\n\n\n\n• Learn how companies conduct quantum computing research\n\n• Work on meaningful problems in the field of quantum computing\n\n• Receive mentorship from IBM researchers and others\n\n• Collaborate with peers working in the field of quantum computing\n\n• Get access to state-of-the-art quantum processors and devices at IBM\n\n• Gain a broad experience in quantum research, from fundamental to applied\n\n• Get exposure to the wide range of research happening at IBM\n\n• Receive training on Qiskit and mentorship on contributing to open source\n\n\n\nThis is a Part TIme position for the remainder of 2020.\n\n\n\nThis position is located in Yorktown Heights, NY or Remote.\n\nQuant18\n\n\n\n**Required Technical and Professional Expertise**\n\n• Experience in a graduate or undergraduate program related to quantum computing or other applicable area of study\n\n• Experience in research, engineering, software development, design, community building, or other applicable area\n\n• Quantum computing fundamentals through formal education or informal exposure\n\n\n\n**Preferred Technical and Professional Expertise**\n\n• Experience with the Python programming language\n\n• Use of (or exposure to) the Qiskit quantum computing framework\n\n• Participation in the Qiskit Advocates Program\n\n• Coursework or projects in quantum information, computation, or algorithms\n\n\n\n**About Business Unit**\n\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n\n\n\n**Your Life @ IBM**\n\nWhat matters to you when you’re looking for your next career challenge?\n\n\n\nMaybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\n\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\n\n**About IBM**\n\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\n\n**Location Statement**\n\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\n\n\n**Being You @ IBM**\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "compensation": "paid"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Leidos",
        "location": {
            "city": "Gaithersburg",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=bdc09308-1bfa-4ccd-a2f8-15c96316ae6a",
        "posted": "2020-07-11T01:19:40.576Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:40.576Z",
        "description": "Description\n\n\n\n\nJob Description:\n\nLeidos is seeking an Software Development Intern who will be a member of a dynamic team working on the Federal Aviation Administration’s En-Route Automation Modernization ERAM) technology, which is the heart of the Next Generation Air Transportation System and the pulse of the National Airspace System helping to advance our transition from a ground-based system of air traffic control to a satellite-based system of air traffic management. ERAM is vital to the future of air navigation, providing the foundational platform required for FAA to enable NextGen solutions, via modernization programs such as System Wide Information Management, Data Communications, and Automatic Dependent Surveillance- Broadcast. ERAM will provide benefits for users and the flying public by increasing air traffic flow and enabling improve efficiencies in En Route Air Traffic operations.\n\n\n\n\nAs Software Interns, the team will provide challenging Software development tasks that will enable you to learn about working on a large, complex system. Tasks defined are sponsored by the team leadership or Software Architecture and are relevant to the needs of the organization. Flexibility in taking on open ended challenges and learning new languages is very helpful. The ability to ask good questions and learn quickly are the most important skills you can bring. The primary responsibilities listed are appropriate for a full time software developer. The performance displayed during an internship tells us who’s qualified to do Software Development on ERAM.\n\n\n\n\nPrimary Responsibilities\n\n\n• Modernizing the AT control system by improving the availability and performance of the ERAM system.\n\n\n• Supporting ERAM as it continues to migrate ERAM from the AIX operating systems to Linux. Detailed knowledge of Linux OS and OS concepts desirable.\n\n\n• Optimizing the experience for the flying public, Air Traffic Control, and the airline industry by improving the collaboration and decision-making capabilities of flight controllers\n\n\n• Developing and maintaining the FAA air traffic control software (primarily Ada95/C++) on a UNIX/Linux platform. There are a number of support/maintenance functions that utilize PERL/PYTHON.\n\n\n• Performing software development as needed for the ERAM system\n\n\n• Coordinate Solutions with Systems Engineering\n\n\n• Coordinate the development of new capabilities and upgrade to common services provided the applications via the\n\n\n\n\nBasic Qualifications\n\n\nCandidates must be enrolled in a degree program in a relevant discipline, Computer Science or Computer Engineering Degree (Working Towards ok)\n\n\nDemonstrated Software Development Skills/Capabilities\n\n\nExcellent Verbal and Communication Skills\n\n\nDemonstrated ability to debug and solve problems\n\n\nA Strong Desire to Learn\n\n\nYour GPA needs to be included on your application and resume.\n\n\n\n\nUS Citizenship Requirements\n\n\nCandidate must be able to obtain an SF-85P Public Trust clearance from the FAA customer.\n\n\n\n\nPreferred Qualifications\n\n\nWork Experience in a Technical organization performing Software Engineering Tasks.\n\n\nLeadership Skills\n\n\nInterest in learning new skills and/or languages as needed.\n\n\n\nExternal Referral Bonus:Ineligible\n\n\nPotential for Telework:No\n\n\nClearance Level Required:Public Trust\n\n\nTravel:No\n\n\nScheduled Weekly Hours:40\n\n\nShift:Day\n\n\nRequisition Category:Intern\n\n\nJob Family:Intern Technical\n\nLeidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world's toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company's 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $10.19 billion for the fiscal year ended December 28, 2018. For more information, visit www.Leidos.com.\n\n\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.\n\n\nLeidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.\n\n\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n\n\n\n\n\nREQNUMBER: R-00034362\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet.",
        "compensation": "paid",
        "contact": "leidos@leidos.com",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Software Engineer, Intern/Co-op",
        "company": "Facebook",
        "location": {
            "city": "Fremont",
            "state": "CA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=b74bcd8a-2c61-4483-98e1-ef3a1717a10c",
        "posted": "2020-06-30T01:19:41.517Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:41.517Z",
        "description": "Intro:\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nSummary:\n\nWant to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems? Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately. Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n\nRequired Skills:\n\n1. Code high-volume software using primarily C++ and Java\n\n2. Create web applications using primarily PHP\n\n3. Implement web interfaces using XHTML, CSS, and JavaScript\n\n4. Build report interfaces and data feeds\n\nMinimum Qualifications:\n\n5. 1 or more years of experience with perl, java, php, python, or c++\n\n6. Must be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\n\n7. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nPreferred Qualifications:\n\n8. Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications\n\n9. Intent to return to degree-program after the completion of the internship/co-op\n\n10. High levels of creativity and quick problem-solving capabilities\n\nIndustry: Internet\n\nEqual Opportunity: Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "contact": "ext@fb.com",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "IT Consultant Internship",
        "company": "Everis",
        "location": {
            "city": "Rockville",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=c448527b-0e18-4507-863c-f7935aaf54c5",
        "posted": "2020-07-15T01:19:42.525Z",
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:42.525Z",
        "description": "Description\n\n\n\n\nJob Description:\n\nSoftware Engineering Intern – Baltimore/Rockville, MD\n\n\nThe Leidos Health group is seeking the best and brightest minds, with a passion for technology, to join our Intern Program. As a technology intern at Leidos, you will be immersed in a rich technical experience where you will work side-by-side with senior leaders, architects, developers, fellow interns, and others. In addition to hands-on experience, the program will also provide career development opportunities that include a summer series of events and various networking engagements across the organization.\n\n\n\n\nPrimary Responsibilities\n\n\nAs a software engineer intern you will work on developing/testing software for our federal health clients. This work will include supporting various types of development testing such as GUI, Data/ETL, workflows, accessibility, as well as test automation. The project will require learning and using skills in JAVA, Selenium, SQL, Oracle and/or related technologies, as well as learning about the internal software life cycle processes and tools used in the program. The Systems for Inspections, Recalls, Compliance Enforcement (SIRCE) and Imports program supports the Food and Drug Administration (FDA) Office of Regulatory Affairs’ (ORA) critical work to safeguard the foods, drugs, devices, biologics, and veterinary products that the Agency regulates. These systems continue to evolve to meet emerging business needs and to support new mandates and initiatives. It is important to analyze and implement advances in technologies that will improve efficiency and performance leading to greater user satisfaction and reducing the cost of operations and maintenance (O&M). Effort is underway to develop state of the art applications that can be used on various platforms and to retire some of the legacy systems with modern and efficient applications.\n\n\nBasic Qualifications\n\n\n\n+ Must be US Citizen or Green Card Holder with the ability to obtain a Public Trust security clearance\n\n\n+ Must be enrolled in an accredited college/university pursuing a BS degree in Computer Engineering, Computer Science, or Electrical Engineering, or similar\n\n\n+ Good analytical skills\n\n\n+ Good written and verbal communication skills\n\n\n\nPreferred Qualifications\n\n\n\n+ Experience with software development/testing\n\n\n+ Experience with test automation\n\n\n\n\n\nLeidosInternship\n\n\n\nExternal Referral Bonus:Ineligible\n\n\nPotential for Telework:No\n\n\nClearance Level Required:Public Trust\n\n\nTravel:No\n\n\nScheduled Weekly Hours:40\n\n\nShift:Day\n\n\nRequisition Category:Intern\n\n\nJob Family:Intern Technical\n\nLeidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world's toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company's 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $10.19 billion for the fiscal year ended December 28, 2018. For more information, visit www.Leidos.com.\n\n\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.\n\n\nLeidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.\n\n\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n\n\n\n\n\nREQNUMBER: R-00036216\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet.",
        "compensation": "paid",
        "contact": "leidos@leidos.com",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Workplace Collaboration Services Intern (Piscataway, NJ, US)",
        "company": "Colgate-Palmolive Company",
        "location": {
            "city": "Beavercreek",
            "state": "OH",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=05347ed2-75ba-4d35-bd3f-348c245f8746",
        "posted": "2020-07-12T01:19:43.527Z",
        "skills": [
            "software engineering",
            "python",
            "matlab",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "lastScraped": "2020-07-15T01:19:43.527Z",
        "description": "Software Engineer Intern\n\nMatrix Research is a rapidly-growing, employee-owned, small business comprised of industry leaders who are advancing the state of the art in radar systems, radio frequency, and sensor exploitation technologies. We develop highly-optimized, innovative software with intuitive graphical user interfaces to meet unique requirements. Our programs span basic research through low-volume production of advanced sensing systems, subsystems, and components. Located in Dayton, Ohio, and Ft. Walton Beach, FL, Matrix offers extremely competitive salaries and benefits.\n\nMatrix Research Inc. is seeking Software Engineers Interns with experience in C development in our Dayton, OH location to function in the following role:\n\nDuties\n\nDevelop optimized software solutions based upon algorithmic requirements, end user needs, and runtime specifications.\nDevelop robust user interfaces for technical and non-technical users.\nAdhere to the software development lifecycle, including requirements definition, derived implementation, testing, and maintenance.\n\nRequirements:\n\nExperience with C.\nExperience with Qt or MATLAB a big plus.\nExperience with CUDA, GPGPU, OpenCL, OpenMP, MPI a plus.\nAbility and willingness to learn new software languages (we have projects using Julia, MATLAB, Python).\nKnowledge and ability to debug coding, compiling, and linking errors.\nComfortable with multiple operating systems (we work with Linux, macOS, and Windows), development environments, and debuggers.\nAbility to obtain and maintain a U.S. DoD Security Clearance (must be U.S. Citizen).\n\nOur environment:\n\nJoel Test: https://www.joelonsoftware.com/2000/08/09/the-joel-test-12-steps-to-better-code/\n\nSource control: yes: on-premise GitLab\nOne-step build: yes: CMake-based builds\nDaily builds: yes: GitLab continuous integration (CI) builds and tests every commit\nBug database: yes: aggressively-used Jira-based bug tracker\nBugs fixed before writing new code: yes\nUp-to-date schedule: yes\nSpecs: yes\nQuiet working conditions: yes\nBest tools money can buy: yes\nTesters: yes\nCode screening: yes\nHallway usability testing: yes\n\n12 out of 12 on the Joel Test\n\nMatrix Research is an Equal OpportunityEmployer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, marital status, veteran's status, disability, sexual orientation, gender identity, national origin or any other protected class set forth by federal or state law.\n\nMatrix is a Drug-Free Workplace\n\nThis job description is designed to provide general guidance in job tasks and is not meant to be all-inclusive of the responsibilities, duties, and skills required of this position. As business demands and needs change, the essential functions of this position may be updated to reflect the needs of Matrix Research, Inc.",
        "compensation": "paid"
    },
    {
        "position": "Design Intern",
        "company": "Sage Bionetworks",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=68885e6b-dcf5-4132-8128-55c02856dd00",
        "posted": "2020-07-10T01:19:44.580Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:44.580Z",
        "description": "COMPANY DESCRIPTION\n\nPinnacle is seeking a Software Engineer Internto support our Engineeringbusiness area. Pinnacle, headquartered in Huntsville, AL, is a leading innovator, developer, and provider of defense and aerospace products and services. Pinnacle fosters a corporate culture with many opportunities for advancement and career progression. We are a dynamic, fast-paced organization that is experiencing exponential growth. Pinnacle has been on the Inc. 5000 Fastest Growing Companies list in 2012, 2013, 2015, 2016, 2017, 2018 and 2019! Pinnacle offers competitive, traditional benefits, and we are excited about our Employee Stock Ownership Program (ESOP)!\n\nAbout Huntsville -\n\nMilitary, space, telecommunications, biotechnology, diversified manufacturing and a variety of emerging specialties provide challenging work in delightful surroundings. The area enjoys a favorable cost of living and quality of life. Mountains, lakes, woodlands and the Tennessee River accommodate numerous recreational activities. A temperate climate enhances the season for outdoor sports, including world-class golf, hiking, biking, and fishing. Major concerts, Broadway and symphony performances, extensive permanent collections and traveling exhibitions contribute to a wonderful way of life.\n\nHuntsville, Alabama is one of the most recognized cities in the Southeast - consistently named as one of the best places to live and work by a variety of national publications. Our city is regularly named as a premier location for both business and quality of life.\n\n\nJOB DESCRIPTION\n\nPinnacle is looking for software engineering interns to support our Virtual and Web-Based programs team in the development of\nSerious Games, Virtual Laboratories, and Virtual Maintenance/Operator Training for aviation and ground vehicle platforms! The\nselected candidates will work with experienced engineers and support various software engineering activities such as requirements\nanalysis, design, development, documentation, integration, debugging and test.\nThis is an intern position scheduled to end December 11, 2020.\n\nSKILLS/EXPERIENCE REQUIREMENTS:\n\n1) Self-motivated, willing to learn, and interested in working in a team environment\n2) Proficient in Microsoft Office applications is required\n3) Exposure to an object-oriented programming language such as C#, Java, Python, etc.\n4) Knowledge of web development languages/tools such as Javascript, CSS, React a plus.\n5) Solid verbal and written communication skills are desired\n6) Demonstrated team work experience is desired\n7) Self-motivated, willing to learn, and interested in working in a team environment\n8) Previous internship/co-op experience is a plus\n9) Demonstrated professional, community, and/or extracurricular activities are desired\n\nEDUCATION REQUIREMENTS\n\nMust be a student who is in enrolled and pursuing an undergraduate or graduate degree from an accredited college/university.\nMust be majoring in an engineering or computer science related field.\nHave an overall cumulative GPA of 3.0 (on a 4.0 scale) or higher.\n\nSPECIAL REQUIREMENTS (Certifications, Etc.)\n\nMust be a US Citizen.\nMust be available to work 20 hours/per week during normal business hours until December 11, 2020.\nMust be able to telework until OPCON 3 is reduced.\nMust be a US citizen\n\nADDITIONAL INFORMATION\nPinnacle Solutions is an equal opportunity employer. Minorities/Females/Disabled/Veterans",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "Alumni Program Intern",
        "company": "AI4ALL",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=d1138883-2d03-4187-9217-8e967bf95079",
        "posted": "2020-06-30T01:19:45.633Z",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++"
        ],
        "lastScraped": "2020-07-15T01:19:45.633Z",
        "description": "Intro:\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nSummary:\n\nWant to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems? Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately. Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n\nRequired Skills:\n\n1. Code high-volume software using primarily C++ and Java\n\n2. Create web applications using primarily PHP\n\n3. Implement web interfaces using XHTML, CSS, and JavaScript\n\n4. Build report interfaces and data feeds\n\nMinimum Qualifications:\n\n5. 1 or more years of experience with perl, java, php, python, or c++\n\n6. Must be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\n\n7. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nPreferred Qualifications:\n\n8. Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications\n\n9. Intent to return to degree-program after the completion of the internship/co-op\n\n10. High levels of creativity and quick problem-solving capabilities\n\nIndustry: Internet\n\nEqual Opportunity: Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "contact": "ext@fb.com",
        "qualifications": [
            "Bachelor's degree"
        ]
    },
    {
        "position": "Quantitative Marketing Intern",
        "company": "Spearmint Ventures LLC",
        "location": {
            "city": "King of Prussia",
            "state": "PA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=b2adbb97-80a1-42e6-bee9-7fd97b9bca00",
        "posted": "2020-06-24T01:19:46.747Z",
        "skills": [
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:46.747Z",
        "description": "Schweitzer Engineering Laboratories (SEL) seeks a professional, innovative, and detailed student for our Application Engineering Intern position located in King of Prussia, PA. If you are looking for an opportunity to work with state of the art technology on power system protection, then this position is for you!\n\nEssential Duties and Responsibilities\n1. Provide support for communication/automation/protection test beds.\n2. Perform testing on existing and new technology.\n3. Document test bed activities and results.\n4. Support Sales and Customer Service and product development activities related to communication/automation/protection.\n5. Support applications engineers to develop best practice application guides for SEL technology that provide secure and compliant solutions.\n6. Continuously identify, measure, and improve processes.\n7. Follow and apply SEL Values, Principles of Operations, and World Class Manufacturing Principles.\n8. Understand. Create. Simplify.\n9. Other duties as assigned.\n\nRequired Qualifications\nCurrent student pursuing a degree in Electrical Engineering with an emphasis in power systems\n\nTwo years of undergraduate experience in related field\n\nAbility to work part time during the school year and full time during the summer\n\nSelf-motivated/self-starter\nStrong writing, documentation, and speaking skills\nAbility to learn new skills and assume new responsibilities\nAbility to work cooperatively in a team environment\nBackground check results satisfactory to SEL\nNegative drug test result(s)\n\nPreferred Qualifications\nFamiliarity with power system basics\n\nPhysical Requirements\nNone\n\nLocation Information\n\nKing of Prussia, PA- This position is located in King of Prussia, PA. Located just twenty miles from Philadelphia, its close proximity allows residents to enjoy all that the big city has to offer. Enjoy easy access to trails along the river, or attend sporting events nearby. The diverse options make King of Prussia the perfect place to call home.\n\nAn Award Winning Company\n\nSchweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets in many different industries, markets, and geographies around the world.\n\nCommunication with Applicants\n\nSEL sends an initial e-mail response to all applicants at time of résumé or CV submittal. If you do not receive this communication, please check your SPAM filter and make sure your system is not blocking e-mails from SEL. It is important that you ensure your receipt of this e-mail as SEL may communicate future position updates via e-mail. \n\nSEL is an Equal Opportunity Employer: M/F/Vets/Disabled.\n\nSEL is an Equal Opportunity Employer: M/F/Vets/Disabled."
    },
    {
        "position": "Intern-Radiology Technologist Proctor",
        "company": "UnityPoint Health",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=5d10c037-a124-4aa1-8140-de72c8e627fa",
        "posted": "2020-06-19T01:19:47.927Z",
        "skills": [
            "information technology",
            "javascript",
            "java",
            "web development",
            "software engineering"
        ],
        "lastScraped": "2020-07-15T01:19:47.927Z",
        "description": "If being part of an emerging software and technology company where you can gain exciting, hands on technical experience, in a laid-back environment is exciting to you, this may be your perfect opportunity! We are looking for an undergraduate or graduate level student who is ambitious, hard-working, and ready to gain first hand experience working on an enterprise software tool.\n\nLocated in the historical Times Building downtown, Canvas is just a short walk to all of the exciting growth and development in downtown Huntsville.\n\nJob Duties:\n\nResponsibilities will vary based on the student's knowledge base and team needs. Tasks may include but are not limited to:\n\nSoftware Development\nSupporting the development team by writing code and resolving bugs in the system\nAttending and participating in SCRUM meetings\nDocumentation\nAssist the team in keeping technical documentation up to date and accurate\nQA and Testing\nWriting automated unit and functional tests\n\nRequired Qualifications\n\nCandidates must be enrolled in a degree program in a relevant discipline (i.e. Computer Science, Mathematics, Information Systems, etc)\nSome software development experience (any language)\nUnderstanding of core computer science principles and best practices (i.e. Object Oriented Programming)\nExcellent communication, team participation, and prioritization skills\nUS Citizenship is required\n\nPreferred Qualifications:\n\nExperience with:\nHTML, CSS, JavaScript, JQuery\nPHP, Java\nMySQL or any relational database\nGCP (Google Cloud COmpute)\nGit",
        "qualifications": [
            "U.S Citizen"
        ]
    },
    {
        "position": "PhD Intern - National Security PhD Intern - Computing and Analytics (NSIP)",
        "company": "Pacific Northwest National Laboratory",
        "location": {
            "city": "YORKTOWN HEIGHTS",
            "state": "NY",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&tm=30&stpage=1&page=3&jobid=8280c96b-327c-4061-b39b-d19342276a0e",
        "posted": "2020-07-09T01:19:49.163Z",
        "skills": [
            "information technology",
            "software engineering",
            "python",
            "machine learning"
        ],
        "lastScraped": "2020-07-15T01:19:49.163Z",
        "description": "**Introduction**\n\nIBM Q interns are researchers, engineers, and developers from around the world who drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, IBM Q interns gain valuable skills and experiences essential for future professional opportunities as well as continued studies\n\n\n\n**Your Role and Responsibilities**\n\nIBM Q is an industry-first initiative to build universal quantum computers for business, engineering, and science. With a worldwide network of Fortune 500 companies, academic institutions, researchers, educators, and enthusiasts, we are committed to driving innovation for our clients in the IBM Q Network and the extended IBM Q Community. The IBM Q team is recruiting software developers, user experience designers, and community builders who will help advance the field of quantum computing and explore applications to make quantum computing broadly usable and accessible.\n\n\n\nWe are now accepting applications for graduate student developers (including software developers, user experience designers, and community builders) to become IBM Q interns and work with a team of researchers, engineers, and other developers, designers, and community builders to drive research and development of the industry's most advanced quantum computing hardware and software and advance the entire quantum computing technology stack by exploring applications to make quantum computing broadly usable and accessible. IBM Q interns will have the opportunity to focus on experiments, theory, software, or community building. Areas of development could include quantum software architecture, quantum algorithms, quantum software development, quantum community building, and quantum user experience design (among other areas).\n\n\n\nGraduate students from around the world with varying backgrounds and professional interests and curiosities are encouraged to apply for this unique paid internship experience. The IBM Q internship program connects students with each other, with university programs, with IBM Q Network organizations, and with IBM Q Community members. From contributing to the open-source Qiskit framework, to fundamental research in quantum computing, to helping people understand the relevance of quantum computing, students will have the opportunity to gain valuable skills and experiences essential for future professional opportunities as well as continued studies.\n\n\n\nIBM Q interns will have the opportunity to:\n\n\n\n• Learn how companies conduct quantum computing research\n\n• Work on meaningful problems in the field of quantum computing\n\n• Receive mentorship from IBM researchers and others\n\n• Collaborate with peers working in the field of quantum computing\n\n• Get access to state-of-the-art quantum processors and devices at IBM\n\n• Gain a broad experience in quantum research, from fundamental to applied\n\n• Get exposure to the wide range of research happening at IBM\n\n• Receive training on Qiskit and mentorship on contributing to open source\n\n\n\nThis is a Part TIme position for the remainder of 2020.\n\n\n\nThis position is located in Yorktown Heights, NY or Remote.\n\nQuant18\n\n\n\n**Required Technical and Professional Expertise**\n\n• Experience in a graduate or undergraduate program related to quantum computing or other applicable area of study\n\n• Experience in research, engineering, software development, design, community building, or other applicable area\n\n• Quantum computing fundamentals through formal education or informal exposure\n\n\n\n**Preferred Technical and Professional Expertise**\n\n• Experience with the Python programming language\n\n• Use of (or exposure to) the Qiskit quantum computing framework\n\n• Participation in the Qiskit Advocates Program\n\n• Coursework or projects in quantum information, computation, or algorithms\n\n\n\n**About Business Unit**\n\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n\n\n\n**Your Life @ IBM**\n\nWhat matters to you when you’re looking for your next career challenge?\n\n\n\nMaybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\n\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\n\n**About IBM**\n\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\n\n**Location Statement**\n\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\n\n\n**Being You @ IBM**\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "compensation": "paid"
    }
]