[
    {
        "position": "Intern - CD Post Closing",
        "company": "AmeriHome Mortgage - 2.7",
        "location": {
            "city": "Irvine",
            "state": "CA"
        },
        "qualifications": "SQLMicrosoft ExcelVisual BasicRPythonMaster's DegreeDoctoral Degree",
        "posted": "2020-07-15T01:22:31.975Z",
        "url": "https://www.simplyhired.com/job/DGdXtpWLyhZlxyCjSlN-Ae2qQxhWcgLB3L4Rt-ODxWVPMWMR7Hp6uw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:31.975Z",
        "description": "AmeriHome Mortgage Company is accepting applications for our Summer 2020 Internship Program!\n\nAmeriHome is a multi-channel mortgage company headquartered in Thousand Oaks, California with offices in Irvine, California and Irving, Texas.\n\nWe offer our Interns an exciting opportunity to work on projects as full-functioning members of the team to which they are assigned. AmeriHome Mortgage Interns will work in a corporate environment under mentoring and guidance by the department manager and team. Undergraduate or Graduate students are assigned to robust work assignments to support a specific business function.\n\nThis is a full-time, paid internship over a 10-12 week period based in our Irvine, California office.\n\nAnalytics Interns\n\nWe will be placing analytics interns within our Consumer Direct channel. The intern position will contribute in the area of data/statistical modeling projects, data analytics as well as data reporting.\n\nJob Qualifications:\nCandidates must possess the following:\nMust be a current student pursuing an undergraduate or advanced degree including MBA or PhD.\nDegree concentration should be in quantitative finance, business analytics programs, computer science, engineering, statistics, or equivalent technically rigorous curriculum\nUndergrad status: senior classification required\nExperience with SQL and Excel VBA required\nExperience with statistical tools such as R, Python, Matlab, or SAS is required\nExposures to programming languages such as C#, C++, Java or Python desired\nPrevious internships or relevant work experience in the financial industry that correlates to your degree and career aspirations\nStrong written and verbal communication skills are essential. The intern will be required to participate or lead presentations to executive management\nIntermediate proficiency in MS Office Suite\nMust be curious and self-starter\nDetail-oriented and exceptional time management skills required\n\nNOTE!! All applicants must submit a cover letter addressing the following questions in 500 words or less. Resumes received without cover letters will not be considered\n\nAs a product of your cumulative experiences in life, who are you and what makes you unique?\nWhy do you want to work at AmeriHome?\nWhat do you hope to gain from your internship experience at AmeriHome?",
        "skills": [
            "python",
            "java",
            "matlab",
            "C and C++",
            "software engineering"
        ],
        "compensation": "paid"
    },
    {
        "position": "Front-End Development Intern",
        "company": "Ag-Analytics Technology Company, LLC - ",
        "location": {
            "city": "Ithaca",
            "state": "NY"
        },
        "qualifications": "Mobile ApplicationsComputer SkillsMicrosoft OfficeMicrosoft WordMicrosoft PowerpointHigh School Diploma or GED18 Years or OlderWork Authorization",
        "posted": "2020-07-11T01:22:32.037Z",
        "url": "https://www.simplyhired.com/job/jMA0X5wg29b9RGGjIRZflEotkzqmlXWjLa8Q3nYMx2vfuhZkyiUFyw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:32.037Z",
        "description": "We are seeking creative, responsible Front-End Development interns to join our team of data scientists, economists, and software engineers at Ag-Analytics (analytics.ag) to assist in developing cutting edge analytics and predictive analytics in digital agriculture and the environment. This role will assist developers with QA/QC and optimization of our website and mobile application, with a strong focus on the mobile app development in order to increase user engagement, downloads, and subscribers. This role will also work on various tasks concerning UI/UX of our website, and front-end engineering. This is a part-time, paid position located on-site in downtown Ithaca, NY.\n\nThis position will require 14-20 hours of work availability a week.\n\nHiring for this position is preferenced to as soon as possible - applications for Summer 2020 will not be considered at this time.\n\nGeneral Intern Duties and Responsibilities\n\nPerform clerical duties: assist with scheduling, take notes, maintain files, and organize documents as needed\nAssist with minor front and back end tasks.\nPerform consistent QA/QC of the Ag-Analytics web application and mobile applications with the ability to clearly log findings, document issues, and relay problems\nAssist developers with tasks as needed; spanning from small coding tasks to QA/QC of particular functions, documentation of projects, and more.\n\nIntern Requirements and Qualifications\n\nHigh school degree or equivalent\nStudies in Computer Science, Information Technology, or like programs are preferred\nProficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\nKnowledge and experience with basic programming languages, such as HTML/CSS, Javascript, Python, and C#.\nMobile Application experience a plus; applicants with such experience will be preferred.\nExperience working on website development, or support for web development.\nMust be 18 years of age\nMust be authorized to work in the US\nExcellent written and verbal communication skills\nSelf-directed and able to work without supervision and in a team\nEnergetic and eager to tackle new projects and ideas\n\nAbout Ag-Analytics\n\nThe Ag-Analytics® platform brings farmers, universities, industry and government together with our combined research roots, long standing business relationships, and technology development. We aim to help our users make better management decisions, increase yield, improve sustainability, and mitigate risk. Check us out at analytics.ag.\n\nJob Types: Part-time, Internship\n\nExperience:\n\nWeb Development: 1 year (Preferred)\n\nEducation:\n\nHigh school or equivalent (Required)\n\nLocation:\n\nIthaca, NY 14850 (Required)\n\nWork authorization:\n\nUnited States (Required)",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "python",
            "C and C++",
            "web development"
        ],
        "compensation": "paid"
    },
    {
        "position": "Business Intelligence LDP Intern",
        "company": "Travelers - 3.7",
        "location": {
            "city": "Hartford",
            "state": "CT"
        },
        "qualifications": "AIRelational DatabasesRoot Cause AnalysisMachine LearningMicrosoft OfficeBachelor's DegreeMaster's Degree",
        "posted": "2020-07-15T01:22:32.256Z",
        "url": "https://www.simplyhired.com/job/t2PO9rHMgnTNEnMAP30TRgKryXfhWXcfeA8E3PnItGy-50aKJ1r-Vw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:32.256Z",
        "description": "Company Information\n\nSolid reputation, passionate people and endless opportunities. That’s Travelers. Our superior financial strength and consistent record of strong operating returns mean security for our customers – and opportunities for our employees. You will find Travelers to be full of energy and a workplace in which you truly can make a difference.\n\nTarget Openings\n\n35\n\nJob Description Summary\n\nThe intent of this position is to provide our 2020 Travelers Summer Interns and Summer Students the ability to apply to our 2021 Business Insights & Analytics LDP Intern opportunities. Applications outside of this audience will not be considered at this time. However, for additional positions posted at a later date we encourage anyone who was not a Summer Intern or Summer Student between June 2020-August 2020 to apply at that time.\n\nThe Travelers Internship Program provides qualified students an excellent opportunity to gain first-hand business experience, receive valuable on-the-job training, and take a 10 week journey to discover if one of the many opportunities in the Insurance industry – including the growing field of Business Intelligence data leveraged within our business insights & analytics community – is right for you.\n\nAs a Business Intelligence Intern, within the Business Insights & Analytics Leadership Development Program, your potential will be unlocked through robust projects, planful training, helpful development resources (Peer Advisors & Mentors) and engaging with your cohort of peers.\n\nYou'll utilize Travelers largest competitive edge – its data, in drawing meaningful business insights to enhance our business results. This community works within traditional areas of business insights & analytics in addition to emerging capabilities within artificial intelligence, big data, and social media/consumer/text analytics. Our interns work with key stakeholders in our business to identify challenges and create actionable solutions using a blend of business and technical skills. Be prepared to work with relational databases, reporting systems, discovery tools, or pilot new proofs of concept.\n\nYour internship could be placed in one of five different areas: information delivery, data engineering, business analysis, data management or business performance analytics. This is a pipeline position with the opportunity to have your application and performance considered at the end of the summer for our three year Business Insights & Analytics Leadership Development Program.\n\nPositions within this family work with business customers to determine how location intelligence data and analytic solutions can be leveraged to provide business insights for business strategies, capabilities, and processes\n\nThere are multiple paid intern positions within various areas of Business Intelligence in Hartford, CT or St. Paul, Minnesota.\n\nPrimary Job Duties & Responsibilities\n\nBusiness Analysis\nAids in eliciting, analyzing, specifying, communicating and validating Business Intelligence requirements processes.\nFacilitates user groups, documentation of requirements and business process flows.\nSupports the ongoing rationalization of business intelligence assets to ensure they are providing utmost value for business outcomes.\nData Management\nParticipates in the data governance and metadata processes by aiding in the preparation of artifacts for review and submission (i.e. researching, preparing simple submissions, and data quality metrics.)\nGains an understanding of overall data models, data relationships, mapping lineage and business rules and participates in the creation of data models (e.g. entity design and population).\nLearns and adheres to all data management practices and governance.\nInformation Delivery\nWorks with delivery team to design the delivery strategy that fulfills the business requirements.\nLearn how to develop automate, compile, and prepare reports, dashboards, cubes, etc.\nCollection of data.\nIntegration of that data.\nDevelopment (prototyping and production build).\nLearns how to complete root cause analysis and facilitates some quality assurance facets of projects.\nLearns how to identify and inform data management of new sources and attributes for their governance.\nArtificial Intelligence\n\nMany of your projects could contain:\nText Analytics\nImage Recognition\nMachine Learning\nDeep Learning\nSpeech Recognition\nVirtual Assistants\n\nMinimum Qualifications\n\nMust be pursuing a Bachelor's or Master's degree.\n\nEducation, Work Experience, & Knowledge\n\nCumulative GPA of 3.0 or higher preferred.\nMath, Economics, Finance, IT, Computer Science MIS/BIS, or Data related majors preferred.\nWorking knowledge of Microsoft Office products (Excel & Access).\nSQL experience a plus.\nExperience with dashboarding, scorecard, or reporting tools a plus.\nExtra-curricular involvement in campus or community activities.\nRelated internship/work experience helpful.\n\nJob Specific Technical Skills & Competencies\n\nSelf-motivated and demonstrated leadership experience/skill.\nStrong written and oral communication skills.\n\nEqual Employment Opportunity Statement\n\nTravelers is an equal opportunity employer.",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ],
        "compensation": "paid"
    },
    {
        "position": "Spring Internship Position",
        "company": "Tennessee Valley Authority - 3.8",
        "location": {
            "city": "Chattanooga",
            "state": "TN"
        },
        "qualifications": "SpringCommunication SkillsMicrosoft WordMicrosoft ExcelMicrosoft Outlook18 Years or Older",
        "posted": "2020-07-15T01:22:32.480Z",
        "url": "https://www.simplyhired.com/job/81OGl3TjzcU2zJb0xeh_L76Efra9u00W0N2VILxuXL9pkrVFWe9SeA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:32.480Z",
        "description": "Spring Intern Position\n\nLocations Available:\n\nChattanooga, TN\nKnoxville, TN\nMemphis, TN\nNashville, TN\nStarkville, MS\nMuscle Shoals, AL\nMayfield, KY\nTupelo, MS\nPosting Open: 07/03/2020\n\nPosting Closing: 10/30/2020\n\nSalary: Paid internship, based on class standing and major\n\nFounded in 1933, Tennessee Valley Authority is a corporate agency of the United States with over 10,000 employees who provide electricity for business customers and local power distributors serving 9 million people across 7 states. By joining TVA, you will find a mission-oriented company committed to core values of safety, service, integrity, accountability and collaboration. Our mission focuses on providing economic development, environmental sustainability and power generation to the people of the Tennessee Valley.\n\nThe TVA Bold Beginnings Internship Program is designed to provide real-world experience and professional development opportunities to talented undergraduate and graduate students. As a Bold Beginnings Intern, you will impact the future of TVA by collaborating and providing input to programs and projects.\n\nTo be considered, GPA and anticipated graduation date must be stated on the resume and a copy of a current transcript must be attached to the online application.\n\nEligibility Factors:\n\nCurrently majoring in Engineering, Business Analytics, Computer Science, Business, Finance, or other majors from an accredited college or university\nMust have completed at least 30 hours of college coursework\nMaintain a GPA of 2.75 or higher\nCurrently enrolled as a full time student\nHave reached the age of 18 years old\nMay be required to obtain and maintain a security clearance based on position, access requirements and essential job functions\nKnowledge, Skills and Abilities:\n\nWritten and Oral Communication Skills\nPlanning and Organization Skills\nProficiency in MS Word, Excel and Outlook\nSafety Skills and Awareness\nCoordination and Collaboration Skills\nInterpersonal Skills\nMajority of positions will be located in Chattanooga, but other positions may be located in Nashville, Knoxville or at a plant location depending upon the business unit the position supports.\n\nStudents may be eligible for housing assistance if the TVA official work station is more than 50 miles from the student’s permanent home address.\n\nAn overwhelming response is expected for a limited number of openings. Candidates selected for an interview will be contacted before November 15, 2020.\n\nEqual Employment Opportunity\n\nTVA values and embraces diversity. We encourage all individuals to apply regardless of race, color, national origin, ethnicity, gender, sex, abilities/disabilities, sexual orientation, religion, veteran status and age. We strive to be inclusive of all the people we serve across the Valley.\n\nTVA is an Equal Opportunity employer and complies with all applicable laws and regulations regarding equal employment opportunities. Any applicant or employee who believes s/he has a discrimination claim (including harassment or retaliation) must contact TVA’s Equal Opportunity Compliance office within 45 calendar days of the event or action s/he believes to constitute discrimination, harassment, or retaliation.\n\nDrug-Free Workplace\nAll TVA Non-Nuclear employees are covered by TVA's Federal Drug-Free Workplace Program Plan, in accordance with Executive Order 12564, Public Law 100-71 and the Mandatory Guidelines for Federal Workplace Drug Testing. Information regarding the Drug Free Workplace Program can be found at www.samhsa.gov/workplace. TVA Non-Nuclear employees in Testing Designated Positions, including those performing safety-sensitive duties are also subject to random drug testing. TVA Nuclear employees are subject to random alcohol and drug tests in accordance with 10 CFR Part 26 as mandated by the Nuclear Regulatory Commission (NRC).",
        "skills": [
            "information technology",
            "software engineering"
        ],
        "compensation": "paid"
    },
    {
        "position": "Executive Support Intern",
        "company": "PharmD Live - ",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "qualifications": "Project ManagementMicrosoft OfficeMicrosoft WordMicrosoft ExcelMicrosoft PowerpointBachelor's Degree",
        "posted": "2020-07-15T01:22:32.672Z",
        "url": "https://www.simplyhired.com/job/zSXJlZMlEWI8i6nq33LEqDKoP88DnTxQVlCwZlGAgtuDyxTPmFpiHg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:32.672Z",
        "description": "PharmD Live is seeking an Intern to join our emerging telehealth company. This is a great opportunity for a student seeking a career in the healthcare, clinical pharmacy, telehealth, software, marketing and business. You will help us connect healthcare professionals to our product and services by supporting the executive team and have fun while doing it!\n\nThe Intern will assist the Executive leadership team on various projects and tasks to gain experience. He/She will work on a wide variety of projects including research, document and presentation creation and management, calendar managment, social media communications and website updates. Hours are flexible, with a minimum of ten hours a week. This position is available starting in April/May, and end date/holiday schedule is flexible. The intern will work remotely, ideally close to the District, Northern Virginia, Maryland area.\n\nProjects / Learning Outcomes:\nThe intern will report to one member of the executive team, but will collarobrate on projects as needed by other executives leading those projects as needed. The intern will learn cross team communications and project management skills, as well as higher proficiency of MS Suite skills, Google appliocations, Canva and Zoho CRM. The ability to construct content and enhance communications as well as the usage of web tools, etc. The intern will gain exposure to specific healthcare, pharmacy, government, business and telehealth terminology.\n\nThis is a great opportunity to enhance skills in organization, multi-tasking, communications, sales and marketing and project management.\n\nQualifications and Requirements:\n\nGeneral business knowledge – a few business courses or experience working in an office •Use of MS office suite – basic Word, Outlook, and Excel. PowerPoint helpful.\nEnrolled in a college degree program\nStrong communication (oral, writing and presentation) skills\nDetail oriented\nProfessional presence and demeanor\nPlease apply through Indeed with your resume and cover letter.\n\nLocation\n\nRemote\n\nPosition Type: Internship\nDesired Major(s): Pharmacy, Computer Science, Marketing, Business Desired Class Level(s): Junior, Senior\nSalary Level: Unpaid - for credit\nJob Function: Administrative\n\nApproximate Hours Per Week: 10-15\n\nCompany Description:\nWe partner with physicians, accountable care organizations, post-acute care facilities and hospitals to deliver turnkey care management, including chronic care management services, to Medicare and Medicaid beneficiaries. Our board-certified pharmacists utilize our innovative, HIPAA-compliant software solution to improve clinical and financial outcomes.",
        "skills": [
            "machine learning",
            "software engineering"
        ],
        "compensation": "unpaid",
        "start": "2020-05-01T10:00:00.000Z"
    },
    {
        "position": "McSally for US Senate Remote Campaign Field Intern",
        "company": "National Republican Senatorial Committee - 4.8",
        "location": {
            "city": "St. Louis",
            "state": "MO"
        },
        "qualifications": "Marketing",
        "posted": "2020-07-15T01:22:32.869Z",
        "url": "https://www.simplyhired.com/job/GSgOZLleKgsPSK_LvbX4ps5qs6YJHJWEC119K_1M4PK83E98jbHy_A?q=computer+science",
        "lastScraped": "2020-07-15T01:22:32.869Z",
        "description": "Campaign to Re-Elect Martha McSally to the US Senate\n\nRemote Field Internship\n\nThe Martha McSally campaign (R-AZ) is accepting remote interns for the Fall 2020 semester to help maintain the Republican majority in the US Senate. You'll be working for the most watched US Senate race in 2020 and have the opportunity to affect the balance of the US Senate.\n\nMany schools and programs are requiring internships to be performed remotely this semester. As a remote field intern, you will be remotely embedded in a McSally for Senate Field Office. Meeting with staff at least weekly via video conferencing, you will be assigned weekly campaign tasks and voter contact goals while also welcome to join virtual political meetings with voter groups via video conferencing. Staff will perform all paperwork and reporting that is required by your internship program.\n\nThe McSally campaign will continue to provide a productive and worthwhile internship experience while also abiding by CDC social distancing guidelines. We welcome all prospective remote interns to apply regardless of location.\n\nInterns will receive valuable campaign and political experience typically necessary to later move in to a paid position in politics. Interns in good standing will receive a letter of recommendation from the campaign manager as well as credit pending good standing and scholastic approval.\n\nWhat You’ll Do:\n\nYou’ll be able to use your experience to enact real world changes, and take part in one of the most contested and publicized U.S. Senate races in the country. You’ll take part in virtual phone banks, providing important ground level voter contacts. In addition to the base field work, your experience in marketing, politics, communication, data-basing, business, math, computer science, or virtually any other major will be directly utilized to complete special projects for the election campaign.\n\nExamples of projects so far include: real time performance statistics for phone bank participants, recruitment development/strategy, and social media content creation. You’ll also use your education to work alongside field staff spearheading virtual volunteer recruitment campaigns.\n\nYou’ll Work With:\n\nLike minded, driven individuals. You’ll work alongside college and high school age interns, volunteers, field staff and senior level campaign staff.\n\nInternship Credit/Service Hours:\n\nYour remote internship will qualify for credit at most universities. See guidelines for how to apply for credit within your specific school's department. Your internship may also cover elective or required courses in most Political Science programs.\n\nInternship hours may also count for service hours for Greek and other organizations, email for more information on eligibility.\n\nWhat You'll Get:\n\nInterns committing to 10 - 12 hours per week will receive a letter of recommendation from the campaign manager, NRSC director or the candidate (your choice) at the end of the campaign. Interns will also qualify to receive credit pending your school's approval.\n\nJob Type: Internship\n\nCOVID-19 considerations:\nWe are providing remote only internships this semester. You may intern with our campaign from anywhere in the country without having to be in contact with others.\n\nWork Location:\n\nFully Remote\n\nInternship Compensation:\n\nCollege Credit\n\nCompany's website:\n\nmcsallyforsenate.com\n\nCompany's Facebook page:\n\nhttps://www.facebook.com/MarthaMcSally",
        "skills": [
            "information technology"
        ],
        "compensation": "paid"
    },
    {
        "position": "Test Engineering Intern",
        "company": "Cole Engineering Services Inc. - ",
        "location": {
            "city": "Orlando",
            "state": "FL"
        },
        "qualifications": "Unit TestingTroubleshootingSystem TestingSoftware DevelopmentJiraBachelor's Degree",
        "posted": "2020-07-15T01:22:33.072Z",
        "url": "https://www.simplyhired.com/job/fJm4r_-cngZDgbQib3Mlo5Ecl5QVArES270bikkMaSPYxhHhEAyacA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:33.072Z",
        "description": "Job Summary: Cole Engineering Services is seeking a highly motivated candidate to support activities for an emerging simulation and training capability for the United States Army. The candidate will support test and evaluation activities to include development of test procedures, supporting the execution of test and evaluation events, and performing hardware and software analysis and troubleshooting across complex military systems.\n\nEssential Job Functions:\nCandidates will support the design, creation and execution of hardware/software test cases, scenarios, and procedures that incorporates the use of a variety of software applications and tools.\nAssists in defining integration and testing processes and procedures.\nPerforms unit testing, configuration item and system level tests, and supports verification/validation testing as required.\nDevelops test plans and test reports for all levels of testing performed.\nWorks closely with the leads, development staff and systems engineers to thoroughly understand the system requirements and hardware/software implementation.\nWorks closely with leadership to identify and define testing strategies and plan resources to ensure adequate assets are in place for all testing activities.\nAnalyzes test results, metrics and trends and provides feedback to development and systems engineers.\n\nRequired Education/Experience:\nCurrently seeking Bachelor’s or Graduate coursework in a related technical discipline such as mechanical engineering, electrical engineering, industrial engineering, computer science, information technology, systems or software engineering from an accredited college or university.\nPosition is year-round. Hours are flexible based on coursework and academic commitments.\n\nKnowledge in any of the following areas would be considered a plus:\n\nHardware troubleshooting and fault diagnosis.\nKnowledge and experience of testing methodologies and analyzing results from small-scale unit testing to large-scale system testing.\nKnowledge/experience with Industry best-practice software development and collaboration tools such as JIRA and Confluence.\nExperience operating in a collaborative work environment.\n\nOther Requirements: Please note that pursuant to a government contract, this specific position requires U. S. Citizenship status with ability to obtain a SECRET security clearance.\n\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. The above is intended to describe the general contents of and requirements for the performance of this job.\n\nCole Engineering Services, Inc. has been, and is fully committed to equal employment opportunity. Equal Employment Opportunity will remain a fundamental principle, where we seek to recruit the very best candidates. CESI actively seeks to recruit and does not discriminate in employment without regard to gender, race, color, religious creed, national origin, age, sexual orientation, gender identity, physical or mental disability and/or protected veteran status.",
        "skills": [
            "information technology",
            "software engineering"
        ]
    },
    {
        "position": "NRSC Remote Campaign Field Intern",
        "company": "National Republican Senatorial Committee - 4.8",
        "location": {
            "city": "Seattle",
            "state": "WA"
        },
        "qualifications": "Marketing",
        "posted": "2020-07-15T01:22:33.275Z",
        "url": "https://www.simplyhired.com/job/s__NcCt9JmBmTkqp2LtJvpMRql-URi6pbnkskvAR6LSbOFVk2yKC_g?q=computer+science",
        "lastScraped": "2020-07-15T01:22:33.275Z",
        "description": "National Republican Senatorial Committee\n\nRemote Field Internship\nThe National Republican Senatorial Committee is accepting remote interns for the Fall 2020 semester to help maintain and grow the Republican majority in the US Senate.\n\nMany schools and programs are requiring internships to be performed remotely this semester. As a remote field intern, you will be paired with a Republican US Senate campaign in a state with a high profile and tightly contested race. Meeting with staff at least weekly via video conferencing, you will be assigned weekly campaign tasks and voter contact goals while also welcome to join virtual political meetings with voter groups via video conferencing. Staff will perform all paperwork and reporting that is required by your internship program.\n\nThe NRSC is will continue to provide a productive and worthwhile internship experience while also abiding by CDC social distancing guidelines. We welcome all prospective remote interns to apply regardless of location.\n\nInterns will receive valuable campaign and political experience typically necessary to later move in to a paid position in politics. Interns in good standing will receive a letter of recommendation from the campaign manager as well as credit pending good standing and scholastic approval.\n\nWhat You’ll Do:\n\nYou’ll be able to use your experience to enact real world changes, and take part in one of the most contested and publicized U.S. Senate races in the country. You’ll take part in virtual phone banks, providing important ground level voter contacts. In addition to the base field work, your experience in marketing, politics, communication, data-basing, business, math, computer science, or virtually any other major will be directly utilized to complete special projects for the election campaign.\n\nExamples of projects so far include: real time performance statistics for phone bank participants, recruitment development/strategy, and social media content creation. You’ll also use your education to work alongside field staff spearheading virtual volunteer recruitment campaigns.\n\nYou’ll Work With:\n\nLike minded, driven individuals. You’ll work alongside college and high school age interns, volunteers, field staff and senior level campaign staff.\n\nInternship Credit/Service Hours:\n\nYour remote internship will qualify for credit at most universities. See guidelines for how to apply for credit within your specific department. Your internship may also cover elective or required courses in most Political Science programs.\n\nInternship hours may also count for service hours for Greek and other organizations, email for more information on eligibility.\n\nWhat You'll Get:\n\nInterns committing to 10 - 12 hours per week will receive a letter of recommendation from the campaign manager, NRSC director or the candidate (your choice) at the end of the campaign\n\nAbout National Republican Senatorial Committee (NRSC)\nThe NRSC (National Republican Senatorial Committee) is the only national organization solely devoted to strengthening the Republican Senate Majority and electing Republicans to the United States Senate. We provide invaluable support and assistance to current and prospective Republican U.S. Senate candidates in the areas of budget planning, election law compliance, fundraising, communications tools and messaging, research and strategy.\n\nJob Type: Internship\n\nCOVID-19 considerations:\nWe are providing remote only internships this semester. You may intern with our campaign from anywhere in the country without having to be in contact with others.\n\nWork Location:\n\nFully Remote\n\nInternship Compensation:\n\nCollege Credit\n\nCompany's website:\n\nnrsc.org\n\nCompany's Facebook page:\n\nhttps://www.facebook.com/nrsc",
        "skills": [
            "information technology"
        ],
        "compensation": "paid"
    },
    {
        "position": "IT Intern Substitute",
        "company": "MHMR of Tarrant County - 3.4",
        "location": {
            "city": "Fort Worth",
            "state": "TX"
        },
        "qualifications": "Communication SkillsOrganizational SkillsData CollectionSDLCAgileBachelor's DegreeMaster's DegreeClean Driving RecordCurrent TB TestPre-Employment Physical Examination",
        "posted": "2020-07-14T01:22:33.488Z",
        "url": "https://www.simplyhired.com/job/iAi7D9T5CL3AJ8vCW2g_omrGTV4lgCbkXuAKVgmI7Q7rMIE3y_myjA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:33.488Z",
        "description": "I) Job Purpose\n\nThis opportunity is for current junior/senior level students or recent graduates with an information technology degree. The position requires verification of enrollment in school and an official transcript with a major related to Information Technology. The IT intern will use computer hardware and software applications to solve employees' technical problems and provide excellent service to them. This includes monitoring and responding to incoming help desk requests, supporting company applications, helping with troubleshooting issues and assisting in maintaining hardware and software assets. The IT intern will support the IT department in providing support and/or be assigned to participate in development projects contributing to the overall productivity of the department to meet business objectives.\n\nII) Essential Functions\n\nA) Learn the vision/culture/practices of MHMR and the MHMR Information Technology department.\n\nB) Exhibit a positive attitude and willingness to learn\n\nC) The intern filling this position may have the following responsibilities:\n\n(a) Analyze, gather, and document business and/or technical requirements\n\n(b) Document the current process or data flows and provide recommendations/create documentation for a future process flow.\n\n(c) Assist in the modification, enhancement, and testing of existing applications\n\n(d) Assist in the implementation of new information systems, which may replace or augment the current application set.\n\n(e) Assist in providing analysis, reporting, tracking, and resolution of problems relating to their assigned systems.\n\n(f) Assist in the development of interfaces or data transfers between systems.\n\n(g) Assist in development of data extracts or reports.\n\n(h) Plan and work flexibly to deadlines.\n\n(i) Support users as it relates to system needs.\n\n(j) Assist with security related tasks.\n\n(k) Provide training and user manuals to users of a system.\n\n(l) Participate in the development of software applications\n\n(m) Assist in researching options and research computer bugs and their solutions\n\n(n) Assist in infrastructure administration activities such as server and storage capacity handling and directory services management\n\nD) Provide regular status reports.\n\nE) Follow IT department development methodology and change management policy.\n\nF) Track work with designated tools\n\nG) Performance standards are performed as applicable with MHMR’s We CARE values “We Connect People in Our Community. We Provide Access to Services. We Link People to Resources. We Empower People.”\n\nH) Perform other job duties or responsibilities as requested or assigned.\n\nIII) Knowledge of Laws, Regulations, Policies/Procedures, Skills, and Abilities\n\nA) Excellent analytical and problem-solving skills\n\nB) Excellent written and verbal communication skills\n\nC) Excellent organizational skills\n\nD) Ability to execute tasks with little direction or supervision.\n\nE) Ability to respond to common inquiries or complaints from customers.\n\nF) Ability to define problems, collect data, establish facts, and draw valid conclusions.\n\nG) Ability to utilize project management and software implementation methodologies.\n\nH) Knowledge of SDLC and/or Agile Development Methodology\n\nI) Working knowledge of object-oriented design and programming languages (Java or C#, .Net)\n\nJ) Working knowledge of HTML, XML, and JavaScript.\n\nK) Have basic knowledge of SQL commands, relational database concepts, design, constraints, stored procedures, functions and optimization.\n\nL) Have good knowledge of algorithms, data structures, and best practices in software development\n\nM) Operating systems such as Windows and/or UNIX\n\nIV) Internal & External Customer Service\n\nA) This position requires internal and external contact with all levels of management and field personnel. The employee will accomplish this with advanced written and verbal skills.\n\n(a) Maintains a positive working relationship with other team members.\n\n(b) Maintains a good attendance record\n\n(c) Maintains a positive attitude and good customer service at all times.\n\nB) External:\n(a) Vendor management and technical personnel\n\n(b) Personnel from state or other governing agencies\n\n(c) Internal:\n\nSenior Management\nMHMR IT staff\nMHMR staff from other departments\nV) Travel\n\nA) This position requires some travel to MHMR facilities and training providers.\n\nMinimum Requirements\n\nRequired Education\nRecent graduate or current candidate in a bachelor's or master's degree program in computer science or related field. GPA must be 3.0 or above.\n\nDefined Education\nMajor must be in Computer Science/Engineering, Information Systems or other related Technical Degree.\n\nRequired Experience\nNone\n\nDefined Experience\nNone\n\nSubstitutions\nNone\n\nRequired Supervisory Experience\nNone\n\nRequired License\nValid Texas driver’s license with an acceptable driving record.\nMust provide license (if applicable) and official documentation of all educational attainment i.e. Transcript/Degree/Certificate\n\nTesting Requirements\nPre-employment tests including drug and TB Screening, Physical Exam including balance, and lift test.\nSatori Alternatives to Managing Aggression (SAMA) Containment.\n\nLifting Requirements\nUp to 15 Pounds\n\nAdditional Information\n\n\nMHMR of Tarrant County (“MHMR”) and its affiliates and subsidiaries have an internal recruiting department. MHMR may supplement that internal capability from time to time with assistance from temporary staffing agencies, placement services, and professional recruiters herein after referred to collectively as “Recruiters\"). Recruiters are hereby specifically directed NOT to contact MHMR employees directly in an attempt to present candidates – MHMR recruiting team or other authorized MHMR personnel must present ALL candidates to hiring managers. For more information please visit our website",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "C and C++",
            "machine learning"
        ]
    },
    {
        "position": "Software Engineer, Intern/Co-op",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Sausalito",
            "state": "CA"
        },
        "qualifications": "C/C++JavaPHPHTML5CSSBachelor's DegreeMaster's DegreeWork Authorization",
        "posted": "2020-07-14T01:22:33.686Z",
        "url": "https://www.simplyhired.com/job/kJBHRQsD_HFLM8T_4nolxOCjilFDe8Vfw1GPHI7_cqOj4mK8b3_YFw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:33.686Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nWant to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Groups, NewsFeed, Search, and Messaging? Want to solve unique, large-scale, highly complex technical problems? Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site hours later. If you work for us you will make an impact, immediately. Facebook is seeking interns/co-ops to join our engineering team. As a Software Engineer Intern, you'll drive the development of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe.This internship/co-op has a minimum twelve (12) week duration.\n\nCode high-volume software using primarily C++ and Java\nCreate web applications using primarily PHP\nImplement web interfaces using XHTML, CSS, and JavaScript\nBuild report interfaces and data feeds\n\n1 or more years of experience with perl, java, php, python, or c++\nMust be currently enrolled in a full-time, degree-seeking program and in the process of obtaining a Bachelors or Masters degree in Computer Science or a related field\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "software engineering",
            "javascript",
            "python",
            "java",
            "C and C++"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Research Intern, Artificial Intelligence",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "qualifications": "AINatural Language ProcessingMachine LearningResearch ExperienceComputer ScienceDoctoral DegreeMaster's DegreeBachelor's DegreeWork Authorization",
        "posted": "2020-07-14T01:22:33.894Z",
        "url": "https://www.simplyhired.com/job/uFb13DSTHsq9UL1cK8WetP_-cwmexdKueNTiaVLvE4xa3sqBm7Li0g?q=computer+science",
        "lastScraped": "2020-07-15T01:22:33.894Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nFacebook was built to help people connect and share, and over the last decade our tools have played a critical part in changing how people around the world communicate with one another. With over a billion people using the service and more than fifty offices around the globe, a career at Facebook offers countless ways to make an impact in a fast growing organization. Facebook is seeking Research Interns to join Facebook AI Research (FAIR). We are committed to advancing the field of artificial intelligence by making fundamental advances in technologies to help interact with and understand our world. We are seeking individuals passionate in areas such as deep learning, computer vision, audio and speech processing, natural language processing, machine learning, reinforcement learning, computational statistics, and applied mathematics. Our interns have an opportunity to make core algorithmic advances and apply their ideas at an unprecedented scale. Many of our interns publish at top tier conferences such as NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV, and ACL. This internship has a minimum 12-week duration. We have openings in our Menlo Park, New York, Seattle, and Pittsburgh offices. Internships will be awarded on a rolling basis and candidates are encouraged to apply early. Applicants are expected to be pursuing a PhD in one of the areas listed above; outstanding Masters and Bachelor students may also be considered. To learn more about our research visit https://research.facebook.com.\n\nPerform research to advance the science and technology of intelligent machines\nPerform research that enables learning the semantics of data (images, video, text, audio, and other modalities)\nDevise better data-driven models of human behavior, and/or\nContribute research that can be applied to Facebook product development\n\nCurrently has, or is in the process of obtaining, a degree (PhD, Masters, or Bachelors with relevant research experience) in Computer Science or related field\nMust obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment.\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "machine learning",
            "information technology",
            "artificial intelligence"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Business Intelligence Analyst Intern: Business / Systems Analyst Internship",
        "company": "Duart Mull Capital Partners - ",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "qualifications": "RESTAPIsDatabasesRelational DatabasesSQL",
        "posted": "2020-07-14T01:22:34.106Z",
        "url": "https://www.simplyhired.com/job/9D5MAtByzR3x0fXR-xW8c-MQTXjxOAk8sJ1x-9HCiBh1SFsQuVNpmw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:34.106Z",
        "description": "Business Intelligence (BI) Analyst Intern\n\n(Systems Analyst / Business Analyst / Data Analyst / Data Architect / Information Technology Analyst / Database Administrator Internship)\n\nFirm Overview and Position Summary:\n\nDuart Mull is an Atlanta-based investor that takes an active role in assisting its portfolio companies in their strategic growth plans. The primary focus of the Duart Mull team is working as a consultant partner to its portfolio companies in order to identify opportunities to connect management to the information that helps them make better decisions. In order to support the growth of its portfolio companies, Duart Mull is seeking to add a Business Intelligence (BI) Analyst Intern to the team to design and implement systems and processes to (1) support dashboarding, operating analytics, and ad hoc analysis projects to aid strategic decisions and (2) streamline automation and back-office processes. This position is a unique opportunity to work with the private equity capital partner of an exciting variety of growth-stage companies. If you are seeking a very challenging and rewarding environment in which to grow your skills and experience in a broad range of high-growth companies, this may be a fit for you.\n\nThe skillset required for this role is heavily concentrated in relational databases, third-party RESTful APIs, and the various tools that connect to data sources in order to analyze operations/transaction data and create dashboards, reports, and visualizations for management oversight and business process optimization. The successful candidate must have a solid understanding of relational databases, proficiency in SQL, experience in the extraction, transformation, and loading (ETL) of various data sources, familiarity in REST or SOAP APIs/ web services, and strong analytic skills. In addition to the required technical skillset, extraordinary verbal and written communication abilities are also required.\n\nAs a Business Intelligence Analyst Intern, the average breakdown of time is about 60% developing methods to optimize and report on portfolio company operations, 10% researching various aspects of prospective investment targets’ operations and systems, 15% executing weekly and monthly ETL tasks required for financial reporting/operational accounting functions, and 15% working in Duart Mull’s internal operations. Most activities involve connecting to each companies’ ERP/CRM systems and to third party APIs as data sources and normalizing data in order to create data models, reports, visualizations, real-time dashboards, and to facilitate data import and transfer functions between systems. The typical areas of focus include defining and optimizing customer acquisition processes, analyzing and presenting operations data, making marketing analytics actionable, development and execution of data flows between financial reporting & accounting systems, systems development, and technology selection.\n\nThe technologies/tools typically employed are SQL, Microsoft Excel, Power Query, Power BI, Microsoft Dynamics CRM, Salesforce, and Microsoft SharePoint. Prior experience in software development/ coding and database design is considered favorably in evaluation of skills. An existing expert-level knowledge of Excel is required and a willingness to learn the tactical administrative functions of SharePoint, Microsoft Dynamics CRM, prevalent general ledger systems like Quickbooks and Microsoft Dynamics GP is a requirement if those skills are not already in place.\n\nRequired Education and Experience:\n\nEnrolled in or recently completed a 4 – Year Degree program from a top-tier campus-based university.\n\nPreferred Undergraduate Major in management information systems, computer science, engineering, business administration, accounting, finance, mathematics, or relevant analytical discipline\n\n2+ years of analysis or information technology experience in an academic and/or business environment.\n\nRequired Skills:\n\nStrong Quantitative Analysis and Numeric Reasoning.\nAdvanced/Expert level in Microsoft Excel.\nProficiency in relational database design and Entity Relationship Diagrams (ERD).\nProficiency in Structured Query Language (SQL).\nPrior experience/Familiarity with Business Intelligence (BI) tools such as Microsoft Power BI or Tableau.\nIntermediate level in JSON or XML.\nIntermediate level in RESTful or SOAP APIs/ web services.\nIntermediate level in HTML.\nPrior experience/Familiarity in software development/coding using one of the following languages: JavaScript/ Java, PHP, Python, Visual Basic, C/C++, PEARL, or ASP.net.\nNatural English ability to expertly communicate verbally and in written form to a diverse and non-technical audience.\nAbility to learn and apply complex technical information quickly.\nAbility to work and excel on multiple projects in a fast-paced environment.\nHigh level of independence, assertiveness, and decisiveness.\n\nDesired Experience: (Not necessarily required.)\n\nMicrosoft Azure, MS SQL Server, and Cloud-based Data Warehousing.\nMicrosoft CRM and/or Salesforce.\nMicrosoft Power Query (M) and Microsoft Data Analysis Expressions (DAX).\nMicrosoft Visual Basic for Applications (VBA).\nKnowledge of accounting and finance.\n\nBeyond just education, skills, & experience:\n\nYou are honest and trustworthy.\nYou have an authentic passion for making businesses better and providing value to your teammates.\nYou are obsessed with numbers, a logical thinker, but also enjoy the opportunity to be creative.\nYou are a process person who plans obsessively and has the skills and background to prove it.\nYou are flexible and work hard and expect the same of your teammates.\nYou are curious, open-minded, and love the challenge of learning something new every day.\n\nCompensation:\n\nPaid Internship commensurate with prior experience and credentials\nHours are flexible based upon academic requirements\n\nJob Types: Part-time, Internship, Contract\n\nBenefits:\n\nDental Insurance\nDisability Insurance\nFlexible Schedule\nHealth Insurance\nLife Insurance\nPaid Time Off\nVision Insurance\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nanalysis or information technology: 2 years (Preferred)\n\nLocation:\n\nAtlanta, GA 30309 (Required)\n\nLanguage:\n\nFluent Natural English (Written and Verbal) (Required)\n\nWork authorization:\n\nUnited States (Required)\n\nContract Renewal:\n\nLikely\n\nFull Time Opportunity:\n\nYes\n\nAdditional Compensation:\n\nBonuses\nStore Discounts\n\nWork Location:\n\nOne location\n\nInternship Compensation:\n\nPay\n\nCompany's website:\n\nwww.duartmull.com/\n\nCompany's Facebook page:\n\nhttps://www.facebook.com/duartmull\n\nBenefit Conditions:\n\nWaiting period may apply\nOnly full-time employees eligible\n\nWork Remotely:\n\nNo",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "data visualization",
            "python"
        ],
        "compensation": "paid"
    },
    {
        "position": "Test Engineering Intern",
        "company": "Cole Engineering Services, Inc. - ",
        "location": {
            "city": "Orlando",
            "state": "FL"
        },
        "qualifications": "Unit TestingTroubleshootingSystem TestingSoftware DevelopmentJiraBachelor's Degree",
        "posted": "2020-07-14T01:22:35.568Z",
        "url": "https://www.simplyhired.com/job/edm6EZme5rPOq7OGh9BVpILd1HwLtURwFLU2B8Xm-xQUQSIK5SIsDg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:35.568Z",
        "description": "Job Summary: Cole Engineering Services is seeking a highly motivated candidate to support activities for an emerging simulation and training capability for the United States Army. The candidate will support test and evaluation activities to include development of test procedures, supporting the execution of test and evaluation events, and performing hardware and software analysis and troubleshooting across complex military systems.\n\nEssential Job Functions:\nCandidates will support the design, creation and execution of hardware/software test cases, scenarios, and procedures that incorporates the use of a variety of software applications and tools.\nAssists in defining integration and testing processes and procedures.\nPerforms unit testing, configuration item and system level tests, and supports verification/validation testing as required.\nDevelops test plans and test reports for all levels of testing performed.\nWorks closely with the leads, development staff and systems engineers to thoroughly understand the system requirements and hardware/software implementation.\nWorks closely with leadership to identify and define testing strategies and plan resources to ensure adequate assets are in place for all testing activities.\nAnalyzes test results, metrics and trends and provides feedback to development and systems engineers.\n\nRequired Education/Experience:\nCurrently seeking Bachelor’s or Graduate coursework in a related technical discipline such as mechanical engineering, electrical engineering, industrial engineering, computer science, information technology, systems or software engineering from an accredited college or university.\nPosition is year-round. Hours are flexible based on coursework and academic commitments.\n\nKnowledge in any of the following areas would be considered a plus:\n\nHardware troubleshooting and fault diagnosis.\nKnowledge and experience of testing methodologies and analyzing results from small-scale unit testing to large-scale system testing.\nKnowledge/experience with Industry best-practice software development and collaboration tools such as JIRA and Confluence.\nExperience operating in a collaborative work environment.\n\nO ther Requirements: Please note that pursuant to a government contract, this specific position requires U. S. Citizenship status with ability to obtain a SECRET security clearance.\n\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. The above is intended to describe the general contents of and requirements for the performance of this job.\n\nCole Engineering Services, Inc. has been, and is fully committed to equal employment opportunity. Equal Employment Opportunity will remain a fundamental principle, where we seek to recruit the very best candidates. CESI actively seeks to recruit and does not discriminate in employment without regard to gender, race, color, religious creed, national origin, age, sexual orientation, gender identity, physical or mental disability and/or protected veteran status.",
        "skills": [
            "information technology",
            "software engineering"
        ]
    },
    {
        "position": "Cyber Engineering Intern",
        "company": "Elbit Systems - 4.2",
        "location": {
            "city": "Fort Worth",
            "state": "TX"
        },
        "qualifications": "Microsoft OfficePenetration TestingSoftware DevelopmentAnalysis SkillsLinuxAssociate's DegreeBachelor's Degree",
        "posted": "2020-07-14T01:22:35.618Z",
        "url": "https://www.simplyhired.com/job/IXHq86t0nUDXMhtyNkQdUIWS9OVpK9s2OfdAn52FshQOzdTaWrbkLw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:35.618Z",
        "description": "Overview:\nThe position is for an Intern to work in the Cyber Engineering Department.\n\nResponsibilities:\nAssist Cyber Engineering personnel with the integration of cybersecurity, networking and information technology requirements into the full system lifecycle of Elbit Systems of America’s products. Assist in the process improvement activities. Assist in Systems cyber security verification activities.\n\nQualifications:\nMinimum Qualifications:\nWorking towards an associate or bachelor’s degree in Computer Science, Cyber Security, or closely related disciplines (within 24 months of BS or 12 months of AA).\n\nKnowledge, Skills, Abilities Required (Unique and Measurable):\n\nMicrosoft Office\nKnowledge of Embedded systems\nPenetration testing experience\nSecure software development process\nSoftware test experience\nStatic/dynamic source code analysis experience\nVirtual machine configuration and management\nCisco switch configuration\nFirewall configuration\nLinux server configuration and management\nWindows server configuration and management",
        "skills": [
            "information technology",
            "software engineering",
            "machine learning"
        ]
    },
    {
        "position": "Research Intern - Interaction Tracking (PhD)",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Sausalito",
            "state": "CA"
        },
        "qualifications": "Machine LearningDoctoral DegreeWork Authorization",
        "posted": "2020-07-14T01:22:35.812Z",
        "url": "https://www.simplyhired.com/job/q0UeVxdquyT4p_0GVGVRRX274_-4ztBbW8riKw07zoOndPhwl6RDhw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:35.812Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nFacebook Reality Labs and Oculus are looking for exceptional interns to help us create next generation experiences in virtual and augmented reality. Join a full-stack team working on computer vision, machine learning, real-time state estimation, geometric and appearance modeling, physically-based modeling, sensor design and fusion, and human computer interaction. We are accepting applications from students interested in (but not limited to) the following areas:\n\n\nOptical tracking of hands, bodies and objects and their interactions through state estimation and machine learning\nRepresentation modeling (e.g. appearance, geometry) of hands, bodies and objects for fast simulation and tracking\nPhysical simulation of soft contact, deformation models for grasp\nSensor fusion (e.g. of pressure, RF, EXG, IMU) with optical tracking\nDesign and fast evaluation of deep neural networks\nInteraction design for hands and bodies in virtual reality and augmented reality\nComputer vision (e.g. tracking), computer graphics (e.g. appearance, geometry, physically-based modeling), robotics (state estimation) and machine learning (e.g. applied DNN design) backgrounds are particularly welcome!\n\nOur internships are twelve (12) to twenty four (24) weeks long and we have various start dates throughout the year.\n\nDesign and execution of algorithms in the domain of computer vision, real-time state estimation, machine learning, geometric or appearance modeling (computer graphics), sensor fusion, or HCI\nSoftware and hardware prototyping, system-building\nDesigning user studies and experiments\nCollaboration with and support of other researchers across various disciplines\nCommunication of research agenda, progress and results\n\nCurrently has, or is in the process of obtaining, a PhD degree in Computer Science, Robotics, Applied Math or a related STEM field\nExcellent interpersonal skills, cross-group and cross-culture collaboration\nHigh levels of creativity and quick problem solving capabilities\nDemonstrated software engineering experience via an internship, work experience, or paper publications\nMust obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "machine learning",
            "software engineering",
            "robotics"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Research Intern, AI Infra (PhD)",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Boston",
            "state": "MA"
        },
        "qualifications": "AIDistributed SystemsEncryptionC/C++JavaDoctoral DegreeWork Authorization",
        "posted": "2020-07-14T01:22:36.005Z",
        "url": "https://www.simplyhired.com/job/IgvwcXQZ4LEAQd8Zdx5vcRlUHEtnSGGU-pqedCHN9ZHjpN0uk5mPqA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:36.005Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nFacebook builds systems that allow more than a billion people all over the world to connect and communicate using whatever devices they have available. Our systems need to be scalable, fast, reliable, and efficient in order to provide a great user experience. As we design and build these systems, Facebook engineers encounter grand challenges across all levels of systems—from data center, hardware, storage, mobile, to distributed systems, just to name a few. Moreover, fast evolving social apps and highly dynamic social workloads present us with many unique research opportunities. The entire Facebook platform is our lab for research, development, and innovation. As a PhD intern at Facebook, you will help build the next generation of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe. The ideal candidate will have a keen interest in relevant engineering fields, such as (but not limited to) distributed software systems, storage systems, data warehousing and analytics, database systems, operating systems, networking systems, programming languages, compilers & runtime systems, cryptography, security & privacy and mobile systems. The duration of this internship is sixteen (16) weeks with Summer, Fall, and Winter start dates. Internships will be awarded on a rolling basis and candidates are encouraged to apply early.\n\nBuild highly-scalable software systems using primarily C++ and Java.\nAnalyze the shortcomings of existing systems and propose potential design alternatives.\nDesign flexible APIs for Facebook product teams developing applications for web and mobile.\nBuild detailed monitoring to track the health of these systems and quickly triage issues.\nPerform specific responsibilities which vary by team.\n\nCurrently has, or is in the process of obtaining a PhD degree in Computer Science, related STEM or quantitative field, or relevant experience.\nResearch and/or work experience in distributed systems, networking, storage, formal verification, programming language, cryptography, security, privacy-enhancing technologies, or related technical fields.\nExtensive experience solving analytical problems using quantitative approaches.\nAbility to communicate complex research in a clear, precise, and actionable manner.\nFluency in C++, Java or other related language.\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "software engineering",
            "artificial intelligence",
            "java",
            "C and C++",
            "information technology"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Internship - GetInsured",
        "company": "Getinsured - 3.2",
        "location": {
            "city": "Mountain View",
            "state": "CA"
        },
        "qualifications": "SharePoint",
        "posted": "2020-07-14T01:22:36.204Z",
        "url": "https://www.simplyhired.com/job/14rIcMHQbXEMkNkD0sjx_Mag_GrrfbOlSO-7woi8KHxufdscaYAxfg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:36.204Z",
        "description": "Internship Description\n\nIt’s truly an exciting time to be a part of GetInsured. Our vision has always been to make finding and enrolling in health insurance simple. GetInsured currently has the largest state-based marketplace footprint, and our consumer-friendly interface and decision support tools empower millions of consumers across the country to make better health plan decisions. GetInsured builds and operates award-winning cloud-based enrollment tools that serve state-based exchanges, brokers, insurers, and consumers. In addition to eligibility determination, plan selection, and enrollment technology for state agencies, the company delivers innovative agent marketing and call center tools and services.\n\nWe are seeking a self-directed IT/Security intern with a passion for technology, security, compliance, collaboration, and creative problem-solving. The intern will actively contribute to meaningful projects and work closely with a mentor and with senior leadership.\n\nSecurity Intern Duties and Responsibilities\n\nSupport the security team in achieving and maintaining compliance for the platform, adhering to various federal and state regulations\nAssist in responding to the auditors on current practices, processes and configurations\nHelp in creating, organizing and maintaining central repository necessary for documentation\nLend support creating and implementing a strategy for transitioning documents from existing file-share to SharePoint\n\nRequirements\n\nComputer Science, Information Technology, or Management Information Systems major\nMinimum GPA of 3.0\nFamiliar with security testing techniques such as network discovery, port and service identification, vulnerability scanning, network sniffing, fuzzing, penetration testing, configuration reviews, firewall rule reviews, social engineering\nThe ability to interpret and convey technical information through written and oral communications to all levels of technical aptitude, including senior management\nHigh degree of integrity and confidentiality, as well as ability to adhere to company policies and best practices\nExcellent analytical and problem-solving skills\nAbility to work well in teams\nStrong work ethic and attention to detail\n\nBenefits\n\nGain hands-on experience in a Security/Compliance position\nShadowing and training experiences with knowledgeable professionals\nFlexible schedule for students",
        "skills": [
            "information technology",
            "software engineering",
            "cloud computing"
        ]
    },
    {
        "position": "Research Intern, Photorealistic Telepresence (PhD)",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "qualifications": "MathMachine LearningAlgorithm DesignMATLABPythonDoctoral DegreeWork Authorization",
        "posted": "2020-07-14T01:22:36.404Z",
        "url": "https://www.simplyhired.com/job/WlV33DMgJVpLcCEAy4Cr3o4PI8VvYfx8ceSHuXrQDk2s8aEWJaPjQA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:36.404Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nFacebook Reality Labs (FRL) in Pittsburgh is looking for exceptional interns to help us create a revolution in virtual reality: achieving true photorealistic telepresence, where you can with anyone, anywhere, at anytime. We have made some important advances, but it will take a diverse team with a wide spectrum of skills to accomplish this future. If you have expertise in computer vision, machine learning, and computer graphics, we expect you will find the work here highly intriguing. We are looking for motivated software, electrical, and mechanical engineers; and strong math skills are always a huge plus. We publish our work at leading conferences and journals.Come join us as we make photorealistic telepresence in VR happen!Available projects may include, but are not limited to: * Speech Synthesis * Machine Learning for Raw Audio * Distributed machine learning / deep learning * Multi-modal Face Tracking * High Fidelity Hand Model Reconstruction and Tracking * Geometric Camera Calibration * Photometric Camera Calibration * High Fidelity Face Models from Photo Collections * 3D Audio Reconstruction from Multiple Microphones * CNN Acceleration for realtime tracking * High-Precision 3D Hair Reconstruction * Full Body Tracking from the Headset * Realtime Markerless Motion Capture for Faces and BodiesOur internships are twelve (12) to sixteen (16) or twenty four (24) weeks long and we have various start dates throughout the year.\n\nSolve real problems in enabling Photorealistic Telepresence\nCollaboration with and support of other researchers across various disciplines\nCommunication of research agenda, progress, and results\n\nCurrently has, or is in the process of obtaining, a PhD in Audio Processing, Computer Science, Computer Vision, Computer Graphics, Robotics, Machine Learning, or related field\nInterpersonal skills: cross-group and cross-culture collaboration\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\nMust be available for 3 month to 6 month internship between January 1, 2020 and December 31, 2020\nExperience with solving inverse problems in imaging emphasizing modeling, algorithm development, and hardware prototyping\nExperience with scientific programming languages such as Matlab or Python\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "machine learning",
            "software engineering",
            "python",
            "matlab",
            "robotics"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Research Intern, Full Body Capture and Reconstruction (PhD)",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Sausalito",
            "state": "CA"
        },
        "qualifications": "Machine LearningRoboticsDoctoral DegreeWork Authorization",
        "posted": "2020-07-14T01:22:36.626Z",
        "url": "https://www.simplyhired.com/job/bOKn_OcdjF_y839UVK2BfWK_17hEOHESxDapIR8j6by80IgRz9kIlA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:36.626Z",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n\nFacebook Reality Labs(FRL) is a world leader in the design of virtual and augmented reality systems. We are currently seeking innovative interns with a passion for technology to develop the next generation of virtual humans. The focus of our roles is on full body capture and reconstruction.\n\nResearch Topics:\n\nMarkerless motion capture\nDense 3D surface deformation and reconstruction\nStatistical deformation models\nPhysics based animation and simulation\nApplied machine learning\nDifferentiable rendering\nPoint cloud representations\nOur internships are twelve (12) to sixteen (16) or twenty four (24) weeks long and we have various start dates throughout the year.\n\nDesign and execution of algorithms\nPrototyping, building and analysis of experimental systems\nCollaboration with and support of other researchers across various disciplines\nCommunication of research agenda, progress and results\n\nCurrently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, Robotics\nInterpersonal skills: cross-group and cross-culture collaboration\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\nMust be available for 3 month to 6 month internship between January 1, 2020 and December 31, 2020\n\nFacebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nFacebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "skills": [
            "machine learning",
            "robotics",
            "information technology"
        ],
        "contact": "ext@fb.com"
    },
    {
        "position": "Fall 2020 External Quality Service Intern",
        "company": "ON Semiconductor - 3.8",
        "location": {
            "city": "Meridian",
            "state": "ID"
        },
        "qualifications": "ISO 9001AS9100Microsoft ExcelOracleCommunication SkillsBachelor's DegreeMaster's Degree",
        "posted": "2020-07-14T01:22:36.867Z",
        "url": "https://www.simplyhired.com/job/43Zs3YOqsPBLsy1IeZECtvapsLyXmwGEFiC5H9zTiAX8NOMQ9DFsdg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:36.867Z",
        "description": "Job Summary:\nHere at ON Semiconductor we take great pride in our internship program and the efforts we take to provide students with hands-on industry experience. We provide competitive pay, medical benefits, various networking event opportunities, and flexible hours based on school schedule.\n\nThis internship is with the “External Quality Service Provider” organization; working on an ON Semiconductor global project to drive and improve quality across all External ON Semiconductor service provider sites. The job will introduce the student to all aspects of business in a large corporation with focus on the external service provider quality standards: ISO 9001 (quality), IATF / VDA6.3 (automotive), MIL-PRF 38535 (USA military), AS9100 (aerospace) and ISO 17025 (laboratories).\n\nWith this position the student will have the opportunity to\n\nDevelop a clear project plan to move the “external service provider” excel spread sheet into a web-site or already established ON Semiconductor system (i.e. Oracle, Agile…etc).\nSystem must have all required input for each type of external service provider; Calibration labs, Reliability labs, Product Analysis Labs and Design Services.\nSystem will electronically send out and receive approvals, disapproval and/or other input as needed.\nHistorical records and results will be available.\nBased on input, the system will calculate RISK for each service provider.\nSystem will define (based on RISK calculations) external sites that require audit each year (highest RISK).\nSystem will pull data to create graphs showing snap shots in time and long term RISK reduction.\nWork with and learn the quality standards: AS9100D, IATF 16949, VDA6.3, ISO 9001, MIL-PRF 38535 and ISO 17025.\nAssist as needed on training and update of training for global and site process owners at all ON Semiconductor sites to assist with roll out and implementation of “new quality standards” for selection, use and maintenance of external service providers. Provide recorded sessions of training using the ON Semiconductor SABA training system.\nAssist – as needed - with proper solving of issues and implementation of corrective actions at external service provider sites.\n\nPerformance Objectives:\nThis opportunity will ask a student to have the following performance objectives:\n\n\nComputer Science programming skills, including knowledge to manipulate and/or create a data-base.\nCompetent in Micro-soft office tools.\nGood communication skills.\nBusiness Savvy.\nThe following knowledge or skills would be helpful but not required:\nSemiconductor manufacturing and/or design.\nProgram management.\nShare Point software.\nISO 9001 or other quality standards.\nAPQP Semiconductor product/process development process.\nQualifications\n\nIn order to be considered for an internship, you must be a student currently enrolled in school pursuing an accredited degree program. This position is specifically looking for an undergraduate seeking a BS or BA in Computer Science or Engineering. Or, a Graduate seeking a Master’s Degree.\n\nON Semiconductor (Nasdaq: ON) is driving energy efficient innovations, empowering customers to reduce global energy use. The company is a leading supplier of semiconductor-based solutions, offering a comprehensive portfolio of energy efficient power and signal management, logic, standard and custom devices. The company’s products help engineers solve their unique design challenges in automotive, communications, computing, consumer, industrial, medical and military/aerospace applications. ON Semiconductor operates a responsive, reliable, world-class supply chain and quality program, and a network of manufacturing facilities, sales offices and design centers in key markets throughout North America, Europe and the Asia Pacific regions.\n\nEqual Employment Opportunity\n\nON Semiconductor is an equal opportunity employer. The Company maintains policies and practices that are designed to prevent discrimination or harassment against any qualified applicant or employee to the extent prohibited by federal, state and local laws and regulations. By way of example, discrimination on the basis of race, ethnicity, color, religion, ancestry, national origin, citizenship, sex (including pregnancy, childbirth, or related medical conditions), age, marital status, sexual orientation physical or mental disability, medical condition, genetic information (including test results), status as a Vietnam-era or special disabled veteran, uniform service member status, political affiliation, union membership, gender identity or gender expression, or any other characteristic protected by applicable law is prohibited.\n\nPrimary Location: US-ID-Meridian\nWork Locations: USID05 APTINA LLC (MERIDIAN) 3405 E Overland Rd Suite 120 Meridian 83642-5112\nJob: Intern\nJob Posting: Jul 13, 2020, 3:54:19 PM",
        "skills": [
            "software engineering",
            "machine learning",
            "information technology"
        ]
    },
    {
        "position": "Machine Learning Engineer Intern",
        "company": "Magic Brush - ",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        },
        "qualifications": "Machine LearningAISoftware ArchitectureData StructuresData ModelingBachelor's DegreeMaster's DegreeWork Authorization",
        "posted": "2020-07-13T01:22:37.113Z",
        "url": "https://www.simplyhired.com/job/DdpZGCdYmGskvEZi6hFadJiZLpcA9YSrk_nl-0vmI6jRwWRzSQjjXg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:37.113Z",
        "description": "Job brief\n\nWe are looking for a Machine Learning (ML) Engineer Intern to support us create artificial intelligence products.\n\nMachine Learning Engineer Intern responsibilities include creating machine learning models and retraining systems. To do this job successfully, you need exceptional skills in statistics and programming. If you also have knowledge of data science and software engineering, we’d like to meet you.\n\nYour ultimate goal will be to shape and build efficient self-learning applications.\n\nResponsibilities\n\nStudy and transform data science prototypes\nDesign machine learning systems\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nSelect appropriate datasets and data representation methods\nRun machine learning tests and experiments\nPerform statistical analysis and fine-tuning using test results\nTrain and retrain systems when necessary\nExtend existing ML libraries and frameworks\nKeep abreast of developments in the field\n\nRequirements\n\nProven experience as a Machine Learning Engineer or similar role\nUnderstanding of data structures, data modeling and software architecture\nDeep knowledge of math, probability, statistics and algorithms\nAbility to write robust code in Python, Java and R\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nExcellent communication skills\nAbility to work in a team\nOutstanding analytical and problem-solving skills\nBSc in Computer Science, Mathematics or similar field; Master’s degree is a plus\n\nJob Type: Internship\n\nPay: $42.00 - $85.00 per hour\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nMachine Learning: 1 year (Preferred)\n\nWork Location:\n\nFully Remote\n\nVisa Sponsorship Potentially Available:\n\nYes: H-1B work authorization\n\nCompany's website:\n\nMagicbrushglobal.com\n\nWork Remotely:\n\nTemporarily due to COVID-19",
        "skills": [
            "machine learning",
            "software engineering",
            "python",
            "java"
        ],
        "compensation": "paid"
    },
    {
        "position": "UI/UX Designer",
        "company": "HazAdapt, Inc. - ",
        "location": {
            "city": "Corvallis",
            "state": "OR"
        },
        "qualifications": "FigmaSketchAdobe XDInVisionUIBachelor's DegreeMaster's Degree",
        "posted": "2020-07-13T01:22:37.300Z",
        "url": "https://www.simplyhired.com/job/vsP5YyZXRnJYTfy7AZkVbfuJ31fK_3eM3SzvPJI2z7RdXFKHxjliwQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:37.300Z",
        "description": "Ready to change the world?\n\nHere at HazAdapt, we aim to revolutionize emergency communication and preparedness from the bottom up. We provide personalized, intelligent, and secure opportunities for community members to train for hazards, report emergencies, and receive and communicate information in real-time with local emergency management agencies and their communities.\n\nHumans are facing bigger and more complex disasters than ever before, and we need your help. Are you excited by the prospect of building personalized and intelligent software solutions that help people adapt to the hazards in their lives? Are you excited to build applications that have been designed to address and cater to the unique needs of a wide variety of users? Are you enticed by the idea of working closely with a group of local students aiming to revolutionize emergency response solutions and strategies? If you answered yes to any of these questions, you might fit right in on our team of engineers and designers at HazAdapt!\n\nWe are currently focused on continuing the development of our core platforms: a mobile application for reporting and receiving real-time information about live emergencies, and a web platform for emergency management agencies and community response groups to evaluate and respond to emergencies in their areas. We are looking for developers and designers who share our drive to create a more resilient world through intelligent and inclusively designed tech solutions.\n\nWe proudly welcome people from all backgrounds who are looking to help build a world where everyone, regardless of background, ability, or resources, can prepare and respond to emergency situations in a way that uniquely suits their needs.\n\nRequired Qualifications\n\nHave or are currently pursuing a Bachelor’s or Master’s degree in Human-Computer Interaction, Design, Computer Science, or a related field\nEmpathy for users, passion for using data to make product decisions\nGather and evaluate user requirements, in collaboration with product managers and engineers.\nFamiliarity with prototyping tools like Figma, Sketch, Adobe XD, Invision, etc.\nKnowledge of UI design principles including flow, layout, typography, color, and transitions\nExpertise in creating process flows, site maps, wireframes, prototypes, and functional specifications\nBe open-minded and have the ability to communicate and convey your design decisions to other team members\nWilling to constantly improve and listen to other people’s opinions\nPositive attitude and desire to learn new skills\nExcited about working in a fast-paced, dynamic startup environment\n\nPreferred Qualifications\n\nDigital portfolio to present the work and your user-centered approach\nDemonstrated understanding of fundamentals in visual and graphic disciplines, such as typography, iconography, color, composition, layout, etc.\nExperience with or practical knowledge of web technologies and web standards, such as object-oriented JavaScript, HTML5, and CSS3 is a plus\nExperience with React is a huge plus\nResearch experience and a deep understanding of the latest techniques in UI and UX, with a demonstrated passion for keeping your skill, set sharp and cutting-edge\nFamiliarity with or experience executing qualitative and quantitative user research\nFamiliarity and understanding of research methods such as SLR (Systematic Literature Review)\n\nJob Description and Responsibilities\n\nDesign and deliver wireframes and prototypes for our suite of web and mobile applications\nEffectively lead iterative user and inclusivity testing to further enhance the user experience of our platform\nCollaborate and put your ideas through in a multi-disciplinary team\nCreate a sense of empathy and understanding for our end users\n\nFlexible Position Options\n\nPart-time internship\nFull-time, contract-based, equity-eligible position\n\nPerks\n\nWork with a small team of dedicated and determined developers and researchers\nBe part of developing cutting edge UI/UX research and development\nPriority status for future full-time employment opportunities\n\nJob Types: Full-time, Part-time, Internship, Contract\n\nBenefits:\n\nFlexible Schedule\n\nContract Renewal:\n\nLikely\n\nFull Time Opportunity:\n\nYes\n\nAdditional Compensation:\n\nBonuses\nOther forms\n\nWork Location:\n\nFully Remote\n\nCompany's website:\n\nhttps://www.hazadapt.com/\n\nCompany's Facebook page:\n\nhttps://www.facebook.com/hazadapt/\n\nWork Remotely:\n\nYes",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "data visualization",
            "machine learning"
        ]
    },
    {
        "position": "Fall 2020 Co-Op/Intern Research - 79480",
        "company": "Advanced Micro Devices, Inc. - 3.8",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "qualifications": "Doctoral DegreeWork Authorization",
        "posted": "2020-07-12T01:22:37.510Z",
        "url": "https://www.simplyhired.com/job/pWgZFhEqJMBYWfPJ534IcmTkxzItEikyOoVMnXJdCf3cX3fl-7nzYw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:37.510Z",
        "description": "What you do at AMD changes everything\n\nAt AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center.\n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.\n\nAMD Research seeks a student intern to pursue research projects on novel memory and computing architectures. The candidate should be in a university program leading to a PhD or advanced degree in computer science, computer architecture, electrical engineering, systems engineering, or equivalent. The student will be responsible to propose architectural improvements, create performance and power models of the system, collect experimental and simulation data, and analyze the data. The candidate will work on a team of researchers seeking to build the fastest computers on the planet such as ORNL Frontier and LLNL El Capitan. A strong candidate will have experience with parallel programming such as using OpenCL, CUDA, or ROCm. The student must be able to document the ability to work in the US. Other restrictions may apply.\n\n#AMDRESEARCH #20f10 #ASGTV #BEL #AGK\n\nRequisition Number: 79480\nCountry: United States State: Washington City: Bellevue\nJob Function: Student/ Intern/ Temp\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers. We consider candidates regardless of age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status. Please click here for more information.",
        "skills": [
            "information technology",
            "data visualization",
            "software engineering"
        ]
    },
    {
        "position": "Fall 2020 Research Co-Op/Intern - 79592",
        "company": "Advanced Micro Devices, Inc. - 3.8",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "qualifications": "Doctoral DegreeWork Authorization",
        "posted": "2020-07-12T01:22:38.978Z",
        "url": "https://www.simplyhired.com/job/uBIYmJ7zgo6VAnalM1-iDexeovYOPARI6rxijYBCp1Kd2ZJla-ZGOA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:38.978Z",
        "description": "What you do at AMD changes everything\n\nAt AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center.\n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.\n\nAMD Research seeks a student intern to pursue research projects on novel memory and computing architectures. The candidate should be in a university program leading to a PhD or advanced degree in computer science, computer architecture, electrical engineering, systems engineering, or equivalent. The student will be responsible to propose architectural improvements, create performance and power models of the system, collect experimental and simulation data, and analyze the data. The candidate will work on a team of researchers seeking to build the fastest computers on the planet such as ORNL Frontier and LLNL El Capitan. A strong candidate will have experience with parallel programming such as using OpenCL, CUDA, or ROCm. The student must be able to document the ability to work in the US. Other restrictions may apply.\n\n#AMDRESEARCH #20f10 #ASGTV #BEL #AGK\n\nRequisition Number: 79592\nCountry: United States State: Washington City: Bellevue\nJob Function: Student/ Intern/ Temp\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers. We consider candidates regardless of age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status. Please click here for more information.",
        "skills": [
            "information technology",
            "data visualization",
            "software engineering"
        ]
    },
    {
        "position": "Intern",
        "company": "Andor Health - ",
        "location": {
            "city": "Orlando",
            "state": "FL"
        },
        "qualifications": "DebuggingAnalysis SkillsMathC/C++JavaWork Authorization",
        "posted": "2020-07-12T01:22:39.041Z",
        "url": "https://www.simplyhired.com/job/_RphaywGEVWOKCiBZhBVwHuE75-7MQxQaUoXgphxHjNK-xJAMc0TeQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:39.041Z",
        "description": "Position Summary\n\nAndor Health is seeking an intern with experience in software design, coding and debugging. The intern will gain exciting real-world software engineering experience at a thriving company. We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.\n\nResponsibilities\n\nDocument and test new software applications\nAssess new application ideas\nResearch competitor offerings\nDevelop applications (coding, programming)\nInterview beta testers\n\nRequirements\n\nComputer Science/Network Engineering, Engineering, or Mathematics major\nExcellent analytical and mathematics skills\nAbility to work in teams\nExperience programming in C, C++, or Java\n\nBenefits\n\nPractical experience with a wide variety of software engineering tasks\nCollaborating hand-in-hand with skilled teams of software engineers\nShadowing, mentoring, and training opportunities with seasoned professionals\nOpportunity to participate in networking events and company meetings\nFlexible schedule for students\nCompensation available\n\nThe preceding functions may not be comprehensive in scope regarding work performed by an employee assigned to this position classification. Management reserves the right to add, modify, change, or rescind the work assignments of this position. Management also reserves the right to make reasonable accommodations so that a qualified employee(s) can perform the essential functions of the position.\n\nAt Andor Health, our greatest strength comes from bringing together talented people with diverse perspectives to support the technological needs of physicians, hospitals, and post-acute organizations across the globe. Andor Health offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.\n\nAndor Health's policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation, or gender identity or expression or any other legally protected category. Applicants for North American based positions with Andor Health must be legally authorized to work in the United States or Canada. Verification of employment eligibility will be required as a condition of hire.\n\nEOE Minorities/Females/Individuals with Disabilities/Protected Veterans\n\nDrug Free Workplace\n\nEEO Law Poster and Supplement",
        "skills": [
            "software engineering",
            "java",
            "C and C++",
            "machine learning",
            "information technology"
        ],
        "compensation": "paid"
    },
    {
        "position": "Data Science Internship: Python",
        "company": "Hitachi Vantara - 3.3",
        "location": {
            "city": "Waltham",
            "state": "MA"
        },
        "qualifications": "PythonMachine LearningGitHubData CollectionRegression AnalysisMaster's Degree",
        "posted": "2020-07-11T01:22:39.261Z",
        "url": "https://www.simplyhired.com/job/1qFzv3joNqDpXiOLvO-ltGLmDld9y0uHo3tGDJgQeFCJMTJAM8gwIQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:39.261Z",
        "description": "The Company\n\nHitachi Vantara, a wholly-owned subsidiary of Hitachi, Ltd., guides our customers from what’s now to what’s next by solving their digital challenges. Working alongside each customer, we apply our unmatched industrial and digital capabilities to their data and applications to benefit both business and society. More than 80% of the Fortune 100 trust Hitachi Vantara to help them develop new revenue streams, unlock competitive advantages, lower costs, enhance customer experiences, and deliver social and environmental value.\n\nThe Position\n\nWe are looking for a hands-on Data Scientist for summer internship as part of the Analytics team in the IoT & Analytics CTO office of Hitachi Vantara North America. The role will be either based in Waltham, MA or remote home office.\n\nThe responsibility\n\nDevelop the Automated Machine Learning tool – AutoDEPPA2, which is to automate the generic components in each step of DEPPA process: Descriptive, Exploratory, Predictive, Prescriptive, Automation and Autonomous.\nResearch, understand and evaluate a wide range of machine learning techniques and tools from public resources (papers, blogs, Github, etc). Techniques and tools may include but not limited to: data engineering, data analysis, machine learning modeling, reinforcement learning, meta-learning, cohort learning, deep learning, etc.\nPresent the tools to internal teams and perform technical discussions\nIncorporate the selected tools into AuotDEPPA2 by following the existing code structure.\nBuild models (like meta learning models) as part of the AutoDEPPA2 work.\nCollect data for different domains from public resources (like Kaggle)\nThe core accountabilities:\n\nResearch and implementation capabilities: find, understand, implement, deploy and evaluate the techniques and tools.\nData science modeling (classification, regression, deep learning) development, coding, testing, evaluation and deployment\nThe Qualifications\nDesired Skills and Experience\n\nMaster degree from an accredited college/university in Computer Science, Statistics, Mathematics, Business Analytics, Engineering, or any related field\nProven professional data science experience, e.g., machine learning, algorithms and statistical modeling, such as classification, time-series analysis, regression\nExperience working with some business domains, such as Finance/Banking/Insurance, health care, manufactory, is a plus\nExperience in delivering end-to-end machine learning application: data collection, data engineering, data analysis, modeling, evaluation, drawing insights and make recommendations.\nExperience in project management and leading the project development\nPython coding skills minimum 2 years\nUNIX / Linux shell scripting skills minimum 1 year\nKnowledge about how to deploy cloud environments, like AWS\nHigh degree of self-drive, energy, self-confidence, commitment and flexibility\nWe are an equal opportunity employer. All applicants will be considered for employment without attention to age, race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
        "skills": [
            "machine learning",
            "python",
            "software engineering"
        ]
    },
    {
        "position": "Software Dev INTERN C++/python - Computer Vision, DL, GUI, Plugins",
        "company": "CharacterFaceGen CFG - ",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "qualifications": "C/C++PythonMayaCinema 4DAdobe After EffectsBachelor's DegreeMaster's Degree",
        "posted": "2020-07-11T01:22:39.457Z",
        "url": "https://www.simplyhired.com/job/Pz4emm3JjbrGjVkJy4TsY07ZSCrHVmMg8_Rwu6FByhdEb5ZwWI86Vg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:39.457Z",
        "description": "CharacterFaceGen CFG software is the latest state-of-art that generate a 3D facial model & animation from video footage (2D content).\n\nPlease watch our video demo before you apply\nApplication https://youtu.be/KBe1tZFlsGE\nCFG Gen2- https://youtu.be/95B6WKYLlhE\n\nJob Description (Sorry. Visa sponsorship is not available)\n\nHelp implement product code in C++ and/or python - post adjustment methods, GUI for standalone GUI, 3DMM fitting, Deep learning fitting\nHelp implement CFG plug-ins for various 3D software such as Maya, C4D, Adobe AE, etc\n\nWhat We Need To See:\n\nBA and and MS in Computer Science - Some Courses or projects on computer visions, 3DMM or GAN face related methods such as face recognition, face detection, landmark detection, image/video processing algorithm a plus\nHave strong programming foundation in C++ and python.\nInterest in computer vision and graphics. Good communications, math, and analytical skills.\n\nJob Type: Internship\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\ncoding: 2 years (Required)\nSoftware Development: 1 year (Preferred)\nMachine Learning: 1 year (Preferred)\nComputer Vision: 1 year (Preferred)\nC++: 1 year (Preferred)\nPython: 1 year (Preferred)\n\nInternship Compensation:\n\nPay\nCollege Credit\n\nCompany's website:\n\nhttps://characterfacegen.com/\n\nCompany's Facebook page:\n\nhttps://www.facebook.com/characterfacegen",
        "skills": [
            "machine learning",
            "python",
            "C and C++",
            "software engineering"
        ]
    },
    {
        "position": "2020 Research Co-Op/Intern - 79448",
        "company": "Advanced Micro Devices, Inc. - 3.8",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "qualifications": "",
        "posted": "2020-07-11T01:22:39.677Z",
        "url": "https://www.simplyhired.com/job/y3dJPYqsR7j_83kumniQGpJPlJ8oZQQkeF4Po289hkmVE7Zc903U9A?q=computer+science",
        "lastScraped": "2020-07-15T01:22:39.677Z",
        "description": "What you do at AMD changes everything\n\nAt AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center.\n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.\n\nResearch Intern\n\nAMD Research is an entrepreneurial research organization with a strong track record of driving research innovations into AMD products. We are a global leader in the development of the world’s most advanced high-performance computers (HPC), such as Frontier, the world-leading 1.5 exaflop supercomputer. As part of AMD Research, you will have a role on a winning team that works closely with government and commercial customers along with internal product teams and partners to develop the hardware and software technologies of next generation computing platforms, accelerating AMD to have the world’s highest-performing products.\n\nTHE ROLE:\nAMD Research seeks a Computer Science or Engineering graduate student to work on high-performance computer software and hardware. You will be responsible for developing innovations that feed into scaled-out systems incorporating a variety of current and emerging accelerators and tightly coupled CPUs. The work has the potential to directly impact the current production software stack as well as influence the direction of future hardware and software.\n\nAMD Research nurtures and encourages all co-ops to file quality patents and publish at top-tier research venues out of their internship projects. Previous co-op engineers at AMD Research have gone on to publish the results of their work in major academic and industrial conferences, file patent disclosures for innovative ideas as well contribute to production code and hardware designs.\n\n#AMDRESEARCH\n\n#AS-SPC\n\nRequisition Number: 79448\nCountry: United States State: Texas City: Austin\nJob Function: Student/ Intern/ Temp\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers. We consider candidates regardless of age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status. Please click here for more information.",
        "skills": [
            "information technology",
            "software engineering",
            "data visualization"
        ]
    },
    {
        "position": "UX Design Intern",
        "company": "American Specialty Health Incorporated - 3.4",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "qualifications": "Design ThinkingLeanDigital ArtResearch ExperienceAnalysis SkillsBachelor's DegreeHigh School Diploma or GED",
        "posted": "2020-07-11T01:22:39.869Z",
        "url": "https://www.simplyhired.com/job/HdpVL3h11jQ9wK0r3-F9VCzkCUqdVYhJ7NoTtQE7y0sbuFInlwpgew?q=computer+science",
        "lastScraped": "2020-07-15T01:22:39.869Z",
        "description": "American Specialty Health Incorporated is seeking an UX Design Intern to join our Consumer Technology-UXD(CRU) department. This position will gain hands-on experience with Design Thinking and Lean UX process and principles to create high quality digital experiences.\n\nResponsibilities\n\nWork as a part of a team of UX Designers and UX Architects\nSupport customer research to validate designs and discover new insights.\nAssist in planning and executing user testing/usability (remote and in person).\nCollaborate with developers in a SCRUM environment on a day-to-day basis.\nAssist in authoring and editing video content.\n\nQualifications\n\nMust be pursuing a Bachelor’s degree in Design (e.g. interaction, graphic, visual communications, product, industrial), Human Computer Interaction, Computer Science or a related field. Equivalent practical experience will be considered. High school diploma required.\nMinimum 6 months’ experience required.\nExperience with design or research in an academic, hobbyist or commercial environment.\nExperience with sketching or creating digital art/illustrations.\nExperience conducting or facilitating research (e.g. market, competitive, usability, enthographic, contextual inquiry).\nExperience working in a fast-paced, deadline-driven environment.\nStrong analytical and problem-solving skills.\nAbility to develop user empathy and advocate for the user, understanding the user’s behavior, attitudes, and emotions.\nSupport and collaborate with development teams during development of products on a day-to-day basis.\nPossess a strong passion for UX and/or Design Thinking practices.\n\nCore Competencies\n\nDemonstrated ability to interact in a positive, respectful manner and establish and maintain cooperative working relationships.\nAbility to display excellent customer service to meet the needs and expectations of both internal and external customers.\nExcellent listening and interpersonal communication skills to identify critical core competencies based on success factors and organizational environment.\nAbility to effectively organize, prioritize, multi-task and manage time.\nDemonstrated accuracy and productivity in a changing environment with constant interruptions.\nDemonstrated ability to analyze information, problems, issues, situations and procedures to develop effective solutions.\nAbility to exercise strict confidentiality in all matters.\n\nMobility\n\nPrimarily sedentary, able to sit for long periods of time with ability to travel within and outside the facility.\n\nPhysical Requirements\n\nAbility to speak, see and hear other personnel and/or objects. Ability to communicate both in verbal and written form. Ability to travel within the facility. Capable of using a telephone and computer keyboard. Ability to lift up to 10 lbs.\n\nEnvironmental Conditions\n\nWithin facility, normal office conditions, including lighting and ventilation. Minor noise from conversations and general office equipment (telephone, printer, etc.). When required to travel outside the facility, usual weather, traffic and related conditions are applicable.\n\nAmerican Specialty Health is an Equal Opportunity/Affirmative Action Employer.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nPlease view Equal Employment Opportunity Posters provided by OFCCP here.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact our Human Resources Department at (800) 848-3555 x6702.\n\nASH will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company’s legal duty to furnish information.",
        "skills": [
            "information technology",
            "data visualization",
            "C and C++"
        ]
    },
    {
        "position": "Video Production Intern",
        "company": "SV Summit Inc - ",
        "location": {
            "city": "Santa Clara",
            "state": "CA"
        },
        "qualifications": "Video ProductionVideo EditingAdobe PremiereAdobe After EffectsBachelor's DegreeMaster's Degree",
        "posted": "2020-07-11T01:22:40.071Z",
        "url": "https://www.simplyhired.com/job/wxtm40a6_CLbcpsN4dU2QAg1EC4vK4LULOd7v0Apked9SJCqLL5sgQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:40.071Z",
        "description": "FLAGDream is an education technology corporation founded by an elite team from top tech companies in Silicon Valley. Our mission is to help students join the world's leading companies, relying on our strong resources, networks, and mentor teams throughout Silicon Valley and Wall Street. FLAGDream provides students with career development, consulting, and vocational skill training services. We cover industry trends such in computer science, AI, finance, management consulting, business analysis, FMCG/CPG, culture/creative industries, and more. As a result, we send thousands of trainees to Silicon Valley and top companies in various industries around the world every year.\n\nJob Summary:\n\nWe are looking for a Video Production Intern to assist in developing FLAGDream’s video documentary and create some interesting clips to attract potential students. The role works to provide important video files and show the company’s culture.\n\nWhat You’ll Do:\n\nWrite the video plan and script before making a video\nServe as a primary videographer, photographer, producer, and editor, for all events, programs, resources, and marketing materials\nProduce high-quality, creative videos and photos with top-notch audio, lighting, and editing\nOperate computer editing systems and equipment used for video media and audio\nEstablish a clear understanding of the storyline and purpose of the video's creation\nImprove video and sound quality using various video/audio software\nEdit video to include pre-selected music, interviews, sound clips, special effects and other important aspects of the project\nEnsure the correct formatting and presentation for finalized videos according to specifications\nUnderstand the various media platforms and special requirements for each. YouTube, Facebook, Instagram, Linkedin, Tik Tok.\n\nWhat You’ll Have:\n\nA strong ability to source and use stock footage\nDetail-oriented -- quality and precision-focused\nInnovative -- innovative and risk-taking\nOutcome-oriented -- results-focused with a strong performance culture\nTeam-oriented -- cooperative and collaborative\nThrive when working in a startup environment\n\nWhat You’ll need:\n\nBachelor’s or Masters in film editing or related degree\n0-2 years of experience and have some good video works\nProficient in Adobe Premiere & After Effects or any other film making tools\nFluent in both Chinese and English\n\nWhat You‘ll obtain:\n\nSupport H1B\nBuild a high-level network\nExclusive FLAGDream events\nPractical knowledge learning\n\nJob Types: Full-time, Internship\n\nSchedule:\n\nMonday to Friday\n\nEducation:\n\nBachelor's (Required)\n\nLanguage:\n\nMandarin (Required)\n\nInternship Compensation:\n\nCollege Credit\n\nWork Remotely:\n\nTemporarily due to COVID-19",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering",
            "artificial intelligence"
        ]
    },
    {
        "position": "Software Engineering Intern",
        "company": "Alignment Healthcare - 2.8",
        "location": {
            "city": "Orange",
            "state": "CA"
        },
        "qualifications": "JavaScriptReactNode.jsC#JavaBachelor's Degree",
        "posted": "2020-07-10T01:22:40.297Z",
        "url": "https://www.simplyhired.com/job/RzjV65S08qXtO3FL2Pc8SV73zeeV3kgdRd8IAAAN1nK_tYjOHiOTRg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:40.297Z",
        "description": "Job Number: 2130\n\nPosition Title: Front-End Engineer Intern\n\nExternal Description:\nAlignment Healthcare is a data and technology driven healthcare product company focused partnering with health systems, health plans, and provider groups to provide care delivery that is preventive, convenient, coordinated, and that results in improved clinical outcomes for seniors.\n\nWe are experiencing rapid growth (backed by top private equity firms) and our engineering team is looking for the best and brightest leaders. Data and technology inform the way we make decisions. We love our customers and understanding them better makes it possible to provide the best clinical outcome and care experience.\n\nWe seek front-end engineering interns, who have a passion for learning and experimentation. The products and services that we develop will enable next generation care delivery models for seniors. We are looking for talented engineers to execute amazing web & mobile app experiences for our users. The ideal candidate will enjoy working alongside a diverse team that includes other engineers, data scientists, designers, users, and clinicians.\n\nSkills & Requirements\n\nYou’re passionate about writing code, building amazing products and delivering the highest caliber of code.\nYou like working with teammates to innovate and build products you will be proud of.\nYou love learning new skills and working on a variety of projects.\nYou have hands-on experience with Javascript and any related frameworks (React, Vue, Node, etc).\nYou have hands-on development experience using C#, Java, Python or Go.\n\nResponsibilities:\nCollaborate with product management, engineering, and clinical leads to define and implement innovative solutions for the product direction, visuals and experience.\nTranslate concepts into wireframes and mockups that lead to intuitive user experiences.\nOwn feature quality throughout the development, testing and deployment phases to ensure quality delivery expectations are met.\nConduct new technology research, proof of concept, and design work that will provide direction for the enhancement of the overall system and products.\nContribute to software engineering best practices for design, coding standards, performance, security, delivery, and maintainability.\n\nMinimum Qualifications:\nStrong analytical and problem-solving skills.\nAlready possess or are working toward a Bachelor’s Degree in Computer Science or related field\n1+ years of work or academic experience with the Web Services lifecycle (design, build, test, deploy).\nExperience (academic or work) in designing and developing software, including object-oriented design or object-oriented programming, in course-assigned and/or hobby projects.\nUnderstands the fundamentals of data structures, algorithm design and analysis.\nExposure to software development best practices through academic study, architectural reviews, CI/CD build automation & deployment, automated test frameworks and continuous performance monitoring\nProficiency in Javascript, HTML and CSS\nKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\nExperience (work or academic) designing, creating, testing, and consuming REST APIs.\nExperience building Web forms from JSON Schema that can be rendered after retrieval from a database.\nExcellent oral and written communication skills.\nHunger to learn, particularly an intense usability curiosity.\nAble to dive into the source code of front-end libraries to debug, patch, and extend them when necessary.\nCritical thinker and solutions-oriented.\n\nPreferred Qualifications:\nExperience in React JS\nMobile development experience\nProficient in a broad range of software design approaches and common UX patterns.\nExperience in view layout and rendering technologies\nExperience in lazy loading assets, CDNs, caching and compression.\nUnderstands how to be efficient with resource usage (e.g., application impact on memory and CPU, caches appropriately, respectful of customer’s devices, etc.).\nExperience with scrum methodology.\n\nCity: Orange\n\nState: California\n\nLocation City: Orange\n\nLocation State: California\n\nCommunity / Marketing Title: Software Engineering Intern\n\nCompany Profile:\nWho is Alignment Healthcare?\n\nSocially responsible\nTechnologically enabled\nConcierge care\nTransformation\nServant leadership\n\nWe are dedicated to transforming the complex and confusing process of medical treatment in the United States so that every link in the health care continuum becomes more efficient, productive, and effective. We built a team of people who want to make a difference. Come join the team that is changing health care one person at a time.\n\nWe believe that great work comes from people who are inspired to be their best. We invite you to explore our wide variety of roles based on your unique experience.\n\nEEO Employer Verbiage: Alignment Healthcare, LLC is proud to practice Equal Employment Opportunity and Affirmative Action. We are looking for diversity in qualified candidates for employment: Minority/Female/Disable/Protected Veteran. If you require any reasonable accommodation under the Americans with Disabilities Act (ADA) in completing the online application, interviewing, completing any pre-employment testing or otherwise participating in the employee selection process, please contact careers@ahcusa.com. (function() { var ac = document.createElement('script'); ac.type = 'text/javascript'; ac.src = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'click.appcast.io/pixels/grpeople1-1573.js?ent=8&t=' + new Date().getTime(); var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ac, s); })();",
        "skills": [
            "information technology",
            "software engineering",
            "javascript",
            "java",
            "data visualization",
            "python"
        ],
        "contact": "careers@ahcusa.com"
    },
    {
        "position": "Firmware Test Engineer Intern",
        "company": "TSI Incorporated - 4.4",
        "location": {
            "city": "Buffalo",
            "state": "NY"
        },
        "qualifications": "Product DevelopmentC#WindowsC/C++Computer Skills",
        "posted": "2020-07-10T01:22:40.506Z",
        "url": "https://www.simplyhired.com/job/A7_qfeBcwGAq6bfnwhNGRPzL3WIq1sCwoVg2rr-4OVo1PavmOSFmrg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:40.506Z",
        "description": "At TSI, you’ll be part of a real project, getting real experience!\n\nWork side by side with engineering professionals to learn to contribute on a project team.\nDevelop an understanding of the new product development environment and how you will apply the skills you’ve acquired through your education.\nWork with leading edge technology to develop sophisticated electronic measurement instruments and applications.\nWork with state of the art development tools.\nExperience new product development from beginning to end not just a niche.\n\nAt TSI, here’s just some of the experience you can gain:\nYou will support the hardware and firmware development on the DICKEY-john GAC 2700 product.\nYou will update the UI & UX in C# on Windows OS platform.\nYou will test & debug our embedded firmware utilizing C++/C#.\nPerform hardware testing on the DJ-GAC 2700 to ensure that touch screen works appropriately.\nYou will work beside and be mentored by our Electrical and Mechanical Engineers.\n\nHere are some of the things our interns have said about their experience at TSI:\n\nI gained real , hands-on experience!\nI tell my friends what I’m doing for my internship, and they are jealous of the experience I’m getting!!!\nThe people here are GREAT!\nEveryone is really helpful and very nice. Easy to work with!\nI want to work here when I graduate!\n\nQualifications and Skills:\nMajor/Program: Computer Science or Software Engineering\nComputer skills including proficiency with MS Word and Excel and exposure to JavaScript\nData analysis / mathematical proficiency\nMaintain a minimum CUM 3.0 GPA (based on a 4.0 scale)\nStudent Status: Currently enrolled as a full-time student at an accredited college or university\nComfortable in a lab environment\nStrong desire to learn, self-motivated\nNaturally high attention to detail, good organization skills.",
        "skills": [
            "software engineering",
            "javascript",
            "C and C++",
            "machine learning",
            "information technology"
        ]
    },
    {
        "position": "Fall 2020 Supply Chain Data Analyst Intern",
        "company": "ON Semiconductor - 3.8",
        "location": {
            "city": "Phoenix",
            "state": "AZ"
        },
        "qualifications": "Data Analysis SkillsVisioMicrosoft OfficeMathAnalysis Skills",
        "posted": "2020-07-10T01:22:40.720Z",
        "url": "https://www.simplyhired.com/job/NU4U0UPIctGgxbi5y0AKLGDk8fI6jQceOqSijK-lBBgzhx5B-2o2aQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:40.720Z",
        "description": "Job Summary:\nHere at ON Semiconductor we take great pride in our internship program and the efforts we take to provide students with hands-on industry experience. We provide competitive pay, medical benefits, various networking event opportunities, and flexible hours based on school schedule.\n\nPerformance Objectives:\nThis opportunity will ask a student to perform the following job duties:\nUtilize data analysis and statistical skills on various supply chain projects and activities.\nWork with Global teams to research best practices and document visually in a diagram/process flows using Visio and other Microsoft Suite tools.\nDocument and analyze metrics and KPIs for supply chain and service activities.\nPerform data analysis activities for special projects\nAutomate and streamline data gathering and reporting methodologies\n\nQualifications\n\nIn order to be considered for an internship, you must be a student currently enrolled in school pursuing an accredited degree program. This position is preferably looking for a student enrolled in Supply Chain, Mathematics-Statistical or Computer Science in their junior year.\nLocal candidates only\nStrong reporting skills\nAdvanced statistical and mathematics skills\nExperience using Microsoft Suite tools\nEnrolled as a Junior\nExcellent analytical skills\n\nON Semiconductor (Nasdaq: ON) is driving energy efficient innovations, empowering customers to reduce global energy use. The company is a leading supplier of semiconductor-based solutions, offering a comprehensive portfolio of energy efficient power and signal management, logic, standard and custom devices. The company’s products help engineers solve their unique design challenges in automotive, communications, computing, consumer, industrial, medical and military/aerospace applications. ON Semiconductor operates a responsive, reliable, world-class supply chain and quality program, and a network of manufacturing facilities, sales offices and design centers in key markets throughout North America, Europe and the Asia Pacific regions.\n\nPrimary Location: US-AZ-Phoenix\nWork Locations: USAZ01 ON HDQTRS US8 5005 E McDowell Rd Phoenix 85008-4229\nJob: Intern\nJob Posting: Jul 9, 2020, 1:30:13 PM",
        "skills": [
            "data visualization",
            "software engineering"
        ]
    },
    {
        "position": "Digital Business - Data Science Intern",
        "company": "Evoqua Water Technologies - 3.1",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "qualifications": "Data MiningPresentation SkillsAIMachine LearningAnalysis SkillsMaster's DegreeBachelor's DegreeDoctoral Degree",
        "posted": "2020-07-10T01:22:40.919Z",
        "url": "https://www.simplyhired.com/job/ScSWqg7AtX_ySAUgkWK8M1CtcaH07RDau2BJ-8rpIk7uEzLFOWtrNw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:40.919Z",
        "description": "Evoqua has the strength of a major global business while embracing the entrepreneurial spirit of a startup. Our innovative products have been solving the world’s water problems for more than 100 years. Today, we are building on that strong history of success – transforming water for our customers enriching the lives of consumers.\n\nEvoqua’s unparalleled portfolio of proven brands, advanced technologies, mobile and emergency water supply solutions and services helps cities across the world provide and discharge clean water, and equips the leisure and commercial industries to maximize productivity and profitability. Every day, millions of people and thousands of companies rely on Evoqua Water Technologies to help meet their needs for clean water.\n\nWhat does it mean to work here. . .\n\nOur Mindset: We put customers first. We know we succeed only when our customers succeed. To that end, we make decisions at lowest possible levels, at fastest possible speeds – freeing employees to respond to customers quickly and effectively without sacrificing safety or quality.\n\nOur organization: We work as “One Evoqua”. We collaborate across our global enterprise. In an increasingly competitive marketplace, no single product, group or unit succeeds on their own, no matter how remarkable they are. We are one team.\n\nOur People: We hire for brains and heart. We are industry experts who foster great relationships with colleagues and customers. We value technical knowledge and experience, alongside business insight and people smarts. We nurture both the hard and soft skills of our talent.\n\nOur Leadership: We lead from where we are. We take ownership. We lead from all levels. We value the opportunity to grow, as a business and as people. We hold each other accountable to make the right things happen for maximum performance.\n\nOur promise: Grow with the Best. We grow with the best. We are on the move. As the world’s first choice for water solutions, our workplace will continue to evolve and expand, and so will the opportunities. This is a workplace that nourishes talented people. Immerse yourself . . . in Evoqua.\n\nApply today to join our 4000 professionals around the world as we pursue our purpose: Transforming Water. Enriching Life.\n\nThe Digital Business Data Science Intern position supports the development of data analytics, customer reports, and key performance indicators by utilizing data emanating from Evoqua’s IoT (Internet of Things) digital platform. This position directly supports operations from the Digital Command Center. The objective of this position is to help drive the DCC team’s efforts to collect, organize, and synthesize data in order to drive action and provide customer value.\n\nData mining disparate sources to develop analytical models of our systems and visually correlate action & events is a core competency of this job. Applicants will have strong modeling skills, experience with data science fundamentals, and should be comfortable owning and presenting their work. They should be resourceful, and self-sufficient at managing their projects from conceptual design to execution. Applicants can expect to work closely with business partners and key stakeholders to document their needs and deliver results. Direct experience with AI/Machine Learning is highly desired.\n\nThe data science team will be tasked with uncovering business opportunities and presenting the findings to leadership for action by utilizing data analysis, artificial intelligence, machine learning, and cognitive computing.\n\nCORE RESPONSIBILITIES AND TASKS\n\nPerform deep dive analysis into Evoqua’s vast data to uncover business opportunities.\nData mining\nUse analytical skills to create and test business hypothesis.\nComplex query writing to solve tactical problems\n\nWork with business partners to develop requirements, prototype possible technology solutions, and work cross-departmentally, when required, to build a solution.\nDevelop simplified process and tools that can be used across multiple functional areas within any business segment\nCollect feedback to help product management identify and drive innovation for potential new features within our IoT platform and sensor designs\n\nEvaluate and define digital product and business metrics.\nCreate visual decision tools (dashboards, reports) to spread awareness and adoption of key performance indicators (KPIs) across our organization.\nDevelop machine learning experiments\nAdvise and assist the adoption of Artificial Intelligence algorithms.\n\nCombine disparate datasets to develop cross-functional solutions\n\nPartner with team members to help tell the story behind the data and prioritize areas of opportunity to drive growth.\nConcise and succinct communication\n\nPOSITION REQUIREMENTS\n\nFORMAL EDUCATION:\nCurrently pursuing a Technical MS (Master of Information Systems, Data Analytics, Computer Science) or BS in Computer Science, Mathematics, Statistics, Economics, or another quantitative field\n\nPreferred:\nCurrently pursuing a PhD or MS Degree in Computer Science, Mathematics, Statistics, Economics, or another quantitative field.\n\nKNOWLEDGE & EXPERIENCE:\nRequired:\nAbility to think and execute at multiple levels from strategy and vision to execution\nInterpersonal skills with demonstrated ability to influence outcomes and communicate technical content to general audiences (telling a “story” with data)\nAbility to write and mentor code development in Python, R, and/or SQL\nAbility to think outside the box to uncover business value\nAdvanced data modeling and statistical testing\nAbility to apply data visualization techniques using tools such as MS Excel, SPS Excel, Tableau, MS Power BI, Databricks etc.\nData mining experience\n\nPreferred:\nData Analyst / Data Scientist experience – real-world application of data science to solve business problems, beyond academic or basic familiarity.\nExperience with dashboard design and data viz tools (i.e. Power BI) is a plus\nExperience with IoT (sensors/connected technologies) is a plus\nExperience with building data pipelines is a plus\nExperience with building machine learning models is a plus\nExperience with AI and Algorithms\n\n#LI-HVI\n\n#Glassdoor\n\nEvoqua Water Technologies prohibits discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation or any other category protected by applicable federal, state or local law. Evoqua Water Technologies takes affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, protected veteran status or disability.\n\nEEO is The Law\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled/Sexual Orientation/Gender Identity\n\nEvoqua does not accept unsolicited resumes/candidates from search firms.",
        "skills": [
            "machine learning",
            "information technology",
            "python",
            "data visualization"
        ]
    },
    {
        "position": "Customer Support Data Analyst",
        "company": "Transaction Network Services - 3.3",
        "location": {
            "city": "Olympia",
            "state": "WA"
        },
        "qualifications": "Writing SkillsAnalysis SkillsSoftware TestingCommunication SkillsMicrosoft Office",
        "posted": "2020-07-10T01:22:42.343Z",
        "url": "https://www.simplyhired.com/job/96gdouv0ErOPAm2r3H3_htrDbB-uxZ8Qs_rTnmyKioLsPGlwdKpIGQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:42.343Z",
        "description": "TNS has an exciting opportunity for a temporary data analyst working on our Call Guardian products! In this role you will:\n\nPractice of using Internet information and other media to conduct research and document trends in robocalling and call authentication.\nPractice of using Internet information, especially free information on websites, in researching consumer complaints (or lack thereof) of unwanted and illegal robocalls.\nUse writing skills to update technical and process documentation to be shared internally and with customers.\nUse writing skills to develop stories regarding robocalling practices and how to combat bad robocalls.\nUse analytical skills to assist QA teams in performing software testing functions.\nUse analytical skills to review data entries, and review performance indicators to review robocalling data.\nDesign experiments leading to better understanding and ways to improve customer experience by focusing on wanted and unwanted robocalls.\nConduct handset testing to compare various robocalling solutions available in the market.\nEvaluate new data sources to determine how they might be utilized by TNS in combating robocalls.\nHelp trouble-shoot data issues and work closely with clients, data scientists, operations, customer care and engineering.\nMaintain “Buddy Book” instruction manual documenting job responsibilities and functions so that other team members could complete such tasks in an absence.\nQualifications\n\nQualifications:\n\nCandidate must be a self-starter, have the ability to multi-task, with limited supervision, and have solid verbal and written communication skills.\nStrong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy.\nStrong Writing skills with the ability to write stories, blogs, and update technical documentation.\nAn understanding of Microsoft Office (Outlook, Excel, Word and PowerPoint) and basic knowledge of databases (SQL, etc.) as well as adept at queries, report writing and presenting findings (Excel and PowerPoint).\nMajor studies in Mathematics, Economics, Computer Science, Information Management or Statistics.\nWe have been delivering industry-leading solutions for the payments, financial and telecommunications industries since 1990. We are the preferred supplier of networking, integrated data and voice services to many leading organizations in the global payments and financial communities, as well as a provider of extensive telecommunications network solutions to service providers.\n\nWe are a privately held company with a healthy balance sheet, secure assets and a loyal customer base that includes some of the largest global blue-chip companies in the world. Many of the world’s leading companies continue to count on us as their primary provider of a range of networking and communication services, enabling them to expand regionally, nationally and globally. We provide services to customers in over 60 countries throughout the world.\n\nWe manage some of the largest real-time community networks in the world, enabling industry participants to simply and securely interact and transact with other businesses, to access the data and applications they need, over managed and secure communications platforms. Our existing footprint supports millions of connections and provide access to critical databases. Our network securely blends private and public networking to enable customers to utilize a single connection for \"one-to-many\" and \"many-to-many\"connections over a global platform.\n\nSince our launch we have helped our customers and communities of interest, requiring secure and reliable communications solutions, to evolve from legacy to leading-edge technologies. Today the company provides a full range of services from dedicated connections to managed IP network solutions, providing local support and global reach to medium and large enterprises and service providers.\n\nApplication Instructions\n\nApplicants are encouraged to submit an electronic resume when applying for our positions. Job postings are open until filled, unless otherwise specified.",
        "skills": [
            "information technology",
            "software engineering"
        ]
    },
    {
        "position": "Information Security, Intern",
        "company": "Chainalysis - ",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "qualifications": "",
        "posted": "2020-07-10T01:22:42.388Z",
        "url": "https://www.simplyhired.com/job/YJZWBAVG2_SjBJ3wCNVen4kK3GHHoz0E1jAiXxs63gmRZKkN1Cjqqw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:42.388Z",
        "description": "Our security team defends the products, data and systems that power Chainalysis. We are committed to assembling a diverse team of builders, breakers and shapers to address complex security problems in a novel, exciting space.\n\nWe expect interns to participate in as many real-life InfoSec responsibilities as possible and absorb the information and context around you, volunteer to try new tasks, and receive feedback humbly and eagerly.\n\nAt the end of your internship you'll know you were successful if you achieved the following…\n\nAssisted with the exploration and evaluation of various cloud, endpoint and infrastructure security tools to help us make an informed decision.\nConducted system access reviews in accordance with our access management policies\nConducted 3rd Party (vendor) security risk assessments to help Chainalaysis engage confidently with third parties and business partners\nConducted data analysis, aggregation and reporting to help inform our strategic planning process\nCreated and presented proof of concepts of open source security tooling\nImproved existing processes through automation, process improvements, or creating scripts/tooling\n\nA background like this helps:\nOutstanding communication (both verbal and written) and organizational skills\nStrong attention to detail\nCoursework in Computer Science, Information Systems, Cybersecurity, Mathematics or related technical field\n\nAt Chainalysis, we help government agencies, cryptocurrency businesses, and financial institutions track and investigate illicit activity on the blockchain, allowing them to engage confidently with cryptocurrency. We take care of our people with great benefits, professional development opportunities, and fun.\n\nYou belong here.\n\nAt Chainalysis, we believe that diversity of experience and thought makes us stronger. We encourage applicants across any race, ethnicity, gender/gender expression, age, religion, ability and experience. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. We can't wait to meet you.",
        "skills": [
            "information technology",
            "cloud computing",
            "cybersecurity"
        ]
    },
    {
        "position": "Cyber Threat Intelligence Intern",
        "company": "Center for Internet Security, Inc. - 4.7",
        "location": {
            "city": "Albany",
            "state": "NY"
        },
        "qualifications": "Computer ScienceCommunication SkillsIntelligence ExperienceIntelligence AnalysisWork Authorization",
        "posted": "2020-07-10T01:22:42.588Z",
        "url": "https://www.simplyhired.com/job/ut57LwP355_VwT3sB6O5meKNfAP0C48SEVc8GY-psrr3eam7A_AUiA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:42.588Z",
        "description": "Overview:\nThe primary purpose of this position is to gain experience while providing support to essential Cyber Threat Intelligence Team functions. This position will be located in the Center for Internet Security’s (CIS) 24x7 Security Operations Center (SOC) in East Greenbush, NY, where the Multi-State Information Sharing and Analysis Center (MS-ISAC) monitors for, analyzes, and responds to cyber incidents affecting state, local, tribal, and territorial (SLTT) governments.\n\nWhat You'll Do:\nPerform basic analysis of data derived from various sources\nUtilize the Security Operations Threat Intelligence Platform\nIntegrate and share information with other analysts and teams\nAssist in applying U.S. Intelligence Community analytical standards\nAssist with drafting cyber threat intelligence products on cyber security topics\nOther tasks and responsibilities as assigned\n\nWhat You'll Need:\n2 years of study in Cybersecurity, Cyber Intelligence, Computer Science or related field\nKnowledge of common Internet protocols, applications, and cyber threats\nKnowledge of basic analysis and intelligence analysis techniques\nStrong oral and written communication skills\nExcellent interpersonal skills and professional demeanor\nMust be authorized to work in the United States\nThe position is open to U.S. citizens and requires a favorably adjudicated DHS Fitness Review for Public Trust Positions**\n\nIt's a Plus if You Have:\nCurrent or former graduate student\nWork experience with common Internet protocols, applications, and cyber threats\nWork experience with intelligence analysis techniques\n\n**Factors that may cause a negative Fitness Review decision include:\n\nCriminal Conduct\nDishonest Conduct\nEmployment Misconduct\nAlcohol Abuse\nDrug Use (illegal drug use or use of a legal drug in a manner that deviates from approved medical direction)\nFalse Statements\nHave not resided in the US for three (3) of the past five (5) years",
        "skills": [
            "information technology",
            "cybersecurity"
        ]
    },
    {
        "position": "Information Security Services Intern",
        "company": "CyberArk - 3.1",
        "location": {
            "city": "Newton",
            "state": "MA"
        },
        "qualifications": "DevOpsCommunication SkillsTime ManagementSalesforceCompTIA Security+",
        "posted": "2020-07-10T01:22:42.785Z",
        "url": "https://www.simplyhired.com/job/hLUtjRWfKjot35WgRmSDODs4-I65e2qZ6VOn2wHb7nWdzCX1oH_9wA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:42.785Z",
        "description": "Date: Jul 9, 2020\n\nLocation:\nNewton, United States, Massachusetts, Newton\n\nJob Category: Operations\n\nAbout CyberArk:\nCyberArk is the global leader in privileged access security. A critical layer of IT security to protect data, infrastructure and assets across the enterprise, in the cloud, and throughout the DevOps pipeline. CyberArk delivers the industry’s most complete solution to reduce risk created by privileged credentials and secrets. The company is trusted by the world’s leading organizations, including more than 50 percent of the Fortune 500, to protect their most critical and high-value assets.\n\nJob Description:\nCyberArk Enterprise Support Engineers provide front-line technical support for the company’s worldwide enterprise customers and partners. As in intern, you will assist the Team in supporting select components of the CyberArk product line of IT Security and Privileged Identity Management solutions and resolving the customer’s technical problems by interacting with them via web, phone, and email.\n\nResponsibilities:\nRespond to customer inquiries and technical problems through web portal, live sessions, and telephone.\nAddress customer business needs and technical issues through diligent research, reproduction, and troubleshooting while applying acquired knowledge.\nDocument all technical inquiries. Develop and review content for knowledge sharing for both internal purposes and customer facing platforms.\nWork directly with other global support colleagues, security services, sales, operations, and administration to ensure the long-term success of our customers and the company.\n\nSpecial Opportunities:\nInterns will have the opportunity to participate in services engagements, technical support sessions, and training whenever possible. Each intern will be assigned a mentor from CyberArk’s Enterprise Support Team to provide feedback and context for the activities performed as part of the internship duties.\n\nQualifications:\nUniversity/College student with 1 semester remaining until Graduation.\nMust be able to work 32+ hours per week\nMajor studies focused in Computer Science, Information System Security, etc.\nCapable of understanding the technical aspects of a complex system.\nStrong technical troubleshooting skills and problem solving. Demonstrates the ability to think through situations outside the norm and develop appropriate solutions for isolating the root cause.\nMust have excellent communication skills and a passion for providing world-class service.\nExperience of directly supporting enterprise-level customers is a plus.\nAbility and desire to learn products and technologies.\nMust be able to work independently as well as with others, as part of a domestic and international team.\nExcellent time management, decision making, prioritization and organization skills.\nKnowledge of Salesforce is a plus.\nSecurity+ certification is a plus.",
        "skills": [
            "information technology",
            "DevOps",
            "machine learning",
            "software engineering"
        ]
    },
    {
        "position": "Intern, Medical Affairs",
        "company": "Axogen - 3.3",
        "location": {
            "city": "Alachua",
            "state": "FL"
        },
        "qualifications": "Analysis SkillsMicrosoft OfficeSharePointPass Drug Screening",
        "posted": "2020-07-10T01:22:43.035Z",
        "url": "https://www.simplyhired.com/job/AEP06_Oy-pKZ37iUATzzBWhVLo_-STuGdrfuFca7BAqLGA4aHhwB9g?q=computer+science",
        "lastScraped": "2020-07-15T01:22:43.035Z",
        "description": "If you want to see how you can impact lives at Axogen, take a look at these inspiring patient stories:\n\nhttps://www.axogeninc.com/patient-stories/\n\nAxogen offers a robust internship program that provides you with the ability to make a true impact. As an intern you will be able to take ownership of projects as well as get a feel for the day to day work in your role. In addition to the project work, Axogen will provide you with learning, networking, and social opportunities throughout the internship with intern specific trainings, lunch & learns with leadership, and fun events.\n\nWe are an equal opportunity employer and does not discriminate against applicants on the basis of race, color, creed, religion, ancestry, age, sex, marital status, national origin, disability or veteran status\n\nAxogen is hiring for a Medical Affairs Intern in Alachua, FL!\n\nSummary of the Medical Affairs Intern\n\nWe are seeking a highly motivated intern to join our Medical Affairs team at Axogen. Knowledgeable mentors will provide guidance for a dynamic, professional, hands-on experience. The intern will get a unique look into the benefits of working within a smaller biomedical company; high visibility within the company and exposure to a broad range of Medical Affairs activities. The Medical Affairs intern will help support online surgeon resources including calendars and publication libraries.\n\nRequirements of the Medical Affairs Intern\n\nCurrently enrolled in an undergraduate or graduate program; preferably in Computer science, Biomedical Engineering or other-related degree\nAbility to work 12-15 (up to 29) hours a week; specific days/hours will be based on student’s class load\nAbility to pass a drug screening\nStrong analytical skills\nAdvanced MS Office Suite skills\nExperience with Teams, SharePoint, and Flow preferred\n\nProject Details\n\nAssist with Flow design\nDevelop automation routines in SharePoint and Teams\nDraft and deliver training materials\n\nLocation\n\n13631 Progress Blvd #400, Alachua, FL 32615\n\n#LI-AC1",
        "skills": [
            "machine learning",
            "software engineering"
        ]
    },
    {
        "position": "Product and Design Intern",
        "company": "Smule Summer Internship Program - ",
        "location": {
            "city": "California",
            "state": "California"
        },
        "qualifications": "Customer SegmentationUser ResearchCommunication SkillsAIBusiness Requirements",
        "posted": "2020-07-09T01:22:43.221Z",
        "url": "https://www.simplyhired.com/job/KysQdFVLCJvTAhdPxUfQ6ZUkH6Zra8gdXcSqCZz2DFJlAsvy5VUrrQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:43.221Z",
        "description": "List of Available Projects\nDesign\nUI and UX design - wireframing new designs and updating existing visual designs\nProductionizing designs - taking existing design assets and standardizing for use across multiple locations\nLearning about and working with our technical design systems\nUsability research - interview users to determine usability of new features\nAnalytics\nKPI monitoring - monitor key performance indicators for our business\nSplit testing and cohort analysis - learn how to evaluate split tests and perform cohort analysis\nUser behavior research - look at our data retroactively to identify opportunities\nIdentifying actionable insights from data - translate data into business initiatives\nProduct\nProduct management - help keep projects on track and on time\nData analysis - work with analytics to identify opportunities in the product\nUser research - interview users to identify opportunities in the product\nUsability research - work with design to interview users and determine usability of new features\nKey Qualifications\nExcellent verbal and communication skills with the ability to articulate design decisions\nAbility to provide clear, honest and objective feedback\nYou invite change, and can continue to drive no matter how difficult the new opportunities are\nAbility to balance user needs with tech constraints and business goals\nPassionate about data and familiarity with ML/AI technologies\nPartner with product managers, designers, engineers, analysts and other internal stakeholders to understand data business requirements and build efficient and scalable solutions.\nPursuing a degree in Mathematics, CS Degree, human computer interaction and interaction design is plus\nFor Design projects - a design portfolio that demonstrates strong visual design disciplines.\n\nSmule is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.",
        "skills": [
            "information technology",
            "data visualization",
            "machine learning",
            "software engineering",
            "artificial intelligence"
        ]
    },
    {
        "position": "Engineering Intern",
        "company": "Smule Summer Internship Program - ",
        "location": {
            "city": "California",
            "state": "California"
        },
        "qualifications": "C/C++Computer GraphicsiOSCommunication SkillsJava",
        "posted": "2020-07-09T01:22:43.402Z",
        "url": "https://www.simplyhired.com/job/Jief82NJRSbm5npXz7CUIGjAJ9tDPLpLXzAoto1eZLeS5gQ2fNI52g?q=computer+science",
        "lastScraped": "2020-07-15T01:22:43.402Z",
        "description": "List of Available Projects\nMusic Information Retrieval Researcher\nDevelop algorithms to extract useful information from musical audio signals\nEstablish pipelines for extracting data and saving results to databases\nAudio DSP Engineer\nDevelop new audio effects\nEnhance C++ codebase for audio rendering\nGraphics Engineer\nUse OpenGL to develop new visual effects\nEnhance C++ codebase for effects management\nDesign cross-platform graphics framework for abstracting backends (OpenGL, Metal)\nVideo Engineer\nOptimize Smule's video processing pipeline\nAssist in building a cross-platform media framework working as the foundation for all of Smule's video technology\nOptimize performance of face tracking technology\nMobile Engineer\nImplement new features for our iOS or Android apps\nModernize the codebase to use new languages, OS features, and third-party technologies\nInvestigate and fix bugs\nKey Qualifications\nSelf-starter, strong sense of ownership, gets things done.\nFun, positive attitude. Great communication skills and a healthy desire for collaboration.\nFlexible, cross functional, outstanding learner. Ready, willing, and able to jump into any conquer and challenge at this crazy startup.\nPassion for what Smule is about: connecting people through music creation\nPursuing a degree in Computer Science, Computer Engineering, or Software Engineering is plus\nA year or two of experience programming in C++, Java or other computer programming languages preferred.\nAbility to demonstrate understanding of algorithms, data structures and other systems architecture factors that affect code quality, performance and customer experience\nSome experience building software outside of the classroom environment like an internship, hackathon, research project or related experience preferred\nDemonstrated skill in time management and completing software projects in a cooperative team environment\n\nSmule is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.",
        "skills": [
            "information technology",
            "software engineering",
            "java",
            "data visualization",
            "C and C++",
            "mobile development"
        ]
    },
    {
        "position": "Unity Developer",
        "company": "SimInsights - ",
        "location": {
            "city": "Lake Forest",
            "state": "CA"
        },
        "qualifications": "UnityComputer GraphicsMayaZBrushSoftware DevelopmentBachelor's DegreeMaster's DegreeDoctoral DegreeWork Authorization",
        "posted": "2020-07-09T01:22:43.586Z",
        "url": "https://www.simplyhired.com/job/RUDmY3h8dvGVPg4QBff7DnNk2EJlaFYv51Wtu2jd_o-a5b24lyqudg?q=computer+science",
        "lastScraped": "2020-07-15T01:22:43.586Z",
        "description": "Responsibilities\n\nWork on Unity3D based game and simulation projects.\nDevelop for VR, AR, desktop and mobile platforms.\nDesign and develop high performance software for gaming, simulation and visualization that delights users.\nUnderstand requirements through regular interaction with concerned stakeholders including counterparts in US and other offices.\nEnsure thorough quality testing and documentation of the software developed before deployment into Production.\nConstantly innovate to improve the solutions offered by the team.\n\nQualifications\n\n2+ years of experience in Unity3D development is preferred but not required.\n2+ Experience in at least two of these areas is preferred but not required: game development, 3d graphics and visualization, simulation, e-learning.\nStrong software background is required.\nGood knowledge in 3d game development, physics and animation in Unity.\nExperienced in Character Modeling, Rigging, and Animation.\nKnowledge of modeling programs like Maya and ZBrush.\nSolid understanding of the lifecycle of software development. Proven skills in taking a project through concept to design, implementation and maintenance stage.\nRelevant experience in working with cross-cultural teams across multiple locations.\nVery good interpersonal, analytical, problem-solving and written & verbal communication skills\nMinimum BS degree in computer science is required. MS or PhD degree is a plus.\n\nJob Types: Full-time, Part-time, Temporary, Internship, Contract\n\nPay: $3,500.00 - $4,500.00 per month\n\nBenefits:\n\nDental Insurance\nHealth Insurance\nPaid Time Off\nVision Insurance\n\nSchedule:\n\nMonday to Friday\n\nEducation:\n\nBachelor's (Required)\n\nWork authorization:\n\nUnited States (Required)\n\nContract Length:\n\nVaries\n\nWork Location:\n\nOne location\nFully Remote\n\nTypical start time:\n\n9AM\n\nTypical end time:\n\n6PM\n\nInternship Compensation:\n\nPay\n\nVisa Sponsorship Potentially Available:\n\nYes: H-1B work authorization\nYes: Other non-immigrant work authorization (e.g. L-1, TN, E-3, O-1, etc.)\nYes: Immigrant visa sponsorship (e.g., green card sponsorship)\n\nCompany's website:\n\nsiminsights.com\n\nWork Remotely:\n\nYes",
        "skills": [
            "data visualization",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid"
    },
    {
        "position": "RPA Intern / OPT",
        "company": "Prowess Infotech LLC - ",
        "location": {
            "city": "San Antonio",
            "state": "TX"
        },
        "qualifications": "Analysis SkillsData MiningOracleMachine LearningXMLBachelor's DegreeMaster's Degree",
        "posted": "2020-07-09T01:22:43.786Z",
        "url": "https://www.simplyhired.com/job/pWDXbvuiKJ5E1MeBXWKLfJaJqOO0T51OrVC1YZap-e6rAI5fXY1q2g?q=computer+science",
        "lastScraped": "2020-07-15T01:22:43.786Z",
        "description": "The Prowess (IT) team has an exciting opportunity for a summer internship working in Robotics Process Automation (RPA). RPA is a growing industry practice in the technology space focused on designing and building automated solutions to replace daily practical tasks using software robots.\n\nJoin us on the cutting edge and put your technical education to work as we evaluate new opportunities for process improvements through software robots. Develop bots to reduce the burden of manual, repetitive tasks, increase through put, and free up users for more value-added analysis and increased productivity.\n\nProwess endeavours into the new world of Robotic Process Automation provides a unique opportunity to leverage your technical training in a real-life environment working with software robots to make a sustainable impact on the business.\n\nYou will be part of a highly competitive team creating process improvements, robotic solutions to automation challenges, and continuing to drive innovation at a company rooted in continuous improvement.\n\nResponsibilities\n\nOwn an end-to-end RPA process improvement from start to finish\nPartner with process stakeholders to define and map the process, prepare Agile schedules, create design specifications, develop the RPA software bot , work with key stakeholders to develop and implement a testing plan, and release final production level process\nSupport go live functionality, use analytical skills to evaluate success of the project, and gain exposure to broader leadership teams as you present your results\n\nQualifications\n\nBS /MS degree in Computer Science or related major preferred\nKnowledge of basic programming principles\nExercise integrity in dealing with confidential information\n\nSuccessful Intern\n\nSelf-starter, self-motivated\nEnjoys data mining, search for value added answers\nSpotlight issues and find solutions\nWork across technical and functional teams\nStrong problem solver and logical thinker\nDetail and process oriented\nCommunicates effectively orally and in writing\nDevelop collaborative working relationships\n\nAbout Us\n\nProwess, an SAP-Certified Partner, is an expert-level consultancy providing comprehensive services and solutions to clients. Prowess was founded in 2016 by ex-SAP leader with 20+ years of experience in practice building, SAP consulting and business solutions. Our proven competency in SAP solutions and commitment to excellence enables us to build trusted and lasting relationships with our clients and partners.\n\nWe deal with integrating SAP, Oracle, Salesforce with digital technologies - Machine Learning, Big Data & Analytics, Artificial Intelligence, Blockchain and Internet of Things (IoT), thus bringing more flexibility to business operations and making them faster than ever before.\n\nTalent, Enthusiasm, Diligence and Care – are our Core Competencies that we extend to our customers. The ability to evolve continuously, doubled with our flexible approach towards dynamic business world has helped us to gain success in providing solutions to complex business scenarios to our global customers of all sizes and industries to run better.\n\nContinual improvement and collaboration are an integral part of our mindset.\n\nTo know more, visit us at prowessenterprise.com/\n\nJob Types: Full-time, Internship, Contract\n\nExperience:\n\nXML, SQL, PL-SQL: 1 year (Preferred)\n\nEducation:\n\nBachelor's (Required)\n\nLocation:\n\nSan Antonio, TX (Preferred)\n\nWork Remotely:\n\nNo",
        "skills": [
            "machine learning",
            "information technology",
            "robotics",
            "software engineering"
        ]
    },
    {
        "position": "Cybersecurity Intern",
        "company": "Cybernet Systems Corporation - 3.0",
        "location": {
            "city": "Orlando",
            "state": "FL"
        },
        "qualifications": "LinuxMicrosoft Windows ServerRMFWindowsScriptingBachelor's DegreeHigh School Diploma or GED",
        "posted": "2020-07-09T01:22:44.011Z",
        "url": "https://www.simplyhired.com/job/YLC-tssi8eJ35Fv7R9ivzINOQ5L9EyI3X1TFdxPjxseNkSsXmMNQBw?q=computer+science",
        "lastScraped": "2020-07-15T01:22:44.011Z",
        "description": "Tracking Code\n47-784\nJob Description\n\nCybersecurity Intern candidates should have or be working towards a Bachelors degree in Cybersecurity/Information Systems/ Computer Science or related discipline. There is no work related experience required. Cybernet will provide on-the-job Cybersecurity training to the individual under the direct supervision of one of our Cybersecurity professionals. A background with either Windows and/or Linux operating environments is required.\n\nRequired Skills: -Proficient in Windows, Windows Server, and/or Linux operating systems.\n\n\nMust be able to multi-task, work independently and as part of a team, share workloads, and deal with sudden shifts in project priorities.\nPerforms the hands-on Cybersecurity integration, development, testing, and security implementation of various information systems and applications.\nPerforms activities of Assessment and Authorization (A&A) efforts of information systems, networks, applications, and sites.\nSupports the development of Risk Management Framework (RMF) Cybersecurity documentation packages and automated system lockdowns.\nSupports security analysis of system risks/vulnerabilities.\nParticipates in scanning and patching Windows/Linux systems using Cybersecurity tools.\nAssists with computer and network security analysis from system development stages to product delivery.\nGet hands on experience securing systems to Department of Defense Cybersecurity standards\nAdditional preferred experience:\n\nScripting, batch, bash, PHP, Python or otherwise\nRequired Experience: 0-3 years of experience in Cybersecurity technology or a related technology field.\n\nAdditional preferred experience:\n\nAny work towards a Security + or offensive security certification\nAny experience in Network/System Administration.\nLinux/Unix/Solaris experience.\nKnowledge of vulnerability scans and penetration testing required using tools such as Nessus, SCAP, STIG Viewer.\nRequired Education:\nHigh School Diploma or Equivalent.\n\nAdditional Requirements:\nThis job requires you to be either a US Citizen or a US Permanent Resident, due to State Department Regulations regarding ITAR related programs.\n\nClearance Requirement:\n\nNone at this time\nJob Location Orlando, FL, United States\n\nPosition Type Intern",
        "skills": [
            "information technology",
            "python"
        ]
    },
    {
        "position": "Self-Marketing Internship",
        "company": "Gosvea - ",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "qualifications": "CPT CodingBachelor's Degree",
        "posted": "2020-07-09T01:22:44.229Z",
        "url": "https://www.simplyhired.com/job/LtGV7PuDkfTk73O1EJ6rM1CmN2FCFeV02PytDfY3u5KFP-mlDGIWtQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:44.229Z",
        "description": "our company provides the modern and professional financial service system. Our aim is to establish the undergraduate and graduate students with characteristics unique to Silicon Valley. Now, we are looking for internship candidates (CPT/OPT) who are interested in Self-marketing, and management field.\n\nJob Description:\n\nWe are seeking for energetic and highly motivated interns to join Gosvea Inc.You will focus on learning how our company runs and can be expected to gain valuable insight that can further interest in your chosen career field. You will have the opportunity to meet and learn from our Leadership team and other team members. For outstanding performers, a future career path at Gosvea Inc is given!\n\nResponsibility:\n\nAccept one-month training program in Self Marketing.\nOrganize events and marketing activities.\nCreate contents for the website and social media.\nDevelop marketing channels \\APP \\Web Site (just one choice is ok).\n\nRequirements:\n\nBA/BS degree required at least.\nOPT/CPT are Welcomed, sponsor h1b for excellent people.\nComputer science, Business, Marketing or related major is our best choice.\nCandidates must be fluent in both English and Chinese.\n\nJob Types: Full-time, Part-time, Internship\n\nPay: $20,000.00 - $80,000.00 per year\n\nBenefits:\n\nFlexible Schedule\n\nSchedule:\n\n8 Hour Shift\nMonday to Friday\n\nExperience:\n\nCPT Coding: 1 year (Preferred)\nMultilingual: 1 year (Preferred)\n\nEducation:\n\nBachelor's (Preferred)\n\nLanguage:\n\nChinese (Preferred)\nEnglish and Mandarin (Preferred)\n\nWork Location:\n\nOne location\n\nHours per week:\n\n30-39\n\nInternship Compensation:\n\nCollege Credit\n\nThis Job Is Ideal for Someone Who Is:\n\nDetail-oriented -- would rather focus on the details of work than the bigger picture",
        "skills": [
            "machine learning"
        ],
        "compensation": "paid"
    },
    {
        "position": "PhD Intern - High Performance Computing",
        "company": "Pacific Northwest National Laboratory - 4.1",
        "location": {
            "city": "Richland",
            "state": "WA"
        },
        "qualifications": "OS KernelsMachine LearningDoctoral DegreeMaster's DegreeWork Authorization",
        "posted": "2020-07-09T01:22:45.739Z",
        "url": "https://www.simplyhired.com/job/BkEKC3seIjvKrHvehusjOO8_QYJ78c_MyWfPcoGfiMo6i73ioIQd7w?q=computer+science",
        "lastScraped": "2020-07-15T01:22:45.739Z",
        "description": "Organization and Job ID\n\nJob ID: 310982\n\nDirectorate: Physical & Computational Sciences\n\nDivision: Advanced Computing, Math, and Data\n\nGroup: High Performance Computing\n\nJob Description\n\nIntern will be working closely with HPC staff members to develop memory analysis tools targeting advanced High-Performance Computing systems and architectures. The Candidate should have a strong background in Hardware-Software co-design of application-specific accelerators, with expertise in Verilog designs for FPGAs or ASICs and practical experience with the related tools. A knowledge of the specific challenges of memory-bound workloads such as irregular applications, graph kernels, and machine learning algorithms operating on sparse models, experience with open-source codes and IPs, knowledge of high-level synthesis methodologies, and experience in developing synthesis tools are also desired. The intern will work, together with a mentor and team, to develop designs and test execution on testbed computing platforms at PNNL.\n\nMinimum Qualifications\n\nCandidates must be currently enrolled/matriculated in a PhD program at an accredited college. Minimum GPA of 3.0 is required.\n\nPreferred Qualifications\n\nIntern must have completed computer science programming courses and must be familiar with modern programming tools and languages.\n\nCurrently pursuing a degree in Computer Science or related field.\n\nEqual Employment Opportunity\n\nBattelle Memorial Institute (BMI) at Pacific Northwest National Laboratory (PNNL) is an Affirmative Action/Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All BMI staff must be able to demonstrate the legal right to work in the United States. BMI is an E-Verify employer. Learn more at jobs.pnnl.gov.\n\nPlease be aware that the Department of Energy (DOE) prohibits DOE employees and contractors from participation in certain foreign government talent recruitment programs. If you are offered a position at PNNL and are currently a participant in a foreign government talent recruitment program you will be required to disclose this information before your first day of employment.\n\nDirectorate: Physical & Computational Sci's\n\nJob Category: Master's and PhD Level Internships\n\nGroup: High-Performance Computing\n\nOpening Date: 2020-07-08\n\nClosing Date: 2020-07-22",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ]
    },
    {
        "position": "Software Engineering Intern/Co-op Student - Fall 2020",
        "company": "BECHT - 4.4",
        "location": {
            "city": "Liberty Corner",
            "state": "NJ"
        },
        "qualifications": "SDLCCommunication SkillsOOPMicrosoft SQL ServerBootstrapMaster's DegreeBachelor's DegreeDoctoral Degree",
        "posted": "2020-07-08T01:22:45.781Z",
        "url": "https://www.simplyhired.com/job/lgp5inysZWxtz6jxi-hk5fIRg_NmRet58Few7_DltdjBjr50yV5jcA?q=computer+science",
        "lastScraped": "2020-07-15T01:22:45.781Z",
        "description": "Becht is a 5 STAR rated Glassdoor company and a Top 100 Best Places to Work in New Jersey according to NJBIZ!\n\nPlease attach a recent unofficial transcript with your resume. If you are a Master's degree student, please also upload your Bachelor's degree transcript. Failure to do so will create a delay in the review of your application.\n\nWho is Becht?\nFounded in 1964, Becht is a rapidly-growing, multi-discipline consulting firm relied on by customers to relentlessly solve their most difficult and entrenched problems. We combine vast experience through our network of over 1200 technical experts with both engineering expertise and professional experience. Becht is a company founded on excellence, and as such we seek individuals who want to be part of our passionate and energetic team.\n\nWho Do We Want?\nBecht is seeking junior, senior, master’s or doctorate computer science/software engineering students with interest in web app development with a database back end who want to learn more by joining our world-class, family-owned engineering organization. Becht is committed to developing young professionals by providing opportunities to explore the dynamic environment of engineering consulting services. Becht strives to provide the student with:\n\nReal world experience with a consulting company operating with the latest technology\nGuidance in the form of a highly trained mentor\nA positive, team approach work environment\nHands on experience with the full SDLC during your internship\nAt Becht, our intern/co-op program gives students the opportunity to explore the practical applications of their college classes while working with customers from around the globe. We offer full-time student positions for every semester. These positions actively support current projects and are constantly evolving. As a student with Becht, you will learn to develop internal and client facing web apps, web pages, and productivity tools with a team of other software developers and engineers. You will be involved in the entire process from setting application requirements, creating data models, and designing the interface, developing the front and back ends, testing and assisting in deployment. You will be at the forefront of our most advanced and technically rewarding projects to assist clients in improving reliability and profitability while also reducing risks to people and the environment.\n\nBuild Your Career with Becht\nA creative and innovative work environment isn’t all we have to offer! When you join Becht, you can expect:\n\nA positive, collaborative workforce\nAccess to further training and development\nMentoring programs\nCompany and family events such as baseball games, go-karting, and bowling\nOpportunities that provide stability as well as variety\nWork day events such as birthday lunches\nCommunity outreach programs such as Red Cross blood drives, Toys for Tots collections/volunteering, and United Way campaigns\nYour Knowledge and Expertise\n\nPassion for technology and can navigate across complex and rapidly changing landscapes\nDetail oriented and organized\nCreative and confident to express new ideas\nProven troubleshooting skills\nSelf-motivated and self-disciplined\nShould be comfortable working in a virtual team\nAbility to compartmentalize efforts—put one task down, pick up another, then resume the first with minimal ramp up required\nStrong verbal and written communication skills\nObject oriented programming experience\nDatabase experience\nMSSQL, Bootstrap, C# and/or .NET Core experience are a plus.\nMust be enrolled in a bachelor’s or master’s software engineering, computer science, or equivalent, degree\nMust be available to work 40 hours per week for a minimum of one semester\nMust be local or willing to temporarily relocate to the Medina, OH; Liberty Corner, NJ; Lawson, MO; Northland area, KC or Humble, Houston in TX areas\nBecht is an Equal Opportunity Employer.",
        "skills": [
            "software engineering",
            "C and C++",
            "machine learning",
            "information technology"
        ]
    },
    {
        "position": "Computer Science (Internship) Programming",
        "company": "Ávakas Institute - ",
        "location": {
            "city": "Redlands",
            "state": "CA"
        },
        "qualifications": "Bachelor's Degree",
        "posted": "2020-07-08T01:22:45.987Z",
        "url": "https://www.simplyhired.com/job/sk0_yeSDhzrY5FleBMTqmIF4RmIlBXDjIusdrpVZ4w07Rpf8VUeBjQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:45.987Z",
        "description": "Avakas Inc. is a innovative arts and technology company located in Downtown Redlands, CA. We have current openings for a Computer Science Intern to work alongside our CS department admin.\n\nAs an intern you will:\n\nParticipate in the development of new apps and software\nLearn how to create CS curriculum for students ages 10+\nDevelop leadership and team building skills.\n\nYou should:\n\nHave recently graduated or will be graduating with a Bachelors in Computer Science, engineering, or related subject\nBe available for 15-20 hours per week.\n\nThis is an unpaid scholastic internship.\n\nJob Type: Internship\n\nPay: $0.00 per hour\n\nSchedule:\n\nMonday to Friday\n\nLocation:\n\nRedlands, CA 92373 (Required)\n\nWork Location:\n\nMultiple locations\n\nInternship Compensation:\n\nCollege Credit\n\nThis Company Describes Its Culture as:\n\nDetail-oriented -- quality and precision-focused\nInnovative -- innovative and risk-taking\nTeam-oriented -- cooperative and collaborative\n\nWork Remotely:\n\nNo",
        "skills": [
            "software engineering",
            "machine learning",
            "information technology"
        ],
        "compensation": "unpaid"
    },
    {
        "position": "IT Intern",
        "company": "Real Green Systems - 3.8",
        "location": {
            "city": "Walled Lake",
            "state": "MI"
        },
        "qualifications": "Data Center ExperienceIT SupportWindowsCustomer ServiceHigh School Diploma or GEDBachelor's Degree",
        "posted": "2020-07-08T01:22:46.186Z",
        "url": "https://www.simplyhired.com/job/q-ynFPBznWiX2PBnKToCRaJDW6xj6jT3sf_Op97CackNMGKPv4qnVQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:46.186Z",
        "description": "Position Summary:\nReal Green Systems is looking for a great candidate for our IT Intern role. You should be able to commute to our offices in Walled Lake, MI. This person will help administer end-user PCs and other equipment as well as modify configurations, utilities, software settings, etc to resolve end-user issues to satisfaction. If you are interested in a career in an IT department, we want to meet you!\n\nResponsibilities:\nAdministrator of end-user PCs, Printers, Mobile Devices and related equipment\nUse an established Help Desk system to monitor and track problem tickets and technical support issues. Ensure timely and considerate service to end-users.\nModify configurations, utilities, software settings, etc to resolve end-user issues to satisfaction\nDocument internal procedures\nInstall, test & configure new workstations, peripherals, and software.\nMaintain inventory of all equipment and software\nUpdate software applications as needed\nAssist with pending data center migration\n\nRequirements:\nExperience in providing IT support and/or are currently or recently enrolled in a post-High School Technical Education Program (such as a Bachelor’s degree in Computer Science)\nExperience with Windows 7, 8, & 10\nCustomer service oriented with problem solving abilities and adaptability skills\n\nAbout Us:\nWe are Real Green Systems, a leading Michigan enterprise software company. We provide software solutions to lawn care, pest control, and other types of organizations in the green industry. We believe that success is achieved through the pursuit of excellence in customer and employee relations. We keep “a finger on the pulse” of our company by staying tuned in with the status of our customers and the well-being of our Real Green family of employees. We strive to exceed expectations by providing exceptional products and services that are innovative, affordable and meets the needs of our service industry partners. You can learn more about us at https://www.realgreen.com/about-our-company\n\nOur Culture:\nReal Green Systems is a respectful, family-friendly company. We are proud of our culture and of the dedication of our employees. Many of our employees have been here for years and the organization is very loyal to them, providing ample opportunity to learn on the job along with a great place to work.\n\nBenefits:\n16 days of PTO a year, earned at 1.33 days per month, along with six paid holidays\nStrong medical and dental plans\nFlexible Spending Accounts (FSAs) using pre-tax dollars for qualified medical expenses\n401k program with a safe-harbor match of 100% on the first 3% of your contributions and 50% on the next 2% of contributions\nFree life insurance for $25,000 upon eligibility, with the option to purchase additional coverage if you desire\nBusiness casual dress code\nConvenient Walled Lake, MI location\n\nEEO Policy:\nReal Green Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n_________________________________________________________________________\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nPowered by JazzHR\n\nwXtlvqsSID",
        "skills": [
            "information technology",
            "machine learning",
            "software engineering"
        ],
        "compensation": "paid"
    },
    {
        "position": "Graphic Design Internship",
        "company": "Xerox Copy Solutions, Inc. - ",
        "location": {
            "city": "Alhambra",
            "state": "CA"
        },
        "qualifications": "Communication SkillsMicrosoft OfficeMicrosoft WordMicrosoft PowerpointMicrosoft Excel",
        "posted": "2020-07-08T01:22:46.407Z",
        "url": "https://www.simplyhired.com/job/4PjspWjIOfTRLGFRxbij4fL9FewgHZD-pYZZ9-_2zidvKVIESgkq3Q?q=computer+science",
        "lastScraped": "2020-07-15T01:22:46.407Z",
        "description": "Why Copy Solutions?\n\nApplicable to most internship programs at California universities. We will verify your hours for academic credit and complete any necessary forms/surveys\nGain first-hand professional experience working under Xerox, a Fortune-500 company\nHave a leg up on the competition before graduating with professional experience on your resume\nUpon completion of our internship program, you can receive a recommendation letter based on your performance\nApply your coursework and experience to a professional work environment\nDevelop your professional communication skills, network, and acquire real-world professional experience\nWe can accommodate to your busy class schedule, as long as you complete 20 hours a week from the office!\n\nResponsibilities:\n\nWork with a mentor who will guide you through completing daily graphic design-related tasks\nProjects can consist of updating company logos, web sites, and product illustrations, etc.\nAssist in the development of graphic material spread across digital and print\nPrepare images to coincide with social and blog posts\nWork directly with the computer science team to translate designs to our website\nSupport daily marketing administrative tasks\nKeep up to date with current and developing design trends\n\nRequirements & Qualifications:\n\nUpper division college student or recent graduate\nUnderstanding of Microsoft Office (Outlook, Word, PowerPoint, Excel)\nCompletion of introductory/intermediate graphic design courses\nWe do not provide basic graphic design education. Must have a strong foundation of graphic design knowledge to be able to apply what you know to the internship program\nStrong understanding of desktop publishing software, photo imaging software, and video creation and editing software\nAttention to detail, organization, and quality\nAbility to work in a fast-paced, competitive environment\nAbility to work in our Alhambra office (must have a reliable form of transportation)\nMinimum commitment of 20 hrs/week for at least 3 months\nMust complete 250 total hours **\n\nCopy Solutions, Inc. is an authorized Platinum Sales Agent, Dealer, and reseller covering the greater Los Angeles area, representing the Xerox Corporation. Copy Solutions and Xerox are partnered together to offer the most advanced and leading edge digital technology for the office. We believe that no matter what size, every business is unique and every business is driven to improve results. Our organization offers real business experience (based on special projects and NOT employee jobs) across all corporate levels, training and workshops on how to succeed in the world of business, challenging projects that will help cultivate creativity and foster growth, a personal mentor who will guide you through your experiences and assignments, and academic credit.\n\nWe are seeking a college student who wants a Graphic Design internship that will challenge them and provide them with valuable experience to prepare them for their future careers.\n\nPosition Type: Internship, part-time, UNPAID\n\nJob Types: Part-time, Internship\n\nSchedule:\n\nMonday to Friday\n\nApplication Question:\n\nHow many years of Relevant experience do you have?\n\nInternship Compensation:\n\nCollege Credit",
        "skills": [
            "information technology",
            "software engineering"
        ],
        "compensation": "unpaid"
    },
    {
        "position": "Computer Science Internship",
        "company": "Xerox Copy Solutions, Inc. - ",
        "location": {
            "city": "Alhambra",
            "state": "CA"
        },
        "qualifications": "Communication SkillsMicrosoft OfficeMicrosoft WordMicrosoft ExcelMicrosoft Powerpoint",
        "posted": "2020-07-08T01:22:46.608Z",
        "url": "https://www.simplyhired.com/job/dyvYKvPB_6ICpOkSA8FJP7yZlEdjFrripbTlZhwgpnrVAf2q-zUZWQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:46.608Z",
        "description": "Why Copy Solutions?\n\nApplicable to most internship programs at California universities. We will verify your hours for academic credit and complete any necessary forms/surveys\nGain first-hand professional experience working under Xerox, a Fortune-500 company\nResume building\nHave a leg up on the competition before graduating with professional experience on your resume\nUpon completion of our internship program, you can receive a recommendation letter based on your performance\nApply your coursework and experience to a professional work environment\nDevelop your professional communication skills, network, and acquire real-world professional experience\nWe can accommodate to your busy class schedule, as long as you complete 20 hours a week from the office!\n\nResponsibilities:\n\nWork with a mentor who will guide you through completing daily computer science-related tasks\nTranslate the project team’s messaging concepts into marketing materials\nWork directly with the graphic design and marketing teams to revamp and update our company website\nAssist with compilation of fact sheets and assess application ideas\nDevelop applications (coding, programming)\nDocument and test new software applications\n\nRequirements & Qualifications:\n\nUpper division college student or recent graduate\nUnderstanding of Microsoft Office (Excel, Outlook, PowerPoint, Word)\nCompletion of introductory/intermediate computer science courses\nWe do not provide basic computer science education. Must have a strong foundation of computers and electronics knowledge to be able to apply what you know to the internship program\nWeb platform development software and app design experience**\nSystems analysis and Collaboration skills\nAbilities in Information ordering, and Problem sensitivity\nAbility to work in our Alhambra office (must have reliable form of transportation)\nMinimum commitment of 20 hr/week for at least 3 months\nMust complete 250 total hours**\n\nCopy Solutions, Inc. is an authorized Platinum Sales Agent, Dealer, and reseller covering the greater Los Angeles area, representing the Xerox Corporation. Copy Solutions and Xerox are partnered together to offer the most advanced and leading edge digital technology for the office. We believe that no matter what size, every business is unique and every business is driven to improve results. Our organization offers real business experience (based on special projects and NOT employee jobs) across all corporate levels, training and workshops on how to succeed in the world of business, challenging projects that will help cultivate creativity and foster growth, a personal mentor who will guide you through your experiences and assignments, and academic credit.\n\nWe are seeking a college student who wants a Computer Science internship that will challenge them and provide them with valuable experience to prepare them for their future careers.\n\nPosition Type: Internship, part-time, UNPAID\n\nJob Types: Part-time, Internship\n\nSchedule:\n\nMonday to Friday\n\nApplication Question:\n\nHow many years of WordPress experience do you have?, Do you have experience with HTML/CSS/JAVASCRIPT?\n\nInternship Compensation:\n\nCollege Credit",
        "skills": [
            "information technology",
            "javascript",
            "software engineering",
            "web development"
        ],
        "compensation": "unpaid"
    },
    {
        "position": "Test Engineer Intern D (Anaheim, CA)",
        "company": "L3Harris Technologies - 3.7",
        "location": {
            "city": "Anaheim",
            "state": "CA"
        },
        "qualifications": "ScriptingWord ProcessingSystem DesignApplication DevelopmentSQLBachelor's Degree",
        "posted": "2020-07-08T01:22:46.793Z",
        "url": "https://www.simplyhired.com/job/qCeIFF5Fg2A_3S7Gz-qebZQCPAMbAUlYoB626v_D-Ym_nBILtofD4Q?q=computer+science",
        "lastScraped": "2020-07-15T01:22:46.793Z",
        "description": "Description:\nJob Title: Test Engineer (Intern-Anaheim, CA)\n\nJob Code: AS20200607-47394\n\nJob Location: Anaheim, CA\n\nJob Description:\nCreate and maintain a database to support data collected for various programs.\nImplement, debug, and execute test software for Navigation electronics, analyze test results, implement Satellite Simulator test scenarios\nGenerate software tools and algorithms to support the collection and analysis of data obtained via automated testing\nGenerate software tools and algorithms to support the development, implementation, and validation of test environments for embedded systems utilizing GPS/INS.\nResearch new technology to support evaluation of prototype designs\nPerform system regression testing, data analysis and document test results\nSupport field testing events and document results\n\nQualifications:\nCurrently enrolled in a Bachelor’s degree program in Computer Engineering, Math, Computer Science, Physics, Data Analysis or related field\n\nGPA of 3.0 or greater\n\nPreferred Skills:\nExperience with database management, scripting languages, spreadsheets, and word processing software. Previous RF or GPS experience.\n\nCoursework or experience in at least one of the following areas: database design, database management, software development, system design, or data analysis\n\nCoursework or experience with SW development, Application Development, and programming\n\nFamiliarity with SQL, Python, C##, statistics, linear algebra, MatLab, or GPS\n\nExcellent problem solving skills\n\nAble to work in a team environment\n\nProficient with Microsoft Office products\n\nGood communication skills (written, verbal, & presentation)\n\nKnowledge of basic test equipment\n\nLab skills and experience",
        "skills": [
            "software engineering",
            "python",
            "matlab",
            "C and C++",
            "information technology"
        ]
    },
    {
        "position": "Intern - Fall 2020 - DRC QA",
        "company": "GLOBALFOUNDRIES - 3.3",
        "location": {
            "city": "Santa Clara",
            "state": "CA"
        },
        "qualifications": "Node.jsPythonPass Drug Screening",
        "posted": "2020-07-08T01:22:46.985Z",
        "url": "https://www.simplyhired.com/job/5Gx12jlGhYAWi0ThPggCAeS_F7RySIfqBq7fbKGOdferSlFerkhNmQ?q=computer+science",
        "lastScraped": "2020-07-15T01:22:46.985Z",
        "description": "Summary of Role :\nPerform advanced node PDK (process design kit) qualification activities and develop QA methodologies. Interface with various development teams and develop and debug test structures within internal regression testing flow. Develop and debug QA automation software. Debug errors reported by internal groups, customers and external groups for the following advanced node PDK modules: Design Rule Check (DRC). This internship position will be located at our Santa Clara, CA office.\n\nEssential Responsibilities :\nDevelop and debug QA automation software\nDevelop test structures for DRC\n\nPerform all activities in a safe and responsible manner and support all Environmental, Health, Safety & Security requirements and programs\n\nRequired Qualifications :\nEducation – Graduating Senior or Junior in Electrical Engineering/Computer Science or other related discipline\n\nExperience – None\n\nTravel – None (% of travel required)\n\nLanguage Fluency – English\n\nPhysical Capacity Demands – None\n\nPreferred Qualifications:\nDetailed knowledge regarding different PDK components: DRC, LVS, cadence library, PEX, etc.\n\nGood understanding of scripting language such as python or TCL.\n\nIf you need a reasonable accommodation for any part of the employment process, please contact us by email at usaccommodations@globalfoundries.com and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.\n\nAn offer of employment with GLOBALFOUNDRIES is conditioned upon the successful completion of a background check and drug screen, as applicable and subject to applicable laws and regulations.\n\nGLOBALFOUNDRIES is fully committed to equal opportunity in the workplace and believes that cultural diversity within the company enhances its business potential. GLOBALFOUNDRIES goal of excellence in business necessitates the attraction and retention of highly qualified people. Artificial barriers and stereotypic biases detract from this objective and may be illegally discriminatory.\n\nProcedure: All policies and processes which pertain to employees including recruitment, selection, training, utilization, promotion, compensation, benefits, extracurricular programs, and termination are created and implemented without regard to age, ethnicity, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, sexual orientation, gender identity or expression, veteran status, or any other characteristic or category specified by local, state or federal law.",
        "skills": [
            "software engineering",
            "python",
            "information technology"
        ],
        "contact": "usaccommodations@globalfoundries.com"
    }
]