[
    {
        "position": "Evaluation Intern",
        "company": "Teach Plus",
        "location": {
            "city": "Boston",
            "state": "Texas (TX)",
            "zip": "02108"
        },
        "posted": "07/01/2020",
        "due": "07/31/2020",
        "compensation": "Yes",
        "qualifications": "Bachelors",
        "url": "https://www.youtern.com/career/27431/Evaluation-Intern-Region-Boston",
        "lastScraped": "2020-07-06T02:34:44.765Z",
        "description": "I. Overview of Teach Plus\nTeach Plus is dedicated to the mission of empowering excellent, experienced, and diverse teachers to take leadership over key policy and practice issues that advance equity, opportunity, and student success. Since 2009, Teach Plus has developed thousands of teacher leaders across the country to exercise their leadership in shaping education policy and improving teaching and learning, to create an education system driven by access and excellence for all.  teachplus.org\n \nII. Internship Description\nTeach Plus conducts program evaluations that inform educational policy and practice to improve teacher leadership and student achievement. Our studies use quantitative, qualitative and mixed methods. The evaluation department is looking for an intern who will work directly with the National Director of Evaluation and the evaluation team at Teach Plus. \nFrom acceptance until the end of December 2020, the research intern will assist primarily in evaluation activities in a variety of areas of education, including changes in teacher practice, educational leadership, and a variety of other content areas. The intern will have the opportunity to:\n\n\nPerform data entry and clean and analyze survey data using Survey Gizmo and Salesforce\n\n\nAssist in the development of instruments such as questionnaires, interview protocols, and surveys\n\n\nPrepare literature reviews\n\n\nCreate charts, graphs and other figures for reports and presentations using Excel or SPSS\n\n\nDraft and edit memos, evaluation reports and grant proposals\n\n\nAssist with general administrative tasks\n\n\nIdeally, we are seeking a graduate student in education, education policy, or other social science with outstanding verbal and written skills, excellent organizational skills, attention to detail, and experience with PowerPoint, Excel, Survey Gizmo, and SPSS or other statistical packages.\nIII. Term and Hours\nThis is a part-time internship. Time commitment is relatively flexible, but a commitment of 10 hours per week is required.  The internship will start immediately and will continue through the end of December 2020. This internship is remote and can be conducted from any location.  \n\nIV. Compensation  \n$500 internship stipend.  \n \nV. How to Apply\nTo apply, please complete an online application found here. The online application will require you to upload a resume and cover letter.  The cover letter should include an explanation of the candidate’s interest in the position as well as a summary of relevant qualifications and experience.\n \nApplication Link: https://teachplus.tfaforms.net/327936\n \nIn order to better-serve the teachers and students at the core of our mission, Teach Plus is committed to maximizing the diversity of our organization. We are an equal opportunity employer and encourage individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply to our positions.\n \nVisit www.teachplus.org for more information about the organization.",
        "skills": [
            "machine learning",
            "information technology",
            "cybersecurity"
        ],
        "start": "2020-12-01T10:00:00.000Z"
    },
    {
        "position": "Video Game Intern (Open to All)",
        "company": "MoonRift Entertainment",
        "location": {
            "city": "Scottsdale",
            "state": "Arizona (AZ)",
            "zip": "85251"
        },
        "posted": "06/21/2020",
        "due": "07/21/2020",
        "compensation": "No",
        "qualifications": "High School Student/Diploma",
        "url": "https://www.youtern.com/career/27430/Video-Game-Intern-Open-To-All-Region-Scottsdale",
        "lastScraped": "2020-07-06T02:34:46.893Z",
        "description": "As the Video Game industry is currently predominantly male, MoonRift encourages women to apply regardless of their knowledge of the industry, mainly because here at MoonRift we strive to do things “our way” versus traditional models. We strive to build a business around community, training, and support of one another through empathy and loyalty.\nMoonRift Entertainment LLC is a video game development company that promotes diversity and inclusion from people of various backgrounds and interests. We seek to hire and recruit people who have a drive to go above and beyond, those who desire to build and create opportunities for themselves, and those who would like job security through the collective efforts of working in a professional team; that will challenge each other to grow day-by-day.\nThe video game industry is the pioneer of the Entertainment world grossing over $151.2 Billion as of 2019, which has risen since 2020. It has and continues to surpass the motion pictures industry and is a leading factor in the development of hardware and software technology.\nAmidst COVid19, there are many looking for an opportunity and a change in career paths. Backgrounds from Tourism, Sports, Entertainment, Retail, Marketplaces, Restaurants, and other sectors are welcome as skillsets from these industries can be applied through many ways here at MoonRift. This Internship program is designed to build a role for those chosen for this unique opportunity in Arizona, allowing people to grow according to their current strengths.\nThis is an Unpaid Internship opportunity that has three-month cycles based on the current project, by the end there is possibility for compensation depending on how well the company/team performs. At the end of the 3-month period those who have fulfilled the criteria will be rewarded with MoonRift Certificate of Completion. At this time, another cycle will begin for another project, as the company grows so shall more paid and permanent opportunities arise. This is a startup.\n \nResponsibilities\n-Fulfillment of assignments on mark.\n-Show up on time and professional\n-Work cohesively with the group and go above and beyond\n \nRequirements\nAttend in-person meeting once a month (Tempe/Scottsdale)\n3-Hour Virtual Call once per week\n21+ Age\n \nBenefits\nUnlimited growth opportunities\nBeing apart of a new venture\nHaving your voice heard\nWork from home\nTraining and development\nCertificate of Completion\n \nFAQ\nWhat position am I applying for?\nAn Internship that will be tailored based on your strength and what necessary functions are required for MoonRift.\n \nWhat will I be learning about?\nVideo Game Industry, Game Development Process, Time Management, Goal Setting, Effective Communication Methods, and Advanced Problem-Solving Tools.\n \nHow much time commitment?\n10 Hours per week virtually\nOne meeting in person a month\n \nHow long is this internship?\n3 Month Program – July 13th -> September\nAt end of the program, everything will be evaluated, and the company will evolve to further needs.\n \nWhat if I have no skills related to Video Games?\nIf you know programming, Great!\nIf you can draw, Great!\nIf you can sell, Great!\nIf you can teach, Great!\nGood at putting together events, Great!\nIf you can talk to people, Great!\nIf you are good with designing, Great!\nGood with math, Great!\nIf you can create in your own way using a talent you got, Great!\nThe internship opportunity is set up in a way to welcome a diverse skillset.\n \nDo I have to be familiar with the game industry to apply?\nNot at all, you will understand and learn more as you go.\n \nWhat if I know absolutely nothing about video games?\nThat is fine, never too late to start.\n \nWhy only 21+?\nFor our different public events we will be hosting as well as the nature of the economic climate, those who are older than 21 and have been recently laid off are currently in our scope for hire. This may be subject to change as the company evolves and more opportunities arise.\n \nWhat projects has MoonRift worked on?\nNyx the Chameleon in 2016 was our spearhead project that failed fabulously in it is Kickstarter launch. Currently, there is a project nearing completion called Heat, that requires a ton of support for rework, overhaul, marketing, event planning, etc.\n \nWhat if I find a full-time job, can I come back later?\nAbsolutely, the internship program is designed to allow people to join for a cycle and then rejoin later if they have good standing for another cycle. Additionally, it is set up for people to be able to have full-time positions elsewhere. We want you to be fully supported.\n \nDoes your company do philanthropic work?\nWe are currently looking into supporting local organizations, our national support right now will be to Polaris Project , an organization against modern-day slavery which is and labor trafficking.\n \nWhat are the growth opportunities? \nAs with any start-up the opportunities will arise as our needs arise.\n \nIs it a registered company?\nYes, we are a registered LLC\n \nCan I work somewhere else as well?\nYes, as long as you fulfill all requirements. We want you to be fully supported.\n \nHow fun is this internship?\nA blast! The game development process and releasing a new title is one of the most uplifting, unique, and rewarding experiences that you can be apart of. Additionally, we love to have fun at MoonRift as our culture is chill, focused, and filled with personality.",
        "skills": [
            "machine learning",
            "information technology",
            "software engineering"
        ]
    },
    {
        "position": "Customer Experience Associate",
        "company": "Sustainable",
        "location": {
            "city": "Nashville",
            "state": "Tennessee (TN)",
            "zip": "47209"
        },
        "posted": "06/07/2020",
        "due": "07/07/2020",
        "compensation": "No",
        "qualifications": "Sophomore",
        "url": "https://www.youtern.com/career/27429/Customer-Experience-Associate-Region-Nashville",
        "lastScraped": "2020-07-06T02:34:47.880Z",
        "description": "Customer Experience Associate\nUnpaid-Internship | Part-time\n\nOur Customer Experience Associates (CEA) will work remotely for Sustainable and serve as our ultimate brand ambassador and voice for customers and vendors through phone, email, and chat communications. This is an unpaid, remote internship that will be a strong learning experience for the intern as we have some big goals here at Sustainable.\n\nResponsibilities will include:\n\nMonitor and maintain brand guidelines within individual farm’s stores\nHandle customer inquiries + questions via phone, chat, and/or email\nHandle vendor inquiries + questions via phone, chat, and/or email\nEducating customers and vendors on how to use Sustainable web browser and app\nInfluencing customer happiness and loyalty metrics\nEscalates issues to senior level as needed\nAt the direction of your manager, fulfill cross functional department requests\nAdjust item listings by editing photos, descriptions, pricing and other details\nStay up to date on product availability, inventory, vendor policies, and more\n\n\nCEA’s should be dynamic communicators and proactive problem solvers, knowing that our customers and vendors should always be given the highest level of customer service. CEA’s will serve as the first interaction of brand experience for our customers and vendors and therefore should know our brand, messaging, and vision more than anyone.\n\nPreferred Background:\n\nCompleted at least two (2) years of school at an undergraduate institution\nBe tech savvy and have no issues jumping right into projects headfirst\nExcellent written and oral communication skills\nHave an ability to work independently and manage multiple tasks\nBe a solution-driven individual who shares Sustainable’s core mission and values and believes in our ability to work together to make a difference in the lives of farmers\n\n\nRequests of the role:\n\nAvailability and willingness to be available 10-30 hours per week, as the business needs require (cannot confirm commitment each week as it will ebb and flow)\nDeliver superior, personalized experience to both customers and vendors\nReview all training materials to maintain customer service and branding knowledge",
        "skills": [
            "machine learning"
        ]
    },
    {
        "position": "Digital Marketing Intern",
        "company": "Hypepicks",
        "location": {
            "city": "Venice Beach",
            "state": "California (CA)",
            "zip": "90291"
        },
        "posted": "06/07/2020",
        "due": "07/07/2020",
        "compensation": "No",
        "qualifications": "High School Student/Diploma",
        "url": "https://www.youtern.com/career/27428/Digital-Marketing-Intern-Region-Venice-Beach",
        "lastScraped": "2020-07-06T02:34:48.944Z",
        "description": "Looking for an exciting summer internship providing you with real work experience in the sports & digital space? Hypepicks (the 1st ever all-inclusive subscription based sports handicapping company) is looking for a Digital Marketing Intern to develop our pre-launch strategy and execute our launch when sports are set to resume in the next coming weeks. \n\nAfter completing your internship at Hypepicks, you will have garnered the necessary skills and experience to become a Digital (or Traditional)  Marketing Director. You will learn how to use critical thinking, develop a vision and execute a fully integrated marketing plan under the guidance of our co-founder. In other words, you will have a front row seat to creativity, entrepreneurship and operation excellence. \n\nDIGITAL MARKETING MANAGER\nOur company is seeking a marketing manager intern to work closely with our co-founders to create and implement our digital marketing strategy prior to and during the official launch of the service. The Marketing Intern is responsible for executing marketing programs and ensuring all deadlines are met. The successful candidate for this position will also be required to come up with new idea and strategy to help take the company to the next level. \n\nGENERAL INFORMATION\n\nWork Hours: Mon-Fri 9am to 5pm PST\nUnpaid Internship\nPossibility for full-time offer\nThis internship is remote. (WFH)\nDuration: 3 to 6 months\n\n\nREQUIREMENTS\n\nExcellent Communication Skills\nPro-Active attitude \nEntrepreneurial mindset. We strongly encourage creativity and new ideas\nMust be available at all-time during working hours (Mon-Fri 9am to 5pm PST)\nWork hand-in-hand with the co-founders\nMeet deadlines\nKnowledge of Final Cut Pro, After Effects, Photoshop, Webflow\nMarketing Major Student\n\n\nRESPONSABILITIES\nThe intern will be responsible to manage and execute all marketing operations (Description below)\n\nMARKETING OPERATIONS\n\nAffiliate Program Management\n\n\nDesign Affiliate Social Media Campaigns\nCoordinate Marketing Campaign with affiliates\nMaintain relationship & timely communication with affiliates\nImplement Affiliate Program in tracking systems \nTracking & Analysis\n\n\nSocial Media Channel Management\n\n\nSports Calendar Management \nContent Design \nContent Posting Schedule \nSM Contest Management & Execution\n\n\n\nWEBSITE\n\nMaintain and udpate: visuals, new features etc.\nSEO\nGoogle Analytics\nWork with freelance designer to optimize design and operations\n\n\nGRAPHIC DESIGN \n\nAffiliate Campaign Design\nSocial Media Content \n\n\nPhoto\nVideo\n\n\n\n\nREPORTING \n\nCreate Reports\n\n\nTemplates\nData\nDistribution Schedule\n\n\nCreate Guidelines and How-to\n\n\nHow-to for each process",
        "skills": [
            "data visualization",
            "machine learning",
            "information technology"
        ]
    }
]