[
    {
        "position": "Fall 2020 Graduate Intern",
        "company": "Data Quality Campaign",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2018-08-21T02:25:05.445Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/1a2c5929753440cb90df14f84c6085be-fall-2020-graduate-intern-data-quality-campaign-washington",
        "lastScraped": "2020-09-09T02:25:05.450Z",
        "description": "The Data Quality Campaign (DQC) is one of the country’s leading education advocacy organizations, with a 15-year track record of success and a growing, talented staff. DQC is a nonprofit policy and advocacy organization leading the effort to bring every part of the education community together to empower educators, families, and policymakers with quality information to make decisions that ensure that students excel. To realize this vision, DQC works toward three goals:1.  Increase public understanding of the value of education data.2.  Ensure that everyone with a stake in education has timely access to the right information.3.  Improve the capacity of and conditions for teachers and school leaders to use data.If you care passionately about changing the role of data in education so that every student is not only counted, but counts, DQC is the place for you. DQC values the diverse backgrounds, experiences, and opinions that each team member brings to this work—and seeks to add individuals to our team who continue to expand our thinking, push our boundaries, and commit to bringing their whole selves and experiences to our team. Note: DQC’s staff is headquartered in Washington, DC. We will give preference to applicants who reside in the DC area, but are open to qualified candidates who reside outside of DC. Position SummaryThe intern will work across the organization to assist in day-to-day and long-term projects. The intern will also be given the opportunity to work on an independent project that meets his or her own interests as well as those of DQC. This internship is an opportunity to gain knowledge and experience in local, state, and federal education policy. Interns in this position should expect to develop their communication, organizational, and leadership skills, as well as obtain experience in a remote environment and gain a unique perspective in education policy, focusing on the effective use of data to improve student achievement.Essential Duties and Responsibilities·        Engaging in DQC’s communications activities such as completing various tasks for publications, website, Twitter, YouTube, Facebook, LinkedIn, and other platforms, as well as maintaining and enhancing DQC’s listserv contacts through Mailchimp and DQC’s media contacts through Meltwater.·        Conducting research regarding education data policy, state policy and related initiatives, and state and federal legislative research.·        Supporting the execution of DQC-hosted meetings and events.·        Attending virtual events on behalf of DQC and briefing team members afterward.·        Summarizing relevant policy reports and other publications.·        Populating and updating internal tracking tools that monitor publications, media, and presentations.·        Other work as assigned.Requirements & QualificationsThe ideal candidate has: ·        Completed an undergraduate degree and is working toward completion of a graduate degree in education, public policy, political science, or a related field.·        Excellent writing and communication skills.·        Effective time-management skills.·        The ability to handle multiple short-term projects in a fast-paced environment.·        A team-oriented work style.·        A passion for education.·        Relevant internships or work experience (preferred).Time CommitmentDQC is seeking part-time candidates able to work 20 hours a week remote for eight weeks (September 28, 2020 – November 20, 2020). There may be some flexibility in these dates.Due to COVID-19 and the understanding that DQC staff may still be teleworking during this time, this will be a remote position, though priority will be given to DC-based candidates. Coordination and communication with DQC staff will take place primarily through telecommunication platforms, requiring the intern to have a personal computer and an internet connection."
    },
    {
        "position": "Grant Writing Intern",
        "company": "ioi strategic design",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2018-05-23T02:25:06.402Z",
        "url": "https://www.idealist.org/en/consultant-internship/3db595f4db2e4355aa8e0e9153817b75-grant-writing-intern-ioi-strategic-design-new-york",
        "lastScraped": "2020-09-09T02:25:06.409Z",
        "description": "About us:Farms Not Arms is a collective of designers, farmers, strategists, & agriculturalists who have come together to build an integrated, multi-agricultural educational farm model for underserved communities that heals our lands, our health, and our communities. Our first project is based in Bekaa, Lebanon with Syrian refugees and Lebanese host communities and targets food security, climate change, and social cohesion. We designed a highly efficient farm model that combines regenerative agriculture with low-tech hydroponics to produce 3.5 times the amount of food in any given area and acts as an education community center for participants to learn all those agricultural skillsets. You can learn more at www.designfarmsnotarms.org We were selected as one of the top 14 nourishing and regenerative design in a global food system vision prize where we received funding and are looking to apply to more grants for further fundraising. Job description:Intern will mainly assist in researching and identifying grants around food security, agriculture, regeneration, refugees and other topics under the mission of Farms Not Arms and other related possible funding options as well as writing and drafting grant applications.Task & Responsibilities:Conducting research on most relevant grants, donors and funding models.Assessing Foundations, Donors, and Corporate Social Responsibility programs Evaluating prospective donors/financing options to see if they are compatible which may include researching past recipients of grants to further establish feasibility of applying for the grant.Collecting all necessary information needed to apply for the grant.Drafting grant proposals.Working with the managing director to write and finalize grant applications.Qualifications: Ideal Candidate is an undergrad or graduate student majoring in International Affairs, Political Sciences,Communications, English or a relevant social science degree.Skills required:Excellent research and analysis skillsStrong written and oral English communication skillsFundraising and database management experience is helpful A variety of computer skills including MS Word and ExcelSelf-starter, able to take initiative and complete assignments without constant supervisionAble to work collaboratively in a team-based, project-oriented environmentDetail-oriented, hardworking, creative, able to think independently"
    }
]