[
    {
        "position": "Computer Scientist",
        "company": "General Dynamics Information Technology",
        "location": {
            "city": "San Diego",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6e7afd531862d6ebf8b7ce4e9d1175df?lvk=3OzLHLojCWy4gjT_Yann8Q.--Lk6TxnhkZ",
        "posted": "2020-10-02T01:03:58.664Z",
        "lastScraped": "2020-10-02T01:03:58.664Z",
        "description": "<div><p><strong>Type of Requisition:</strong> Regular <strong>Clearance Level Must Be Able to Obtain:</strong> Secret <strong>Public Trust/Other Required:</strong> None <strong>Job Family:</strong> Systems Engineering General Dynamics Information Technology (GDIT) has an opportunity for a Computer Scientist working within the Defense Division, supporting an exciting new program at San Diego, CA. <strong>Roles and Responsibilities</strong> + Acts as a senior consultant in complex or mission critical client requirements + Develops, modifies, and applies computer modeling and programming applications to analyze and solve mathematical and scientific problems affecting system and program performance + Participates in all phases of scientific and engineering projects such as research, design, development, testing, modeling, simulating, training, and documentation + Prepares and maintains all documentation for processes and procedures related to engineering projects + May serve as a team or task leader. (Not a people manager) DESIRED QUALIFICATIONS: BA/BS (or equivalent experience), 10+ years of experience <strong>Preferred Qualifications and Experience</strong> + Master's degree in mathematics, science, or electronics engineering from an accredited College or University, eight (8) years of experience in systems and software development, acquisition and network designs; OR Bachelor's degree in mathematics, science, or electronics engineering from an accredited College or University and eight (10) years of experience in systems and software development, acquisition and network designs will be considered to be equivalent to the Master's degree qualification + Eight (8) years of experience in systems and software development, acquisition and network designs + An aggregate of six (6) years of experience in communications or messaging systems + Six (6) years of experience in TCP/IP, and software programming in Navy/Joint communications, messaging, network related environments + SECRET clearance required. </p><p>TS/SCI eligible null We are GDIT. The people supporting some of the most complex government, defense, and intelligence projects across the country. We deliver. </p><p>Bringing the expertise needed to understand and advance critical missions. We transform. Shifting the ways clients invest in, integrate, and innovate technology solutions. </p><p>We ensure today is safe and tomorrow is smarter. We are there. On the ground, beside our clients, in the lab, and everywhere in between. </p><p>Offering the technology transformations, strategy, and mission services needed to get the job done.GDIT is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.</p></div>"
    },
    {
        "position": "Computer Scientist-Vision & Robotics lab (Navigation)",
        "company": "SRI International",
        "location": {
            "city": "Menlo Park",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c97080ca92bef9a0613351fdf3b1170e?lvk=4jypijum0p3R6rHlDndwPw.--LkWpoyUhJ",
        "posted": "2020-10-02T01:04:01.142Z",
        "lastScraped": "2020-10-02T01:04:01.142Z",
        "description": "<div><p><strong>2568BR</strong> <strong>Title:</strong> Computer Scientist-Vision &amp; Robotics lab (Navigation) <strong>Job Description:</strong> SRI International creates world-changing solutions to make people safer, healthier, and more productive. SRI's Center for Vision Technologies (CVT) at Princeton, NJ offers end-to-end vision solutions that translate into real-world applications. Our Center is a leader in computer vision solutions for defense, security, and the training marketplace. </p><p>Our scientists pioneered real-time, real-world computer vision with the early development of pyramid/wavelet processing that enabled analysis with unprecedented speed and precision. They continue today with a broad array of advances in visual navigation, 3D scene modeling, and object and activity recognition. The Vision &amp; Robotics Lab in CVT is currently searching for a Computer Scientist to work on projects that aim to create next generation scene understanding and navigation technologies, with applications to autonomous robots and augmented reality. </p><p> You will also help develop algorithms, software and applications in areas such as Multi-Modal Target Detection or Classification, Visual Localization, and Geo-Search and Registration. Additional Responsibilities of the position include: + Ability to provide innovative algorithms with high-quality implementation skills. + Work effectively in a team to achieve the goals of projects and deliver software and systems to external clients. </p><p><strong>Auto req ID:</strong> 2568BR <strong>Location(s):</strong> Menlo Park, CA, Princeton, NJ <strong>Other Requirements:</strong> --In order to accommodate potential project work, a preference for this position is U.S. Permanent Resident status. <strong>Employment Status:</strong> Full Time <strong>Qualifications:</strong> + PhD or Masters in Computer Science, Electrical Engineering, or related fields. </p><p>Emerging talent welcome to apply! + Experience with implementing Deep Learning algorithms for computer vision or robotics applications is required. + Experience in at least one of the following areas: Multi-Modal Fusion, Deep Reinforcement Learning, Lifelong Learning, Object Detection and Classification, Semantic Segmentation, Depth Estimation, 3D Mapping and Modeling, and Motion Estimation. </p><p> + Experience with real-time systems is considered a plus. Desired Qualifications: + Due to government project requirements, the preference for this position is US citizen or US permanent resident. <strong>EOE/AA:</strong> SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. </p><p><strong>Background Check:</strong> Candidates who receive a conditional offer of employment will be subject to a background check.</p></div>"
    },
    {
        "position": "Computer Scientist II",
        "company": "Tellus Solutions",
        "location": {
            "city": "Mountain View",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/tellus-solutions-ff2b2bdd/computer-scientist-ii-d929be91?lvk=g7ufuduBLdXXDgZ29ql-tA.--LkcsIpO4N",
        "posted": "2020-10-02T01:04:03.867Z",
        "lastScraped": "2020-10-02T01:04:03.867Z",
        "description": "<div><strong>Job Title: Lunar Rover ROS2 Engineer </strong><br><br>Exploring the next frontier both figuratively and literally. <strong>Tellus Solutions</strong> has partnered with a client who is eager to Client and explore some uncharted territory, known for breaking barriers and creating unforgettable moments in history and we are looking for <strong>Lunar Rover ROS2 Engineer .</strong> Your technical skills or expertise in the field of<strong> ROS2</strong> will contribute to our efforts and forever impact future explorations.<br><br><strong>Job Description:</strong><ul><li>The VIPER project is creating ground software for rover navigation (localization and path planning) as well as a high fidelity Lunar simulation to support development of the flight software and mission operations training.</li><li>The ground software and simulation both leverage ROS2 (Robot Operating System), and we need someone with ROS expertise to help implement this technology in support of a flight mission.</li></ul><br><strong>Responsibilities include (but not limited to):</strong><ul><li>Apply ROS2 best practices to Rover Software codebase</li><li>Track ROS2 API changes and update deprecated ROS2 APIs in Rover Software codebase</li><li>Maintain colcon/ament build system and track ament development</li><li>Identify ROS2 issues that are blockers for Rover Software and implement solutions</li><li>Work with OSRF and ROS2 community to ensure changes needed by Rover Software are accepted upstream</li><li>Assist conversion of ROS1 code to ROS2</li></ul><br><strong>Required Skills &amp; Traits:</strong><ul><li>B.S. in Computer Science or Robotics</li><li>2 + years of experience</li><li>Strong experience with ROS2, ROS1 and DDS</li><li>Strong background in robotics and/or distributed systems</li><li>Strong background in developing high-performance software, particularly with C++11, Python 3 and GNU tools under Linux</li></ul><br><strong>Other Desired Skills:</strong><ul><li>Mobile robot navigation</li><li>Agile development</li></ul></div>"
    },
    {
        "position": "Computer Scientists",
        "company": "Catch Talent",
        "location": {
            "city": "Springfield",
            "state": "VA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/catch-talent-69e98a12/computer-scientists-1dc85a30?lvk=VioJnUwfS7CtBdDtHo1R5A.--LkdJ5Zcy3",
        "posted": "2020-10-02T01:04:06.326Z",
        "lastScraped": "2020-10-02T01:04:06.326Z",
        "description": "<div><div><br><br>Here are the locations, clearance needed, and target salaries. Each candidate will get a CI Poly after starting, some locations require one in the door given the facility. If we find only a TS/SCI in CO or NM – we may be able to get creative with getting them a Poly.<br><br> Springfield, VA<br> TS/SCI<br><br> St. Louis, MO<br> TS/SCI<br><br> Ft. Meade, MD<br> TS/SCI<br><br> Las Cruces, NM<br> TS/SCI CI POLY<br><br> Denver, CO<br> TS/SCI CI POLY<br><br><div>Job Title Computer Scientist <br>Location Springfield, VA Other Location St. Louis, MO; Ft. Meade, MD; Denver, CO; Las Cruces, NM Description <br><strong>Required Security Clearance</strong>: TS/SCI (ability to obtain poly)<br><strong>Required Education and Experience</strong>: 9 years of experience and a MA/MS degree. In place of the degree, may substitute 19 years of relevant work experience.<br><strong>Functional Responsibility:</strong><br> Our client is in need of a Computer Scientist to support Data Center Systems and serve as the liaison between the data center and Research Labs Environment Support Team. Candidate will be very hands-on technical with primary responsibilities for the compute, storage, and LAN of the Data Center. Other responsibilities include mitigating equipment failures in order to provide constant compute and data systems availability, integration of new infrastructure equipment in order to retire legacy systems that have no maintenance agreement, and migration of customer data from legacy systems to new storage. In summary, this person would ensure Research data center infrastructure health is maintained.<br><strong>Qualifications:</strong><br><ul><li>Experience in the following: <ul><li>Linux &amp; Windows system engineering</li><li>Patching</li><li>VMware administration</li><li>HPC administration</li><li>OS Security </li></ul></li></ul><strong>Preferences:</strong><br><ul><li>Database Administration and cloud engineering experience</li><li>CompTIA Security+ CE certification desired.</li></ul><div><br> Continuation of NGA-R tasks and responsibilities as described below:<br><ul><li>Designing and implementing PostgreSQL Databases: <ul><li>Developing SQL and PLPGSQL procedures for reporting, triggersand constraints.</li><li>Partitioning Tables for improved query performance.</li><li>Tuning PostGIS Tables for Time Dimensioned GeoServer Layers</li></ul></li><li>Coding algorithms in Python, bash shell scripts, and occasionally C, for Linux environment. <ul><li>Parsing HDF5 documents to harvest metadata.</li><li>Processing and inserting data output from algorithms intoPostgreSQL Databases.</li></ul></li><li>Dockerizing algorithms, both self-developed and industry provided, testing Containers from the command line, building Docker Images and pushing them to Registries.</li><li>Creating and managing GeoServer Layers from both Vector and Raster Stores.</li><li>Monitoring, starting and stopping Mesos DC/OS services and Frameworks: <ul><li>For multiple GeoServer nodes.</li><li>For multiple instances of SCALE.</li></ul></li><li>AWS <ul><li>Connecting to S3 Buckets and copying files into and out of them.</li><li>Managing and tuning RDS PostgreSQL/PostGIS instances.</li></ul></li></ul></div></div></div></div>"
    },
    {
        "position": "Bioinformatician, Department of Computer Science (Wheeler Lab)",
        "company": "University of Montana",
        "location": {
            "city": "Missoula",
            "state": "MT",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/bb2260975895e9ef377cd4ae090779f2?lvk=qt0H18UyD7wchxQ71z_-tQ.--LjdCJXUQ-",
        "posted": "2020-08-31T01:04:08.645Z",
        "lastScraped": "2020-10-02T01:04:08.645Z",
        "description": "<div><div><p></p><p>&nbsp;</p><p>The Wheeler Lab at the University of Montana, Missoula invites applications for a Bioinformatician (Software Scientist). The position is supported in part by a newly-funded grant to develop methods for improving annotation of soil microbiome genomic and metabolomic data. The successful applicant will join a research group that includes 9 graduate researchers and two staff software engineers. The role of this position is primarily focused on the analysis of genomic and metabolomic data from (soil) microbiome datasets, and on the &nbsp;&nbsp;&nbsp;&nbsp;development, testing, and application of software/pipelines in support of that analysis. The successful candidate will also partner in development of junior researchers in the Wheeler lab.</p><p>&nbsp;</p><p>Projects in the Wheeler lab are broad, ranging from statistical modeling of biological sequence families, algorithm design, to low-level software optimization, to FPGAs, to Deep Neural Networks, to Natural Language Processing, to web services; from genomes, to proteins, to infectious disease, to drug discovery, to animal behavior in videos.</p><p>&nbsp;</p><p>We seek applicants who value people, teamwork, trust, integrity, and excellence. For further information on this position and our research, please contact Dr. Wheeler directly at&nbsp;<span class=\"long-word\">travis.wheeler@umontana.edu.</span>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>The University of Montana is an Affirmative Action/Equal Opportunity employer and has a strong institutional commitment to the principle of diversity in all areas. In that spirit, we are particularly interested in receiving applications from a broad spectrum of qualified people who would assist the University in demonstrating its five&nbsp;<strong>priorities for action</strong>: Place student success at the center of all we do; drive excellence and innovation in teaching, learning, and research; embody the principle of “mission first, people always\"; partner with place; and proudly tell the UM story.</p><p>&nbsp;</p><p>&nbsp;</p><strong>Position Details</strong><ul><li>Position is full-time, 1.0 FTE, Letter of Appointment and includes a comprehensive and competitive&nbsp;benefits package including Insurance package, mandatory retirement plan, partial tuition waiver, and wellness program.</li><li>Salary for this position is $50,000 - $65,000 per year commensurate with qualifications.</li></ul><p>&nbsp;</p><p>&nbsp;</p><strong>Required qualifications</strong><ul><li>Master’s degree in computational biology, bioinformatics, computer science, genomics, or related field; and two (2) years of genomics research experience or experience developing software for genomics analysis.</li></ul><p><em><strong>&nbsp;</strong></em></p><p>&nbsp;</p><strong>Preferred Qualifications</strong><ul><li>Prior professional or academic experience developing software to analyze genomic sequence data.</li><li>PhD in a relevant field.</li><li>Experience with Python, software validation, Unix, cluster computing environments, sequence annotation software tools, and data visualization.</li><li>Ability to effectively collaborate with technical leadership and end-users, as well as mentoring of junior researchers.</li></ul><p>&nbsp;</p><p>&nbsp;</p><strong>About the Department of Computer Science,&nbsp;</strong><strong>UM</strong><strong>&nbsp;</strong><strong>and Missoula</strong><p>The&nbsp;Wheeler lab&nbsp;designs algorithms and statistical methods for sequence analysis in computational genomics, and develops high-quality implementations of those methods for incorporation into highly-used software pipelines and web services. We are particularly focused on the alignment of biological sequences and the accompanying problem of searching for similar sequences within large-scale biological sequence databases.&nbsp;The Wheeler lab is home to a diverse and highly interactive group of researchers.</p><p>&nbsp;</p><p>The lab is located in the&nbsp;Computer Science&nbsp;Department at the&nbsp;University of Montana, and is closely affiliated with the&nbsp;Division of Biological Sciences.&nbsp;The Computer Science Department dedicates itself and its resources to the growing utility of computers in research and education, as well as the increased impact of computers on our modern society. Our primary mission is to offer degrees (major, minor, graduate) for students who want to pursue a career in this discipline. Primary objectives of our curriculum include: 1) develop professionally competent and broadly educated computer scientists who wish to pursue professional careers or graduate studies; 2) mentor students and provide them with opportunities to engage in CS research; and 3) teach students how to think computationally and engage in problem solving and critical analysis.</p><p>&nbsp;</p><p>The University of Montana is a unit of the Montana University System with over 10,000 students. It is located in Missoula, a culturally vibrant community of about 72,000, surrounded by mountain grandeur which was recently ranked in the “top 20 best college towns with a population of less than 250,000” by the American Institute for Economic Research and ranked 9th in Outside Magazine’s “The 16 Greatest Places to Live in America” in 2014. Many national publications recognize Missoula for its&nbsp;high quality of life. Abundant recreational opportunities in surrounding state and national forests and nearby Glacier National Park and Yellowstone National Park complement a thriving intellectual atmosphere.&nbsp; The University of Montana offers eligible employees a generous benefits package that positively separates UM from other local employers and offers many programs and policies to support work-life balance for its employees.</p><p>&nbsp;</p><p><strong>To learn more about the University of Montana, Missoula, and the State of Montana, please visit the links below.</strong></p><ul><li>University of Montana</li><ul><li>Video:&nbsp;UM Lifestyles</li><li>University Highlights</li></ul><li>City of Missoula</li><ul><li>Video:&nbsp;There's This Place</li><li>Destination Missoula</li><li>Missoula Area Chamber of Commerce</li></ul><li>The State of Montana</li><ul><li>Visit Montana</li></ul></ul><p>&nbsp;</p><p>Criminal Background Investigation is required prior to the Offer of Employment In accordance with University regulations, finalists for this position will be subject to criminal background investigations.&nbsp;<strong>ADA/EOE/AA/Veteran's Preference&nbsp;</strong>Reasonable accommodations are provided in the hiring process for persons with disabilities. For example, this material is available in alternative format upon request. As an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action employer, we encourage applications from minorities, veterans, and women. Qualified candidates may request veterans’ or disabilities preference in accordance with state law.&nbsp;<strong>References:</strong>&nbsp;References not listed on the application materials may be contacted; notice may be provided to the applicant.&nbsp;<strong>Testing:</strong>&nbsp;Individual hiring departments at UM may elect to administer pre-employment tests, which are relevant to essential job functions.&nbsp;<strong>Employment Eligibility:</strong>&nbsp;All New Employees must be eligible and show employment eligibility verification by the first date of employment at UM, as legally required (e.g., Form I-9).</p><hr><p>&nbsp;</p><p>&nbsp;</p><strong>How to Apply</strong><p>&nbsp;</p><p><strong>Priority Application Date:&nbsp;Monday</strong><strong>, October 5, 2020</strong>&nbsp;<em>by 11:59 PM (Mountain Time)</em></p><p>Complete applications received by the ‘Priority Application Date’ will be guaranteed consideration. The position will remain open until filled. Candidates are required to submit the following materials online via \"New Resume/CV\" button below.</p><p>&nbsp;</p><p><strong>A complete application Includes:</strong></p><p>&nbsp;</p><ol><li><strong>Letter of Interest</strong>&nbsp;– addressing your qualifications and experience related to the stated required skills for the position.</li><li><strong>Detailed Resume</strong>&nbsp;– listing education and describing work experience.</li><li><strong>Professional References</strong>&nbsp;– names and contact information for three&nbsp;(3) professional references.</li></ol><p>&nbsp;</p><p>Need additional help? Check out our&nbsp;UM Jobs FAQ website.</p><p>&nbsp;</p><p>&nbsp;</p><br><br>Required Skills<br><br>Required Experience<br></div></div>"
    },
    {
        "position": "Java Developer",
        "company": "VMD Corp",
        "location": {
            "city": "Camp HM Smith",
            "state": "HI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/vmd-corp-1eb3a6bd/java-developer-f30627c0?lvk=oWpwO6TypOBSb7KrL1lCBw.--LkbSVxd4c",
        "posted": "2020-10-02T01:04:12.355Z",
        "lastScraped": "2020-10-02T01:04:12.355Z",
        "description": "<div><p><strong>About the Mission You Will Join:</strong></p><p>VMD has been entrusted to support the USPACOM LOGCOP Program to provide application development for a key application supporting our nations warfighters. LOGCOP provides situational awareness to decision makers and planners within Navy, Air Force, and other branches of the military.</p><p><strong>Your Impact to the Mission:</strong></p><p>Are you an enterprising software developer with experience in Java-based applications with a real passion for code? In this <strong>Mid-Level Java Developer</strong> role, you will create and deploy new software modules and interfaces, configure, and maintain software components in an Agile software development environment. You will do this by interacting with and collaborating across a diverse project team of technical and non-technical personnel.</p><p><strong>Experience Needed to Be Successful:</strong></p><ul><li>Minimum 3 - 5 years of Java/J2EE Developer experience</li><li>Minimum 3 - 5 years' experience, and in-depth understanding of the software development life cycle</li><li>Experience with Java Application Servers or Open Source Application Servers</li><li>Experienced in building multi-tiered applications Experience with HTML5, XML, Javascript, Spring Framework and CSS</li><li>Experience troubleshooting, debugging, and testing existing software components</li><li>Conducting user acceptance testing</li><li>Excellent verbal and written communication skills</li><li>Ability to communicate technical issues to non-technical people and effectively communicate current activities</li><li>Highly motivated, detail oriented and extremely organized self-starter</li><li>Ability to establish priorities and execute to achieve results</li><li>Ability to work independently and to respond quickly to change</li><li>Strong analytical and problem-solving skills</li></ul><p><strong>Desired Qualifications and Experience:</strong></p><ul><li>3 or more years with SQL, Apache Struts, Subversion experience</li><li>3 or more years with Apache Tomcat experience</li><li>Experience with Oracle, MySQL and/or DB2 Experience with Google Mapping Services, Google Maps and Google Earth</li><li>Experience with Windows Server 2003 and 2008 and Microsoft SQL 2005 and 2008</li><li>Experience with IIS, Jboss, and WebLogic Experience with Eclipse development tools or other IDE</li><li>Experience with collaborating and working on diverse project teams from geographically separated locations</li><li>Experience with logistics automation tools, GCSS-J and NRRE-BI</li><li>Experience with USAF or other DoD IT projects</li><li>Experience with Tera Data Storage Experience with Model View Controller framework JavaServer Faces</li><li>Experience with design and developing 3-tier web applications</li><li>Experience with development tools ANT &amp; Maven Skills</li></ul><p><strong>Basic Qualifiers:</strong></p><p>Education Requirement<strong>: Bachelor’s degree in Computer Science, Information Systems or related field of study</strong></p><p>Can Additional Years of Experience Substitute for Degree? <strong>No</strong></p><p>Required Certification(s): <strong>None</strong></p><p>Desired Certification(s): <strong>MCTS, Security+, or Network+</strong></p><p>Minimum Years of Overall Experience: <strong>3</strong></p><p>Minimum Years of Specific Experience in Field: <strong>3</strong></p><p>Minimum Clearance to Start: <strong>Ability to obtain DoD SECRET clearance </strong></p><p>Work Status Allowable:<strong> US Citizenship</strong></p><p><strong>The Type of Person That Will Excel:</strong></p><ul><li>You are curious, inquisitive, and have demonstrated a constant eagerness to learn through actions.</li><li>You have high attention to detail.</li><li>You demonstrate personal accountability and integrity in all actions.</li></ul><p><strong>Travel: Some (less than 25%)</strong><strong> </strong></p><p><em>VMD provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable Federal, state and local laws. VMD maintains a drug-free workplace. </em></p></div>"
    },
    {
        "position": "College Career Fair Student Interest Only - Computer Scientist I - Edwards, CA",
        "company": "Amentum",
        "location": {
            "city": "Edwards",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a98109509743f37e8499aa4df96fca8f?lvk=WrBVu94H6ZJ4XiCxUvN4rQ.--LjtiLC13w",
        "posted": "2020-10-02T01:04:14.473Z",
        "lastScraped": "2020-10-02T01:04:14.473Z",
        "description": "<div><p>JT4 provides engineering and technical support to multiple western test ranges for the U.S. Air Force and Navy under the Joint Range Technical Services Contract, better known as J-Tech II. We develop and maintain realistic integrated test and training environments, and prepare our nation's war-fighting aircraft, weapons systems, and aircrews for today's missions and tomorrow's global challenges. </p><p> **JOB SUMMARY - ESSENTIAL FUNCTIONS/DUTIES** Under general supervision, provides software and systems engineering services, typically as a member of a work unit or group: 1. Advises team and project managers on technical problems. 2. </p><p>Interacts with customers and project managers on a regular basis. 3. Uses judgment and initiative in developing analytical and computational technologies and methodologies for solving problems. </p><p> 4. Assists with the interpretation of customer requirements. Works with team members to develop the most appropriate approach to solve technical problems. </p><p> 5. Assists in the design of the system/software and the associated design documentation. Participates in design reviews. </p><p> 6. Implements the design through software coding or hardware and documents the implementation appropriately. 7. </p><p>Plans and executes unit, integration, and systems testing. 8. Assists in the maintenance and sustainment activities of the system/software. </p><p> 9. Performs other duties as assigned. **OTHER RESPONSIBILITIES** Each employee must read, understand, and implement the general and specific operational, safety, quality, and environmental requirements of all plans, procedures, and policies pertaining to their job. </p><p> **WORKING CONDITIONS** Typical office environment with no unusual hazards, occasional lifting to 20 pounds, constant sitting while using the computer terminal, constant use of sight abilities while reviewing documents, constant use of speech/hearing abilities for communication, constant mental alertness, must possess <span class=\"long-word\">planning/organizing</span> skills, and must be able to work under deadlines. **REQUIREMENTS - EDUCATION, TECHNICAL AND WORK EXPERIENCE** The incumbent must have a Bachelor's Degree in an associated discipline. Incumbent must possess effective oral and written communication skills. </p><p> Must have knowledge of computer based systems and applications. Must have programming skills in languages used for job specific programming tasks. Applicant must be familiar with systems engineering and software development lifecycles. </p><p> Must qualify for and maintain a government security clearance and possess a current state issued driver's license. Must be a US citizen. **DISCLAIMER** The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. </p><p> They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of persons so classified. Rev C</p></div>"
    },
    {
        "position": "Computer Science Tutors",
        "company": "University of San Francisco",
        "location": {
            "city": "San Francisco",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8e0a14f333bd9c3781f397841d809865?lvk=wEZtl9CRWvAucWo8ev0DRQ.--LkazTQ1NB",
        "posted": "2020-10-02T01:04:16.745Z",
        "lastScraped": "2020-10-02T01:04:16.745Z",
        "description": "<div><p><strong>Job Summary:</strong>The Department of Computer Science is looking to hire tutors for the Tutoring Center.<strong>Full Job Description:</strong>Candidates should:<i> be a junior, senior, or a graduate student</i> have served as a teaching assistant before* have strong academic performanceThe tutor will help all students with their programming assignments, homework, projects, and so on. You are expected to maintain your hours meticulously and have professional communication with all the students and professors. Please make sure to email the names of all the students who you helped every week on Friday to the Tutoring Center Director, Prof. </p><p>Vahab Pournaghshband.-<i> Posted Yesterday</i> Part time<i> R0003580</i>Job Title:<i> Computer Science Tutors</i>Full-Time/Part-Time:<i> Part time</i>Pay Rate:* Hourly</p></div>"
    }
]