[
    {
        "position": "Campus Undergraduate - 2021 American Express National Bank Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20009181?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:31.162Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "Sandy, Utah"
        },
        "description": "\n      <p style=\"font-family:Arial\">American Express National Bank (“AENB”) is American Express’ chartered national bank. Headquartered in Utah, AENB is the single largest entity within American Express’ business, currently representing more than 50 percent of the company’s Card Member Spending, nearly 90 percent of its lending and more than 60 percent its of revenues. AENB provides its customers with access to consistent payments, financing and savings products in three ways, including: </p>\n\n<ul>\n\t<li>Issuing and servicing charge and credit cards for our consumer and small business segments;&nbsp; </li>\n\t<li>Offering commercial loans to small and midsized merchants, as well as installment loans to consumers; and </li>\n\t<li>Maintaining a Personal Savings program consisting of high-yield savings accounts and certificate of deposit products.</li>\n</ul>\n\n<p style=\"font-family:Arial\">AENB is also home to <a href=\"https://square.americanexpress.com/community/aenb/center-for-community-development\">The Center for Community Development</a> (“CCD”) for American Express. The CCD is charged with the implementation and execution of the Community Reinvestment Act (“CRA”), which requires banks, like AENB, to meet community credit needs, particularly those of low- and moderate-income individuals and communities.</p>\n\n<p style=\"font-family:Arial\">We are passionate about our commitment to drive AENB’s goals of growth and progress by creating a culture of awareness and proactivity around regulatory matters, and by partnering closely with affiliates across the enterprise to ensure we deliver maximum value to our shareholders and our customers efficiently and effectively. AENB is dedicated to building diversity and inclusive leadership across all levels of the organization.</p>\n\n<p style=\"font-family:Arial\">Within AENB&nbsp;<a>the Vendor and Operational Risk team is responsible for managing AENB’s affiliate and third party vendor risk programs, leading the company’s intercompany agreement center of excellence, and executing the AENB’s operational risk framework within the 1<sup>st</sup> line of defense.</a></p>\n\n<p style=\"font-family:Arial\">This position will be based in Sandy, Utah. </p><h4>Minimum Qualifications</h4><p style=\"font-family:Arial\"><b>Required Qualifications:</b></p>\n\n<ul>\n\t<li>Inclusive mind-set and behaviors across all levels of organization</li>\n\t<li>Demonstrated experience building, sustaining and leveraging relationships </li>\n\t<li>Strong work ethic, organizational skills and attention to detail with excellent follow-up skills</li>\n\t<li>Demonstrated willingness to take initiative and act decisively</li>\n\t<li>Ability to think strategically and influence teammates on multiple, cross-functional teams</li>\n\t<li>Positive, can-do attitude embracing growth mindset</li>\n\t<li>Project management skills with the ability to prioritize and multitask</li>\n\t<li>Currently enrolled in full-time undergraduate degree program in business, economics, risk analysis or other quantitative fields&nbsp; </li>\n\t<li>Students must have a graduation date between December 2021 and June 2022</li>\n\t<li>Strong written and oral communication skills</li>\n\t<li>Ability to organize, manage, analyze, and interpret large amounts of data to identify trends and themes</li>\n\t<li>Proven ability to translate highly technical and complex information into easily understandable terms</li>\n</ul>\n\n<p style=\"font-family:Arial\"><b>Preferred Additional:</b></p>\n\n<ul>\n\t<li>Strong understanding and knowledge of core banking concepts</li>\n\t<li>Strong analytical skills; familiarity with statistical/analytical software packages a plus</li>\n\t<li>Knowledge of relevant laws and regulations relating to regulated financial institutions a plus</li>\n\t<li>Experience in a related discipline including audit, compliance, risk, regulatory management, law, marketing and product management, finance, technologies or control related functions </li>\n</ul>\n\n<div style=\"border-bottom:solid windowtext 1.0pt; padding:0in 0in 1.0pt 0in\">\n<p style=\"border:none; font-family:Arial; padding:0in\"><b>About Us</b></p>\n</div>\n\n<p style=\"font-family:Arial\">American Express’ heritage was built on service and has been sustained by innovation. Through our evolution from an express mail business in 1850, to one of the world’s largest card issuers by purchasing volume and a digital innovator, we’ve never been afraid to explore new possibilities and embrace the changing marketplace.</p>\n\n<p style=\"font-family:Arial\">From our high employee Satisfaction ratings to our many workplace awards, American Express is consistently recognized as a great place to work by people around the world. We offer talented individuals challenging work with purpose by embracing both innovation and tradition. &nbsp;As our company has grown and evolved, sometimes reinventing our business outright, we have never strayed from the customer-service ethos and values on which the company was built –trust, security, integrity, quality, good citizenship, respect and customer commitment. </p>\n\n<p style=\"font-family:Arial\">Learn more about Risk at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\" style=\"color:blue; text-decoration:underline\">https://careers.americanexpress.com/students/</a>.</p>\n\n<p style=\"font-family:Arial\"><b><u>With a job at American Express, almost anything is possible. Apply now!</u></b></p>\n\n<p style=\"font-family:Arial\">Our team will review completed applications on a rolling basis. We appreciate your patience while we consider your application and will be in contact with you by April 30<sup>th</sup>.<i> </i><br>\n<br>\nEmployment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.</p>\n\n<p style=\"font-family:Arial\">US reqs -&nbsp;<span style=\"unicode-bidi:embed\"><span style=\"word-break:normal\">USUndergrad, Handshake UNV-12520</span></span></p>\n\n<div style=\" background-color: rgb(255, 255, 255); color: rgb(0, 0, 0); font-size: 12px; font-style: normal; font-variant-caps: normal; font-variant-ligatures: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-decoration-color: initial; text-decoration-style: initial; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;\">\n<p style=\"font-family:Arial\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</p>\n</div><br>Tags: USUndergrad, Handshake UNV-12520<br>ReqID: 20009181<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Jan 19, 2021, 10:46:08 AM\n    "
    },
    {
        "position": "Campus Graduate - 2021 Global Risk Operational Risk & Oversight Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006858?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:32.621Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">The\nGlobal Risk &amp; Compliance Organization (“GRC”) ensures the company operates\nin a safe, sound and fully compliant manner within all applicable regulatory\nexpectations. We create and maintain the overall risk management framework\nwhile ensuring legal and regulatory compliance.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We\nare passionate about our commitment to drive the company’s goals of growth and\nprogress by creating a culture of awareness and proactivity around regulatory\nmatters, and by partnering closely with business units across the enterprise to\nensure we deliver maximum value to our shareholders and our customers\nefficiently and effectively. GRC is dedicated to building diversity and\ninclusive leadership across all levels of the organization.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Within\nGRC <a name=\"_Hlk15288751\">the Global Operational Risk &amp; Oversight organization\nis responsible for managing AXPs “Risk Universe” through continuous reviewing, monitoring\nand testing across American Express processes. This team strengthens AXP’s risk\nmanagement practices through the latest advances in data science and\ntechnology, staying apprised of changing regulatory landscape, and monitoring\nemerging risks across the industry. This team is responsible for overseeing\nInformation Security &amp; Technology, Business Continuity, International Banking,\nEnterprise, Operational, Credit, Market, and Model Risk across the company. The\nteam also has responsibility for GRC Board and Committee Governance and\nmanagement policy oversight.&nbsp; Risk\nOversight provides continuous updates to the AXP Chief Risk Officer, applicable\nleadership and risk committees.</a></p>\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"></p><div><b>Required Qualifications:</b></div>\n\n<ul><li>Inclusive\nmind-set and behaviors across all levels of organization</li><li>Demonstrated\nexperience building, sustaining and leveraging relationships </li><li>Strong\nwork ethic, organizational skills and attention to detail with excellent\nfollow-up skills</li><li>Demonstrated willingness to take\ninitiative and act decisively</li><li>Ability\nto think strategically and influence teammates on multiple, cross-functional\nteams</li><li>Positive,\ncan-do attitude embracing Growth Mindset</li><li>Project\nmanagement skills with the ability to prioritize and multitask</li><li>Currently\nenrolled in full-time Graduate degree program in technology, data science, risk\nanalysis or other quantitative fields </li><li>Students\nmust have a graduation date between December 2021 and June 2022</li><li>Strong\nwritten and oral communication skills</li><li>Ability\nto organize, manage, analyze, and interpret large amounts of data to identify\ntrends and themes</li><li>Proven\nability to translate highly technical and complex information into easily\nunderstandable terms</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<div><b>Preferred Skills:</b></div>\n\n<ul><li>Strong understanding and\nknowledge of bank laws and regulations, relevant compliance requirements, U.S.\nBank systems and processes as well as related governance activities</li><li>Knowledge\nof relevant regulatory compliance requirements, preferably relating to regulated\nfinancial institutions </li><li>Experience\nwith audit, compliance, risk, regulatory management, law, marketing and product\nmanagement, finance, technologies or control related functions </li><li>SAS, SQL skills </li><li>Familiarity\nwith statistical/analytical software packages</li><li>Experience with\n     Archer/SIQ </li></ul>\n\n<div>&nbsp;</div>\n\n<div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>About\nUs</b></p>\n\n</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express’ heritage was built on service and has been sustained by\ninnovation. Through our evolution from an express mail business in 1850, to one\nof the world’s largest card issuers by purchasing volume and a digital\ninnovator, we’ve never been afraid to explore new possibilities and embrace the\nchanging marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">From our high employee Satisfaction ratings to our many workplace awards,\nAmerican Express is consistently recognized as a great place to work by people\naround the world. We offer talented individuals challenging work with purpose\nby embracing both innovation and tradition. As our company has grown and\nevolved, sometimes reinventing our business outright, we have never strayed\nfrom the customer-service ethos and values on which the company was built\n–trust, security, integrity, quality, good citizenship, respect and customer\ncommitment. </p>\n\n<div>&nbsp;</div>\n\n<div>Learn more about Risk at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b><u>With a job at\nAmerican Express, almost anything is possible. Apply now!</u></b></p>\n\n<div><br></div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will review completed applications on a rolling basis. We\nappreciate your patience while we consider your application and will be in\ncontact with you by April 30<sup>th</sup>.\n<i><br>\n</i><br>\nDepending on\nfactors such as business unit requirements, the nature of the position, cost\nand applicable laws, American Express may provide visa sponsorship for certain\npositions.</p><p style=\"margin-top:0px;margin-bottom:0px\"></p><div style=\"color: rgb(0, 0, 0); font-family: arial, &quot;times new roman&quot;, verdana, sans-serif; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;  text-decoration-style: initial; text-decoration-color: initial; background-color: rgb(255, 255, 255);\"><br></div><div style=\"color: rgb(0, 0, 0); font-family: arial, &quot;times new roman&quot;, verdana, sans-serif; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;  text-decoration-style: initial; text-decoration-color: initial; background-color: rgb(255, 255, 255);\"><p style=\"margin-top: 0px; margin-bottom: 0px;color:#2F5496;\"><b>American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</b></p></div><br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006858<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 28, 2020, 10:26:05 AM\n    "
    },
    {
        "position": "Campus Undergraduate - 2021 Associate Product Owner Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006495?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:34.437Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">Become part of the digital transformation and\nhelp revolutionize the financial services industry.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">At American Express, we provide customers with\naccess to products, insights and experiences that enrich lives and build\nbusiness success. Our customers include our Cardmembers as well as the small\nbusinesses, merchants, corporations, and bank partners that are all members of\nthe dynamic American Express network. As a Product intern, you have the\nopportunity to make your mark on technology and life at American Express.\nYou’ll be challenged every day as we build products to meet the customers of\ntomorrow.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The Product internship at American Express is an\nexciting opportunity for someone who wants to help shape experiences for one of\nthe world’s top brands. We seek a thought-leader and a problem-solver who can\nblend business, technical, and industry best practices – sweating every fine\ndetail when it comes to developing the most effective technology led solutions\nto improve our customer’s experiences.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do at\nAmerican Express?</b></p>\n\n<div>&nbsp;</div>\n\n<ul><li>Be responsible for the development and execution of new and\nemerging products, services and/or technology platforms, following a User\nCentered Design approach</li><li>Manage projects from concept through production partnering with the\nnecessary teams to shape a rich and engaging customer experience</li><li>Be a\npassionate advocate for the customer, grounding ideas in data driven solutions\nby partnering with our customer research team to incorporate user insights and\nprinciples throughout the process</li><li>Assist\nin the Agile product development process including writing user stories,\ndefining support documents, and conducting usability testing</li><li>Collaborate\nwith internal and external partners and as part of a cross-functional team</li></ul>\n\n\n\n\n\n\n\n\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b>We have the know-how, creative platform and\nglobal reach to make nearly any idea a reality. Do these describe you?</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<div><b><u>Skills/Experience</u></b></div>\n\n<ul><li>Proven\ninterest in technologies and customer-driven design</li><li>Independent\nthinker who’s organized, has great attention to detail, and can multi-task</li><li>Strong\nanalytical, problem-solving/quantitative skills</li><li>Willing\nto take risks, experiment, and share fresh perspectives</li><li>Proficient\nin analytical and presentation tools, including Excel and PowerPoint</li><li>Excellent\nwritten and verbal communication skills, and ability to present ideas clearly</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b><u>Educational\nRequirements</u></b></p>\n\n<ul><li>Currently enrolled in full-time undergraduate degree program</li><li>Students must have a graduation date between December 2021 and\nJune 2022</li></ul>\n\n<div><b>Why American Express?</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a difference between having\na job and making a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express has been making a\ndifference in people’s lives for over 160 years, backing them in moments big\nand small, granting access, tools, and resources to take on their biggest\nchallenges and reap the greatest rewards. We’ve also made a difference in the\nlives of our people, providing a culture of learning and collaboration, and\nhelping them with what they need to succeed and thrive. <a name=\"_Hlk29297924\">W\ne’re right there with them, giving them the guidance and momentum into the best\nfuture they envision.</a></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we\nbelieve that the best way to back our customers is to back our people.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The powerful\nbacking of American Express.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Don’t make a\ndifference without it.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Don’t live life\nwithout it.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Learn more about\nour groups at American Express by visiting: <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a>.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>With a job at\nAmerican Express, almost anything is possible. Apply now!</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will\nreview completed applications on a rolling basis. We appreciate your patience\nwhile we consider your application.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Employment\neligibility to work with American Express in the U.S. is required as the\ncompany will not pursue visa sponsorship for these positions.</p>\n\n<div>&nbsp;</div><div><div>\n\n</div>\n\n</div>\n<br><br>Tags: Handshake UNV-12520, CFE-12801<br>ReqID: 20006495<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Oct  2, 2020, 12:07:35 PM\n    "
    },
    {
        "position": "Campus Graduate - 2021 Global Risk & Compliance Summer Internship (Compliance and Regulatory Exam Lifecycle Management)",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006855?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:36.767Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">The\nGlobal Risk &amp; Compliance Organization (“GRC”) ensures the company operates\nin a safe, sound and fully compliant manner within all applicable regulatory\nexpectations. We create and maintain the overall risk management framework\nwhile ensuring legal and regulatory compliance.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We\nare passionate about our commitment to drive the company’s goals of growth and\nprogress by creating a culture of awareness and proactivity around regulatory\nmatters, and by partnering closely with business units across the enterprise to\nensure we deliver maximum value to our shareholders and our customers\nefficiently and effectively.</p>\n\n<div>&nbsp;</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Global\nRisk and Compliance is comprised of four organizations.</p>\n\n<ul><li><a name=\"_Hlk15288751\"><b>Risk:</b></a> The Global Operational Risk &amp; Oversight organization\nis responsible for managing AXPs “Risk Universe” through continuous reviewing, monitoring\nand testing across American Express processes. This team strengthens AXP’s risk\nmanagement practices through the latest advances in data science and\ntechnology, staying apprised of changing regulatory landscape, and monitoring\nemerging risks across the industry. This team is responsible for overseeing\nEnterprise, Operational, Credit, Market, and Model Risk across the company and\nprovides continuous updates to the AXP Chief Risk Officer.</li></ul>\n\n<ul><li><b>Compliance:</b> The Global Compliance and Ethics organization plays a critical role\nin protecting the company, our brand and colleagues through practical,\nsolution-focused guidance on regulatory and ethics-related matters. A team of compliance officers work closely with the&nbsp;<a href=\"https://square.americanexpress.com/community/gco\">General Counsel's\nOffice</a>, business units, staff groups, and\nrisk professionals across the company to provide standards and guidance in the\ndevelopment, implementation and maintenance of comprehensive compliance\nprograms and to promote a strong risk management culture.</li></ul>\n\n<ul><li><b>Regulatory Exam\nLifecycle Management:</b> The Regulatory Exam Lifecycle Management team consists of strategic\npartners and a resource for our banks and the many business units at American\nExpress that are implicated in regulatory oversight as they respond to exams\nand remediation. The team is responsible for managing American Express’\nend-to-end lifecycle of exams and the remediation of both regulatory and\nself-identified risk management issues, including internally-driven gap\nassessments.</li></ul>\n\n<ul><li><b>Privacy: </b>The Global Privacy Team is responsible for providing strategic guidance,\nprinciples and advice to manage privacy risks.&nbsp;The team focuses on driving\nand maintaining trust in the American Express brand through the creation of\nindependent risk frameworks, policies and practices that ultimately protect our\ncustomers’ personal information while driving transparency and fairness in how\nthe company uses data</li></ul>\n\n\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Roles will be in Compliance, Privacy and Regulatory Exam\nLifecycle Management.</p><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"></p><div><b>Required Qualifications:</b></div>\n\n<ul><li>Demonstrated\nexperience building, sustaining and leveraging relationships </li><li>Strong\nwork ethic, organizational skills and attention to detail with excellent\nfollow-up skills</li><li>Demonstrated willingness\nto take initiative and act decisively</li><li>Ability to think strategically\nand influence teammates on multiple, cross-functional teams</li><li>Positive, can-do attitude\nembracing Growth Mindset</li><li>Project management skills\nwith the ability to prioritize and multitask</li><li>Currently enrolled in\nfull-time Graduate degree program</li><li>Students must have a\ngraduation date between December 2021 and June 2022</li><li>Strong\nwritten and oral communication skills</li><li>Ability\nto organize, manage, analyze, and interpret large amounts of data to identify\ntrends and themes</li><li>Proven\nability to translate highly technical and complex information into easily\nunderstandable terms</li><li>Superior\nMicrosoft Office skills with emphasis on Excel and PowerPoint</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<div><b>Preferred Additional:</b></div>\n\n<ul><li>Strong understanding and\nknowledge of bank laws and regulations, relevant compliance requirements, U.S.\nBank systems and processes as well as related governance activities</li><li>Knowledge\nof relevant regulatory compliance requirements, preferably relating to regulated\nfinancial institutions and / or consumer products and AML/ Anti-Corruption/BSA</li><li>Experience\nwith audit, compliance, risk, regulatory management, law, marketing and product\nmanagement, finance, technologies or control related functions </li></ul>\n\n\n\n\n\n<div>&nbsp;</div>\n\n<div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>About\nUs</b></p>\n\n</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express’ heritage was built on service and has been sustained by\ninnovation. Through our evolution from an express mail business in 1850, to one\nof the world’s largest card issuers by purchasing volume and a digital\ninnovator, we’ve never been afraid to explore new possibilities and embrace the\nchanging marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">From our high employee Satisfaction ratings to our many workplace awards,\nAmerican Express is consistently recognized as a great place to work by people\naround the world. We offer talented individuals challenging work with purpose\nby embracing both innovation and tradition. &nbsp;As our company has grown and\nevolved, sometimes reinventing our business outright, we have never strayed\nfrom the customer-service ethos and values on which the company was built\n–trust, security, integrity, quality, good citizenship, respect and customer\ncommitment. </p>\n\n<div>&nbsp;</div>\n\n<div>Learn more about Risk at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b><u>With a job at\nAmerican Express, almost anything is possible. Apply now!</u></b></p>\n\n<div>&nbsp;</div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will review completed applications on a rolling basis. We\nappreciate your patience while we consider your application and will be in\ncontact with you by April 30<sup>th</sup>.\n</p>\n\n<div><i>&nbsp;</i></div>\n\nEmployment\neligibility to work with American Express in the U.S. is required as the\ncompany will not pursue visa sponsorship for these positions.<p style=\"margin-top:0px;margin-bottom:0px\"></p><div style=\"color: rgb(0, 0, 0); font-family: arial, &quot;times new roman&quot;, verdana, sans-serif; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;  text-decoration-style: initial; text-decoration-color: initial; background-color: rgb(255, 255, 255);\"><br></div><div style=\"color: rgb(0, 0, 0); font-family: arial, &quot;times new roman&quot;, verdana, sans-serif; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;  text-decoration-style: initial; text-decoration-color: initial; background-color: rgb(255, 255, 255);\"><p style=\"margin-top: 0px; margin-bottom: 0px;color:#2F5496;\"><b>American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</b></p></div><br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006855<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 23, 2020,  4:26:43 PM\n    "
    },
    {
        "position": "Campus Graduate - 2021 Amex Strategy Senior Manager Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006554?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:38.123Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\"><i>How should\nAmerican Express continue innovating and remain a global leader in the dynamic\nPayments and FinTech industries? </i></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Our team is at the forefront of\npioneering growth.</i></p><p style=\"margin-top:0px;margin-bottom:0px\"><i><br></i></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>About\nAmex Strategy</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Amex\nStrategy (Strategic Planning Group) is the Company’s enterprise strategy and\ninternal consulting division. Amex Strategy serves as a key partner to senior leaders,\nthe executive team, and the CEO, providing thought leadership and an external\nperspective on the most critical strategic initiatives for the Company.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><a name=\"_Hlk46309609\">A Senior Manager role with Amex\nStrategy offers unparalleled exposure to senior leadership and the unique\nopportunity to work across all business lines – while developing strategy and\nleadership skills through individualized coaching and a formal training\ncurriculum. As a member of Amex Strategy, you will be part of a small project\nteam working on the Company’s toughest challenges and biggest opportunities\nwhile seeing first-hand how the impact of your solutions shapes the Company’s\ngrowth. </a>You\nwill work on a broad range of projects while collaborating with diverse and\ntalented colleagues as a close-knit team and broader Company.</p>\n\n\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Amex Strategy also serves as a talent-pipeline\nfor future leaders at American Express. We host and encourage frequent\nnetworking with our team’s expansive alumni network, featuring many senior\nexecutives that began their careers in the Amex Strategy team. </p><p style=\"margin-top:0px;margin-bottom:0px\"><br></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What can you expect as a Summer Intern Senior Manager in Amex\nStrategy?</b></p>\n\n<ul><li>Own project workstreams end-to-end –\nfrom scoping, problem structuring, analysis, research and presentations</li><li>Lead complex analyses and rigorous\nresearch to develop insights and solutions for the Company’s most critical\nstrategic priorities</li><li>Engage business unit leaders and company\nexecutives to develop and present implementable solutions, and provide thought\npartnership and strategic counsel</li><li>Build\na strong network and a deeper understanding of the Company through project work\nand networking events with senior leaders</li><li>Enjoy team-wide social events, trainings,\nand lunches</li></ul><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b>Here are the skills and experiences we are looking for. Do these\ndescribe you?</b></p>\n\n<ul><li>Strong problem-solving abilities and\nquantitative aptitude; intellectual curiosity</li><li>Ability to drive change, impact, and\nbe adaptable to a wide range of situations</li><li>Excellent interpersonal skills –\nability to collaborate effectively in a team</li><li>Strong executive presence; effective\ncommunication and presentation skills</li><li>A track record of results and desire\nfor continual improvement</li><li>1<sup>st</sup> year in a full-time\nMBA program or equivalent </li><li>Students\n     must have a graduation date between December 2021 and June 2022</li></ul>\n\n<div><b style=\"font-size: 12pt;\">About American Express</b></div>\n\n<div>Why American Express?</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a difference between having a job and making a\ndifference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express has been making a difference in people’s\nlives for over 160 years, backing them in moments big and small, granting\naccess, tools, and resources to take on their biggest challenges and reap the greatest\nrewards.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’ve also made a difference in the lives of our people,\nproviding a culture of learning and collaboration, and helping them with what\nthey need to succeed and thrive. We have their backs as they grow their skills,\nconquer new challenges, or even take time to spend with their family or\ncommunity. And when they’re ready to take on a new career path, we’re right\nthere with them, giving them the guidance and momentum into the best future\nthey envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we believe that the best way to back our customers\nis to back our people.</p>\n\n<div>&nbsp;</div>\n\n<div>The powerful backing of American Express.</div>\n\n<div>Don’t make a difference without it.</div>\n\n<div>Don’t live life without it.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b><u>With a\njob at American Express, almost anything is possible. Apply now!</u></b></p>\n\n\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><br></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>A cover\nletter, answering why you are interested in Amex Strategy, is required. When\nsubmitting your application via the American Express Careers site please be\nsure to upload your cover letter and resume as a PDF attachment. </b></p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Cover\nletters entered as text will not be considered as part of the application.</b></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will review completed applications on a rolling\nbasis. We appreciate your patience while we consider your application and will\nbe in contact with you by April 30<sup>th</sup>. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Depending on factors such as business unit requirements,\nthe nature of the position, cost and applicable laws, American Express may\nprovide visa sponsorship for certain positions.<br>\n</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><br></p><br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006554<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep  7, 2020,  6:16:09 PM\n    "
    },
    {
        "position": "Campus Recruitment- 2021 Technology Software Engineer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006515?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:40.167Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">American\nExpress is going through an exciting time of change. This diverse and creative</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">organization\nhas the power to shape our technology and product roadmap. If you</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">have\nan interest in improving your skills in a tech environment while meeting\ninnovative</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">problem\nsolvers and serving our customers across physical and digital spaces, come and</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">join\nour team!</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Interns\nwill work building global scale software with a host of tools and frameworks. Internship\nproject areas range from Machine Learning to Big Data to Mobile to AppDev to\nArtificial Intelligence. You’ll work across our software products, like Spring\nCloud and Webflux for reactive Java services, or Node.js driving React web\napplications and even polyglot microservices. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’re\noften experimenting with new technology; it’s all about picking the right tool\nfor the right job!</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We\nare looking for Interns to join our 10-week Summer Internship Program, which\ngives</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">you\nreal, on-the-job work experience whilst allowing you to choose from a number of</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">potential\nroles within our scrum teams; giving you the skills and experience to help you\naccelerate in your studies and future career.</p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Join the\nteam and make an impact right away:</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nIdentify exciting opportunities for adopting new technologies to solve</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">existing\nneeds and predict future challenges</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nDevelop software applications as part of a scrum team</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nLearn technical skills, write code, conduct code reviews and testing</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nWork with Product Managers to prioritize features for new products and</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">manage\na list of requirements based on industry trends and new</p>\n\n<div>technologies</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nDesign work, such as user experience or graphic design</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nBespoke learning and development program, e.g. technical, leadership,</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">networking\nand soft skills</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nTake part in social activities, community service events and projects with</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">other\nInterns and Graduates</p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>We have\nthe know-how, technology and global reach to make nearly any idea a</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>reality.\nAll that's missing is you!</b></p>\n<div><div><br></div></div><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b>Do you meet\nthe below requirements?</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nCreative, collaborative and having the desire to learn</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nEye for driving innovation and change</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nAbility to effectively connect with non-technical business partners</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nCapable of working well and contributing meaningfully in a team environment</p>\n\n<div>&nbsp;</div>\n\n<div>&nbsp;</div>\n\n<div><b>A bonus if you have these:</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">● Experience in\ndeveloping products or projects either in an academic,</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">professional\nor personal setting</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nSome entry level software development experience, or design or creative</p>\n\n<div>experience</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">●\nA technical background is beneficial but not required; we are looking for</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">passionate, quick learners\nwilling to take on new challenges</p>\n\n<div><b><br></b></div><div><b>Educational Requirements</b></div>\n\n<ul><li>Currently enrolled in a\nBachelors or Masters degree program in Computer Science, Computer Engineering,\nor other technical discipline</li><li>Students must have a\ngraduation date between December 2021 and June 2023</li></ul>\n\n\n\n<div><b>About Us</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express’ heritage was built on service and\nhas been sustained by innovation. Through our evolution from an express mail\nbusiness in 1850, to one of the world’s largest card issuers by purchasing\nvolume and a digital innovator, we’ve never been afraid to explore new\npossibilities and embrace the changing marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">From our high employee Satisfaction ratings to our many\nworkplace awards, American Express is consistently recognized as a great place\nto work by people around the world. We offer talented individuals challenging\nwork with purpose by embracing both innovation and tradition. &nbsp;As our\ncompany has grown and evolved, sometimes reinventing our business outright, we\nhave never strayed from the customer-service ethos and values on which the\ncompany was built –trust, security, integrity, quality, good citizenship,\nrespect and customer commitment. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Learn more about our Technology group at American\nExpress by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</p>\n\n<div>&nbsp;</div>\n\n<div>Why American Express?</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a difference between having a job and\nmaking a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express has been making a difference in\npeople’s lives for over 160 years, backing them in moments big and small,\ngranting access, tools, and resources to take on their biggest challenges and\nreap the greatest rewards.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’ve also made a difference in the lives of our\npeople, providing a culture of learning and collaboration, and helping them\nwith what they need to succeed and thrive. We have their backs as they grow\ntheir skills, conquer new challenges, or even take time to spend with their\nfamily or community. And when they’re ready to take on a new career path, we’re\nright there with them, giving them the guidance and momentum into the best\nfuture they envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we believe that the best way to back our\ncustomers is to back our people.</p>\n\n<div>&nbsp;</div>\n\n<div>The powerful backing of American Express.</div>\n\n<div>Don’t make a difference without it.</div>\n\n<div>Don’t live life without it.</div><div><br></div>\n<p style=\"margin-top:0px;margin-bottom:0px\">Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.</p><div><br></div><br>Tags: CFE-11160, CFE-12801, Handshake UNV-12520<br>ReqID: 20006515<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Jan 28, 2021,  3:57:36 PM\n    "
    },
    {
        "position": "Campus Graduate – 2021 Finance Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006513?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:42.172Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <b>\n\n</b><div>Finance is at the center of all key business\ndecisions, providing decision support, funding, reporting and transaction\nservices that help grow our business and uphold our reputation as one of the\npremier finance organizations in the world.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Whether you’re working with a business unit\nfocused on the consumers, small businesses or major corporations, you’ll have\nthe opportunity and resources available to make an impact. It sounds exciting\nbecause it is. </p>\n\n<div>&nbsp;</div>\n\n<h3>What Type of Internships Are Available:</h3>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">The internship\nwill be a general Finance internship that will provide opportunities to intern\nin one of the following functional areas of Finance:</p>\n\n<ul><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Corporate\nPlanning &amp; Analysis</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Global\nCommercial Services Finance</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Global\nConsumer Services Group Finance</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Global\nMerchant and Network Services Finance</p></li><li><div>Controllership</div></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Global\nTreasury</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Corporate\nDevelopment</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Global\nTax</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Investor\nRelations&nbsp;</p><div>&nbsp;</div><div>&nbsp;</div></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h3>What Type of Work Will I Do As an Intern:</h3>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">All interns receive a project solving a real\nbusiness challenge for the organization. Examples of past projects include:</p>\n\n<div>&nbsp;</div>\n\n<ul><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Leverage\nbig data and SQL to understand American Express Card Member spending behavior\nin certain industries, across different markets and among certain merchants to\nascertain growth opportunities</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Business-to-Business\n(B2B) Industry Overview and recommendation of potential acquisition targets\nacross markets</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Assess\nefficiency of acquiring US Consumer Card Members through the Direct Mail\nacquisition channel</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Creation\nof prototype to enable financial analysis on mobile products </p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Analysis\nof the profitability our U.S. Small Merchants</p></li><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Enhancements\nto Comprehensive Capital Analysis &amp; Review (CCAR) Stress Testing Analytics\nas part of annual Federal Reserve Board submission</p></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<br><h4>Minimum Qualifications</h4><h3>What Backgrounds / Experiences Are We Looking For:</h3>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Below are “The 5 Essentials” we want in our\ncandidates: 1) Analytical Skills; 2) Critical Thinking Skills; 3) Communication\nSkills; 4) Demonstrates Agile Mindset; and 5) Demonstrates Leadership\nBehaviors.</p>\n\n<div>&nbsp;</div>\n\n<h4><i>Analytical Skills</i></h4>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><i>Do\nyou have the ability to manipulate large amounts of data, spot trends &amp; generate\nmeaningful insights?</i></p>\n\n<div><i>&nbsp;</i></div>\n\n<h4><i>Critical Thinking Skills</i></h4>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><i>Can\nyou demonstrate thought leadership, innovative thinking &amp; question the\nstatus quo?&nbsp; </i></p>\n\n<div><i>&nbsp;</i></div>\n\n<h4><i>Communication Skills</i></h4>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><i>Can\nyou synthesize data into an easy-to-understand story &amp; articulate key\nmessages across multiple audiences?</i></p>\n\n<div><i>&nbsp;</i></div>\n\n<h4><i>Agile Mindset</i></h4>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><i>Do\nyou have a positive, can-do attitude?&nbsp;\nCan you adapt to change?&nbsp; Are you\na highly motivated self-starter?</i></p>\n\n<div>&nbsp;</div>\n\n<h4><i>Leadership</i></h4>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><i>Do\nyou act &amp; lead with courage?&nbsp; Can you\nbuild relationships, make decisions quickly &amp; influence change?&nbsp; Do you drive results?</i></p>\n\n<h3>&nbsp;</h3>\n\n<h3>We want talented individuals with a broad set of experiences.&nbsp; Past interns have had experience in finance,\naccounting, consulting, marketing, business analytics and more.&nbsp; Know how to use SAS, SQL, Hive or\nPython?&nbsp; Have artificial intelligence and\npredictive modeling experience? Are you a seasoned project manager?&nbsp; There’s a job in Finance at American Express\nfor you.</h3>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Educational\nRequirements:</p>\n\n<ul><li><p style=\"margin-top: 0px; margin-bottom: 0px;\">Currently enrolled in a\nfull-time MBA program</p></li><li><div>Students must have a graduation date between December 2021 and June 2022</div></li></ul>\n\n\n\n<h3>Why Work at American Express:</h3>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">There’s a\ndifference between having a job and making a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">American\nExpress has been making a difference in people’s lives for over 160 years, backing\nthem in moments big and small, granting access, tools, and resources to take on\ntheir biggest challenges and reap the greatest rewards.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">We’ve also\nmade a difference in the lives of our people, providing a culture of learning and\ncollaboration, and helping them with what they need to succeed and thrive. We have\ntheir backs as they grow their skills, conquer new challenges, or even take\ntime to spend with their family or community. And when they’re ready to take on\na new career path, we’re right there with them, giving them the guidance and\nmomentum into the best future they envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Because we\nbelieve that the best way to back our customers is to back our people.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">The powerful\nbacking of American Express.</p>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Don’t make a\ndifference without it.</p>\n\n<div>Don’t live life without it.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Learn more about our Finance group at\nAmerican Express by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\"><b><u>With a job at American Express, almost anything is possible. Apply\nnow!</u></b></p>\n\n<div>&nbsp;</div>\n\n<div><p style=\"margin-top: 0px; margin-bottom: 0px;\"><b>&nbsp;</b></p></div>\n\n<p style=\"margin-top: 0px; margin-bottom: 0px;\">Our team will review completed applications on a rolling basis. We\nappreciate your patience while we consider your application and will be in\ncontact with you by April 30<sup>th</sup>. <br>\n<br>\nDepending on factors such as business\nunit requirements, the nature of the position, cost and applicable laws,\nAmerican Express may provide visa sponsorship for certain positions.</p>\n\n<br><br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006513<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep  2, 2020,  7:01:03 PM\n    "
    },
    {
        "position": "Campus Graduate – 2021 Digital Analytics Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006785?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:43.999Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\"><a name=\"_Hlk49532915\">Become part of the digital transformation and\nhelp revolutionize the financial services industry. &nbsp;</a></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">At American Express,\nwe provide customers with access to products, insights and experiences that\nenrich lives and build business success.&nbsp;\nOur customers include our Cardmembers as well as the small businesses,\nmerchants, corporations, and bank partners that are all members of the dynamic American\nExpress network. As a <b>Digital Analytics\ncolleague</b>, you have the opportunity to make your mark on technology and\nlife at American Express. You’ll be challenged everyday as we work together to\ncreate digital products and develop actionable data-driven insights to meet the\ncustomers of tomorrow.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Where are these roles\nlocated within American Express? </b></p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><a name=\"_Hlk49532242\"><b>You could be\nrecruited for a Digital Analytics</b></a> full-time role to serve\nas a key member in one of our Enterprise Functions, such as Credit and Fraud\nRisk or Enterprise Digital &amp; Analytics organizations. We seek a\nthought-leader and a problem-solver who can blend business, technical, and\nindustry best practices – when it comes to developing the analyses, models, and\nalgorithms that power our customers’ digital experiences. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Below are some of the\nroles in these teams:</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Enterprise &amp; Digital\nAnalytics:</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">An\nexciting opportunity for someone who wants to help shape, refine and build, Prospect\nand Customer digital connections, experiences and interactions through advanced\nstatistical techniques, AI, and machine learning. Enterprise Digital and\nAnalytics team charter is to be an engine of growth, marketplace\ndifferentiation and efficiency for American Express.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Acquisition\nstrategic Analytics</i>:\nAccelerate the pace of digital prospect acquisitions on a global basis\nincluding increasing online traffic conversions and elevate onboarding\nexperiences.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Customer\nStrategic Analytics</i>:\nDrive customer engagement and satisfaction by ensuring\nthey get the best possible experience in every exchange they have with American\nExpress through personalization, design of experiments value, and relevance.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Credit\n&amp; Fraud Risk:</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">This\ncritical team is responsible for managing enterprise risks throughout the customer\nlifecycle, across our consumer and commercial businesses, and across all our\nglobal products. We develop industry-first data capabilities, build profitable\ndecision-making frameworks, create machine learning-powered predictive models,\nand improve customer servicing strategies. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Credit\nRisk Strategy</i>:\nThe credit risk team monitors credit portfolios and optimizes profit-based risk\nmanagement decisions at all stages of the customer credit lifecycle.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Fraud\nRisk Strategy</i>:\nThe team analyzes and improves controls across all points of business that\ncreate fraud vulnerabilities, including product and service design, account\nacquisition, card issuance, servicing, and financial transactions. </p>\n\n<div><b>&nbsp;</b></div>\n\n<div><b>&nbsp;</b></div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do\nin Digital Analytics at American Express? </b></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><a name=\"_Hlk49680252\">The specific job responsibilities would depend on the\nteam you are selected in for a summer internship role. Broadly the role could\nentail some of the below listed responsibilities:</a></p>\n\n\n\n<ul type=\"circle\"><li>Partner closely\n     with our Digital Product and Business Unit teams to provide insights which\n     inform product development and marketing investment decisions as well as\n     actionable, insightful analytical solutions to help the leadership team\n     evaluate and drive business performance</li><li>Collaborate\n     extensively with colleagues to design and implement strategies based on\n     statistical, financial and economic analysis </li><li>Develop and\n     manage analytics to identify and monitor trends to provide insights to\n     shape organizational policies</li><li>Develop insights\n     into customer behavior and introduce new approaches to transform complex\n     behavioral data into actionable information</li><li>Design,\n     implement, and measure the results from sophisticated A/B testing\n     experiments</li><li>Provide\n     analytical support to enable billing, revenue growth, profitability and\n     customer experience through diverse projects.</li><li>Identify,\nevaluate, and integrate new data sources and capabilities to drive key business\ndecisions</li></ul>\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\"><b>We have the know-how, creative platform and global reach to make nearly any idea a reality.</b> <b>Do these describe you?</b></p>\n\n<div>&nbsp;</div>\n\n<div><u>Skills/Experience</u></div>\n\n<ul type=\"circle\">\n\t<li><a name=\"_Hlk49532630\">Passion for improving end-to-end customer experience, innovation and customer first thinking</a></li>\n\t<li>Ability to effectively interpret technical and business objectives and challenges, and articulate solutions </li>\n\t<li>Strong analytical and decision-making skills – must have the ability to compile, analyze, research, and link complex issues</li>\n\t<li>Ability to think strategically and apply both quantitative methods and business insights to drive results, and build strong relationships in a cross-functional environment</li>\n\t<li>Demonstrated ability to work effectively and collaboratively in high pressure situations and handle multiple priority assignments simultaneously – must be a self-starter </li>\n\t<li>Excellent written and verbal skills, with the ability to effectively communicate at all levels</li>\n\t<li>Ability to handle large datasets using SAS, SQL, R, Python or another similar programming language</li>\n\t<li>Familiar with Agile or other rapid application development methods </li>\n\t<li>Knowledge of MS Office applications required</li>\n</ul>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">&nbsp;</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\"><u>Educational Requirements</u></p>\n\n<ul type=\"circle\">\n\t<li>Currently enrolled in full-time Graduate degree program </li>\n\t<li><a name=\"_Hlk49532584\">Degree in a field such as Statistics, Mathematics, Operations Research, Engineering, Data Science, Computer Science, Econometrics or Physics preferred </a></li>\n\t<li>Students must have a graduation date between December 2021 and June 2022</li>\n</ul>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\"><b>Why American Express?</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">There’s a difference between having a job and making a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">American Express has been making a difference in people’s lives for over 160 years, backing them in moments big and small, granting access, tools, and resources to take on their biggest challenges and reap the greatest rewards.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">&nbsp;</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">We’ve also made a difference in the lives of our people, providing a culture of learning and collaboration, and helping them with what they need to succeed and thrive. We have their backs as they grow their skills, conquer new challenges, or even take time to spend with their family or community. And when they’re ready to take on a new career path, we’re right there with them, giving them the guidance and momentum into the best future they envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">Because we believe that the best way to back our customers is to back our people.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">The powerful backing of American Express.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">Don’t make a difference without it.</p>\n\n<div>Don’t live life without it.</div>\n\n<div>&nbsp;</div>\n\n<div>Learn more about our Digital groups at American Express by visiting <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a>.</div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">Our team will review completed applications on a rolling basis. We appreciate your patience while we consider your application and will be in contact with you by <b>April 30<sup>th</sup>.</b><br>\n<br>\nDepending on factors such as business unit requirements, the nature of the position, cost and applicable laws, American Express may provide visa sponsorship for certain positions.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">&nbsp;</p>\n\n<table style=\"border-collapse:collapse; width:38pt; border:none\" width=\"50\">\n\t<colgroup>\n\t\t<col style=\"width:38pt\" width=\"50\">\n\t</colgroup>\n\t<tbody>\n\t\t<tr style=\"height:15.0pt\">\n\t\t\t<td style=\"border:none; height:15.0pt; width:38pt; padding-top:1px; padding-right:1px; padding-left:1px; vertical-align:bottom; white-space:nowrap\" width=\"50\"><span style=\"font-size:11pt\"><span style=\"color:black\"><span style=\"font-weight:400\"><span style=\"font-style:normal\"><span style=\"text-decoration:none\"><span style=\"font-family:Calibri\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</span></span></span></span></span></span></td>\n\t\t</tr>\n\t</tbody>\n</table>\n\n<div>Click here to view the <a href=\"https://mail.aexp.com/owa/redir.aspx?SURL=M68Jz2tsRZ_eOnZYuRUI6aCO7JQVIadZfVN-yRCvVYawux7PVhjTCGgAdAB0AHAAOgAvAC8AdwB3AHcALgBkAG8AbAAuAGcAbwB2AC8AbwBmAGMAYwBwAC8AcgBlAGcAcwAvAGMAbwBtAHAAbABpAGEAbgBjAGUALwBwAG8AcwB0AGUAcgBzAC8AbwBmAGMAYwBwAG8AcwB0AC4AaAB0AG0A&amp;URL=http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\">\"EEO is the Law\" poster and supplement</a> and the Pay Transparency Policy Statement..</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px;font-family: Arial\">If the links do not work, please copy and paste the following URLs in a new browser window: <a href=\"https://mail.aexp.com/owa/redir.aspx?SURL=M68Jz2tsRZ_eOnZYuRUI6aCO7JQVIadZfVN-yRCvVYawux7PVhjTCGgAdAB0AHAAOgAvAC8AdwB3AHcALgBkAG8AbAAuAGcAbwB2AC8AbwBmAGMAYwBwAC8AcgBlAGcAcwAvAGMAbwBtAHAAbABpAGEAbgBjAGUALwBwAG8AcwB0AGUAcgBzAC8AbwBmAGMAYwBwAG8AcwB0AC4AaAB0AG0A&amp;URL=http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\">http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm</a> and <a href=\"https://mail.aexp.com/owa/redir.aspx?SURL=4eAO6YWt268gKVYMOMWLPJEVGcQQHwPuSX9OIdQrXJewux7PVhjTCGgAdAB0AHAAOgAvAC8AdwB3AHcALgBkAG8AbAAuAGcAbwB2AC8AbwBmAGMAYwBwAC8AcABkAGYALwBFAE8AMQAzADYANgA1AF8AUAByAGUAcwBjAHIAaQBiAGUAZABOAG8AbgBkAGkAcwBjAHIAaQBtAGkAbgBhAHQAaQBvAG4AUABvAHMAdABpAG4AZwBMAGEAbgBnAHUAYQBnAGUAXwBKAFIARgBRAEEANQAwADgAYwAuAHAAZABmAA..&amp;URL=http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf\">http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf</a></p>\n\n<div>&nbsp;</div>\n<br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006785<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 23, 2020,  2:03:24 PM\n    "
    },
    {
        "position": "Campus Recruitment - 2021 Information Security Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006392?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:45.941Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">This\nposition is a 10 week summer internship opportunity to demonstrate knowledge\ngained and apply it in a dynamic, high-performing Technology Risk &amp;\nInformation Security team. Responsible for assisting with activities designed\nto systematically run information security, such as security investigations,\nintelligence, assurance, and/or other project oversight, including developing\nstandard methodologies for information security standards and handling IT\ncontrols and compliance with regulatory guidance.</p><p style=\"margin-top:0px;margin-bottom:0px\"><br></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do in Information\nSecurity at American Express?</b></p>\n\n<ul type=\"disc\"><li>Security\n     Incident Response/Threat Intelligence</li><ul type=\"circle\"><li>Act as the front line of defense at American Express\n      protecting the brand, employees, assets and card members across the globe\n      against threats 24/7/365</li><li>Minimize risk of cyber attacks and focus on detection\n      and response of threats</li><li>Monitor, detect, and respond to security events and\n      incidents that affect AXP globally</li></ul><li>Infrastructure,\n     Application, and Network Security</li><ul type=\"circle\"><li>Drive risk reduction through the rapid identification\n      and remediation of vulnerabilities across the enterprise </li><li>Deliver secure network solutions that enable secure\n      operations and highly available products and services for our customers</li><li>Safeguard AXP data, customers, and brand through\n      continuous monitoring and testing of production application environments</li></ul><li>Data\n     Loss Prevention</li><ul type=\"circle\"><li>Protect our customers, partners, and colleagues from\n      the loss of sensitive information through normal business processes\n      and/or malicious actors</li><li>Monitor and block sensitive data loss where legally\n      permissible</li></ul><li>Identity\n     and Access Management/Authentication</li><ul type=\"circle\"><li>Deliver centralized Enterprise Identity and Access\n      Management products</li><li>Provide authentication, authorization, and full\n      lifecycle management capabilities</li><li>Reduce, manage, and monitor risk associated with\n      identity and access to AXP resources</li></ul><li>Cryptography/Encryption\n     Services</li><ul type=\"circle\"><li>Protect all forms of sensitive information, on all\n      platforms, resulting in protection of the Brand and information assets,\n      and regulatory compliance</li><li>Deliver cryptographic and key management solutions,\n      and manage and operate secure cryptographic platforms</li><li>Drive continuous enhancement to data protection </li></ul><li>Governance,\n     Risk, Compliance</li><ul type=\"circle\"><li>Bridge traditional boundaries between cyber and IT\n      risk and expanding partnerships with IT and the business to drive risk\n      reduction in the enterprise</li><li>Innovate Risk Management through enhancements in\n      tooling and automation of processes; expand the capabilities of\n      technology risk management</li><li>Extend risk management and control expertise beyond\n      the information security domains into IT development organizations and\n      the business</li></ul></ul>\n<br><h4>Minimum Qualifications</h4><p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>Here are the skills and experience we are looking for.&nbsp; Do these describe you?</b></p>\n\n<div><b>&nbsp;</b></div>\n\n<div><u>Skills/Experience Needed</u></div>\n\n<ul>\n\t<li>Cyber Security education and/or experience preferred</li>\n\t<li>Strong verbal and written communication skills</li>\n\t<li>Knowledge or awareness in information security, compliance, assurance, and/or other security best practices and principles</li>\n</ul>\n\n<div>&nbsp;</div>\n\n<div><u>Educational Requirements</u></div>\n\n<ul>\n\t<li>Bachelor’s or Master's Degree in Cyber Security, Computer Science, Software Engineering, Information Systems, or other related field preferred</li>\n\t<li>Students must have a graduation date between December 2021 and June 2023</li>\n</ul>\n\n<div><b>&nbsp;</b></div>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>About Us</b></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">American Express’ heritage was built on service and has been sustained by innovation. Through our evolution from an express mail business in 1850, to one of the world’s largest card issuers by purchasing volume and a digital innovator, we’ve never been afraid to explore new possibilities and embrace the changing marketplace.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">From our high employee Satisfaction ratings to our many workplace awards, American Express is consistently recognized as a great place to work by people around the world. We offer talented individuals challenging work with purpose by embracing both innovation and tradition. &nbsp;As our company has grown and evolved, sometimes reinventing our business outright, we have never strayed from the customer-service ethos and values on which the company was built –trust, security, integrity, quality, good citizenship, respect and customer commitment. </p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Learn more about our Information Security group at American Express by visiting <a href=\"https://careers.americanexpress.com/students/\">https://careers.americanexpress.com/students/</a>.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\"><b>Apply now!</b></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Learn more about American Express by visiting <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a></p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">With a job at American Express, almost anything is possible.&nbsp; Apply now!</p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">&nbsp;</p>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Our application deadline is&nbsp;November 15th and our team will review completed applications on a rolling basis. We appreciate your patience while we consider your application and will be in contact with you by April 30<sup>th</sup>.&nbsp; </p>\n\n<div>&nbsp;</div>\n\n<p style=\"font-family:Arial; margin-bottom:0px; margin-top:0px\">Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorships for these positions.</p><br>Tags: CFE-11160, USTech, Handshake UNV-12520, CFE-12801<br>ReqID: 20006392<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 18, 2020, 11:28:01 AM\n    "
    },
    {
        "position": "Campus Graduate - 2021 Digital Product Management Summer Internship",
        "company": "American Express",
        "contact": "https://careers.americanexpress.com/",
        "url": "https://jobs.americanexpress.com/global/jobs/20006771?lang=en-us&previousLocale=en-US",
        "lastScraped": "2021-02-09T00:02:47.265Z",
        "location": {
            "city": "N/A",
            "state": "Error",
            "country": "United States"
        },
        "description": "\n      <p style=\"margin-top:0px;margin-bottom:0px\">Create\ndigital experiences that enhance our customers lives at every touchpoint.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The\ncore of our company is not just the products we offer, but the personal\nconnections our customers have with our brand. You can create digital\nexperiences -from payments to rewards to servicing -that keep us connected to\nour customers and serve them at every touchpoint. From digital servicing and\nlifestyle features to secure, frictionless payment options, you can make a\nmeaningful difference in our customers’ lives and help set us apart in the\nindustry.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The Digital\nProduct role at American Express is an exciting opportunity for someone who\nwants to help shape digital experiences for one of the world’s top brands. You will have the opportunity to see how you can\nmake a direct contribution to the success of our company. You will work among high performing engineering, design and product teams to build user-centric solutions\nto challenging problems. You’ll be challenged in a lively, collaborative,\ndiverse and inclusive team environment.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We\nseek a thought-leader and a problem-solver who can blend business, technical,\nand industry best practices – when it comes to developing the most effective\ntechnology led solutions to improve our customer digital experiences. </p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Where are these roles\nlocated within American Express? </b></p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Digital Product\ncolleagues </b>will\nserve as a key member of teams such as the Enterprise Digital &amp; Analytics team,\nthe Amex Digital Labs team or the Credit Fraud Risk and Capabilities team.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Enterprise Digital &amp;\nAnalytics:</b> This team offers a\nunique opportunity to build the digital connection with our prospects and\ncustomers. We drive innovation, delivering products and platforms across the\nentire lifecycle of Cardmembers partnership, partnering with other Business\nUnits and Centers of Excellence, advancing our goal of becoming an essential\npart of our customers’ digital lives.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><i>Enterprise Digital\nMember Experiences</i> team is responsible for\ndeepening Card Member engagement through our digital experiences, with a\nprimary focus on Membership mobile app, web, commerce and push channels. The\nteam’s mission is to dramatically increase digital engagement and customer satisfaction\nthrough a combination of superior user experience and compelling features and\nfunctionality. The team's primary remit is to define and deliver digital\nexperiences and best-in-class innovation.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Amex Digital Labs:</b>\nThis team is responsible for catalyzing\ndigital innovation at American Express by originating, incubating and managing\nemerging products and platforms that can be essential to our customers’ digital\nlives. We strive to emphasize creativity, customer centricity, and innovation.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Focus areas include\ncreating industry-leading digital payment solutions, using our first-class\nservicing network and lifestyle assets to create digital experiences, and\ndefining new products and services based on emerging technologies and trends.\nThis is a fast-paced team driving the development of digital solutions and\npartner experiences at American Express.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Credit\nFraud Risk Capabilities: This</b> team brings risk strategies to life by enabling\ncustomer focused capabilities for Card and Non-Card products. You will\ncollaborate with partners in other Risk teams, Marketing, Finance, Global\nServicing Network, Legal/Compliance, Banking, and Technologies to create\nworld-class analytical capabilities and solutions to minimize credit and fraud\nrisk and improve customer experience.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>What type of work can you expect to do\nin Digital at American Express? </b></p>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The\nspecific job responsibilities would depend on the team you are selected in for\na summer internship role. Broadly the role could entail some of the below\nlisted responsibilities:</p>\n\n<ul type=\"circle\"><li>Be responsible for the end-to-end strategy,\n     development and execution of new and emerging digital products, services\n     and/or technology platforms, following a User Centered Design approach</li><li>Create and manage projects from concept\n     through production, engaging the necessary teams to craft a rich and\n     engaging customer experience</li><li>Design customer communication and servicing\n     strategies to support risk management strategies, ensuring a positive\n     experience across every customer touchpoint</li><li>Be\n     a passionate advocate for the customer, grounding ideas in data driven\n     solutions by partnering with our customer research team to incorporate\n     user insights and principles throughout the process</li><li>Lead the Agile product development process\n     (Lean, SAFe, Kanban) including writing user stories, defining support\n     documents, prioritizing features and conducting\n     usability testing </li><li>Work closely to\n     collaborate with cross-functional partners and colleagues (marketing,\n     engineering, legal, compliance, risk) to create and maintain your product\n     backlog</li><li>Keep up to date\n     with industry, competitor, Agile/SAFe methodologies and new trends</li></ul>\n\n<div><b>&nbsp;</b></div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>We have the know-how, creative platform\nand global reach to make nearly any idea a reality.</b>\n<b>Do these describe you?</b></p>\n\n<div><u>&nbsp;</u></div>\n\n<div><u>Skills/Experience</u></div>\n\n<ul type=\"circle\"><li>Demonstrated interest in digital space\n     and ability to collaborate with technology partners </li><li>Passion for\n     end-to-end customer experience, innovation and user-centered design</li><li>Independent\n     thinker who’s organized, has great attention to detail, and can multi-task</li><li>Ability to blend big picture thinking\n     with fine details and manage many stakeholders </li><li>Strong\n     analytical, problem-solving/quantitative skills</li><li>Willing to do things differently, experiment, and share fresh perspectives</li><li>Excellent\n     written and verbal communication skills</li><li>Proficient in\n     analytical and presentation tools, including Excel and PowerPoint</li></ul>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><u>Educational\nRequirements</u></p>\n\n<ul type=\"circle\"><li>Currently\n     enrolled in full-time Graduate degree program in a field such as Business,\n     Marketing, Psychology, Human-Computer Interaction, Industrial Engineering,\n     Economics, Computer Science or related fields</li><li>Students must have a graduation\n     date between December 2021 and June 2022</li></ul>\n\n<ul type=\"circle\"><li><b>Candidates with relevant industry\n     experience of 1-5 years can also apply</b></li></ul>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><b>Why\nAmerican Express?</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">There’s a\ndifference between having a job and making a difference.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">American Express\nhas been making a difference in people’s lives for over 160 years, backing them\nin moments big and small, granting access, tools, and resources to take on\ntheir biggest challenges and reap the greatest rewards.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">We’ve also made a\ndifference in the lives of our people, providing a culture of learning and\ncollaboration, and helping them with what they need to succeed and thrive. We\nhave their backs as they grow their skills, conquer new challenges, or even\ntake time to spend with their family or community. And when they’re ready to\ntake on a new career path, we’re right there with them, giving them the\nguidance and momentum into the best future they envision.</p>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Because we believe\nthat the best way to back our customers is to back our people.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">The powerful\nbacking of American Express.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Don’t make a\ndifference without it.</p>\n\n<div>Don’t live life without it.</div>\n\n<div>&nbsp;</div>\n\n<div>Learn more about our Digital groups at American Express by visiting <a href=\"https://careers.americanexpress.com/\">https://careers.americanexpress.com</a>.</div>\n\n<div>&nbsp;</div>\n\n<p style=\"margin-top:0px;margin-bottom:0px\">Our team will review completed applications on a rolling basis. We\nappreciate your patience while we consider your application and will be in\ncontact with you by <b>April 30<sup>th</sup>. &nbsp;(Note: Edit the deadline as needed)</b></p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><br>\nEmployment\neligibility to work with American Express in the U.S. is required as the\ncompany will not pursue visa sponsorship for these positions.</p>\n\n<p style=\"margin-top:0px;margin-bottom:0px\"><br></p>\n<br><h4>Minimum Qualifications</h4><p style=\"margin-top:0px;margin-bottom:0px\"><b style=\"color: rgb(47, 84, 150); font-family: arial, &quot;times new roman&quot;, verdana, sans-serif; font-size: 16px;\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</b></p><br>Tags: US reqs – MBA/MS, Handshake UNV-12520<br>ReqID: 20006771<br>Schedule (Full-Time/Part-Time): Full-time<br>Date Posted: Sep 24, 2020,  9:50:55 AM\n    "
    }
]