[
    {
        "position": "Fintech Platform Engineer",
        "company": "Puzzle",
        "location": {
            "city": "North America • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/puzzlefin/jobs/1325485-fintech-platform-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:21.069Z",
        "description": "<p>Leveraging financial information is what Puzzle is all about. We are an ambitious startup, well funded by a top tier VC with an experienced team who have built multiple successful companies and raised over $500M.</p>\n\n<p>We are solving a true pain point that every company has and keeps having as they grow.</p>\n\n<p>We are on a mission to hire the very best and are committed to creating a culture where everyone is respected and has access to equal opportunity. We know that new ideas can come from anywhere in the organization, and the next big idea could be yours!</p>\n\n<p>What Are We Doing?</p>\n\n<p>Starting a company has become easier, but growing a company is more complicated than ever. We are building a real-time, smarter financial infrastructure to put trustworthy data into the hands of decision-makers.</p>\n\n<p>Job Description</p>\n\n<p>As part of Puzzle you will help design and build our financial and accounting system.</p>\n\n<p>We will be ingesting large amounts of data from disparate sources, transforming them, organizing them, and automatically turning them into easily understandable and leverageable company financials.</p>\n\n<p>We want to be as real time as possible, event driven, and decoupled. Redundant, resistant and secure.  And accuracy is key.</p>\n\n<p>This is your opportunity to be an early engineer at a well funded startup that has a successful founder and a drive to change how company's leverage their financials.</p>\n\n<p>What You’ll Do</p>\n\n<ul>\n<li>Deliver on core accounting, auditing and financial infrastructure</li>\n<li>Create unique functionality for correlation of data</li>\n<li>Design interfaces and apis to our data</li>\n<li>Extend and architect our event pipeline for speed and scale</li>\n<li>Extend our core reporting platform</li>\n<li>Work on designing endpoints for our product</li>\n<li>Handle an ever growing stream of data</li>\n<li>Anything else that comes along...</li>\n</ul>\n\n<p>What You Need To Succeed</p>\n\n<p>BS/MS in Computer Science, a related field, or equivalent work experience</p>\n\n<ul>\n<li>2+ years as a software engineer</li>\n<li>Experience with agile software development methodologies</li>\n<li>Experience with accounting and/or financial systems</li>\n<li>Past life as an accounting or CPA is a big plus</li>\n<li>Experience in one of Python, TypeScript, Go</li>\n</ul>\n\n<p>Desired Skills</p>\n\n<ul>\n<li>Practical experience in developing applications using microservices, container technologies, container management systems such as Kubernetes, Mesos etc</li>\n<li>Strong experience with Databases design (SQL, NoSQL) and analytics</li>\n<li>Prior working experience in utility computing and/or cloud computing domain highly desired</li>\n<li>Experience building and deploying applications and services into cloud environments (GCP highly desired)</li>\n</ul>\n\n<p>Puzzle is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.</p>"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Jungle Scout",
        "location": {
            "city": "Earth • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jungle-scout/jobs/1331044-senior-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:24.152Z",
        "description": "<p>At Jungle Scout, we are on a mission to empower entrepreneurs and brands to grow successful e-commerce businesses, and we provide the industry-leading data, powerful tools, and resources they need.</p>\n\n<p><strong>The role:</strong></p>\n\n<ul>\n<li>Do you get excited working with talented engineers, leading them to ship product features and enhancements, and helping them thrive in their career?</li>\n<li>Do you define a great day as getting sh*t done and having fun working with your team?</li>\n<li>Do you have a thirst for breaking down complex initiatives into achievable project plans?</li>\n<li>Do you thrive when you're contributing to a high-performing, humble team?</li>\n</ul>\n\n<p><strong>Amazing</strong>, then you’re the type of person we’re looking for!</p>\n\n<p>We’re growing and we are looking to add a Performance Engineering Lead to our fast-paced and customer-oriented Engineering team. </p>\n\n<p>Where would this person be located? Great question! We’re a remote-first company and hope to hire this Senior Software Engineer Team anywhere between the EST - PST timezone</p>\n\n<p>Interested in learning more? Let’s get into the details:  </p>\n\n<p><strong>What you will be doing:</strong></p>\n\n<p>Architect and build:. </p>\n\n<ul>\n<li>new web applications</li>\n<li>microservices </li>\n<li>new features on our existing applications</li>\n</ul>\n\n<p>Make recommendations around:</p>\n\n<ul>\n<li>technologies to be used for new applications </li>\n<li>improvements on existing applications</li>\n</ul>\n\n<p>Scale, maintain and improve:</p>\n\n<ul>\n<li>existing codebases and system infrastructures</li>\n<li>development, staging and production environments of our applications</li>\n</ul>\n\n<p>Participate and contribute in:</p>\n\n<ul>\n<li>code reviews</li>\n<li>project planning and management</li>\n<li>ongoing improvement of engineering practices and procedures</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<p>You’ve done this before. </p>\n\n<ul>\n<li>Proficient in at least one modern programming language (Ruby, Javascript, Python)</li>\n<li>Have built enterprise-level products with modern web development technologies, and popular backend frameworks (e.g., Ruby on Rails, NodeJS, etc)</li>\n</ul>\n\n<p>You’re an AWS Cloud Wizard.</p>\n\n<ul>\n<li>Been working with some subset of AWS services, such as EC2, RDS, DynamoDB, Elasticsearch, ElasticBeanstalk, Lambda, Cloudwatch, SQS, Kinesis and SNS.</li>\n</ul>\n\n<p>You’re a master communicator &amp; passionate mentor. </p>\n\n<ul>\n<li>Fluent in both written &amp; verbal English to easily chat with our North American teams. </li>\n<li>Able to communicate effectively, clearly and concisely on both technical and non-technical subjects. </li>\n<li>Take any chance you can get to share knowledge with your team. </li>\n<li>Contribute to the team’s documentation and mentor teammates in an open, respectful, flexible, empathetic manner. </li>\n<li>Do not shy away from taking and giving feedback.</li>\n</ul>\n\n<p>You’re autonomous. </p>\n\n<ul>\n<li>Successfully execute on large multi-person projects and well-defined initiatives from definition through to the end.</li>\n</ul>\n\n<p><strong>Working at Jungle Scout</strong></p>\n\n<ul>\n<li>The BEST team. </li>\n<li>Remote-first culture.</li>\n<li>International Retreats.</li>\n<li>Access to Jungle Scout tools &amp; experts.</li>\n<li>Performance Bonus. </li>\n<li>Flexible Vacation. </li>\n<li>Comprehensive Health Benefits &amp; Retirement Program. </li>\n<li>We prioritize Diversity, Equity, and Inclusion </li>\n</ul>\n\n<p>At Jungle Scout, we hire great people from a wide variety of backgrounds, not just because it’s the right thing to do, but because it makes our company stronger. </p>\n\n<p>Jungle Scout is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n\n<p><em>All offers of employment at Jungle Scout are contingent upon clear results of a comprehensive background check. Background checks will be conducted on all final candidates prior to start date.</em></p>"
    },
    {
        "position": "Ios Development Internship (Unpaid)",
        "company": "Distaff",
        "location": {
            "city": "Boston • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/distaff/jobs/1008544-ios-development-internship-unpaid",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:26.563Z",
        "description": "<p>What You’ll Do<br>\nCollaborate with other engineers to build, optimize and maintain our CI/CD systems<br>\nCreate the best possible developer experience for mobile engineers by ensuring our tools are effective, efficient and easy to use<br>\nDevelop telemetry and alerting for opportunities to improve build infrastructure and tooling, and execute on them<br>\nCollaborate with leadership and key partners on a regular basis<br>\nDevelop telemetry and alerting for opportunities to improve build infrastructure and tooling, and execute on them<br>\nIdentify code refactor and modularization opportunities to improve build efficiency<br>\nMonitor build pipeline, if you can build dashboards that can show the health and performance of the builds that is a huge plus</p>\n\n<p>What We’re Looking For<br>\n2+ years working primarily with iOS build systems and tools, or 4+ years primarily on other build systems<br>\n4+ years of hands-on technical experience<br>\nBachelor's degree in Computer Science or a related field, or equivalent practical experience<br>\nHave familiarity with tools and structure of modern iOS applications written in Objective-C and Swift<br>\nDeep understanding of XCode/xcbuild or alternative build system (e.g. buck or bazel)<br>\nProficiency in at least one major system language (e.g. Swift, Objective-C) and at least one scripting language (e.g. Python or bash)<br>\nExperience with building and scaling shared CI/CD infrastructure and operations<br>\nExperience with developing automated internal frameworks, increasing developer and release velocity, improving code health and building developer tools<br>\nYou have solid experience using a Continuous Integration environment: Bitrise, Drone, CircleCI, Buildkite, Jenkins, etc.<br>\nYou have experience deploying mobile apps to the Apple App Store<br>\nYou have good communication and collaboration skills<br>\nStrong knowledge of iOS build systems, log analysis tools, networking, tracing, instrumentation tools, app release, and app signing</p>\n\n<p>Preferred, But Not Necessary<br>\nYou have experience configuring and using artifact management tools such as Docker<br>\nYou have experience with AWS technologies like EC2<br>\nYou have experience with static analysis for iOS apps in a quality context<br>\nYou have automation testing experience<br>\nYou have created a CI/CD environment from scratch for a rapidly growing team</p>"
    },
    {
        "position": "Android Development Internship (Unpaid)",
        "company": "Distaff",
        "location": {
            "city": "Boston",
            "state": ""
        },
        "url": "https://angel.co/company/distaff/jobs/1304103-android-development-internship-unpaid",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:28.927Z",
        "description": "<p>As a Mobile Development Intern, you will be part of a team that works in a fast paced environment that spans multiple technologies ranging from native Android development to cross platform technologies like Xamarin. You will have the opportunity to work with transportation related hardware and cutting edge Android development tools using languages like Kotlin and Cloud platforms like Firebase. This position will allow you to learn how teams operate in a Scrum environment and provide you with a window into how production software is built.</p>\n\n<p>Responsibilities<br>\nParticipate in the SDLC process<br>\nUnderstand and work with our source control system<br>\nWork with Leads/Mentors to contribute quality code to Timble applications</p>\n\n<p>Required Skills<br>\nBasic knowledge of Git<br>\nBasic Android API knowledge<br>\nHave an understanding of OOP concepts<br>\nTrimble Inc. is proud to be an Equal Opportunity and Affirmative Action Employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, status as a covered veteran in accordance with applicable federal, state and local laws, or any other protected factor. EOE/M/F/V/D</p>"
    },
    {
        "position": "CariClub Internship",
        "company": "CariClub",
        "location": {
            "city": "New York City",
            "state": ""
        },
        "url": "https://angel.co/company/cariclub/jobs/626016-cariclub-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:31.487Z",
        "description": "The Company<br><br>Developing and retaining high potential employees is the top priority for C-level executives worldwide. CariClub partners with industry-leading firms like Morgan Stanley, Deloitte, Davis Polk, and Apollo to place their employees on non-profit boards through our proprietary matching platform. Our corporate clients know that the professional and leadership skills learned during non-profit board service are exactly the ones companies struggle to cultivate through traditional leadership training programs. At CariClub, we are on a mission to develop the next generation of inclusive leaders in the corporate and philanthropic world by empowering our community of ambitious young professionals to become a driving force for good.<br><br>Check out our member demo here.<br><br>The Opportunity<br><br>CariClub is looking for a highly motivated, sharp and detail-oriented intern who is passionate about problem solving, process improvement, and harnessing technology for good. An ideal candidate has prior internship experience and has strong research and analytical skills. We want you to be extremely detail-oriented, ask thoughtful questions, and proactively bring suggestions to the table.<br><br><br>Projects Types<br>* Business development/sales<br>* Community engagement<br>* Nonprofit engagement<br>* Finance and operations<br>* UI/UX design<br>* Software development<br>* Research and analysis<br>* Strategy and ad-hoc projects for the CEO<br><br>Qualities that would make you a great fit:<br>* A self-starter, you enjoy taking initiative and seeing a project through from start to finish<br>* High attention to detail<br>* Strong research and analytical skills<br>* Emotional resilience, consistency, growth-oriented<br>* Passionate about CariClub’s mission<br>* Embraces challenges, not daunted by large projects<br>* Excellent communication skills<br>* Ability to take criticism and improve constantly<br>* Desire to manage, grow, and work with lean teams<br>* Adaptable and resourceful<br><br>If you're interested in learning more, please reach out - we'd love to chat!<br><br><br>Compensation<br><br>Compensation is commensurate with the position’s requirements and the applicant's experience. In a performance-based environment, this will include a base salary and a possible stakeholder position in the Company for full-time roles.<br><br>CariClub is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation."
    },
    {
        "position": "Software Engineer Intern",
        "company": "Declare®",
        "location": {
            "city": "Toronto • Salinas • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/declare-3/jobs/394293-software-engineer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:33.879Z",
        "description": "Declare® provides college students with an easy to use interface to identify their overlapping courses which fill requirements of their Major,GE grad reqs, and any Minor degree they would miss without the app.  Declare® is transitioning into the direct to university market to service students through Higher Ed Advising departments.  Looking to develop out this pivot A to Z"
    },
    {
        "position": "Software Engineer",
        "company": "TeraThought",
        "location": {
            "city": "Raleigh • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/tera-thought/jobs/802652-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:36.024Z",
        "description": "<p>We are a software company. Code is what we live and breathe.</p>\n\n<p>But being a software engineer at TeraThought is so much more than writing code. It’s about creativity, solving problems, your left and right brain working together. It’s about spreading your wings beyond development and collaborating with other teams. It’s about having the courage to stay at the bleeding edge of technology, not merely keeping up with the industry standard of today, but trailblazing what it will be tomorrow.</p>\n\n<p>One of our core values as a company is “Passion in Every Project”. We fundamentally believe that people should be able to do what they love. Alongside talented individuals, you will have the choice to work on any part of our next-gen MVVM tech stack that you desire! The choice is yours and we welcome and encourage trying different things to find what clicks.</p>\n\n<ul>\n<li>Front-end Android with Kotlin and Jetpack Compose</li>\n<li>Front-end iOS with Swift and SwiftUI</li>\n<li>Front-end Web with Vue.js and React.js</li>\n<li>Multi-platform Shared Backend with Kotlin Multiplatform</li>\n<li>Server-side Backend with Node.js, typescript cloud functions, and Firebase</li>\n</ul>\n\n<p>If all of that’s been the “what” and the “how”, then Connexus is the “why”. Connexus is our flagship product - it defines a new industry as the first Resource Sharing Network. By leveraging circles of trust from existing communities, Connexus helps people borrow and lend nearly anything, saving people’s money as well as the environment.</p>\n\n<p>If you’re wondering how many years of experience you need for this, don’t.<br>\nYour enthusiasm and desire to learn is far more important than how much you know coming in. We invest heavily in the growth of each of our teammates, and through our team of domain-experts, there are endless learning opportunities in and outside the world of development.</p>\n\n<p>So, are you a curious, lifelong learner? Do you relish solving creative problems? Do you yearn to make a real and unique impact on the communities around you? Is a tight-knit, agile team of like-minded individuals up your alley? Are you an eager, driven individual who loves code?</p>\n\n<p>Then you’re perfect for our team, and our team is perfect for you. Apply!</p>"
    },
    {
        "position": "Android Mobile Developer",
        "company": "TeraThought",
        "location": {
            "city": "Raleigh • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/tera-thought/jobs/1222255-android-mobile-developer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:38.444Z",
        "description": "<p>We are a software company. Code is what we live and breathe.</p>\n\n<p>But being a software engineer at TeraThought is so much more than writing code. It’s about creativity, solving problems, your left and right brain working together. It’s about spreading your wings beyond development and collaborating with other teams. It’s about having the courage to stay at the bleeding edge of technology, not merely keeping up with industry standard of today, but trailblazing what it will be tomorrow.</p>\n\n<p>From the frontend to the backend, we have innovated on all parts of the Android stack:</p>\n\n<ul>\n<li>Jetpack Compose - The next-generation UI toolkit that powers our apps with declarative UIs</li>\n<li>Kotlin Multiplatform - A shared backend with a smooth integration experience (custom tooling)</li>\n<li>Firebase, SQLDelight and Coroutines - Tooling that makes backend endpoints simple</li>\n</ul>\n\n<p>We don't expect you to know any parts of our Android stack, after all these tools are incredibly new. However, we expect you to be excited about learning and developing with the coolest tech stack!</p>\n\n<p>If all of that’s been the “what” and the “how”, then Connexus is the “why”. Connexus is our flagship product - it defines a new industry as the first resource sharing network. By leveraging circles of trust from existing communities, Connexus helps people borrow and lend nearly anything, saving people’s money as well as the environment.</p>\n\n<p>If you’re wondering how many years of experience you need for this, don’t.</p>\n\n<p>Your enthusiasm and desire to learn is far more important than how much you know coming in. We invest heavily in the growth of each of our teammates, and through our team of domain-experts, there are endless learning opportunities in and outside the world of development.</p>\n\n<p>So, are you a curious, lifelong learner? Do you relish solving creative problems? Do you yearn to make a real and unique impact on the communities around you? Is a tight-knit, agile team of like-minded individuals up your alley? Are you an eager, driven individual who loves code?</p>\n\n<p>Then you’re perfect for our team, and our team is perfect for you. Apply!</p>"
    },
    {
        "position": "Samaritan Android Hackership",
        "company": "Samaritan",
        "location": {
            "city": "Seattle • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/samaritan-1/jobs/759864-samaritan-android-hackership",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:40.788Z",
        "description": "<p>Samaritan seeks a team member to join us in helping people on the street access the resources needed to find a home. If that sounds like you, and you've got a gift for Android development, we'd love for you to consider sharing your gifts with the people we serve.</p>\n\n<p>Outreach teams and case managers use our smart wallets—called beacons—as a resource for people experiencing homelessness. Individuals set their own housing and health goals and then can access the financial and social capital needed to meet those goals. </p>\n\n<p>The <a href=\"https://play.google.com/store/apps/details?id=org.givesafe.app&amp;hl=en_US\" target=\"_blank\" rel=\"nofollow\">Samaritan app</a> enables providers to issue beacons, update goals &amp; needs, and help beacon holders spend money. It also enables everyday individuals and organizations learn the stories of individuals and join their team of supporters to help them meet set goals. Over 10,000 \"samaritans\" invested &gt;$100K and 1,000 letters of encouragement into a pilot cohort of 500 beacon holders, enabling dozens to reach life-changing outcomes. This is just the start, with additional pilots in LA, OKC, and NYC coming online soon (<a href=\"https://samaritan.city\" target=\"_blank\" rel=\"nofollow\">learn more</a>).</p>\n\n<p>You'll be joining an incredible task-force of 6 (one backend, one backend/Android, one iOS, and three non-technical). You'll collaborate to ship user-requested features and upgrades that grow the amount of financial &amp; social capital that is put into the hands of people in need. </p>\n\n<p>Samaritan hackers are compensated on a bounty system: every feature or upgrade has a bounty on it, which goes to you when you ship it. So the higher the impact you have for our users, the higher your compensation.</p>\n\n<p>Strong preference given to candidates who can be onsite with us in Seattle (once this virus blows over). Will also consider a FT remote candidate in the right circumstances. Look forward to hearing from you!</p>\n\n<p><strong>SKILLS REQUIRED:</strong></p>\n\n<ul>\n<li>Native Android Java</li>\n<li>Frontend Implementation &amp; Animations</li>\n<li>Git</li>\n<li>Kotlin</li>\n<li>Activities</li>\n<li>Fragments</li>\n<li>Services</li>\n<li>Broadcast Receivers</li>\n<li>REST API Integrations with Retrofit 2</li>\n</ul>\n\n<p><strong>PLUS:</strong></p>\n\n<ul>\n<li>RxJava and RxAndroid</li>\n<li>Unit Testing with JUnit</li>\n<li>UI Testing with Espresso Framework</li>\n<li>CI</li>\n</ul>\n\n<p><strong>SOFT SKILLS:</strong></p>\n\n<ul>\n<li><p>Balance engineering excellence with velocity</p></li>\n<li><p>Communicate effectively with teammates, onsite and remote</p></li>\n<li><p>Translate information between technical and non-technical team members</p></li>\n<li><p>Eagerness to own a feature from conception to deployment</p></li>\n<li><p>Willingness to wear many hats (you might help design implementations for features that span multiple codebases and platforms—you'll be responsible for doing whatever needs to be done to get features to users)</p></li>\n<li><p>Quickly adapt and reprioritize to the needs of the team (no two days here are the same)</p></li>\n<li><p>Ability to learn independently</p></li>\n</ul>"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Jungle Scout",
        "location": {
            "city": "Earth • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jungle-scout/jobs/1331044-senior-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:43.391Z",
        "description": "<p>At Jungle Scout, we are on a mission to empower entrepreneurs and brands to grow successful e-commerce businesses, and we provide the industry-leading data, powerful tools, and resources they need.</p>\n\n<p><strong>The role:</strong></p>\n\n<ul>\n<li>Do you get excited working with talented engineers, leading them to ship product features and enhancements, and helping them thrive in their career?</li>\n<li>Do you define a great day as getting sh*t done and having fun working with your team?</li>\n<li>Do you have a thirst for breaking down complex initiatives into achievable project plans?</li>\n<li>Do you thrive when you're contributing to a high-performing, humble team?</li>\n</ul>\n\n<p><strong>Amazing</strong>, then you’re the type of person we’re looking for!</p>\n\n<p>We’re growing and we are looking to add a Performance Engineering Lead to our fast-paced and customer-oriented Engineering team. </p>\n\n<p>Where would this person be located? Great question! We’re a remote-first company and hope to hire this Senior Software Engineer Team anywhere between the EST - PST timezone</p>\n\n<p>Interested in learning more? Let’s get into the details:  </p>\n\n<p><strong>What you will be doing:</strong></p>\n\n<p>Architect and build:. </p>\n\n<ul>\n<li>new web applications</li>\n<li>microservices </li>\n<li>new features on our existing applications</li>\n</ul>\n\n<p>Make recommendations around:</p>\n\n<ul>\n<li>technologies to be used for new applications </li>\n<li>improvements on existing applications</li>\n</ul>\n\n<p>Scale, maintain and improve:</p>\n\n<ul>\n<li>existing codebases and system infrastructures</li>\n<li>development, staging and production environments of our applications</li>\n</ul>\n\n<p>Participate and contribute in:</p>\n\n<ul>\n<li>code reviews</li>\n<li>project planning and management</li>\n<li>ongoing improvement of engineering practices and procedures</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<p>You’ve done this before. </p>\n\n<ul>\n<li>Proficient in at least one modern programming language (Ruby, Javascript, Python)</li>\n<li>Have built enterprise-level products with modern web development technologies, and popular backend frameworks (e.g., Ruby on Rails, NodeJS, etc)</li>\n</ul>\n\n<p>You’re an AWS Cloud Wizard.</p>\n\n<ul>\n<li>Been working with some subset of AWS services, such as EC2, RDS, DynamoDB, Elasticsearch, ElasticBeanstalk, Lambda, Cloudwatch, SQS, Kinesis and SNS.</li>\n</ul>\n\n<p>You’re a master communicator &amp; passionate mentor. </p>\n\n<ul>\n<li>Fluent in both written &amp; verbal English to easily chat with our North American teams. </li>\n<li>Able to communicate effectively, clearly and concisely on both technical and non-technical subjects. </li>\n<li>Take any chance you can get to share knowledge with your team. </li>\n<li>Contribute to the team’s documentation and mentor teammates in an open, respectful, flexible, empathetic manner. </li>\n<li>Do not shy away from taking and giving feedback.</li>\n</ul>\n\n<p>You’re autonomous. </p>\n\n<ul>\n<li>Successfully execute on large multi-person projects and well-defined initiatives from definition through to the end.</li>\n</ul>\n\n<p><strong>Working at Jungle Scout</strong></p>\n\n<ul>\n<li>The BEST team. </li>\n<li>Remote-first culture.</li>\n<li>International Retreats.</li>\n<li>Access to Jungle Scout tools &amp; experts.</li>\n<li>Performance Bonus. </li>\n<li>Flexible Vacation. </li>\n<li>Comprehensive Health Benefits &amp; Retirement Program. </li>\n<li>We prioritize Diversity, Equity, and Inclusion </li>\n</ul>\n\n<p>At Jungle Scout, we hire great people from a wide variety of backgrounds, not just because it’s the right thing to do, but because it makes our company stronger. </p>\n\n<p>Jungle Scout is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n\n<p><em>All offers of employment at Jungle Scout are contingent upon clear results of a comprehensive background check. Background checks will be conducted on all final candidates prior to start date.</em></p>"
    },
    {
        "position": "Contributing Writer",
        "company": "TakeShape",
        "location": {
            "city": "Brooklyn • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/takeshape/jobs/888282-contributing-writer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:45.737Z",
        "description": "<p>TakeShape is looking for talented communicators to help tell stories about the amazing projects and exciting developments happening in the world of web development. Compensation will be paid on a per-contribution rate with opportunities to advance within TakeShape's Developer Relations team.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Author how-to guides, technology explainers, and opinions for TakeShape's community and users</li>\n<li>Interview TakeShape community members about their projects </li>\n<li>Pitch new story ideas to TakeShape's editors and source new stories from the developer community</li>\n<li>Provide multimedia assets to accompany stories, including illustrative figures or videos when appropriate</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Knowledge of modern web technologies and the JAMstack</li>\n<li>Strong writing skills and the ability to explain complex subjects clearly and concisely in prose</li>\n<li>Experience writing for a diverse range of audiences with differing levels of expertise in your subject</li>\n<li>The ideal candidate will be involved in the developer community and have an active presence in online communities frequented by web developers</li>\n</ul>\n<h3>About TakeShape</h3>\n<p><a href=\"https://www.takeshape.io/\" target=\"_blank\" rel=\"nofollow\">TakeShape</a> aims to be the essential integration platform that seamlessly connects 17M front-end developers to the APIs they rely on to build their applications. We're developers, looking to make the lives of other developers better. Our founders are proudly based in NYC and we operate as a remote company with employees spread across over the United States.</p>\n<h3>How to Apply</h3>\n<p>We're currently looking for writers who can:</p>\n\n<ul>\n<li>author technical walkthroughs about using TakeShape with other tools, frameworks, and services;</li>\n<li>explain the important technologies in the Jamstack for beginners;</li>\n<li>or tell success stories about the products and services developed by TakeShape's customers.</li>\n</ul>\n\n<p>To join us as a contributor, please submit your resume and a story pitch for one of the above subjects, no longer than 100 words.</p>"
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": ""
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:48.412Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>"
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:50.743Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>"
    },
    {
        "position": "iOS (Swift) development Internship",
        "company": "LookingBus",
        "location": {
            "city": "California • Michigan • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/lookingbus-6/jobs/1003473-ios-swift-development-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:53.113Z",
        "description": "<p>LookingBus helps people with visual impairments to ride public transportation by alerting bus drivers when they are waiting at the stop. The company is offering internships at our Palo Alto office, where interns will have the opportunity to work on our smart city system and take part in improving the accessibility of people with disability. We are looking for developers who believe in our mission, learn fast, move faster, and want to contribute more than just code. With the aging US population, many individuals experience deteriorating vision and face difficulties when accessing public transportation. If you are passionate about our mission, this is the place for you.<br>\nThis opportunity welcomes OPT/CPT students. <br>\nThe intern must have Swift 5 development experience, strong TCP/IP, and the ability to work well in small team environment. Interns must have the ability to manage multiple priorities, flexibility, excellent attention to detail, meet deadlines in a timely manner, and enthusiasm for work and mission.</p>\n\n<p><strong>Responsibilities:</strong> The Intern will work closely with the iOS team.</p>\n\n<p><strong>Qualifications</strong><br>\n• Strong knowledge of iOS SDKs<br>\n• Strong experience in Swift 5<br>\n• Familiarity with RESTful APIs to connect apps to backend services<br>\n• Strong understanding of iOS architecture components<br>\n• Strong knowledge of UI design principles, patterns, and best practices<br>\n• Experience with offline storage, threading, and performance tuning<br>\n• Familiarity with the use of additional sensors, such as gyroscopes and accelerometers<br>\n• Knowledge of the open-source ecosystem and the libraries available for common tasks<br>\n• Ability to understand business requirements and translate them into </p>\n\n<p><strong>Technical requirements</strong><br>\n• Understanding of iOS design principles and interface guidelines<br>\n• Proficient understanding of code versioning tools, such as Git<br>\n• Familiarity with continuous integration<br>\n• BS/MS in Computer Science or related engineering degrees preferred</p>"
    },
    {
        "position": "Android Development Internship",
        "company": "LookingBus",
        "location": {
            "city": "Palo Alto • Ann Arbor • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/lookingbus-6/jobs/1004672-android-development-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:55.385Z",
        "description": "<p>LookingBus is an accessibility system for people with visual impairments to use public transportation. The company is offering internships at our offices in Ann Arbor, MI and Palo Alto, CA, where interns will have the opportunity to work on our smart city system. We are looking for android developers who believe in our mission, learn fast, move faster, and want to contribute more than just code. If you are passionate about our mission, this is the place for you. </p>\n\n<p>This opportunity welcomes OPT/CPT students.</p>\n\n<p>The intern must have android development experience, strong TCP/IP, and the ability to work well in small team environment. Interns must have the ability to manage multiple priorities, flexibility, excellent attention to detail, meet deadlines in a timely manner, and enthusiasm for work and mission.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Design, build and maintain high performance, reusable, and reliable  code.</li>\n<li>Identify and correct bottlenecks and fix bugs.</li>\n<li>Help maintain code quality, organization, and automatization.</li>\n</ul>\n\n<p><strong>Skills</strong></p>\n\n<ul>\n<li>Strong knowledge of AndroidX</li>\n<li>Experience in Java and Kotlin</li>\n<li>Familiarity with RESTful APIs to connect Android applications to backend services</li>\n<li>Strong understanding of Retrofit, RxJava, and Dagger</li>\n<li>Strong knowledge of Android UI design principles and patterns</li>\n<li>Familiarity with the use of gyroscopes and accelerometers</li>\n</ul>"
    },
    {
        "position": "App Developer / Coder",
        "company": "Jeweled",
        "location": {
            "city": "California • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jeweled/jobs/1305300-app-developer-coder",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:57.724Z",
        "description": "<p>Jeweled is a transgender dating app for trans and trans-attracted users. We are looking for a <strong>motivated and talented app developer</strong> who is interested in joining the Jeweled team part-time. This is an unpaid internship opportunity for young developers to <strong>gain work experience</strong> in a startup venture setting. This can be a more permanent hire if the developer is a good match for the company with future promise of shares in the company. Our team is primarily <strong>LGBTQ</strong> so we are interested in a hire that is <strong>open and accepting.</strong> Must have experience coding in <strong>Ionic and/or React</strong>, Most if not all work will be remote. Please contact us for more information!</p>"
    },
    {
        "position": "Game Design and Dev Intern",
        "company": "BLK LUV [org]",
        "location": {
            "city": "Atlanta • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/blk-luv-org/jobs/1131466-game-design-and-dev-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:39:59.995Z",
        "description": "<p>Are you interested in blochain Virtual Reality (VR), VR Gaming and 3D Games that will allow users to get paid in crypto for playing?</p>\n\n<p>Are you passionate about software development, gaming, and mobile technologies? </p>\n\n<p>Are you a self-directed, analytical problem solver that works well in a remote team environment? </p>\n\n<p>Do you want to be part of something great that positively impacts society, especially in times of crisis?</p>\n\n<p>We are looking for you!</p>\n\n<p>BLK LUV org is seeking a game design and development intern that is interested in building virtual reality-based immersive learning experiences based on the Unity framework. This extends from supporting the development of simulation logic to developing gaming environments. Initially, a 40-hour commitment per month, this role provides a ground-floor opportunity to be part of a company that is looking to revolutionize social-emotional gaming while developing community based life skills to make them happier and healthier.</p>\n\n<p><strong>Desired qualifications:</strong><br>\nWorking knowledge of Java, Objective-C, or C/C#/C++, Android/iOS frameworks, and GIT. Solid software development skills with an emphasis on mobile game development, including game physics. Experience with Unity 3D, Unity Plugins (BestHTTP, Final IK, Enjin SDK, NFT SDK, Visual Scripting Libraries, etc.) including experience with scripting, textures, animation, GUI styles, and user session management.Knowledge of 3D graphics API (DirectX, OpenGL, OpenGL ES or, WebXR). Experience in implementing automated testing platforms and unit tests. Prior experience with a well-known mobile title or AAA titles is a plus.</p>\n\n<p>Must be currently enrolled in an accredited university working towards or recently graduated from a BS program. </p>\n\n<p>Responsibilities Implement game functionality as per communicated design. </p>\n\n<p>Translate design specification into a functional game. </p>\n\n<p>Design, build and maintain efficient, reusable, and reliable code. </p>\n\n<p>Ensure the best possible performance, quality, and responsiveness of applications. </p>\n\n<p>Contribute to the design and audio features of the game. Participate in the brainstorming sessions with the team. Proactively prototype new ideas and solutions. </p>\n\n<p>About BLK LUV org,  BLK is LUV and we're a blockchain company building a LUV metaverse of games based on spreading $LUV to heal the world while collecting unique in-game assets. Our first blockchain game is Minecraft so let us know your past experience. BLK LUV org interns are challenged to add value to projects and are encouraged to take risks and think outside of the box. We invest in our interns by providing them with clear direction and leadership for a robust and rewarding experience. Our interns work on real projects that create value for the organization and the students, and do not displace regular employees.In a one-page write-up, tell us what you bring to the role and what you expect to take away. Send us samples of your current work in VR game development. BLK LUV org is an equal opportunity employer. We do not discriminate on the basis of race, sex, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, medical condition, disability, or any other class or characteristic protected by applicable law. We welcome candidates, players, employees, and partners from all backgrounds. We will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable. This position complies with the US Department of Labor Fair Labor Standards Act. Join us!</p>"
    },
    {
        "position": "FULL-STACK Software Developer: Webpage Dev, marketing (PR), Design",
        "company": "Bobly",
        "location": {
            "city": "San Francisco • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/bobly/jobs/1318995-full-stack-software-developer-webpage-dev-marketing-pr-design",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:02.395Z",
        "description": "<p>Intro to Bobly:</p>\n\n<p>We are developers, Business strategists, Tech geeks, and savvy innovators who love what we do – helping change the world with a full-stack D2C sales channel. We are building a global team of brilliant engineers, developers, designers, sales, and marketers who are dedicated to delivering innovative end-to-end technologies for customers. Bobly is all about customer obsession, rapid iteration, and a great attitude with fun, respect, and helping the team win together. Bobly helps companies like Colgate, CVS, Coca-Cola, and Redbull with custom hardware solutions to help grow sales and brand awareness. We deploy hardware powered by AI with a gamified user experience.</p>\n\n<p>Preferred qualifications/experience:</p>\n\n<p>3 years minimum experience within FULL-STACK web development.<br>\nHave worked with techniques/projects like; Responsive web design, Marketing &amp; PR, HTML, HTML5, WordPress, Content writing, Hardware detailing, React.js, CSS, SVG animation.<br>\nExperience creating sales content, partner content, PR, and/or technical product documentation.<br>\nExperience designing and scripting visual digital assets like infographics, wireframes, or video scripts.<br>\nHave been involved with managing global digital content or web experiences.<br>\nValue high quality well crafted visual design, and care about the details highly pixel oriented</p>\n\n<p>Responsibilities: </p>\n\n<p>Redesigning webpage with a more responsive design.<br>\nComing with creative ideas for webpage and marketing online.<br>\nWordPress blog and lead gathering with the updated webpage.<br>\nCreate animations, illustrations, vectors etc..<br>\nPR and content writing<br>\nDisplay interactive engaging design for people visiting the webpage<br>\nFront and backend development</p>\n\n<p>At Bobly, we believe our values and love for our work have been key to our success and are core to our future. We are 100% committed to who we are and what we do. We value people that stand behind their work and team members!</p>\n\n<p>More background:</p>\n\n<p>Bobly is a Scandinavian started company with its base of operations in San Fransico (Bay Area, California). We are a savvy team of inventors and seasoned business strategists. Currently, we deploy a variety of hardware and software solutions for helping clients like CVS, Target, Glamsquad, Colgate-Palmolive, Coca-Cola, Pepsi Co, and others.</p>\n\n<p>We bring a platform of tools for marketing and selling D2C with smart hardware solutions powered by AI &amp; ML.</p>\n\n<p>Intro:</p>\n\n<p>The world’s most advanced platform for building direct contact with END-USERS through smart hardware solutions powered by Artificial intelligence software with a gamified experience.</p>\n\n<p>Bobly is an end-to-end solution for all brand partners or retailers looking for a custom solution to gain new users and understand consumers through deep tech.</p>\n\n<p>Bobly goes way beyond regular vendor partners to create a complete autonomous channel for your brand or retailer. We deliver operational excellence and a stable, scalable infrastructure to help you quickly grow your business.</p>\n\n<p>Webpage: <a href=\"https://www.bobly.com/\" target=\"_blank\" rel=\"nofollow\">https://www.bobly.com/</a></p>"
    },
    {
        "position": "Android Developer",
        "company": "Kuplr",
        "location": {
            "city": "United States • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/kuplr/jobs/703023-android-developer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:04.787Z",
        "description": "<p>We are seeking a Senior Android Developer to join our team.e. </p>\n\n<p>What we are searching for:</p>\n\n<ul>\n<li>You have dedicated 3+ years of direct hands-on experience with<br>\nnative/android development.</li>\n<li>Strong experience using Android Libraries and tooling.</li>\n<li>Experience with continuous integration tools such as Gitlab, Team City,<br></li>\n<li>3+ years of experience working on large scale Android applications</li>\n<li>Firm understanding of the entire mobile development process (design, \ndevelopment, testing, and releases)</li>\n<li>Business-minded approach to time, costs, and deadlines</li>\n<li>Solid understanding of best practices, techniques regarding scalability, \nperformance, and security</li>\n<li>Understanding of Android design principles and interface guidelines</li>\n</ul>\n\n<p>*Equity-only position at this time.</p>"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Jungle Scout",
        "location": {
            "city": "Earth • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jungle-scout/jobs/1331044-senior-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:07.182Z",
        "description": "<p>At Jungle Scout, we are on a mission to empower entrepreneurs and brands to grow successful e-commerce businesses, and we provide the industry-leading data, powerful tools, and resources they need.</p>\n\n<p><strong>The role:</strong></p>\n\n<ul>\n<li>Do you get excited working with talented engineers, leading them to ship product features and enhancements, and helping them thrive in their career?</li>\n<li>Do you define a great day as getting sh*t done and having fun working with your team?</li>\n<li>Do you have a thirst for breaking down complex initiatives into achievable project plans?</li>\n<li>Do you thrive when you're contributing to a high-performing, humble team?</li>\n</ul>\n\n<p><strong>Amazing</strong>, then you’re the type of person we’re looking for!</p>\n\n<p>We’re growing and we are looking to add a Performance Engineering Lead to our fast-paced and customer-oriented Engineering team. </p>\n\n<p>Where would this person be located? Great question! We’re a remote-first company and hope to hire this Senior Software Engineer Team anywhere between the EST - PST timezone</p>\n\n<p>Interested in learning more? Let’s get into the details:  </p>\n\n<p><strong>What you will be doing:</strong></p>\n\n<p>Architect and build:. </p>\n\n<ul>\n<li>new web applications</li>\n<li>microservices </li>\n<li>new features on our existing applications</li>\n</ul>\n\n<p>Make recommendations around:</p>\n\n<ul>\n<li>technologies to be used for new applications </li>\n<li>improvements on existing applications</li>\n</ul>\n\n<p>Scale, maintain and improve:</p>\n\n<ul>\n<li>existing codebases and system infrastructures</li>\n<li>development, staging and production environments of our applications</li>\n</ul>\n\n<p>Participate and contribute in:</p>\n\n<ul>\n<li>code reviews</li>\n<li>project planning and management</li>\n<li>ongoing improvement of engineering practices and procedures</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<p>You’ve done this before. </p>\n\n<ul>\n<li>Proficient in at least one modern programming language (Ruby, Javascript, Python)</li>\n<li>Have built enterprise-level products with modern web development technologies, and popular backend frameworks (e.g., Ruby on Rails, NodeJS, etc)</li>\n</ul>\n\n<p>You’re an AWS Cloud Wizard.</p>\n\n<ul>\n<li>Been working with some subset of AWS services, such as EC2, RDS, DynamoDB, Elasticsearch, ElasticBeanstalk, Lambda, Cloudwatch, SQS, Kinesis and SNS.</li>\n</ul>\n\n<p>You’re a master communicator &amp; passionate mentor. </p>\n\n<ul>\n<li>Fluent in both written &amp; verbal English to easily chat with our North American teams. </li>\n<li>Able to communicate effectively, clearly and concisely on both technical and non-technical subjects. </li>\n<li>Take any chance you can get to share knowledge with your team. </li>\n<li>Contribute to the team’s documentation and mentor teammates in an open, respectful, flexible, empathetic manner. </li>\n<li>Do not shy away from taking and giving feedback.</li>\n</ul>\n\n<p>You’re autonomous. </p>\n\n<ul>\n<li>Successfully execute on large multi-person projects and well-defined initiatives from definition through to the end.</li>\n</ul>\n\n<p><strong>Working at Jungle Scout</strong></p>\n\n<ul>\n<li>The BEST team. </li>\n<li>Remote-first culture.</li>\n<li>International Retreats.</li>\n<li>Access to Jungle Scout tools &amp; experts.</li>\n<li>Performance Bonus. </li>\n<li>Flexible Vacation. </li>\n<li>Comprehensive Health Benefits &amp; Retirement Program. </li>\n<li>We prioritize Diversity, Equity, and Inclusion </li>\n</ul>\n\n<p>At Jungle Scout, we hire great people from a wide variety of backgrounds, not just because it’s the right thing to do, but because it makes our company stronger. </p>\n\n<p>Jungle Scout is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n\n<p><em>All offers of employment at Jungle Scout are contingent upon clear results of a comprehensive background check. Background checks will be conducted on all final candidates prior to start date.</em></p>"
    },
    {
        "position": "Contributing Writer",
        "company": "TakeShape",
        "location": {
            "city": "Brooklyn • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/takeshape/jobs/888282-contributing-writer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:09.859Z",
        "description": "<p>TakeShape is looking for talented communicators to help tell stories about the amazing projects and exciting developments happening in the world of web development. Compensation will be paid on a per-contribution rate with opportunities to advance within TakeShape's Developer Relations team.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Author how-to guides, technology explainers, and opinions for TakeShape's community and users</li>\n<li>Interview TakeShape community members about their projects </li>\n<li>Pitch new story ideas to TakeShape's editors and source new stories from the developer community</li>\n<li>Provide multimedia assets to accompany stories, including illustrative figures or videos when appropriate</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Knowledge of modern web technologies and the JAMstack</li>\n<li>Strong writing skills and the ability to explain complex subjects clearly and concisely in prose</li>\n<li>Experience writing for a diverse range of audiences with differing levels of expertise in your subject</li>\n<li>The ideal candidate will be involved in the developer community and have an active presence in online communities frequented by web developers</li>\n</ul>\n<h3>About TakeShape</h3>\n<p><a href=\"https://www.takeshape.io/\" target=\"_blank\" rel=\"nofollow\">TakeShape</a> aims to be the essential integration platform that seamlessly connects 17M front-end developers to the APIs they rely on to build their applications. We're developers, looking to make the lives of other developers better. Our founders are proudly based in NYC and we operate as a remote company with employees spread across over the United States.</p>\n<h3>How to Apply</h3>\n<p>We're currently looking for writers who can:</p>\n\n<ul>\n<li>author technical walkthroughs about using TakeShape with other tools, frameworks, and services;</li>\n<li>explain the important technologies in the Jamstack for beginners;</li>\n<li>or tell success stories about the products and services developed by TakeShape's customers.</li>\n</ul>\n\n<p>To join us as a contributor, please submit your resume and a story pitch for one of the above subjects, no longer than 100 words.</p>"
    },
    {
        "position": "Android Software Engineer Intern",
        "company": "Saina Health",
        "location": {
            "city": "San Francisco • San Francisco Bay Area • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/sainahealth/jobs/1292971-android-software-engineer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:12.361Z",
        "description": "<p>In this very hands-on role, you will be working with our growing engineering team with implementation and collaborating directly with senior technical leadership. We are looking for an energetic Android Software Engineer to be a key support member of our team. Come work in an awesome start up environment with a fun and talented team. <br>\n<strong>This is an unpaid internship</strong>, though by finishing a successful internship, there is an opportunity to become a key member within our group leading the mobile development process to push up our new 2.0 app release on Android. Are you ready to be part of something big?</p>\n\n<p><strong>Skills and Qualifications:</strong></p>\n\n<ul>\n<li>Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes</li>\n<li>Familiarity with RESTful APIs to connect Android applications to back-end services</li>\n<li>Strong knowledge of Android UI design principles, patterns, and best practices</li>\n<li>Familiarity with cloud message APIs and push notifications</li>\n<li>Proficient understanding of code versioning tools, such as Git</li>\n</ul>\n\n<p><strong>Required Skill Sets:</strong></p>\n\n<ul>\n<li>Excellent problem solving skills</li>\n<li>2+ years building complex Android apps using Java and other frameworks</li>\n<li>Java (Objective C &amp; C++ is a bonus)</li>\n<li>Android Studio + ADT tools</li>\n<li>B.S. in Computer Science or related field, or equivalent work experience</li>\n<li>Have developed (or assisted in the development of) at least 1 Android app in the Google Play store</li>\n</ul>\n\n<p><strong>Additional Qualifications:</strong></p>\n\n<ul>\n<li>Previous successful internships</li>\n<li>Functional programming</li>\n<li>Test-driven development</li>\n<li>Healthcare software development experience</li>\n</ul>\n\n<p>At Saina Health, we believe that diversity is an expression of all the unique characteristics that make us human: race, age, sexual orientation, gender identity, religion, disability, national origin and education — and those are just a few. We recognize that diverse backgrounds and perspectives strengthen our teams and our product. The foundation of our diversity efforts are closely tied to our core values!</p>"
    },
    {
        "position": "Android Developer Intern (Unpaid)",
        "company": "Resolve",
        "location": {
            "city": "Columbus • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/resolve-11/jobs/400258-android-developer-intern-unpaid",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:14.735Z",
        "description": "Resolve is a social media app (in development) where users can put up monetary incentives called \"bounties\" to get things done online. On Resolve you will be able to turn your dollars directly into the actions of others. Resolve supports free market competitive forces for efficiency, but is run with the intent of improving the world and the people in it. Our company culture is one that celebrates productivity for the sake of positivity. If you would like to work for Resolve you will need to see the value in both!<br><br>As an intern, you will have a significant and meaningful role in the development of the prototype Resolve Android application. You will be working side-by-side with the Founders of the company to help build the beta version of the app. There is an opportunity for full-time employment  (with equity compensation) if you prove to be a valuable team member.<br><br>What will you be doing?<br><br>1. Working closely within your team of interns while taking guidance from the Co-Founders.<br><br>2. Turning mock-ups and text descriptions of pages/features into functioning code on an Android mobile app. <br><br>3. Developing an algorithm to rank posts in a user's feed based on which users they are following and which topics they are interested in.<br><br>4. Learning on-the-job to do tasks you may not have experience with. The app will be made from the ground up and while working at a startup, you must wear many hats.<br><br>You don't have to be skilled in all of the above, since we will be recruiting team members with complementary skills. If you believe in Resolve and are willing to work hard we encourage you to apply. If you are interested in working for Resolve you may fill out the online application form here: <a href=\"https://goo.gl/forms/D1jRsgiFxPPYMLGm2\" target=\"_blank\" rel=\"nofollow ugc\">goo.gl/forms/D1jRsgiFxPPYMLGm2</a><br><br>Developer's Website: <a href=\"http://www.resolvedevs.com\" target=\"_blank\" rel=\"nofollow ugc\">resolvedevs.com</a><br><br>Preferred Skills<br><br>Java<br>Android Studio<br>Comfortable with object-oriented programming &amp; APIs"
    },
    {
        "position": "iOS / Android Developer Intern",
        "company": "Rental Property Dashboard",
        "location": {
            "city": "Stockton • San Francisco Bay Area • Sacramento County • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/rental-property-dashboard/jobs/1238506-ios-android-developer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:17.104Z",
        "description": "<p>We're looking for an iOS and/or Android Developer to help grow our business. We are open to any experience level for an equity stake. This is a remote and unpaid position. The Developer must be able and willing to work with an iOS app already built with Swift and/or an Android app already built with Java.</p>"
    },
    {
        "position": "AWS - Backend",
        "company": "Butterflies Dating & Socials",
        "location": {
            "city": "California • United States • San Francisco Bay Area • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/butterflies-dating-socials/jobs/967765-aws-backend",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:19.391Z",
        "description": "<p>Be part of a product engineering team that builds part of Butterflies, ranging from the quintessential application experience to building out our B2C platform. As a backend engineer, you’ll focus on the APIs, data models and capabilities that power the Butterflies experience on web, iOS and Android.</p>\n\n<p>Because we're a smaller engineering team, you'll work up and down the stack across a wide number of technologies, and will balance a number of different concerns. How should we balance the scalability of this feature with getting it in the hands of our users earlier? We'll be looking to you to think through the tradeoffs and make the decision.</p>\n\n<ol>\n<li>Experience with datasbase management, server integration, server management, architectures, devops.</li>\n<li>Expeience with Andriod Studio Backend and possibly iOS backend</li>\n<li>Experience working with API integrations</li>\n</ol>\n\n<p>We are currently a Bootstrapped , pre-revenue early stage startup hence this is not a piad internship currently. We will provide experience certificate for the internship.</p>"
    },
    {
        "position": "Android Developer",
        "company": "AroundU",
        "location": {
            "city": "Boston",
            "state": ""
        },
        "url": "https://angel.co/company/aroundu/jobs/1076534-android-developer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:21.916Z",
        "description": "<p>We are looking for an Android developer and designer who can work with a backend developer to create a fully functioning mobile app based on a Sketch Prototype. Work has already been made on an iOS app so work will be coordinated to ensure the UX is similar across platforms. All compensation is negotiable, open to discuss all options.</p>"
    },
    {
        "position": "Contributing Writer",
        "company": "TakeShape",
        "location": {
            "city": "Brooklyn • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/takeshape/jobs/888282-contributing-writer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:24.474Z",
        "description": "<p>TakeShape is looking for talented communicators to help tell stories about the amazing projects and exciting developments happening in the world of web development. Compensation will be paid on a per-contribution rate with opportunities to advance within TakeShape's Developer Relations team.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Author how-to guides, technology explainers, and opinions for TakeShape's community and users</li>\n<li>Interview TakeShape community members about their projects </li>\n<li>Pitch new story ideas to TakeShape's editors and source new stories from the developer community</li>\n<li>Provide multimedia assets to accompany stories, including illustrative figures or videos when appropriate</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Knowledge of modern web technologies and the JAMstack</li>\n<li>Strong writing skills and the ability to explain complex subjects clearly and concisely in prose</li>\n<li>Experience writing for a diverse range of audiences with differing levels of expertise in your subject</li>\n<li>The ideal candidate will be involved in the developer community and have an active presence in online communities frequented by web developers</li>\n</ul>\n<h3>About TakeShape</h3>\n<p><a href=\"https://www.takeshape.io/\" target=\"_blank\" rel=\"nofollow\">TakeShape</a> aims to be the essential integration platform that seamlessly connects 17M front-end developers to the APIs they rely on to build their applications. We're developers, looking to make the lives of other developers better. Our founders are proudly based in NYC and we operate as a remote company with employees spread across over the United States.</p>\n<h3>How to Apply</h3>\n<p>We're currently looking for writers who can:</p>\n\n<ul>\n<li>author technical walkthroughs about using TakeShape with other tools, frameworks, and services;</li>\n<li>explain the important technologies in the Jamstack for beginners;</li>\n<li>or tell success stories about the products and services developed by TakeShape's customers.</li>\n</ul>\n\n<p>To join us as a contributor, please submit your resume and a story pitch for one of the above subjects, no longer than 100 words.</p>"
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": ""
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:27.111Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>"
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:29.497Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>"
    },
    {
        "position": "Fintech Platform Engineer",
        "company": "Puzzle",
        "location": {
            "city": "North America • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/puzzlefin/jobs/1325485-fintech-platform-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:31.913Z",
        "description": "<p>Leveraging financial information is what Puzzle is all about. We are an ambitious startup, well funded by a top tier VC with an experienced team who have built multiple successful companies and raised over $500M.</p>\n\n<p>We are solving a true pain point that every company has and keeps having as they grow.</p>\n\n<p>We are on a mission to hire the very best and are committed to creating a culture where everyone is respected and has access to equal opportunity. We know that new ideas can come from anywhere in the organization, and the next big idea could be yours!</p>\n\n<p>What Are We Doing?</p>\n\n<p>Starting a company has become easier, but growing a company is more complicated than ever. We are building a real-time, smarter financial infrastructure to put trustworthy data into the hands of decision-makers.</p>\n\n<p>Job Description</p>\n\n<p>As part of Puzzle you will help design and build our financial and accounting system.</p>\n\n<p>We will be ingesting large amounts of data from disparate sources, transforming them, organizing them, and automatically turning them into easily understandable and leverageable company financials.</p>\n\n<p>We want to be as real time as possible, event driven, and decoupled. Redundant, resistant and secure.  And accuracy is key.</p>\n\n<p>This is your opportunity to be an early engineer at a well funded startup that has a successful founder and a drive to change how company's leverage their financials.</p>\n\n<p>What You’ll Do</p>\n\n<ul>\n<li>Deliver on core accounting, auditing and financial infrastructure</li>\n<li>Create unique functionality for correlation of data</li>\n<li>Design interfaces and apis to our data</li>\n<li>Extend and architect our event pipeline for speed and scale</li>\n<li>Extend our core reporting platform</li>\n<li>Work on designing endpoints for our product</li>\n<li>Handle an ever growing stream of data</li>\n<li>Anything else that comes along...</li>\n</ul>\n\n<p>What You Need To Succeed</p>\n\n<p>BS/MS in Computer Science, a related field, or equivalent work experience</p>\n\n<ul>\n<li>2+ years as a software engineer</li>\n<li>Experience with agile software development methodologies</li>\n<li>Experience with accounting and/or financial systems</li>\n<li>Past life as an accounting or CPA is a big plus</li>\n<li>Experience in one of Python, TypeScript, Go</li>\n</ul>\n\n<p>Desired Skills</p>\n\n<ul>\n<li>Practical experience in developing applications using microservices, container technologies, container management systems such as Kubernetes, Mesos etc</li>\n<li>Strong experience with Databases design (SQL, NoSQL) and analytics</li>\n<li>Prior working experience in utility computing and/or cloud computing domain highly desired</li>\n<li>Experience building and deploying applications and services into cloud environments (GCP highly desired)</li>\n</ul>\n\n<p>Puzzle is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.</p>"
    },
    {
        "position": "Android Engineer",
        "company": "FightPandemics",
        "location": {
            "city": "New York • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/fightpandemics/jobs/924569-android-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:34.342Z",
        "description": "<h3>About CareDAO:</h3>\n<p>CareDAO is united by the vision of an interconnected community of humans doing good. From that simple desire to enable connections for the greater good, we are now a collective of more than 1800 who have joined our community. We encompass a rapidly expanding melting pot of skillsets from creators, developers, designers, and product managers to marketing and business professionals from over 80 countries around the world. At CareDAO, we believe in providing a safe, positive, and inclusive environment for co-creation. Today the community collaborates on our help board, FightPandemics, and new product, the marketplace, DoinGud, that will create the space for artists to engage with their communities and sell their work while contributing to the work of social impact organizations.</p>\n\n<p><strong>About DoinGud:</strong></p>\n\n<p>DoinGud is a decentralized, web3 platform on the blockchain and an NFT marketplace fully focused on doing good by bringing together creators, collectors, curators, and social impact organizations to support the giving economy. We are creating a space for artists to engage with their communities and sell their work while contributing to the work of social impact organizations. For every purchase on the marketplace, a minimum of 5% is streamed to social impact organizations and social causes of the creator’s choice. Nearly friction-free.</p>\n<h3>Paid Role Position for DoinGud</h3>\n<p>This is a paid position with flexible hours that can accommodate your schedule. Required team meetings and project working sessions will be essential per the position.</p>\n\n<p>As an <strong>Android Engineer</strong> at DoinGud, you will:</p>\n\n<ul>\n<li>Collaborate with other engineers, Product Managers and other stakeholders (e.g. UX) to maintain a high bar for quality in a fast-paced, iterative environment.</li>\n<li>Solve technical problems of moderate scope and complexity and help scale our infrastructure.</li>\n<li>Design and build advanced applications for the Android platform.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Work with outside data sources and APIs.</li>\n<li>Work on bug fixing and improving application performance.</li>\n<li>Continuously discover, evaluate, and implement new technologies to maximize development efficiency.</li>\n</ul>\n\n<p><strong>Requirements</strong></p>\n<h3>Qualifying Skills:</h3>\n<ul>\n<li>You are passionate about what we are building and you want to contribute and not wait on the sideways.</li>\n<li>Experience in creating micro-services, building data pipes, enabling APIs and scraping.</li>\n<li>Programming in Kotlin.</li>\n<li>Experience with Material Design</li>\n<li>Experience in Android development and SDK.</li>\n<li>Sound knowledge of Android Architecture Components and CLEAN architecture.</li>\n<li>Experience working in a mutli-module environment.</li>\n<li>Experience working with remote data via REST and JSON</li>\n<li>Experience with third-party libraries: Retrofit, Dagger and so on.</li>\n<li>Familiar with <a href=\"http://socket.io/\" target=\"_blank\" rel=\"nofollow\">Socket.io</a>.</li>\n<li>Published/worked on an original Android app</li>\n</ul>\n<h3>Super-Nice-to-haves</h3>\n<ul>\n<li>Openness to learn new technologies.</li>\n<li>Experience working with Git and Github in teams.</li>\n<li>Experience working with a remote team.</li>\n<li>Open source experience.</li>\n<li>Developer platform/tool industry experience.</li>\n</ul>\n\n<p><strong>Benefits</strong></p>\n<h3>Why Join Us?</h3>\n<ul>\n<li><strong>Expand your network.</strong> You get to work as a part of a innovative, global and diverse team.</li>\n<li><strong>Be part of a movement.</strong> We strive for bold changes and envision to make a big impact. Bring your passion, energy and creativity to participate.</li>\n<li><strong>Learn and grow.</strong> You get to continuously learn and develop your skills. You might join us because of your skills in business development, but are able to contribute to any team's work if you'd like.</li>\n<li><strong>Be free.</strong> You have the freedom to set the hours you are able to work every week.</li>\n<li><strong>Do good.</strong> It is a scientific fact that contributing to a good cause improves your well being.</li>\n</ul>"
    },
    {
        "position": "Mobile Engineer/Application Developer - Android Studio (INTERNSHIP)",
        "company": "FLATLAY®",
        "location": {
            "city": "Los Angeles • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/flatlay/jobs/34843-mobile-engineer-application-developer-android-studio-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:36.782Z",
        "description": "<p>Android Engineer (Android Studio)</p>\n\n<p>FLATLAY is looking for an energetic Android Engineer to be a key support member of our team. Become a key teammate working alongside high caliber devs to push out our new 2.0 app release on Android. Are you ready to be part of something big?</p>\n\n<p>RESPONSIBILITIES INCLUDE:</p>\n\n<p>Architect, Design &amp; Develop <br>\nCollaborate with the team and product manager<br>\nProvide creative and technical insight for new feature sets<br>\nCommunicate directly with other engineers<br>\nAdd new feature sets<br>\nTest and successfully launch the new Android app for a feature in the Google Play store</p>\n\n<p>Required Skill Sets</p>\n\n<p>Excellent problem solving skills<br>\n2+ years building complex Android apps using Java and other frameworks<br>\nJava (Objective C &amp; C++ is a bonus)<br>\nGreat understanding of memory &amp; file management<br>\nAndroid Studio + ADT tools<br>\nTime table and deadline management<br>\nB.S. in Computer Science or related field, or equivalent work experience<br>\nHave developed (or assisted in the development of) at least 1 Android app in the Google Play store</p>"
    },
    {
        "position": "iOS Mobile Engineer Internship- 3 Months",
        "company": "Ziplyne",
        "location": {
            "city": "Australia • India • United States • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/ziplyne-3/jobs/921089-ios-mobile-engineer-internship-3-months",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:39.229Z",
        "description": "<p>Looking for someone who has built at least one mobile app from scratch. This is a Minimum 3 month internship.</p>\n\n<p><strong>Your work with us:</strong><br>\n-Creation of sample apps for our sales and product teams<br>\n-Work on the Ziplyne SDK with our Senior team<br>\n-Gather customer / market requirements and write the specifications and research involved with development and strategy</p>\n\n<p>The end result of what we created allows companies to power mobile in-app guides ontop of their native applications.</p>\n\n<p>Postiion is unpaid until we are funded. Thus far bootstrapped but growing rapidly. Exceptions can be made if great performance or experience is demonstrated. </p>\n\n<p>Demo Below:<br>\n<strong>[<a href=\"https://vimeo.com/388523357/b35e41d4d0\" target=\"_blank\" rel=\"nofollow\">https://vimeo.com/388523357/b35e41d4d0</a>]</strong></p>"
    },
    {
        "position": "Pharmacy Intern",
        "company": "Blink Health",
        "location": {
            "city": "Pittsburgh",
            "state": ""
        },
        "url": "https://angel.co/company/blink-health/jobs/907733-pharmacy-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:41.929Z",
        "description": "<p>Blink Health Pharmacy is a new tech-powered pharmacy revolutionizing the way people access prescription medicine. Our pharmacy is affiliated with Blink Health, which leverages its proprietary technology to provide users with access to low negotiated prices on over 15,000 medications.</p>\n\n<p>Our core mission is to delight our customers and turn them into fans.  We understand that in order to do this, we must work closely with pharmacies to ensure prescriptions can be processed quickly and effectively so our customers receive the best experience. You are Blink's champion with the pharmacy. You will field calls to and from pharmacies and prescribers, obtaining prescriptions for Blink’s patients.</p>\n\n<p>We are looking to you to create positive relationships with our pharmacies by assisting them in filling our customers’ medications. This is your opportunity to join a health-tech enterprise. Apply your expertise outside of the retail space in a new and exciting way that offers innovative new services to patients nationwide. </p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Field calls from patients, providers and pharmacies across the country</li>\n<li>Receive, enter, process and fill prescriptions as per Blink protocols.</li>\n<li>Obtain a fundamental understanding of the Blink Health product for quick pharmacy assistance</li>\n<li>Resolve open orders through communication with pharmacists and the Blink Health Customer Experience team </li>\n<li>Perform all tasks in a safe and compliant manner that is consistent with corporate policies as well as State and Federal laws</li>\n<li>Work collaboratively with the management team and pharmacists</li>\n<li>Under the direct supervision of a pharmacist, perform tasks such as external pharmacy transfers, internal pharmacy transfers, and internal verbal orders from providers.</li>\n<li>Other responsibilities as assigned by Pharmacist in Charge</li>\n</ul>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li>Must at least be in Professional Year 2 in an accredited Pharmacy School</li>\n<li>PA Intern License</li>\n<li>Strong phone presence in a support/service capacity</li>\n<li>Strong attention to detail with a high degree of accuracy</li>\n<li><p>Strong technical aptitude and ability to learn complex new software </p></li>\n<li><p>On-site in Pittsburgh</p></li>\n</ul>\n\n<p><em>We are an equal opportunity employer and value diversity of all kinds. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>"
    },
    {
        "position": "Android Development Intern",
        "company": "Community",
        "location": {
            "city": "Austin • New York City • San Francisco • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/communityapp/jobs/1038066-android-development-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:44.249Z",
        "description": "<p>Overview<br>\nCommunity is a fast-growing tech startup based out of Austin, Texas, looking for enthusiastic, driven, and excited college students to join our mission in transforming group management and communication on campus. As we rapidly expand nationwide, we are looking to add a talented, ambitious and hard working Android developer to join our team. If you are excited to get first-hand experience in Android development and jumpstart your career, Community is the best place to start.</p>\n\n<p>Job description<br>\nWe are looking for an experienced and talented Android developer to expand upon the current app architecture and experience designed and tested by the team helping shape unique, user-centric experiences for the consumer. The ideal candidate will have experience working in agile teams, with other developers and marketers. You will be able to make deliberate development decisions and translate any given design into a smooth and functional implementation, all while working alongside an awesome team.</p>\n\n<p><em>Perks</em><br>\nFlexible schedule<br>\nProfessional experience in a high pace tech startup<br>\nLeadership opportunity and experience<br>\nA community of driven, active and hardworking teammates with plenty of knowledge to go round<br>\nNetworking opportunity with execs, mentors, investors and more<br>\nFirst hand involvement in ideating, expanding and building the product<br>\nProffesional development experience with an agile team.<br>\nAnd plenty more!!!</p>\n\n<p>Qualifications<br>\nAndroid development experience <br>\nUnderstanding and experience working with APIs<br>\nTeam player<br>\nMotivated <br>\nAbility to prioritize and manage multiple milestones and projects efficiently</p>"
    },
    {
        "position": "Contributing Writer",
        "company": "TakeShape",
        "location": {
            "city": "Brooklyn • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/takeshape/jobs/888282-contributing-writer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:46.671Z",
        "description": "<p>TakeShape is looking for talented communicators to help tell stories about the amazing projects and exciting developments happening in the world of web development. Compensation will be paid on a per-contribution rate with opportunities to advance within TakeShape's Developer Relations team.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Author how-to guides, technology explainers, and opinions for TakeShape's community and users</li>\n<li>Interview TakeShape community members about their projects </li>\n<li>Pitch new story ideas to TakeShape's editors and source new stories from the developer community</li>\n<li>Provide multimedia assets to accompany stories, including illustrative figures or videos when appropriate</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Knowledge of modern web technologies and the JAMstack</li>\n<li>Strong writing skills and the ability to explain complex subjects clearly and concisely in prose</li>\n<li>Experience writing for a diverse range of audiences with differing levels of expertise in your subject</li>\n<li>The ideal candidate will be involved in the developer community and have an active presence in online communities frequented by web developers</li>\n</ul>\n<h3>About TakeShape</h3>\n<p><a href=\"https://www.takeshape.io/\" target=\"_blank\" rel=\"nofollow\">TakeShape</a> aims to be the essential integration platform that seamlessly connects 17M front-end developers to the APIs they rely on to build their applications. We're developers, looking to make the lives of other developers better. Our founders are proudly based in NYC and we operate as a remote company with employees spread across over the United States.</p>\n<h3>How to Apply</h3>\n<p>We're currently looking for writers who can:</p>\n\n<ul>\n<li>author technical walkthroughs about using TakeShape with other tools, frameworks, and services;</li>\n<li>explain the important technologies in the Jamstack for beginners;</li>\n<li>or tell success stories about the products and services developed by TakeShape's customers.</li>\n</ul>\n\n<p>To join us as a contributor, please submit your resume and a story pitch for one of the above subjects, no longer than 100 words.</p>"
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": ""
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:49.162Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>"
    },
    {
        "position": "Flutter Intern (Future full-time employee)",
        "company": "Chhabraine Technologies",
        "location": {
            "city": "New York City • Delhi • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/chhabraine-technologies/jobs/1274275-flutter-intern-future-full-time-employee",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:51.431Z",
        "description": "<p>We are building a game using flutter  and we are looking for a passonaite flutter developer who has worked on:</p>\n\n<ol>\n<li>Firebase </li>\n<li>Http package</li>\n<li>Flutter Animations</li>\n<li>Have knowledge of atleats Android or ios.</li>\n</ol>\n\n<p>You will be guided by our senior developers and trained to be the best of yourselves. Here we value building the best product over building in time. We have a very collaborative environment where all senior and junior developers work.</p>"
    },
    {
        "position": "DATRO.world Engineer (all types)",
        "company": "DATRO Consortium",
        "location": {
            "city": "California • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/datro/jobs/1247131-datro-world-engineer-all-types",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:53.696Z",
        "description": "<p>If you see an opportunitity to help improve our organisation and technology in some way then you may do so immidiately, since our source code is public and open on github (unclehowell/datro). So grab yourself copy (git pull/clone/checkout), modify your local copy on your own branch name, then submit your proposed improvements (git pull request). This is how we will notice you and reach out to you to discuss remote work opportunities. </p>\n\n<p>In some special cases we may fly you here to the Scottish Bay in the Caribbean to one of our villas, so you may work more closely with our team on a cliff/vesting or sub-contractor deal basis. In recent months and years we've had freelance developers, DD-WRT, Germany and even Google, California guys here to help us with our testnet, our code and organisation.</p>\n\n<p>We don't doubt some of you are more skilled than our teams in some of the areas of technology we're working in, so show us what you've got, show us you understand DATRO and show us you sincerely are willing and able to add value to our project with your skills.</p>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Raklet",
        "location": {
            "city": "San Francisco • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/raklet/jobs/451515-software-engineering-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:56.070Z",
        "description": "<h3>Want to join a small and fast growing startup as an intern? 🚀</h3>\n<p>Raklet is a global SaaS platform with clients all around the world. We offer modern solutions to manage contacts, messages and payments.</p>\n\n<p>We're a team of 5 and we're looking for a software engineer intern to join our fully remote team. We're backed by Microsoft Ventures ve Techstars.</p>\n\n<p>Help us ship amazing products for our clients. Our applications are hosted on Microsoft Azure. Some of the technologies we use:</p>\n\n<ul>\n<li>C# &amp; .NET MVC &amp; Core (both for applications and api)</li>\n<li>Elastic Search</li>\n<li>Redis</li>\n<li>SQL(Azure SQL) and NoSQL(CosmosDB)</li>\n<li>AngularJS, ReactJS</li>\n<li>Git &amp; Github</li>\n<li>Selenium and Unit Testing</li>\n</ul>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Writing clean, high-quality, high-performance, maintainable code</li>\n<li>Develop and support software including applications, database integration, interfaces, and new functionality enhancements</li>\n<li>Coordinate cross-functionally to insure project meets business objectives and compliance standards</li>\n<li>Support test and deployment of new products and features</li>\n<li>Participate in code reviews</li>\n</ul>\n\n<p><strong>Qualifications:</strong></p>\n\n<ul>\n<li>Relevant work experience, projects</li>\n<li>Experience with Agile or Scrum software development methodologies</li>\n<li>Ability to multi-task, organize, and prioritize work</li>\n</ul>\n\n<p><strong>About Raklet:</strong><br>\nTime is the only constraint in this life. With persistent effort, there’s nothing that can stop us.</p>\n\n<p>We try to improve our platform, our processes and our lives 1% every day. One small step at a time.</p>\n\n<p>Our mission is to create the world’s easiest to use platform to build for the web and mobile. Raklet offers free CRM and generates revenue with paid add-ons.</p>\n\n<p>Our clients build their brands, audience, communities on our platform. Design can be customized as they wish. Their own branded apps and sites are easily published with Raklet.</p>\n\n<p>Our team is 100% remote and our teammates are distributed around the world.</p>\n\n<p>We have daily meetings and most of our communication happens on Slack, Github, Intercom, Trello and Figma.</p>\n\n<p>We have unlimited vacation policy. Our team members take as many days as they need.</p>"
    },
    {
        "position": "Cybersecurity Engineer (Intern)",
        "company": "Voatz",
        "location": {
            "city": "Boston • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/voatz/jobs/1001310-cybersecurity-engineer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:40:58.736Z",
        "description": "<p>We are looking for a motivated, talented, energetic Cyber Security Engineering interns who will work alongside full time IT Security and Testing Engineers</p>\n\n<p>Your main responsibilities will include </p>\n\n<ul>\n<li>Pen testing the Android and iOS Applications using various tools and resources, and perform additional security analysis.</li>\n<li>Analysis of the package capture file from the Mock Election using Wireshark</li>\n<li>Security of external facing assets (using open source search to see what is discoverable publicly, shodan, Sectigo/Hackerguarding/Qualys scans) and analysis of scan results</li>\n</ul>\n\n<p><em>Preferred Qualifications</em></p>\n\n<ul>\n<li>2+ years of college education, on track to graduate</li>\n<li>Understanding of OWASP Top 10 and CWE 25</li>\n<li>Extensive knowledge of web applications, web servers, layer 7 application technologies, frameworks and protocols with respect to application development and deployment.</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Knowledgeable about networking applications and protocols</li>\n<li>Experience Jailbreaking or rooting devices</li>\n</ul>\n\n<p><em>Additional Qualifications</em></p>\n\n<ul>\n<li>Previous successful internships</li>\n<li>Functional programming</li>\n<li>Test-driven development</li>\n<li>Cryptography/cryptanalysis or advanced mathematics</li>\n<li>Ethical hacking experience</li>\n<li>Election administration and/or poll worker experience</li>\n</ul>\n\n<p>Details:<br>\nHiring immediately<br>\nCandidate must have access to a MacBook and excellent Wifi</p>"
    },
    {
        "position": "ADVISOR - FULL STACK (FRONTEND/BACKEND) PROGRAMMER - Remote Volunteer",
        "company": "ZAKKI",
        "location": {
            "city": "Indonesia • Ithaca • Semarang • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/zakki/jobs/1106470-advisor-full-stack-frontend-backend-programmer-remote-volunteer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:01.285Z",
        "description": "<h3>ADVISOR  — Remote Volunteer</h3>\n<p>ZAKKI is a social startup focusing on creating an inclusive community for the elderly and people with disabilities. Our mission is to facilitate alms and donations collection and distribution to help the elderly and people with disabilities who work in the informal sector to get better livelihood through micro-business management, giving them greater market exposure.</p>\n\n<p>Our Minimum Viable Product (MVP) can be found on <a href=\"https://www.zakki.org\" target=\"_blank\" rel=\"nofollow\">https://www.zakki.org</a>.<br>\nCurrently, we are still redesigning ZAKKI fully function product. We are expecting to develop the ZAKKI fully function product in the upcoming years.</p>\n\n<p>ZAKKI is an online platform-based organization (website and mobile application) that is focused on helping the elderly and people with disabilities get better livelihoods to build inclusive communities in Indonesia. ZAKKI facilitates the collection and distribution of donations to help the elderly and people with disabilities working in the informal sector to obtain better livelihoods through the assistance of micro business management and giving them greater market exposure.</p>\n\n<p>Currently, ZAKKI is developing a ramification project; reporting platforms of sexual misconduct (sexual harassment, sexual assault, rape), human trafficking, and bullying. And we also have an ongoing anti-corruption and a lost-found project. EduGame of anti-discrimination and anti-violence for toddlers to pre-teens. We also have a funeral service project . The volunteer networking and community learning hub. And last but not least, the ZAKKI on the spot marketplace intended to cater to the beneficiaries (the elderly and people with disability) micro-business market exposure.</p>\n\n<p>ZAKKI provides equal volunteering opportunity for everyone regardless of age, sex/gender, color, race, creed, nationality/origin, marital status, sexual orientation, political belief, or disability that does not prohibit essential performance job functions. All matters relating to volunteering are based upon one’s ability to perform the job, as well as one’s dedication to ZAKKI’s Mission and needs.</p>\n\n<p>We are recruiting VOLUNTEER as either DEVELOPER ADVISOR and or PROGRAMMER itself.</p>\n\n<p>The <strong>DEVELOPER ADVISOR only required to give advice to the UIUX DESIGNER team concerning the feasibility a feature can be developed</strong>. We are not expecting the DEVELOPER ADVISOR to do coding (programming). While for the PROGRAMMER, the volunteer require contributing to the development of the product, means to do coding (programming) the product.</p>\n\n<p>General Requirement:<br>\n<strong>• Keen, enjoy, and excited to contribute for social caused and social change.<br>\n• Thinker and Do-er person<br>\n• Abundance with idea and initiative working as a team<br>\n• Active, helpful and collaborative person (not passive person)<br>\n• Good time-management skills<br>\n• Communicative (good communication skills to collaborate with various stakeholders)<br>\n• Proficiency in English<br>\n• Have competency to do their chosen role/position<br>\n• Open web standards technologies, HTML, CSS, and JavaScript, including jQuery, Vue JS and other libraries,<br>\n• Able to use versioning control system such as GIT, GitLab, SVN</strong></p>\n\n<p>Specific Requirement:<br>\nKnowledge of one or more of these skills below:</p>\n\n<p><strong>PWA DEVELOPER :</strong><br>\n• Server-side application development in PHP using frameworks such as Laravel<br>\n• Linux system administration, web server configuration, SQL database (Oracle or MySQL or PostgreSQL), No SQL (Mongo DB) and other common web stack technologies</p>\n\n<p><strong>MOBILE DEVELOPER:</strong><br>\n• Java Programming<br>\n• Hybrid programming for Mobile such as Flutter, Ionic, React Native.</p>\n\n<p><strong>GAME DEVELOPER :</strong><br>\n• OpenGL, Unity 3D, WebGL, and languages such as C, C++, and Java, JavaScript, HTML5, Swift<br>\n• Have competencies and interest in making games (2D/3D) with levelling system, Building Android app, understand iOS is a plus</p>\n\n<p>Interested applicant required to fill up this Google Form.<br>\n<a href=\"https://\" target=\"_blank\" rel=\"nofollow\">https://forms.gle/iY7xUbf63QpmdTXb8</a></p>\n\n<p>Please submit the Google Form with your CV/resume and portfolio URL link (Github/Gitlab).</p>\n\n<p>After the submission, you still able to edit your submitted respond in case you need to update your supporting documents (i.e CV/Resume)</p>\n\n<p>For any further queries related to the volunteering vacancy, feel free to reach us out at <a href=\"mailto:hr@zakki.org\" target=\"_blank\" rel=\"nofollow\">hr@zakki.org</a>.</p>"
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": ""
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:04.035Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>"
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:06.383Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>"
    },
    {
        "position": "Fintech Platform Engineer",
        "company": "Puzzle",
        "location": {
            "city": "North America • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/puzzlefin/jobs/1325485-fintech-platform-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:09.026Z",
        "description": "<p>Leveraging financial information is what Puzzle is all about. We are an ambitious startup, well funded by a top tier VC with an experienced team who have built multiple successful companies and raised over $500M.</p>\n\n<p>We are solving a true pain point that every company has and keeps having as they grow.</p>\n\n<p>We are on a mission to hire the very best and are committed to creating a culture where everyone is respected and has access to equal opportunity. We know that new ideas can come from anywhere in the organization, and the next big idea could be yours!</p>\n\n<p>What Are We Doing?</p>\n\n<p>Starting a company has become easier, but growing a company is more complicated than ever. We are building a real-time, smarter financial infrastructure to put trustworthy data into the hands of decision-makers.</p>\n\n<p>Job Description</p>\n\n<p>As part of Puzzle you will help design and build our financial and accounting system.</p>\n\n<p>We will be ingesting large amounts of data from disparate sources, transforming them, organizing them, and automatically turning them into easily understandable and leverageable company financials.</p>\n\n<p>We want to be as real time as possible, event driven, and decoupled. Redundant, resistant and secure.  And accuracy is key.</p>\n\n<p>This is your opportunity to be an early engineer at a well funded startup that has a successful founder and a drive to change how company's leverage their financials.</p>\n\n<p>What You’ll Do</p>\n\n<ul>\n<li>Deliver on core accounting, auditing and financial infrastructure</li>\n<li>Create unique functionality for correlation of data</li>\n<li>Design interfaces and apis to our data</li>\n<li>Extend and architect our event pipeline for speed and scale</li>\n<li>Extend our core reporting platform</li>\n<li>Work on designing endpoints for our product</li>\n<li>Handle an ever growing stream of data</li>\n<li>Anything else that comes along...</li>\n</ul>\n\n<p>What You Need To Succeed</p>\n\n<p>BS/MS in Computer Science, a related field, or equivalent work experience</p>\n\n<ul>\n<li>2+ years as a software engineer</li>\n<li>Experience with agile software development methodologies</li>\n<li>Experience with accounting and/or financial systems</li>\n<li>Past life as an accounting or CPA is a big plus</li>\n<li>Experience in one of Python, TypeScript, Go</li>\n</ul>\n\n<p>Desired Skills</p>\n\n<ul>\n<li>Practical experience in developing applications using microservices, container technologies, container management systems such as Kubernetes, Mesos etc</li>\n<li>Strong experience with Databases design (SQL, NoSQL) and analytics</li>\n<li>Prior working experience in utility computing and/or cloud computing domain highly desired</li>\n<li>Experience building and deploying applications and services into cloud environments (GCP highly desired)</li>\n</ul>\n\n<p>Puzzle is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.</p>"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Jungle Scout",
        "location": {
            "city": "Earth • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jungle-scout/jobs/1331044-senior-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:11.611Z",
        "description": "<p>At Jungle Scout, we are on a mission to empower entrepreneurs and brands to grow successful e-commerce businesses, and we provide the industry-leading data, powerful tools, and resources they need.</p>\n\n<p><strong>The role:</strong></p>\n\n<ul>\n<li>Do you get excited working with talented engineers, leading them to ship product features and enhancements, and helping them thrive in their career?</li>\n<li>Do you define a great day as getting sh*t done and having fun working with your team?</li>\n<li>Do you have a thirst for breaking down complex initiatives into achievable project plans?</li>\n<li>Do you thrive when you're contributing to a high-performing, humble team?</li>\n</ul>\n\n<p><strong>Amazing</strong>, then you’re the type of person we’re looking for!</p>\n\n<p>We’re growing and we are looking to add a Performance Engineering Lead to our fast-paced and customer-oriented Engineering team. </p>\n\n<p>Where would this person be located? Great question! We’re a remote-first company and hope to hire this Senior Software Engineer Team anywhere between the EST - PST timezone</p>\n\n<p>Interested in learning more? Let’s get into the details:  </p>\n\n<p><strong>What you will be doing:</strong></p>\n\n<p>Architect and build:. </p>\n\n<ul>\n<li>new web applications</li>\n<li>microservices </li>\n<li>new features on our existing applications</li>\n</ul>\n\n<p>Make recommendations around:</p>\n\n<ul>\n<li>technologies to be used for new applications </li>\n<li>improvements on existing applications</li>\n</ul>\n\n<p>Scale, maintain and improve:</p>\n\n<ul>\n<li>existing codebases and system infrastructures</li>\n<li>development, staging and production environments of our applications</li>\n</ul>\n\n<p>Participate and contribute in:</p>\n\n<ul>\n<li>code reviews</li>\n<li>project planning and management</li>\n<li>ongoing improvement of engineering practices and procedures</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<p>You’ve done this before. </p>\n\n<ul>\n<li>Proficient in at least one modern programming language (Ruby, Javascript, Python)</li>\n<li>Have built enterprise-level products with modern web development technologies, and popular backend frameworks (e.g., Ruby on Rails, NodeJS, etc)</li>\n</ul>\n\n<p>You’re an AWS Cloud Wizard.</p>\n\n<ul>\n<li>Been working with some subset of AWS services, such as EC2, RDS, DynamoDB, Elasticsearch, ElasticBeanstalk, Lambda, Cloudwatch, SQS, Kinesis and SNS.</li>\n</ul>\n\n<p>You’re a master communicator &amp; passionate mentor. </p>\n\n<ul>\n<li>Fluent in both written &amp; verbal English to easily chat with our North American teams. </li>\n<li>Able to communicate effectively, clearly and concisely on both technical and non-technical subjects. </li>\n<li>Take any chance you can get to share knowledge with your team. </li>\n<li>Contribute to the team’s documentation and mentor teammates in an open, respectful, flexible, empathetic manner. </li>\n<li>Do not shy away from taking and giving feedback.</li>\n</ul>\n\n<p>You’re autonomous. </p>\n\n<ul>\n<li>Successfully execute on large multi-person projects and well-defined initiatives from definition through to the end.</li>\n</ul>\n\n<p><strong>Working at Jungle Scout</strong></p>\n\n<ul>\n<li>The BEST team. </li>\n<li>Remote-first culture.</li>\n<li>International Retreats.</li>\n<li>Access to Jungle Scout tools &amp; experts.</li>\n<li>Performance Bonus. </li>\n<li>Flexible Vacation. </li>\n<li>Comprehensive Health Benefits &amp; Retirement Program. </li>\n<li>We prioritize Diversity, Equity, and Inclusion </li>\n</ul>\n\n<p>At Jungle Scout, we hire great people from a wide variety of backgrounds, not just because it’s the right thing to do, but because it makes our company stronger. </p>\n\n<p>Jungle Scout is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n\n<p><em>All offers of employment at Jungle Scout are contingent upon clear results of a comprehensive background check. Background checks will be conducted on all final candidates prior to start date.</em></p>"
    },
    {
        "position": "Gabb Global Unity Game Developer",
        "company": "Gabb Global",
        "location": {
            "city": "Washington DC • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/gabbglobal/jobs/490447-gabb-global-unity-game-developer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:14.125Z",
        "description": "<p>Company Description</p>\n\n<p>Gabb Global is devoted to creating a comfortable and cutting-edge method of language learning. Our immersive virtual reality, gaming format are personalized to offer refreshing, unforgettable language learning experiences. Gamification, technology, and innovation are paramount to engaging today's learners and enabling sufficient content mastery.  My start up, Gabb, takes the foundations of neuroscience, a language curriculum tailored to user interests/purpose, and filter foreign language through real-world learning scenarios, and powerful learning dynamic of gamification (aka what makes games fun!): escape, collection, discovery, pattern recognition, and other risk/reward activities. We masterfully integrated elements of gamification to engage, inspire, and improve user’s conversation, writing, speaking, and listening skills. Our we focus on gamification as a design sensibility.We are looking for a talented Game developer to turn a game idea into code on a fast moving environment. You will be involved in various aspects of game’s creation from concept to finished product including coding, programming, audio, design, production and visual arts. As a Gabb Global Gaming Development Intern, you are helping us constantly break new ground with graphically rich mobile games, fun new genres of mobile entertainment, and innovative technologies.</p>\n\n<p>Responsibilities</p>\n\n<p>Implement game functionality as per communicated design<br>\nTranslate design specification into functional game<br>\nCommunicate with other team members to establish effective pipeline and integrate media assets<br>\nDesign, build, and maintain efficient, reusable, and reliable code<br>\nEnsure the best possible performance, quality, and responsiveness of applications<br>\nIdentify bottlenecks and bugs, and devise solutions to address and mitigate these problems<br>\nHelp maintain code quality, organization, and automatization</p>\n\n<p>Skills</p>\n\n<p>Excellent knowledge of Unity, including experience with scripting, textures, animation, GUI styles, and user session management<br>\nFamiliarity with level design and planning<br>\nExperience with game physics and particle systems<br>\nExperience with mobile and console game development<br>\nExperience optimizing memory and space usage for support of older hardware<br>\nExperience with 3D is a plus<br>\nPrior experience with a well-known mobile title or AAA titles are a significant asset</p>"
    },
    {
        "position": "Front & Backend Software Engineer Intern",
        "company": "MiBolsillo Financial Tecnologies",
        "location": {
            "city": "Washington DC • Lima District • São Paulo • Guatemala City • Mexico City • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/mibolsillo-financial-tecnologies/jobs/689399-front-backend-software-engineer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:16.516Z",
        "description": "<p>In this very hands-on role, you will be working with our growing engineering team in Peru with implementation and collaborating directly with senior technical leadership in Brazil. You will also be creating new mobile application modules from scratch, extending the current codebase, and designing new system architecture for future expansion in a high up-time and high availability environment. Specifically, candidates will apply their combination of problem solving and hands-on coding experience towards the deployment of our main mobile app across the different countries we are based in. </p>\n\n<p><strong>Key Responsibilities:</strong></p>\n\n<p>• Write scalable, robust, testable, efficient, and easily maintainable code<br>\n• Translate software requirements into stable, working, high performance software<br>\n• Play a key role in architectural and design decisions, building toward an efficient distributed architecture<br>\n• Become a leader in our growing engineering team by sharing best practices, code reviews, pair programming and technical mentoring<br>\n• Work side-by-side with CTO on core infrastructure and systems<br>\n• Interact with product and project teams for collaboration, planning and requirements definition.</p>\n\n<p><strong>This is an unpaid internship, though you'll get:</strong></p>\n\n<p>• Comprehensive training every day<br>\n• Master top programming languages. Yes, resume bling!<br>\n• Train with current top producers and improve daily with feedback<br>\n• Thorough performance evaluation to provide to your school.</p>\n\n<p>At MiBolsillo, we believe that diversity is an expression of all the unique characteristics that make us human: race, age, sexual orientation, gender identity, religion, disability, national origin and education — and those are just a few. We recognize that diverse backgrounds and perspectives strengthen our teams and our product. The foundation of our diversity efforts are closely tied to our core values!</p>"
    },
    {
        "position": "BackEnd Software Development Intern",
        "company": "Amalgam: The Blockchain Company",
        "location": {
            "city": "Boston • Los Angeles • New York City",
            "state": ""
        },
        "url": "https://angel.co/company/amalgam-5/jobs/924540-backend-software-development-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:18.979Z",
        "description": "<p>Needless to say that like any other position for which we hire, we need the best of the best! We need <strong>backend</strong> developers competent in JavaScript, Solidity, Python, PHP and more.  Amalgam is preparing for its latest token offering and we're looking to fill this role immediately. You will work closely with the CEO and CTO while building out several of our software solutions, from a P2P Payment Platform, to a Supply Chain Management software, to a proprietary Web Browser and more. </p>\n\n<p>UX architecture design skills are a plus, but not required</p>"
    },
    {
        "position": "Full-Stack Software Engineer",
        "company": "Amalgam: The Blockchain Company",
        "location": {
            "city": "Boston • New York City • Cambridge",
            "state": ""
        },
        "url": "https://angel.co/company/amalgam-5/jobs/578174-full-stack-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:21.391Z",
        "description": "<p>You are someone who is familiar with the full software life cycle, can adapt quickly with a small, collaborative team, and thrives on envisioning, building, and implementing new products from scratch. You have proven experience selecting technology stacks and know how to build, select, and use state of the art monitoring and deployment technologies.</p>\n\n<p><strong>THE JOB</strong></p>\n\n<p>Develop new features on our CICD Pipeline<br>\nCollaborate with product, frontend and the rest of the engineering team.<br>\nContribute to overall product strategy and iteration as a key member of our small, founding team.<br>\nWork on our web-based internal back office<br>\nBuild data pipelines, visualizations and dashboards with datasets across multiple platforms<br>\nBuild end to end features from scratch through the backend to our mobile, web and desktop platforms.<br>\nRun with and own different engineering projects as we quickly iterate and improve our product.</p>\n\n<p><strong>WHAT YOU’LL BRING</strong></p>\n\n<p>You move fast with a passion for quality.<br>\nYou approach every project with ownership and dedication.<br>\nYou can take high-level goals and deliver shippable production code with monitoring built in.<br>\nYou can build for agility and fast iteration given the early stage we are at.<br>\nYou value design, extensibility of the codebase as well as testing and maintainability<br>\nYou can work as both an individual contributor and team leader.<br>\nYou are passionate about the blockchain, payments and cybersecurity spaces and working on something deeper purpose and the additional challenges that brings.<br>\nYou feel comfortable working on both UI and backend technologies<br>\nExtra points if you have experience in DevOps or AI/Machine Learning</p>\n\n<p><strong>WHAT WE OFFER</strong></p>\n\n<p>Competitive salary (based on experience)<br>\nMedical, vision, and dental insurance<br>\nUnlimited leave<br>\nFlexible hours<br>\nDiscounts and perks for local restaurants, sports and entertainment events<br>\nRegular team events<br>\nWeekly team lunch and free drinks in the office<br>\nProfessional development opportunities (e.g. language lessons, trainings, etc.)</p>"
    },
    {
        "position": "Internship in React Native Android App (Remote & Unpaid)",
        "company": "niiti",
        "location": {
            "city": "Chicago • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/niiti/jobs/750693-internship-in-react-native-android-app-remote-unpaid",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:23.798Z",
        "description": "<p>If you are looking to be a pioneer in creation of a seamless behavior of devices for its users, an opportunity to be part of an implementation of a new Android app from scratch to deployment, then come help us launch HuTouch (product by Niiti).</p>\n\n<p>At Niiti, we focus on providing real life experiences so that students can: </p>\n\n<ol>\n<li>Gain advanced core skills</li>\n<li>Work with teams of different domains</li>\n<li>Learn what it takes to deliver on commitments </li>\n</ol>\n\n<p>Outgoing interns see this as a path to their dream jobs.<br>\n\"<em>one of the coolest projects... it feels great knowing that my work will help impact and augment the end-user experience</em>\" - Nitish V (College of Engineering, University of Michigan). Read more about what our interns say on our HuTouch Group on LinkedIn: <a href=\"https://www.linkedin.com/groups/8991258/\" target=\"_blank\" rel=\"nofollow\">https://www.linkedin.com/groups/8991258/</a></p>\n\n<p>HuTouch is part of an early stage startup with its MVP. HuTouch is Apple Handoff for non-apple devices, i.e., it will allow users to pick up their activities (apps, data) from where they stopped when they move between devices. </p>\n\n<p>HuTouch needs a React Native mobile application developer intern (specifically for Android) to help accomplish the below goals &amp; tasks (priority as stated):</p>\n\n<ol>\n<li>Research and development to identify solutions for functionalities designed by our early adopters. You will be required to have problem solving skills, study different materials and come up with solutions for  functionalities within HuTouch that are not developed yet. This may take up 40% to 50% of your time on this project.</li>\n<li>Deliver code &amp; User Experience not just with high quality but also with a logical flow in mind. The tasks associated to this job requirement is coding and unit testing, where the intern will need to make sure no critical or high defects creep into the developed code. This may take 30% to 40% of your time on this project. </li>\n<li>Demo of individual features developed and end to end flow. It'll be required for you to present the working app to the founder over a call while you screen share. There is no need for powerpoint presentations here, as this will be a pure demo of the app. This will take up 10% to 20% of your time on this project. </li>\n<li>Understand the flow within HuTouch and apply it to design frameworks for HuTouch. An intern will be asked to read about HuTouch, React Native for Android, to think like an architect and identify any foreseeable risks during implementation. This will take up the remaining time on this project.<br></li>\n</ol>\n\n<p>Visit <a href=\"http://www.HuTouch.com\" target=\"_blank\" rel=\"nofollow\">www.HuTouch.com</a> for more details &amp; to see the demo video on our patent pending concept on continuity.</p>\n\n<p>Skills required:</p>\n\n<ol>\n<li>Knowledge of coding skills in React Native platform for Android</li>\n<li>Client side coding to interact with APIs for AWS or cloud solutions</li>\n<li>Problem solving skills that drives the urge to solve by looking at a problem from different angles/scenarios and presenting with multiple solutions.</li>\n<li>Communication skills to articulate the problem and clarify assumptions</li>\n</ol>"
    },
    {
        "position": "Backend Engineer Intern - Remote",
        "company": "Streamforge",
        "location": {
            "city": "Boston • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/streamforge/jobs/942894-backend-engineer-intern-remote",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:26.141Z",
        "description": "<p><strong>Job Summary</strong><br>\nAs part of the Streamforge engineering team you will work to build out several products that help connect content creators to sponsorship opportunities.</p>\n\n<p><strong>Required Qualifications</strong></p>\n\n<ul>\n<li>Proficiency in Javascript.</li>\n<li>Experience with NodeJS and a complementary front-end framework. such as React, or Vue.</li>\n<li>Knowledge of the gaming industry either as a gamer or content creator.</li>\n</ul>\n\n<p><strong>Preferred Qualifications</strong></p>\n\n<ul>\n<li>We are very passionate about what we do and value that same passion in an applicant.</li>\n<li>Experience using Twitch.tv as a viewer or streamer is a plus.</li>\n</ul>"
    },
    {
        "position": "Frontend Engineer Intern - Remote",
        "company": "Streamforge",
        "location": {
            "city": "Boston • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/streamforge/jobs/786716-frontend-engineer-intern-remote",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:29.226Z",
        "description": "<p><strong>Job Summary</strong><br>\nAs part of the Streamforge engineering team you will work to build out several products that help connect content creators to sponsorship opportunities.</p>\n\n<p><strong>Required Qualifications</strong></p>\n\n<ul>\n<li>Proficiency in Javascript. Experience with NodeJS and a complementary front-end framework. such as React, or Vue.</li>\n<li>Knowledge of the gaming industry either as a gamer or content creator.</li>\n</ul>\n\n<p><strong>Preferred Qualifications</strong></p>\n\n<ul>\n<li>We are very passionate about what we do and value that same passion in an applicant.</li>\n<li>Experience using Twitch.tv as a viewer or streamer is a plus.</li>\n</ul>"
    },
    {
        "position": "Lead, JavaScript Engineer (Overseas Deployment in Cebu City, Philippines)",
        "company": "Therma",
        "location": {
            "city": "Philippines • Cebu City",
            "state": ""
        },
        "url": "https://angel.co/company/hellotherma/jobs/1225228-lead-javascript-engineer-overseas-deployment-in-cebu-city-philippines",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:31.614Z",
        "description": "<p>As a JavaScript Engineering Lead you will be responsible for creating user-focused experiences, optimizing integrations between Therma and third-party hardware/software vendors, and developing scalable code that may serve as the foundation for future innovation. Working from our APAC Headquarters, you will directly lead a JavaScript development team, providing guidance and implementing industry best practices while also collaborating closely with our Mobile, Hardware, and QA organizations, helping to mentor and develop a world-class engineering organization as the company scales.</p>\n\n<p>This role reports directly to the Software Engineering Manager and is based out of our APAC Headquarters located in Cebu City, Philippines (remote time zone during Covid-19 pandemic). Relocation will be provided.</p>\n<h3><strong>About You</strong></h3>\n<ul>\n<li>4+ years of professional work experience building and maintaining full-stack applications</li>\n<li>Advanced proficiency in JavaScript</li>\n<li>Intermediate proficiency with Node.js, React, and PostgresSQL</li>\n<li>Demonstrable experience building publicly-consumable APIs and platforms</li>\n<li>Prior professional experience working within distributed development environments</li>\n<li>Prior experience working within an early-stage technology company environment, preferably within the Enterprise SaaS and/or IoT Hardware space</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>$140k – $160k salary</li>\n<li>0.25% – 0.5% equity</li>\n</ul>"
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:33.933Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "brewsy",
        "location": {
            "city": "New Orleans • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/brewsy/jobs/1203339-software-engineer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:36.344Z",
        "description": "<p>Brewsy is looking for an excited, intelligent, and excellent software engineering to help build our tech infrastructure.</p>\n\n<p>We're on a mission to democratize winemaking through our product line of innovative offerings that allow anyone to turn their favorite beverages into delicious wine at home in less than a week. Better yet, we're building an amazing community around the digital hobbyspace of making amazing wines &amp; ciders with Brewsy.</p>\n\n<p>We're building the world's biggest movement in modern viniculture history: the craft wine movement. We advocate for a future in which making amazing wines and ciders at home is as easy &amp; fun as cooking dinner.</p>\n\n<p>Brewsy is introducing the world to craft-winemaking. Help us build an incredible digital experience for Brewsy!</p>\n\n<p>You'll help us:</p>\n\n<ul>\n<li>design and build our mobile app experience</li>\n<li>design and build a beautiful and high-converting eCommerce site</li>\n<li>implement a top-of-class customer messaging experience</li>\n<li>and more :)</li>\n</ul>\n\n<p>Some types of experiences we're especially excited to see:</p>\n\n<ul>\n<li>react native &amp; firebase</li>\n<li>strong frontend fundamentals (html/css/js)</li>\n<li>shopify liquid</li>\n<li>functional programming (bonus points for elixir)</li>\n</ul>\n\n<p>Your work will be on display to hundreds of thousands of people. This role is a fantastic opportunity to experience first-hand the adventure &amp; magic of working at a young startup.</p>\n\n<p>Brewsy is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>"
    },
    {
        "position": "Game Developer Internship",
        "company": "TutorDudes",
        "location": {
            "city": "Washington DC • San Francisco • Palo Alto • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/tutordudes/jobs/1209613-game-developer-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:38.716Z",
        "description": "<p>Job Summary<br>\nTutorDudes seeks students enrolled in Computer Science, Computer Engineering, Web Development or related disciplines to fill intern positions for Gaming Developer. This Internship is available year-round, but priority is set in the fall and spring semester. Summer is available, however, that request must be evident in your cover letter. This internship is 100% remote completed with a Program Supervisor, who will review your work and assign teams to work on various projects. This internship is part-time.</p>\n\n<p>**<em>Interns who apply must be able to reach out when we conduct our overview calls. Interns will have a 48 hour window to contact us before their application is removed from consideration.<br>\n*</em><br>\nTime commitment: 20 hours per week, 105 days<br>\nLocation: This is a VIRTUAL internship<br>\nPayment: This is UNPAID Internship<br>\nCourse Credit: Many universities have a study program or courses to help accommodate course credit for internships, if so, you must alert the Program Supervisor to approve your study program.</p>\n\n<p>Requirements:<br>\nOngoing student at a university<br>\nKnowledge of Android Studios and IOS.<br>\nKnowledge in Java, Javascript, HTML, and CSS<br>\nKnowledge in Swift for IOS</p>\n\n<p>Key Competencies/Success Factors<br>\nPatient, understanding, and dedicated<br>\nAbility to break down a complex problem into a simple explanation<br>\nAbility to build and maintain rapport with other team members<br>\nAbility to teach others successfully<br>\nAbility to organize and manage multiple responsibilities successfully<br>\nBuilding using IOS or Android Studios and converting to desktop</p>\n\n<p>TutorDudes Gaming Division creates sophisticated educational gaming  products that institutions or parents/students can use when visiting our website and order for their educational or private use. Given the widespread use of critical lack in higher learning institutions today, it is essential that gaming products be created/updated and with a taste in innovation against the threats of damp machine learning. We have built a dynamic, team-oriented, and highly creative work environment.</p>\n\n<p>Why us?<br>\nWhy should you join TutorDudes?<br>\nTutorDudes does not only provide a dynamic, virtual, and personalized tutoring service providing students with Math, English, and Science conceptual tutoring. TutorDudes is also pioneering a next generation business model for higher education. TutorDudes has become more than an educational company, our Gaming Division has specifically designed to meet the current industry's current and emerging technology needs and innovation to meet the needs of the higher education industry as a whole. The size and makeup of our organization enable forward thinking, professionals thrive and prosper. In this internship, you will lead innovation with a dedicated team and a Program Supervisor, not a show of hands.</p>"
    },
    {
        "position": "Software Internship",
        "company": "Pinch",
        "location": {
            "city": "Los Angeles • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pinch-20/jobs/1046873-software-internship",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:41.469Z",
        "description": "<p>At Pinch we want to help people be the best they can be, and financial stress can make it even harder. Pinch provides students with access to capital, allowing students to cover those unforseen and added expenses. Removing added stressors and allowing students to focus on their acedemics and personal development. </p>\n\n<p>What you would do:</p>\n\n<ol>\n<li>Lead IOS/Android development of the Pinch app</li>\n<li>Work with founding team to fine tune and test UI/UX</li>\n<li>Manage Data Security</li>\n<li>Use technical knowlegde to advise on how to make things happen</li>\n</ol>\n\n<p>WHat we hope you can do:</p>\n\n<ol>\n<li>Proficient in one or several of the following languages (Python, Java, Javascript, .net, Go)</li>\n<li>Experience with REST API </li>\n<li>Ability to effectively communicate technical aspects in laymans terms</li>\n<li>Project management</li>\n</ol>\n\n<p>What we would love if you knew:</p>\n\n<ol>\n<li>Knowledge in HTML / Web design</li>\n<li>Knowledge in mobile payments </li>\n<li>Knowledge in digital wallets</li>\n</ol>"
    },
    {
        "position": "Founding Engineer",
        "company": "pynhq.com",
        "location": {
            "city": "Sydney • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/pynhq-com/jobs/1142569-founding-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:43.725Z",
        "description": "<p>Have you ever wanted to know what it is like to build a startup from the ground up? If you’ve ever wanted to found your own company, or just get experience of scale at this unique stage - this is the role for you.</p>\n\n<p>In this role you will do many things that might be familiar as a Principal, Full-Stack, or another type of Engineer. What’s different about a Founding Engineer is you’re first building a company and a culture. And the customer and product follows that.</p>\n\n<p>What we really want in a Founding Engineer is someone who wants build something great from the ground up. More importantly, someone that wants to share the experience with a great team.</p>\n<h3>Who are we?</h3>\n<p>Our mission is to create calmer organizations. With Pyn, employees get more of the messages they need, and fewer of the ones they don’t. We do this by providing companies with tools for targeted, tailored communications.</p>\n\n<p>Our founders are Jon Williams and Joris Luijke. Jon previously co-founded the technology company Culture Amp. Joris helped scale the culture of Atlassian and Squarespace as their Head of People. Pyn is backed by Accel; an early investor in Facebook, Slack, Dropbox, and many more great companies.</p>\n\n<p>Pyn originates from Sydney, Australia. However, we have employees and customers across the globe. While we work remotely, we still love to get together if and when we can. Ideally our employees have good overlap with the Australian Eastern or Pacific time zones.</p>\n<h3>Your impact</h3>\n<p>As Founding Engineer, you will champion new features all the way from ideation to implementation. As this champion, you will be talking to our customers every day.</p>\n\n<p>At Pyn, you will work across the whole organization. Everything from building our Web Application, to helping customers, mentoring engineers, and building our culture.</p>\n\n<p>In terms of nuts and bolts: The Pyn Application uses React and GraphQL. The codebase is largely TypeScript and deployed on a serverless AWS infrastructure.</p>\n\n<p>We expect this architecture to evolve considerably as we grow. As a Founding Engineer, you’ll be responsible for technical direction in this evolution. You will be a key part of Pyn shipping fast, scaling up, and staying secure for our customers.</p>\n<h3>What we offer</h3>\n<p>At Pyn you will:</p>\n\n<ul>\n<li>work directly with the Founders on product direction, strategy, and execution.</li>\n<li>be part of forming our values, and a leader for the culture we are building.</li>\n<li>work with Jon and the team on the software architecture and strategy.</li>\n<li>have regular, direct contact with our customers to understand their needs.</li>\n<li>use your experience to mentor and grow other team members.</li>\n<li>* be in a dynamic remote-work environment, with flexible hours and parental leave.</li>\n<li>exercise your curiosity and grow technical, product, and people skills.</li>\n<li>continue to ship code daily (if not hourly!) to get value to customers hands as soon as possible.</li>\n</ul>\n\n<p>… change the way companies communicate with their employees.</p>\n<h3>What you bring</h3>\n<p>We recognize that people and careers are a unique journey. Recognizing this, we do not have strict skill and education requirements. Whilst there will always be specific skills we see as useful, we value the whole of what you can bring to Pyn.</p>\n\n<p>As one of our most senior hires, we want to draw upon your experience. As such it’s likely you’re a number of years into your career (or careers!). Whilst a traditional engineering background will suit this, so will many others.</p>\n\n<p>We’re striving to create a diverse environment and encourage candidates from all backgrounds to apply. If you’re curious and passionate about improving employee communications, then we’d love to hear from you.</p>"
    },
    {
        "position": "Fintech Platform Engineer",
        "company": "Puzzle",
        "location": {
            "city": "North America • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/puzzlefin/jobs/1325485-fintech-platform-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:46.125Z",
        "description": "<p>Leveraging financial information is what Puzzle is all about. We are an ambitious startup, well funded by a top tier VC with an experienced team who have built multiple successful companies and raised over $500M.</p>\n\n<p>We are solving a true pain point that every company has and keeps having as they grow.</p>\n\n<p>We are on a mission to hire the very best and are committed to creating a culture where everyone is respected and has access to equal opportunity. We know that new ideas can come from anywhere in the organization, and the next big idea could be yours!</p>\n\n<p>What Are We Doing?</p>\n\n<p>Starting a company has become easier, but growing a company is more complicated than ever. We are building a real-time, smarter financial infrastructure to put trustworthy data into the hands of decision-makers.</p>\n\n<p>Job Description</p>\n\n<p>As part of Puzzle you will help design and build our financial and accounting system.</p>\n\n<p>We will be ingesting large amounts of data from disparate sources, transforming them, organizing them, and automatically turning them into easily understandable and leverageable company financials.</p>\n\n<p>We want to be as real time as possible, event driven, and decoupled. Redundant, resistant and secure.  And accuracy is key.</p>\n\n<p>This is your opportunity to be an early engineer at a well funded startup that has a successful founder and a drive to change how company's leverage their financials.</p>\n\n<p>What You’ll Do</p>\n\n<ul>\n<li>Deliver on core accounting, auditing and financial infrastructure</li>\n<li>Create unique functionality for correlation of data</li>\n<li>Design interfaces and apis to our data</li>\n<li>Extend and architect our event pipeline for speed and scale</li>\n<li>Extend our core reporting platform</li>\n<li>Work on designing endpoints for our product</li>\n<li>Handle an ever growing stream of data</li>\n<li>Anything else that comes along...</li>\n</ul>\n\n<p>What You Need To Succeed</p>\n\n<p>BS/MS in Computer Science, a related field, or equivalent work experience</p>\n\n<ul>\n<li>2+ years as a software engineer</li>\n<li>Experience with agile software development methodologies</li>\n<li>Experience with accounting and/or financial systems</li>\n<li>Past life as an accounting or CPA is a big plus</li>\n<li>Experience in one of Python, TypeScript, Go</li>\n</ul>\n\n<p>Desired Skills</p>\n\n<ul>\n<li>Practical experience in developing applications using microservices, container technologies, container management systems such as Kubernetes, Mesos etc</li>\n<li>Strong experience with Databases design (SQL, NoSQL) and analytics</li>\n<li>Prior working experience in utility computing and/or cloud computing domain highly desired</li>\n<li>Experience building and deploying applications and services into cloud environments (GCP highly desired)</li>\n</ul>\n\n<p>Puzzle is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.</p>"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Jungle Scout",
        "location": {
            "city": "Earth • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/jungle-scout/jobs/1331044-senior-software-engineer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:48.455Z",
        "description": "<p>At Jungle Scout, we are on a mission to empower entrepreneurs and brands to grow successful e-commerce businesses, and we provide the industry-leading data, powerful tools, and resources they need.</p>\n\n<p><strong>The role:</strong></p>\n\n<ul>\n<li>Do you get excited working with talented engineers, leading them to ship product features and enhancements, and helping them thrive in their career?</li>\n<li>Do you define a great day as getting sh*t done and having fun working with your team?</li>\n<li>Do you have a thirst for breaking down complex initiatives into achievable project plans?</li>\n<li>Do you thrive when you're contributing to a high-performing, humble team?</li>\n</ul>\n\n<p><strong>Amazing</strong>, then you’re the type of person we’re looking for!</p>\n\n<p>We’re growing and we are looking to add a Performance Engineering Lead to our fast-paced and customer-oriented Engineering team. </p>\n\n<p>Where would this person be located? Great question! We’re a remote-first company and hope to hire this Senior Software Engineer Team anywhere between the EST - PST timezone</p>\n\n<p>Interested in learning more? Let’s get into the details:  </p>\n\n<p><strong>What you will be doing:</strong></p>\n\n<p>Architect and build:. </p>\n\n<ul>\n<li>new web applications</li>\n<li>microservices </li>\n<li>new features on our existing applications</li>\n</ul>\n\n<p>Make recommendations around:</p>\n\n<ul>\n<li>technologies to be used for new applications </li>\n<li>improvements on existing applications</li>\n</ul>\n\n<p>Scale, maintain and improve:</p>\n\n<ul>\n<li>existing codebases and system infrastructures</li>\n<li>development, staging and production environments of our applications</li>\n</ul>\n\n<p>Participate and contribute in:</p>\n\n<ul>\n<li>code reviews</li>\n<li>project planning and management</li>\n<li>ongoing improvement of engineering practices and procedures</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<p>You’ve done this before. </p>\n\n<ul>\n<li>Proficient in at least one modern programming language (Ruby, Javascript, Python)</li>\n<li>Have built enterprise-level products with modern web development technologies, and popular backend frameworks (e.g., Ruby on Rails, NodeJS, etc)</li>\n</ul>\n\n<p>You’re an AWS Cloud Wizard.</p>\n\n<ul>\n<li>Been working with some subset of AWS services, such as EC2, RDS, DynamoDB, Elasticsearch, ElasticBeanstalk, Lambda, Cloudwatch, SQS, Kinesis and SNS.</li>\n</ul>\n\n<p>You’re a master communicator &amp; passionate mentor. </p>\n\n<ul>\n<li>Fluent in both written &amp; verbal English to easily chat with our North American teams. </li>\n<li>Able to communicate effectively, clearly and concisely on both technical and non-technical subjects. </li>\n<li>Take any chance you can get to share knowledge with your team. </li>\n<li>Contribute to the team’s documentation and mentor teammates in an open, respectful, flexible, empathetic manner. </li>\n<li>Do not shy away from taking and giving feedback.</li>\n</ul>\n\n<p>You’re autonomous. </p>\n\n<ul>\n<li>Successfully execute on large multi-person projects and well-defined initiatives from definition through to the end.</li>\n</ul>\n\n<p><strong>Working at Jungle Scout</strong></p>\n\n<ul>\n<li>The BEST team. </li>\n<li>Remote-first culture.</li>\n<li>International Retreats.</li>\n<li>Access to Jungle Scout tools &amp; experts.</li>\n<li>Performance Bonus. </li>\n<li>Flexible Vacation. </li>\n<li>Comprehensive Health Benefits &amp; Retirement Program. </li>\n<li>We prioritize Diversity, Equity, and Inclusion </li>\n</ul>\n\n<p>At Jungle Scout, we hire great people from a wide variety of backgrounds, not just because it’s the right thing to do, but because it makes our company stronger. </p>\n\n<p>Jungle Scout is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n\n<p><em>All offers of employment at Jungle Scout are contingent upon clear results of a comprehensive background check. Background checks will be conducted on all final candidates prior to start date.</em></p>"
    },
    {
        "position": "Contributing Writer",
        "company": "TakeShape",
        "location": {
            "city": "Brooklyn • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/takeshape/jobs/888282-contributing-writer",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:50.908Z",
        "description": "<p>TakeShape is looking for talented communicators to help tell stories about the amazing projects and exciting developments happening in the world of web development. Compensation will be paid on a per-contribution rate with opportunities to advance within TakeShape's Developer Relations team.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Author how-to guides, technology explainers, and opinions for TakeShape's community and users</li>\n<li>Interview TakeShape community members about their projects </li>\n<li>Pitch new story ideas to TakeShape's editors and source new stories from the developer community</li>\n<li>Provide multimedia assets to accompany stories, including illustrative figures or videos when appropriate</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Knowledge of modern web technologies and the JAMstack</li>\n<li>Strong writing skills and the ability to explain complex subjects clearly and concisely in prose</li>\n<li>Experience writing for a diverse range of audiences with differing levels of expertise in your subject</li>\n<li>The ideal candidate will be involved in the developer community and have an active presence in online communities frequented by web developers</li>\n</ul>\n<h3>About TakeShape</h3>\n<p><a href=\"https://www.takeshape.io/\" target=\"_blank\" rel=\"nofollow\">TakeShape</a> aims to be the essential integration platform that seamlessly connects 17M front-end developers to the APIs they rely on to build their applications. We're developers, looking to make the lives of other developers better. Our founders are proudly based in NYC and we operate as a remote company with employees spread across over the United States.</p>\n<h3>How to Apply</h3>\n<p>We're currently looking for writers who can:</p>\n\n<ul>\n<li>author technical walkthroughs about using TakeShape with other tools, frameworks, and services;</li>\n<li>explain the important technologies in the Jamstack for beginners;</li>\n<li>or tell success stories about the products and services developed by TakeShape's customers.</li>\n</ul>\n\n<p>To join us as a contributor, please submit your resume and a story pitch for one of the above subjects, no longer than 100 words.</p>"
    },
    {
        "position": "Developer Intern",
        "company": "TracFlo",
        "location": {
            "city": "New York City • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/tracflo/jobs/812347-developer-intern",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:53.090Z",
        "description": "<p>TracFlo, a construction tech startup, is looking for backend developers for unpaid internship. We help construction companies better manage their change process.</p>\n\n<p>Here's a link which explains what exactly we do: <a href=\"https://www.youtube.com/watch?v=nZbWsnNGqNk&amp;t=18s\" target=\"_blank\" rel=\"nofollow\">https://www.youtube.com/watch?v=nZbWsnNGqNk&amp;amp;t=18s</a></p>\n\n<p>Recent press coverage:<br>\n[<a href=\"https://mitsloan.mit.edu/ideas-made-to-matter/25-mit-startups-to-watch\" target=\"_blank\" rel=\"nofollow\">https://mitsloan.mit.edu/ideas-made-to-matter/25-mit-startups-to-watch</a>]<br>\n[<a href=\"https://www.businessinsider.com/proptech-vc-metaprop-unveils-their-newest-accelerator-cohort-2019-9\" target=\"_blank\" rel=\"nofollow\">https://www.businessinsider.com/proptech-vc-metaprop-unveils-their-newest-accelerator-cohort-2019-9</a>]<br>\n[<a href=\"https://www.hbs.edu/news/articles/Pages/black-tech-master-series-new-venture-competition.aspx\" target=\"_blank\" rel=\"nofollow\">https://www.hbs.edu/news/articles/Pages/black-tech-master-series-new-venture-competition.aspx</a>]</p>\n\n<p>We are rebuilding our tech stack in React Native with beta iOS and Android apps and are looking for developers to continue to develop the API and database.</p>\n\n<ol>\n<li>Working knowledge of SQL-driven schema and database (eg: PostgreSQL, MySQL, MariaDB)</li>\n<li>Working knowledge of NodeJS</li>\n<li>Experience with RESTful APIs</li>\n<li>Experience with API authentication a plus</li>\n<li>Knowledge of ReactJS is a plus</li>\n<li>Strong knowledge with Amazon Web Services is a big plus</li>\n<li>Experience with test-driven development</li>\n<li>Ability to write clear, concise code with documentation</li>\n<li>Working knowledge of GIT, Github experience is ideal</li>\n</ol>"
    },
    {
        "position": "App Developer _ Android & iOS",
        "company": "Add.Fitt",
        "location": {
            "city": "India • United States • Ukraine • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/add-fitt/jobs/751746-app-developer-_-android-ios",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:55.394Z",
        "description": "<p>To create an App that solves the problems of all the fitness and wellness business owners. It is not a workout app. Its an app that focuses on the development of the business and helps business owners to keep themselves updated reguarly. </p>\n\n<p>This is a part time project. Loooking for an Intern who is keen to work on the app development, and design. CTO to be part of the company, co founder to expand the product reach. There is will be no salary for the first 3 months. After 3 months we can discuss shares, salary and commission.</p>"
    },
    {
        "position": "Mobile Developer - Hybrid Platform (React Native or iOS/Android Natives)",
        "company": "eZunction",
        "location": {
            "city": "Washington DC • Remote",
            "state": ""
        },
        "url": "https://angel.co/company/ezunction/jobs/1171005-mobile-developer-hybrid-platform-react-native-or-ios-android-natives",
        "skills": "N/A",
        "lastScraped": "2021-05-03T22:41:57.660Z",
        "description": "<p>Looking for a mobile app developer on hybrid platform preferrabley on React Native or on Flutter. </p>\n\n<p>We are also open to explore app developers with Native App development experience for iOS and Android. </p>\n\n<p>Start Immediately.</p>"
    }
]