[
    {
        "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Engineer-Fall-2021-Internship-Bachelors-Meraki/1325745",
        "position": "Full Stack Engineer Fall 2021 Internship, Bachelors (Meraki)",
        "company": "Cisco",
        "location": {
            "city": "San Francisco",
            "state": "US"
        },
        "lastScraped": "2021-04-12T08:05:43.616Z",
        "description": "<div><p><strong>Fall Internship (August - December 2021, full-time work schedule, Monday - Friday 40 hours per week)</strong></p><p><strong>Cisco Meraki Business Unit</strong></p> <p>The modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.</p><br> <p>As a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.</p><br> <p>Meraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.</p><br> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-ExampleprojectsofaFullStackWebDeveloperIntern:\"><strong>Example projects of a Full Stack Web Developer Intern:</strong></h2> <ul> <li>Create services to fetch data from millions of Meraki devices, then present that data in a user-friendly way</li> <li>Improve performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay</li> <li>Build internal frameworks and refine front end infrastructure to augment developer productivity</li> <li>Construct API endpoints to allow Meraki users and third party companies to build custom tools and features</li> <li>Build a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms</li> <li>Build a graph for network traffic analysis using clustering and other algorithms</li> </ul> <h2 id=\"JD:Intern-Full_Stack-FY20Q1-Youareanoutstandingapplicantif:\"><strong>You</strong>&nbsp;<strong>are</strong>&nbsp;<strong>an</strong>&nbsp;<strong>outstanding</strong>&nbsp;<strong>applicant</strong>&nbsp;<strong>if:</strong></h2> <ul> <li>You are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science</li> <li>You strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular</li> <li>You are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)</li> <li>You have worked with SQL and relational Databases</li> <li>You would flourish within a small engineering team and are excited to tackle open-ended problems</li> </ul> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-Intern/Co-OpProgramOverview:\"><strong>Intern Program Overview:</strong></h2> <p>Meraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.</p><br> <p>Meraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. &nbsp;Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.</p><br> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-Intern/Co-OpBenefits:\"><strong>Intern Benefits:</strong></h2> <ul> <li> <p>Housing Assistance</p> </li> <li> <p>Competitive salary</p> </li> <li> <p>Weekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)</p> </li> <li> <p>Lunch and dinner daily</p> </li> <li> <p>Customized laptop and desk setups</p> </li> <li> <p>Medical coverage plan</p> </li> </ul> <p><em>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</em></p><br> <p><em>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.</em></p></div>"
    },
    {
        "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Software-Engineer-Fall-2021-Internship-Meraki/1325752",
        "position": "Product Software Engineer Fall 2021 Internship (Meraki)",
        "company": "Cisco",
        "location": {
            "city": "San Francisco",
            "state": "US"
        },
        "lastScraped": "2021-04-12T08:05:43.616Z",
        "description": "<p><strong>Product Software Engineer</strong></p><p><strong>Fall Internship (August 2021 - December, full-time work schedule, Monday- Friday 40 hours per week)</strong></p><p>The modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to elite universities to global hospitality groups operating thousands of sites.</p><br><p>As a <strong>Product Software Engineer</strong> at Meraki, you will bring life to our products, imbuing them with what some call the Meraki Magic. Through your contributions, you will enable our customers to do more things more easily than ever before. You will have opportunities to work across our stack, developing software ranging from bootloaders, device drivers, and routing code to our distributed, cloud-hosted backend.</p><br><p><strong>Here are some of the projects you might find yourself working on:</strong></p><ul> <li>Designing and implementing (usually in C/C++) features to improve the reliability, simplicity, and performance of our devices, as well as make them more flexible and powerful</li> <li>Bringing up our Linux-based system on new hardware platforms</li> <li>Collaborating with our hardware engineers on the design of new platforms</li> </ul><h2><strong>You’re the kind of person we’re looking for if:</strong></h2><ul> <li>BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress)</li> <li>You are comfortable writing systems-level C/C++ (or if you’ve written your own OS!)</li> <li>You have familiarity developing and implementing computer networking fundamentals (TCP/IP, routing protocols, IPv6, etc.)</li> <li>You have worked with Linux on embedded platforms</li> <li>You have an understanding of OS fundamentals and experience working in both kernel and user space</li> <li>You love being a part of a tight-knit, hard-working team and want to have an impact with your own work while also elevating your teammates</li> <li>You have previous internship or large project experience</li> </ul><p>As a software engineer early in your career, you may still be identifying areas that you are curious about or in which would like to develop more depth. At Meraki, you will have the opportunity to explore multiple technology areas and problem domains. Whether you have a passion for user interfaces, distributed systems, network protocols, or embedded development — or perhaps more than one of these — you will be able to dive deep here. Together with your team you will craft from top to bottom the suite of innovative products that make Meraki unique.</p><br><h2>Intern Program Overview:</h2><p>Meraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.</p><br><p>Meraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.</p><br><h2>Intern Benefits:</h2><ul> <li>Housing Assistance</li> <li>Competitive salary</li> <li>Weekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)</li> <li>Lunch and dinner daily</li> <li>Customized laptop and desk setups</li> <li>Medical coverage plans</li> </ul><p>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</p><br>             <p>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.</p>"
    },
    {
        "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Fall-2021-Internship-Bachelors-Meraki/1325763",
        "position": "Site Reliability Engineer Fall 2021 Internship, Bachelors (Meraki)",
        "company": "Cisco",
        "location": {
            "city": "San Francisco",
            "state": "US"
        },
        "lastScraped": "2021-04-12T08:05:43.616Z",
        "description": "<p><strong>Site Reliability Engineer</strong></p><p><strong>Fall Internship (August- December 2021, full-time work schedule, Monday - Friday / 40 hours)</strong></p><p><strong>Cisco Meraki Business Unit</strong></p> <p>As a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.</p><br> <p>Meraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones. </p><br> <p>In this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.</p> <p><br><strong>What we look for in our SRE intern/co-op candidates:</strong></p> <ul>  <li>Junior/Senior status pursuing a BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress), no masters</li> <li>Clear and effective communication skills</li> <li>Proactive learners who can quickly pick up working in multiple frameworks, languages and environments</li> <li>Passionate team players</li> <li>Continually able to learn from experience and eager for feedback</li> <li>Previous internship or large scale project experience</li> <li>A strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)</li>  </ul> &nbsp; <ul> <li><strong>Bonus Points:</strong></li> </ul> <ul> <li>Know your way around *nix systems. We run Debian.</li> </ul> <ul> <li>Are familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.</li> </ul> &nbsp; <p><strong>Projects and Work Life:</strong></p> <p>Meraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.</p><br> <p>Meraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. &nbsp;Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life. </p><br> <p><strong>Examples of Past Projects</strong></p> <ul> <li>Adding at-rest encryption to our cloud-based database backups</li> <li>Revamping our Organization Move process to move customers between servers</li> <li>Implementing Docker Containers to move our infrastructure to a containerized world</li> </ul> <p><strong>Intern Benefits:</strong></p> <ul> <li>Housing Assistance&nbsp;</li> <li>Competitive salary</li> <li>Weekly social events inside and outside of the office (Giants games, Exploratorium tickets, &nbsp;&nbsp;&nbsp;friendly soccer games)</li> <li>Lunch and dinner daily</li> <li>Customized laptop and desk setups</li> <li>Medical, dental, and vision coverage plans</li></ul><p><em>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</em></p><br> <p><em>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.<br></em></p>"
    },
    {
        "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Fall-2021-Internship-Meraki/1323176",
        "position": "Network Support Engineer Intern - Fall 2021 Internship (Meraki)",
        "company": "Cisco",
        "location": {
            "city": "Chicago",
            "state": "US"
        },
        "lastScraped": "2021-04-12T08:05:43.616Z",
        "description": "<p><strong>Fall Internship (September - December 2021, full-time, Chicago)</strong></p><br><p><strong>Cisco Meraki Business Unit</strong></p> <p>At Cisco Meraki, our Network Support Engineer Interns act as key players on the Support team! You will troubleshoot cases that cover the entire Meraki product line, including our wireless access points, security appliances, switches, and Systems Manager application, just like our full-time engineers. With a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support that will carry with them for the rest of their careers.&nbsp;Our interns are an integral part of the Support team - we look for smart, passionate individuals who are open to taking on any task and are proactive in helping the team. The position is full-time and located in San Francisco.</p><br><p><strong>Responsibilities</strong></p><ul> <li>Research and resolve issues reported by Meraki customers and partners</li> <li>Identify issues suitable for entry in the Meraki Knowledge Base</li> <li>Write, review, and release KB articles</li> <li>Assist with lab testing work as needed for Meraki products</li> <li>Identify, reproduce, and document bugs</li> <li>Have a project in mind? Let us know and we'll help to make it happen!</li> </ul><p><strong>Qualifications</strong></p><ul> <li>Must be a<strong> Junior or Senior </strong>working towards&nbsp;a <strong>B.S</strong> in Networking and Systems Administration, Computer Information Technology, Network Technologies, Computer Science, or a related discipline from an accredited university -&nbsp;<strong>Not accepting Masters students</strong></li> <li>Basic understanding of networking fundamentals, e.g. be able to explain the functions of and differences among the link, network, transport, and application layers</li> <li>A passion to assist and problem-solve with our customers</li> <li>Outstanding account management, follow-through, and problem-solving skills</li> <li>Resourcefulness and attention to detail</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><em>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</em></p><br><p><em>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.</em></p>"
    },
    {
        "url": "https://jobs.cisco.com/jobs/ProjectDetail/AppD-Sales-Engineer-Bachelor-s-Intern-United-States/1319271",
        "position": "AppD Sales Engineer Bachelor's (Intern) -United States",
        "company": "Cisco",
        "location": {
            "city": "Offsite",
            "state": "US"
        },
        "lastScraped": "2021-04-12T08:05:43.616Z",
        "description": "<div><div class=\"MSWordContent\" style=\"display: inline;\"><p style=\"margin: 7.5pt 0in;\"><strong><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">About Us</span></strong><strong><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></strong></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">AppDynamics, now part of Cisco Systems Inc., is the Application Intelligence company. With AppDynamics, enterprises have real-time insights into application performance, user performance and business performance so they can move faster in an increasingly sophisticated, software-driven world. Our integrated suite of products is built on our innovative, enterprise-grade App iQ Platform that enables our customers to make faster decisions that enhance customer engagement and improve operational and business performance. AppDynamics is uniquely positioned to enable enterprises to accelerate their digital transformations by actively monitoring, analyzing, and optimizing complex application environments at scale which has led to success and trust with the Global 2000.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><strong><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">About You</span></strong><strong><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></strong></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">As interns on the Commercial Sales Engineer at AppDynamics, you’ll gain experience in a variety of projects where you’ll have the opportunity to utilize your creative problem-solving skills and technical knowledge. You will partner with the Commercial Account Managers to deliver presentations and demonstrations of the AppDynamics platform, and learn about Solution Selling. To better help deliver the value of AppDynamics, you will also need a strong technical background to better gain the technical acceptance of the opportunity. Your technical background should help you with installing the platform in customer’s environments, fine-tuning their deployment with scripts and configurations, and building dashboards and reports to show the value achieved. The work environment at AppDynamics is very fast paced and ever-changing, exposing you to new technologies in order to keep up with the demand of changing technology stacks.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Ideally, you have some experience as a software engineer and be able to handle a variety of technical projects sent your way.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><strong><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Desired Experience &amp; Skills</span></strong><strong><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></strong></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">BS in Computer Science, Computer Engineering, Software Engineering, or MIS</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Experience in Software Development Process</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Strong programming skills in at least one of the following languages: Java or .NET</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">You have an innate curiosity and passion for understanding how things work</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Experience and competence working at OS command lines including Unix, Linux and Window command prompts.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Experience with or exposure to Unix/Linux/Windows shell scripting</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Passionate about technical development and working on concurrent technical projects</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Comfortable with public speaking at all levels – From audiences of technical employees to C-Level Executives</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">High-reaching and self-motivated with a high degree of technical curiosity</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin-left: 18.75pt; text-indent: -0.25in;\"><span style=\"font-family: Symbol; font-size: 10pt; color: rgb(51, 51, 51);\">·</span><span style=\"font-size: 7pt; color: rgb(51, 51, 51);\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Highly coachable with a strong desire to improve and grow as a professional</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><strong><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">About the Role</span></strong><strong><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></strong></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">As a Commercial Sales Engineer Intern you will be responsible for providing extraordinary technical support to the Sales Engineering team during Proof of Value exercises. You will collaborate with the Sales and Product teams to identify and understand key customer requirements needed during a technical proof of value sales cycle. Working directly with the sales team as the partner and technical resource, you will be expected to develop a technical relationship with the customer by deploying AppDynamics, building dashboards and reports, as well as participating in a number of other customer and technical related activities.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Commercial SE Interns will also help assess when to engage technical support, product management, and appropriate sales engineering and solution architect teams for qualified opportunities.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p><p style=\"margin: 7.5pt 0in;\"><span style=\"font-family: Helvetica, sans-serif; color: rgb(51, 51, 51);\">Finally, you will work directly with our Product Management, Engineering, Customer Success, and Marketing teams to share your knowledge and experiences. Ultimately, working to improve our business and our customers' success.</span><span style=\"font-family: Arial, sans-serif; font-size: 18pt; color: black;\"></span></p></div><br></div>"
    }
]