[
    {
        "url": "https://www.coolworks.com/great-basin-institute/highlighted-job/37926-crew-leader-leadership-development-program-member-1",
        "position": "Crew Leader --Leadership Development Program Member",
        "company": "GREAT BASIN INSTITUTE",
        "contact": "chughes@thegreatbasininstitute.org",
        "posted": "OCT 08, 2020",
        "lastScraped": "2020-10-12T02:06:43.680Z",
        "location": {
            "city": "Reno",
            "state": "Nevada"
        },
        "description": "<p>Are you looking for a challenging and rewarding career in conservation? The&nbsp;<a href=\"https://www.thegreatbasininstitute.org/programs/nevada-conservation-corps/\" class=\"popup\">Nevada Conservation Corps</a>&nbsp;<a href=\"https://www.thegreatbasininstitute.org/programs/nevada-conservation-corps/partner-with-ncc/\" class=\"popup\">Leadership Development Program</a>&nbsp;(LDP) is an opportunity for aspiring leaders to further leadership and technical skills through hands-on training and service. Spend a season with NCC as an AmeriCorps member living and working in the wild and scenic landscapes of Nevada. As an LDP participant you will camp for up to seven nights at a time, explore aspen covered mesas, sagebrush valleys, prehistoric oceans turned salt flats, the darkest, star-filled skies in America, ancient volcanoes, massive sand dunes, and snow-capped granite peaks. Nevada’s abundant and diverse public lands provide incredible backdrops for both recreation and career development opportunities.<br>\n<br>\nFor the first three months, LDP members focus on individual and team growth with mentorship that prioritizes the development of skills meant to prepare you for the challenges of leading a crew. Some of the leadership training topics include problem-solving, conflict resolution, communication, collaboration, team development, and effective decision-making. Conservation technical training includes hazardous fuels reduction, trails construction and maintenance, habitat restoration, and data collection.&nbsp; At NCC we believe skills are best acquired within the context of daily work challenges.&nbsp;<br>\n<br>\nUpon successful completion of the leadership development training program, you will be assigned summer projects (based out of Reno, NV; Las Vegas, NV; or Great Basin National Park) and will take on the responsibility of leading a crew. You will coordinate with federal, state, and non-profit partners to meet the conservation and resource management needs of our public lands. You will be expected to collaborate with peers to see that project goals are accomplished safely and efficiently. Based on your specific projects you will be camped in the field with your crew on either 4-day and/or 8-day “tours” in primitive and remote locations. With mentorship and training, crew leaders are expected to manage crews effectively and facilitate an inclusive, cohesive community.</p>\n\n<p>Different than any other professional experience, being a crew leader with the NCC is a full-time, intensive commitment. Preparing for projects and leading a crew requires unwavering dedication and a willingness to put the needs of others first. Successful applicants will demonstrate dependability, excellent judgment, and high standards. We are looking for individuals who will lead by example and be a role model for the members who join our program. Though this position is challenging, the rewards are abundant and the bonds forged with your crew, peers, and with the natural world will last a lifetime.<br>\n<br>\n<strong>Technical Trainings and Certifications include:</strong></p>\n\n<p>Trail Maintenance and Construction<br>\nDry Stone Masonry<br>\nUSFS Felling and/or Bucking Certification<br>\nChainsaw Maintenance<br>\nFencing Construction and Maintenance<br>\nHabitat Restoration Methods<br>\nFirst Aid/CPR and Wilderness First Aid Certification<br>\nLeave No Trace Trainer Certification<br>\nPesticide Applicators License (NV or CA)<br>\nOff-Highway Vehicle Training</p>\n\n<p><strong>Contract Timeline:</strong></p>\n\n<p>10 month (1200 hour) Americorps Term of Service<br>\nFebruary 2021 to November 2021</p>\n\n<p><strong>Location:</strong></p>\n\n<p>Las Vegas, Nevada and Reno, Nevada<br>\n<br>\nYou will be based out of our Las Vegas Field Office (for the initial three months) and Reno Field Office (for the summer and fall) on 4- or 8-day \"tour\" schedules. Camping locations are provided during the workweek. We will not provide housing nor sign leases, but we can assist with identifying housing options.<br>\n<br>\nDue to season and weather, the summer season is based in Reno from May-August. Opportunities to be based at Great National Park for the summer may be an option depending on the availability of projects.<br>\n<br>\nFor the fall (August-November), options to be based out of Las Vegas or Reno will be available depending on the availability of projects.</p>\n\n<p><strong>Compensation and Benefits:</strong></p>\n\n<p>This is an AmeriCorps position; candidates will receive a living stipend dependent on their length of service. The living stipend is a fixed amount, not an hourly wage or a salary. The stipend is paid to members in bi-weekly installments throughout their term of service. Upon completion of AmeriCorps service members shall receive an additional education award also dependent on the length of service that can be used for paying off student loans or paying tuition for a Title IV accredited college.<br>\n<br>\n• Compensation: $14,000 living stipend (approximately $680 every two weeks before taxes) with potential for an increased living stipend if promoted to lead or assistant lead<br>\n• Education Award: $4,336.50<br>\n• Per Diem: $7.25/day spent in the field. This is in addition to your Living Allowance and on average is $58.00 biweekly. Crews typically combine per diem funds and shop/prepare meals as a team.<br>\n• Housing Stipend: max $900; this is in addition to your Living Allowance and on average is $50.00 biweekly.<br>\n<br>\nBenefits:<br>\n• Insurance - Limited Health, Dental, and Vision Insurance will be completely paid for at no cost to you by the Great Basin Institute.<br>\n• Student Loan Forbearance and Interest Accrual Repayment<br>\n• Supplemental Nutrition Assistance Program Eligibility<br>\n• Educational Affiliation Agreements (College Credit)<br>\n<br>\nOptional Training &amp; Education we will provide include:<br>\n• Resume Building Workshop<br>\n• Interview Skills Workshop<br>\n• Native Plant Identification<br>\n• GPS Unit Training<br>\n• Introduction to Geographic Information Systems (GIS)</p>\n\n<p><strong>Job Qualifications:</strong></p>\n\n<p><strong>General Qualifications:</strong><br>\n•&nbsp;Maintaining a positive and professional attitude at all times while providing service<br>\n•&nbsp;Showing respect when interacting with other members, leaders, staff, project sponsors and community members<br>\n•&nbsp;Participating in in-field education sessions, presentations and crew meetings<br>\n•&nbsp;Participate in Service Day events outside of regular work schedule</p>\n\n<p><strong>Leadership Qualifications:</strong><br>\n•&nbsp;Clean driving record (must qualify to drive GBI Vehicles)<br>\n•&nbsp;Current driver’s license<br>\n•&nbsp;A willingness and desire to lead<br>\n•&nbsp;Experience working within a Conservation or Youth Corps<br>\n•&nbsp;Previous experience camping/backpacking in remote locations<br>\n•&nbsp;Previous experience constructing recreational trails<br>\n•&nbsp;Previous experience felling trees using a chainsaw and/or a crosscut saw<br>\n•&nbsp;Strong critical thinking skills and creativity<br>\n•&nbsp;Possessing the confidence and ability to make decisions quickly and under pressure<br>\n•&nbsp;Receptive to feedback from superiors, peers, and subordinates.<br>\n•&nbsp;Ability to establish and maintain a positive workplace culture and camp life experience.</p>\n\n<p><strong>Physical Qualifications</strong><strong>:</strong><br>\n•&nbsp;Ability to work for 10.5 hours a day and to contribute to post-work day tasks and chores<br>\n•&nbsp;Ability to hike up to 10 miles a day with heavy backpacks<br>\n•&nbsp;Ability to carry 25 pounds continuously and 50 pounds occasionally<br>\n•&nbsp;Ability to camp up to seven consecutive nights in primitive locations without access to running water and restrooms, all while in all possible weather conditions. Assisting in food preparation, planning, and clean up<br>\n•&nbsp;Ability to effectively operate machinery and tools while following production and quality standards set by the Nevada Conservation Corps<br>\nFollow strict safety protocol and maintain personal safety of self and others</p>\n\n<p><strong>AmeriCorps Qualifications:</strong><br>\n•&nbsp;Ability to commit to an entire term of service with AmeriCorps<br>\n•&nbsp;Be at least 17 years of age<br>\n•&nbsp;Be a U.S Citizen or Legal Resident Alien<br>\n•&nbsp;All position offers are conditional upon successful completion of an acceptable check of the National Sex Offender Public Registry and federal criminal background check. Any criminal convictions must be disclosed during the interview process<br>\n•&nbsp;Be eligible to receive an AmeriCorps Education Award (Limit of four unique terms in a lifetime or the equivalent of two full-time education awards)<br>\nPossess High school diploma or GED (or provide proof of intent to complete before using education award)</p>\n\n<hr>\n<p style=\"text-align:center;\"><strong>Do you follow GBI on social media?</strong><br>\n&nbsp;<a href=\"https://www.instagram.com/gbinstitute/?hl=en\" class=\"popup\">@gbinstitute</a>&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;<a href=\"https://www.facebook.com/GreatBasinInstitute/\" class=\"popup\">@GreatBasinInstitute&nbsp;</a>&nbsp; |&nbsp;&nbsp;&nbsp;<a href=\"https://twitter.com/gbinstitute?lang=en\" class=\"popup\">@GBInstitute</a></p>\n\n<hr>\n<p style=\"text-align:center;\">EEO Statement</p>\n\n<p><em>We conform to all the laws, statutes, and regulations concerning equal employment opportunities and affirmative action. We strongly encourage women, minorities, individuals with disabilities, and veterans to apply to all of our job openings. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, or national origin, age, disability status, Genetic Information &amp; Testing, Family &amp; Medical Leave, protected veteran status, or any other characteristic protected by law. We prohibit Retaliation against individuals who bring forth any complaint, orally or in writing, to the employer or the government, or against any individuals who assist or participate in the investigation of any complaint or otherwise oppose discrimination.</em></p>"
    },
    {
        "url": "https://www.coolworks.com/indian-head-camp/highlighted-job/37870-athletic-coaches-slash-coordinators",
        "position": "Athletic Coaches / Coordinators",
        "company": "CAMP IHC",
        "contact": "Matthew@campihc.com",
        "posted": "OCT 02, 2020",
        "lastScraped": "2020-10-12T02:06:45.596Z",
        "location": {
            "city": "Equinunk",
            "state": "Pennsylvania"
        },
        "description": "<p><strong><em>RE: COVID19 - With the dynamic environment we are in, we continue to monitor factual sources and developments and are planning for an on-time&nbsp;start for our summer 2021&nbsp;season. During the interview, we will discuss our&nbsp;COVID19 Protocols.</em></strong></p>\n\n<p>If you can throw it, catch it, kick it, or swing it we have it at Camp IHC. So why not share your skills with the next generation while fostering and building relationships along the way.</p>\n\n<p>At IHC you get to be more&nbsp;than a coach, you become a part of the family.&nbsp; A partnership in making a difference in kids’ lives.&nbsp;&nbsp;</p>\n\n<p>Depending on your background, opportunities in Flag Football, Track, Basketball, Baseball, Gymnastics, Lacrosse and more.&nbsp; Interested, find out more at <a href=\"https://www.campihc.com/team\" class=\"popup\">www.campihc.com/team.</a></p>"
    },
    {
        "url": "https://www.coolworks.com/great-basin-institute/highlighted-job/37840-crew-leader-southern-nv-nevada-conservation-corps",
        "position": "Crew Leader (Southern NV) - Nevada Conservation Corps",
        "company": "GREAT BASIN INSTITUTE",
        "contact": "chughes@thegreatbasininstitute.org",
        "posted": "SEP 25, 2020",
        "lastScraped": "2020-10-12T02:06:46.397Z",
        "location": {
            "city": "Reno",
            "state": "Nevada"
        },
        "description": "<p><strong>Challenge yourself as a leader of a 5-person crew while conducting critical conservation work in some of the Southwest’s most beautiful areas. Serve from the mountains of Nevada to the vast landscapes of the Great Basin and Mohave Deserts. The NCC is looking for experienced Crew Leaders to tackle day-to-day responsibilities of crew life.</strong></p>\n\n<p>You will lead four AmeriCorps Crew Members while building trail, running chainsaws, or performing other restoration projects on public lands in some of Nevada’s most beautiful locales. You will coordinate with agency partners and collaborate with peers to see that the project goals are accomplished safely and efficiently. Based on your specific project you will be camped in the field with your crew on either 4-day or 8-day “tours” often in primitive and remote locations and will be responsible for facilitating a healthy and cohesive community within your crew.</p>\n\n<p>Different than any other professional experience you could imagine, being a Crew Leader with the NCC is a full-time commitment where you will always be a resource to the members, both while on service project sites or back at camp after a long day. Preparing for and leading a crew requires unwavering dedication, and a willingness to put the needs of others first.&nbsp; The successful applicant will demonstrate dependability, excellent judgment, and high standards. We are looking for an individual who will lead by example and be a role model for the members who join our program. Though this position is challenging, the rewards are abundant; and the bonds forged with your&nbsp;peers, and with the outdoors will last a lifetime.</p>\n\n<p>Projects for this upcoming Spring and Summer season include native species plantings, seed collections, invasive species removal, fencing projects, trail maintenance, forestry work, road/trail signage installation, burned area restoration, and erosion control, desert cleanups, and plant nursery work.</p>\n\n<p><strong>Essential Duties:</strong></p>\n\n<ul>\n\t<li>Exemplify strong work ethic, professionalism, and sound judgment</li>\n\t<li>Lead young adults on a variety of challenging conservation projects</li>\n\t<li>Understand and abide by all NCC policies and procedures; ensure all safety protocols followed</li>\n\t<li>Maintain a positive and professional attitude at all times; be able to boost crew morale</li>\n\t<li>Effectively communicate with NCC staff, partnering agencies, peers, and crew members</li>\n\t<li>Coordinate project logistics with agency partners, Crew Coordinator, and peers</li>\n\t<li>Work alongside members to complete project goals</li>\n\t<li>Provide clear and consistent feedback to crew members</li>\n\t<li>Teach, instruct and support members in trail building, and other projects/NCC specific tasks</li>\n\t<li>Engage members in an active crew life</li>\n\t<li>Facilitate weekly crew meetings and debriefs</li>\n\t<li>Transport crew and equipment safely in NCC trucks</li>\n\t<li>Manage and maintain crew gear, tools, and other various NCC/agency equipment</li>\n\t<li>Complete weekly reporting of accomplishments</li>\n\t<li>Uphold NCC and AmeriCorps standards of work production and quality</li>\n\t<li>Support and manage crew meal planning</li>\n</ul>\n\n<p><em>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.&nbsp;</em></p>\n\n<p><strong>Contract Timeline:</strong></p>\n\n<p>Approximate start date February 1st, 2021.<br>\n6 month Americorps term.<br>\n<br>\nDates can be flexible so don't hesitate to contact us!<br>\nStart dates can be flexible. Please reach out to Cassandra Hughes at <a href=\"mailto:chughes@thegreatbasininstitute.org?subject=Crew%20Leader%20position%20on%20CoolWorks\">chughes@thegreatbasininstitute.org</a> to discuss your options.</p>\n\n<p><strong>Location:</strong></p>\n\n<p>Las Vegas, Nevada</p>\n\n<p>Crew members will be assigned to serve our Reno or Las Vegas Field Office and will serve and camp in the field on 4-day tours, 8-day tours, or a mixture of the two. Schedules will be dictated by the project site and distance from the field station. Camping locations are provided during the workweek. We will not provide housing nor sign leases, but we can help assist with identifying housing options.</p>\n\n<p><strong>Compensation and Benefits:</strong></p>\n\n<p>This is an AmeriCorps position; candidates will receive a living stipend dependent on their length of service. The living stipend is a fixed amount, not an hourly wage or a salary. The stipend is paid to members in bi-weekly installments throughout their term of service. Upon completion of AmeriCorps service members shall receive an additional education award also dependent on the length of service that can be used for paying off student loans or paying tuition for a Title IV accredited college.<br>\n<br>\n•Living Allowance: approximately $815 every two weeks before taxes<br>\n•Education Award: $3,097.50&nbsp;<br>\n•Per Diem:$7.25/day spent in the field. This is in addition to your Living Allowance and on average is $58.00 biweekly. Crews typically combine per diem funds and shop/prepare meals as a team.<br>\n•Housing Stipend:$600 total; this is in addition to your Living Allowance and on average is $50.00 biweekly.<br>\n<br>\n•Insurance:<br>\nLimited Health, Dental and Vision Insurance will be completely paid for at no cost to you by the Great Basin Institute.<br>\n<br>\n•Student Loan Forbearance:<br>\nIf you are currently paying on any federal student loans you have the option to put those loans into forbearance during your time as an AmeriCorps volunteer, which will allow you to cease payments while serving.<br>\n<br>\n•Interest Accrual Repayment:<br>\nAs AmeriCorps alum, you are eligible to have the National Service Trust pay all or a portion of the interest that accumulated on your qualified student loan(s) during your term of service. These payments are made in addition to the Education Award and are not deducted from your Education Award balance. To be eligible to have accrued interest paid: The loan must have been placed in forbearance for the service period, and you must have successfully completed a term of service and received an Education Award.<br>\n<br>\n•Supplemental Nutrition Assistance Program Eligibility:<br>\nAmeriCorps Volunteers qualify for the Supplemental Nutrition Assistance Program (SNAP). The Nevada Conservation Corps will provide you documentation in proving that you qualify for SNAP.<br>\n<br>\n•Educational Affiliation Agreements (College Credit):<br>\nThe Nevada Conservation Corps will take part in Affiliation Agreements with your university in order to allow you to receive college credit hours for your term of service.</p>\n\n<p><strong>General Qualifications:</strong></p>\n\n<ul>\n\t<li>Maintaining a positive and professional attitude at all times while providing service</li>\n\t<li>Showing respect when interacting with other members, leaders, staff, project sponsors and community members</li>\n\t<li>Participating in in-field education sessions, presentations and crew meetings</li>\n\t<li>Participate in Service Day events outside of regular work schedule</li>\n</ul>\n\n<p><br>\n<strong>Leadership Qualifications:</strong></p>\n\n<ul>\n\t<li>Clean driving record (must qualify to drive GBI Vehicles)</li>\n\t<li>Current driver’s license</li>\n\t<li>A willingness and desire to lead</li>\n\t<li>Experience working within a Conservation or Youth Corps</li>\n\t<li>Previous experience camping/backpacking in remote locations.</li>\n\t<li>Previous experience constructing recreational trails</li>\n\t<li>Previous experience felling trees using a chainsaw and/or crosscut</li>\n\t<li>Previous experience with restoration type work (ex. plantings, invasive species removal)</li>\n\t<li>Strong critical thinking skills and creativity</li>\n\t<li>Possessing the confidence and ability to make decisions quickly and under pressure</li>\n\t<li>Receptive to feedback from superiors, peers, and subordinates.</li>\n\t<li>Ability to establish and maintain a positive workplace culture and camp life experience.</li>\n</ul>\n\n<p><br>\n<strong>Physical Qualifications:</strong></p>\n\n<ul>\n\t<li>Ability to work for 10.5 hours a day and to contribute to post-work day tasks and chores</li>\n\t<li>Ability to hike up to 10 miles a day with heavy backpacks</li>\n\t<li>Ability to carry 25 pounds continuously and 50 pounds occasionally</li>\n\t<li>Ability to camp up to seven consecutive nights in primitive locations without access to running water and restrooms, all while in all possible weather conditions. Assisting in food preparation, planning, and clean up</li>\n\t<li>Ability to effectively operate machinery and tools while following production and quality standards set by the Nevada Conservation Corps</li>\n\t<li>Follow strict safety protocol and maintain personal safety of self and others</li>\n</ul>\n\n<p>&nbsp;<br>\n<strong>AmeriCorps Qualifications:</strong></p>\n\n<ul>\n\t<li>Ability to commit to an entire term of service with AmeriCorps</li>\n\t<li>Be at least 17 years of age</li>\n\t<li>Be a U.S Citizen or Legal Resident Alien</li>\n\t<li>All position offers are conditional upon successful completion of an acceptable check of the National Sex Offender Public Registry and federal criminal background check. Any criminal convictions must be disclosed during the interview process</li>\n\t<li>Be eligible to receive an AmeriCorps Education Award (Limit of four unique terms in a lifetime or the equivalent of two full-time education awards)</li>\n</ul>\n\n<p>Possess High school diploma or GED (or provide proof of intent to complete before using education award)</p>\n\n<hr>\n<p><br>\n<em>EEO Statement</em></p>\n\n<p><em>We conform to all the laws, statutes, and regulations concerning equal employment opportunities and affirmative action. We strongly encourage women, minorities, individuals with disabilities and veterans to apply to all of our job openings. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, or national origin, age, disability status, Genetic Information &amp; Testing, Family &amp; Medical Leave, protected veteran status, or any other characteristic protected by law. We prohibit Retaliation against individuals who bring forth any complaint, orally or in writing, to the employer or the government, or against any individuals who assist or participate in the investigation of any complaint or otherwise oppose discrimination.</em></p>"
    },
    {
        "url": "https://www.coolworks.com/great-basin-institute/highlighted-job/37819-restoration-crew-member-southern-nv",
        "position": "Restoration Crew Member (Southern NV)",
        "company": "GREAT BASIN INSTITUTE",
        "contact": "chughes@thegreatbasininstitute.org",
        "posted": "SEP 23, 2020",
        "lastScraped": "2020-10-12T02:06:47.165Z",
        "location": {
            "city": "Reno",
            "state": "Nevada"
        },
        "description": "<p><strong>The Service Experience:&nbsp;</strong><br>\nSpend a season or more working and camping outside at some of Nevada’s premier natural areas. Serve alongside volunteers from across the country while making a lasting contribution to Nevada’s natural resources and heritage. Gain valuable field experience while working on habitat improvement, restoration, and recreation projects with the U.S. Forest Service, Bureau of Land Management, National Park Service, and many other federal and state agencies. Learn firsthand from federal employees and specialists about natural resources and conservation careers.&nbsp;Projects during the spring field season will focus on arid land restoration around Southern Nevada and may include invasive plant removal, riparian restoration, native species planting, fence work, desert clean-ups, and trail maintenance.&nbsp;&nbsp;<strong><a href=\"https://www.thegreatbasininstitute.org/programs/nevada-conservation-corps/ncc-services/\" class=\"popup\">Find more information on projects here!</a></strong></p>\n\n<p><strong>Essential Duties:</strong></p>\n\n<ul>\n\t<li>Camping up to seven nights in a wilderness setting without formal restroom facilities or running water;</li>\n\t<li>Maintaining a positive and professional attitude at all times while providing service;</li>\n\t<li>Communicating effectively with crew members, crew leaders, NCC staff and agency project staff;</li>\n\t<li>Complying with both production and quality work standards established by NCC&nbsp;administration, crew supervisors and project partners;</li>\n\t<li>Contributing to basic duties at the campsite including cooking, cleaning and organizing crew equipment;</li>\n\t<li>Showing respect when interacting with other members, leaders, staff, project sponsors and community members;</li>\n\t<li>Participating in in-field education sessions;</li>\n\t<li>Percentage of time spent on labor– 70%, traveling– 20%, hiking– 10%;</li>\n\t<li>Lifting 25lbs continuously and 50lbs occasionally.</li>\n</ul>\n\n<p>Contract Timeline:</p>\n\n<p>This is a 450 hour AmeriCorps position.<br>\nFebruary 15, 2021&nbsp;- May 14, 2021<br>\n<br>\nLocation: Las Vegas, NV<br>\n<br>\nCrew members will be assigned to serve from the Las Vegas Field Station and will serve and camp in the field on 4-day tours, 8-day tours, or a mixture of the two. Schedules will be dictated by the project site and distance from the field station. Camping locations are provided during the workweek. We will not provide housing nor sign leases, but we can help assist with identifying housing options.</p>\n\n<p><br>\n<strong>Compensation and Benefits:</strong></p>\n\n<p>This is an AmeriCorps position; candidates will receive a living stipend dependent on their length of service. The living stipend is a fixed amount, not an hourly wage or a salary. The stipend is paid to members in bi-weekly installments throughout their term of service. Upon completion of AmeriCorps service members shall receive an additional education award also dependent on the length of service that can be used for paying off student loans or paying tuition for a Title IV accredited college.</p>\n\n<ul>\n\t<li>Living Allowance: $4,400* (approximately $690 every two weeks before taxes)</li>\n\t<li>Education Award: $1,638.89</li>\n\t<li>Per Diem:$7.25/day spent in the field. This is in addition to your Living Allowance and on average is $58.00 biweekly. Crews typically combine per diem funds and shop/prepare meals as a team.</li>\n\t<li>Housing Stipend: max $300 total; this is in addition to your Living Allowance and on average is $50.00 biweekly.</li>\n</ul>\n\n<p>-- Insurance:<br>\nLimited Health, Dental and Vision Insurance will be completely paid for at no cost to you by the Great Basin Institute.<br>\n<br>\n-- Student Loan Forbearance:<br>\nIf you are currently paying on any federal student loans you have the option to put those loans into forbearance during your time as an AmeriCorps volunteer, which will allow you to cease payments while serving.<br>\n<br>\n-- Interest Accrual Repayment:<br>\nAs AmeriCorps alum, you are eligible to have the National Service Trust pay all or a portion of the interest that accumulated on your qualified student loan(s) during your term of service. These payments are made in addition to the Education Award, and are not deducted from your Education Award balance. To be eligible to have accrued interest paid: The loan must have been placed in forbearance for the service period, and you must have successfully completed a term of service and received an Education Award.<br>\n<br>\n-- Supplemental Nutrition Assistance Program Eligibility:<br>\nAmeriCorps Volunteers qualify for the Supplemental Nutrition Assistance Program (SNAP). The Nevada Conservation Corps will provide you documentation in proving that you qualify for SNAP.<br>\n<br>\n-- Educational Affiliation Agreements (College Credit):<br>\nThe Nevada Conservation Corps will take part in Affiliation Agreements with your university in order to allow you to receive college credit hours for your term of service.<br>\n<br>\nOptional Training &amp; Education we will provide include:</p>\n\n<ul>\n\t<li>Defensive Driving Certification</li>\n\t<li>Off-Road Driving Class</li>\n\t<li>Resume Building Workshop</li>\n\t<li>Interview Skills Workshop</li>\n\t<li>Native Plant Identification</li>\n\t<li>Invasive Plant Identification</li>\n\t<li>GPS Unit Training</li>\n\t<li>Introduction to Geographic Information Systems (GIS)</li>\n</ul>\n\n<p>Job Qualifications:</p>\n\n<ul>\n\t<li>Must maintain a positive and professional attitude at all times while providing service.</li>\n\t<li>Be able to communicate effectively with members, crew leaders, NCC staff, and project partners.</li>\n\t<li>Possess the willingness and ability to work and camp up to seven nights in a row, in a wilderness setting, in all weather conditions, without formal restroom facilities or running water.</li>\n\t<li>Be able to lift 25lbs continuously and 50lbs occasionally</li>\n\t<li>Be at least 17 years of age</li>\n\t<li>Be a US citizen</li>\n\t<li>Must possess a high school diploma or GED</li>\n\t<li>Must be eligible to receive an AmeriCorps Education Award (limit of four in a lifetime or the equivalent of two full-time education awards).*</li>\n\t<li>All position offers are conditional upon completion of an acceptable check of the National Sex Offender Public Registry and federal criminal background check.</li>\n</ul>"
    },
    {
        "url": "https://www.coolworks.com/odiyan-buddhist-retreat-center/highlighted-job/37535-construction-and-metal-work-in-buddhist-tradition-1",
        "position": "CONSTRUCTION and METAL WORK in Buddhist Tradition.",
        "company": "ODIYAN BUDDHIST CENTER",
        "contact": "volunteer@odiyan.org",
        "posted": "SEP 16, 2020",
        "lastScraped": "2020-10-12T02:06:48.152Z",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "description": "<p>We are seeking resident volunteers for metalwork and construction. Help us renovate an outdoor Buddhist pavilion. Participate in finishing the most extensive known installation of Buddhist art and sacred text plaques surrounding the Main Temple of Odiyan.</p>\n\n<p>Living and working at Odiyan includes:</p>\n\n<ul>\n\t<li>Free home-cooked vegetarian meals and beverages</li>\n\t<li>Free housing in a large room with a balcony, one roommate.</li>\n\t<li>Free WI-FI and domestic phone calls</li>\n\t<li>Free skill training in a wide range of trades and traditional arts</li>\n\t<li>Access to a healthy setting of nature, hiking trails, swimming, wide-open spaces, sacred beauty, fresh air, clean water, and nutritious food</li>\n\t<li>Morning practices in chanting, Buddhist prayers and meditation, classes related to Buddhist teachings.</li>\n\t<li>Living allowance of $150 per month.</li>\n</ul>\n\n<p><strong>You will also&nbsp;learn:</strong>&nbsp;&nbsp;how to cook vegetarian meals, clean and landscape around the Temples, work in the vegetable gardens, care for the animals, general maintenance of equipment, machines, temples and living facilities. At Odiyan we take care of everything!&nbsp;</p>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n\t<li>College degree or significant training in any specific skill</li>\n\t<li>Experience working with tools and/or small machines in any of these fields: woodwork, metalwork, construction, building, landscaping, farming, painting, concrete, stonework.&nbsp;</li>\n\t<li>Physically strong, able to do manual work for hours each day, including repeated lifting, bending, kneeling.</li>\n\t<li>Minimum commitment of six months.</li>\n</ul>\n\n<p>If you have a passion for the physically active lifestyle, self-knowledge and giving to a higher vision, Odiyan may be the place for you! The community life, classes, and ongoing work projects benefit both yourself and all humanity.</p>\n\n<p>For a more 'inside' view of Odiyan see our photos on Facebook:&nbsp;<a href=\"http://www.facebook.com/OdiyanBuddhistRetreatCenter\" class=\"popup\">OdiyanBuddhistRetreatCenter</a></p>\n\n<p>Follow us on Instagram for great stories!&nbsp;<a href=\"https://www.instagram.com/odiyan_mandala/\" class=\"popup\">https://www.instagram.com/odiyan_mandala/</a></p>"
    }
]