[
    {
        "position": "User Assistance Developer, Intern",
        "company": "Dassault Systèmes",
        "location": {
            "city": "Waltham",
            "state": "MA"
        },
        "posted": "2021-06-02T20:31:50.114Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=101&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_293e1f0e&cb=1622665872963&jobListingId=4103578005",
        "lastScraped": "2021-06-02T20:31:50.114Z",
        "description": "<div><div><b>Imagine New Horizons. .</b></div><div>As an Intern within Dassault Systemes, you will work closely with User Assistance Development and Web Application teams, including other interns, to improve the usability and consistency of documentation web sites used both internally and externally. You will have contact with English-speaking development teams and interns in France.</div><div>The SOLIDWORKS User Assistance Development team is based in the Dassault Systèmes Americas Headquarters located on 175 Wyman Street in Waltham, MA. This is a six month, internship with flexibility to work around your academic schedule. Interns can work on-site, remotely, or in a hybrid arrangement as defined with their manager.</div><div>What Your Role Will Be</div><div>Understanding our User Assistance environment</div><div>Redesigning and enhancing User Assistance web sites, both internal and external. Includes responsive design, improved navigation and search, collecting and processing user feedback.</div><div>Participating in discussions regarding User Assistance requirements</div><div>Presenting your work to the team and management, demonstrating your contribution to the success of the team</div><br><div></div><div>Your Key Success Factors</div><div>Actively enrolled in a Bachelor’s Degree or Master's Degree Computer Science Degree program or User Interface program for the duration of the internship</div><div>Minimum cumulative GPA 3.0</div><div>Demonstrates strong HTML, CSS, and Javascript skills</div><div>Possesses experience with some or all of the following: a modern Web tool stack such as MERN, Python, Java, ASP.NET, SQL Server or other database technology</div><div>Displays a keen sense of web design and understanding of the fundamentals of User Interface design</div><div>Possesses well-developed interpersonal skills and ability to work independently</div><div>Demonstrates strong communication skills in English, both verbal &amp; written. Nice to have: proficiency in French</div></div>"
    },
    {
        "position": "Full Stack Web Application Development Intern – Fall 2021",
        "company": "CACI",
        "location": {
            "city": "Virginia",
            "state": "Virginia"
        },
        "posted": "2021-06-02T20:32:01.459Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=102&ao=1044074&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_5a8f823f&cb=1622665872964&jobListingId=4103458281",
        "lastScraped": "2021-06-02T20:32:01.459Z",
        "description": "<div><p><b>Job Description</b></p><p></p><p><br>What You’ll Get to Do:</p><p>CACI helps the Air Force Research Laboratory explore, prototype, and demonstrate new technologies, enabling the Air Force to maintain its technological advantage. We are seeking a <b>full stack web application development intern</b> to help us research and develop web applications for cyber operations planning and management.</p><p></p><p>As a full-stack web application developer, you will:</p><ul><li>Work closely with our customers to design and implement frontend and backend software for a complex interactive web application</li><li>Support design of the client- and server-side software architectures</li><li>Develop and manage backend databases</li><li>Write automated tests and user interface tests to support automated application testing</li><li>Build frontend features according to the principles of progressive enhancement and responsive design</li><li>Apply your HTML / CSS / JavaScript programming skills to solving complex data management problems</li><li>Write technical documentation</li></ul><p><br>More About the Role:</p><p>Additional technologies you will use may include:</p><ul><li>Server-side programming environments, particularly Java or Node.js and frameworks like Express</li><li>Frontend frameworks like Angular, React, or in some cases none at all</li><li>SVG, Canvas, WebGL or other web-based graphics programming environments</li><li>Automated testing tools like Mocha, Ava, JUnit, Selenium, or others</li><li>Databases like PostgreSQL, MySQL, MariaDB, etc</li><li>SCM and issue tracking tools like Git, GitLab, Jira, etc</li></ul><p><br>You’ll Bring These Qualifications:</p><ul><li>Able to work in an office environment, including using computers for long periods of time and communicating with others face-to-face, by telephone, email, or instant messaging</li><li>Be enrolled in a Bachelor’s or Master’s degree program in the field of computer science, computer engineering, electrical engineering, video game development, or related field</li><li>Desire to learn on the job</li></ul><p><br>These Qualifications Would be Nice to Have:</p><ul><li>Able to work in-person at our offices in Rome, NY</li></ul><p><br>What We Can Offer You:</p><ul><li>We’ve been named a Best Place to Work by the Washington Post.</li><li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li><li>We offer competitive benefits and learning and development opportunities.</li><li>We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.</li><li>For over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success.</li></ul><p></p><p>inrn2</p><p></p><p><b>Job Location</b></p><p>US-Remote (Any State)-VA-UTICA</p><br><p></p><p>CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities.</p></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "KBR",
        "location": {
            "city": "Greenbelt",
            "state": "MD"
        },
        "posted": "2021-06-02T20:32:10.879Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=103&ao=1091461&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_ff344f3c&cb=1622665872965&jobListingId=4103443565",
        "lastScraped": "2021-06-02T20:32:10.879Z",
        "description": "<div><p>Around here, we define the future.</p><p></p><p>We are a company of innovators, thinkers, creators, explorers, volunteers, and dreamers. But we all share one goal: to improve the world responsibly and safely.</p><p></p><p>KBR is seeking several interns to work with scientific and engineering staff supporting projects using Artificial Intelligence, Machine Learning, Cybersecurity, Cloud, DevSecOps, and Autonomous Systems techniques.</p><p></p><p><b>Must be a U.S. Citizen</b></p><p><b>Internship dates: June 1st, 2021 - TBD</b></p><p></p><p>For each of the projects, interns will leverage the AWS machine learning tools, continue to advance KBR’s knowledge and application of data analytics. Interns will collaborate with scientific and engineering staff supporting projects such as the development of a Cloud Security Strategy to leverage the built-in capabilities provided by Amazon Web Services (AWS). AWS tools used will include CloudWatch, Inspector, Systems Manager, GuardDuty, Kibana, and QuickSight, with opportunities for the addition of custom tools for configuration management, training, and other elements to complete a robust Cloud-based security framework for KBR. The framework will include an end-to-end DevSecOps platform designed to automate security requirements by embedding security controls and processes early in the DevOps workflow, and will help our customers continue to develop and apply new technology capabilities while retaining systems security.</p><p></p><p>Additional projects will include investigating the value of Digital Twin (DT) in autonomous systems use cases; investigate setting up for the use cases and how the operational AI systems would interact with DT requirements. Explore methodology to address operational decision making utilizing machine learning in Air Traffic Management and other domains. Analyze textual information in transportation datasets to identify commonalities; demonstrate Natural Language Processing (NLP) capability. Managing telematics data, implement ability to overlay multiple vehicle routes on a map to assess road utilization.</p><p></p><p>Other projects will be similar to last year’s summer internship program which consisted of: Reinforcement learning technique to enable autonomous systems and robotics. Research Explainable AI and leveraging this technology to detect bias in machine learning models. Use distributed ledger/block-chain technology to enable governance and management of flight identifiers. Edge computing utilizing neuromorphic processing. Research and development of Augmented Reality and Virtual Reality (AR/VR) software and hardware tools; develop an AR/VR solution to simulate real-world environments and facilitate activities such as remote maintenance of complex systems and virtual training environments.</p><p></p><p>Interns will spend the majority of their time researching, installing, and configuring new tools, programming using the selected tools, and learning more efficient methods to solve a given problem. Interns are not required to be programming experts, but they should have a passion for learning new things and not be afraid to jump in and try out new tools and/or solutions.</p><p></p><p>Interns will leverage an Agile Development process with daily scrum meetings facilitated using Jira to capture user stories and track the status of all issues. Fridays are reserved for documenting the work each week in the form of a Wiki site, as well as numerous forms of documentation (PowerPoint, Word, Visio, etc.). Once a month, interns will present the work they have completed to other staff members at KBR, with a final presentation at the end of the summer to both KBR and customer personnel.</p><p></p><p><b>Required Education:</b></p><ul><li><p>Must be enrolled in undergraduate coursework in a related degree program at an accredited university</p></li><li><p>Must be a Rising Junior or Senior</p></li></ul><p></p><p><b>Preferred:</b></p><ul><li><p>Basic familiarity with virtual environments and cloud-based technologies, as well as programming languages such as Java, Python, Perl etc.</p></li></ul><p></p><p>Work Schedule: Estimated at 32-40 hours/week with flexibility to accommodate intern’s education</p><p></p><p>Work Location: Telework</p></div><p></p>"
    },
    {
        "position": "Intern",
        "company": "Stantec",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "posted": "2021-06-02T20:32:19.832Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=104&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_e8484b5c&cb=1622665872966&jobListingId=4103293927",
        "lastScraped": "2021-06-02T20:32:19.832Z",
        "description": "<div><p>Intern - ( 210001E6 )</p><p><b>Description</b></p><p>Strong communities do not just happen—they are built. They are creatively imagined, collaboratively planned, and readied to face tomorrow with optimism. We are driving the future of Community Development. Our experts lead their fields, collaborating on projects that are as technically challenging as they are impactful, creative, and fulfilling. We are a place where you can apply your passion—and find endless opportunities to help make communities more equitable, resilient, and livable.</p><p><b>Your Opportunity</b></p><p>Stantec’s Digital Solutions group is seeking an Intern beginning in the summer of 2021 for our Seattle office. Our digital solutions team works closely with project managers and clients to develop solutions that enable our clients to have top tier information access and analytics. This journey includes identifying, defining, and developing those products from start to finish.</p><p>Our goal is to transform the water industry with best-in-class digital solutions. These solutions cover the complete project and water lifecycle, from planning to operations, and watershed management to wastewater treatment.</p><p><b>Your Key Responsibilities</b></p><p>Interns will be encouraged to develop their technical skills while supporting our team with research, development, documentation, planning, and miscellaneous project needs.</p><p><b>Your Capabilities and Credentials</b></p><ul><li>Understanding of basic programming principles (experience with C#, HTML, JavaScript, CSS, or Python is preferred).</li><li>Experience with design platforms (Adobe XD, Figma, InVision/Sketch, UXPin) is a plus.</li><li>Experience with MS Office applications (Word, Excel, PowerPoint, Outlook email and calendar functions).</li><li>Excellent communication, research, writing, and technical skills.</li><li>Self-motivated and passionate about data science and/or software development.</li><li>Strong time management, critical thinking, and organizational skills.</li><li>Must have valid driver's license and good driving record.</li><li>The ability to work with others, as well as independently.</li></ul><p><b>Qualifications</b></p><p>Applicants should be a current student or recent graduate of an accredited Bachelor’s or Master’s Degree program studying Computer Science, Computer Information Systems, or other related field.</p><p>Typical office environment working with computers. Some travel may be required such as delivering plans or documents to reviewing agencies or clients or to attend meetings. May occasionally visit study areas, planning sites and/or be exposed to outside elements and inclement weather conditions.</p><p><b>Primary Location</b> : United States-Washington-Bellevue</p><p><b>Job</b> : Co-op/Summer/Intern Student</p><p><b>Organization</b> : BC-2002 Water-US Northwest</p><p><b>Employee Status</b> : Temporary</p><p><b>Job Level</b> : Entry Level</p><p><b>Travel</b> : No</p><p><b>Schedule</b> : Full-time</p><p><b>Job Posting</b> : Jun 1, 2021, 5:05:13 PM</p><p><b>Req ID:</b> 210001E6</p><p>Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans</p></div><p></p>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "General Dynamics Mission Systems, Inc",
        "location": {
            "city": "Dedham",
            "state": "MA"
        },
        "posted": "2021-06-02T20:32:47.936Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=105&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_4eeb05bd&cb=1622665872967&jobListingId=4103147202",
        "lastScraped": "2021-06-02T20:32:47.936Z",
        "description": "<b>Basic Qualifications :</b><br>Currently pursuing a Bachelor's degree in Computer Science, Computer, Software Engineering, or a related field with a preference for a standing of a junior or higher.<br><br>Due to the nature of work performed within our facilities, U.S. citizenship is required.<br><br><b>Responsibilities for this Position:</b><br>General Dynamics Mission Systems is searching for a Software Engineering Intern. You will be an individual technical contributor on a team of engineers that are highly trained and experienced in all areas of technology. You’ll participate in the implementation and test of software for secure systems, for enhancements, and new product development.<br><br>You will apply principles and techniques of computer science, engineering, and mathematical analysis. Our engineering environment applies the highest standards, the most efficient processes and procedures, and cutting-edge tools throughout the development life cycle to bring the best products to our customers.<br><br><b>Company Overview:</b><br>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000 top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. If who we are and what we do resonates with you, we invite you to join our high performance team!<br><br>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran."
    },
    {
        "position": "Intern: Software Engineer (Summer 2021)",
        "company": "Equinix",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-06-02T20:33:02.960Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=106&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_fd3fbc14&cb=1622665872968&jobListingId=3746764688",
        "lastScraped": "2021-06-02T20:33:02.960Z",
        "description": "<div>Intern: Software Engineer (Summer 2021)<p>At Equinix, we make the internet work faster, better, and more reliably. We hire talented people who thrive on solving hard problems and give them opportunities to hone new skills, try new approaches, and grow in new directions. Our culture is at the heart of our success and it’s our authentic, humble, gritty people who create The Magic of Equinix. We share a real passion for winning and put the customer at the center of everything we do.</p><p></p><p>We are looking for bright and enthusiastic college students who love to learn and want to make an impact on the world. Join the Equinix team and shape the future of cloud computing and enterprise connectivity at one of the Fastest Growing Technology Companies in America (Forbes).</p><p></p><p><b>Job Summary</b></p><p></p><p>The Equinix Internship Program offers wide-ranging opportunities in Information Technology, Engineering, Human Resources, Finance and more. Spend your time gaining practical work experience and learning from some of the sharpest minds in the industry. Work in a culture that thrives on innovation and delivering results, while building solid relationships with industry leaders, and fellow students from around the country.</p><p></p><p><b>Responsibilities</b></p><ul><li>Develop innovative solutions, leverage cutting-edge technologies to make Interconnection platforms even better</li><li>Collaborate with the technical minds in building reliable products, researching concepts, and influencing new ideas to design, build, test and deploy modular components that will impact the way the enterprise manages their distributed infrastructure</li></ul><p></p><p><b>Qualifications</b></p><ul><li>Software Engineering or Computer Science degree preferred</li><li>A problem solver who likes to build things, tackle complex technical challenges, and also happen to be Java/JavaScript wrangler</li><li>Like collaborating with a team and a strong communicator</li><li>Thrive in a creative, experimental and face paced environment</li><li>Have experience with Git or have exposure to web application development</li><li>Basic knowledge of programming languages and ability to code</li><li>Technology and design experience</li><li>Actively enrolled in a four-year college/university, rising senior preferred.</li><li>Strong academic track record</li><li>Ability to work in a high-energy and fast-paced environment</li><li>Desire to thrive at Equinix and change the way the world connect</li></ul><p></p><p>Equinix is an equal opportunity employer. All applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability.</p></div>"
    },
    {
        "position": "Software Engineering Summer Intern",
        "company": "Fiserv",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-06-02T20:33:06.773Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=107&ao=134075&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_c970fd7a&cb=1622665872969&jobListingId=4103096658",
        "lastScraped": "2021-06-02T20:33:06.773Z",
        "description": "<div><p><b>Program Overview:</b></p><p>Our Summer Intern program offers hardworking college students an opportunity to go beyond the classroom to develop leadership skills and gain relevant hands on experience working as part of a global support team with professionals across the enterprise. Additionally, interns will participate in scheduled activities throughout the summer, including sessions with Senior Leaders, site tours, volunteer opportunities, and other social events. Fiserv interns are in session from June 2, 2021 – August 13, 2021 and work approximately 40 hours per week.</p><p><b>The Team:</b></p><p>We are a team dedicated on working towards new &amp; innovative solutions in the Fintech space. We are forward thinking &amp; evaluating the latest technologies, but we are also practical. We know that getting to market quickly is key to our customers, our success and to beat our competition. We strive for the simple expression of complex thought. You will be building technologies and experiences that impact millions of people worldwide. Everything from developer portals, APIs to crypto wallets.</p><p>As part of this internship, you will work closely with experienced frontend/backend engineers, designers, dev/cloud ops engineers, product managers &amp; program managers to understand what it takes to ship global products.</p><p>You’ll be a taking part in an Agile development process to build out our products all while enjoying free virtual lunches delivered to your door with the team.</p><p><b>Responsibilities</b></p><ul><li>Perform requirement analysis by collaborating with business and IT stakeholders</li><li>Finalize the project scope for the upcoming phase/sprint</li><li>Conduct the system design in relates to the finalized scope</li><li>Perform application coding to the agreed scope and system design</li><li>Perform unit testing and migrate the unit tested application code to test environment</li><li>Collaborate with quality assurance engineers for system testing, integration testing and regression testing.</li><li>Provide required support to business users for the user acceptance testing</li><li>Prepare the fully tested code base for production implementation</li><li>Collaborate with the deployment team for production implementation</li><li>Provide postproduction support</li></ul><p><br><br><b>Requirements:</b></p><ul><li>Progress toward completion of Bachelor's or Master's degree in Computer Science, or engineering related fields by December 2021/ May 2023 with demonstrated academic achievement.</li><li>Minimum GPA of 3.0 (3.8 or above preferred)</li><li>Experience with one or more general purpose programming languages including but not limited to: Go, JavaScript, Java, Python, or C/C++</li><li>Interest and ability to work at all levels of the software stack; from the front-end to building a data pipeline and cloud-based backend</li><li>Ability to jump to random new tasks in a fast paced project to get things done - learning new things on a daily basis</li><li>Excellent troubleshooting and communication skills</li><li>Team player with high energy.</li><li>Analytical, troubleshooting/problem solving skills.</li><li>Ability to triage issues, react well to changes, collaborate with other test and development teams.</li><li>Must be an effective multi-tasker comfortable working on multiple products and projects.</li></ul><p><b>Preferred:</b></p><ul><li>Experience with React.js, Node.js, Jenkins (or equivalent), Kubernetes, GraphQL, MongoDB (or equivalent)</li><li>Developer should have the ability to do UI design and coding</li><li>Familiarity with architecture styles/APIs (REST, RPC)</li><li>Understanding of Agile methodologies</li></ul><p><b>Education</b></p><ul><li>Preferred education level: Masters</li><li>Preferred degrees: Computer Science, Engineering related field</li><li>Preferred GPA: 3.8+</li></ul><p><b>Learn more about Fiserv:</b></p><p>To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options.</p><p>We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.</p><p>Life moves fast. And as it does, we know most people aren’t thinking about “financial services”. But we are.</p><p>We help people and businesses move money and information every minute of every day. Our solutions connect financial institutions, corporations, merchants and consumers to one another, millions of times a day, behind the scenes, reliably and securely.</p><p>We’re Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The company’s approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.</p><p>Our Aspiration is to move money and information in a way that moves the world. As a FORTUNE™ 500 company and one of FORTUNE Magazine World’s Most Admired Companies for the seventh consecutive year, we are committed to excellence and purposeful innovation.</p><p>We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</p><p>Explore the possibilities of a career with Fiserv and Find Your Forward with us.</p><p>#FINT</p></div><p></p>"
    },
    {
        "position": "Summer Intern - Software Engineering - USAF",
        "company": "Peraton",
        "location": {
            "city": "Simi Valley",
            "state": "CA"
        },
        "posted": "2021-06-02T20:33:18.393Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=108&ao=344467&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_fb9fc1c0&cb=1622665872970&jobListingId=4103097038",
        "lastScraped": "2021-06-02T20:33:18.393Z",
        "description": "We are seeking a Software Engineering Summer Intern in Simi Valley, CA, to support our PC-based Graphical User Interface (GUI) situational display application. This position requires the a bility to obtain a DOD security clearance, which requires a US citizen.<br><br>Known as ADIVS (Air Defense Interoperability Validation System), this application is used to test the data link (i.e. Link 16) capabilities of systems prior to them being fielded. Working alongside our experienced software engineers, you will be e xposed to all phases of product development, from requirements to deliverables, and will be utilizing tools such as Microsoft Office, Microsoft Windows, Install Shield, Subversion and JIRA , among others. Perform software testing, bug tracking and requirements traceability Prepare software documentation, to include writing test procedures, trouble reports and user manual updates Create Power Point presentations that capture software changes Provide office administration support (purchase orders, supplies, shipping, organizing, etc.) Prepare software deliverables – CD’s, labels<br><b>Required Qualifications:</b> A High School diploma and are entering your junior year as a student pursuing a BS in Computer Science, Electrical Engineering, or a related field at an accredited university offering a 4-year degree program Experience with MS Suite: MS Excel, MS PowerPoint, MS Word Ability to obtain a DOD security clearance, which requires a US citizen<br><br><b>Desired Qualifications:</b><br>Basic academic-level software requirements development and software testing experience<br>A GPA of 3.0 or higher<br>Experience with JIRA, Subversion and TortoiseSVN<br>Strong written and verbal communication skills<br>Ability to be detailed-oriented, and to prioritize work and meet quick turnaround deadlines<br>Peraton drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world’s leading mission capability integrator and transformative enterprise IT provider, we deliver trusted and highly differentiated national security solutions and technologies that keep people safe and secure. Peraton serves as a valued partner to essential government agencies across the intelligence, space, cyber, defense, civilian, health, and state and local markets. Every day, our 22,000 employees do the can’t be done, solving the most daunting challenges facing our customers.<br>We are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law."
    },
    {
        "position": "Intern",
        "company": "Sarma",
        "location": {
            "city": "San Antonio",
            "state": "TX"
        },
        "posted": "2021-06-02T20:33:24.720Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=109&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_762d495a&cb=1622665872971&jobListingId=4079843762",
        "lastScraped": "2021-06-02T20:33:24.720Z",
        "description": "<div>Description:<p><b>About Us</b></p><p>Sarma offers multiple service offerings to help consumers and businesses make key decisions. These decisions range from employment, financial decisions, collections activity, profitability growth, purchases, and more. These services include but are not limited to</p><ul><li>Mortgage Credit Services</li><li>Recovery Management Services</li><li>Employment Screening</li><li>Tenant Screening</li></ul><p>We are looking for part-time paid interns who are eager to learn and motivated to contribute to Sarma’s success.</p><p>Sarma’s internships are designed to offer hands-on experience in a professional business environment. Interns will be supporting the operations, production, and support departments of the Organization. They will be responsible for supporting the office with challenging projects and assignments.</p>. Requirements:<ul><li>Good computer skills including MS Office, MS Excel, Internet</li><li>Excellent critical thinking and problem-solving skills</li><li>Ability to multi-task</li><li>Excellent communication skills, both verbal &amp; written</li><li>Customer focused and team-oriented</li></ul><p>Flexible hours for 20 hours a week, Monday – Friday between 8 am - 5 pm</p><p>This program is geared towards Business Administration, Accounting, Finance, Computer Science, or related majors.</p></div>"
    },
    {
        "position": "Engineering Intern",
        "company": "Trane Technologies",
        "location": {
            "city": "Charlotte",
            "state": "NC"
        },
        "posted": "2021-06-02T20:33:32.303Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=110&ao=1091461&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_7e13da47&cb=1622665872971&jobListingId=4102992089",
        "lastScraped": "2021-06-02T20:33:32.303Z",
        "description": "<div><div><div><div>At Trane Technologies® we Challenge Possible. Our brands – including Trane® and Thermo King® - create access to cooling and comfort in buildings and homes, transport and protect food and perishables, connect customers to elevated performance with less environmental impact, dramatically reduce energy demands and carbon emissions, and innovate with a better world in mind. We boldly challenge what’s possible for a sustainable world.<p><b><br>Job Summary</b><br>We are looking for performance-oriented, innovative Leader to support our Aftermarket Engineering team who understand the importance of collaboration and customer focus. We have a 12-week summer assignment for an Intern working toward their Bachelor's in a STEM degree area, preferably Mechanical or Electrical Engineering. This role will include exposure to a variety functional areas, which could include: Value Analysis/Value Engineering, Product Design, and Component and Reliability Selection criteria. During the internship, you will partake in professional development sessions, have access to leaders, and have opportunities to network throughout the company. As we hire the majority of our full time positions through our intern co-op talent, the successful candidate may have an opportunity to interview for full-time positions with our post-graduate career tracks in the Accelerated Development Program, a leadership rotational program.</p><p><b><br>Responsibilities:</b></p><ul><li>Specific internship responsibilities will vary based on your assignment. During your time in the internship program you will be expected to demonstrate the following:<ul><li>Zeal for new information, knowledge, and experiences; regularly seeking and capitalizing on learning opportunities; quickly assimilating and applying new information</li><li>Collaborate with others to foster effective teamwork by linking own responsibilities to the team’s goals and needs</li><li>Rapidly resolve problems to maximize customer satisfaction</li><li>Establish courses of action for self and others to ensure work is completed efficiently, such as, prioritizing tasks based on importance</li></ul></li></ul><p></p><p><b><br>Qualifications</b></p><ul><li>Requirement: Willing to work at our manufacturing site based in Charlotte.</li><li>Pursuing a BS/BA in Electrical or Mechanical Engineering with a cumulative overall GPA at or above 3.0. However, other STEM majors (i.e., Industrial, Computer Science, etc.) with applicable experience will be considered.</li><li>Minimum Work Experience: Junior or Senior year status – completed at least one previous internship <b>or</b> have work experience.</li><li>Demonstrated leadership skills (minimum of one example in the last four years such as school club officer, sports team captain, resident advisor, etc. or exceptional guidance of work projects)</li><li>Requirement: Strong analytical skills working with databases, spreadsheets, etc.</li><li>U.S. citizen or have the legal right to work in the U.S. without requiring sponsorship now or in the future.</li></ul><b><br></b><br><br>We offer competitive compensation and comprehensive benefits and programs that help our employees thrive in both their professional and personal lives. We are proud of our winning culture which is inclusive and respectful at its core. We share passion for serving customers, caring for others, and boldly challenging what’s possible for a sustainable world.<br><br>We are committed to achieving workforce diversity reflective of our communities. We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, pregnancy, age, marital status, disability, status as a protected veteran, or any legally protected status.</div></div></div></div>"
    },
    {
        "position": "DevOps Automation Intern",
        "company": "WebMD",
        "location": {
            "city": "Portland",
            "state": "OR"
        },
        "posted": "2021-06-02T20:33:38.745Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=111&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_54a754b6&cb=1622665872972&jobListingId=4102970289",
        "lastScraped": "2021-06-02T20:33:38.745Z",
        "description": "<div>WebMD's Health Services business enables employers and health plans to provide their employees and plan members with access to personalized health and benefit information, decision support technology that helps them make informed benefit, provider and treatment choices and provides telephonic health coaching services.<br><br><b>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</b><p>We are looking for a talented college student that’s interested in a Software Development Internship. You’ll have the opportunity to become part of an established, creative Software Development team working on applications that inspire people to take charge of their health.</p><p><b>Primary Responsibilities</b></p><ul><li>Contribute to an agile, supportive, development team taking part in daily stand-ups, sprint planning meetings and retrospectives</li><li>Review project requirements and define acceptance criteria with the team</li><li>Design and implement solutions making appropriate use of software design patterns and best practices</li><li>Implement test fixtures, acceptance tests, and unit tests</li><li>Learn from others, and teach others ... while working toward common goals</li></ul><p><b>Skills/Requirements</b></p><ul><li>Enrolled in a bachelor’s program – preferably focused in Computer Science or Computer Engineering</li><li>Excellent communications skills</li><li>Strong problem solving skills</li><li>Knowledge of programming languages such as C# and Java</li><li>General knowledge of web application and datacenter infrastructure</li></ul>As a member of WebMD Health Services, you may have access to confidential and sensitive information (including Protected Health Information) that will require you to follow additional protocols to ensure the security of our data. As a core requirement, you must implement and act in accordance with the organization’s information security policies; protect assets from unauthorized access, disclosure, modification, destruction or interference; execute security processes or activities; and report security events or potential events or other security risks to the appropriate parties within the organization.</div>"
    },
    {
        "position": "Full Stack Development Intern",
        "company": "Sikka Software Corporation",
        "location": {
            "city": "Santa Clara",
            "state": "CA"
        },
        "posted": "2021-06-02T20:33:47.784Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=112&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_a6388fc6&cb=1622665872972&jobListingId=4103280246",
        "lastScraped": "2021-06-02T20:33:47.784Z",
        "description": "<p><b>Role and Responsibility: </b></p><p>The Full Stack Developer Intern is responsible for the design and coding of mobile, web-based and conversational experiences, from technical architecture and APIs to function according to product specifications. Fully versed in modern databasing, ideally thrives to create excellent user experiences, attention to detail visually and understands that “user-friendly” starts with a fast and reactive architecture that delivers immediate user delight. Understands the basics of data-driven product development and thrives in an ultra-fast, dynamic and iterative 24/7 global team.</p><p><b>Qualifications: </b></p><ul><li>Databasing: an understanding of legacy SQL/RDBMS complemented with knowledge of NoSQL, map-reduce and graph databases and ability to bridge those worlds.</li><li>API: Ability to navigate effortlessly between SOAP and REST, speaks JSON fluently, understands the value of real-time, knows how to stitch front-end with back-end in no time</li><li>Web: Inner knowledge of React and Vue.</li><li>Mobile: iOS is a must, Android is ok</li><li>Creative: fully understands that user interfaces are critical for a product’s success. Basic understanding of design principles (ex: material), techniques and tools (ex: sketch) a definite plus</li><li>Understands usage data technologies such as Mixpanel and knows how to effectively track and report, either to humans via dashboard or ML engines</li><li>REACT knowledge and experience a must</li><li>Academic background: recently graduated or currently enrolled in a Master's Degree in Computer Science.</li></ul><p><b>Nice to have: </b></p><ul><li>Data science and machine learning background in order to be able to understand effectively self-configuring software and usage-based UX/UI development, basic knowledge of math behind machine learning, neural networks, natural language processing, languages (python and python), frameworks (TensorFlow, torch, keanor, …)</li></ul><p>Apply to start your career adventure with us!</p><p>Principals only please.</p><p>Job Types: Full-time, Internship</p><p>Pay: $20.00 - $23.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "OPSWAT",
        "location": {
            "city": "Tampa",
            "state": "FL"
        },
        "posted": "2021-06-02T20:33:57.398Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=113&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_1c1ad218&cb=1622665872972&jobListingId=4079714626",
        "lastScraped": "2021-06-02T20:33:57.398Z",
        "description": "<div><p>The Position:</p><p>We are looking for current Computer Science or Computer Engineering students to join one of our software development teams in Tampa, Florida for an internship. If you are a current student or a student taking a gap year due to COVID and are interested in designing and building unique security software that no one else is building, then this exciting opportunity is for you. As part of a larger team, you will be given project-oriented work helping develop professional cybersecurity solutions used to protect critical infrastructure around the world. You will get exposure to every stage of the software development lifecycle, planning, design, coding, testing, and deployment amongst other stages.</p><p></p><p><br>What You Will Be Doing:</p><ul><li>Project oriented hands on coding assignments and professional development activities</li><li>Using latest cloud and on-premise technology stacks</li><li>Contributing to the design and architecture of the solutions you work on</li><li>Enhancing the automation testing framework to achieve test driven development</li><li>Starting your career as a software engineer under the mentorship of experienced team members</li></ul><p></p><p><br>What We Need From You:</p><ul><li>A passion for Cyber security and learning</li><li>Progress toward a Bachelor's Degree or higher in Computer Science, or a related major</li><li>Examples of extracurricular programing projects (e.g. on Github)</li><li>Strong collaboration and communication skills</li></ul><p></p><p><br>About OPSWAT</p><p>OPSWAT is a global leader in critical infrastructure cybersecurity that helps protect the world's mission-critical organizations from malware and zero-day attacks. To minimize the risk of compromise, OPSWAT Critical Infrastructure Protection (CIP) solutions enable both public and private organizations to implement processes that ensure the secure transfer of files and devices to and from critical networks. In total, 98% of U.S. nuclear power facilities and more than 1,000 organizations worldwide spanning Financial Services, Defense, Manufacturing, Energy, Aerospace, Transportation Systems trust OPSWAT to secure their files and devices; ensure compliance with industry and government-driven policies and regulations, and to protect their reputations, finances, employees, and relationships from cyber-driven disruption. For more information, visit www.opswat.com.</p><p>To apply for this position, please send your resume and cover letter to us via JobScore. Special consideration will be given to those candidates whose cover letter indicates that they have viewed our website. Please, no drop-ins, calls, or faxes.</p></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Johanson Transportation Service",
        "location": {
            "city": "Tigard",
            "state": "OR"
        },
        "posted": "2021-06-02T20:34:09.303Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=114&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_8ecc50f5&cb=1622665872972&jobListingId=4102921797",
        "lastScraped": "2021-06-02T20:34:09.303Z",
        "description": "<p><b>College Intern – Software Engineer</b></p><p>We are looking for a college intern working towards a Bachelor’s Degree in Computer Science, Computer Engineering, or Management Information Systems. Candidate should have a strong interest in web applications and the desire to learn new technologies. Someone entering their senior year strongly preferred.</p><p><b>Job Duties</b></p><p>Work on new and existing software projects both individually and in a team environment.</p><p>Develop front and middle tier web applications.</p><p>Interface with third-party Web APIs and FTP csv files, to send and receive data.</p><p>Create/interpret project requirements through working with team members and customers with various experiences and skill sets. Must have strong verbal and written communication skills.</p><p>Write reliable, commented, and maintainable code and take ownership of it.</p><p>Perform extensive testing and create production ready solutions.</p><p>Provide support and troubleshooting for existing production applications.</p><p><b>Requirements</b></p><ul><li>Exposure to standard Web technologies such as HTML, CSS, JavaScript</li><li>Exposure to REST services, Web APIs, and Web services</li><li>Exposure to ASP.NET or other server side web technologies</li><li>Knowledge of Client-side technologies like Angular, React, JQuery, Bootstrap</li><li>Knowledge of Object oriented programming</li><li>Experience working with languages like C# and/or Java</li><li>Exposure to SQL database technologies (Queries, Stored Procedures, Functions, Parsing)</li><li>Willingness to learn and become proficient in new and changing technologies</li></ul><p><b>Nice to have</b></p><ul><li>Familiarity with MS Azure, AWS, or other Cloud Technologies</li><li>Exposure with Entity Framework</li><li>Solid understanding of data structures and algorithms</li><li>Familiarity with Android or iPhone Application Development</li><li>Use of Git or other software code management system</li><li>Hands on Exposure with Visual Studio or Visual Studio Code</li><li>Exposure with Microsoft SQL</li><li>Exposure with team based source control systems</li></ul><p>Job Types: Full-time, Internship</p><p>Pay: $25.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Trimble",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-06-02T20:34:21.891Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=115&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_3e81f2de&cb=1622665872972&jobListingId=4102974181",
        "lastScraped": "2021-06-02T20:34:21.891Z",
        "description": "<div><p><b>Title: </b>Software Engineering Intern<br><b>Location: </b>Sunnyvale, California (or Westminster, CO) (remote)<br><br>The Timing and Frequency division at Trimble develops embedded devices that provide high-precision timing signals for wireline and wireless networks. We provide industry-leading solutions using our products based on GNSS, PTP, NTP, and other state-of-the-art protocols and technologies. We are currently working on the next generation of products to address the needs of the evolving 5G standards and industry adoption of new wireless network technologies.<br></p><p><br><b>Job Summary:</b><br>Trimble is seeking a Software Engineering Intern who will be responsible for developing firmware solutions for Linux, RTOS, and/or bare metal-based systems in the area of packet network timing protocols such as PTP, NTP, SyncE, etc.<br></p><p><br><b>In this role you will:</b></p><ul><li><p>Have the opportunity and mentorship to apply the theoretical knowledge gained during your graduate program to acquire/improve your understanding of the software development cycle in the real world</p></li><li><p>Gain exposure to development in the context of a large, complex codebase and expected to learn and adhere to the software quality standards</p></li><li><p>Develop knowledge in GNSS technologies and methodologies of deriving time from GNSS signals - a core functionality of our product line.</p></li><li><p>Learn to use various tools for source code management, bug tracking, and code quality to develop and deliver modules using best practices and guidelines<br></p></li></ul><p><br><b>Required Skills &amp; Experience:</b></p><ul><li><p>Excellent programming skills in C/C++, in-depth knowledge in Data Structures, OS concepts, and Embedded systems</p></li><li><p>Knowledge of Ethernet switching, network security, and Ethernet PHY layer devices and drivers</p></li><li><p>Be able to work efficiently in a highly collaborative environment and expected to manage your time and dependencies effectively</p></li><li><p>Strong written and verbal communication skills and a working knowledge of AGILE development processes</p></li><li><p>Actively pursuing a degree(s) in Computer Science, Computer Engineering, Electrical Engineering or a related field, MS preferred</p></li></ul><p></p><p>Trimble Inc. is proud to be an Equal Opportunity and Affirmative Action Employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, status as a covered veteran in accordance with applicable federal, state and local laws, or any other protected factor. EOE/M/F/V/D</p></div>"
    },
    {
        "position": "Information Security Intern",
        "company": "Ameritas",
        "location": {
            "city": "Lincoln",
            "state": "NE"
        },
        "posted": "2021-06-02T20:34:29.596Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=116&ao=1044074&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_fc8a2d4f&cb=1622665872973&jobListingId=4102808879",
        "lastScraped": "2021-06-02T20:34:29.596Z",
        "description": "At Ameritas, fulfilling life is what we do daily. We continuously strive to help our customers and employees enjoy life at its very best by reducing uncertainty, helping grow assets and protecting what is most cherished. We're here to help people put worry behind and the future ahead and help enable a life that's rich in family, happiness, health and financial security. When lives are fulfilled, our mission is fulfilled.<br><br>Ameritas Life Insurance Corp is seeking an Information Security Intern to drive the business by delivery of IT security services or functions. This position would perform all procedures necessary to ensure the safety of information systems assets and to protect systems from intentional or inadvertent access or destruction.<br><br>Essential Job Functions<br><br><ul><li>Internship opportunity to assist Enterprise Security in the various areas of responsibility the department is charged with.</li><li>Departments would include:</li><li>Secure Cloud Computing</li><li>Vulnerability Management</li><li>Security Operations</li><li>Risk Management</li></ul>Requirements<br><br><ul><li>Actively pursuing an Information Technology or Information Security degree program</li><li>Computer skills with proficiency in Microsoft Office</li><li>Desire to learn and grow</li><li>Effective documentation skill for process and standard development</li><li>Good communication skills and ability to work with others</li><li>Familiarity with programming or scripting languages is a plus</li><li>Availability to work part time during the academic year (15-20 hours weekly) and full time over summer months (40 hours weekly)</li></ul>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"
    },
    {
        "position": "Intern - Software Test Engineer",
        "company": "Persistent Systems",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-06-02T20:34:33.876Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=117&ao=1020558&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_beed4bde&cb=1622665872973&jobListingId=4053972483",
        "lastScraped": "2021-06-02T20:34:33.876Z",
        "description": "<p>Persistent Systems is seeking a Software Test Engineer Intern who will be responsible for software testing for our Wave Relay® products. This includes providing special analysis required for initial software testing, quality assurance, and regression testing. The Software Test Engineer Intern will be responsible for ensuring that our products meet customer and management requirements, as well as Persistent Systems' quality standards. </p><p><strong> </strong></p><p><strong>Position Responsibilities</strong></p><ul><li>Testing the software development and equipment for the Wave Relay® system</li><li>Development and implementation if a wide range of low-level software, hardware development, and testing of application software (including device drivers, Linux kernel modules, network stack development, and other low-level programming activities)</li><li>Supporting in-house and in-the-field engineering activities including travel to customer sites</li><li>Integrating other systems, sensors, and components with the Wave Relay® system</li><li>Writing technical proposals</li></ul><br><p><strong>Minimum Qualifications</strong></p><ul><li>Must be working towards Bachelor’s Degree in Computer Science or a related field or equivalent experience</li><li>Experience participating in software test requirements</li><li>Experience with process improvement, including driving and enhancing data and process quality</li><li>Experience building software test plans including regression, functional, performance, and stress testing</li><li>Experience generating procedure, test plans, and test result reports</li><li>Experience writing scripts to automate tests</li><li>Experience with building test platforms, fixed and variable, in order to facilitate repeatable, efficient software test life</li><li>Knowledge of wireless communication and networking systems</li><li>Ability to obtain a US security clearance or already have one</li></ul><p> </p><p><strong>Preferred Qualifications</strong></p><ul><li>Database experience including proficiency at writing and executing SQL database queries</li><li>Experience with Cisco and enterprise networking</li><li>ISO9001:2008 quality system experience</li></ul><br><p>Persistent Systems is a growing business that develops Mobile Ad hoc Networking (MANET) wireless radio systems for Government and commercial applications. The radios are typically worn on the person, mounted to manned vehicles, integrated into autonomous unmanned vehicles, or installed at fixed sites. The systems provide on-the-move data, voice, video, and situational awareness capability. Located in the heart of New York City, Persistent Systems is an exciting company that is passionate about delivering cutting edge products.</p>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Levy Electric Scooters",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-06-02T20:34:42.763Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=118&ao=1044077&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_e3a5ca98&cb=1622665872974&jobListingId=4102859546",
        "lastScraped": "2021-06-02T20:34:42.763Z",
        "description": "<p>Software Engineering Intern <br>Levy Electric is transforming urban mobility with uniquely designed, built-to-own electric scooters. Based on New York, we are one of the leading US-based companies designing lightweight electric vehicles. In addition to direct sales, we also have recently launched a B2B platform that allows independent operators a turnkey solution for launching their own rental fleets using Levy vehicles and software.</p><p>Levy is looking for aspiring software engineers from a scope of disciplines. As an intern, you’ll have the opportunity to work on various projects within our tech stack - including Android / iOS mobile app development, AWS serverless infrastructure, as well as our backend data infrastructure.</p><p>Primary responsibilities:</p><ul><li>New feature development for our rental Fleet Management software.</li><li>Building and improving on custom built tools that support internal business operations.</li><li>Technical configuration for new location launches</li><li>Packaging and deploying new iOS and Android releases</li><li>Creating test plans and building automated testing infrastructure.</li></ul><p>Minimum qualifications:</p><ul><li>Currently pursuing or graduated with a B.S. or M.S. in Computer Science or equivalent</li><li>Experience with object-oriented programming</li><li>Ability to thrive in a startup environment</li><li>Passion for mobility and transportation</li></ul><p>Job Types: Part-time, Internship</p><p>Pay: $15.00 - $20.00 per hour</p><p>Benefits:</p><ul><li>Employee discount</li><li>Flexible schedule</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>REST: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"
    },
    {
        "position": "AI Based Medical Image Analysis Intern",
        "company": "LaborView",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2021-06-02T20:34:51.731Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=119&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_f9543c9b&cb=1622665872974&jobListingId=4053798072",
        "lastScraped": "2021-06-02T20:34:51.731Z",
        "description": "<p></p><div><div>Job Description</div><p>Are you interested in an Intern opportunity with Philips? We welcome individuals who are currently pursuing (or have recently completed) a graduate (MS) or PhD degree to participate in a 3-month paid internship opportunity. Through this role, you will gain meaningful, hands-on experience working in a HealthTech company.</p><div><br><br>In this role, you have the opportunity to</div><div><ul><li><br>Develop novel algorithms for medical ultrasound imaging and/or interventional ultrasound using machine learning/deep learning techniques</li><li>Prepare and process ultrasound data</li><li>Propose and develop new algorithms</li><li>Conduct extensive validation of the proposed algorithms</li><li>Document the work and contribute to the publication of the work</li></ul></div><p><br>You are responsible for</p><div><ul><li><br>Taking the lead on part of a challenging research project and collaborating with a team of scientists</li><li>Developing and validating novel image analysis algorithms (image registration, segmentation, and tracking)</li><li>Designing and training deep networks on real clinical data and evaluating performance</li><li>Working with advanced imaging systems and modalities (e.g. advanced 3D/4D ultrasound)</li><li>Reporting results in the form of technical documentations and presentations</li></ul></div><p><br>You are a part of</p><p><br>A leading team of scientists within Philips Research Labs, Cambridge, focusing on development of tools to improve medical ultrasound and image guided therapies</p><p><br>To succeed in this role, you should have the following skills and experience</p><div><ul><li><br>Computer Science / Electrical / Biomedical / Mechanical Engineering or Mathematics students at all levels are welcome to apply. M.Sc. or PhD candidates are strongly preferred</li><li>Must have hands on experience with classical and modern machine learning techniques.</li><li>Extensive experience with deep learning tools and frameworks (e.g. TensorFlow, Keras, PyTorch etc.).</li><li>Knowledge of image processing tools and algorithms; experience with medical imaging and/or interventional technologies is a plus</li><li>Proficiency in one of the following programming languages: Python, C++.</li><li>Ability to work within a team environment and should be self-motivated with the ability to plan and execute.</li><li>Proficiency in English, both written and verbal communication</li></ul></div><p></p><p><b>Why should you join Philips?</b></p><p>Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.</p><p></p><p>To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.</p><p></p><div>Contact</div><p><b>If you forgot your password, you can click the </b><b>Forgot Password </b><b>button on the Sign In screen to reset it.</b></p></div>"
    },
    {
        "position": "Computer Science/Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "OH"
        },
        "posted": "2021-06-02T20:35:05.776Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=120&ao=1091454&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_99566783&cb=1622665872974&jobListingId=4102720792",
        "lastScraped": "2021-06-02T20:35:05.776Z",
        "description": "<p><b>Applied Optimization (AO) Job Description</b></p><p><b>Job Title: </b> Computer Science/Computer Engineering Intern<br><b>Reports to: </b> Principal Scientist<br><b>FLSA Status: </b> Part-Time (Non-Exempt)<br><b>Department: </b>ME</p><p><b>Position Objective</b><b>: </b></p><ul><li>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms in the areas of <b>mechanical engineering and space science</b></li></ul><p><b>Essential Functions: </b></p><ul><li>Aid in designing, building, testing, and implementing software applications for computer networks</li><li>Provide technical support for object modeling and algorithm development for new generation science applications</li><li>Perform verification, documentation, and quality assurance for new and existing software</li><li>Support development and maintenance of hardware, software and other operating systems</li><li>Run software updates and backups</li><li>Perform research in computer operating systems</li><li>Interpret blueprints, technical drawings, schematics, and computer-generated reports</li><li>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work</li><li>Other related duties as assigned</li></ul><p><b>Required Qualifications: </b></p><ul><li>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record</li><li>General understanding of software development and knowledge of various coding languages</li><li>Attention to detail and effective time and schedule management skills</li><li>Effective organizing, planning, debugging, and problem-solving skills</li><li>Ability to adapt within a small team to support evolving customer requirements</li><li>Ability to execute instructions and communication in written, oral, and diagram form</li><li>Demonstrated strong writing, fact-gathering, and analytical skills</li><li>Basic computer and software skills including but not necessarily limited to Microsoft Office products (e.g., Outlook, Word, and Power Point)</li><li>Must have received or be willing to receive the COVID-19 vaccine by date of hire to be considered, if not currently employed by Applied Optimization</li></ul><p><b>Preferred Qualifications: </b></p><ul><li>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher</li><li>Minor or dual degree in mathematics or physics</li><li>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages</li><li>Knowledge or experience in CSS, Django, D3-data visualization, and Linux</li><li>Knowledge of computer operating systems</li></ul><p><b>Citizenship/Security Clearance Requirements: </b></p><ul><li>U.S. Citizen or Green Card Holder</li><li>May be required to obtain and maintain U.S. Government Security Clearance</li></ul><p><b>About Our Internships: </b></p><ul><li>Hours: The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the student’s class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.</li></ul><p><b>About Us: </b> Applied Optimization is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.<br>This job description is subject to change.</p><p>Job Types: Part-time, Internship</p><p>Schedule:</p><ul><li>Day shift</li><li>Monday to Friday</li></ul><p>Application Question(s):</p><ul><li>What is your cumulative GPA?</li><li>When is your expected graduation date?</li></ul><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"
    },
    {
        "position": "Summer IT Intern",
        "company": "DR Power Equipment",
        "location": {
            "city": "South Burlington",
            "state": "VT"
        },
        "posted": "2021-06-02T20:35:19.363Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=121&ao=1044077&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_121ed3d5&cb=1622665872974&jobListingId=4102567493",
        "lastScraped": "2021-06-02T20:35:19.363Z",
        "description": "<p><b>IT Intern</b></p><p>It’s a challenge, and an invitation. Most importantly, it’s an opportunity to join an industry leader.There’s never been a better time to work at Generac. We’re shaping the market and investing in new companies and new technologies. Our rapid growth equals rapid career advancement opportunities for those who want to be challenged and enjoy a fast-paced, high-performance culture.</p><p><b>JOB SUMMARY: </b>The IT Technician Intern is responsible for assisting the IT team a wide range of duties including network consolidation, inventorying and organizing server hardware equipment, and completing computer imaging and lifecycle swaps. This internship is full-time Monday-Friday and will run until early/mid-August.</p><p><b>ESSENTIAL DUTIES AND RESPONSIBILITIES</b></p><ul><li>Complete Network consolidation and documentation including floorplan</li><li>Conduct and document complete server and hardware inventory, identifying equipment that is not in use and initiating the e-cycle process</li><li>Organize cables, including updating labels</li><li>Transcribe physical inventory into Excel sheet</li><li>Complete computer imaging</li><li>Assist with lifecycle swaps/profile migrations</li></ul><p><b>MINIMUM QUALIFICATIONS</b></p><ul><li>Microsoft Office proficiency with strong aptitude in Excel</li><li>Strong familiarity with Visio and/or other CAD based software</li><li>Windows 10 OS advanced control and configuration</li><li>The ability to problem solve technical and logistical issues.</li><li>Willingness and desire tp constantly learn new things</li><li>General knowledge of Networks (TCP/IP)</li><li>Conscientious self-motivated worker with an attention to detail</li><li>Sophomore year status or higher</li><li>Currently enrolled in an Associates or Bachelor's program with an emphasis in Computer Science or related major</li></ul><p><b>PHYSICAL DEMANDS: </b><br>While performing the duties of this job, the employee is regularly required to talk and hear; and use hands to manipulate objects or controls. The employee is regularly required to stand and walk. On occasion the incumbent may be required to stoop, bend or reach above the shoulders. The employee must occasionally lift up to 25 pounds. Specific conditions of this job include are typical of frequent and continuous computer-based work requiring periods of sitting, close vision and ability to adjust focus.<br>“We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.”</p><p><b>About DR Power</b></p><p>Originally Incorporated as \"Dick Raymond's Country Home Products\"​ in 1985, our company's first product was the Dick Raymond Work/Rest Wagon. Two years later, the DR Trimmer Mower ushered in an all-new category in outdoor power equipment. We are passionate about innovative, high quality design and we appreciate good tools that are durable, simple and useful. We only offer products we use ourselves, each one vigorously tested for performance and durability, described truthfully, and guaranteed to be one of the best quality and value available. It’s more than just a pay check and a comfy chair around here. We keep it fun! It’s a huge testament to how satisfied our employees are that have been named among the Best Places to Work in Vermont for the 8 times by the Best Companies Group. This list is compiled based on confidential employee surveys, and we are extremely proud of how positively our employees rate us. And don’t worry if you’re not a power equipment aficionado. While many of our employees live the country lifestyle and know their way around a log splitter before the even set foot in our office, many learn the ins and outs once they get here. No sweat either way. We’re more interested in your initiative and attitude than how many types of lawn mower you can name. We respect our customers and each other. That’s how we’ve created such a sought-after work environment — one that continually attracts the very best professional people. The kind of people who care about the company they work for, the job they do and the customers they serve. If you are interested in joining our team, visit us at www.drpower.com/careers</p><p>Job Types: Full-time, Temporary, Internship</p><p>Pay: $15.00 - $17.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>Ability to Commute/Relocate:</p><ul><li>South Burlington, VT 05403 (Required)</li></ul><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Experience:</p><ul><li>Help desk: 2 years (Preferred)</li><li>Microsoft Excel: 2 years (Preferred)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"
    },
    {
        "position": "Senior Intern",
        "company": "Caravel Autism Health",
        "location": {
            "city": "Franklin",
            "state": "WI"
        },
        "posted": "2021-06-01T20:35:32.458Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=122&ao=1044077&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_b97f50fe&cb=1622665872974&jobListingId=4102589961",
        "lastScraped": "2021-06-02T20:35:32.458Z",
        "description": "<p>Senior Intern positions provide the necessary training to potentially develop into a Senior Staff position. Typically, individuals can progress from a Senior Intern to a Senior Staff as they develop and gain experience through required training. Senior Interns are responsible for assessing the client’s current level of development across the various sections of the curriculum, designing the majority of the client programs, writing the Individual Treatment Plan (under the direction of the Clinical Supervisor and Lead Therapist), and providing most of the hands-on supervision for Behavior Technicians. Senior Intern responsibilities and caseloads systematically increase as training goals are met.</p><p>Essential Functions:<br>1. Completes required office and field training toward a Senior Staff position and demonstrates mastery with training goals.<br>2. Develops client-specific therapeutic treatment plans based on appropriate assessments and developmental guidelines.<br>3. In conjunction with supervisory staff and caregivers, develops programs appropriate to the current and future needs of the clients. Creates programs, moves targets forward, prepares program materials, and makes procedural changes as needed.<br>4. Designs and implements behavior observation systems, support plans, and intervention guidelines.<br>5. Coordinates the collection, summarization and analysis of data related to individual program goals and behavioral plans.<br>6. Consults with Behavior Technicians, caregivers, and supervisory staff to ensure that programming is adequate to meet the needs of the client.<br>7. Analyzes program data to ensure appropriate progress and effectiveness.<br>8. Develops and maintains weekly and monthly progress notes, reviews clinical documentation of Behavior Technicians, and updates treatment plans.<br>9. Completes appropriate assessments and probes new targets to determine future goals.<br>10. Communicates with parents, guardians or other caregivers concerning behavioral and educational programming.<br>11. Supervises, orients, and trains Behavior Technicians in the implementation of programs and behavioral intervention procedures, routinely providing ongoing coaching and feedback to enhance staff development and skill. Ensures Behavior Technician is oriented appropriately to the company and follows all policies and procedures.<br>12. Evaluates Behavior Technician performance and addresses issues to ensure quality and consistency across clinical programs.<br>13. Proactively addresses employee relation issues or concerns, including ongoing coaching and feedback, employee development, performance management, and if appropriate, disciplinary action.<br>14. May participate in weekly clinical team meetings to discuss case progress, address Behavior Technician and caregiver concerns, review individual program plans, and recommend revisions as necessary.<br>15. Provides verbal, written, and graphic communications.<br>16. Consults with supervisory staff to ensure the provision of effective and efficient service delivery.<br>17. Continually develops skills and knowledge in the area of behavior analysis through participation in continuing education, workshops, and required company trainings.<br>18. Follows and abides by all APA ethical guidelines and appropriate policies, regulations, and laws including confidentiality and HIPAA. Adheres to mandated reporting regulations.</p><p>Supervisory Responsibility: Supervises Behavior Technician on assigned client cases.</p><p>Physical Demands:<br>While performing the duties of this job, the employee may be exposed to a client who exhibits physically aggressive behavior which can include kicking, pinching, punching, biting, etc. The employee may have to use appropriate behavior management techniques frequently with a client under such circumstances. Such response requires agility, quick reflexes, and the ability to use physically evasive movement. The employee will be constantly required to stand, walk, sit, grasp, reach, bend, kneel, crouch, squat, hear, type and write. In addition, the employee will be exposed to normal office conditions and usual office equipment such as phone, computer, printers, copiers, files, etc. The employee must be able to independently and repeatedly lift, move and carry objects weighing up to thirty-five (35) pounds. Specific vision abilities required by this job include near, far, and field of vision. Speech must be spoken in a way in which others will understand. This position requires regular and punctual employee presence.</p><p>Qualifications:<br>Education:</p><ul><li>A Bachelor’s Degree in a human services discipline or documentation of actively pursuing a Bachelor’s Degree in a human services discipline with anticipated graduation date within six months from initiation of internship and at least 1,500 hours of training or supervised experience in the use of behaviorally based therapy models consistent with best practice and research on the effectiveness for children with autism spectrum disorders who meet all criteria to receive this service, OR</li><li>A Bachelor’s Degree in a non-human services discipline and actively pursuing either a BCaBA, BCBA, or a Master’s Degree in a human services discipline with graduation/certification date within six months from initiation of internship, and at least 1,500 hours of training or supervised experience in the use of behaviorally based therapy models consistent with best practice and research on effectiveness for children with autism spectrum disorders who meet all criteria to receive this service, OR</li><li>A Board Certified Assistant Behavior Analyst (BCaBA) with a minimum of 400 hours of hands-on training in providing ABA services directly to children and/or adults with autism under the supervision of a Board-Certified Behavior Analyst who has at least two years of experience in ABA programming for individuals with autism, OR</li><li>Legal authorization to perform psychotherapy, with a Master’s Degree in one of the behavioral sciences who has at least 400 hours of training or supervised experience in the use of behaviorally-based therapy models consistent with best practice and research on effectiveness for children with autism spectrum disorders, in addition to, or as part of their 3,000 hours of training/supervision; and have sufficient written evidence of training and/or education in the method of evidence-based therapy being delivered, prior to the provision of services.</li></ul><p>Experience:</p><ul><li>Must have at least 1,500 hours’ experience working as a Behavior Technician implementing programs based on ABA principles.</li><li>Must have experience working with children and adolescents, utilizing ABA therapies.</li><li>A solid understanding of autism and behavioral principles.</li><li>Experience utilizing applied behavior analytic strategies to modify behavior.</li><li>Experience with functional behavior assessments and writing behavior support plans.</li></ul><p>Other:</p><ul><li>Must be 18 years old or older.</li><li>Must have a valid driver’s license and provide proof of auto insurance.</li></ul><p>Job Type: Full-time</p>"
    },
    {
        "position": "Computer Science Internship",
        "company": "College Raptor",
        "location": {
            "city": "Coralville",
            "state": "IA"
        },
        "posted": "2021-06-01T20:35:42.484Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=123&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_cbb11abb&cb=1622665872974&jobListingId=3821319197",
        "lastScraped": "2021-06-02T20:35:42.484Z",
        "description": "<div><p>Are you a Software Developer looking for the fast-paced environment of a funded startup in the Iowa City / Cedar Rapids area?</p><p>College Raptor is a higher education technology company that's working to simplify the college search and application process. We help families match students with schools based on their interests, fit and affordability, which ensures the best education for the money!</p><br><br><p>We are currently looking for an experienced Full Stack .NET Developer to join our team. You'll be a key member of our Technology team, building front-ends, web development, SQL server and C#.</p><br><br><p>We're moving fast and need engineers who, given a clear goal, can prioritize projects and tasks, and meet deliverables in a self-directed fashion.</p><br><br><div>What you'll need</div><div></div><div><div>Ability to work onsite in Coralville, IA - this is not a “remote office” or “telecommute” position.<br></div><br><div>3 - 5 years of experience using .NET framework, C#, MVC, ASP.NET, XML and Web Services</div><br><div>Strong SQL Server knowledge<br></div><br><div>Solid written and oral communications</div><br><div>Team player who openly shares opinions and new ideas while maintaining flexibility to quickly adjust to new project requirements.</div></div><br><br><div>Nice to have</div><div></div><div><div>HTML, CSS and Javascript</div><br><div>Experience implementing responsive design using Bootstrap, JQuery</div></div><br><br><div>How to apply</div><div></div><p>Please send a resume and a cover letter explaining why you are a great match for this role to [email protected]. Please include URLs to relevant writing, design or video samples.</p></div>"
    },
    {
        "position": "AI Based Medical Image Analysis Intern",
        "company": "Philips",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2021-06-01T20:35:51.502Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=124&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_ba420ba3&cb=1622665872975&jobListingId=4053671320",
        "lastScraped": "2021-06-02T20:35:51.502Z",
        "description": "<div><h3><b>Job Title</b></h3>AI Based Medical Image Analysis Intern<p></p><h3><b>Job Description</b></h3><p>Are you interested in an Intern opportunity with Philips? We welcome individuals who are currently pursuing (or have recently completed) a graduate (MS) or PhD degree to participate in a 3-month paid internship opportunity. Through this role, you will gain meaningful, hands-on experience working in a HealthTech company.</p><h3><b><br></b><br><b>In this role, you have the opportunity to</b></h3><div><ul><li><br>Develop novel algorithms for medical ultrasound imaging and/or interventional ultrasound using machine learning/deep learning techniques</li><li>Prepare and process ultrasound data</li><li>Propose and develop new algorithms</li><li>Conduct extensive validation of the proposed algorithms</li><li>Document the work and contribute to the publication of the work</li></ul></div><p><br>You are responsible for</p><div><ul><li><br>Taking the lead on part of a challenging research project and collaborating with a team of scientists</li><li>Developing and validating novel image analysis algorithms (image registration, segmentation, and tracking)</li><li>Designing and training deep networks on real clinical data and evaluating performance</li><li>Working with advanced imaging systems and modalities (e.g. advanced 3D/4D ultrasound)</li><li>Reporting results in the form of technical documentations and presentations</li></ul></div><p><br>You are a part of</p><p><br>A leading team of scientists within Philips Research Labs, Cambridge, focusing on development of tools to improve medical ultrasound and image guided therapies</p><p><br>To succeed in this role, you should have the following skills and experience</p><div><ul><li><br>Computer Science / Electrical / Biomedical / Mechanical Engineering or Mathematics students at all levels are welcome to apply. M.Sc. or PhD candidates are strongly preferred</li><li>Must have hands on experience with classical and modern machine learning techniques.</li><li>Extensive experience with deep learning tools and frameworks (e.g. TensorFlow, Keras, PyTorch etc.).</li><li>Knowledge of image processing tools and algorithms; experience with medical imaging and/or interventional technologies is a plus</li><li>Proficiency in one of the following programming languages: Python, C++.</li><li>Ability to work within a team environment and should be self-motivated with the ability to plan and execute.</li><li>Proficiency in English, both written and verbal communication</li></ul></div><p></p><p><b>Why should you join Philips?</b></p><p>Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.</p><p></p><p>To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.</p><p></p><h3><b>Contact</b></h3><p><b>If you forgot your password, you can click the </b><b>Forgot Password </b><b>button on the Sign In screen to reset it.</b></p></div>"
    },
    {
        "position": "SAP iXp Intern - GCS Service Management",
        "company": "SAP",
        "location": {
            "city": "Newtown Square",
            "state": "PA"
        },
        "posted": "2021-06-01T20:36:05.114Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=125&ao=1091461&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_47d2e871&cb=1622665872975&jobListingId=4079179805",
        "lastScraped": "2021-06-02T20:36:05.114Z",
        "description": "<div><p><b>Requisition ID: </b>286126<br><b>Work Area: </b>Customer Service and Support<br><b>Expected Travel: </b>0 - 10%<br><b>Career Status: </b>Student<br><b>Employment Type: </b>Intern</p><p><b><br>COMPANY DESCRIPTION</b></p><p>SAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.<br>SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.</p><p></p><p><b><br>About the SAP Internship Experience Program</b></p><p><br>The SAP Internship Experience Program is SAP’s global, strategic, paid internship program that provides university students with opportunities to find purpose in their careers.</p><p><br>Three reasons to intern at SAP:</p><ul><li>Culture of collaboration: meet with mentors, make new friends across the globe and create a thriving personal network.</li><li>Project-driven experience: gain cross-functional skills from our virtual and in-person learning sessions, diverse subject matter experts, and project deliverables.</li><li>Gain visibility: with SAP Internship Experience Program in your title, you’ll have a global network of SAP leaders, entrepreneurs and career development opportunities at your fingertips.</li></ul><p></p><p><b><br>About the team</b></p><p><br>We are looking for a working student to support the daily tasks of the Global Cloud Services (GCS) Service Management Team. This international team, which consists of 20+ colleagues, is responsible to support the internal Lines of Business for all cloud infrastructure elements of our Service Portfolio from a business perspective. GCS Service Management is a global team that serves as the interface between Global Cloud Services and SAP’s Cloud Business and internal delivery units. Our team of Business Engagement Managers manage demand, engagement, finance, and service portfolio activities. Conducting regular meetings with the customer, we align LoB strategies with business roadmaps and GCS delivery units. We aim to satisfy our customers by exceeding their expectation in every interaction. The team is heavily involved in driving strategic internal projects to reduce infrastructure costs and optimize Cloud utilization rates.</p><p></p><p><b><br>What you’ll do</b></p><p></p><p><br>Position title: SAP iXp Intern - GCS Service Management<br>Location: Newtown Square, PA<br>Expected start date: June 2021</p><p><br>In this role, you’ll:</p><p></p><p><br>We would like to integrate motivated students into our team by focusing on their further development. This would be their opportunity to:</p><ul><li><br>Get to know the area SAP Cloud Demand and Supply Management process including Service Review &amp; Controlling aspects</li><li>Support Best Run / Top X program focusing on our Demand and Capacity Management Process and Tool improvements and driving change within our team as well as all of GCS</li><li>Learn about and support our Business Engagement Managers with LoB support topics and demand planning</li><li>Join an international team and become its integral part by taking on numerous responsibilities</li></ul><p></p><p><b><br>Who you are</b></p><p></p><p><br>We’re looking for someone who takes initiative, perseveres, and stay curious. You like to work on meaningful innovative projects and are energized by lifelong learning.</p><p></p><ul><li><br>Student (f/m/d) at a university or a university of applied sciences</li><li>Preferred fields of study: economics, business administration, computer sciences or others</li><li>Computer skills: Advanced skills in MS Office, particularly in MS Excel &amp; MS PowerPoint, Experience with SAP systems as a plus</li><li>Language skills: fluent in English, German as a plus</li><li>Soft skills: (Team player with excellent communication skills and the ability to work in a team as well as independently</li></ul><p></p><p><b><br>Follow @SAPiXp on Instagram and don’t miss anything about our experiences worldwide!</b></p><p></p><p><b><br>WHAT YOU GET FROM US</b><br>Success is what you make it. At SAP, we help you make it your own.<br>A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now.</p><p><b>SAP'S DIVERSITY COMMITMENT</b><br>To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.</p><p>SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team. (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. Successful candidates might be required to undergo a background verification with an external vendor.</p><p><b>EOE AA M/F/Vet/Disability:</b><br>Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.</p><p>Successful candidates might be required to undergo a background verification with an external vendor.</p></div>"
    },
    {
        "position": "Web Developer Intern, Summer 2021",
        "company": "Unifi",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        },
        "posted": "2021-06-01T20:36:17.980Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=126&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_085f1ffa&cb=1622665872975&jobListingId=4079150743",
        "lastScraped": "2021-06-02T20:36:17.980Z",
        "description": "<p><b>*This unpaid role is available for college credit only*</b></p><p><b>A Day in the Life..</b></p><p>Unifi is seeking an enthusiastic, creative and motivated intern for our digital team. The candidate must be comfortable with tight deadlines, be extremely detail oriented, highly organized and able to multi-task and thrive in an exciting, fast-paced environment.Projects include working with maintaining and uploading content to internal and external-facing corporate websites, and other projects as needed for various internal clients.</p><p><b>Responsibilities</b></p><ul><li>Work with the editorial team to update and manage content on multiple Unifi websites, both internally and externally.</li><li>Create and code multiple HTML email and web pages. Maintain existing web apps/tools, and create others as needed.</li><li>Conceptualize and design new platforms and databases using a variety of tools for Unifi’s growing operations.</li></ul><p><b>Eligibility</b></p><ul><li>Sophomore, Junior or Senior currently pursuing an undergraduate Bachelor’s degree in Computer Science, Information Systems or other related fields at a U.S-based college/university.</li><li>Mandatory knowledge of HTML and CSS</li><li>Demonstrated experience in HTML Web page or email creation</li><li>Strong familiarity with Content Management Systems (WordPress, etc.)</li><li>Basic knowledge of Adobe Photoshop, Illustrator and other-image editing software</li><li>All candidates must be available during the relevant semester and be able to work up to 10 hours per week (100% remote)</li></ul><p>Job Types: Part-time, Internship</p><p>Application Question(s):</p><ul><li>What is your expected graduation date? (month/year)</li></ul><p>Experience:</p><ul><li>JavaScript: 1 year (Required)</li><li>HTML/CSS: 1 year (Required)</li></ul><p>Work Location:</p><ul><li>Multiple locations</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul>"
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Intel",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2021-06-01T20:36:26.686Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=127&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_30dbb7a0&cb=1622665872975&jobListingId=4079157610",
        "lastScraped": "2021-06-02T20:36:26.686Z",
        "description": "<div><b>Job Description</b><p><br>Come intern with one of the largest engineering companies in the world.</p><p></p><p>Join us to develop new technology that will provide Intel a competitive advantage in programmable solutions. If you find it exciting to work in a diverse team that innovates with other Intel advanced technology groups, with other industry leaders and academia, then we have your opportunity.</p><p></p><p>The Intel Programmable Solutions Group (PSG) has been delivering industry-leading custom logic solutions to customers since inventing the world's first reprogrammable logic device in 1984. To expand the technology that provides us with advantages in programmable solutions, we are looking for a phenomenal intern to join our high-powered team.</p><p></p><p>As a member of INTEL’s PSG Tools and Methodology group, you will be responsible for the development of tools, methodologies, and processes to support Intel's next generation FPGA technology and products.</p><p></p><p>Candidates will participate in the implementation of Design Intellectual Property (IP) development flows working with RTL simulators, synthesis and timing analysis tools. Individuals will routinely be involved with troubleshooting design and verification issues of complex IP design flows and tools.</p><p></p><p><b>Behavioral Traits:</b></p><ul><li><p>Verbal and written communication skills.</p></li><li><p>Work under minimal supervision.</p></li><li><p>Independently identify, troubleshoot and solve problems.</p></li></ul><p></p><p><b>To start Summer 2021. Preferable 12-month full-time internship.</b></p><p></p><p><b><br>Qualifications</b></p><p><br>You must possess minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.</p><p></p><p>This position is <b>not</b> eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor’s degree with three years’ related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor’s degree and less than three years’ experience.</p><p></p><p><b>Minimum Requirements:</b><br>The candidate must be pursuing a Bachelor's degree in Computer Engineering, Engineering Science, Computer Science, Math, Electrical Engineering or related field.</p><p></p><p><b>Minimum of 3+ months experience in:</b></p><ul><li><p>Programing languages C/C++ and/or Python.</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>At least one course in digital logic.</p></li><li><p>Experience using FPGA.</p></li><li><p>Exposure to web based development tools.</p></li></ul><p></p><b>Inside this Business Group</b><p><br>The Programmable Solutions Group (PSG) was formed from the acquisition of Altera. As part of Intel, PSG will create market-leading programmable logic devices that deliver a wider range of capabilities than customers experience today. Combining Altera's industry-leading FPGA technology and customer support with Intel's world-class semiconductor manufacturing capabilities will enable customers to create the next generation of electronic systems with unmatched performance and power efficiency. PSG takes pride in creating an energetic and dynamic work environment that is driven by ingenuity and innovation. We believe the growth and success of our group is directly linked to the growth and satisfaction of our employees. That is why PSG is committed to a work environment that is flexible and collaborative, and allows our employees to reach their full potential.</p><p><b><br>Other Locations</b><br><br>Virtual US and Canada</p><p></p><p><b><br>Posting Statement</b><br><br>All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.</p><p></p><p>Annual Salary Range for jobs which could be performed in US, Colorado:<br>$52,000.00-$147,000.00 (Hourly Role)</p><b><br>Benefits:</b><br>We offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, and benefit programs. Find more information about our Amazing Benefits here</div>"
    },
    {
        "position": "Regulatory Affairs Intern",
        "company": "BeiGene",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-06-01T20:36:36.236Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=128&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_410e4148&cb=1622665872975&jobListingId=4026560512",
        "lastScraped": "2021-06-02T20:36:36.236Z",
        "description": "<div><p>BeiGene continues to grow at a rapid pace with challenging and exciting opportunities for experienced professionals. When considering candidates, we look for scientific and business professionals who are highly motivated, collaborative, and most importantly, share our passionate interest in fighting cancer.</p><p></p><p><b>General Description/Scope of Responsibilities (Internship):</b></p><p>BeiGene is a global biopharmaceutical company dedicated to the discovery and development of innovative drug therapies for the treatment of cancer. The Regulatory Affairs group is seeking a summer intern. The summer intern will work closely with the Heme Regulatory Affairs team.</p><p></p><p>The summer intern needs to be o rganized, detail oriented, and able to work in a dynamic environment. They should have good communication skills and a general interest in learning about various regional regulatory guidance.</p><p></p><p>The summer intern will be building basic knowledge of Regulatory Affairs while supporting the team’s daily activities and learn about best practice and strategies.</p><p></p><p><b>Essential Functions of the Internship:</b></p><ul><li>Collaborate with the Regulatory Affairs team members in providing support to US, CA and LATAM submissions to the local Health Authorities.</li><li>Support and attend Clinical Study Team meetings with the Regulatory lead.</li><li>Participate in cross-functional team meetings and support the drafting, review and approval of regulatory deliverables.</li><li>Support colleagues in handling major submissions as needed and tracking of documents’ status.</li><li>Support the archiving of official submissions and correspondence with different Health Authorities in the BeiGene document management system.</li><li>Participate in project teams, as determined by the supervisor.</li></ul><p></p><p><b>Education Required:</b></p><p>Currently obtaining an undergraduate degree in the life sciences or other related degree. Junior or above preferred.</p><p></p><p><b>Computer Skills </b><b>: </b>Proficient in Microsoft Office</p><p></p><p><b>Other Qualifications:</b></p><ul><li>Ability to communicate and write English clearly, concisely, and effectively</li></ul><ul><li>Well-organized, with an ability to prioritize tasks</li><li>Independently motivated, with good problem-solving ability</li><li>Excellent interpersonal skills; a team player</li></ul><p></p><p><b>Travel: </b>N/A</p><p></p><p><b>Competencies:</b></p><p><b>Ethics </b>- Treats people with respect; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values.</p><p></p><p><b>Planning/Organizing </b>- Prioritizes and plans work activities; Uses time efficiently. Completes administrative tasks correctly and on time. Follows instructions and responds to management direction.</p><p></p><p><b>Communication </b>- Listens and gets clarification; Responds well to questions; Speaks clearly and persuasively in positive or negative situations. Writes clearly and informatively. Able to read and interpret written information.</p><p></p><p><b>Teamwork </b>- Balances team and individual responsibilities; Gives and welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests; Supports everyone's efforts to succeed. Contributes to building a positive team spirit; Shares expertise with others.</p><p></p><p><b>Adaptability </b>– Able to adapt to changes in the work environment. Manages competing demands. Changes approach or method to best fit the situation. Able to deal with frequent change, delays, or unexpected events.</p><p></p><p><b>Technical Skills </b>- Assesses own strengths and development areas; Pursues training and opportunities for growth; Strives to continuously build knowledge and skills; Shares expertise with others.</p><p></p><p><b>Dependability </b>- Follows instructions, responds to management direction; Takes responsibility for own actions; Keeps commitments; Commits to long hours of work when necessary to reach goals; Completes tasks on time or notifies appropriate person with an alternate plan.</p><p></p><p><b>Quality </b>- Demonstrates accuracy and thoroughness; Looks for ways to improve and promote quality; Applies feedback to improve performance; Monitors own work to ensure quality.</p><p></p><p><b>Analytical </b>- Synthesizes complex or diverse information; Collects and researches data; Uses intuition and experience to complement data.</p><p></p><p><b>Problem Solving </b>- Identifies and resolves problems in a timely manner; Gathers and analyzes information skillfully.</p><p></p><p><b>Project Management </b>- Communicates changes and progress; Completes projects on time and budget.</p><p></p><p>We are proud to be an equal opportunity employer and we value diversity. BeiGene does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need.</p></div><p></p>"
    },
    {
        "position": "Summer Internship – Software Engineer Computer Programming Intern",
        "company": "Interco",
        "location": {
            "city": "Saint Louis",
            "state": "MO"
        },
        "posted": "2021-06-01T20:36:44.349Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=129&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_b784300e&cb=1622665872975&jobListingId=4102047423",
        "lastScraped": "2021-06-02T20:36:44.349Z",
        "description": "<div>Company Description<p><br>Interco is a global recycling company headquartered on the Illinois-side of St. Louis in Madison. The company has been an industry leader providing metals, computers and electronics recycling services with a focused track record of innovation and integrity in since 1996.</p><p>The 400,000+ sqft. Interco Metaltronics recycling facility is comprised of five buildings on more than 40 acres centrally located on the Illinois-side of St. Louis in the shadows of the Gateway Arch. The facility boasts a 145,000 sqft. processing plant dedicated to the processing of computers, electronics, and batteries with the remainder of the indoor facility used for the processing of nonferrous industrial metals.</p><p>The company specializes in the placement of smelter-ready materials catering to commercial, industrial, dealer, and government organizations nationwide. Interco ships nonferrous and electronics scrap worldwide utilizing established partnerships with end consumers in the United States, Europe, Latin America and Asia.</p><p>The Interco team — consisting of commercial, logistics, administrative, and operations departments — delivers innovative solutions, competitive pricing, and quality service throughout the supply chain.</p><p>https://www.intercotradingco.com</p></div><br><div>Job Description<p><br>The Software Engineer/Computer Programming Intern works as part of the IT department to code, develop, update, and manage the company’s proprietary programs and more than fifty websites. Together with the IT Administrator and the Webmaster, this person will help design and create software programs while integrating systems and software. The right candidate will help modify the source-code of existing proprietary Interco software and learn to write system instructions and assist with the training of on premises end-users.</p><p>The coding languages utilized at Interco include CSS, PHP, Python, HTML, Java, and JavaScript, among others. The Software Engineer/Computer Programming Intern should be familiar with Access and MySQL as well as Apache Spark, SSH, and XHTML. This intern will assist the IT team to help debug programs and maintain operating systems. The right candidate must have at least a basic understanding of Linux and general IT security.</p><p>This position requires an acute attention to detail and the ability to stay focused to troubleshoot existing code and communicate issues with others in the IT department including the IT Administrator and Webmaster. The right candidate will have an analytical mind and an understanding of technology infrastructures using CSS, Firewalls, IDS/IPS, Web-Proxy and Security Audits. Top candidates are expected to display attention to detail and problem-solving skills and the desire to work hard and contribute while learning in a fast-paced environment.</p><p>The Software Engineer/Computer Programming Intern should be able to work well in a team, collaborating with managers, designers, writers, etc. and be a detail-oriented person eager to learn. This person should demonstrate the ability to follow clear instructions and an interest in improving existing coding skills while learning new strategies and languages while gaining hands-on experience with computers, networking, and peripherals.</p><p><b>Day to Day Tasks Include:</b></p><ul><li>Help modify the source-code of existing proprietary Interco software.</li><li>Write code for software, software patches, and bug fixes.</li><li>Develop and write computer programs to perform specific tasks related to organizational goals.</li><li>Create workflow diagrams and charts to demonstrate the functionality of programs.</li><li>Work with team members to find creative, innovative solutions to problems.</li><li>Help the Interco team develop software system validation and testing methods.</li><li>Assist with the development of program documentation and assist with the training of on premises end-users.</li><li>Work with IT Admin and Webmaster to communicate project statuses and key project data to team members.</li><li>Analyze data to effectively coordinate the installation of new systems or the modification of existing systems.</li><li>Help IT team to monitor system performance.</li><li>Communicate with and build cohesion with fellow team members.</li><li>Assist with the development and execution of project plans.</li><li>Apply best practices and standard operating procedures.</li><li>Create innovative solutions to meet the Interco technical needs.</li><li>Test new software and run tests to spot and resolve bugs and inconsistencies.</li></ul></div><br><div>Qualifications<br><ul><li>Hands-on programming experience using relevant languages such as CSS, PHP, Python, HTML, Java, JavaScript, and more.</li><li>Experience using relevant tool suites.</li><li>Strong written and verbal communication and interpersonal skills.</li><li>Must have excellent creative problem-solving skills.</li><li>Strong attention to detail and ability to spot tiny errors or inconsistencies in code.</li><li>Familiar with Access and MySQL as well as Apache Spark, SSH, and XHTML.</li><li>Detail-oriented person with a passion to learn.</li><li>Up to date on the latest software innovations and committed to continually building on existing knowledge and skills.</li><li>Exemplify superior time management skills and capable of working productively with minimal supervision.</li><li>Be able to work well in a team, collaborating with managers and team members.</li><li>Ability to follow directions closely and accurately.</li><li>A desire to innovate and create cutting edge programs.</li><li>Basic Linux and IT security experience.</li><li>Desire to learn to troubleshoot website issues.</li><li>Strong attention to detail with an analytical mind and good problem-solving skills.</li><li>Terrific time management skills with the ability to multi-task.</li><li>Must be naturally driven to produce high quality results with great care</li><li>Current in Computer Science, IT, Systems Engineering or a related qualification preferred.</li><li>Recent graduates with degrees in Computer Sciences or related fields may be eligible as well.</li></ul><br>Additional Information<p><b><br>Other</b></p><ul><li>Pay rate: $12 / hour</li><li>Consistent work schedule 20-40 hours/week</li><li>Term of internship 2-3 months</li><li>This position does not offer healthcare benefits</li><li>This position is open to local students only</li></ul><p><b>Physical Demands and Abilities</b></p><ul><li>Occasionally required to stand, walk, stoop, kneel, crouch or crawl</li><li>Occasionally required to sit and climb or balance</li><li>Occasionally lift and/or move objects 10-50 lbs.</li></ul><p><b>As a matter of company policy, we do not sponsor employment visas or hire from out of the USA nor do we sponsor candidates who do not currently reside within the USA without an existing H-1B visa.</b></p><p>This job description is designed to provide a general overview of the requirements of the job and does not entail a comprehensive listing of all activities, duties or responsibilities that will be required. Interco Trading Company reserves the right to modify this job description at any time; including assigning or reassigning job duties or eliminating this position at any time.</p><p>Candidate information will be kept confidential according to EEO guidelines.</p><p>Work remotely: No</p></div>"
    },
    {
        "position": "Summer Internship – Jr. Webmaster IT Intern",
        "company": "Interco",
        "location": {
            "city": "Saint Louis",
            "state": "MO"
        },
        "posted": "2021-06-01T20:36:49.142Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=130&ao=1136006&s=58&guid=00000179ce6c452c9ed7e89efa7c5112&src=GD_JOB_AD&t=SR&vt=w&cs=1_5b144517&cb=1622665872976&jobListingId=4102047449",
        "lastScraped": "2021-06-02T20:36:49.142Z",
        "description": "<div>Company Description<p><br>Interco is a global recycling company headquartered on the Illinois-side of St. Louis in Madison. The company has been an industry leader providing metals, computers and electronics recycling services with a focused track record of innovation and integrity in since 1996.</p><p>The 400,000+ sqft. Interco Metaltronics recycling facility is comprised of five buildings on more than 40 acres centrally located on the Illinois-side of St. Louis in the shadows of the Gateway Arch. The facility boasts a 145,000 sqft. processing plant dedicated to the processing of computers, electronics, and batteries with the remainder of the indoor facility used for the processing of nonferrous industrial metals.</p><p>The company specializes in the placement of smelter-ready materials catering to commercial, industrial, dealer, and government organizations nationwide. Interco ships nonferrous and electronics scrap worldwide utilizing established partnerships with end consumers in the United States, Europe, Latin America and Asia.</p><p>The Interco team — consisting of commercial, logistics, administrative, and operations departments — delivers innovative solutions, competitive pricing, and quality service throughout the supply chain.</p><p>https://www.intercotradingco.com</p></div><br><div>Job Description<p><br>The Jr. Webmaster IT Intern works as part of the IT department to manage the company’s 50+ websites. This position will assist with the functionality of the websites, evaluating and managing website performance, facilitating hosting and server management, and working with the Marketing Department to update website content.</p><p>The right candidate will have an analytical mind and an understanding of WordPress, current website best practices, Search Engine Optimization (SEO), and the latest associated analytics and strategies. The Jr. Webmaster IT Intern should display a basic understanding of Content Management Systems (CMS) and technology infrastructures using CSS, Firewalls, IDS/IPS, Web-Proxy and Security Audits. Top candidates are expected to display attention to detail and problem-solving skills and the desire to work hard and contribute while learning in a fast-paced environment.</p><p>The Jr. Webmaster IT Intern should be able to work well in a team, collaborating with managers, designers, writers, etc. Ideal candidates should have some technical skills and a good understanding of creative online marketing.</p><p>This position requires a detail-oriented person eager to learn with the ability to follow clear instructions and an interest in computers, networking, and peripherals.</p><p><b> Day to Day Tasks Include:</b></p><ul><li>Building and maintaining functional and easy-to-use WordPress websites</li><li>Responding to and troubleshooting website issues.</li><li>Testing websites across browsers, operating systems and devices</li><li>Maintaining, configuring and troubleshooting in-house webservers</li><li>Ensuring that the website is protected by enabling the appropriate security measures.</li><li>Working with IT Administrator to ensure site security by setting up firewalls and login pages</li><li>Identifying and responding to website security breaches.</li><li>Optimizing loading speeds and capacity</li><li>Debugging pages and fixing broken links or images</li><li>Working with Marketing Department to update website content, review SEO, monitor and analyze site performance (e.g. traffic, conversions)</li><li>Updating HTML, CSS and JavaScript.</li><li>Conducting content audits to eliminate redundant and/</li></ul></div><br><div>Qualifications<br><ul><li>Moderate knowledge of WordPress, HTML, XHTML, and CSS.</li><li>Desire to work with WordPress builders (Site Origin, Elementor, etc.), plugins, themes. and the WordPress code library.</li><li>Basic Linux and IT security experience.</li><li>Some experience with Access and MySQL is preferred.</li><li>Ability to program in CSS, PHP, HTML, Java/JavaScript is preferred.</li><li>Familiarity with programming languages and operating systems.</li><li>Desire to learn to use website management tools.</li><li>Knowledge of online marketing and fundamental understanding of Search Engine Optimization (SEO)</li><li>Eagerness to troubleshoot website issues.</li><li>Strong attention to detail with an analytical mind and good problem-solving skills.</li><li>Terrific time management skills with the ability to multi-task.</li><li>Excellent communication and problem-solving skills.</li><li>Must be naturally driven to produce high quality results with great care</li><li>Proficiency with Microsoft Office (Word/Excel/Outlook/PowerPoint) is required.</li><li>Current college student studying Computer Science, Management Information Systems, Information Technology, Computer Networking, Information Sciences, Computer Programming, or related field.</li><li>Recent graduates with degrees in Computer Sciences or related fields may be eligible as well.</li></ul><br>Additional Information<p><b><br>Other</b></p><ul><li>Pay rate: $12 / hour</li><li>Consistent work schedule 20-40 hours/week</li><li>Term of internship 2-3 months</li><li>This position does not offer healthcare benefits</li><li>This position is open to local students only</li></ul><p><b>Physical Demands and Abilities</b></p><ul><li>Occasionally required to stand, walk, stoop, kneel, crouch or crawl</li><li>Occasionally required to sit and climb or balance</li><li>Occasionally lift and/or move objects 10-50 lbs.</li></ul><p><b>As a matter of company policy, we do not sponsor employment visas or hire from out of the USA nor do we sponsor candidates who do not currently reside within the USA without an existing H-1B visa.</b></p><p>This job description is designed to provide a general overview of the requirements of the job and does not entail a comprehensive listing of all activities, duties or responsibilities that will be required. Interco Trading Company reserves the right to modify this job description at any time; including assigning or reassigning job duties or eliminating this position at any time.</p><p>Candidate information will be kept confidential according to EEO guidelines.</p><p>Work remotely: No</p></div>"
    }
]