[
    {
        "position": "Summer 2021 Computer Science Intern",
        "company": "MISO",
        "location": {
            "city": "Eagan",
            "state": "MN"
        },
        "posted": "2020-12-16T21:29:28.869Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=101&ao=137257&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_7bdcf574&cb=1608154130232&jobListingId=3773356938",
        "lastScraped": "2020-12-16T21:29:28.869Z",
        "description": "<div>Sorry no VISA sponsorship opportunities....including OPT/CPT.\n<br><br>\nLocations: Carmel, Indiana or Eagan, Minnesota\n<br><br>\nAre you looking for a“high-powered” internship for the Summer of 2021? Are you ready to make a difference and bring your great ideas to help MISO keep the lights on? If so, read on…\n<br><br>\nWe need a diversified group of smart, motivated problem solvers to overcome challenges that face the Energy industry as it rapidly changes. As a MISO Intern, you will address business opportunities and make an impact!\n<br><br>\nAs our MISO Intern, you will…\n<ul>\n<li>Participate on projects that build on and broaden your technical skills and will prepare you for future roles as leaders and change agents.</li> <li>Be given the opportunity to present your project results, and make recommendations to your department, team members, and company leadership.</li> <li>Have a manager and mentor with the team you join, as well as a“buddy” from a different department for additional MISO connections.</li>\n</ul>\nIn light of the current conditions, MISO is committed to the health and safety of our employees. As we plan for our 2021 Summer Internship Program you can expect to…\n<ul>\n<li>Work an average of 30– 40 hours per week</li><li>Have a virtual, in office, or hybrid experience</li> <li>Start the middle/end of May and end mid-August</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Coming into this role you would have completed your junior year of college</li><li>Demonstration of MISO Core Values: Integrity, Commitment, Collaboration, Creativity, and Adaptability</li><li>Strong problem solver who is able to break down information; help determine best practices</li><li>Process mind-set</li> \n</ul>\n<strong>We are looking for students with the following majors/areas of interest:</strong>\n<ul>\n<li>Computer Science</li><li>Software Programming (Python)</li><li>Cloud (AWS or Azure)</li><li>Data Science courses a plus</li><li>Github version control</li>\n</ul>\nMISO manages the electricity superhighway in the Central U.S. Through use of groundbreaking research and advanced technology, our highly skilled employees ensure power flows reliably to 42 million customers. Operating the electricity grid, running a robust energy market, planning for a bright future– it’s what our immensely talented and dedicated team does every day.\n<br><br>\nTo learn more about MISO’s Internship Program, check out the following links:\n<br><br>\nMISO in 90 Seconds\n<br><br>\nMISO's Intern Experience\n<br><br>\nMISO Energy</div>"
    },
    {
        "position": "Software Developer Intern -- Summer",
        "company": "Five Rings Capital",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-16T21:29:32.205Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=102&ao=4120&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_9b3e67a6&cb=1608154130233&jobListingId=3549628085",
        "lastScraped": "2020-12-16T21:29:32.205Z",
        "description": "<h3>Description</h3>\n <p>\n Interns will be mentored by experienced Software Developers and immersed in significant enhancements to our production trading system. They will also gain valuable technology knowledge with classroom training. Proficiency with C or C++ and Linux is preferred. Python is a plus.\n </p>\n <p></p>"
    },
    {
        "position": "Software Developer, Intern",
        "company": "ManTech",
        "location": {
            "city": "Herndon",
            "state": "VA"
        },
        "posted": "2020-12-16T21:29:35.379Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=103&ao=37049&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_5853ebbf&cb=1608154130233&jobListingId=3657604851",
        "lastScraped": "2020-12-16T21:29:35.379Z",
        "description": "<strong>Secure our Nation, Ignite your Future</strong>\n<br><br>\nBecome an integral part of a diverse team while working at an Industry Leading Organization, where our employees come first. At ManTech International Corporation, youll help protect our national security while working on innovative projects that offer opportunities for advancement.\n<br><br>\nCurrently, ManTech is seeking a motivated, career and customer-oriented Software Developer Intern to join our team in Herndon, Virginia.\n<br><br>\n<strong>Responsibilities include, but are not limited to</strong>:<br>\n<div><div><div><div>Demonstrate your skills that you learned in and out of school with the Cyber Advanced Research and Development (CARD) group within ManTech. ManTech is seeking a motivated, mission-oriented Intern to join our CARD group to be exposed to exciting hands on technical work to grow your skills and obtain a better understanding of the Cyber Security Field. At ManTech, you will work on innovative projects that offer great technical challenges. Interns work on guided projects over the summer that can directly flow back to real contracts. At the end of the summer, all of our interns brief their projects success across ManTech.</div></div></div></div>\n<br><strong>Basic Qualifications:</strong>\n<ul>\n<li>Write software in C, Python, and/or assembly language</li><li>Work and collaborate within an agile team as well as with the other interns</li><li>Reverse engineer system components as necessary</li><li>Understand the security of systems</li><li>Research tools, techniques, countermeasures, and trends in computer network vulnerabilities, data hiding, and network security and encryption</li>\n</ul>\n<strong>Preferred Qualifications</strong>:\n<ul>\n<li>A passion for low-level / embedded software development and engineering</li> <li>Strong grasp of operating system fundamentals, including interrupts, threading, virtual memory, device drivers and memory management techniques</li><li>Knowledge and understanding of operating system internals and the integration of code with the operating system kernel</li><li>Experience with reverse engineering</li>\n</ul>\n<strong> Clearance Requirements:</strong>\n<ul>\n<li>Individuals must be a U.S. Citizen and either hold an active US Security Clearance or must be eligible to obtain a US Security Clearance.</li> <li>Applicants with the appropriate skills but without a security clearance are still encouraged to apply. If youre the right fit for the job, well make it happen.</li> \n</ul>\n<strong>Physical Requirements:</strong>\n<ul>\n<li>Must be able to remain in a stationary position 50%</li>\n</ul>\nManTech International Corporation, as well as its subsidiaries proactively fulfills its role as an equal opportunity employer. We do not discriminate against any employee or applicant for employment because of race, color, sex, religion, age, sexual orientation, gender identity and expression, national origin, marital status, physical or mental disability, status as a Disabled Veteran, Recently Separated Veteran, Active Duty Wartime or Campaign Badge Veteran, Armed Forces Services Medal, or any other characteristic protected by law.\n<br><br>\nIf you require a reasonable accommodation to apply for a position with ManTech through its online applicant system, please contact ManTech's Corporate EEO Department at (703) 218-6000. ManTech is an affirmative action/equal opportunity employer - minorities, females, disabled and protected veterans are urged to apply. ManTech's utilization of any external recruitment or job placement agency is predicated upon its full compliance with our equal opportunity/affirmative action policies. ManTech does not accept resumes from unsolicited recruiting firms. We pay no fees for unsolicited services.\n<br><br>\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access http://www.mantech.com/careers/Pages/careers.aspx as a result of your disability. To request an accommodation please click careers@mantech.com and provide your name and contact information."
    },
    {
        "position": "Midland Loan Services Summer Intern Program",
        "company": "PNC Financial Services Group",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "posted": "2020-12-16T21:29:38.798Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=104&ao=1044074&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_cb4fb969&cb=1608154130235&jobListingId=3772431153",
        "lastScraped": "2020-12-16T21:29:38.798Z",
        "description": "Job Profile\n<br><br>\nPosition Overview\n<br><br>\nAt PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. As a Midland Loan Services Intern within PNC's Corporate and Institutional Banking organization, you will be based in Overland Park, Kansas.\n<br><br>\nJob Description\n<br><br>\nAs a PNC Intern, you will participate in a best in class internship program. During this 10 week program, you will have the opportunity to gain exposure to a specific line of business, expand the tools you need to launch your career and complement your education with real-world experience.\n<br>Midland Loan Services falls under PNC’s Corporate &amp; Institutional Banking (C&amp;IB) Division. PNC is one of the largest U.S. banks with $409 billion in assets and $286 billion in deposits. PNC has approximately 52,000 employees across the United States and abroad; approximately 2,300 branches; and approximately 9,100 ATM’s as of September 30, 2019. PNC Real Estate has a national presence with approximately 1,000 employees located in 40 cities. Midland is the largest third party loan servicer, and the largest special servicer in the commercial real estate finance industry.\n<br>The Midland Loan Services Summer Internship Program enables inters to explore various aspects of the company including Asset Management, Loan Servicing, Business Development, Account Management, Underwriting, Due Diligence and or Collateral Surveillance.\n<br>Interns will work directly with management across the company to support daily operations. You may interact with lenders, borrowers and/or operators of commercial real estate assets across the country. Successful candidates will gain exposure to complex financing structures, and by the end of the internship, have an appreciation for the importance of loan servicing, asset management and customer service in commercial real estate finance.\n<br>The Summer Internship Program is a direct pipeline for talent to Midland Loan Services, providing interns with an unparalleled opportunity to learn the business while gaining visibility among the firm’s senior leadership.\n<br>Upon successful completion of the Summer Internship, interns may be offered an opportunity to join Midland Loan Services after graduation. Opportunities are available in Overland Park, KS.\n<br>Learn more about PNC’s Internships by visiting www.pnc.jobs/students .\n<br><br>\n<b>Job Profile :</b><br>\nParticipates as an intern in the PNC summer internship program.\n<br>Performs or assist the core activities of the group by applying knowledge learned to drive business results (e.g., deal, sales, process support, internal or external customer interaction, or supporting internal projects). Works under supervision and may have limited approval and/or exception authority.\n<br>Participates in social learning within the organization (e.g., identifies and networks with business representatives and peers, participates in mentoring, job shadowing and community outreach).\n<br><br>\n<b>Required Education and Experience :</b> Working toward a Bachelor's Degree, preferably business relevant majors (e.g., Finance, Accounting, IT, Economics, Marketing, Mathematics, Statistics, HR, Management, Communications, Business Law, Psychology, Logistics, Engineering, Computer Science, Actuarial Sciences), sophomore or junior status, Minimum GPA 3.2.\n<br><br>\nPNC provides equal opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.\n<br><br>\nCompetencies\n<br><br>\nAccuracy and Attention to Detail – Understanding of the necessity and value of accuracy and attention to detail; ability to process information with high levels of accuracy.\n<br><br>\nAnalytical Thinking – Knowledge of techniques and tools that promote effective analysis and the ability to determine the root cause of organizational problems and create alternative solutions that resolve the problems in the best interest of the business.\n<br><br>\nEffective Communications – Understanding of effective communication concepts, tools and techniques; ability to effectively transmit, receive, and accurately interpret ideas, information, and needs through the application of appropriate communication behaviors.\n<br><br>\nFlexibility and Adaptability – Knowledge of successful approaches, tools, and techniques for dealing with changes and adapting to a changing environment; ability to adapt as needed.\n<br><br>\nInformation Capture – Knowledge of the processes and the ability to identify, capture and document relevant business information in an auditable, organized, understandable and easily retrievable manner.\n<br><br>\nInitiative – Understanding of the value of self-motivation and initiative; ability and willingness to seek out work and the drive to accomplish goals.\n<br><br>\nProducts and Services – Knowledge of major products and services and product and service groups; ability to apply this knowledge appropriately to diverse situations.\n<br><br>\nSelf-Directed Growth and Development – Understanding of the necessity of continuous personal growth; ability to gauge one's strengths, limitations and interests, and use of this knowledge for purposes of performance effectiveness and self-development.\n<br><br>\nWork Experience\n<br><br>\nRoles at this level are filled by recent university / college graduates with little or no professional experience, but possessing relevant skills. Includes individuals joining the organization through a Corporate development/ training program. In lieu of a degree, a comparable combination of education and experience (including military service) may be considered.\n<br><br>\nEducation\n<br><br>\nNo Degree\n<br><br>\n<b>Disability Accommodations Statement:</b><br>\nThe PNC workplace is inclusive and supportive of individual needs. If you have a physical or other impairment that might require an accommodation, including technical assistance with the PNC Careers website or submission process, please call 877-968-7762 and select Option 4: Recruiting or contact us via email at pathfinder@pnc.com.\n<br><br>\nThe Human Resources Service Center hours of operation are Monday - Friday 9:00 AM to 5:00 PM ET.\n<br><br>\n<b>Equal Employment Opportunity (EEO):</b><br>\nPNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.\n<br><br>\nCalifornia Residents\n<br><br>\nRefer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "position": "Software Developer Intern - Summer",
        "company": "CACI International",
        "location": {
            "city": "Sterling",
            "state": "VA"
        },
        "posted": "2020-12-16T21:30:24.527Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=106&ao=128418&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_55451380&cb=1608154130236&jobListingId=3771976792",
        "lastScraped": "2020-12-16T21:30:24.527Z",
        "description": "<strong><br><br><strong>Job Description</strong>\n<br><br>\nWhat Youll Get to Do:</strong>\n<br>\nCACI is seeking Engineering Interns; students currently working towards their degree in the following areas of study: Electrical Engineer, Systems Engineer, Software Engineer, Aerospace Engineer, Computer Engineer, Computer Science. The internship will last 10-12 weeks during Summer 2021.\n<br><br>\nMore About the Role:\n<ul>\n<li>This position is for individuals interested in a broad area of electrical and software engineering.</li><li>The ideal candidate should have strong academic credentials and experience in working in a teamwork environment, having not only academic, but also interpersonal skills to help optimize our teams.</li><li>The single most important attribute is an inquisitive nature and a strong desire to learn real world applications to compliment your academic experience.</li><li>Familiarity with hardware or software tools should be at a level that is appropriate for your academic level.</li><li>The Sarasota team also provides the following unique opportunities for development:</li><li>Linux Training</li><li>Object Oriented Design Training</li><li>Public Speaking Training</li><li>Other Workshops</li>\n</ul>\nYoull Bring These Qualifications:\n<ul>\n<li>Co-Op/Interns at this level typically represent college students trying to gain related work experience while pursuing an undergraduate or graduate degree, ideally in one or more of the following disciplines: Electrical Engineer, Systems Engineer, Software Engineer, Aerospace Engineer, Computer Engineer, Computer Science.</li><li>Candidates must be currently enrolled in a bachelors degree program or higher.</li><li>Ability to meet normal demands associated with an office environment.</li> <li>Ability to work on computer for long periods, and communicate with individuals by telephone, email and face to face.</li> <li>Some travel may be required.</li>\n</ul>\nThese Qualifications Would be Nice to Have:\n<br><br>\n• Software development experience\n<br>\n• RF and Digital hardware experience\n<br>\n• Analog circuit design experience\n<br>\n• Computer architecture experience\n<br>\n• Signal processing experience\n<br>\n• Hardware/software test development experience\n<ul>\n<li>If Undergraduate or Graduate, pursing a degree in Engineering or related field is preferred, not required</li><li>Minimum GPA of 3.0 or higher is preferred, not required</li><li>Previous internship/co-op or other work experience, leadership and teamwork capabilities,interpersonal communication skills, and activities (professional/community/extracurricular)</li>\n</ul>\nWhat We Can Offer You:\n\n\n<ul>\n<li>Weve been named a Best Place to Work by the Washington Post.</li>\n<li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li>\n<li>We offer competitive benefits and learning and development opportunities.</li>\n<li>We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.</li>\n<li>For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success.\n<br><br>\nINRN2\n<br><br>\n<strong>Job Location</strong>\n<br><br>\nUS-Sterling-VA-VIRGINIA SUBURBAN\n<br><br>\nCACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities.</li>\n\n</ul>"
    },
    {
        "position": "Data Science Intern",
        "company": "eBay",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "posted": "2020-12-16T21:30:28.081Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=107&ao=133559&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_dd6d634f&cb=1608154130238&jobListingId=3656761073",
        "lastScraped": "2020-12-16T21:30:28.081Z",
        "description": "<div><u><strong>12-week Summer Internship</strong></u></div><div><div><div><div>Looking for a global commerce leader where you can shape how the world buys, sells, and gives? If you said yes, eBay wants to talk to you. Where you can just be yourself, do your best work, and have a significant impact for people across the globe.<br><br><h2>About the team:</h2><br><br>Like to shake things up? We do! eBay hires innovators who can push boundaries and change the world. Put on your entrepreneurial hat, roll up your sleeves and dive head first into eBays extensive pools of data. Come with an analytical mindset and a real passion for delivering on business goals. Help eBay take data to the next level.\n<br><br>\nWe are looking for a motivated machine learning and data science engineering intern to build robust and scalable software and draw insights from massive data sets. We want the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward. Youll work alongside the best and the brightest engineering talent in the industry.\n<br><br>\nNote: By applying to this position, your application will be considered for locations: San Jose, CA, New York, Bellevue, WA, and Austin, TX<br><br><h2><strong>You are:</strong></h2>\n\n<ul>\n<li>Insightful. Be able to draw conclusions from large Datasets, and help drive business decisions with data-driven thinking</li><li>Inventive. Have the ability to do a lot with a little. Aggregate information from various places and establish relationships with key partners to get the data you need.</li><li>Tech Savvy. Master your tools, and continue to expand your systems knowledge through formal or informal research and training.</li>\n</ul>\n\n<strong><h2>We need:</h2>\n<br>\n</strong>\n\n<ul>\n<li>An excel connoisseur. Know excel backwards and forwards, able to use advanced techniques to collect, display and interpret data.</li><li>SQL expertise. Proficiency in SQL is required. R, Python, Java, and/or C++ are a bonus</li><li>NoSQL Tools. Have familiarity with at least one NoSQL tool; Hadoop, Hive, Spark, Pig, H2O, etc.</li>\n</ul>\n\n<strong><h2>Basic Qualifications:</h2>\n<br>\n</strong>\n\n<ul>\n<li>Currently enrolled as a student, 0-3years of relevant work experience in an accredited Masters, or PhD program within the United States graduating after December 2021</li><li>Enrolled in or pursuing an Masters or PhD Degree in Data Science, Computer Science, Statistics or related major</li><li>Creative thinker who knows how to build real-world products</li><li>Curate, Acquire &amp; Maintain Datasets</li><li>Build and handle data in traditional and non-traditional ways.</li><li>Share engineering support, release &amp; on call.</li><li>Estimate, plan &amp; rollout changes</li><li>Key skills: SQL, Java, Python, NoSQL tool ie: Hadoop, Pig, Spark, H2O etc.</li></ul></div>\n</div></div></div>\n<br>Disclaimer: Please note that by applying to this role, you are agreeing to be considered for multiple positions. This is a general description of the qualifications and skills required for positions of this type of role.\n<br><br>\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\n<br><br>\nView our privacy policy\n<br><br>\nView our <u>accessibility info</u>\n<br><br>\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\n<br><br>\nFor more information see:\n<br><br>\nEEO is the Law Poster\n<br><br>\nEEO is the Law Poster Supplement"
    },
    {
        "position": "CSU Cloud Engineer Intern",
        "company": "Unisys",
        "location": {
            "city": "Irvine",
            "state": "CA"
        },
        "posted": "2020-12-16T21:30:31.106Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=108&ao=1136006&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_ed10f9ff&cb=1608154130239&jobListingId=3746693648",
        "lastScraped": "2020-12-16T21:30:31.106Z",
        "description": "<div><b>Job Description</b><br>\n<p><b>\nWe Believe in Better!\n</b></p><p>We are a global information technology company that builds high-performance, security-centric solutions that can help change the world. Enhancing people’s lives through secure, reliable advanced technology is our vision.</p><p>\nAt Unisys, we believe in better! Here, you have the opportunity to learn new skills, apply your expertise, and solve complex problems with cutting edge technologies and solutions. You are part of a global diverse team that supports you, drives change, and delivers successful results consistently.</p><p></p><p>\nOur associates are at the forefront of everything we do, driving our clients’ successes while giving back to communities and making this world a safer and more secure place to live and work. Our success is a direct result of the work of our people who live and breathe our Core Beliefs. Simply put, we believe in better lives. Join us!</p><p></p><p><b>\nLearn more about Unisys and our key solution offerings:</b> Unisys, Stealth™, CloudForte®, InteliServe™</p><p></p><p><b>\nWhat success looks like in this role:\n</b></p><p></p><ul><li>CloudForte® is a Unisys umbrella Cloud Services offering to help customers design, migrate, operate and optimize their digital transformation using cloud. You will be part of the Cloud Engineering team at Unisys and responsible for designing and building highly scalable and secure Cloud solutions using latest, cutting-edge tools and technologies.</li><li>\nWork on cutting-edge DevOps/CloudOps technologies in a fast-paced agile environment</li><li>\nTranslate requirements into prioritized list of user stories and deliver per timelines</li><li>\nWork with product line leaders and architects to develop software development plans</li><li>\nDrive excellent quality in the development and support of Unisys cloud solutions</li><li>\nEstablish foundation for future implementations and automation requirements for cloud</li></ul><p></p><p><b>\nYou will be successful in this role if you have:</b></p><ul><li>\nWorking on a Bachelor's Degree or Master’s Degree in Computer Science or “STEM” Majors</li><li>\nHigh Want - Knowledge of AWS, Azure and/or Google public clouds</li><li>\nKnowledge of one or more programming languages – incl Java, Python</li></ul><b>\neeo</b><br>\n<br>\nNotice For U.S. Applicants: Unisys is an Equal Opportunity Employer – Minorities/Females/ Veterans/Individuals with Disabilities/ Sexual Orientation/Gender Identity</div>"
    },
    {
        "position": "Intern - Marketing",
        "company": "iSolved HCM",
        "location": {
            "city": "Salt Lake City",
            "state": "UT"
        },
        "posted": "2020-12-16T21:30:34.311Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=109&ao=1033627&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_059b585f&cb=1608154130240&jobListingId=3716941952",
        "lastScraped": "2020-12-16T21:30:34.311Z",
        "description": "<strong>Marketing Intern</strong>\n<br><br>\nAt isolved, we're on a mission to help our customers transform employee experience for a better today and a better tomorrow, and we want to tell the world about it. We know that human resources is always evolving, quite simply because it's a people business, and so our HCM platform, isolved People Cloud is not just built with people in mind but is ready for the future of work. As we continue to grow market share, we are now seeking outstanding new talent to develop within the following position:\n<br><br>\n<strong>Marketing Intern</strong>\n<br><br>\nAre you analytical, creative, web and social media savvy all at once, and looking to learn and develop marketing and related business skills in a fast-paced environment then read on!\n<br><br>\nAs a marketing intern you'll understudy and work alongside multiple members of our marketing team in order to develop a well-rounded view of the modern marketing mix across digital, traditional and channel marketing activities.\n<br><br>\nPrincipal Responsibilities\n<ul>\n<li>Help to design and manage the execution of integrated lead generation programs.\n\n<ul>\n<li>Develop program activities across website, email, events and paid advertising</li><li>Manage local campaign activities, create landing pages and manage website content</li><li>Collaborate with digital team to perform tests and optimize conversions</li><li>Help nurture active and passive leads with the goal of increasing interest in engaging</li><li>Assist in the development of social media content, such as info-graphics and blog posts, and then actively promote them on local social media, partner networks and other content sharing sites with the goal of generating leads</li></ul></li>\n<li>Support the heads of each marketing team in planning and lead management</li><li>Update and maintain data quality and customer records in CRM and MA tools, and work with Inside Sales and Business Development on lead qualification</li>\n</ul>\nEssential Requirements\n<ul>\n<li>No prior business experience is necessary but desirable.</li><li>Experience of social media such as LinkedIn and Facebook.</li><li>Strong analytical skills.</li><li>Agility to understand the relationship between marketing results and business outcomes.</li><li>Comprehensive knowledge of Microsoft 365, in particular Excel.</li></ul>\n\n<ul>\n<li>Experience of or prior exposure to marketing software (e.g. HubSpot, Outreach, Drift), analytics (e.g Google), and CMS (e.g. WordPress, Drupal).</li><li>Strong interpersonal, written and oral communication skills.</li><li>Ambitious yet flexible self-starter who can work in a rapidly changing environment.</li><li>Bachelor's Degree in Marketing, Computer Science, Information Technology or similar field or related business experience (completed or on-going).</li><li>A desire to work hard, make a difference, and have fun doing it.</li>\n</ul>\nLocation:Salt Lake City, Utah"
    },
    {
        "position": "Student Intern",
        "company": "Pace University",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-16T21:30:37.200Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=110&ao=1136006&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_3cfcacc7&cb=1608154130240&jobListingId=3746645860",
        "lastScraped": "2020-12-16T21:30:37.200Z",
        "description": "<p></p><div><div><div><div><div><div><div><div><p>This is a remote RA position working with Dr. Joshua Mendelsohn on active research studies pertaining to self-management of chronic illness, and HIV treatment and prevention.</p><br>\n</div><br>\n<div><div><b>Position Duties</b></div>\n<p>Students will assist faculty with conducting systematic reviews of the literature, writing summaries, assisting with survey data entry and testing, and other tasks as requested.</p><br>\n</div><br>\n<div><div><b>Position Qualifications</b></div>\n<p>Some undergraduate education with a health science focus</p><br>\n</div><br>\n<div><div><b>Work Hours</b></div>\n<p>$15/hr for 90 hours</p>\n</div><br>\n</div></div></div><div><div><div><div><div><b>Posting Number</b></div> <div>Stu01006P</div>\n</div><br>\n<div><div><b>Job Open Date</b></div> <div>11/17/2020</div>\n</div><br>\n<div><div><b>Job Close Date</b></div> <div>11/27/2021</div>\n</div><br>\n<div><div><b>Open Until Filled</b></div> <div>No</div>\n</div><br>\n<div><div><b>Special Instructions to Applicant</b></div>\n</div><br>\n<div></div><div><div><b>About the Institution</b></div>\n<p>For more than 100 years, <b>Pace University</b> has been preparing students to become leaders in their fields by providing an education that combines exceptional academics with professional experience and the New York advantage. Pace has campuses in New York City and Westchester County. A private metropolitan university, Pace enrolls nearly 13,000 students in bachelor’s, master’s, and doctoral programs in the College of Health Professions, Dyson College of Arts and Sciences, Lubin School of Business, School of Education, School of Law, and Seidenberg School of Computer Science and Information Systems.</p><br>\n</div><br>\n<div><div><b>AA/EEO Statement</b></div>\n<p>Pace University is an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.</p><br>\n</div><br>\n<div><div><b>Annual Security Report Notice</b></div>\n<p>Pace is committed to ensuring the safety and security of the students, faculty, staff and visitors to the University. In compliance with the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, the University’s Safety and Security department publishes an Annual Security and Fire Safety Report, which can be accessed here. The report contains information on security policies as well as crime and fire statistics for the University.</p></div></div></div></div></div></div></div></div><p></p>"
    },
    {
        "position": "Software Engineer, Intern",
        "company": "KLA-Tencor",
        "location": {
            "city": "Ann Arbor",
            "state": "MI"
        },
        "posted": "2020-12-16T21:30:40.127Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=111&ao=1136006&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_1f907803&cb=1608154130240&jobListingId=3746578861",
        "lastScraped": "2020-12-16T21:30:40.127Z",
        "description": "<div><p><b>Company Overview\n</b></p>KLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and in 2019 we invested 15% of sales back into R&amp;D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us.\n<p></p><p><b>Group/Division\n</b></p>The vision of KLA’s global human resources organization is to become a leader and partner to operating leadership in support of the company’s efforts to achieve its strategic growth, customer and operating objectives through strategic talent management. Our mission is to enable the business, and leverage human resources to achieve short and long-term business objectives. Our primary areas of strategic focus include talent acquisition, individual and organizational assessment and development, performance management, inclusion and engagement, and rewards. The global HR organization includes HR business partners, learning and development, talent acquisition, compensation and benefits, employee communications, and HR system operations.\n<p></p><p>Highly motivated self-driven individual to be part of a software engineering team to design, develop, test and qualify equipment control software. Perform software testing, software build and release activities.\n</p><p>Collaborate with a team of software and electrical engineers to provide software solutions for high priority projects.\n</p><p>.\n</p><p></p>Adaptability, Collaborates, Communication, Customer Focus, Decision Quality, Drives Results, Innovation, KLA Values, Problem Solving, Work Processes\n<p></p><p><b>Minimum Qualifications\n</b></p><p><b>Basic:\n</b></p><ul><li>Planned college graduation by June 2022, with primary coursework in computer science, data science, engineering (computer, electrical, systems).\n</li><li>Proficient coding in C++/C#/JAVA\n</li><li>Good understanding of Windows/Unix/Linux OS\n</li><li>Good knowledge on JavaScript\n</li><li>Good software design/implementation/debugging capabilities\n</li><li>Good understanding of data structures, and algorithms\n</li><li>Effective communication and team interaction skills\n</li><li>Creative problem-solver who is motivated to learn independently\n</li></ul><p><b>Desired </b>:\n</p><ul><li>Knowledge on source control tools such as RTC, ClearCase, Git\n</li><li>Good knowledge on Angular/NodeJS\n</li><li>Experience working in DevOps environment\n</li><li>Knowledge on Virtual Machine\n</li><li>Understanding of image processing algorithm\n</li><li>Experience working with RTOS (VxWorks), Solaris\n</li><li>Creating modifying build scripts for large applications\n</li><li>Understanding of SEMI Equipment control software architecture\n</li></ul><p></p><p>We offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees.\n</p><p></p><p>KLA is proud to be an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, national origin, sex, gender identity, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other status protected by applicable law. We will ensure that qualified individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at talent.acquisition@kla.com to request accommodation.</p></div><p></p>"
    },
    {
        "position": "Web Systems Development Intern",
        "company": "University of Utah",
        "location": {
            "city": "Salt Lake City",
            "state": "UT"
        },
        "posted": "2020-12-16T21:30:43.119Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=112&ao=1136006&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_e43e49aa&cb=1608154130241&jobListingId=3746556412",
        "lastScraped": "2020-12-16T21:30:43.119Z",
        "description": "<div><p>Content Management &amp; Usability, a division of University IT, is seeking a University of Utah student to provide web systems related support and application programming for college, departmental, and program websites. The successful candidate will undergo training, but will be expected to have good working knowledge of web technologies and content management systems.</p>\n<p>\nStudents who are interested in building and supporting high quality, user-centered University websites and systems – specifically those majoring in Computer Science or Information Systems – may benefit most from this work experience.</p>\n<p>\nAbout UIT: University Information Technology (UIT), the central IT service provider for campus, reports to the Chief Information Officer and is responsible for many of the University of Utah’s most critical common IT resources including the campus network; the Campus Information Services (CIS) portal; UMail, telephone, and online collaboration services; high performance and research computing; information security; teaching and learning technologies; software licensing; and a host of other systems and services. For more information about UIT visit http://www.it.utah.edu.</p>\n<p>\nAbout the University: Located in Salt Lake City, in the foothills of the Wasatch Mountains, the University of Utah is the flagship institution of the State of Utah’s system of higher education and a member of the PAC-12 Conference. Salt Lake City combines the amenities of a major metropolitan area of more than one million people with the friendliness and ease of living of a small, Western city. Seven major ski resorts are within an hour’s drive from campus, and opportunities to pursue activities from biking to hiking to fishing abound. Salt Lake is also home to the Utah Symphony and Opera, the Utah Ballet, several professional sports teams, and a wide range of other cultural and recreational activities. http://www.employment.utah.edu/staff/work.php</p>\n<p><b>\nThis is a Category </b><b>IIA</b><b> position:</b> Not required on campus and able to telework during the duration of the University’s COVID-19 response. Employees and/or functions where employees are able to work remotely in order to maintain campus systems, campus operations, clinical operations, and patient care.</p>\nResponsibilities\n<div>Under the direction of the Content Management and Usability team, the successful candidate will assist in:<br>\n<ul><li>Developing and supporting high quality, database-driven web applications for colleges and departments</li><li>Researching, identifying, integrating and implementing solutions with a variety of technologies and tools</li><li>Providing quality customer support to clients</li><li>Tool administration and clean-up tasks</li></ul></div>\nMinimum Qualifications\n<ul><li>Must be a current University of Utah student\n</li><li>Ability to code detailed, functional pages from mockups in collaboration with designers</li><li>Working knowledge of PHP, MySQL, XML, XSL, HTML, CSS, and JavaScript/jQuery</li><li>Working knowledge of web standards including HTML5, CSS3, and WCAG 2.0</li><li>Familiarity with web application development security practices</li><li>Self-motivated with a desire to learn\n</li><li>Positive attitude towards a variety of types of projects, ranging from day-to-day cleanup and repetitive tasks, to research, to assisting with the development of complex database applications.</li><li>Detail oriented with strong organization skills</li><li>Excellent written and verbal communication skills</li><li>Service and teamwork oriented</li><li>Ability to think logically, and communicate clearly and diplomatically</li><li>Enthusiasm about job and pride in work</li></ul>\nPreferences Special Instructions Summary</div>"
    },
    {
        "position": "Laser Applications Intern",
        "company": "TRUMPF INC",
        "location": {
            "city": "Plymouth",
            "state": "MI"
        },
        "posted": "2020-12-16T21:30:47.504Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=113&ao=1044074&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_daba4728&cb=1608154130241&jobListingId=3746478916",
        "lastScraped": "2020-12-16T21:30:47.504Z",
        "description": "<div><p>Trusting in brave ideas\" this is our promise to everyone who works for us. As a family business, we make long-term decision and provide our people with the trust and stability needed to bring their ideas to fruition, even the unconventional ones. Being a market and technology leader in machine tools and lasers, we courageously shape the manufacturing of tomorrow, meeting every challenge with bold, fresh thinking.</p><p><b>\nSummary</b></p><p>\nThis internship is a fantastic opportunity for college or university students to learn about fast developing laser and manufacturing industries. You will learn to program and use industrial lasers for feasibility studies for various customers, and you will be involved in development activities with latest equipment. This internship will provide an overview and practical experience in the Applications and Services Department at TRUMPF in Plymouth, MI (TUSD). The intern will be engaged in the day to day of the Laser Application Center and will be supporting the completion of customer applications with a focus on Laser marking and welding. The intern will support one or more experienced engineers in assignments, shadow operations, and have personal assignments as part of larger projects within the LAC.</p><p>\n <b>Principle Duties &amp; Responsibilities</b></p><p></p><br>\n<ul><li>\nBasic operation of TruMark and TruDisk laser equipment and process sample parts from various materials</li><li>\nPost processing of samples and communicating with 3rd parties on post processing support, as needed</li><li>\nAssist laser application engineers with various tasks related to laser marking and welding</li><li>\nHandle metallurgy equipment such as microscopes, cross section equipment</li><li>\nTake part in customer visit preparations</li><li>\nBeing part of various design of experiments in the field of laser processing</li><li>\nWork with 2D/3D software</li><li>\nTake part in Laser Application Center meetings</li><li>\nMaintain Laser Application Center equipment and premises in excellent condition</li><li>\nAny additional responsibilities as deemed necessary by management</li><li>\nAdhere to all company guidelines</li></ul><p><b>\nTravel</b></p><ul><li>\nMust maintain Valid Driver’s License</li></ul><p></p><br>\n<p><b>\nPhysical Requirement</b></p><p>\nNormal amount of sitting and standing, average mobility to move around an office, and ability to conduct normal amount of work on a computer.</p><div></div><br>\n<p><b>\nEducation &amp; Experience</b></p><p></p><br>\n<ul><li>\nEnrolled in a 4-year college or university with a concentration in Engineering, Physics or related field. Junior or Senior status is preferred</li><li>\nRelevant industry experience with lasers, laser applications, or other manufacturing processes is beneficial</li><li>\nExperience in metallurgy and materials science is preferred</li><li>\nAnalytical thinking and capability to work in a structured manner is essential</li><li>\nPrevious CAD experience a plus</li><li>\nExcellent verbal and written communication skills</li><li>\nMicrosoft Office; Word, Outlook, Excel, and PowerPoint</li></ul><p></p><br>\n<p>\nTRUMPF Inc. reserves the right to revise or change job duties and responsibilities as need arises. The job description does not constitute a written or implied contract of employment.</p><p></p><br>\n<p>\nTRUMPF is an Equal Opportunity Employer. Employment is based upon personal capabilities and qualifications without regard to race, color, religion, sex, marital status, national origin, ancestry, age, past or present history of mental disorder, physical, or learning disability, mental retardation, sexual orientation, genetic information or any other protected characteristic as established by law. This policy of Equal Employment Opportunity applies to all policies and procedures relating to recruitment and hiring, compensation, benefits, termination, and all other terms and conditions of employment.</p></div>"
    },
    {
        "position": "Software Engineer Summer Intern",
        "company": "GoHealth",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-16T21:30:50.582Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=114&ao=133357&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_710928dc&cb=1608154130242&jobListingId=3746466420",
        "lastScraped": "2020-12-16T21:30:50.582Z",
        "description": "GoHealth is looking for Software Engineer interns to join us in the summer of 2021. You will receive projects and daily work providing both challenging and fulfilling experiences in helping shape your skill development. At GoHealth, you'll solve problems to create an impact for consumers across the country. We promote a comprehensive learning environment fostered by senior engineers who will encourage you to think outside the box and share new ideas every day. You'll be given the opportunity to work with modern technologies and experience first-hand what a career with us looks like!<br><br><h3><strong>Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. GoHealth encourages you to break that statistic and to apply. No one ever meets 100% of the qualifications. We look forward to your application.</strong></h3><br><br><strong>Responsibilities:</strong>\n\n<ul>\n<li>Partner with software engineers to assist developing web-based software solutions</li>\n<li>Work with partners to design complex solutions from creation to production</li>\n<li>Develop solutions using the latest technologies to meet needs</li>\n<li>Learn coding best practices and participate in coding reviews</li>\n<li>Help debug common components within several GoHealth platforms</li>\n<li>Participate in technical discussions related to engineering/product work</li>\n<li>Compile accurate documentation and reports</li>\n<li>Work with departments outside of software engineering on several projects</li> \n</ul>\n<strong>Skills and Experience:</strong>\n\n<ul>\n<li>Junior or Master's student pursuing a degree in computer science, computer engineering or related field</li>\n<li>Desire to enhance programming skills in TypeScript, React.js, Java, Go, and Python</li>\n<li>A passion for solving complex technical problems</li>\n<li>Advanced knowledge on computer science fundamentals</li>\n<li>Ability to communicate effectively in a collaborative, fast-paced technical environment</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Academic performance (minimum GPA = 3.5/4.0)</li>\n</ul>\n<strong>Benefits and Perks:</strong>\n\n<ul>\n<li>10-week paid internship <em>(starting June 2021)</em> in the trendy River North Neighborhood in downtown Chicago<em>.</em> Subject to change remotely pending status of COVID-19</li>\n<li>Casual work environment - we're a friendly group, we have fun with each other and have a respectful workplace</li>\n<li>Rotational days to shadow other areas of the business</li>\n<li>Interactive Lunch &amp; Learns with C-Suite</li>\n<li>Continued training opportunities through GoHealth E-Learning series</li>\n<li>Casual dress-code</li>\n<li>GoHealth is an Equal Opportunity Employer</li>\n</ul>\n<strong><em>GoHealth will conduct all interviews for our internships remotely. While we intend to have the internship program (beginning June 2021) at our Chicago Headquarters, we are prepared to move this program virtual following the guidance of local health authorities' and the CDC.</em> </strong>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Waffle TV",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        },
        "posted": "2020-12-16T21:30:55.141Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=115&ao=1136006&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_73b7c8e0&cb=1608154130242&jobListingId=3771871270",
        "lastScraped": "2020-12-16T21:30:55.141Z",
        "description": "<p>Waffle is a sports platform harboring some of the most cutting edge and ground breaking athletes today. We work with athletes and influencers from all over the world including leagues like the NFL, NBA, NCAA, WNBA, and many others.</p><p>—</p><p>As a Waffle Engineering team member, you’ll help us build the future of communication. We are looking for an iOS and/or Android developer. You will be focused on delivering Android and iOS applications. As a mobile developer, you will bring experience in technologies such as React Native with React.js, objective c/swift/java, &amp; iOS and Android SDK.</p><p>—</p><p><b>This is an unpaid internship.</b></p><p>If in college, Waffle will provide the necessary college credit to all interns if it is requested. Please include a portfolio or examples of your work along with your resume!</p><p>Let's reshape how the world plays!</p><p>--<br><b>This internship is for Fall 2020 - Spring 21, with potential to extend, or hire.</b></p><p><b>Fully Remote</b></p><p><b>Responsibilities: </b></p><ul><li>Create and refine high performance mobile apps that push the limits of mobile technology</li></ul><ul><li>Build fun, new products that are very stable and run smoothly</li><li>Strong in Android &amp; iOS coding methodologies with Proof of work (e.g. GitHub contributions) &amp; have published one or more iOS/Android apps in the App Store (should be able to demo the app)</li><li>Ability to design mobile code and implement both functional and non-functional requirements</li><li>Design patterns to ensure productivity, maintainability, and scalability</li><li>Experience in mobile native ui, realm, networking, persistency, multithreading, performance, push-notifications, concurrency, Java for android, and security</li><li>Conceptualize, develop, and launch new features</li></ul><ul><li>Carefully evaluate the technical tradeoffs of every decision</li></ul><ul><li>Work with the Design team to hone in on the best UI and infrastructure practices</li></ul><ul><li>Carry out code reviews to guarantee code quality</li></ul><ul><li>Own features from design through implementation and launch</li></ul><p><b>Knowledge, Skills &amp; Abilities: </b></p><ul><li>Objective-C and iOS</li></ul><ul><li>Java and Android</li><li>Knowledge of the OS internals, compilers, optimization for low-power and mobile systems</li></ul><ul><li>Proficiency with multithreading and performance optimization techniques for iOS, Android</li></ul><ul><li>Strong CS fundamentals (algorithms and data structures) and problem-solving skills</li><li>Knowledge of software design patterns and iOS best practices and Android best practices</li><li>Backend technologies</li></ul><p><b>Qualification: </b></p><ul><li>BS/BA degree in a technical field such as Computer Science or equivalent years of experience, or in progress</li><li>Understanding of React Native, React.js, Python, Objective-C for iOS, Ruby, Android-SDK, JavaScript, Cocoa Touch, and PHP, etc.</li><li>4+ years of experience in developing mobile applications for the iOS and Android environment</li></ul><p><b>Preferred Qualifications: </b></p><ul><li>Experience with Objective-C and iOS</li></ul><ul><li>Experience with Swift</li></ul><ul><li>Experience with C/C++</li></ul><ul><li>Experience with OpenGL or Metal</li></ul><ul><li>Experience with Java (NDK)</li><li>Experience with Kotlin</li><li>Experience with Python</li><li>Experience with React Native, React.js</li></ul><p><b>Waffle is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.</b></p><p><b>This Job Is Ideal for Someone Who Is: </b></p><ul><li>Dependable -- more reliable than spontaneous</li><li>Achievement-oriented -- enjoys taking on challenges, even if they might fail</li><li>Autonomous/Independent -- enjoys working with little direction</li></ul><p><b>This Company Describes Its Culture as: </b></p><ul><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Collaborative - - open end of ideas</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $0.00 per hour</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Company's website:</p><ul><li>https://watchwaffle.tv</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Virtual meetings</li></ul>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Kiva.org",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-16T21:30:58.962Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=116&ao=1158547&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_3b22e7f1&cb=1608154130242&jobListingId=3689054165",
        "lastScraped": "2020-12-16T21:30:58.962Z",
        "description": "<strong>About us:</strong>\n<br><br>\nKiva (kiva.org) is an international nonprofit with a mission to expand financial access to help underserved communities thrive. We run a global marketplace platform to crowdfund microloans for financially excluded entrepreneurs, farmers and students around the world. Our organization combines the culture and technological passion of an internet start-up with the compassion and empathy of a non-profit to create impact and opportunity at global scale. In just 13 years, we have raised more than $1.2 billion in loan capital for 2.7 million borrowers in 83 countries. Our lenders fund over $10 million in loans every month. With offices in San Francisco, Portland, New York, Nairobi, and Bangkok, Kiva's team includes 100+ employees and 400+ volunteers worldwide. Our team is growing as we pursue exciting new opportunities to create a financially inclusive world.\n<br><br>\n<strong>Role overview:</strong>\n<br><br>\nAs a Software Engineering Intern, you will be mentored by engineers from different technical backgrounds who all share a passion for technology, solving meaningful problems, and making tangible impact. You will join an established team at Kiva during an exciting time of growth and innovation. The ideal intern candidate is passionate about both our organizational mission and learning new skills. Effective communication is among the most important tools in your toolbox. You are always looking at how things can be improved and examine problems from all angles.\n<br><br>\n<strong>All interns must be physically based in the United States and have valid U.S. work authorization.</strong>\n<br><br>\n<strong>Internship Program:</strong>\n\n<ul>\n<li>Our 10 to 12-week summer internship program (with the option to extend) provides you with a comprehensive introduction to the microfinance, nonprofit, and tech spaces while being fully integrated into a team.</li>\n<li>You will have the option to complete the internship remotely or be based in Kiva's San Francisco or Portland if COVID-19 safety measures permits.</li>\n<li>You will report to and work closely with an engineering manager while also having the support of an engineering mentor buddy.</li> \n\n<li>You will have the opportunity to select from a wide range of projects. At the end of your internship, you will present your project to the engineering organization.</li>\n<li>We will pair you with a dedicated engineer to ensure the success of your project. They will be your go-to person for any questions, suggestions, advice, and providing constructive feedback.</li>\n<li>You will engage with executives and industry leaders through intern and company wide events.</li>\n<li>You will participate in professional career development workshops and memorable fun events with fellow interns, teammates, and full-timers.</li>\n</ul>\n<strong>You will:</strong>\n\n<ul>\n<li>Learn about microfinance, nonprofit, and engineering best practices at Kiva.</li>\n<li>Learn and work across a variety of technologies like Vue.js, node.js, kotlin, cloud-based microservices, and distributed ledger.</li>\n<li>Learn modern software engineering processes and experience development cycles from conception to deployment into production.</li>\n<li>Contribute to our core services and build scalable programs that standardize information flow and increase operational efficiency.</li>\n<li>Be part of a close-knit engineering team and have an experienced mentor who considers it their job to make sure you're growing the skills you need.</li>\n<li>Own a project that has a serious impact on Kiva's work. For example, a past intern project involved securely and quickly translating 3M+ citizen identities into blockchain wallets while another intern used the latest open source visual regression tools to ensure a consistent user experience when onboarding new banking customers in communities with limited financial assess.</li> \n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Preferred: Currently pursuing a BS or MS in Computer Science or a related technical discipline.</li> \n\n<li>Excited to learn new languages and technologies.</li>\n<li>Willing to dive in and learn by doing.</li>\n<li>Ready to work with others to solve hard problems.</li>\n</ul>\n<strong>What we offer:</strong>\n\n<ul>\n<li>Opportunities to improve real lives, solve hard problems, and change the world.</li>\n<li>Friendly, supportive, and adventurous environment with a team of engaged colleagues.</li>\n<li>Opportunities to connect with and learn from colleagues and partners around the world.</li>\n</ul>\n<strong>Perks:</strong>\n\n<ul>\n<li>Professional development and skills workshops.</li> \n\n<li>Open invitation to join Kiva's Employee Resource Groups (ERGs) and social activities such as happy hours and coffee chats.</li> \n\n<li>References gladly given for successful participants.</li> \n</ul>\n<em>A diverse and inclusive workplace where we learn from each other is an integral part of Kiva's culture. We actively welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!</em>"
    },
    {
        "position": "Financial Planning & Analysis Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Skokie",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:02.658Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=117&ao=1076762&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_bc14b4c4&cb=1608154130242&jobListingId=3656126552",
        "lastScraped": "2020-12-16T21:31:02.658Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed 3 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The Financial Planning &amp; Analysis (FP&amp;A) Intern will assist to provide financial support to the business. The Intern will engage in one or more projects to drive improvements in financial reports, conduct financial modeling and analysis to support the business, improve forecast accuracy, results analysis or data governance.</p><br><ul><li>Assist with the preparation of month-end reports and communicate results to business unit leaders.</li><li>Analyze financial results to identify key drivers of variances. Utilize various analysis techniques to identify insights and participate in communication to business unit leaders.</li><li>Provide support to develop monthly forecasts for business units reflecting drivers of significant variances.</li><li>Provide financial support and analysis of new business expansion projects and capital investment analysis. Will utilize discounted cash flow metrics including NPV, IRR, and payback periods.</li><li>Assist in process improvements in planning, reporting, forecasting, and analysis to drive efficiencies, improve data integrity and derive insights to support business leadership decision-making.</li></ul><br><ul><li>Pursuing a Bachelor’s Degree in Finance, Accounting or related field. MBA/Masters candidates will also be considered.</li><li>Completed course work with discounted cash flow; financial statement analysis; ROI; statistics/data science; multiple regression a plus.</li><li>Strong communication skills both written and verbal.</li><li>High level of detail orientation and organization, as well as ability to multi-task.</li><li>Computer literacy intermediate Excel skills, Microsoft Office, Word, and Power Point.</li><li>Able to exercise judgment within defined procedures and practices to determine appropriate action.</li><li>Good business acumen and be able to appropriately handle confidential information.</li><li>Detail-orientated with strong organizational skills.</li></ul>"
    },
    {
        "position": "Research Intern - Undergraduate Research Intern - New England",
        "company": "Microsoft",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2020-12-16T21:31:06.133Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=118&ao=37049&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_916fab6f&cb=1608154130243&jobListingId=3716604412",
        "lastScraped": "2020-12-16T21:31:06.133Z",
        "description": "Research Internships at Microsoft provide a dynamic environment for research careers with a network of world-class research labs led by globally-recognized scientists and engineers. Our researchers and engineers pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.\n<br><br>\nThis program is for candidates who are passionate about technology and offer diverse perspectives. We don’t just value differences, we seek them out. We invite them in. We are a family of individuals at a truly global company, united by a single mission.\n<br><br>\nMicrosoft’s mission: “Empower every person and every organization on the planet to achieve more”. To achieve our mission, we need to create a workforce that represents the rich diversity of our customers. The Microsoft Undergrad Internship Program is a tool to do just that. Our mission, “To unlock everyone’s engineering talent so they can achieve more”.\n<br><br>\nThe Microsoft Undergrad Internship Program is focused on developing talent and experience for careers in computing research.\n<br><br>\nThe program is a 12-week summer internship program specifically designed for advanced undergraduate students. It offers the opportunity to do state-of-the-art research in one of our US-based Microsoft Research Labs. You will work with our researchers and extended network of visiting faculty, postdoctoral researchers, data and applied scientists, engineers, designers, and doctoral students to make important contributions to new and ongoing research. One of the program’s goals is to encourage participants to pursue advanced degrees in computing fields. Your on-the-job learning will be augmented with mentoring, community building, and networking opportunities.<br><br><h2>Responsibilities</h2><br><br>Interns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, interns learn, collaborate, and network for life. Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12-week internship, students are paired with mentors and expected to collaborate with other interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year-round, though they typically begin in the summer.<br><br><h2>Qualifications</h2><br><br>We especially encourage applications from groups currently underrepresented in engineering and computer science, including those who self-identify as a woman, African American, Black, Hispanic, Latinx, American Indian, Alaska Native, Native Hawaiian, Pacific Islander, person with a disability, and/or LGBTQI+\n<br><br>\nApplication Materials:\n<br><br>\n1. CV or Resume\n<br><br>\n2. 2 or 3 Reference Letters\n<br><br>\n3. Two Essays\n<br><br>\na. Essay 1: Research interest statement (500 words or fewer)\n<br><br>\ni. Select up to three desired research areas. (See section “MSR Research Areas” below).\n<br><br>\nii. Answer the prompt: What draws you to the desired research area(s) you selected and what impact would you like to have in that space?\n<br><br>\niii. Be sure to also describe:\n<br><br>\n1. any relevant experience in this/these research area(s) and\n<br><br>\n2. how you expect to personally benefit from participating in this internship.\n<br><br>\nb. Essay 2: Leadership in Diversity statement (250 words or fewer)\n<br><br>\ni. Please describe ways you have contributed to increasing diversity and inclusion in your field and/or any unique challenges you may have faced and how you navigated those obstacles.\n<br><br>\nStudents must submit the application materials outlined above to be considered.\n<br><br>\n<strong>Required Qualifications</strong>\n<ul>\n<li>Candidates must be junior or senior students enrolled in a bachelor’s degree program majoring in computer science, computer engineering, software engineering, information science or related major.</li><li>By the start of the internship program (~May 2021) candidates must have at least two years/multiples years of programming experience, completed courses in Calculus, Probability and Statistics and/or Machine Learning <strong>OR</strong> demonstrated training in at least one social science methodology.</li>\n</ul>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
    },
    {
        "position": "Software Development Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:09.582Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=119&ao=1080815&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_351d814a&cb=1608154130243&jobListingId=3656126578",
        "lastScraped": "2020-12-16T21:31:09.582Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The Software Development Intern will assist with support of new product development features and technology. These activities involve basic programming, scripting, and testing on new and existing technology platforms. The intern will evaluate competitive products and new-to-Shure technologies, as well as supporting testing of prototype devices for product development teams. Additionally the intern will write evaluations and summaries of their work.</p><br><ul><li>The intern will help test competitive products</li><li>Code new features, fix bugs, and exercise technologies under investigation</li><li>Collaborate with technology leaders, manager, testers, and the IT department to meet system design requirements</li><li>Works within Shure software development process and coding standards</li><li>Performs other duties as assigned</li></ul><br><ul><li>Pursuing degree in Computer Science or related feild </li><li>Software engineering skills:<ul><li>Object-oriented design</li><li>Web application testing methodologies</li><li>Parallel and concurrent programming</li></ul></li><li>Proficiency in one or more of the following programming technologies:<ul><li>Python</li><li>C#</li><li>NET Web Forms</li><li>NET Entity Framework</li><li>JavaScript, JQuery and CSS</li></ul></li></ul>"
    },
    {
        "position": "Full Stack Application Software Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:12.236Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=120&ao=1080815&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_ac3389e5&cb=1608154130244&jobListingId=3656126597",
        "lastScraped": "2020-12-16T21:31:12.236Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The Full Stack Application Software Intern assists with developing, and testing platform independent (Windows, OS X, Linux) GUI applications software and the integration with wired and wireless communication protocol stacks and embedded firmware systems in professional audio products. Collaborates with other Company divisions including Marketing to establish use cases and requirements, and software tests to define and execute test plans. </p><br><ul><li>Assists with the design and implementation of platform independent GUI application software that controls and manages audio products and networking technologies</li><li>Collaborates with marketing, software test and system engineering to define platform independent GUI application software use cases and requirements</li><li>Prototypes GUI application software using technologies such as Angular or HTML5/CSS</li><li>Assists with development (coding) of platform independent GUI application software by providing technical expertise to internal Company software developers</li><li>Estimates, organizes, and documents tasks</li><li>Performs other duties as assigned</li></ul><br><ul><li>Pursuing a Bachelor’s degree in Computer Science or related field </li><li>Basic knowledge of platform independent GUI application software development on PC Windows/ Linux and Mac (OS X) platforms and learns to use professional concepts</li><li>Development experience using C++/.Net or Html5/Javascript preferably with an OO approach, is desired</li><li>Knowledge of cloud services (AWS, Azure, or Google Cloud) is a plus.</li><li>Able to apply company policies and procedures to resolve routine issues.</li><li>Able to follow standard instructions, practices and procedures in analyzing situations or data</li></ul>"
    },
    {
        "position": "IT Data Engineering Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Skokie",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:15.262Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=121&ao=1049873&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_eef8a9a3&cb=1608154130244&jobListingId=3656126548",
        "lastScraped": "2020-12-16T21:31:15.262Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>We are looking for a data passionate individual to join our growing Data and Analytics practice. The internship will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The ideal candidate enjoys solving business problems and delivering data insights. The Data Engineer will support our database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. Must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. </p><br><ul><li>Assist with data cataloging, data acquisition, data modeling and data quality.</li><li>Learn / leverage cloud-based data management capabilities </li><li>Assist with research on technology options and processes related to data management and governance </li><li>Assist with analytics to uncover potential opportunities</li><li>Building of data visualization in support of business projects</li><li>Help with data pipeline projects, as needed</li></ul><br><ul><li>In-process bachelor’s or advanced degree in computer science, data science / analytics related degree </li><li>Some experience with open-source programing languages, e.g. Python, R, etc. </li><li>Knowledge of the AWS data lake formation and/or Tableau a plus</li><li>Microsoft Office skills </li><li>Self-motivated, team player, detail oriented</li><li>Able to meet required deadlines</li><li>Ability to work independently with high degree of accuracy and attention to detail.</li><li>Excellent verbal and written communication skills. </li><li>Keen willingness to learn new concepts and skills.</li></ul>"
    },
    {
        "position": "Data Science Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:17.793Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=122&ao=1080816&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_3a954a52&cb=1608154130244&jobListingId=3656126555",
        "lastScraped": "2020-12-16T21:31:17.793Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>As a Data Science Intern, you will work with a team of engineers who research, prototype, implement and demonstrate use cases in machine learning and artificial intelligence that make Shure products smarter, more performant, and more insightful. You will identify and capture datasets that you will use to train and assess predictive models that derive insights from structured and/or unstructured data.</p><br><br><ul><li>Minimum two years of coursework in statistics, mathematics, computer science, or related field with coursework in data science</li><li>Masters level candidates a plus</li><li>Experience with big data technologies and cloud-based services for data storage and processing</li><li>Knowledge of machine learning and deep learning models and frameworks</li><li>Knowledge of full stack development with languages such as Python, Java, JavaScript, and C++</li><li>Experience with embedded development is desired</li><li>Creativity and curiosity for future technologies and a passion for realizing new capabilities</li></ul>"
    },
    {
        "position": "Embedded Software Development Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:20.390Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=123&ao=1080815&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_1c34aa8a&cb=1608154130245&jobListingId=3656126571",
        "lastScraped": "2020-12-16T21:31:20.390Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>As the Embedded Software Intern, you will be part of our Product Development Division working closely with senior engineers using advanced tools and techniques to develop, test, and deploy various award winning software solutions for our audio systems. You will gain exposure to networking and embedded software as well as graphical user interfaces for web, mobile or multi-platform based systems.</p><br><br><ul><li>Minimum two years of course work in Computer Science or related field </li><li>Masters level candidates a plus</li><li>Must have experience in object oriented programming using C++</li><li>Experience using networking protocols specifically TCP/IP and UDP is a plus</li><li>GUI experience is a plus</li><li>Recommended Classes: Networking, Object Oriented Programming C++, Data Structures and Algorithms</li></ul>"
    },
    {
        "position": "Software Intern (DevOps)",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:23.063Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=124&ao=1080815&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_1a81413e&cb=1608154130245&jobListingId=3656126565",
        "lastScraped": "2020-12-16T21:31:23.063Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The Software intern will help create new a network protocol stack and adapter to enable the monitor and control of competitor equipment. They will review product protocol documentation, implement the protocol as defined, implement the related protocol adapter, and test/profile the implementation. </p><br><ul><li>Review competitor product network protocol documentation</li><li>Implement competitor network protocol and protocol adapter</li><li>Test/profile protocol implementation</li></ul><br><ul><li>Minimum two years of course work in Computer Science or related field </li><li>Masters level candidates a plus</li><li>Programming experience working with various languages – python, perl, C/C++, Java, C#, .Net, shell etc. </li><li>Knowledge of software automation, Linux administration and/or cloud services is a plus</li><li>Computer networking knowledge is a plus</li></ul>"
    },
    {
        "position": "ATE Software Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:25.594Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=125&ao=1080815&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_fd984e16&cb=1608154130246&jobListingId=3656126586",
        "lastScraped": "2020-12-16T21:31:25.594Z",
        "description": "<p><strong>Summer 2021</strong><br><br>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The ATE Software Intern will work with the software platforms that run Shure’s Automated Test processes. These include the Product Test Executive, Equipment Instrument Drivers, and Database connected Web portals for data maintenance and analysis. This will allow the intern to be exposed to a variety of software technologies and industry practices.</p><br><p>• Maintain data integrity and software quality.<br>• Add features and bug fixes to ATE Software Platforms<br>• Follow software build and release procedures<br>• Collaborate and contribute to ATE Software meetings<br>• Provide feedback on work assigned</p><br><p>• Pursuing a Bachelor’s degree in Computer Engineering or Computer Science.<br>• Basic working knowledge of MS Office tools<br>• Ability to work independently with high degree of accuracy and attention to detail.<br>• Self-motivated, team player, detail oriented <br>• Good verbal and written communication skills<br>• Fundamental theory and knowledge of software programming (Preference in C#, Java, PHP)<br>• Experience with Web and Relational Database design</p>"
    },
    {
        "position": "DSP Data Science Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:28.223Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=126&ao=1080816&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_851af813&cb=1608154130246&jobListingId=3656126561",
        "lastScraped": "2020-12-16T21:31:28.223Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><br><p>As the Digital Signal Processing Data Science Intern, you will integrate, balance, and complement machine learning and artificial intelligence with classical DSP processing techniques. You will have the opportunity to work on various phases of DSP development, including audio algorithm/machine learning/deep learning simulation, verification, and implementation on embedded hardware, perform objective measurements, and design and participate in subjective listening tests across various Shure products, such as array microphones, DSP processing products, wired and wireless microphones, mixers, and conferencing products. The ideal candidate will have demonstrated projects in applying machine learning, artificial intelligence, and data science to audio processing. Interest or experience in low latency real-time audio algorithm design and development, comfort working with both data science and engineering tools and environments to train models and to realize them in working demonstrations is desired. </p><br><ul><li>Completed at least two years of coursework in Electrical or Computer Engineering, Computer Science, or Mathematics with an emphasis in Data Science and/or Digital Signal Processing preferred</li><li>An interest and/or experience in Audio is required</li><li>Experience with training and verifying machine learning and deep learning models in frameworks such as Keras, TensorFlow, TensorFlow Lite, PyTorch, etc.</li><li>Experience with Python required</li><li>Experience with big data technologies and common cloud-based services (e.g. Amazon Web Services) for data storage and processing is a plus</li><li>Experience with C, C++ or Assembly language programming is a plus</li><li>Experience designing and deploying models for embedded, FPGA, iOS, or Android platforms is a plus</li><li>Experience with studio recording or live sound is a plus</li></ul>"
    },
    {
        "position": "System Verification Intern",
        "company": "Shure Incorporated",
        "location": {
            "city": "Niles",
            "state": "IL"
        },
        "posted": "2020-12-16T21:31:31.596Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=127&ao=1080852&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_8180294b&cb=1608154130247&jobListingId=3656126577",
        "lastScraped": "2020-12-16T21:31:31.596Z",
        "description": "<p><strong>Summer 2021</strong></p><p> </p><p>Shure offers a challenging and rewarding summer internship program. The twelve week program is offered to undergraduate students that have completed at least 2 years of college, as well as graduate students. Each intern will receive a competitive salary and students who reside out of Illinois will receive a housing stipend to cover living expenses. Applications will be collected, reviewed and selected candidates will be contacted in late fall/early winter.</p><p> </p><p>The System Verification Intern will get hands on experience at multiple levels of software development and testing. You will be developing and performing manual, automated regression, stress, and load testing of applications for both PC and embedded software applications. You will learn to clearly document defects found with all steps needed to re-produce the issue as well as document the overall results of a test cycle with a formal test report.</p><br><br><ul><li>Currently Pursuing a College degree in Computer Science or Electrical Engineering</li><li>Detail oriented individual.</li><li>Basic understanding of Wireless transmitters and receivers</li><li>Good written and verbal communication skills.</li><li>Experience with C, C++, python, java script, HTML, SQL, and other scripting languages</li></ul>"
    },
    {
        "position": "Data Collection Software Engineering Intern",
        "company": "Adobe",
        "location": {
            "city": "Lehi",
            "state": "UT"
        },
        "posted": "2020-12-16T21:31:34.341Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=128&ao=132917&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_95c5cc3e&cb=1608154130247&jobListingId=3716475974",
        "lastScraped": "2020-12-16T21:31:34.341Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nWe are seeking candidates for an exciting new internship opportunity on one of the best teams at Adobe! If you have been paying attention, you've seen the explosion of Mobile software development. Our team is responsible for a number of high fidelity systems used by many of the largest brands in the world. In fact, many of the technologies we build are likely embedded in many of the apps installed on your phone. We are also responsible for crafting one of the largest Data Collection Edges and Serverless Computing infrastructures on the globe! We process streaming data transactions on the order of billions coming from devices all over the globe. You'd be working on one of the greatest challenges faced by software engineers today. Who would not want an internship that puts them in the heart of an exciting new frontier and set them up for the future?\n<br><br>\nAs a Computer Science intern on Adobe Experience Platform, you’ll be paired with a mentor, and will work side-by-side with our engineering team to learn the technology and develop critical-path software. You'll experience first-hand the process of creating world-class enterprise SaaS applications. Internship projects may involve either client-side app development or backend service development. After joining, we’ll review possible project ideas and will match passions with potential projects.\n<br><br>\nKnowledge of common software development practices like Agile and Scrum will be critical. A good understanding of object-oriented programming will also be needed to be successful. Ideally candidates would have a basic understanding of design patterns, APIs, and Web Analytics. Above all else, candidates must have good communication skills and a genuine desire to learn.<br><br><h2>Desired Skills</h2>\n\n<ul>\n<li>Working Knowledge of Object-Oriented Development</li><li>Experience in Java Development</li><li>Technical Writing Skills</li><li>Good Communications Skills</li><li>Familiar with Software Development Lifecycle and Agile Development</li><li>Continuous Integrations and Continuous Deployment (CI/CD or DevOps)</li>\n</ul>\nAt Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists (http://www.adobe.com/careers/awards.html). You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In (http://www.youtube.com/watch?v=hmL6uQZhYhw&amp;list=UUlDSu3-Y4-BfI08784K-P4g&amp;feature=share&amp;index=1) approach where ongoing feedback flows freely.\n<br><br>\nAdobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status.<br><br>Adobe"
    },
    {
        "position": "Data Analyst Intern",
        "company": "Cadent",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2020-12-15T21:31:37.002Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=129&ao=1163002&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_7dd5361c&cb=1608154130248&jobListingId=3771526956",
        "lastScraped": "2020-12-16T21:31:37.002Z",
        "description": "Cadent powers the evolution of TV brand advertising. We provide marketers, agencies, operators, and media owners with data-driven solutions for buying and selling TV advertising. By connecting brands with opportunities across national inventory sourcescable, broadcast, and digital mediaour technology improves efficiencies and boosts the results of linear, addressable, and cross-screen campaigns.\n<br><br>\nAs we continue to grow, we are looking for <strong>Data Analyst Intern</strong> to join our team for Spring 2021. This Intern will have an opportunity to gain hands-on experience virtually by working directly with our teams, not for them.\n<br><br>\nThis Intern will also spend the Spring on an individual project customized to their specific skill-set which they'll present to our Tech Leadership team at the end of the program. Details of the projects and timeline will be laid out by supervisors at the beginning of the program.\n<br><br>\nThe Data Analyst Intern will be responsible for fulfilling tasks set out by supervisors from the specific department they're working in, including but not limited to:\n\n<ul>\n<li>Attending team meetings,</li>\n<li>Performing research,</li>\n<li>Using department-specific software to complete day-to-day assignments.</li>\n</ul>\nPerks:\n\n<ul>\n<li>Competitive pay</li>\n<li>College credit (if applicable)</li> \n</ul>\nRequirements:\n\n<ul>\n<li>A rising senior pursuing a bachelor's degree in Computer Science at a college or university</li>\n<li>Able to commit to a part-time (20 hours per week) work schedule between February 16th 2021 April 27th, 2021</li>\n<li>Excellent verbal and written communicators</li>\n<li>Self-motivated with a desire to learn from a rapidly growing company</li>\n<li>Confident to take initiative and collaborate with teammates</li>\n<li>Excellent problem-solving skills</li>\n</ul>\nOur hiring teams are looking for candidates with one and/or more of the following technical skills:\n\n<ul>\n\n<li>\n<strong>Programming language:</strong> working knowledge using Python or R, we're currently using Python</li>\n<li>\n<strong>SQL</strong> need to write queries to retrieve data from different data stores, a good understanding of SQL is a must</li>\n<li>\n<strong>Communication/Presentation skills</strong> you will have to translate the data by documenting and presenting in a format that would be easier for folks to understand</li>\n</ul>\nSo, if the leading edge of media technology is the place you want to be, apply today and let's start the conversation!\n<br><br>\n/CADENT/ is an EOE M/F/D/V. We do not work with 3rd Party Staffing Agencies<br><br>]]&gt;"
    },
    {
        "position": "Software Engineering Intern - Audacy",
        "company": "IDEAL Industries, Inc.",
        "location": {
            "city": "Sycamore",
            "state": "IL"
        },
        "posted": "2020-12-15T21:31:40.101Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=130&ao=1044074&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_d4e522a7&cb=1608154130248&jobListingId=3688610677",
        "lastScraped": "2020-12-16T21:31:40.101Z",
        "description": "<div>Overview:\n<div><b>\nIDEAL INDUSTRIES, Inc</b>. has been propelled by the principles of its founder, J. Walter Becker, for nearly a century. Since the beginning, this family-run enterprise has been committed to building ideal relationships with its customers, employees and communities, creating some of the industry’s most innovative and trusted products along the way. This commitment to quality and service will continue to spur the success of <b>IDEAL INDUSTRIES, Inc.</b> and its family of companies, for generations to come.</div><div></div><br>\nResponsibilities:\n<p><b>\nPrimary Responsibilities:</b></p><ul><li>\nDevelop testing protocols</li><li>\nConduct software validation testing</li><li>\nLow level coding</li><li><div>\nSeveral long term design projects for new product development</div></li><li><div>\nSupport engineering projects as assigned</div></li></ul>\nQualifications:\n<ul><li>Rising Junior or Senior BS in Computer Science or similar degree\n</li><li>Desired knowledge of computer science, embedded systems and software engineering paradigms and practices.</li><li>\nWorking knowledge of good programming practices and techniques, specifically with concepts around object-oriented design, database access, and embedded systems</li><li>\nAbility to solve problems enthusiastically and creatively.</li></ul><p></p><br>\n<div><b>\nIDEAL INDUSTRIES</b> is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.</div></div>"
    },
    {
        "position": "Software Engineering Intern - Summer",
        "company": "CACI International",
        "location": {
            "city": "Denver",
            "state": "CO"
        },
        "posted": "2020-12-15T21:31:42.971Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=201&ao=128418&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_d862718f&cb=1608154133311&jobListingId=3687973956",
        "lastScraped": "2020-12-16T21:31:42.971Z",
        "description": "<strong>Job Description</strong>\n<br><br>\nCACIs Business and Information Technology Solutions (BITS) Sector, is seeking a high energy software engineering intern to support an artificial intelligence based research and development in Denver Tech Center, CO. Youll work on small and agile teams focused on applied AI research in the areas of complex reasoning, video and imagery exploitation, and so much more. If you are a motivated individual looking to be a part of a fun but hardworking team, we'd like to speak with you.\n<br><br>\nWhat Youll Get to Do:\n<br><br>\nAs an Intern, youll work on a team that is researching the latest results in Artificial Intelligence, Machine Learning, and Deep Learning.\n<br><br>\nThe commitment of our BITS employees to \"Engineering Results\" is the catalyst that has propelled BITS to becoming a leader in software development, R&amp;D, sensor development and signal processing. Our engineering teams are highly adept at solving complex problems with the application of leading-edge technology solutions, empowering decision-makers to make better mission-critical decisions. Our operational team excels at signal collection, processing, and analysis. We have operational personnel stationed around the world in support of our customers' missions\n<br><br>\nTechnologies you will be exposed to:\n<ul>\n\n<li>Python</li>\n<li>Deep Neural Network applications</li>\n<li>Agile Software Development, Open Source Application Development and Contributions</li>\n<li>Advanced Machine Learning</li>\n<li>Google TensorFlow, PyTorch</li>\n\n</ul>\nYoull Bring These Qualifications:\n<ul>\n\n<li>U.S. Citizen</li>\n<li>Ability to Obtain a Security Clearance, Background Investigation and Polygraph</li>\n<li>No Drug Use</li>\n<li>Enrolled in a Bachelor's, Master's or PhD program</li>\n<li>Must currently be enrolled in High School OR a full-time Undergraduate, Graduate, or Doctorate student</li>\n<li>Must be able to obtain and maintain security clearance (if applicable to position)</li>\n\n</ul>\nThese Qualifications Would be Nice to Have:\n<ul>\n<li>Minimum GPA of 3.0 or higher is preferred, not required</li> <li>Previous internship/co-op or other work experience, leadership and teamwork capabilities, interpersonal communication skills, and activities (professional/community/extracurricular)</li>\n</ul>\nWhat We Can Offer You:\n<ul>\n<li>Weve been named a Best Place to Work by the Washington Post.</li><li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li><li>We offer competitive benefits and learning and development opportunities.</li><li>We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.</li><li>For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success.</li>\n</ul>\nINRN2\n<br><br>\n<strong>Job Location</strong>\n<br><br>\nUS-Denver-CO-DENVER\n<br><br>\nCACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."
    },
    {
        "position": "Intern (IT - Interoperability -Undergraduate - Summer)",
        "company": "Sunshine Health",
        "location": {
            "city": "Charlotte",
            "state": "NC"
        },
        "posted": "2020-12-15T21:31:45.817Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=202&ao=3839&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_56708b67&cb=1608154133312&jobListingId=3715416851",
        "lastScraped": "2020-12-16T21:31:45.817Z",
        "description": "Basic Purpose:\n<br><br>\nInteroperability - Event Driven Integration platform that facilitates the exchange and efficient processing of healthcare information. Improving patient care &amp; safety, care coordination and experiences for patients; strengthening trust amongst Members, Providers, Health Plans; lowering healthcare costs; and providing more robust public health data.\n<br><br>\nIntern Projects:\n\n<ul>\n\n\t<li>Integration projects that facilitate the exchange of health care data between internal/external partners;</li> \n\n<li>Will require the build-out of micro-services and APIs (Application Programming Interface) to handle the exchange of this data, which also flows through our core integration engine.</li> \n</ul>\nPosition Purpose:\n\n<ul>\n\n\t<li>Learn various job functions within the Managed Care industry and explore various career opportunities</li>\n<li>Apply academic knowledge and learn new skills by contributing to various projects</li>\n<li>Research various legal, regulatory, and other topics within functional area and industry</li>\n<li>Attend training and development presentations to enhance professional competencies</li>\n</ul>\nLearn about various processes and functions within the Managed Care industry and develop professionally by contributing to projects that support the business.\n<br><br>\n<strong>Experience/Experience:</strong>\n<br>\nHigh school diploma or equivalent. Must be enrolled in an undergraduate program at an accredited university or college, preferably in a field related to the hiring department through the internship period.\n<br><br>\nPreferred Qualifications:\n<br><br>\nComputer Science or MIS major; Familiarity working with micro-services architecture, and possibly exposure to working with an Agile methodology\n<br><br>\n<em>Centene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law.</em>"
    },
    {
        "position": "Application Development Intern",
        "company": "Utah Transit Authority",
        "location": {
            "city": "Salt Lake City",
            "state": "UT"
        },
        "posted": "2020-12-15T21:31:49.019Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=203&ao=4128&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_bc3bf149&cb=1608154133314&jobListingId=3654251495",
        "lastScraped": "2020-12-16T21:31:49.019Z",
        "description": "<h2>Job Summary</h2>Responsibilities will include developing and supporting applications using C#, JavaScript, HTML, CSS, ASP.Net, MS SQL with SQL Server databases and SSRS reporting services.\n<br><br>\nThis will be a part-time internship. Hours are flexible and will not exceed 29 hours per week.\n<br>\n<h2>Minimum Qualifications</h2><strong>EDUCATION/TRAINING</strong>\n\n<ul>\n<li>Junior or senior level student currently enrolled in an accredited college or university, seeking an undergraduate degree in Computer Science, Information Systems or a related field. Must have at least a 3.0 GPA</li>\n</ul>\n\n<strong>EXPERIENCE</strong>\n\n<ul>\n<li>Experience creating and maintaining web applications based on the MVC framework or WebForms is desired.</li><li>Additional skills using AngularJS, KnockoutJS, Bootstrap, and Entity Framework are helpful but not required.</li><li>Experience creating and maintaining mobile application based on Xamarin</li><li>Individuals should work well in a team setting and work well with end users.</li><li>Soft skills in writing, technical writing, and customer service are desirable.</li><li>Must have good communication skills.</li><li>Must submit a transcript of grades and two letters of recommendation.</li>\n</ul>\n\nThis job requires regular and predictable attendance<br>\n\n<div>- <strong>OR -</strong></div><div>An equivalent combination or relevant education and experience.</div><strong>\n<br>\nPay Rate:</strong> $12.759 - $16.014 per hour depending on level of education completed.\n<br>\n<h3>Close Date: Open Until Filled</h3>"
    },
    {
        "position": "Intern",
        "company": "Cloud 9 Infosystems",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-15T21:31:57.682Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=204&ao=4120&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_1c5974fd&cb=1608154133316&jobListingId=3745330472",
        "lastScraped": "2020-12-16T21:31:57.682Z",
        "description": "Cloud 9 Infosystems is a leading technology consulting firm focused on growing enterprises. Cloud Technology Consulting Practice: Cloud 9 Infosystems guides clients to get the most from cloud technologies by envisioning, architecting, developing, implementing, and managing their cloud systems. Cloud 9 Infosystems expertise is in building custom solutions that leverage public and private cloud paradigms to solve complex customer scenarios. Microsoft Dynamics Practice: Cloud 9 Infosystems has implemented Microsoft Dynamics CRM and ERP solutions — both on-premise and on-cloud — from the basic out-of-the-box model to a complex architecture featuring automation, dashboards, system integration, and custom development. Cloud 9 Infosystems offers strategically configured dynamic solutions tailored to specific industry processes. Cloud 9 Infosystems principals are Microsoft alumni with more than 29 years of collective experience. This, along with our global delivery capabilities, makes Cloud 9 Infosystems uniquely qualified to undertake any demanding cloud computing assignment. Cloud 9 Infosystems is a Microsoft Gold Partner in Cloud Platform, Data Analytics, Application Development, and Application Integration.\n<br><br>\nIf you aspire to learn, grow and excel and work for a company who invests in its people and resources and offer unlimited opportunities and best compensation packages in the industry, including offering benefits such as 401K, profit sharing, paid vacations, and floating holidays, then Cloud 9 Infosystems is the company for you.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nAs an intern on the Cloud Engineering team, you will work alongside talented engineers in a collaborative environment; you will enhance your engineering expertise while helping to seize cloud implementation opportunities.\n\n<ul>\n<li>Helping to support the implementation of cloud-based solutions throughout the organization.</li>\n<li>Offering technical support to cloud-based solutions end-users and stakeholders.</li>\n<li>Assisting with monitoring the performance of cloud applications and solutions, analyzing opportunities for improvement.</li>\n<li>you will have the opportunity to gain a strong understanding of Technology Services at Cloud 9.</li>\n<li>You’ll participate in critical projects, meet senior leaders, and enhance your technical skills as you position yourself as a possible candidate for our full-time development program.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Currently completing – master’s degree in computer science, CIS, Computer Engineering, Information Technology, or other technology-related degree.</li>\n<li>Minimum GPA of 3.0</li>\n<li>Exposure to cloud engineering via internships or coursework, which could include developing cloud solutions, cloud architecture, and cloud application design</li>\n<li>Demonstrated ability to operate in a team environment, strong interpersonal and communication skills</li>\n</ul>"
    },
    {
        "position": "Summer 2021 Intern - Software Engineer, MuleSoft",
        "company": "Salesforce",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-15T21:32:00.787Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=205&ao=133319&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_c7d4b947&cb=1608154133319&jobListingId=3687774285",
        "lastScraped": "2020-12-16T21:32:00.787Z",
        "description": "<p>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.</p><p></p><p></p><p></p><p></p><h2></h2><p>This is your time to shine. Our software engineering interns are considered full-time employees by their peers. In fact, you will be expected to contribute right away as a member of our Engineering teams for future releases. As the world leader in enterprise cloud computing, we release 3 new versions every year with close to 100 new features each release. You will write code that reaches millions of subscribers who use a number of our applications. Additionally, you will<u> </u>work on our automated testing infrastructure and craft the tools that provide real-time monitoring of our service. With such a quick turnaround, we don’t want our interns to sit on the sidelines and enjoy the view— we want you to change the way our customers connect their business to the world!<br><br>As a Futureforce intern, you will not only get to contribute to the meaningful work our teams are doing, but you will also have the opportunity to interact with senior executives and network with a number of employees at Salesforce. In addition to these impactful opportunities, ensuring that you get to participate in a number of events outside of your day-to-day duties is something that is top of mind for us. Throughout the summer, you will get to attend reoccurring “Lunch and Learns” where you will hear from a number of different representatives from the business about their career paths, attend events that take place outside of the office such as local Baseball games and finally, you will have the opportunity to give back to the community through a number of organized volunteer events. At Salesforce, we care deeply about the work that you do as an intern and additionally want to ensure that you are provided ample opportunities to create meaningful connections with other Salesforce employees as well as other students from across the country during your summer in the office.<br><br><b>Key Responsibilities:</b></p><ul><li>Work under the direction of software architects and senior developers on a project that you will get to present to other interns and Salesforce Developers</li><li>Work with your team members on timely and relevant projects that may be included in a future software release</li><li>Contribute to our suite of automated tests and testing infrastructure</li></ul><p><br><b>Required Skills:</b></p><ul><li>Enrolled and working towards obtaining a BS or MS in Computer Science or related field. Please note that in order to be eligible for an internship, we require that you be returning to school the following quarter/semester to work towards completing your degree</li><li>Must be attending a University in North America</li><li>Academic or professional/internship experience working in a professional coding setting is a plus</li><li>Understanding of object-oriented programming/design</li><li>Strong understanding of CS fundamentals and how to apply them to code</li><li>Understanding of algorithms and data structures and how to efficiently implement them into a solution</li><li>Ability to produce clear, efficient and concise code<br> </li></ul><p><b>Desired Skills:</b></p><ul><li>Team-player with the ability to work effectively and efficiently with others</li><li>Strong analytical and problem-solving skills</li><li>Commitment to putting quality first and delivering quality solutions</li><li>Be a self-starter and possess a strong sense of self-motivation</li><li>Ability to quickly learn new technologies</li><li>Coursework in SQL and relational database concepts</li><li>Strong competency in javascript and associated frameworks</li><li>Working knowledge of HTML and web technologies</li><li>General knowledge of front end and back end languages<br> </li></ul><p><b>About Futureforce University Recruiting</b><br>Our Futureforce University Recruiting program is dedicated to attracting, retaining and cultivating talent. Our interns and new graduates work on real projects that affect how our business runs, giving them the opportunity to make a tangible impact on the future of our company.<br><br>With offices all over the world, our recruits have the chance to collaborate and connect with fellow employees on a global scale. We offer job shadowing, mentorship programs, talent development courses, and much more.</p><p></p><p></p><p></p><p></p><p><b><b>Accommodations </b>- </b>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.</p><p></p><p></p><p></p><h2>Posting Statement</h2><p></p><p>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.</p><p></p><p><u>Salesforce.com</u> and <u>Salesforce.org</u> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. <u>Salesforce.com</u> and <u>Salesforce.org</u> do not accept unsolicited headhunter and agency resumes. <u>Salesforce.com</u> and <u>Salesforce.org</u> will not pay any third-party agency or company that does not have a signed agreement with <u>Salesfore.com</u> or Salesforce.org.</p><p></p><p>Salesforce welcomes all.</p><p></p><p></p><p></p>Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.<p></p><p></p>"
    },
    {
        "position": "Software Engineer Test Intern",
        "company": "Cboe Global Markets",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-15T21:32:03.568Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=206&ao=949479&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_61d43266&cb=1608154133319&jobListingId=3745269640",
        "lastScraped": "2020-12-16T21:32:03.568Z",
        "description": "<h2><strong>Job Description</strong></h2><br><br>Job Description\n<br><br>\nWe develop, automate and support continuously running tests for our real-time systems. We care deeply about system reliability, testability, recoverability and fault tolerance. Our QA engineers have a strong understanding of computer science fundamentals and software engineering. We are analytical thinkers. We are always learning our craft. If it’s broken, we fix it. If it needs refactoring, we refactor it. If it’s hard to test, we make it testable. We love automation. We are pragmatic. We ship code weekly. We’re looking for like-minded individuals to join us.\n<br><br>\nBe a member of the Cboe QA development team, working alongside our team of developers contributing tests for our new Index Platform and our Floor Trading environment. Become familiar with index calculation methodologies transforming data into industry known calculations. Learn Floor Trading concepts, applying this knowledge to develop a wide variety of test scenarios.\n<br><br>\nRequirements\n<ul>\n<li>Pursuing a Bachelor’s Degree in Computer Science or related field preferred.</li><li>Strong knowledge of data structures and algorithms.</li><li>Experience with Java and / or Python or experience in another language with a strong desire to learn Java or Python.</li><li>Comfortable with working in a Linux/Unix terminal and knowledge of at least one scripting language preferred.</li><li>Self-directed, self-motivated.</li>\n</ul>\n#LI-CM1\n<br><br>\nCboe Global Markets is an Equal Opportunity Employer. For more information, please click the following links:\n<br><br>\nEqual Employment Opportunity is The Law (in English)\n<br><br>\nEqual Employment Opportunity is The Law (in Spanish)\n<br><br>\nEqual Employment Opportunity is The Law (Supplement)\n<br><br>\nE-Verify Participation Poster (English &amp; Spanish)\n<br><br>\nRight to Work Poster (English)\n<br><br>\nRight to Work Poster (Spanish)"
    },
    {
        "position": "Engineering Intern",
        "company": "LogRhythm",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2020-12-15T21:32:06.369Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=207&ao=1006323&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_6328ca50&cb=1608154133319&jobListingId=3654170097",
        "lastScraped": "2020-12-16T21:32:06.369Z",
        "description": "<strong>Engineering Intern</strong>\n<br><br>\n<strong>About us;</strong>\n<br><br>\nLogRhythm, a Thoma Bravo company is a world leader in NextGen SIEM, empowering thousands of enterprises on six continents to successfully reduce cyber and operational risk by rapidly detecting, responding to and neutralizing damaging cyberthreats. LogRhythm's technology serves as the foundation for the world's most modern enterprise security operations centers (SOCs), helping customers measurably secure their cloud, physical, and virtual infrastructures for both IT and OT environments. Our culture fosters collaboration, innovation, integrity, mentorship, commitment to success, and fun. Our managers are dedicated to growing their people and offering an opportunity that allows you to make an impact in your career. Built for security professionals by security professionals, the LogRhythm NextGen SIEM Platform has won countless customer and industry accolades.\n<br><br>\n<strong>Who we are looking for;</strong>\n<br><br>\nLogRhythm is looking for Software Engineering Interns to work with our engineering teams in the exciting cyber security space. Interns will be part of agile development teams where they will have the opportunity to learn and work on meaningful projects. They will also have the opportunity to work with other interns, alumni of past intern programs, and other senior level employees as they continue to grow their knowledge and skills working in a professional environment. The full-time Intern program will last up to 12-weeks depending on student schedules. Interns will also have the opportunity to work part-time during the school year.\n<br><br>\nThe right person for this role will have a passion for technology development. They will also have an academic background in computer science or related field and have a passion for continued learning. Do you want to work for a great company in the exciting cyber security field? Does this sound like you? Are you a Junior, Senior, or will complete your sophomore year in the spring of 2021? If so, please submit your resume.\n<br><br>\n<strong>Here's an overview of the responsibilities &amp; challenges ahead;</strong>\n\n<ul>\n<li>Have the opportunity to use your academic learnings and experience to solve real world problems in software engineering and cyber security</li>\n<li>Work with an agile development team completing assigned user stories and participating in all agile ceremonies</li>\n<li>Work with other interns on a group project to select a business problem and present a solution</li>\n<li>Continue your learning journey by participating in book club with other interns</li>\n<li>Use tools to collaborate with others while working remotely due to the pandemic</li>\n</ul>\n<strong>Required Skills:</strong>\n\n<ul>\n<li>Pursuing a bachelor's degree in computer science or related field</li>\n<li>Experience with Java or Mac OS or Linux/Unix</li>\n<li>Experience developing User Interfaces and/or API's with an object-Oriented Language</li>\n<li>Track record of success working on group academic projects</li>\n\n<strong><li>Nice to have skills include:</li>\n\n</strong>\n\n\n<ul>\n<li>Development of Microservices</li>\n<li>CI/CD</li>\n<li>Machine Learning/Artificial Intelligence</li>\n<li>Data Visualization/Data Analysis</li></ul>\n\n\n</ul>\nWorkplace equality &amp; inclusion are not just words or topics for LogRhythm, they are part of our core values, beliefs, and integral to our company culture. We hire the best of the best and do not discriminate based on race, gender, age, religion, sexual orientation, identity, or other personal factors. LogRhythm was built on the principals of innovation, dedication, creativity, and commitment. It is through these key areas we were able to grow as an equal and inclusive workplace, one where our employees feel respected and safe in."
    },
    {
        "position": "2021 Intern - Software Engineer",
        "company": "Adobe",
        "location": {
            "city": "Lehi",
            "state": "UT"
        },
        "posted": "2020-12-15T21:32:10.158Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=208&ao=132917&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_5a26a2e7&cb=1608154133319&jobListingId=3715251500",
        "lastScraped": "2020-12-16T21:32:10.158Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Adobe Analytics platform processes 20+ billion transactions on a daily basis and delivers reporting data to customers throughout the world. The Adobe Customer Journey Analytics team is seeking a dedicated and passionate Software Engineer with top-notch technical, design, and development skills to join our Data Ingestion team in Lehi, Utah. In this role, you will collaborate closely with other engineers, developing and testing the next generation of reliable, high-performance, scalable solutions. You will have the opportunity to develop solutions handling Big Data for enterprise customers worldwide.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design, build, and maintain high-performance scalable solutions for customers processing Big Data.</li><li>Optimize and test existing software to enhance and improve performance, functionality, and usability.</li><li>Participate in all aspects of software development activities, including design, coding, code review, unit-testing, bug fixing, and operations.</li><li>Collaborate with product management and engineering to help define and implement requirements for backend services, components, and interfaces.</li><li>Participate in the development of features of large highly complex projects and apply knowledge to implement architectural and feature specs to drive customer success through the delivery of high-quality code.</li><li>Write complete functional specifications and documentation.</li><li>Estimate schedules, breaking tasks down to reasonable 1-3 day tasks.</li><li>Write, test, and document well-structured code against designs that scale and perform well for customers worldwide.</li><li>Identify outside technologies and know when to use them. Make recommendations for system and process improvement. Invest time and energy to improve skills and knowledge.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Bachelor’s or Master’s degree in computer science.</li><li>Experience in Java, C++, Scala, or equivalent preferred.</li><li>Understand multi-threaded design and implementation.</li><li>Experience with Linux, GIT</li><li>Ability to quickly learn and apply complex subjects and technologies.</li><li>Must be detail-oriented and demonstrate initiative and high self-motivation. Enthusiastic, creative, and positive attitude.</li><li>Excellent interpersonal skills. Excellent English verbal and written communication skills. Highly collaborative working style.</li>\n</ul>\n\nAdobe"
    },
    {
        "position": "2021 Intern - Data Science, Document Cloud",
        "company": "Adobe",
        "location": {
            "city": "Boston",
            "state": "MA"
        },
        "posted": "2020-12-15T21:32:13.406Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=209&ao=132917&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_a08c4098&cb=1608154133320&jobListingId=3715251492",
        "lastScraped": "2020-12-16T21:32:13.406Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\n<strong><u>The Challenge</u></strong>\n<br><br>\nThe Document Cloud Data Science team at Adobe is looking for a Data Science Intern. You will use machine learning and analytics to define new features, improve existing features, understand user behaviors, and personalize marketing practices. You will collaborate with the engineering, product, design, and marketing teams to devise and implement your data products and contribute to the growth of products such as Adobe Acrobat, Adobe Reader, Adobe Scan, and more. We’ll provide the support, mentorship, fun, and real-world experience needed to accelerate your learning and make a real impact on our product.\n<br><br>\n<strong><u>What You’ll Do</u></strong>\n<ul>\n<li>Develop end-to-end data products from creating pipelines to productizing machine learning models.</li><li>Investigate clickstream data to identify opportunities to improve user experiences.</li><li>Gather, synthesize and interpret disparate quantitative information sources, develop and present meaningful insights to key partners</li><li>Perform analysis to better understand customer behaviors including acquisition, engagement, conversion, and retention</li>\n</ul>\n<strong><u>What You Need to Succeed</u></strong>\n<ul>\n<li>Currently pursuing a degree in Computer Science, Engineering, Mathematics, Statistics or other quantitative fields.</li><li>Programming skills (Python or R, and SQL-like languages)</li><li>Strong foundation of statistics and machine learning knowledge, and a record of applying these methods to solving real-world problems.</li><li>Excellent communication, relationship skills, and a strong team player.</li>\n</ul>\n\nAdobe"
    },
    {
        "position": "Summer 2021 Intern - Software Engineer",
        "company": "Adobe",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-15T21:32:16.561Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=210&ao=132917&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_6ac98b19&cb=1608154133321&jobListingId=3715247432",
        "lastScraped": "2020-12-16T21:32:16.561Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nJoin us for this outstanding 12-week internship that offers personal and professional development, along with building a strong network of professionals in the field!\n<br><br>\nAs a Software Engineer Intern in the globalization engineering team, you will use the groundbreaking technologies that you are learning to solve problems for our international customers. You will work closely with your mentor and fellow engineers in one of the following areas using Machine Learning-based technology:\n<ul>\n<li>Audio and screen localization in tutorial videos.</li><li>Automatic layout truncation detection in localized software user interface.</li><li>Automatic font detection in the software user interface.</li><li>Improving an existing ML model to support multiple languages.</li>\n</ul>\n\n<h2>For this role we are searching for people with:</h2>\n\n<ul>\n<li>Currently pursuing a master's or bachelor’s degree in Computer Science, Computer Engineering or a related major.</li><li>Deep understanding of computer science fundamentals, algorithms, best practices, and logical skills.</li><li>Problem-solving skills, ability to dive deep into code to find the root cause of the problem.</li><li>Ability to research, learn and become proficient in new technologies.</li><li>Interested in software internationalization and localization, in supporting international customers by applying cutting edge technologies such as ML.</li><li>Experience or interest in developing web services or applications with the latest web development technology stacks.</li>\n</ul>\n\nAdobe"
    },
    {
        "position": "Software Developer Intern",
        "company": "Adobe",
        "location": {
            "city": "Seattle",
            "state": "WA"
        },
        "posted": "2020-12-15T21:32:19.422Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=211&ao=132917&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_642e729a&cb=1608154133321&jobListingId=3715247396",
        "lastScraped": "2020-12-16T21:32:19.422Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nAdobe Experience Platform – Content Services (AEP-CS) creates a shared foundation for Adobe customers’ content - enabling consistent experiences, cross-cloud workflows, data science, and accelerated time-to-value. Our core storage model is delivered as a multi-tenant SaaS content platform, targeted at storing a variety of content that our customers deal with (e.g. images, videos, documents, text, web pages, campaigns, blogs, tweets etc.). Our team provides a hypermedia API for accessing the emerging cloud storage for Adobe’s product line. We deploy this emerging cloud scale solution around the globe, on multiple different cloud infrastructures and provide millions of users access to petabytes of storage.\n<br><br>\nAs member of the ACP-CS team you will work with senior development engineers, quality assurance engineers and cloud service experts to help design, build, evolve and maintain the hosted services for the core storage model. You will have several opportunities to contribute to operations, validation and finally implementation of system functions.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Create dashboards, monitors and alerts</li><li>Test planning, development, execution and analysis</li><li>Feature development in Java</li>\n</ul>\n<strong>Skills</strong>\n<ul>\n<li>Programming in Java</li><li>Experience using Gatling test tools a plus</li><li>Experience running UNIX on AWS and/or Azure infrastructure</li><li>Knowledge of cloud systems and high-performance services architecture</li><li>Knowledge of graph databases like GraphDB or Neo4j.</li><li>Analytical mind with problem-solving aptitude</li><li>Excellent communication skills and ability to work in a collaborative manner.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Completing Junior year studies or greater towards BS/MS in Computer Science or related field</li><li>Preferred past internship or co-op experience.</li><li>Self-motivated problem-solver: a go-getter with a can-do attitude.</li>\n</ul>\n\nAdobe"
    },
    {
        "position": "Intern: Software Engineer",
        "company": "The Climate Corporation",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-14T21:32:22.673Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=212&ao=1141378&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_589158e4&cb=1608154133321&jobListingId=3715042559",
        "lastScraped": "2020-12-16T21:32:22.673Z",
        "description": "<strong>Position Overview:</strong>\n<br><br>\nThe Climate Corporation is looking for talented and motivated Computer Science or Engineering students with solid CS and Programming fundamentals for several of our engineering teams. Our software helps farmers around the world protect and improve their farming operations with uniquely powerful software and hardware products. You will work as a Software Engineering intern on a team in one of several areas. As a Software Engineering intern, you will be responsible for designing, building, testing and deploying new products and services in a fast-paced, iterative development environment.\n<br><br>\n<strong>What You Will Do:</strong>\n<ul>\n<li>Front-end/Web Applications - JavaScript and CSS development for our web applications. We leverage several leading edge JS frameworks (including React, D3, and more). You will work primarily on the Web Interfaces for these applications, which are used by farmers to manage and insure their farms and crops.</li><li>Back-end/Platform Services - Large-scale distributed services for applications and data management. We use a mix of Java, Ruby on Rails, Python and Clojure code. You will work primarily on the back-end services that power our web and mobile applications. These cloud based services are built on AWS infrastructure and are designed for 7x24 operation, with manageability, availability, reliability and scalability in mind.</li><li>Mobile - Phone and Tablet application development for both the iOS and Android platforms. The applications complement our Web Applications by providing unique mobile device specific capabilities and core functionality to improve farming and insurance operations.</li><li>Science - Large-scale distributed data services for scientific computing (we use Clojure)</li><li>Data Analytics- we work with big-data, and invest considerably in our analytics capabilities. You will work with Hadoop/Map Reduce, RDBMS and data visualization tools</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n<ul>\n<li>Enrolled in a degreed program in a technical or STEM related field during the duration of the internship program</li><li>Knowledge of an object oriented programming language</li><li>Knowledge of software engineering or server-side Internet technologies</li>\n</ul>\n<strong>\n<br>\nPreferred Qualifications:</strong>\n<ul>\n<li>Intellectual drive to learn anything</li><li>Great debugging and reasoning skills</li><li>Stellar academic record or equivalent work experience</li><li>Familiarity with command-line tools on a Unix shell</li><li>A desire to work on hard problems</li>\n</ul>\n<br><br>\n<strong>What We Offer:</strong>\n<br><br>\nOur environment is extremely engaging and fast-paced, with a diverse set of top engineers, agronomists, and statisticians working together to provide the best possible products and experiences for our customers.\n<br><br>\n<ul>\n<li>We offer competitive pay and perks.</li><li>We provide meals and a large assortment of snacks and drinks to get you through the day.</li><li>You’ll get 1:1 mentoring from a talented and motivated employee on your team.</li><li>You’ll have the opportunity to work on real projects with experienced employees and have a direct impact on the company. (Our internships are not summer camp!)</li><li>You’ll have the amazing opportunity to participate in one of our Biotechnology Tours where you get out of the office and into the field (literally) with agents and farmers.</li><li>You’ll work in an award winning office with smart designs, large common areas and open floor plans that fuel collaboration.</li><li>You’ll attend various company sponsored events, activities and off-sites - we make sure interns are having fun!</li><li>We regularly host meet-up groups and tech-talks and encourage participation in relevant workshops and conferences</li><li>You’ll have the opportunity to interact with key executives and leadership.</li>\n</ul>\n<br><br>\nWe also hinge our cultural DNA on these five values:\n<br><br>\n<ul>\n<li>Inspire one another</li><li>Innovate in all we do</li><li>Leave a mark on the world</li><li>Find the possible in the impossible</li><li>Be direct and transparent</li>\n</ul>\n<br><br>\nLearn more about our team and our mission:\n<br><br>\nThe Climate Corporation - The Technology Behind Making A Difference\n<br><br>\nhttps://youtu.be/c5TgbpE9UBI or visit https://climate.com/careers\n<br><br>\nClimate aims to create a welcoming and collaborative environment for our employees in which a diverse set of perspectives and voices are represented and celebrated.\n<br><br>\nAs part of our dedication to the diversity of our workforce, The Climate Corporation is committed to Equal Employment Opportunity and does not discriminate based on race, religion, color, national origin, ethnicity, gender, sex (including pregnancy), protected veteran status, age, disability, sexual orientation, gender identity, gender expression, or any unlawful criterion existing under applicable federal, state, or local laws. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@climate.com."
    },
    {
        "position": "Intern",
        "company": "Neustar",
        "location": {
            "city": "Rochester",
            "state": "NY"
        },
        "posted": "2020-12-14T21:32:25.772Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=213&ao=1141919&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_69ddd1d4&cb=1608154133321&jobListingId=3770520737",
        "lastScraped": "2020-12-16T21:32:25.772Z",
        "description": "Neustar is an information services and technology company and a leader in identity resolution providing the data and technology that enables trusted connections between companies and people at the moments that matter most. More information is available at https://www.home.neustar.\n<br><br>\n<strong>Job Requisition:</strong><br><br>R-3311 Intern (Open)<br><br><strong>Primary Location:</strong><br><br>ROCHESTER<br><br><strong>Job Description:</strong>\n<br><br>\n<strong>Who are we?</strong>\n<br><br>\nAs a company built on the foundation of Privacy by Design, for more than 20 years Neustar’s unique capabilities have made us the leader in the field of responsible identity resolution. Neustar enables trusted connections between companies and people at the moments that matter the most, with world-class and industry leading solutions in Marketing, Risk, Communications, Security and Registry services.\n<br><br>\nThe engineer in this role will be responsible for working as part of a team of Neustar engineers to build and test this a customer facing user interface.\n<br><br>\n<strong>Job Duties</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Build UI to interface with existing service APIs</li><li>Interact with other team members (Engineers, QA, Product Managers)</li><li>Generate unit and integration tests</li>\n</ul>\n<strong>Required Experience and Qualifications:</strong>\n<br><br>\n· In degree program for Computer Science, Software Engineering, or related field\n<br>\n· React/Redux/Saga\n<br>\n· Ability to work in a Linux environment\n<br>\n· Self-motivated and detail-oriented\n<br>\n· Strong analytical and problem-solving skills\n<br><br>\n<strong>Preferred Experience and Qualifications:</strong>\n<br><br>\n· JavaScript\n<br>\n· Scripting languages (Bash, Perl, Python, etc.)\n<br>\n· Git\n<br><br>\n<strong>Qualifications/Education</strong>\n<br><br>\nWorking toward a BS in Computer Science or related field. Candidate is preferably nearing graduation and has prior work experience in Software Engineering.\n<br><br>\nAt Neustar, we are committed to the growth and development of our employees whose individual skills, curiosity and passion for their work, contribute to the overall success of our business. Our core values (Accountability, Collaboration, Transparency, Resilience, and Respect) are the driving force of our culture across our locations around the globe. We offer our employees a comprehensive benefits package including perks such as tuition reimbursement, awesome company discounts, back-up day care, community service events, pet and baby swag and much more! We are all learning and creating together; and having some major fun along the way.\n<br><br>\nJOIN US! We can’t wait to meet you!\n<br><br>\n<strong>Neustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.</strong>\n<br><br>\n<strong>DIVERSITY</strong>\n<br>\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n<br><br>\n<strong>EOE of Minorities/Females/Vets/Disability</strong>\n<br>\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws."
    },
    {
        "position": "Technical Site Intern at Tiger Institute",
        "company": "Cerner Corporation",
        "location": {
            "city": "Columbia",
            "state": "MO"
        },
        "posted": "2020-12-14T21:32:28.960Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=214&ao=1044074&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_4ee02b0d&cb=1608154133322&jobListingId=3770508454",
        "lastScraped": "2020-12-16T21:32:28.960Z",
        "description": "<div></div><div><div><div><div><p>Reap big benefits as a Technical Site Intern at the Tiger Institute! During your internship, you will gain insights into Cerner’s system and/or software engineering methodology and will begin real project work immediately. Work alongside experts to acquire the knowledge and skills to prepare you for a long-term, meaningful career.<br>\n<br>\nAs a systems-focused intern, you’ll work with your team to design, install, implement, and support technology infrastructures capable of managing and protecting the health and financial information from around the world. You may also take part in the design and implementation of data interfaces and the installation of non-Cerner information systems. Finally, you will build and enhance skillsets to enhance your technical expertise with ongoing opportunities to be mentored by your fellow associates.\n</p></div></div>Back to Description\n</div><p></p><div><div><div><div><div><h2><b>Cerner Jobs and Careers</b></h2><br>\n<p></p><div><p>\n</p></div></div></div><h2><b>Students &amp; Graduates</b></h2>\n<p></p>\n</div><div><h2><b>Qualifications</b></h2>\n<p><b>Basic Qualifications</b><br>\n</p><ul><li>Actively pursuing a Bachelor's degree in Computer Science, Information Systems, Engineering, Computer Information Systems, or Management Information Systems; or related field with a minimum 2.8 cumulative GPA</li><li>\nEnrolled in a minimum of nine (9) credit hours per semester</li></ul>\n<br>\n<b>Expectations</b><br>\n<ul><li>Must reside in the Columbia, MO metropolitan area</li><li>\nAbility to work 10-15 hours per week during school year and 40 hours per week during summer (May-August)</li></ul>\n</div><div><h2><b>Additional Information</b></h2>\n<p>\nApplicants for U.S. based positions with Cerner Corporation must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.<br>\n<br>\nSome Cerner positions may be obligated to comply with client-facing requirements and occupational health requests, including but not limited to, an immunization set, an annual flu shot, an annual TB screen, an updated background check, and/or an updated drug screen.</p>\n<h5><b>Relocation Assistance Available for this Job:</b></h5>\n<p>No</p>\n<h5><b>Virtual Eligible Job</b></h5>\n<p>No</p>\n</div><div><p>Cerner is a place where people are encouraged to innovate with confidence and focus on what is important – people’s health and the care they receive. We are transforming health care by developing tools and technologies that make it more efficient for care providers and patients to navigate the complexity of our health. From single offices to entire countries, Cerner solutions are licensed at more than 25,000 facilities in over 35 countries.<br>\n<br>\nCerner’s policy is to provide equal opportunity to all people without regard to race, color, religion, national origin, ancestry, marital status, veteran status, age, disability, pregnancy, genetic information, citizenship status, sex, sexual orientation, gender identity or any other legally protected category. Cerner is proud to be a drug-free workplace.</p></div></div></div></div><div></div>"
    },
    {
        "position": "Research Intern, Bachelors, Summer",
        "company": "Google",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-14T21:32:32.076Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=215&ao=37049&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_9d1ed5be&cb=1608154133322&jobListingId=3687276833",
        "lastScraped": "2020-12-16T21:32:32.076Z",
        "description": "<strong>Participation in the internship program requires that you are located in the United States for the duration of the internship program.</strong>\n<br><br>\nThis internship is intended for students who are pursuing a Bachelor's degree with an anticipated graduation date on or after December 2021, depending on their program and unique circumstances.\n<br><br>\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n\n<ul>\n<li>1. In the “Resume Section:” attach an updated CV or resume.</li>\n\n<ul>\n<li>Ensure any proficiency in coding languages are listed on resume.</li>\n</ul>\n\n<li>2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.</li>\n\n<ul>\n<li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul>\n</ul>\n\nNote: By applying to this position your application is automatically submitted to the following locations: <strong>Mountain View, CA, USA; Ann Arbor, MI, USA; Austin, TX, USA; Boulder, CO, USA; Cambridge, MA, USA; Chapel Hill, NC, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Princeton, NJ, USA; Portland, OR, USA; Pittsburgh, PA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA; Washington, DC, USA</strong><br><br>Minimum qualifications:\n\n<ul>\n<li>Currently enrolled in a Bachelor's degree in Computer Science, Linguistics, Statistics, Biostatistics, Applied Mathematics, Operations Research, Economics, Natural Sciences or a related technical field.</li>\n<li>Experience in one or more areas of computer science, such as Natural Language Understanding, Neural Networks, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Quantum Information Science, Data Science, Privacy, Trust &amp; Safety, Software Engineering or similar.</li>\n<li>Experience with one or more general purpose programming languages including: C/C++, Java, MATLAB, Go, Python or similar.</li>\n</ul>\nPreferred qualifications:\n\n<ul>\n<li>Available to work full time for a minimum of 12 weeks outside of university term time and returning to a degree program after completion of the internship.</li>\n<li>Contribution to research communities or efforts, including publishing papers in major conferences or journals.</li>\n<li>Relevant work experience, including internships, full time industry experience or as a researcher in a lab.</li>\n<li>Ability to design and execute a research agenda.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul>\n\n<div><h2>About the job</h2><br><br>Join us for a 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. Research happens across Google everyday, in many different teams. Our research has already impacted user-facing services across Google including Search, Maps and Google Now, and is central to the success of Google Cloud and our planet-scale computing, storage, and networking infrastructure.\n<br><br>\nResearch Interns aren't cloistered in the lab, but instead they work closely with Software Engineers to discover, invent, and build at the largest scale. Ideas may come from internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. From creating experiments and prototyping implementations to designing new architectures, Research Interns and Software Engineers work on challenges in artificial intelligence, machine perception, data mining, machine learning, natural language understanding, privacy, computer architecture, networking, operating systems, storage and data management, and much more. As a Research Intern, you will work on a specific project critical to Google’s needs. You might also stay connected to your research roots as a contributor to the wider research community by publishing papers.\n<br><br>\nThere is always more information out there, and our research teams have a quest to find new ways to make it accessible and useful. We're constantly refining our signature search engine to provide better results, expanding the scope and utility of our data-analytics systems, enhancing our Cloud applications and infrastructure, among a broad range of other Google products.\n<br><br>\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</div><div><h2>Responsibilities</h2>\n\n\n<ul>\n<li>Participate in cutting edge research to develop solutions for real-world, large-scale problems.</li>\n</ul>\n\n</div>\n<br>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing this form."
    },
    {
        "position": "Intern, Software Engineering (Summer 2021) - Location Flexible",
        "company": "Dropbox",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-14T21:32:34.815Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=216&ao=4120&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_f84f9ba6&cb=1608154133323&jobListingId=3744368844",
        "lastScraped": "2020-12-16T21:32:34.815Z",
        "description": "<div>\n<div>\n<h1>Intern, Software Engineering (Summer 2021) - Location Flexible</h1>\n<br><br>\n<h2>\n<br>\n San Francisco, CA; Remote - US</h2>\n</div><br>\n\n<div>\n<h2>Company Description</h2><br><br><strong>Dropbox is now a Virtual First company, which means work outside of an office will be the primary experience for all employees. Being Virtual First also means the location of our employees is targeted but flexible. If “Location Flexible” is listed in the job title of a role, the role can be located in any of the states where Dropbox is authorized to do business.** Some roles (including those which do not have “Location Flexible” in the job title), however, may have to be co-located with their teams in certain locations. Please work with your recruiter and your hiring manager to understand any location constraints of a particular role and to communicate your location preferences. \n\n\n</strong><ul><strong>\n</strong><li><strong>*Dropbox is authorized to do business in many, but not all, states. If you are not located in or able to work from a state where Dropbox is registered, you will not be eligible for employment. Please speak with your recruiter to learn more about where Dropbox is registered.</strong> </li>\n</ul>\n\nDropbox is one place to keep life organized and keep work moving. With more than 600 million registered users across 180 countries, we’re on a mission to design a more enlightened way of working. Dropbox is headquartered in San Francisco, CA, and has offices around the world. For more information on our mission and products, visit dropbox.com.<br><br><h2>Team Description</h2><br><br>New graduates and interns at Dropbox work alongside industry leaders, architecting the growing family of products that handle over a billion files a day for people and businesses around the world. From day one, you’ll have the responsibility and the support you need to make a difference on a massive scale.<br>\n<div>\n<h2><strong>Role</strong> <strong>Description</strong></h2></div><br>\n\n<div>The Dropbox internship program is a top-notch learning experience for engineering students from all backgrounds. You are paired with a dedicated mentor who is committed to your success throughout your 12-week internship. You can expect to have ownership of your project, collaborate with full-time engineers, and receive consistent and effective feedback. Our goal is to create a robust and impactful learning experience. Additionally you will connect with fellow interns, establish mentors, collaborate with other Dropboxers, and build the foundation of a strong professional network. We will work to accommodate your school end and start dates but this internship has a minimum of a twelve (12) week duration over the summer.</div>\n<br>\n<div>\n<h2><strong>Responsibilities</strong></h2></div><br>\n\n<div><strong>As an intern, you will go toe-to-toe with Dropbox engineers. We offer numerous types of roles and teams that you can have an impact on. Here are some of the things you may do:</strong></div><ul><li><strong>Application</strong> <strong>Engineering</strong>- You will build delightful full-stack user experiences that tackle real customer needs and help drive tons of revenue for Dropbox. As a product engineering intern you can expect to work across backend, API, desktop, mobile and web.</li><li><strong>Infrastructure Engineering</strong>- Craft the building blocks that let us scale Dropbox to handle millions of concurrent connections, hundreds of billions of files and hundreds of petabytes of data.</li><li><strong>Analytics</strong> <strong>Engineering</strong>- Measure, optimize, and build one of the industry’s most advanced analytics platforms to derive meanings from vast amounts of data. Our massive scale means you’ll work with more data than many other analytics firms combined.</li><li><strong>Mobile</strong> <strong>Engineering</strong>- You are an Objective-C, Swift, Java and C++ magician - this team knows the ins and outs of iOS and Android SDK and will help you weave and bend the API’s to craft the Dropbox client experience on mobile devices. You are also responsible for building the backend systems that power the mobile experiences and optimize the protocol between client and server for reliability, efficiency and speed.</li><li><strong>Front End Engineering</strong>- You will work collaboratively to help keep our websites up and running - Dropbox.com and paper.dropbox.com! In addition to everything application engineers do but you are also deeply interested in building a fast, scalable, and responsive Dropbox experience for the modern web, using cutting-edge technologies like Typescript, React, and Redux.</li><li><strong>Site</strong> <strong>Reliability</strong> <strong>Engineering</strong> <strong>(SRE)</strong>- This team lives dangerously on the boundary of software and hardware - they have a deep understanding of the inner workings of our product and are committed to ensuring our products work well on real-world hardware in our data centers. You will build the software and automation that controls the hardware that runs our products, and serve as the first line of defense when something goes with our production infrastructure or services.</li><li><strong>Security</strong> <strong>Engineering</strong>- People trust Dropbox to keep their data secure, and at Dropbox we rely on our security engineers to make our products safe. You are a software engineer with a deep interest in building software that is secure yet easy to use. A passion for the shadowy computer underworld is a definite plus. Security engineers collaborate with product teams to secure our software, production infrastructure, website, desktop and mobile apps and our corporate infrastructure and devices.</li>\n</ul>\n\n<div>\n<h2>Minimum Qualifications</h2></div>\n\n<ul>\n<li>Currently pursuing a BS (or higher, e.g., MS, or PhD) in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience</li>\n</ul>\n\n<div>\n<h2>Preferred Qualifications</h2></div>\n\n<ul>\n<li>Experience writing or shipping software as part of internships, personal projects, coding competitions or research and the work we do at Dropbox resonates with you, we would love to learn more about you!</li><li>Students with a passion to learn, problem solve, and challenge the status quo</li>\n</ul>\n\n<h2>Benefits and Perks</h2>\n\n<ul>\n<li>Dedicated Mentorship</li><li>Market competitive salary</li><li>Intern Hack Week</li><li>Housing stipend</li> <li>Employee Resource Groups</li>\n</ul>\n\nDropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, Latinx, Pridebox (LGBTQ), Vets at Dropbox, Women at Dropbox, ATX Diversity (based in Austin, Texas) and the Dropbox Empowerment Network (based in Dublin, Ireland).</div><br>\n\n<div>\n</div>\n</div>\n\n<br>Dropbox."
    },
    {
        "position": "IT Data Engineer Intern - Summer",
        "company": "RLI",
        "location": {
            "city": "Peoria",
            "state": "IL"
        },
        "posted": "2020-12-14T21:32:37.593Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=217&ao=1073687&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_87910e9d&cb=1608154133323&jobListingId=3687135900",
        "lastScraped": "2020-12-16T21:32:37.593Z",
        "description": "<h2>At RLI, we're always looking to hire and develop tomorrow's leaders. Internships at RLI are designed to provide college students the opportunity to gain hands on experience working on challenging projects to allow you to:</h2><h2>· Gain real-world job experience and training</h2><h2>· Impact our business with meaningful projects and assignments</h2><h2>· Build relationships through planned education and social activities</h2><h2>RLI is looking for a Data Engineer intern to work in our Information Technology department for Summer 2021. This position will be in our Peoria, IL Home Office, and hours over the summer are full-time (8:30-5, M-F).</h2><h1><strong><u>Position Purpose</u></strong></h1><h3>As a Data Engineer, the intern would have a variety of potential jobs available based on a candidate’s background experience and expertise. Duties would entail working in a team setting in order to design, implement and test web-based solutions, utilizing RLI’s technology fabric and Microsoft .Net technologies. Candidate would gain exposure to best practice Enterprise patterns for application architecture and systems integration. The project that the intern will be assigned to will be based on 2021 planning and what the current priority of project work is during the intern period. Some examples include: • Data: Create, enhance and support data services, ETL processes and reports for Enterprise Data. Document services, models, processes and policies. Modernize data warehouse architecture and visualization capability. Retire legacy artifacts and process. IT would place more than one student in this position if multiple qualified candidates are found.</h3><h1><strong><u><strong>Principal Duties &amp; Responsibilities</strong></u></strong></h1>\n\n<ul>\n<li><h3>Solid understanding of foundational knowledge appropriate for a developer: object-oriented programming, database management systems, etc.</h3> </li><li><h3>Additional knowledge specific to RLI’s technology is a plus, for example, specific .Net experience and web-based development.</h3></li><li><h3>Demonstrated success in a classroom setting, natural curiosity and desire to learn.</h3> </li><li><h3>Excellent communication skills, ability to work in a team Complete project-based assignments as assigned.</h3></li><li><h3>Work closely with experienced professionals, colleagues, and fellow interns to gain knowledge and develop team-building skills.</h3></li><li><h3>Attend planned education and social activities in order to gain an understanding of the RLI business as well as network.</h3></li>\n</ul>\n\n<h1><strong><strong><u>Education &amp; Experience</u></strong></strong></h1>\n\n<ul>\n<li><h3>Preferred Majors: Computer Science; Management Information Systems; Computer Information Systems; or related discipline.</h3></li><li><h3>Minimum 3.0 GAP require.</h3></li>\n</ul>\n\n<h1><strong><strong><u><strong>Knowledge, Skills, &amp; Competencies</strong></u></strong></strong></h1>\n\n<ul>\n<li><h3>Demonstrates excellent writing and grammar skills.</h3></li><li><h3>Is self-motivated and highly organized.</h3></li><li><h3>Has the ability to multi-task and meet quick deadlines.</h3></li><li><h3>Is creative, flexible and has a results-oriented work ethic and attitude.</h3></li><li><h3>Thrives in team environments.</h3></li>\n</ul>"
    },
    {
        "position": "IT Software Engineer Intern - Summer",
        "company": "RLI",
        "location": {
            "city": "Peoria",
            "state": "IL"
        },
        "posted": "2020-12-14T21:32:40.149Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=218&ao=1011591&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_8f99859a&cb=1608154133323&jobListingId=3687135878",
        "lastScraped": "2020-12-16T21:32:40.149Z",
        "description": "<h2>At RLI, we're always looking to hire and develop tomorrow's leaders. Internships at RLI are designed to provide college students the opportunity to gain hands on experience working on challenging projects to allow you to:</h2>\n\n<ul>\n<li><h2>Gain real-world job experience and training</h2></li><li><h2>Impact our business with meaningful projects and assignments</h2></li><li><h2>Build relationships through planned education and social activities</h2></li>\n</ul>\n\n<h2>RLI is looking for a Software Engineer intern to work in our Information Technology department for Summer 2021. This position will be in our Peoria, IL Home Office, and hours over the summer are full-time (8:30-5, M-F).</h2> <h1><strong><u>Position Purpose</u></strong></h1><h3>As a Software Developer, the intern would have a variety of potential jobs available based on a candidate’s background experience and expertise.</h3><h3>Duties would entail working in a team setting in order to design, implement and test web-based solutions, utilizing RLI’s technology fabric and Microsoft .Net technologies.</h3><h1><strong><u><strong>Principal Duties &amp; Responsibilities</strong></u></strong></h1>\n\n<ul>\n<li><h3>Solid understanding of foundational knowledge appropriate for a developer: object-oriented programming, database management systems, etc.</h3> </li><li><h3>Additional knowledge specific to RLI’s technology is a plus, for example, specific .Net experience and web-based development.</h3></li><li><h3>Demonstrated success in a classroom setting, natural curiosity and desire to learn.</h3></li><li><h3>Excellent communication skills, ability to work in a team Complete project-based assignments as assigned.</h3></li><li><h3>Work closely with experienced professionals, colleagues, and fellow interns to gain knowledge and develop team-building skills.</h3></li><li><h3>Attend planned education and social activities in order to gain an understanding of the RLI business as well as network.</h3></li>\n</ul>\n\n<h1><strong><strong><u>Education &amp; Experience</u></strong></strong></h1><h3>Preferred Majors:</h3><div><div><div><div>\n\n<ul>\n<li>Computer Science; Management Information Systems; Computer Information Systems; or related discipline.</li><li>Minimum 3.0 GPA required.</li></ul></div>\n</div></div></div><h1><strong><strong><u><strong>Knowledge, Skills, &amp; Competencies</strong></u></strong></strong></h1>\n\n<ul>\n<li>Demonstrates excellent writing and grammar skills;</li><li>Is self-motivated and highly organized</li><li>Has the ability to multi-task and meet quick deadlines.</li><li>Is creative, flexible and has a results-oriented work ethic and attitude</li><li>Thrives in team environments</li>\n</ul>"
    },
    {
        "position": "Intern – Software Development/Computer Science",
        "company": "CCAM",
        "location": {
            "city": "Prince George",
            "state": "VA"
        },
        "posted": "2020-12-14T21:32:43.287Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=219&ao=4120&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_5037f67a&cb=1608154133324&jobListingId=3487135465",
        "lastScraped": "2020-12-16T21:32:43.287Z",
        "description": "<div><div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div><strong>CANDIDATE QUALIFICATIONS:</strong>\n\n<ul>\n<li>Degree program or area of focus: computer engineering, electrical engineering, computer science</li>\n<li>At a minimum, the candidate must have partially completed a scientific or engineering degree (at least two years of academic credit) and must be a student or recent graduate of a CCAM member university</li>\n<li>Senior/rising senior is preferred</li>\n\n<strong></strong><li><strong>Skills:</strong>\n\n\n<ul>\n<li>Embedded systems, Raspberry PI, Arduino.</li>\n<li>C/C++, Python, C#, Labview, Matlab.</li>\n<li>Visual Studio</li>\n<li>Familiar with Windows and Linux Operating Systems</li>\n<li>PWM, TCP/IP, UDP, SPI, I2C</li>\n<li>Low-voltage electronics</li>\n</ul>\n\n</li>\n<li>This position requires access to technology or intellectual property that is subject to export control requirements. Candidates must be qualified for such access without an export control license.</li>\n</ul>\nThe <strong>Software Development / Computer Science Intern</strong> will support CCAM’s research programs, helping to ensure that they are delivered on time and on budget to a high standard of quality. In this position you may develop software for embedded systems, and industrial controllers, create communication interfaces and adapters for machines and robots.\n<br><br>\nThe Commonwealth Center for Advanced Manufacturing (CCAM), located in Prince George County, Virginia, is a leader in the development of advanced manufacturing solutions. CCAM is the center of an ecosystem where academia, government, and industry partner together to create real economic value. CCAM plays an active role in the development of a talented manufacturing workforce providing a substantial and diverse educational pathway.\n<br><br>\nThe Commonwealth Center for Advanced Manufacturing is looking for interns who are intrigued by its mission and who desire to make contributions to programs and teams focused on high-technology manufacturing activities and high-value manufacturing systems. This will require the interns to have:\n\n<ul>\n<li>A genuine enthusiasm for the development and application of scientific principles, engineering methods, and technology to manufacturing in industry</li>\n<li>The ability to quickly grasp key concepts needed to attack difficult engineering and manufacturing problems</li>\n<li>A positive, team-first attitude</li>\n<li>The ability to work independently towards an established goal without continuous oversight or assistance</li>\n</ul>\nThe CCAM Intern Program runs concurrently with the semester schedule of our member universities. Openings will be available for a minimum of 12 – 14-week term at CCAM’s research center during fall, spring or summer academic semesters. Fall and Spring interns may work 25 – 40 hours per week (must be available for a minimum of 25 hours per week). Summer interns work 40 hours per week. Currently, CCAM only accepts applicants either attending or recently graduated from CCAM’s member universities.\n<br><br>\n<strong>APPLICATION</strong>\n<br><br>\nTo apply, send a cover letter and resume to myinternship@ccam-va.com<u>.</u> The subject line should reference the position the applicant is applying for. For further information, please visit the CCAM website at http://www.ccam-va.com/.\n<br><br>\nThe Commonwealth Center for Advanced Manufacturing is an Equal Opportunity Employer.</div>\n\t</div>\n</div>\n\t</div>\n</div>\n\t</div>\n </div>\n\t</div>\n</div>\n<br>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Cvent",
        "location": {
            "city": "Lexington",
            "state": "MA"
        },
        "posted": "2020-12-14T21:32:46.610Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=220&ao=4347&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_ee8f8c83&cb=1608154133324&jobListingId=3686936306",
        "lastScraped": "2020-12-16T21:32:46.610Z",
        "description": "<strong>What You Will Be Doing</strong>\n<br><br>\nAt Cvent, our paid technology internships are designed to provide students with real-world mentorship and experience. Interns are exposed to the inner workings of an industry-leading software company and are expected to take ownership of projects to contribute to the company’s continued success. Projects are assigned based on current production schedules and operation’s needs, allowing for extensive exposure to the components and cycles of the technology department. Cvent’s internships are ideally structured to not only support professional development, but also open the doors to full time employment with the company upon graduation.\n\n<ul>\n\n <li>Work on large scale, cloud-based applications, where performance, reliability, and scalability are critical design goals</li>\n\n<li>Gain experience with different database technologies, ranging from traditional relational to the latest NoSQL products.</li>\n\n<li>Work in a collaborative, team-based environment in an Agile environment</li>\n\n<li>Identify and resolve issues related to customer experience</li>\n\n<li>Analyze the functionality of our web-based software platforms, mobile devices, and backend systems</li>\n</ul>\n<strong>What You Need for this Position</strong>\n\n<ul>\n\n <li>Rising Senior graduating in December 2021 or May 2022</li> \n\n<li>Pursuing bachelor’s degree in computer science or other technology related field</li>\n\n<li>GPA of 3.0 or higher</li>\n\n<li>The desire to make contributions to the company that will be used by current and future full-time employees</li>\n\n<li>Excellent problem solving and analytical skills</li>\n\n<li>Outstanding oral and written communication</li>\n\n<li>The ability and willingness to work alongside senior team members and managers to further your professional development</li>\n</ul>\nMost importantly, a successful candidate will be passionate about technology. Keeping up with the latest advancements in the industry; spending time creating, building, and exploring with technical projects; an inquisitive attitude in regard to the workings of hardware and software; and overall, simply having fun and finding enjoyment in the field.\n<br><br>\nAt Cvent we celebrate, support and are committed to creating a diverse and inclusive environment.We’re proud to be an equal opportunity employer.All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status or any other legally protected characteristics.\n<br><br>\nCvent maintains a drug-free workplace."
    },
    {
        "position": "Summer 2021 Computer Science & Data Science Internship",
        "company": "Ericsson",
        "location": {
            "city": "Plano",
            "state": "TX"
        },
        "posted": "2020-12-14T21:32:49.809Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=221&ao=1136006&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_f61435a6&cb=1608154133325&jobListingId=3744026457",
        "lastScraped": "2020-12-16T21:32:49.809Z",
        "description": "<div><p><b>Location: Multiple locations across United States</b></p><p></p><br>\n<p>\nAs the tech firm that created the mobile world, and with more than 54,000 patents to our name, we’ve made it our business to make a mark. When joining our team at Ericsson you are empowered to <b>learn, lead and perform at your best</b>, shaping the future of technology. This is a place where you're welcomed as your own perfectly unique self, and celebrated for the skills, talent, and perspective you bring to the team. Come, and be where it begins.</p><p></p><br>\n<p><b>\nIn our exciting opportunities as an intern, you will enjoy:</b></p><ul><li>\n1:1 Mentorship\n</li><li>Intern Specific Events &amp; Projects\n</li><li>Career Development</li><li>\nPeer &amp; Senior Level Networking\n</li><li>Participation in Employee Resource Groups</li></ul><p></p><br>\n<p><b>\nIn our internship roles you will need:</b></p><ul><li>\n3.0+ GPA\n</li><li>Currently pursuing an undergraduate, Master’s, or PhD on a full-time basis at a 4-year college or university\n</li><li>Be available to work 40 hours per week during the summer\n</li><li>Have at least 1 semester left (post-internship)\n</li><li>Major, experience, or demonstrable interest in the position you apply for</li></ul><p></p><br>\n<p><b>\nWe have several positions that fall under our Computer Science &amp; Data Science Internship, we are looking for competencies that include:</b></p><ul><li>\nComputer Science, Statistics, Economics, Mathematics, Data Science, or similar quantitative discipline</li><li>\nCoding skills (such as Python, R, Java, or Scala)</li><li>\nAnalytics tools experience (such as Pandas, R, SPSS, SQL, or Hadoop)</li><li>\nExperience performing analysis with large datasets</li><li>\nExcellent communication as well as intercultural skills</li><li>\nOpen-minded and motivated to work in multicultural team</li><li>\nStrong analytical and organizational skills</li><li>\nStrong customer service orientation</li></ul><p></p><br>\n<p><b>\nThe ideal Computer Science &amp; Data Science interns should:\n</b></p><ul><li>Be enthusiastic solution finders astute in the latest technologies, but with the non-technical savvy to be a valued and respected part of their team.\n</li><li>We are looking for undergrad, Master's, MBA, and PhD students.<br>\n</li></ul><p></p><p><b>Hiring Process</b></p><p>\nOur dedicated team of University Recruiters accept applications from September through April. Most of our positions are filled during the Fall semester though, so we strongly encourage students to apply early.\n</p><p>Our hiring process is as follows:</p><ul><li>\nApply online (Sept-April)</li><li>\nIf selected: A recruiter contacts you via email or phone\n</li><li>If selected: Hiring manager interview\n</li><li>If selected: Offer extended</li><li>\nStart Internship (May or June)</li></ul><p></p><br>\n<p><b>\nWhat´s in it for you?</b></p><p>\nHere at Ericsson, our culture is built on over a century of courageous decisions. With us, you will no longer be dreaming of what the future holds – you will be redefining it. You won’t develop for the status quo but will build what replaces it. Joining us is a way to move your career in any direction you want; with hundreds of career opportunities in locations all over the world, in a place where co-creation and collaboration are embedded into the walls. You will find yourself in a speak-up environment where empathy and humanness serve as cornerstones for how we work, and where work-life balance is a priority. Welcome to an inclusive, global company where your opportunity to make an impact is endless.<br>\n </p><p></p><p><b>Are you in?</b></p><p></p><br>\n<p>\nDo you believe that an organization fostering an environment of cooperation and collaboration to execute with speed creates better business value? Do you value a culture of humanness, where fact based decisions are important and our people are encouraged to speak up? Do you believe that diverse, inclusive teams drive performance and innovation? At Ericsson, we do.</p><p></p><br>\n<p>\nDISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Therefore employees assigned may be required to perform additional job tasks required by the manager.</p><div></div><br>\n<div>\nWe are proud to be an EEO/AA employer M/F/Disabled/Veterans. We maintain a drug-free workplace and perform pre-employment substance abuse testing.</div><div></div><br>\n<div>\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetics information. Ericsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.</div><div></div><br>\n<div>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.</div><div></div><br>\n<div>\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetic information.</div><div></div><br>\n<div>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) consistent with Ericsson’s legal duty to furnish information.</div><div></div><br>\n<div>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) Employee Polygraph Protection Act Notice - Employers are generally prohibited from requiring or requesting any employee or job applicant to take a lie detector test, and from discharging, disciplining, or discriminating against an employee or prospective employee for refusing to take a test or for exercising other rights under the Act. For more information, visit https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf.consistent with Ericsson’s legal duty to furnish information.</div><div></div><br>\n<div>\nEricsson is an equal opportunity employer and is committed to providing reasonable accommodation for qualified disabled individuals during the application and hiring process. Ericsson will make modifications or adjustments to the job application or interview process that will enable a qualified applicant to be considered for a position. If you require an accommodation due to a disability, please contact Ericsson at hr.direct.dallas@ericsson.com or (866) 374-2272 (US) or (877) 338-9966 (Canada) for further assistance.</div><div></div><br>\n<div>\nPrimary country and city: United States (US) || || Plano || Stud&amp;YP</div></div><p></p>"
    },
    {
        "position": "2021 Summer Information Technology Intern",
        "company": "British American Tobacco",
        "location": {
            "city": "Winston-Salem",
            "state": "NC"
        },
        "posted": "2020-12-14T21:32:53.423Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=222&ao=1044074&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_18e9da14&cb=1608154133325&jobListingId=3713746432",
        "lastScraped": "2020-12-16T21:32:53.423Z",
        "description": "<div><p><b>Information &amp; Digital Technology Intern</b></p>\n<p>Winston-Salem, NC</p><br>\n<p></p>\n<p>It’s time to put what you’ve learned in the classroom to work as an <b>Information and Digital Technology</b> <b>Intern</b>. At Reynolds American, Inc., you will have the opportunity to assist the function in delivering creative and innovative technology solutions to achieve maximum business benefit across every facet of RAI and its operating companies. This summer, you’ll gain exposure to real-world projects and established professionals who want to help you succeed. That includes access to our c-suite leadership. You will exercise initiative, creative problem-solving skills, teamwork, and leadership as you interact with other personnel throughout our winning organization. In addition, you will have fun while adding value and encountering outstanding career development support.</p><br>\n<p></p>\n<p>Previous Information and Digital Technology Interns have made their mark by delivering on various projects. Their projects included:</p>\n<ul><li>Defining metrics and developing operational dashboard to show eCommerce infrastructure health, usage, and performance</li>\n<li>Providing agile project management discipline to the owned retail project, participating in the technical workstreams of the project, and providing a technology architecture blueprint that can be used as additional stores are brought online.</li>\n<li>Determining data correlations across key data sets within the existing Enterprise Data Warehouse environment and planning for productionalization to allow the process to continually produce outputs for data science users to leverage.</li>\n<li>Analyzed existing processes internal to IDT employees, as well as external facing processes to the RAI workforce, to ensure continued viability; updating where necessary and recommending how to ensure these processes remain current going forward</li></ul><br>\n<p>\n</p><p><b>Responsibilities:</b></p>\n<ul><li>Deliver creative and innovative IT and digital solutions</li>\n<li>Execute challenging assignments</li>\n<li>Collaborate with teams across the Information and Digital Technology function and outside of Information and Digital Technology</li>\n<li>Present your findings to our leadership team</li></ul><br>\n<p>\n</p><p><b>Requirements:</b></p>\n<ul><li>Relocation to Winston-Salem, NC</li>\n<li>Pursuing an undergraduate degree with complete coursework in Business Administration or Information Technology or Computer Science or Data Science or a related field</li></ul><br>\n<p>\n</p><p><b>Benefits</b></p>\n<ul><li>A competitive salary</li>\n<li>Coverage of summer housing costs</li>\n<li>Company-provided laptop</li>\n<li>Social engagements with the Summer Internship Class</li>\n<li>401(k) with up to 6% company match</li>\n<li>Free, confidential, personal financial counseling service</li></ul><br>\n<p>\n</p><p><b>About Us:</b></p>\n<p>Reynolds American Incorporated is transforming the tobacco industry for the better. With a team of driven, insightful people—and a family of iconic brands—we’re redefining how adults consume tobacco in the 21st century. A key part of that is our dedication to diversity, including aiming to increase minority representation in full-time roles by 20% by 2025. Join us and earn the chance to leave your mark on our team—all while advancing your own career with the help of a thriving industry leader</p><br>\n<p></p>\n<p>Reynolds American Inc. is an indirect, wholly owned subsidiary of British American Tobacco p.l.c., and the U.S. parent company of R. J. Reynolds Tobacco Company; Santa Fe Natural Tobacco Company, Inc.; American Snuff Company, LLC; Niconovum USA, Inc.; Niconovum AB; R. J. Reynolds Vapor Company; Lorillard Licensing Company, LLC; and Reynolds Brands, Inc.</p>\n<p>\nReynolds American Inc. and its affiliated companies is an Equal Opportunity / Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.<br>\n<br>\nOur organization offers a level of challenge, responsibility and creativity for motivated employees that stands apart from the crowd.<br>\n<br>\nWe are also committed to employing a diverse workforce and valuing different perspectives, experiences and talents to maximize the company's potential for successfully achieving its business objectives.</p>\n<p>-</p>\n<p>Only applicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly via email at TalentAcquisition@RJRT.com.</p>\n<p>California Privacy Notice</p></div><div></div>"
    },
    {
        "position": "Web Developer Intern -> Product Launch Competition",
        "company": "FLX Bike",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2020-12-14T21:32:58.132Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=223&ao=1044077&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_822b2a25&cb=1608154133325&jobListingId=3769641800",
        "lastScraped": "2020-12-16T21:32:58.132Z",
        "description": "<p>The M.F. Product Launch Competition 2020 is an exciting product launch competition in which small teams compete to prepare and launch a real product in 90 days or less. Teams receive a product idea, hands on training, marketing budget and mentorship from business leaders who have sold hundreds of millions in product. The winning team is awarded with accolades and a prize package worth over $5000.</p><p>The competition is hosted by FLX - the fastest growing eBike Company on the planet - coming off a stunning record setting $13.3M Indiegogo launch of \"The Babymaker\" stealth road E Bike with belt drive.</p><p>This is an exciting, competitive platform to train your web development muscles.</p><p>A team that you can learn with, grow with and laugh with.</p><p><b>Your Skills and Experience: </b></p><ul><li>Familiar with HTML</li><li>Experience with clickfunnels, shopify, wordpress a plus</li><li>Great eye for aesthetics</li><li>Experience and passion for A/B testing</li><li>Graphic design skills a plus</li><li>Interest in growth hacking</li></ul><p><b>Benefits: </b></p><ul><li>Free use of ebikes and electric skateboards</li><li>Collaborate with amazing talent</li><li>Learn real skills from serious performers that have raised hundreds of millions of dollars with simple front end sites</li><li>Office stocked with snacks &amp; drinks</li><li>Free lunch and free parking</li><li>Team Events</li><li>Access to Employee Discounts</li></ul><p><b>Additional info: </b></p><ul><li>Accepting Applications Immediately</li><li>Please submit your resume and let us know why you'd love to join the competition.</li></ul><p><b>FLX CULTURE: </b></p><ul><li>Friendly work environment</li><li>Flexible schedules with emphasis on performance</li><li>Work hard, play hard</li><li>Unlimited growth potential</li></ul><p>Job Type: Internship</p><p>Pay: $0.00 per hour</p><p>Benefits:</p><ul><li>Employee discount</li><li>Flexible schedule</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Internship Compensation:</p><ul><li>College Credit</li></ul><p>This Job Is:</p><ul><li>A job for which military experienced candidates are encouraged to apply</li><li>Open to applicants under 18 years old, provided it is legally allowed for the job and location</li><li>Open to applicants who do not have a high school diploma/GED</li><li>Open to applicants who do not have a college diploma</li></ul><p>Company's website:</p><ul><li>www.flx.bike</li></ul><p>Company's Facebook page:</p><ul><li>https://facebook.com/flxbike</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"
    },
    {
        "position": "Systems Engineer Intern",
        "company": "Vision Staffing Solutions",
        "location": {
            "city": "Maple Grove",
            "state": "MN"
        },
        "posted": "2020-12-13T21:33:01.279Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=224&ao=1044072&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_009d8d45&cb=1608154133328&jobListingId=3743819667",
        "lastScraped": "2020-12-16T21:33:01.279Z",
        "description": "Our client is a not-for-profit electric cooperative providing wholesale power to 28 distribution cooperatives in Minnesota and Wisconsin. Their member cooperatives distribute that electricity to families, farms, and businesses – serving almost 1.7 million people. Great River Energy is seeking a Systems Engineer Intern in Maple Grove, MN to provide systems engineering support to install, configure, and maintain server assets and systems owned applications. Assist with projects with engineering team. Some independent work on projects of limited scope and duration. Check out the details below.\n<br><div><p><b>Job Title:</b> Systems Engineer Intern</p>\n<p><b>\nJob Type:</b> Internship</p>\n<p><b>\nLocation:</b> Maple Grove, MN</p>\n<p><b>\nShift/Hours:</b> 1st Shift, Part Time (during school year) and Full Time (during breaks and summer)</p>\n<p><b>\nCareer Level</b>: Entry</p>\n<p><b>\nEducation:</b> Must be enrolled in college in a Computer Science, Computer Engineering, IT Management, Management Information Systems or related curriculum and 1+ year’s general computing knowledge\\experience obtained through college curriculum, internship and\\or work experience.</p>\n<p>\nSalary: $23+/hr</p>\n<h4><b>\nJob Responsibilities:</b></h4>\n<p>\nAssist Systems and Network Engineering to manage systems according to GRE standards.</p>\n<p>\nProvision Systems and assist with Projects</p>\n<p>\nManage disk, compute and other resources</p>\n<p>\nPerform and review daily health checks</p>\n<p>\nAutomate repeatable daily tasks</p>\n<h4><b>\nRequirements:</b></h4>\n<p>\nMust be enrolled in college in a Computer Science, Computer Engineering, IT Management, Management Information Systems or related curriculum and 1+ year’s general computing knowledge\\experience obtained through college curriculum, internship and\\or work experience.</p>\n<h4><b>\nTechnical Competencies:</b></h4>\n<p>\nExperience with Microsoft Windows Server and with a Linux or UNIX based system. Proficient skills in Microsoft Office tools (Word, Excel, Access). Demonstrated skill in problem solving and the ability to communicate in an effective manner. Ability to be productive and business focused, manage multiple tasks and work in a fast-paced team environment.</p>\n<h4><b>\nWorking Conditions:</b></h4>\n<p>\nMuch of the work will be in a normal office environment with some work being performed in a data center. Office work involves working at a computer station for long periods of time. Must be able to perform the essential functions of the job.</p></div>"
    },
    {
        "position": "Summer 2021 Intern - Software Engineer - Tableau",
        "company": "Salesforce",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2020-12-13T21:33:04.008Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=225&ao=133319&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_1294fce8&cb=1608154133326&jobListingId=3686585704",
        "lastScraped": "2020-12-16T21:33:04.008Z",
        "description": "<p>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.</p><p></p><p></p><p></p><p></p><h2></h2><p>Tableau helps people see and understand data. We design products that are fast, easy, and beautiful—products that anyone can use to solve problems and make a difference in the world. </p><p><br>People at Tableau are builders, tinkerers, and collaborators. Our teams are constantly bringing their deep expertise, skill sets and ideas together to drive new features and products that improve people’s lives—you’ll do real work and make an impact, immediately. <br>Want to write code for Tableau’s latest releases that will reach more than a million people around the globe? Navigate large-scale, complex technical challenges in a fast development cycle? Receive world-class mentorship and connect with some of the brightest people in the industry? Oh, and have a blast while you’re doing it? Join our 2021 Tableau intern class! Not only will you build great products, you get to hear from our leadership, attend intern-exclusive events, give back to your community through volunteer events and more. Discover a summer of new opportunities and experience what sets Tableau apart.</p><p></p><p><b>What you'll be doing...</b><br>As a Software Engineer Intern, you will work on joint projects right alongside your very own mentor and manager. Over a 12 to 16-week time period, you’ll work in an area within Tableau’s forward-thinking product interests such as Data, Analytics, AtScale, Product Operations, User Experience and Platform and Infrastructure. Your specific project will be determined a few months before you start, but don’t worry – we’ll get your input before making placements. The best part is, the work you do will be included as part of a shipping project within six to twelve months.</p><p></p><p><b>A few more things you'll be working on...</b><br>• Designing and implementing features in existing and new products.<br>• Authoring automated tests (unit test and black box tests) and other development processes.<br>• Working with customers, support, and QA to resolve bugs and support issues.<br>• Reviewing and providing detailed feedback on documentation and test plans for features.</p><p></p><p><b>Who you are...</b><br>• Rock Star Student. Pursuing your Undergrad, Masters or PhD in Computer Science or a related field. <br>• A True Team Player. You enjoy thoughtfully collaborating, learning from or teaching others so we can all become better developers. <br>• Passionate. You are enthusiastic about technology and the work you do. You believe in and are dedicated to advancing our mission. You always want to do your best to delight customers, help your team and strive for excellence.<br> </p><p></p><p></p><p></p><p></p><p></p><p><b><b>Accommodations </b>- </b>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.</p><p></p><p></p><p></p><h2>Posting Statement</h2><p></p><p>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.</p><p></p><p><u>Salesforce.com</u> and <u>Salesforce.org</u> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. <u>Salesforce.com</u> and <u>Salesforce.org</u> do not accept unsolicited headhunter and agency resumes. <u>Salesforce.com</u> and <u>Salesforce.org</u> will not pay any third-party agency or company that does not have a signed agreement with <u>Salesfore.com</u> or Salesforce.org.</p><p></p><p>Salesforce welcomes all.</p><p></p><p></p><p></p><p></p><p></p>"
    },
    {
        "position": "Software Client Facing Technical Support Intern: Summer",
        "company": "IBM",
        "location": {
            "city": "Bethesda",
            "state": "MD"
        },
        "posted": "2020-12-12T21:33:08.165Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=226&ao=128418&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_11e7b64b&cb=1608154133326&jobListingId=3743226501",
        "lastScraped": "2020-12-16T21:33:08.165Z",
        "description": "Introduction\n<br>\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n<br><br>\nYour Role and Responsibilities\n<br>\nLooking to learn about BIG DATA? Do you like puzzles and troubleshooting? This is the place for you! We are looking for Students who are interested in learning more about the software that IS BIG DATA. This position is for a Summer Internship working with one of our IBM Z, Cognitive Systems or Storage Technical Support teams. We are looking for analytical puzzle solvers who thrive in a driven enterprise customer support environment. You can work both individually and as part of a motivated worldwide team to assist IBM customers to perform problem determination and problem source identification. We are seeking demonstrated problem solvers with proven communication skills.\n<br><br>\nIBM Systems teams work with Development, Engineering Test, RAS (Reliability and Serviceability) and others early in the development cycle to learn the designs and implementation of systems/subsystems, then act as an interface to the field in resolving complex problems for customers. You must have the desire to wow customers, articulate solutions and options, and take the opportunity to interact with end users, as well as developers and sales teams, to be a well-rounded contributor. People in this role perform break-fix support, debugging and analysis, critical situation support, customer impact event repair action analysis and field engineering change support. They participate in Early Ship Programs in preparation for Post GA (General Availability). The challenge in this position is to be able to interpret complex software problems that span across multiple client and server platforms.\n<br><br>\nYou will be responsible for communicating action plans to the customer or IBM representative as appropriate. You will also be responsible for recommending and implementing new improvements to existing technical support tools, procedures, and processes. Additionally, you will contribute to department attainment of organizational objectives and high customer satisfaction.\n<br><br>\nPositions will be located at one of our offices in: RTP, NC; Austin, TX; Poughkeepsie, NY; Tucson, AZ; or Rochester, MN.\n<br><br>\nRequired Technical and Professional Expertise\n<br>\nActively pursuing a degree in: Computer Science, Computer Engineering, Electrical Engineering, Math, Science, or related field\n<br>\nPassion for Learning technology\n<br>\nCoursework and programming experience in any language (Python, Java,\n<br>\nC, C++, Perl, Shell, etc.)\n<br>\nCoursework in Data Structures and Algorithms\n<br>\nExperience working in Teams\n<br>\nStrong Communication, Organizational, Problem Solving and Problem Determination skills\n<br>\nCustomer driven focus\n<br>\nCommitment to accuracy and attention to details\n<br>\nWillingness to learn how to work in high pressure, dynamic situations with some degree of autonomy\n<br><br>\nPreferred Technical and Professional Expertise\n<br>\nExperience with IBM Systems hardware: Cognitive Systems, Storage Systems, IBM Z\n<br>\nExperience in Client Support/Resolution or other customer service field\n<br>\nExperience troubleshooting customer problems with environments consisting of complex software/hardware stacks\n<br>\nExperience in Computer Networking, Web Application Programming and design, and MySQL or relational database models\n<br>\nExperience working in high pressure, dynamic situations with a large degree of autonomy\n<br>\nExperience listening to clients and understanding both situational and technical issues\n<br>\nKnowledge of logical partitioning\n<br><br>\nAbout Business Unit\n<br>\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the worlds most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n<br><br>\nYour Life @ IBM\n<br>\nWhat matters to you when youre looking for your next career challenge?\n<br><br>\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n<br><br>\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n<br><br>\nAbout IBM\n<br>\nIBMs greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n<br><br>\nLocation Statement\n<br>\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n<br><br>\nBeing You @ IBM\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"
    },
    {
        "position": "Intern - Research Undergrad",
        "company": "IBM",
        "location": {
            "city": "Bethesda",
            "state": "MD"
        },
        "posted": "2020-12-12T21:33:11.734Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=227&ao=128418&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_73f160f8&cb=1608154133327&jobListingId=3743224779",
        "lastScraped": "2020-12-16T21:33:11.734Z",
        "description": "Introduction\n<br>\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n<br><br>\nYour Role and Responsibilities\n<br>\nStart and end dates for this Internship are during Summer 2021 (3 months).\n<br><br>\nAt IBM Research, we invent things that matter to the world. Today, we are pioneering the most promising and disruptive technologies that will transform industries and society, including the future of AI, Blockchain and Quantum Computing. We are driven to discover. With more than 3,000 researchers in 12 labs located across six continents, IBM Research is one of the worlds largest and most influential corporate research labs.\n<br><br>\nWe are seeking candidates with proven interest and experience in implementing innovative software solutions and applications. You will work in close collaboration with other researchers and engineers to create, maintain and support world-class applications and/or infrastructure. You will also deliver production level-code to support the commercialization of the resulting assets. Demonstrated communication skills are essential.\n<br><br>\nCandidates should have basic knowledge in one or more of the following skills:\n<br><br>\nProgramming skills (C/C++, Java, Python, Javascript, Node.js, etc.)\n<br>\nSoftware engineering practices including agile techniques\n<br>\nBuilding cloud applications using APIs and services\n<br>\nSystem building/debugging/testing skills\n<br>\nMachine learning techniques and machine learning toolkits such as R, scikit-learn, Theano, Caffe, Torch\n<br>\nProgramming on GPUs\n<br>\nScale-out programming (e.g. MPI)\n<br><br>\nCandidates must be willing to work in any of the following locations: Albany, NY; Almaden, CA; Austin, TX; Cambridge, MA;\n<br>\nYorktown Heights, NY. Pursuing a Bachelor's degree in Computer Science, Computer Engineering or a related area is required.\n<br><br>\nThe World is Our Laboratory: No matter where discovery takes place, IBM researchers push the boundaries of science, technology and business to make the world work better. IBM Research is a global community of forward-thinkers working towards a common goal: progress.\n<br><br>\nRequired Technical and Professional Expertise\n\n<ul>\n<li>Programming skills (C/C++, Java, Python, Javascript, Node.js, etc.)</li><li>Software engineering practices including agile techniques</li><li>Building cloud applications using APIs and services</li><li>System building/debugging/testing skills</li> \n</ul>\n\nPreferred Technical and Professional Expertise\n\n<ul>\n<li>Machine learning techniques and machine learning toolkits such as R, scikit-learn, Theano, Caffe, Torch</li><li>Programming on GPUs</li> <li>Demonstrated written and verbal communication skills</li>\n</ul>\n\nAbout Business Unit\n<br>\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n<br><br>\nYour Life @ IBM\n<br>\nWhat matters to you when youre looking for your next career challenge?\n<br><br>\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n<br><br>\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n<br><br>\nAbout IBM\n<br>\nIBMs greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n<br><br>\nLocation Statement\n<br>\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n<br><br>\nBeing You @ IBM\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"
    },
    {
        "position": "Firmware Developer Summer Intern",
        "company": "IBM",
        "location": {
            "city": "Houston",
            "state": "TX"
        },
        "posted": "2020-12-12T21:33:15.297Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=228&ao=128418&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_04ede92f&cb=1608154133327&jobListingId=3743225482",
        "lastScraped": "2020-12-16T21:33:15.297Z",
        "description": "Introduction\n<br>\nAs a Hardware Developer at IBM, youll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in todays market.\n<br><br>\nYour Role and Responsibilities\n<br>\nFirmware may exist anywhere in a computing system from the central computing complex to management consoles, power supplies, and I/O adapters within IBM mainframes. Some firmware projects include:\n\n\n<ul>\n<li>Development of the hardware management console web interface and mobile app</li>\n<li>Development for the worlds highest security cryptographic processors</li>\n<li>Development and support of I/O adapters (networking and storage) and Secure Service Containers used to support applications using blockchain technology.</li>\n<li>Server virtualization and a Parallel Sysplex environment so that mainframes can communicate as a single entity.</li>\n<li>Implementation of complex z/Architecture instructions, concurrent and recovery functions</li>\n</ul>\n\nOur engineers apply agile methodologies throughout the entire development cycle, from design, code implementation/review, unit testing, functional testing, simulation, and real hardware integration testing. Some areas use a Unix/Linux based Operating System focusing on embedded programming, communication protocols, host application software support, and user-interfaces. Interface and code designs are done primarily to communicate with different hardware components via various hardware protocols such as PCIe.\n<br>\nSelected candidates will work in a team-based, collaborative environment with peers both locally and across the global organization. This position may require you to work directly with clients to understand their needs and requirements and ensure product delivery meets their expectations.\n<br><br>\nIdeal candidates will possess demonstrated software design skills, understanding of front-end, back-end technologies or embedded systems. Team-based experience in software development, agile methodologies and the ability to perform software performance analysis, debugging and test.\n<br>\n<strong>Possible locations based on demand include:</strong>\n<br>\nPoughkeepsie, NY; Endicott, NY; Tucson, AZ; San Jose, CA;\n<br><br>\nRequired Technical and Professional Expertise\n\n\n<ul>\n<li>Pursuing Bachelors in Computer Science, Computer Engineering or Electrical Engineering</li>\n<li>Passion to pursue career path in Computer Engineering or Computer Science</li>\n<li>Fundamental education in software design and/or test</li>\n<li>Knowledge of web and mobile application development</li>\n<li>Computer Architecture</li>\n<li>Programming languages: Java, C, C++, Assembly</li>\n<li>Scripting (Python, JavaScript, Perl, Bash, etc.)</li>\n<li>Tools (Git/GitHub, IntelliJ, etc.)</li>\n<li>Strong Communication Skills</li>\n</ul>\n\nPreferred Technical and Professional Expertise\n\n\n<ul>\n<li>Development knowledge of Unix/Linux kernel functionality</li>\n</ul>\n\nAbout Business Unit\n<br>\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the worlds most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n<br><br>\nYour Life @ IBM\n<br>\nWhat matters to you when youre looking for your next career challenge?\n<br><br>\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n<br><br>\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n<br><br>\nAbout IBM\n<br>\nIBMs greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n<br><br>\nLocation Statement\n<br>\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n<br><br>\nBeing You @ IBM\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"
    },
    {
        "position": "Innovation Software Developer Intern",
        "company": "HP Inc.",
        "location": {
            "city": "Spring",
            "state": "TX"
        },
        "posted": "2020-12-12T21:33:18.748Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=229&ao=135508&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_095c0f0c&cb=1608154133327&jobListingId=3712681761",
        "lastScraped": "2020-12-16T21:33:18.748Z",
        "description": "<ul>\n<li>Seeking software engineer, computer scientist, or other similar computer software related discipline. Candidate should be in the process of pursuing a bachelors of science degree or greater level of education.</li><li>Works with HPs Personal Systems Innovation Team on a variety of proofs of concept development activities related to future technologies, work styles, and experiences for example in the areas of the modern and future office productivity and collaboration, higher education, and health care.</li><li>Develops operating systems and application software needed to drive proofs of concepts experience flows with the purpose of exploring use cases, behaviors, and user experiences needed to deliver new innovative features and user interfaces into HPs personal systems products, solutions, and / or services.</li><li>Able to develop software applications and services for Windows 10 related platforms (e.g. Win32/64 and Windows Universal (UWP) application models and languages [C#, C++, DirectX, visual basic]) as well as mobile platforms (iOS and Android) for device interoperability concepts and experiences.</li><li>Self-starter and highly motivated individual capable of obtaining appropriate development SDKs and any other tools needed to complete development assignments.</li><li>Able to do preliminary research and determine if requirements can be met by an available, off the shelf, 3rd party software solution versus development of solution in house at HP.</li><li>Good communications skills required to both interact with senior engineers to gather software and user interface requirements as well as to demonstrate end results of developed software to both the innovation team and in some cases, upper management.</li><li>Follows standard software development processes to rapidly specify and document application and services requirements, and then develop, test, and debug agreed up on software for its intended platform and proof of concept.</li><li>Projects will be highly confidential in nature and with significant opportunities to develop new ideas and to file intellectual property (design and utility patents) for HP Inc.</li><li>Other areas of expertise not required but that would benefit this intern position include experience in user interface and graphics design methodology, computer hardware and architecture, windows device driver models, and / or user experience research and methodologies.</li>\n</ul>\n\nWe are seeking an exceptional individual for an exciting position in the Innovation and Experiences team for HP Commercial Products. The Innovation and Experiences team is responsible for defining new customer experiences that align with our Innovation domains. As a member of this team you will work alongside senior technologists developing software and application proof-of-concepts for future HP products. You will help to creating brand new experiences and influencing the future of how users work and collaborate. Are you creative, have passion for innovation, technologies? Are you driven, have great communication skills, great leadership skills, a team player? If you meet these stringent requirements and have a desire to influence the future then this position is a great opportunity to learn, grow, and have an impact on the future."
    },
    {
        "position": "Information Technology Intern",
        "company": "Penske Truck Leasing and Logistics",
        "location": {
            "city": "Reading",
            "state": "PA"
        },
        "posted": "2020-12-12T21:33:22.950Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=230&ao=1044074&s=58&guid=000001766d74b1efad1730d6461941ab&src=GD_JOB_AD&t=SR&vt=w&cs=1_899745ea&cb=1608154133328&jobListingId=3768976115",
        "lastScraped": "2020-12-16T21:33:22.950Z",
        "description": "<b>Description:</b><br>\n<b>Position Summary:</b><br>\nA Penske IT Intern will do related projects to support the department while creating valuable learning experience.\n<br><br>\n<b>Qualifications:</b><br>\n<b>Job Qualifications:</b><br>\nIn process of completing a bachelors degree in MIS/IT releated program\n<br><br>\nRegular, predictable, full attendance is an essential function of the job\n<br><br>\nWillingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required.\n<br><br>\n<b>Physical Requirements:</b><br>\n<ul>\n<li>The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li>\n<li>The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines.</li>\n<li>While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to occasionally lift and/or move up to 25lbs/12kg.</li>\n<li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus.</li>\n</ul>\nPenske is an Equal Opportunity Employer.\n<br><br>\nAbout Penske Truck Leasing\n<br><br>\nPenske Truck Leasing Co., L.P., headquartered in Reading, Pennsylvania, is a partnership of Penske Corporation, Penske Automotive Group and Mitsui &amp; Co., Ltd. A leading global transportation services provider, Penske operates a premier fleet of vehicles and serves its customers from locations in North America, South America, Europe, Australia, and Asia. Penske’s product lines include full-service truck leasing, contract maintenance, commercial and consumer truck rentals, used truck sales, transportation and warehousing management and supply chain management solutions. Visit www.GoPenske.com to learn more.\n<br><br>\n<b>Work Locations:</b> 100 Gundy Drive Reading, PA 19607\n<br><br>\n<b>Primary Location:</b> United States-Pennsylvania-Reading\n<br><br>\n<b>Zip:</b> 19607\n<br><br>\n<b>Job:</b> Information Technology\n<br><br>\n<b>Penske (Oracle) Job Name:</b> Information Technology\n<br><br>\n<b>Req ID:</b> 2011476"
    },
    {
        "position": "Cybersecurity and Privacy Intern - Summer",
        "company": "Grant Thornton",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-16T21:33:25.821Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=105&ao=3839&s=58&guid=000001766d74a5babd1e5268467278f7&src=GD_JOB_AD&t=SR&vt=w&cs=1_33893c24&cb=1608154130235&jobListingId=3657544749",
        "lastScraped": "2020-12-16T21:33:25.821Z",
        "description": "<strong>Who is Grant Thornton?</strong>\n<br><br>\nGrant Thornton is a collaborative, entrepreneurial\n<br>\nfirm on the move! As part of a dynamic, global organization of more than 42,000\n<br>\npeople serving clients in more than 120 countries, we have the agility and\n<br>\nfocus it takes to be a leader.\n<br><br>\nFounded in Chicago in 1924,\n<br>\nGrant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant\n<br>\nThornton International Ltd, one of the world’s leading organizations of\n<br>\nindependent audit, tax and advisory firms. Grant Thornton has revenue in excess\n<br>\nof $1.8 billion and operates 58 offices across the United States with more\n<br>\nthan 565 partners and 8,000+ employees.\n<br><br>\nGrant\n<br>\nThornton works with a broad range of publicly and privately held companies,\n<br>\ngovernment agencies, financial institutions, and civic and religious\n<br>\norganizations. Core industries served\n<br>\ninclude consumer and industrial products, financial services, not-for-profit,\n<br>\nprivate equity, and technology. Grant Thornton focuses on serving dynamic\n<br>\norganizations that pursue growth holistically – whether through revenue\n<br>\nimprovement, leadership, mission fulfillment or innovation.\n<br><br>\nWe\n<br>\nare committed to capitalizing on our strengths and serving dynamic\n<br>\norganizations that share our values and drive. \n<br>\nOur global values of collaboration, leadership, excellence, agility,\n<br>\nrespect, and responsibility (“CLEARR”) guide our behaviors and fuel our\n<br>\nambition to be the firm that makes a difference every day.\n<br><br>\nWe provide companies with the guidance that\n<br>\nthey need to help run their businesses, establish robust internal controls, use\n<br>\ninformation effectively and improve performance. These services include compliance, consulting\n<br>\nservices, information technology solutions, forensic accounting and\n<br>\ninvestigative services, recovery and reorganization, tax preparation, and\n<br>\nvaluation, to name a few.\n<br><br>\n<strong>Grant Thornton’s Cyber Risk Advisory Services Practice</strong>\n<br><br>\nWith\n<br>\nthe rise in cyber breaches across industries, companies are aggressively\n<br>\nlooking for consultants to help them protect their critical assets and\n<br>\nproactively prepare and respond to cyber breaches. The threat actors have shifted from simple,\n<br>\nnuisance based cyber hacks to criminals, activists, ransom hacks and nation\n<br>\nstates.<br><br>Our Cyber Risk Advisory practice offers an opportunity for you to leverage your technology background and experience to broaden your business and project management skills in a rewarding and challenging environment. Individuals will work on projects across our portfolio of Cyber Risk services and will assist in the development of cyber risk strategies, identity and access management programs, network security, cyber security analytics, ethical hacking, cloud security, privacy &amp; data protection, blockchain, etc.<br><br><strong>What\n<br>\nare we looking for in a BRS Cyber Intern?</strong>\n<br><br>\nInterested candidates should have analytical skills, be strong “thinkers”, with an affinity for learning and innovation. Interested candidates should be self-starters and should demonstrate strength in or a desire to build skills related to Grant Thornton’s core values of: Collaboration, Leadership, Excellence, Agility, Respect, and Responsibility.\n<br><br>\n<strong>Qualifications</strong>\n<ul>\n<li>B.S. in Engineering within computer science, electronics, electrical, mechanical, or information systems</li><li>B.S. program in Data analytics, Informatics, Management with Cybersecurity (minor)</li><li>B.S. program with a specialization in Technology – “Hands on technology experience”</li><li>B.S. program in Data Analytics with specialization in Blockchain, Cyber Security, RPA, Crypto</li><li>B.S. in Information Security</li><li>Major and overall GPA of 3.0 out of 4.0</li><li>Ability to travel 60�00% as required</li> \n</ul>\n<strong>Skill\n<br>\nRequirements</strong>\n<ul>\n<li>Strong business and technical aptitude and problem-solving skills</li><li>Likes to learn the business of our clients to help them solve problems</li><li>Ability to bridge the gap between business strategy and cybersecurity, technology to help deliver sustainable solutions to our clients</li><li>Excellent thinking, analytical, communication (written and verbal) and interpersonal skills</li><li>Effective time management skills for handling multiple priorities and simultaneous projects</li> <li>Enthusiasm to learn through a combination of structured, on-the-job and self-directed training</li><li>Ability to work efficiently and effectively in a team environment</li>\n</ul>\n\nInterns can expect to work closely with the Cyber Risk team on all phases of the engagement lifecycle including planning, engagement management, and project wrap up. Some of the typical projects are:\n\n<ul>\n<li>Ethical Hacking</li><li>Cyber threat monitoring</li><li>Cloud Security</li><li>Identity and Access Management</li><li>Privacy and Data Protection</li><li>Cyber Incident Management</li><li>Cyber War Gaming</li><li>Cyber Strategy and program design</li><li>Cyber Security within blockchain, RPA’s, IoT</li> <li>Secure code design</li><li>Business Strategy and Cyber strategy alignment</li>\n</ul>\n\n<strong>Training:</strong>\n<br><br>\nGrant Thornton LLP provides both local and national training programs related to an individual’s job responsibilities. We are committed to ongoing professional development and we encourage individuals to attend outside training seminars.\n<br><br>\n<strong>Benefits:</strong> \n<br><br>\nGrant Thornton LLP offers an outstanding opportunity for career growth and development, an attractive compensation and incentive program, generous benefits including immediate participation in our 401(k) plan, and a flexible work environment that offers individual enrichment opportunities in a team environment.\n<br><br>\nIt is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law.\n<br><br>"
    }
]