[
    {
        "position": "Test & Development Intern- Summer 2021",
        "company": "Pratt Miller",
        "location": {
            "city": "New Hudson",
            "state": "MI"
        },
        "posted": "2020-12-19T08:31:32.869Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=101&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_b9b1f6a8&cb=1608366651810&jobListingId=3691354224",
        "lastScraped": "2020-12-19T08:31:32.869Z",
        "description": "<div><p>Pratt Miller (PM) is a product development company in motorsports, defense, and mobility industries providing clients with product engineering and low-volume production solutions. Our range of research &amp; development, engineering, prototype manufacturing, test &amp; validation, and low-rate production capability help our customers bring their high-quality products to market faster.</p>\n<p><b>OVERVIEW:</b> Test &amp; Development Internship to work with a small team of design engineers, test engineers, and test technicians supporting engineering related projects. This position requires gaining and applying engineering knowledge to solve real world engineering design, testing, analysis, and development problems on a wide variety of products in the automotive, defense, motorsports, aerospace, marine, and smaller niche industries. These efforts can be applied to short or long-term projects including virtual prototype development, component, system, and full vehicle testing, laboratory testing, engineering analysis, control systems, electronics, and product/system validation.</p>\n<p><b>ESSENTIAL FUNCTIONS &amp; SKILLS</b>:\n</p><p>Typical responsibilities include but are not limited to all of the following:</p>\n<ul><li>Support the execution of small, medium, and large laboratory and in-field (proving grounds (PG), desert, wind tunnel, thermal dyno chamber, racetrack, etc.) testing projects alongside more senior test engineers and technicians.</li>\n<li>Good working background in Windows based computers and Microsoft applications (Outlook, Word, Excel, and PowerPoint)</li>\n<li>Ability to use CAD (NX, Creo, Catia, and/or SolidWorks) and PLM tools (Windchill, Teamcenter, etc.) to support test fixture design, drawing development, and manufacturing release processes</li>\n<li>Ability to communicate professionally, both verbally and in writing</li>\n<li>Ability to perform within a matrix organization and a dynamic and fast paced environment</li>\n<li>Must have proven multitasking and organizational skillset</li>\n<li>Work safely to comply with all business expectations</li>\n<li>Service-oriented mindset</li>\n</ul>\n<p><b>EDUCATION/CERTIFICATION/YEARS OF EXPERIENCE:</b></p>\n<ul><li>Working toward a BS in Materials Science, Mechanical, Electrical, Aerospace or Automotive Engineering (or equivalent)</li>\n<li>Preferably current participation in one or more SAE International collegiate design competitions (Formula SAE, Baja SAE, SAE Clean Snowmobile Challenge, Formula SAE Electric, First Robotics, SAE Solar Car, etc.)</li>\n<li>Highly self-motivated with the ability to accept direction and manage his/her own workload to achieve important deadlines with reasonable oversight</li>\n<li>Mechanical skills including the ability to use all common hand tools</li>\n</ul>\n<p><b>DESIRED SPECIALIZED SKILLS AND KNOWLEDGE:</b></p>\n<ul><li>Strong engineering fundamentals in all general automotive systems with hands-on, real world vehicle experience</li>\n<li>Basic working knowledge of data acquisition and instrumentation equipment and the ability to collect and analyze test data into understandable results and write technical test reports and presentations under guidance of more senior engineers</li>\n<li>Skilled trades experience including fabrication, machining, MIG/TIG welding, and assembly</li>\n<li>Vehicle logistics competency (trucks, trailers, towing, vehicle recovery)\n</li></ul><p><b>WORK ENVIRONMENT: (i.e., office, shop, PG/in-field/track, etc.)</b></p>\n<ul><li>Office work is normally performed in a typical interior work environment which does not subject the employee to any hazardous or unpleasant elements\n</li></ul><ul><li>Shop or laboratory work involves some exposure to moderate risk of accident and requires following basic safety precautions</li>\n<li>In-field, PG, or track testing involves frequent exposure to unpleasant elements, such as extreme temperatures, dirt, dust, fumes, smoke, loud noises, chemicals, etc.\n</li><li>Stress may occur periodically</li>\n<li>Monthly travel may be required and will vary depending on each project’s requirements and availability of candidate to travel</li>\n</ul>\n<p><b>PHYSICAL DEMANDS:</b></p>\n<ul><li>Position requires occasional or frequent moderate physical activity</li>\n</ul>\n<p><b>EXPECTED HOURS OF WORK:\n</b></p><ul><li>Typical work week is 40 hours/week</li>\n<li>Overtime will be compensated at 1.5x normal pay</li>\n<li>Working hours for hourly internship employees are flexible with a typical day starting at 7am, M-F</li>\n<li>Prefer the ability to be flexible with schedule accommodating fixed customer deadlines sometimes working longer hours as well as Saturday and or Sunday during peak project deliverable durations or offsite testing trips</li>\n</ul>\n<p><b>ADDITIONAL REQUIREMENTS:</b> In addition to the responsibilities mentioned above, the ideal candidate must possess but not limited to all the following:\n</p><ul><li>Be a team player</li>\n<li>Have great attention to detail</li>\n<li>Strong verbal and written communication skills</li>\n<li>Be reliable (with reliable mode of transportation)\n</li><li>Have excellent mechanical ability and likes to work with their hands\n</li><li>Strong work ethic and pride in their workmanship\n</li></ul><p>This position will require lawful access to ITAR/EAR controlled information and employees in this role will need to meet those requirements. Requirements include US Citizenship, US Permanent Resident or ability to meet licensure requirements.</p>\n<p>Pratt Miller is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</p></div>"
    },
    {
        "position": "Intern – IT Software Engineer (NOA)",
        "company": "Nintendo of America Inc.",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "2020-12-19T08:31:37.487Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=102&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_9f859b74&cb=1608366651811&jobListingId=3775859699",
        "lastScraped": "2020-12-19T08:31:37.487Z",
        "description": "<div><div><div><b>Nintendo of America Inc.<br>\n</b><br>\n</div><div></div><br>\n<div>The worldwide pioneer in the creation of interactive entertainment, Nintendo Co., Ltd., of Kyoto, Japan, manufactures and markets hardware and software for its Nintendo Switch ™ system and the Nintendo 3DS ™ family of portable systems. Since 1983, when it launched the Nintendo Entertainment System ™ , Nintendo has sold more than 4.5 billion video games and more than 710 million hardware units globally, including Nintendo Switch and the Nintendo 3DS family of systems, as well as the Game Boy ™ , Game Boy Advance, Nintendo DS ™ family of systems, Super NES ™ , Nintendo 64 ™ , Nintendo GameCube ™ , Wii ™ and Wii U ™ systems. It has also created industry icons that have become well-known, household names, such as Mario, Donkey Kong, Metroid, Zelda and Pokémon. A wholly owned subsidiary, Nintendo of America Inc., based in Redmond, Wash., serves as headquarters for Nintendo’s operations in the Americas. For more information about Nintendo, please visit the company’s website at http://www.nintendo.com .<br>\n</div><div></div><div><b>GET SERIOUS ABOUT FUN<br>\n</b><br>\n</div><div></div><br>\n<div>As a Nintendo of America Intern, you will actively contribute to meaningful projects, and gain valuable hands-on work experience with a leading company in the entertainment industry. During the program from June through August, your work experience will be enhanced with mentoring, networking opportunities and exposure to industry leaders from across the company! Whether you are in a technical or non-technical role, you will be a part of a team committed to putting smiles on faces of millions around the world.<br>\n</div><div></div><br>\n<div><b>Intern – IT Software Engineer\n</b></div><div></div><div><b>DESCRIPTION OF DUTIES\n</b></div><div><ul><li>Work with Nintendo’s IT Solutions team to enhance and improve back office applications and systems for internal business clients.\n</li><li>Contribute to the team that completes full-stack software development gaining exposure to end-to-end software project delivery from a developer's perspective.\n</li><li>Provide strong collaboration and communication skills to interface with other IT team members and presentation of work to client stakeholders.</li></ul></div></div></div><div></div>\n<br><div></div><div><div><b>SUMMARY OF REQUIREMENTS\n</b></div><div><ul><li>3.0+ GPA\n</li><li>Freshmen to graduating seniors enrolled in accredited college or university\n</li><li>Pursuing a degree in Computer Science, Computer Engineering or related field\n</li><li>Experience with Java, REACT, JavaScript and AWS\n</li><li>Excellent interpersonal and communication skills to work cross-functionally\n</li><li>Strong programing languages\n</li><li>Ability to articulate technical challenges and solutions effectively\n</li><li>Legally authorized to work in the United States\n</li></ul></div><div>We are an equal opportunity employer of individuals with disabilities and protected veterans....valuing diversity…celebrating strengths.</div></div><div></div>"
    },
    {
        "position": "Software Developer Intern, Back-end - Mobile Games",
        "company": "PerBlue",
        "location": {
            "city": "Madison",
            "state": "WI"
        },
        "posted": "2020-12-19T08:31:40.231Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=103&ao=1165504&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_a64a39e9&cb=1608366651813&jobListingId=3775718925",
        "lastScraped": "2020-12-19T08:31:40.231Z",
        "description": "PerBlue is looking for a passionate <strong>Back-end</strong> <strong>Software Developer Intern</strong> to join our team of experienced engineers and game designers. We’re a quickly growing independent studio whose free-to-play midcore mobile games have been played by millions people around the world, including our award-winning <em>Disney Heroes: Battle Mode</em>.\n<br><br>\nOur cross-functional and collaborative team has experience across the videogame industry. Headquartered in Madison, Wisconsin, we also offer remote work within the United States for an unmatched quality of life and work.\n<br><br>\nThis full-time internship is available for 15 weeks during the summer of 2021. You'll be working on real games, shipping real code, and have real responsibilities. implementing the foundations of our Games-As-A-Service infrastructure.\n<br><br>\n<strong>Key responsibilities - Back-End Developers</strong>\n<br><br>\nAs a Software Developer Intern in a Back-End role, you'll be responsible for implementing backend systems that support our suite of cross-platform mobile games. You’ll solve big, complex technical problems and build highly scalable systems and servers that are able to handle TBs of data and thousands of simultaneous network connections to serve our games to large user bases.\n<br><br>\n<strong>Requirements—</strong>\n\n<ul>\n<li>Java or C# programming background, must have low-level programming talent</li>\n<li>A passion for all things programming with amazing technical skills</li>\n<li>Desire and willingness to learn new technology and tools</li>\n<li>Be results-oriented and able to thrive in a fast-paced environment</li>\n<li>A focus on product and an eye for quality</li>\n<li>Completion of interesting side projects</li>\n<li>Self-motivation, self-direction, and strong remote communication skills as this will be a remote-first opportunity</li>\n</ul>\n<strong>Other qualifications—</strong>\n\n<ul>\n<li>Familiar with Unity or other game engines</li>\n<li>Understanding of back-end systems integration</li>\n<li>An interest and passion for gaming</li>\n<li>Ability to effectively communicate with team-members and management</li>\n<li>Prior experience at a game studio (mobile, console, or PC)</li>\n<li>Previously shipped a mobile app or multiplayer game</li>\n</ul>\n<strong>Perks</strong>\n<br><br>\nOur interns receive a great work environment where you’ll work on live games, lunch and snack box deliveries, mentorship from experienced mobile game devs, and more!\n<br><br>\n<em>No agencies, please. We regret that we cannot consider visa sponsorship or candidates based outside of the United States for this position at this time.</em>"
    },
    {
        "position": "Software Developer Intern",
        "company": "Security Benefit",
        "location": {
            "city": "Topeka",
            "state": "KS"
        },
        "posted": "2020-12-19T08:31:45.958Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=104&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_3569ce99&cb=1608366651814&jobListingId=3691264913",
        "lastScraped": "2020-12-19T08:31:45.958Z",
        "description": "<p></p><div><p>Security Benefit a Kansas based company, is seeking an experienced Software Developer Intern to join the Investment Department. SB fosters strong partnerships to provide insightful and customized retirement solutions for employers and individual investors nationwide. As an industry leader in service technology, our affiliates offer business processing and broker/dealer solutions tailored to the financial services. Headquartered in Topeka, KS, we are a fast-paced business that has experienced significant growth in the past few years and we expect to continue on a steady growth trajectory.</p><p><b>\nResponsibilities</b></p><p>\nThe Derivatives Technology Team is seeking an intern experienced in coding and debugging with an exposure to software design principles. We are currently looking for candidates to participate in an intern-to-hire track.</p><p>\nThe intern will work with the Derivatives Technology Team and assist in the design, development, testing, deployment, and integration of software applications. The intern will work under a senior developer to assist in the completion of various technology initiatives. Other responsibilities include:</p><ul><li>\nWork with a team to address system issues</li><li>\nUtilize issue tracking systems to identify and document technology issues and improvements</li><li>\nSupport the senior developer through researching, developing, and testing software</li><li>\nCollaborate with other team members on projects</li><li>\nOther projects and tasks as needed</li></ul><p>\nIn addition to valuable experience working in FinTech, the intern can expect to be exposed to the following:</p><ul><li>\nBusiness IT Systems Architecture and Web 2.0 Application Design</li><li>\nComputer programing languages: C#, Python</li><li>\nScripting languages: HTML, CSS, JavaScript, TypeScript, T SQL</li><li>\nDatabases: Microsoft SQL Server, MongoDB</li><li>\nFrameworks: .Net, .Net Core, ASP.NET, Angular, ASP.NET Core, AngularJS</li><li>\nTechnologies: Git, GitLab, JupyterNotebook, JupyterLab, Amazon Web Services</li><li>\nTools: Visual Studio, Visual Studio Code, Microsoft SQL Server Management Studio (SSMS)</li></ul><p><b>\nEligibility</b></p><p>\nStudents eligible for the internship will be current, fulltime students available to work approximately 19 hours a week, beginning immediately. Student will be expected to work during and in between semesters and up to full-time during the summer. This is not a summer only internship.\n<br>\nCurrently pursuing a degree in computer science, mathematics, or finance</p><ul><li>\nFamiliarity with code design principals such as Object Orientated Programming</li><li>\nFamiliarity with web application operation and design</li><li>\nFamiliarity with data structures, data bases, computer systems design and operation</li><li>\nStrong written and verbal communication skills</li><li>\nStrong skills in analysis and problem solving</li></ul><p><b>\nPreferred</b></p><ul><li>\nExperience with web technologies such as Angular or AngularJS</li><li>\nExperience with object orientated programming languages such as C# or C/C++</li><li>\nExperience with querying data from a database</li><li>\nHands on experience with Visual Studio and Visual Studio Code</li><li>\nAn interest in computer science, finance, investments, and mathematics</li></ul><p>\nConsider joining our progressive team in our nationally recognized company. Apply online at www.securitybenefit.com/careers and submit your resume. EOE</p><p></p><br>\n<h4><b>\nSkills</b></h4>\nPreferred<ul><li>\nBroker Comm Administration</li><li>\nAnnuity Industry Roles</li><li>\nADFS (Active Directory Federation Service)</li><li>\nConfluence Administration</li><li>\n403B</li></ul><h4><b>\nBehaviors</b></h4>\nPreferred<ul><li>\nDetail Oriented: Capable of carrying out a given task with all details necessary to get the task done well</li></ul></div>"
    },
    {
        "position": "Software Engineering Intern (Summer 2021)",
        "company": "Sierra Nevada Corporation",
        "location": {
            "city": "Sparks",
            "state": "NV"
        },
        "posted": "2020-12-19T08:31:49.732Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=105&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_2719a150&cb=1608366651815&jobListingId=3690938548",
        "lastScraped": "2020-12-19T08:31:49.732Z",
        "description": "Come start your career with some of the brightest and most innovative minds in the country. Get your hands on actual projects, and at the same time, prepare for a truly awesome career in aerospace and defense.\n<br><br>\nThis is not your parent’s internship program – you won’t be getting coffee and ordering lunch. Our Interns have the unique experience of getting both mentoring and coaching while working side by side with recognized industry experts on real-world assignments directly related to their field of study. Bring your knowledge and desire to learn, and we will provide the experience.\n<br><br>\nSummer internships are typically 10-12 weeks starting in late May/early June and work an average of 40 hours a week. Depending on satisfactory completion of certain criteria during your internship, you may be considered for a full-time position upon graduation.\n<br><br>\nAs a Technical Intern, you'll ask questions, get involved, bring your ideas, be part of an actual project team, attend planning meetings, complete assignments as tasked by your team, absorb and learn from your team and apply that learning to projects assigned. You'll have the opportunity to learn fundamental business processes and procedures, build your technical foundation through practice and mentorship, and participate in an in-depth program built by our University Recruiting team, that includes cross-functional workshops and meeting with leadership to gain understanding of the business and SNC culture.\n<br><br>\nAt SNC’s ISR, Aviation and Security (IAS) team we are a leading manned and unmanned aircraft systems integrator for high-performance intelligence, surveillance and reconnaissance, and aviation systems. IAS tailors solutions to customer cost, performance and schedule requirements and designs to consistently exceed expectations and provide a turnkey approach to enable our customers to focus on their mission. Learn more about IAS\n<br><br>\n<b>Must-haves:</b><br>\nMust be a Sophomore, Junior or Senior in college or technical school, with at least 6 months until graduation after end of internship\n<br><b>Proficiency in one or more of the following languages:</b> Java, C++, python, typescript/html, bash\n<br>Excellent debugging and critical thinking skills\n<br>Strong skills in Word, Excel, PowerPoint and Visio\n<br>Ability to work in a highly collaborative team environment and follow instructions\n<br>Strong communication and organizational skills and work ethic; detail oriented\n<br>Great attitude and the drive to learn and innovate\n<br>Pursuing a degree in engineering or a related discipline\n<br><br>\n<b>Preferred/Bonus:</b><br>\nStrong math skills\n<br>Experience with test automation tools (Selenium)\n<br>Experience with RESTful APIs, Frontend, Web Frameworks\n<br>Experience with CI/CD tools such as Bitbucket, Jenkins, Artifactory\n<br>Experience with MATLAB\n<br><br>\n<b>IMPORTANT NOTICES:</b><br>\nTo conform to U.S. Government export regulations, applicant must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State.\n<br><br>\nAt Sierra Nevada Corporation (SNC) we deliver customer-focused technology and best-of-breed integrations in the aerospace and defense sectors. SNC has been honored as one of the most innovative U.S. companies in space, a Tier One Superior Supplier for the U.S. Air Force, and as one of America’s fastest-growing companies. Learn more about SNC\n<br>Sierra Nevada Corporation is an Equal Opportunity Employer\n<br>– Minority / Female / Disability / Veteran, or any other protected status\n<br>pursuant to applicable local, state or federal law, ordinance or regulation."
    },
    {
        "position": "Programming Intern- IMT Computer Services",
        "company": "IMT Insurance",
        "location": {
            "city": "West Des Moines",
            "state": "IA"
        },
        "posted": "2020-12-19T08:31:54.506Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=106&ao=1152481&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_e9bfd21c&cb=1608366651818&jobListingId=3749576614",
        "lastScraped": "2020-12-19T08:31:54.506Z",
        "description": "IMT Insurance is now accepting applications for our Summer 2021 session Programming Internship position within the IMT Computer Services department. IMT Computer Services is a division of IMT Insurance and offers programs a complete suite of software for today's Mutual Insurance companies. As a Programming Intern, you will work within a team on various projects where you can put your web development skills to use and grow as an emerging developer. Ideal candidates will be passionate, self-motivated, detail-oriented and have an interest in developing skills through hands-on experience. If this opportunity is something that interests you, apply online today to learn more!\n<br><br>\n<strong>Required Experience:</strong>\n\n<ul>\n\n <li>Must be working towards a college degree.</li>\n\n<li>General Web Development/Knowledge is a must.</li>\n\n<li>C#, REACT, SQL Server and MS Visual Studio is a plus</li>\n\n<li>Agile experience is a plus.</li>\n\n<li>Ability to analyze and proven problem-solving skills.</li>\n\n<li>Ability to listen and communicate internally/externally to the customer, both verbally and in writing.</li>\n\n<li>High propensity to learn new technologies.</li>\n</ul>"
    },
    {
        "position": "Internship - Computer Engineering - Summer",
        "company": "General Atomics and Affiliated Companies",
        "location": {
            "city": "Fredericksburg",
            "state": "VA"
        },
        "posted": "2020-12-19T08:31:57.615Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=107&ao=1014188&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_58bd98e9&cb=1608366651818&jobListingId=3775659100",
        "lastScraped": "2020-12-19T08:31:57.615Z",
        "description": "\nIntern III\n<br><br>\n18-Dec-2020\n<br><br>\n<strong>Company</strong>\n<br>\nGeneral Atomics\n<br><br>\n<strong>Job Summary</strong>\n<br>\nGeneral Atomics (GA), and its affiliated companies, is one of the world’s leading resources for high-technology systems development ranging from the nuclear fuel cycle to remotely piloted aircraft, airborne sensors, and advanced electric, electronic, wireless and laser technologies.\n<br><br>\nGeneral Atomics Electromagnetic Systems (GA-EMS) designs and manufactures first-of-a-kind electromagnetic and electric power generation systems. GA-EMS’ expanding portfolio of specialized products and integrated system solutions support critical fleet, space systems and satellites, missile defense, power and energy, and process and monitoring applications for defense, industrial, and commercial customers worldwide.\n<br><br>\nWe currently have an exciting opportunity for a Computer Engineering Intern to join our Missile Defense and Space Systems Engineering Group located in Fredericksburg, VA. This position is available for undergraduate students to participate in supervised practical training in a professional field.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Participates in the day to day activities of assigned functional area assisting in the completion of non-routine and advanced tasks.</li><li>Assists in applying knowledge to analyze, investigate and resolve non-routine problems.</li><li>Assists in developing electronic and hard copy reports, records, diagrams and charts.</li><li>Responsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices.</li><li>Performs other duties as assigned or required.</li>\n</ul>\n\nWe recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply.\n<br><br>\n<strong>Job ID#</strong>\n<br>\n<strong>30621BR</strong>\n<br><br>\n<strong>Job Category</strong>\n<br>\nEngineering\n<br><br>\n<strong>Travel Percentage Required</strong>\n<br>\n<strong>0% - 25%</strong>\n<br><br>\n<strong>Full-Time/Part-Time</strong>\n<br>\nFull-Time Hourly\n<br><br>\n<strong>State</strong>\n<br>\nVirginia\n<br><br>\n<strong>City</strong>\n<br>\nFredericksburg\n<br><br>\n<strong>Clearance Required?</strong>\n<br>\nNo\n<br><br>\n<strong>Title</strong>\n<br>\nInternship - Computer Engineering - Summer 2021\n<br><br>\n<strong>Job Qualifications</strong>\n\n<ul>\n<li>Typically requires enrollment as an undergraduate or graduate student at a recognized college or university.</li><li>Pursuing a B.S. degree in Computer Science or Computer Engineering with interest in embedded system software and firmware development.</li><li>Ability to understand fundamentals of digital electronic designs; assembly level software/firmware programming desired.</li><li>Familiarity with schematics and layouts is a plus.</li><li>Must possess: (1) the ability to understand new concepts and apply them accurately; (2) the ability to follow general and detailed instructions as well as organizational policies and procedures; (3) good communication and interpersonal skills to enable effective interface with internal professionals; (4) the ability to work independently or in a team environment; and (5) basic computer skills.</li><li>Must commit to at least a 10 week summer internship.</li><li>3.0 GPA or above is preferred.</li><li>US Citizenship is required.</li>\n</ul>\n\n<strong>US Citizenship Required?</strong>\n<br>\nYes\n<br><br>\n<strong>Experience Level</strong>\n<br>\nInternship\n<br><br>\n<strong>Relocation Assistance Provided?</strong>\n<br>\nNo\n<br>"
    },
    {
        "position": "Software Developer - Intern",
        "company": "Lumentum Operations",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:03.531Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=108&ao=486117&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_0df328fb&cb=1608366651818&jobListingId=3749466583",
        "lastScraped": "2020-12-19T08:32:03.531Z",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n<br>\nWe're committed to bringing passion and customer focus to the business.\n<br><br>\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe Computer Science Engineering Intern’s responsibilities would include but not be limited to the following:\n<ul>\n\n<li>Optimize/improve the Test software platform to standardize the Test Status, test platform selection etc.</li>\n<li>Design and implement the software for Auto updater to deploy the released test software to different servers and different test stations at CM.</li>\n<li>Responsible to enhance the existing software to improve the genealogy of test data.</li>\n\n</ul>\n<strong>Minimum Qualifications</strong>\n<ul>\n\n<li>Qualified candidates will be enrolled in a Bachelor’s or Master’s degree program in Computer Science Engineering or a related major. Students must be returning to school following the internship.</li>\n\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n\n<li>Strong communications, initiative, and teamwork</li>\n<li>Strong experience in C# .Net and Python</li>\n<li>Strong experience using Microsoft Excel and PowerPoint</li>\n<li>Experience with production lines</li>\n\n</ul>"
    },
    {
        "position": "Summer Intern-Scholar (Tech or Non-Tech) Lumentum Diversity, Inclusion, and Belonging (DIB)",
        "company": "Lumentum Operations",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:09.514Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=109&ao=486117&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_8ee4bcbe&cb=1608366651818&jobListingId=3775601550",
        "lastScraped": "2020-12-19T08:32:09.514Z",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n<br>\nWe're committed to bringing passion and customer focus to the business.\n<br><br>\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n<br><br>\n<strong><strong>Overview</strong></strong>\n<br><br>\nWe actively ENGAGE and WIN by making meaningful contributions to society and incorporate integrity in all we do. Lumentum seeks underrepresented diverse interns to participate in our 12-week paid summer 2021 internship program; this scholarship is in support of our efforts to identify and develop a diverse talent pipeline. Upon successful completion of the summer internship, Lumentum will provide a Diversity, Inclusion, and Belonging (DIB) scholarship. Students may be in technical or non-technical majors: Engineering, Data Science, Optics and Photonics, Lasers, Computer Science/Engineering, Business, Human Resources, Communications, Supply Chain or other disciplines supporting Lumentum's core business.\n<br><br>\nIn order to be eligible for the scholarship, students must be hired into a Lumentum internship and should also apply to other internship positions open at the company. Applying to this position will help us identify qualified candidates for our intern program.\n<br><br>\nStudents will be considered from all schools but preference may be given to our core schools:\n<ul>\n<li>Alabama A&amp;M</li><li>Arizona State</li><li>Cal Poly, SLO</li><li>Delaware State</li><li>Hampton</li><li>Howard University</li><li>Michigan State</li><li>San Jose State</li><li>Santa Clara</li><li>UC Berkeley</li><li>UC Santa Barbara</li><li>University of Arizona</li><li>University of Central Florida</li><li>USC</li>\n</ul>\n<strong><strong>Minimum Qualifications</strong></strong>\n<ul>\n\n<li>Qualified candidates will be currently enrolled in a Bachelor’s, Master’s or PhD degree program. Recipient must be returning to school as full-time students following the internship and graduating no earlier than December 2021</li>\n\n</ul>\n<strong><strong>Preferred Qualifications</strong></strong>\n<ul>\n\n<li>Minimum 3.0 GPA</li>\n<li>Active membership in a diversity focused professional club for Women, Black/African-American, and/or Hispanic students related to technical/non-technical majors</li>\n<li>For Bachelor's students, in their junior or senior year as of fall 2021</li>\n\n</ul>"
    },
    {
        "position": "Technical Operations Intern",
        "company": "Cadent",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:12.733Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=110&ao=1165325&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_e1c94932&cb=1608366651819&jobListingId=3775559308",
        "lastScraped": "2020-12-19T08:32:12.733Z",
        "description": "Cadent powers the evolution of TV brand advertising. We provide marketers, agencies, operators, and media owners with data-driven solutions for buying and selling TV advertising. By connecting brands with opportunities across national inventory sourcescable, broadcast, and digital mediaour technology improves efficiencies and boosts the results of linear, addressable, and cross-screen campaigns.\n<br><br>\nAs we continue to grow, we are looking for <strong>Technical Services Intern</strong> to join our team for Spring 2021. This Intern will have an opportunity to gain hands-on experience virtually by working directly with our teams, not for them.\n<br><br>\nThis Intern will also spend the Spring on an individual project customized to their specific skill set which they'll present to our Tech Leadership team at the end of the program. Details of the projects and timeline will be laid out by supervisors at the beginning of the program.\n<br><br>\nThe Technical Services Intern will be responsible for fulfilling tasks set out by supervisors from the specific department they are working in, including but not limited to:\n\n<ul>\n<li>Attending team meetings,</li>\n<li>Performing research,</li>\n<li>Using department-specific software to complete day-to-day assignments.</li>\n</ul>\nPerks:\n\n<ul>\n<li>Competitive pay</li>\n<li>College credit (if applicable)</li> \n</ul>\nRequirements:\n\n<ul>\n<li>A rising senior pursuing a bachelor's degree in Computer Science at a college or university</li>\n<li>Able to commit to a part-time (20 hours per week) work schedule between February 16th 2021 April 27th, 2021</li>\n<li>Excellent verbal and written communicators</li>\n<li>Self-motivated with a desire to learn from a rapidly growing company</li>\n<li>Confident to take initiative and collaborate with teammates</li>\n<li>Excellent problem-solving skills</li>\n</ul>\nOur hiring teams are looking for candidates with one and/or more of the following technical skills:\n\n<ul>\n<li>Creation and Updates to Dashboard Monitoring</li> \n\n<li>Shell/BASH Automation and Scripting</li> \n\n<li>Application Log Query Creation and Optimization</li>\n<li>Technical Documentation Reviews</li>\n</ul>\nSo, if the leading edge of media technology is the place you want to be, apply today and let's start the conversation!\n<br><br>\n/CADENT/ is an EOE M/F/D/V. We do not work with 3rd Party Staffing Agencies<br><br>]]&gt;"
    },
    {
        "position": "Software Development Intern",
        "company": "Leidos",
        "location": {
            "city": "Columbia",
            "state": "MD"
        },
        "posted": "2020-12-19T08:32:15.988Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=111&ao=1031994&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_8e4f6159&cb=1608366651820&jobListingId=3775411811",
        "lastScraped": "2020-12-19T08:32:15.988Z",
        "description": "<p><b>Description</b> </p> <p></p><h2><b><u>Job Description:</u></b></h2><p>Job Description</p><p>The successful candidate will support efforts that will focus on developing/maturing our technology and capabilities in one or more technical areas including, but not limited to, cyber security, mobile apps, key management, and cloud computing.<br> </p><p>BASIC QUALIFICATIONS: </p><p>- Current enrollment in a Bachelor’s degree in Computer Science, Electrical / Computer Engineering, or Mathematics.</p><p>- Understanding of UNIX/Linux. -Understanding of Object Oriented programming languages. </p><p>- US Citizenship required.<br>- Ability to obtain DoD TS/SCI clearance with polygraph and willingness to undergo the requisite background investigation.</p><p></p><p>PREFERRED QUALIFICATIONS: </p><p>- Possess knowledge of Cloud concepts such as Hadoop, algorithms, or similar. </p><p>- Possess knowledge of mobile app development</p><p></p><h2><u>External Referral Bonus:</u></h2>Ineligible<p></p><h2><b><u>Potential for Telework:</u></b></h2>Yes, 10%<p></p><h2><b><u>Clearance Level Required:</u></b></h2>Top Secret/SCI with Polygraph<p></p><h2><b><u>Travel:</u></b></h2>No<p></p><h2><b><u>Scheduled Weekly Hours:</u></b></h2>12<p></p><h2><b><u>Shift:</u></b></h2>Day<p></p><h2><b><u>Requisition Category:</u></b></h2>Intern<p></p><h2><b><u>Job Family:</u></b></h2>Intern Technical<p></p><h2><b><u>Pay Range:</u></b></h2><p> </p> <p>Leidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world’s toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company’s 38,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Va., Leidos reported annual revenues of approximately $11.09 billion for the fiscal year ended January 3, 2020. For more information, visit www.Leidos.com.</p><p>Pay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.</p><p>Leidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.</p><p>All qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.</p><p></p><p></p>"
    },
    {
        "position": "SI&T Intern",
        "company": "RTX",
        "location": {
            "city": "Gurley",
            "state": "AL"
        },
        "posted": "2020-12-19T08:32:20.189Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=112&ao=1044074&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_1406865f&cb=1608366651820&jobListingId=3775325812",
        "lastScraped": "2020-12-19T08:32:20.189Z",
        "description": "<div><p><b>2021 Systems Integration and Test Intern!</b><br>\n<br>\nSystems Integration and Test (SI&amp;T) is the central focus for all integration, verification, validation and test activities within Raytheon Missiles and Defense (RMD). Our team members provide their expertise to ensure customer success through the design, development and execution of innovative and comprehensive test, verification and validation strategies, processes, tools and techniques. SI&amp;T employees are involved in all aspects of test including: design-for-test, integration, subsystem, and component level testing through Customer sell-off of our most sophisticated systems and technologies.<br>\n<br>\n<b>Systems Engineering Intern</b><br>\n<br>\nWhat is Systems Engineering? What does a Systems Engineer do? Systems Engineering contributes to programs throughout the entire product development lifecycle, from inception through development, sell-off, deployment, and operations and maintenance in the field.\n<br>\n<br>\nSystems Engineers work within an interdisciplinary process that ensures that the customer's needs are satisfied throughout a system's entire life cycle. This process is comprised of the following seven tasks:<br>\n<br>\n1. State the problem. Stating the problem is the most important systems engineering task. It entails identifying customers, understanding customer needs, establishing the need for change, discovering requirements, and defining system functions.<br>\n<br>\n2. Investigate alternatives. Alternatives are investigated and evaluated based on performance, cost, and risk.<br>\n<br>\n3. Model the system. Running models clarifies requirements, reveals bottlenecks and fragmented activities, reduces cost and exposes duplication of efforts.<br>\n<br>\n4. Integrate. Integration means designing interfaces and bringing system elements together so they work as a whole. This requires extensive communication and coordination.<br>\n<br>\n5. Launch the system. Launching the system means running the system and producing outputs to verify that the system does what it was intended to do.<br>\n<br>\n6. Assess performance. Performance is assessed using figures of merit, technical performance measures, and metrics - measurement is the key. If you cannot measure it, you cannot control it. If you cannot control it, you cannot improve it.<br>\n<br>\n7. Re-evaluation. Re-evaluation should be a continual and iterative process with many parallel loops.<br>\n<br>\n<br>\n<b>Job Description\n</b><br>\n<br>\nOpportunities for Interns require individuals to use engineering, math, and teamwork skills to perform various engineering activities, such as requirements development, system test and validation planning and execution, modeling and simulation, data analysis, flight test analysis, and overall systems integration. Successful SI&amp;T Engineers are curious about the way things work and interact. Interns assist in the integration and testing for the complex defense systems of our business product lines. Testing includes hardware and software.<br>\n<br>\nDuties could include developing test or integration strategies and procedures, debugging and testing functions and interfaces, conducting performance studies and data analysis on air defense, radar, ship or Homeland Defense systems and/or their subsystems. Writing data analysis tools is also part of our work along with supporting sophisticated state-of-the-art integration and test facilities. Interns work under the guidance of one or more experienced engineers. Some assignments offer the opportunity for short term travel.<br>\nIf you are on your way to obtaining a BS, or MS in Electrical Engineering, Computer Engineering, Systems Engineering, Aerospace Engineering, or Computer Science, here is your opportunity to pursue an exciting career within our organization.\n<br>\n<br>\nU.S. Citizenship status is required as this position needs an active U.S Security Clearance as of day one of employment.<br>\n<br>\n<b>Basic Qualifications</b>:</p><ul><li>\nActive participation in an accredited university program which will culminate in a B.S. or M.S. degree in Electrical Engineering, Computer Engineering, Systems Engineering, Aerospace Engineering, Computer Science, or other STEM degree</li><li>\nAbility to obtain DOD security clearance; U.S. citizenship is required.</li></ul>\n<br>\n<b>Desired Qualifications:</b><ul><li>\nGPA 3.0 or Higher</li><li>\nInterest in defense companies and defense work and producing NoDoubt solutions for our nation’s warfighters and first responders\n</li><li>Educational background or interest in the following areas:\n<ul><li>Signal Processing and Control theory\n</li><li>Statistics, random processes and detection methods\n</li><li>Imaging / pattern recognition\n</li><li>Data filtering and processing techniques (e.g. Kalman, batch, optimal)\n</li><li>Cyber security, encryption, information assurance\n</li><li>Radar Architecture or algorithms\n</li><li>Model based engineering and architecture\n</li><li>Simulating and modeling for school projects</li></ul></li></ul><ul><li>\nExperience using measuring tools such as Matlab® or LabVIEW™ for engineering assignments\n</li><li>Candidate demonstrates interest in the integration, test, verification, and validation activities of complex systems by citing accomplishments from school projects, Co-ops, Internships or hobbies\n</li><li>Strong computer skills: Perl, shell scripting, C, C++, real-time programming, Matlab, Ada, Java, Unix, Linux\n</li><li>Strong math and analytical skills\n</li><li>Radar or defense systems domain knowledge\n</li><li>Excellent written and oral communication skills\n</li><li>Ability to work in a collaborative team environment\n</li><li>Ability to pursue information (self-starter)\n</li><li>Activity/ leadership in college campus organizations or community service\n</li><li>Familiarity with Microsoft Office toolset (Word, PowerPoint, Excel)\n</li></ul><p>If you are ready to contribute to our team and mission success, apply now!\n</p>172757<br>\n<p>\nRaytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.</p></div>"
    },
    {
        "position": "Computer Science/Computer Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "OH"
        },
        "posted": "2020-12-19T08:32:24.008Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=113&ao=6101&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_ef9c48a0&cb=1608366651821&jobListingId=3775225858",
        "lastScraped": "2020-12-19T08:32:24.008Z",
        "description": "<strong>Applied Optimization (AO) Job Description</strong>\n<br><br>\n<strong>Job Title:</strong>  Computer Science/Computer Engineering Intern\n<br><br>\n<strong>Reports to:</strong> Principal Scientist\n<br><br>\n<strong>FLSA Status:</strong> Part-Time (Non-Exempt)\n<br><br>\n<strong>Position Objective:</strong><ul>\n<li>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms <strong>in the areas of mechanical engineering or space science</strong></li>\n</ul>\n<strong>Essential Functions:</strong>\n\n<ul>\n<li>Aid in designing, building, testing, and implementing software applications for space science applications</li>\n\n<li>Provide technical support for object modeling and algorithm development for new generation science applications</li>\n\n<li>Perform verification, documentation, and quality assurance for new and existing software</li>\n\n<li>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work</li>\n\n<li>Other related duties as assigned</li>\n</ul>\n<strong>Required Qualifications:</strong><ul>\n<li>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record</li>\n\n<li>General understanding of software development and knowledge of various coding languages</li>\n\n<li>Attention to detail and effective time and schedule management skills</li>\n\n<li>Effective organizing, planning, debugging, and problem-solving skills</li>\n\n<li>Ability to adapt within a small team to support evolving customer requirements</li>\n\n<li>Ability to execute instructions and communication in written, oral, and diagram form</li>\n\n<li>Demonstrated strong writing, fact-gathering, and analytical skills</li>\n\n<li>Basic computer and software skills including, but not necessarily limited to, Microsoft Office products (e.g., Outlook, Word, Excel, and Power Point)</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher</li>\n\n<li>Minor or dual degree in mathematics, engineering, or physics/astronomy</li>\n\n<li>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages</li>\n\n<li>Knowledge or experience in CSS, Django, D3-data visualization, and Linux</li>\n\n<li>Knowledge of computer operating systems</li>\n\n<li>Ability to occasionally work 2nd shift</li>\n</ul>\n<strong>Citizenship/Security Clearance Requirements:</strong>\n\n<ul>\n<li>U.S. Citizen or Green Card Holder</li>\n\n<li>May be required to obtain and maintain U.S. Government Security Clearance</li>\n</ul>\n<strong>About Our Internships:</strong>\n\n<ul>\n\n<li>\n<em>Hours:</em> The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the students class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.</li>\n</ul>\n<strong>About Us:</strong> <strong>Applied Optimization</strong> is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.\n<br><br>\nThis job description is subject to change.\n<br><br>\n<strong>Please Contact:</strong>\n<br><br>\nhr@appliedo.com"
    },
    {
        "position": "Software Engineer Intern",
        "company": "AppFolio",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:27.641Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=114&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_259059ad&cb=1608366651821&jobListingId=3749090067",
        "lastScraped": "2020-12-19T08:32:27.641Z",
        "description": "<div><p><b>Hi, We’re AppFolio.</b></p><p>\nWe’re innovators, changemakers, and collaborators. We’re more than just a software company — we’re a cloud-based powerhouse that creates products to make our customers’ lives easier. We’re revolutionizing the way people do business, and we want your ideas, your enthusiasm, and your passion to help us keep on innovating.</p><p><b>\nWe love where we work, and you can, too.</b></p><p>\nTo find out more about what AppFolio has to offer, check out <b>appfolioinc.com/careers</b>.</p><p>\nWe are hiring a Full Stack Software Engineering Intern for Spring or Summer of 2020 to contribute to our rapid product development pace. We work collaboratively to set the technical direction for our SaaS products, developing easy-to-use solutions for our customers. Our engineers find a deep satisfaction in building things that customers actually need. We focus on delivering value to customers and understand that this often means delivering code that isn't perfect, but meets customer needs.</p><p>\nThis is an ideal opportunity for someone who has a passion for building leading edge software and is driven to help build a successful SaaS product used by thousands of happy businesses. We foster an environment that empowers small teams to collaboratively set the technical direction of our solutions.</p><p>\nThis opening is on our <b>AppFolio Property Manager </b>product development team.</p><p><b>\nResponsibilities:</b></p><ul><li>\nDevelop scalable, robust, and simple web-based solutions to solve complex business problems</li><li>\nFormulate, implement, and evaluate algorithms and database queries to support SaaS scalability and stability.</li><li>\nImplement new features and optimize existing ones to drive maximum performance</li><li>\nUse test-driven development, code reviews and continuous integration to deliver high quality software, and rapidly fix bugs as they come up.</li><li>\nWork closely with, and incorporate feedback from other engineering team members, QA, and product owners, and our APM customers</li><li>\nLeveraging agile practices, encourage collaboration, prioritization, and urgency to develop at a rapid pace</li><li>\nResearch, share, and recommend new technologies and trends</li></ul><p><b>\nYou know you’re the right fit if…</b></p><ul><li>\nYou’ve heard of Ruby and Rails, and have some experience working with a language like Ruby, Java, or Python. You may even know enough about Javascript to have opinions about how frequently \"the new hot thing\" changes.</li><li>\nYou love learning about new technologies, but understand the value of continuing to use something old if it still does everything you need it to do.</li><li>\nYou care about the long-term maintainability of the codebase and will learn to advocate for refactoring and clean-ups where appropriate.</li><li>\nYou care about work life balance and want your company to care about it to; you'll put in the extra hour when needed but won't let it become a habit.</li></ul><p><b>\nAdditional Skills and Knowledge:</b></p><ul><li>\nCurrently pursuing BS, MS, or Ph.D in Computer Science or related technical discipline</li><li>\nHands-on work/internship experience developing web-based applications, preferably in a SaaS environment</li><li>\nCreativity, ability to solve complex problems without a roadmap</li></ul><p><b>\nNice to Have:</b></p><ul><li>\nExperience working across all levels of the development stack</li><li>\nExperience with some areas of our tech like Ruby on Rails, React, Redux, AWS, SOA</li><li>\nFamiliarity with Agile software development processes: Scrum or Kanban</li><li>\nFamiliarity with Test-Driven-Development</li></ul><p>\nIf you are interested in creating exceptional SaaS products, and contributing to a successful company, apply today!<br>\n<br>\nWe gladly accept applicants who meet only a few of these requirements. If AppFolio sounds like a place you'd fit, we’d love to hear from you. Talented engineers come from varied experience backgrounds!</p><p><b>\nOur Story</b></p><p>\nAppFolio (NASDAQ: APPF) was founded in 2006 with the mission to revolutionize vertical industry businesses by providing great software and service. Our easy-to-use, cloud-based software helps our customers more effectively market, manage, and grow their businesses. Today our software solutions exist in two verticals including the real estate (AppFolio Property Manager, AppFolio Property Manager PLUS, and AppFolio Investment Manager) and legal (MyCase) industries.</p><p>\nTo find out more about what AppFolio has to offer, check out <b>appfolioinc.com/careers</b>.</p></div><p></p>"
    },
    {
        "position": "Software Engineer Undergraduate Intern",
        "company": "Intel",
        "location": {
            "city": "Phoenix",
            "state": "AZ"
        },
        "posted": "2020-12-19T08:32:30.816Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=115&ao=1136006&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_a93fc0d8&cb=1608366651821&jobListingId=3775322985",
        "lastScraped": "2020-12-19T08:32:30.816Z",
        "description": "<div><b>Job Description</b><br>\n<p></p><p>\nAutomation organization hires talented software engineers to create, develop, test, and support factory automation systems that enable Intel to manufacture leading edge semiconductors.</p><p>\nAs a Software Engineer Intern, you will partner with other software engineers on development and validation of quality, reliable software systems.</p><p></p><p>\nResponsibilities include but not limited to:</p><ul><li>\nDesigning and developing applications</li><li>\nDeveloping databases</li><li>\nEnabling automated software testing and executing regression test cases</li></ul><p><br>\nThe ideal candidate should exhibit the ideal behavioral traits:</p><ul><li>\nPassion for technology and software</li><li>\nAnalytical problem solving, troubleshooting skills, written and oral communication skills</li><li>\nTeamwork skills and partnership skills</li><li>\nDemonstrate tolerance of ambiguity and self-motivation</li></ul><p></p><p><b>\nThis is an internship which will take place in 2021 and compensation will be given accordingly based on candidate education level and internship duration.</b></p><p></p><p><br>\n<b>\nQualifications</b><br>\n</p><p></p><p><b>\nYou must possess the below requirements to be initially considered for this position.</b></p><p><b>\nPreferred qualifications are in addition to the requirements and are considered a plus factor in identifying top candidates.</b></p><p><b>\nKnowledge and/or experience listed below would be obtained through a combination of your school work and/or classes and/or research and/or relevant previous job and/or internship experiences.</b></p><p></p><p><b>\nRequirements</b></p><ul><li>\nPursuing a bachelor's degree in Computer Science or Computer Engineering, or related discipline.</li><li>\n3+ months of experience working with Object Oriented Programming (C#/WPF, Asp.Net, or Java)</li></ul><p><br>\n<b>\nPreferred Qualifications</b></p><p><br>\n3+ months of working knowledge in one ore more of the following areas:</p><ul><li>\nKnowledge of Microsoft development tools (Visual Studio, .NET)</li><li>\nAutomated Testing and Scripting</li><li>\nMicrosoft operating system</li><li>\nOracle or Microsoft database technologies</li><li>\nFamiliarity with Agile and/SCRUM process</li><li>\nFamiliarity with Angular and/or REST APIs</li></ul><p></p><b>\nInside this Business Group</b><br>\n<p>\nAs the world's largest chip manufacturer, Intel strives to make every facet of semiconductor manufacturing state-of-the-art - from semiconductor process development and manufacturing, through yield improvement to packaging, final test and optimization, and world class Supply Chain and facilities support. Employees in the Technology and Manufacturing Group are part of a worldwide network of design, development, manufacturing, and assembly/test facilities, all focused on utilizing the power of Moore’s Law to bring smart, connected devices to every person on Earth</p><p></p><p><br>\n<b>\nPosting Statement</b><br>\n<br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.</p></div><p></p>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Viasat",
        "location": {
            "city": "Germantown",
            "state": "MD"
        },
        "posted": "2020-12-19T08:32:34.288Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=116&ao=4120&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_e9151aee&cb=1608366651822&jobListingId=3690385140",
        "lastScraped": "2020-12-19T08:32:34.288Z",
        "description": "<h3>Job description</h3>\n<br>\n <div><div><div><div>Bigger challenges. Bolder ideas. Global impact. At Viasat, we’re on a mission to deliver connections with the capacity to change the world. We’re the company behind the world’s fastest satellite internet service, with technology that’s helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide.</div> <br>\n<div>We’re looking for passionate, innovative professionals to join our team and connect the world to more. You’ll work in a collaborative and inclusive environment that values diverse perspectives and continuous learning, and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world’s first truly global Internet Service Provider. Interested in joining our mission? Take a look at career opportunities at Viasat today.</div></div><br>\n<div><strong>Job Responsibilities</strong>\n<br><br>\nResponsibilities include understanding customer requirements, design, development, and deployment of rich, innovative web and embedded applications.\n<br><br>\nFlexibility to work among different project teams dedicated to:\n<ul>\n<li><div><div>Web application engineering</div></div></li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>Currently pursuing a Bachelor’s degree or higher in Computer Science &amp; Applications, Computer Science and Computer &amp; Systems Engineering, Computer Science &amp; Engineering, Computer Science &amp; Mathematics, Computer Science &amp; Network Security and Math &amp; Computer Science, and/or a related field</li><li>Experience with or desire to learn full stack development</li><li>Experience using an object oriented language (Java, C++)</li> <li>Exposure or desire to work with any of the following; C/C++, Python, JavaScript, Robot, Node, Angular, React, Golang and Docker, Bash</li><li>Experience with or desire to learn Linux networking basics like TCP/IP, Firewalls, Routing, Network Namespaces/Docker Networking</li><li>Able to commit to a 10-12 week summer internship</li>\n</ul>\n<strong>Preferences</strong>\n<ul>\n<li>Previous internship experience is a plus</li></ul></div>\n</div>Network engineeringEmbedded system application engineeringSystem infrastructure development; scripting, automation, &amp; dashboardingDistributed enterprise software applications</div>\n\n<br><h3>Additional Requirements and information</h3><br>\n\n <div>Minimum education:<br>\n<div>High School Diploma or GED</div></div><br>\n\n<div>Years of experience:<br>\n<div>0-1 years</div></div><br>\n\n<div>Travel:<br>\n<div>Up to 10%</div></div><br>\n\n<div>Citizenship:<br>\n<div>US Citizenship Required</div></div><br>\n\n<div>Worker Classification:<br>\n<div>Intern</div></div>\n<br>"
    },
    {
        "position": "Software Engineering Undergraduate Intern",
        "company": "Intel",
        "location": {
            "city": "Folsom",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:37.523Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=117&ao=37049&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_d077a0f7&cb=1608366651822&jobListingId=3775173391",
        "lastScraped": "2020-12-19T08:32:37.523Z",
        "description": "<strong>Job Description</strong><br><br>Responsibilities may be quite diverse of a nonexempt technical nature. U.S. experience and education requirements will vary significantly depending on the unique needs of the job. Job assignments are usually for the summer or for short periods during breaks from school.\n<br><br>\n<strong>Qualifications</strong><br>\n<div><div><div><div>This position is associated with the sale of Intel's NAND memory and storage business to SK Hynix (You can read more about the transaction in the press release - https://newsroom.intel.com/wp-content/uploads/sites/11/2020/10/nand-memory-news-q-a.pdf). The transaction will enhance the resources and potential of the business' storage solutions, including client and enterprise SSDs, in the rapidly growing NAND Flash space amid the era of big data.\n<br><br>\nThis is an exciting time to be at Intel - come join our SSD Firmware organization and work on one of the most advanced 3DNAND and SSD technology portfolios in the world. As the global leader in the semiconductor industry, Intel possesses many industry-leading SSD technologies including the most capable Quadruple Level Cell (QLC) NAND Flash products. You will be part of a world-class team that will transition to lead the SSD business at SK Hynix.\n<br><br>\nThis position aligns to Phase 1 of the transaction, which includes the 3DNAND enterprise and client SSD business. Phase 1 is expected to close in late 2021, subject to regulatory approvals and other customary conditions. At deal close, all employees aligned to this phase of the transaction will transition to SK Hynix.</div></div></div></div>\n<br>You must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Relevant experience can be obtained through school work, classes and project work, internships, military training, and/ or work experience.\n<br><br>\nThis position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelors degree with three years related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelors degree and less than three years experience.\n<br><br>\n<strong><u>Minimum Requirements:</u>\n<br>\n</strong>\n<br>\nThe candidate must be pursuing a BS Degree in Electrical Engineering, Computer Engineering, Software Engineering or Computer Science.\n<br><br>\n<u><strong>Minimum 3 months of experience in the following:</strong></u>\n<ul>\n<li>Knowledge of Python, Unit Test &amp; Validation Principles.</li><li>Strong background on data structures &amp; algorithms</li><li>Desire to learn new technologies such as Docker, Ansible &amp; Artifactory</li>\n</ul>\n<u><strong>Preferred Qualifications:</strong></u>\n<ul>\n<li>3+ months working with diverse team environment and in cross-site organizations.</li><li>3+ months experience in Windows and Linux development.</li><li>Experience with enterprise tools such as Git/Github, Jira, &amp; Jenkins</li>\n</ul>\n\n<strong>Inside this Business Group</strong><br><br>Non-Volatile Solutions Memory Group: The Non-Volatile Memory Solutions Group is a worldwide organization that delivers NAND flash memory products for use in Solid State Drives (SSDs), portable memory storage devices, digital camera memory cards, and other devices. The group is responsible for NVM technology design and development, complete Solid State Drive (SSD) system hardware and firmware development, as well as wafer and SSD manufacturing.\n<br><br>\n<strong>Posting Statement</strong>\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."
    },
    {
        "position": "Software Engineer Intern Undergrad",
        "company": "Intel",
        "location": {
            "city": "Folsom",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:41.503Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=118&ao=37049&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_36317b75&cb=1608366651823&jobListingId=3775173440",
        "lastScraped": "2020-12-19T08:32:41.503Z",
        "description": "<strong>Job Description</strong><br><br>In this role you will be part of Test Automation team that provides automated execution and software solutions to firmware engineering groups. The systems involve large sets of software technology, including server-clients architecture, CI schedulers, MVC modules, database management, and Angular UI technologies. Responsibilities may include, but are not limited to:\n\n\n<ul>\n<li>You will be part of a small team of engineers who build and support various software tools.</li>\n<li>Write integration test</li>\n<li>Verify software using CI Tools such as Jenkins</li>\n<li>Bugs Fixing and small enhancements</li>\n</ul>\n\nThe ideal candidate should demonstrated the following behavioral traits:\n\n\n<ul>\n<li>Self-motivated individual willing to take and follow directions with little supervision and deliver to schedule</li>\n<li>Quantitative, analytical, and problem solving skills, problem/conflict resolution skills</li>\n<li>Effective prioritization and time management skills</li>\n<li>Demonstrated Customer communications skills as internal/external customer</li>\n<li>Communicative and clear orientation to results\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nThis position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelors degree with three years related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelors degree and less than three years experience.\n<br><br>\nYou must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nMust be pursuing a BS Degree in Electrical Engineering, Computer Engineering,\n<br><br>\nSoftware Engineering or Computer Science.\n<br><br>\n<strong>Preferred requirements:</strong>\n<br><br>\nUnderstand Relational and NoSQL database management concepts\n<br><br>\nBe willing to write Python scripts to automate data transition.\n<br><br>\nUp to learning new technology independently , also work as a part of the development team to deliver the results.<br><br><strong>Inside this Business Group</strong><br><br>Non-Volatile Solutions Memory Group: The Non-Volatile Memory Solutions Group is a worldwide organization that delivers NAND flash memory products for use in Solid State Drives (SSDs), portable memory storage devices, digital camera memory cards, and other devices. The group is responsible for NVM technology design and development, complete Solid State Drive (SSD) system hardware and firmware development, as well as wafer and SSD manufacturing.\n<br><br>\n<strong>Posting Statement</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."
    },
    {
        "position": "2021 Summer Intern - Technology Majors - Jersey City / Parsippany",
        "company": "Fiserv",
        "location": {
            "city": "Jersey City",
            "state": "NJ"
        },
        "posted": "2020-12-19T08:32:44.666Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=119&ao=134075&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_52f9424f&cb=1608366651823&jobListingId=3775150868",
        "lastScraped": "2020-12-19T08:32:44.666Z",
        "description": "Position Description\n<br>\n<h1><strong><strong>2021 - Summer Intern Technology Majors</strong></strong></h1><h1><strong><strong>Jersey City / Parsippany</strong></strong></h1><br><br><strong><strong>Program Overview:</strong></strong>\n<br><br>\nOur Summer Intern program offers hardworking college students an opportunity to go beyond the classroom to develop leadership skills and gain relevant hands on experience working as part of a global support team with professionals across the enterprise. Additionally, interns will participate in scheduled activities throughout the summer, including sessions with Senior Leaders, site tours, volunteer opportunities, and other social events. Fiserv interns are in session from June 7, 2021 August 13, 2021 and work approximately 40 hours per week.<br><br><h2><strong><strong>Job Description:</strong></strong></h2><br><br>Fiserv is currently looking for innovative and motivated <strong>Technology and Product Interns</strong> to participate in the 10 week 2020 Summer Internship Program. Technology areas such as Application Development, Global &amp; Cyber Security, Mobile Solutions, Network Engineering and Quality Assurance are offering internships; each will provide training curriculum, mentoring, and on the job experiential learning.\n<br><br>\nInterns will work with Technology professionals learning much needed skills such as coding, testing and support application software; work with senior analysts and experienced teammates; offer innovative suggestions; participate in quality inspections; support in ongoing documentation of existing process, with mentorship, and other complicated projects. Assignments serve to offer practical experience and broad exposure to the organization. Specific activities vary by assignment.\n<br><br>\n<strong><strong>Qualifications:</strong></strong>\n<ul>\n<li>Progress towards completion of bachelor's degree by December 2021 / May 2023 with demonstrated academic achievement</li><li>Minimum GPA of 3.0 (3.5 or above preferred)</li><li>Interest in learning and using emerging technologies (Mobile, payments, cloud computing, information security, and converging markets</li><li>Understanding of development processes and life cycles preferred (Waterfall and SCRUM/Agile)</li><li>Must have advanced Excel and PowerPoint knowledge</li><li>Strategic and creative thinking; distinguished written and oral communications skills</li>\n</ul>\n<strong><strong>Desired Technical Qualifications, expertise not required:</strong></strong>\n<ul>\n<li>C#</li><li>C / C++</li><li>Microsoft .NET</li><li>ASP .NET</li><li>Java Script</li><li>Java</li><li>COBOL</li><li>JCL</li><li>Oracle</li><li>Linux</li>\n</ul>\n<strong><strong>Majors:</strong></strong>\n<br><br>\nA wide range of college majors are considered based on specific needs of department such as: Computer Science/Network Engineering, Engineering, Mathematics, MIS, and STEM (Science, Technology, Engineering, or Math), but willing to train the right candidate.\n<br><br>\n<strong>Learn more about Fiserv:</strong>\n<br><br>\nTo support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options.\n<br><br>\nWe are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.\n<br><br>\nLife moves fast. And as it does, we know most people arent thinking about financial services. But we are.\n<br><br>\nWe help people and businesses move money and information every minute of every day. Our solutions connect financial institutions, corporations, merchants and consumers to one another, millions of times a day, behind the scenes, reliably and securely.\n<br><br>\nWere Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The companys approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.\n<br><br>\nOur Aspiration is to move money and information in a way that moves the world. As a FORTUNE 500 company and one of FORTUNE Magazine Worlds Most Admired Companies for the seventh consecutive year, we are committed to excellence and purposeful innovation.\n<br><br>\nWe welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran\n<br><br>\nExplore the possibilities of a career with Fiserv and Find Your Forward with us.\n<br><br>\n#FSINT\n<br><br>\nFiserv is an Equal Opportunity Employer/Disability/Vet. Visit http://www.careers.fiserv.com/eeo for more information."
    },
    {
        "position": "Sports Medicine Intern",
        "company": "AVANTI SPORTS MEDICINE & FITNESS",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-19T08:32:52.248Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=120&ao=1044077&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_2b560b92&cb=1608366651823&jobListingId=3775175351",
        "lastScraped": "2020-12-19T08:32:52.248Z",
        "description": "<p>AVANTI SPORTS MEDICINE &amp; FITNESS is looking to hire a Fall and Winter intern to work in our downtown office/virtually. This is a <b>NON-PAID INTERNSHIP</b> that requires your availability for one and a half days a week. The sports medicine intern will be assisting the physician with front and back office duties and performing virtual fitness programs with the patients. Additionally, there will be opportunities for working with the medical team on upcoming sporting events (post COVID)</p><p>REQUIREMENTS:</p><ul><li>College Degree/Preferably in the Sciences</li><li>Computer Literacy</li><li>Athletic Body Habitus</li><li>Strong communication skills</li><li>Outgoing personality</li><li>Fitness Backgroud/Able to produce fitness program</li><li>Reliable Transportation</li><li>Spanish is a plus</li></ul><p>The hours are as follows:</p><p>Monday: 9-6</p><p>Tues: 12-6</p><p>Wed/Thur: 1-6</p><p>Friday 1-6</p><p>Please submit your resume for review.</p><p>Thank you</p><p>Sports Medicine Intern</p><p>Avanti Sports Medicine &amp; Fitness</p><p>www.AVANTIFITSPORTSMED.com</p><p>www.facebook.com/AVANTIFITSPORTSMED</p><p>www.facebook.com/AVANTIREGENERATIVEMED</p><p>www.facebook.com/AVANTIPERFORMMEDMASSAGE</p><p>415-363-0466 O</p><p>888-438-3449 F</p><p>Job Types: Part-time, Internship</p><p>Pay: Up to $1.00 per year</p><p>Schedule:</p><ul><li>Day shift</li><li>Monday to Friday</li></ul><p>COVID-19 considerations:<br>You will be provided with PPE for protection when interacting with any patients. Dr. requires that her patients have a COVID negative test to enter the facility</p><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Epic: 1 year (Preferred)</li></ul><p>License/Certification:</p><ul><li>Drivers Licence (Preferred)</li><li>Social Security Number (Preferred)</li></ul>"
    },
    {
        "position": "Summer Internship: Software Engineer Intern",
        "company": "Raytheon Intelligence & Space",
        "location": {
            "city": "Huntsville",
            "state": "AL"
        },
        "posted": "2020-12-18T08:32:55.532Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=121&ao=1091461&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_3b9792c6&cb=1608366651824&jobListingId=3775060106",
        "lastScraped": "2020-12-19T08:32:55.532Z",
        "description": "<div>Software Engineer Intern<br>\nHuntsville AL<br>\n<br>\nJob Description:<br>\n<br>\nThis position is for a summer intern to support the Battle Management/Sensor Resource Management (BM/SRM) product teams on C2BMC in Huntsville, AL. The selected candidate will be given tasks appropriate for their level and will work with mentors to develop their skills as needed.<br>\n<br>\nRequired Skills:\n<ul><li>Experience with Java or C++ software development; or Software Testing; or Software Integration</li><li>\nMust have taken several computer science courses, including Java and/or C++, and some additional courses like Data Structures, Algorithms, Computer Security, and/or Operating Systems.</li></ul><br>\nRequired Education (including Major):\n<ul><li>Currently enrolled in a 4-year college or university seeking a B.S in Information Technology (IT), Computer Science, Math, Engineering, or Physical Sciences (For non-Computer Science majors, prefer minor in Computer Science or strong coursework in several Computer Science courses).</li></ul><br>\n<p></p><br>\n172991<br>\n<p>\nRaytheon Technologies is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</p></div>"
    },
    {
        "position": "Software Engineering Intern - Orlando, FL",
        "company": "Lockheed Martin",
        "location": {
            "city": "Orlando",
            "state": "FL"
        },
        "posted": "2020-12-18T08:32:58.834Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=122&ao=133498&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_5e320f22&cb=1608366651824&jobListingId=3659996036",
        "lastScraped": "2020-12-19T08:32:58.834Z",
        "description": "<strong>Description:</strong>As a Software Engineering Intern at Lockheed Martin, you will join one of the largest networks of software professionals, implementing cutting edge technologies on both existing and new development products. You will be helping us solve the worlds most difficult challenges, developing industry leading technology and products in the areas such as: EO/IR Targeting and Surveillance Systems, Advanced Threat Warning Systems, Combat and Defense Missile development.\n<br><br>\nYou will be involved in all phases of the Software Development Life Cycle; design, code, test, integration, verification and field integration support, facilitated by an Agile software development work flow. You will have the opportunity to utilize your skills in many different technical areas including: object oriented software development, real-time embedded development for multi-core and multi-processor systems, development for multiple operating systems (VxWorks, Linux, Windows), defensive cyber security/product protections, image/signal processing, image/inertial tracking, servo/mechanism controls, machine learning, image/data fusion, mission planning and field maintenance application development, other GUI development to support test and verification.\n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nCurrently enrolled in an accredited degree program pursing a Bachelors or Masters degree in Computer Engineering, Software Engineering, Computer Science, Math, or related major.\n<br>\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>3.0 GPA or above</li>\n<li>Software development experience in C/C++</li>\n<li>Familiarity and understanding of differences between relevant C++ standards (ie. C++98; C++11; C++17, etc)</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Experience with Software integration and debugging techniques.</li>\n<li>Experience with Object Oriented design and associated documentation.</li>\n<li>Detailed understanding of Operating System concepts/features/differences (Linux, VxWorks, Windows)</li>\n<li>Experience with Software Continuous Integration (CI) toolchains/pipelines (configuration management, automated unit testing, static analysis, etc)</li>\n<li>Experience with GUI development utilizing C++/Qt framework or C#</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n<br>\njob.Qualifications\n<br><br>\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nJoin us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. Theyre dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.\n<br><br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br>\n<strong>EXPERIENCE LEVEL:</strong>\n<br>\nCo-op/Summer Intern"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Fort Worth",
            "state": "TX"
        },
        "posted": "2020-12-18T08:33:02.245Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=123&ao=133498&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_dfda8dd3&cb=1608366651825&jobListingId=3659995965",
        "lastScraped": "2020-12-19T08:33:02.245Z",
        "description": "<strong>Description:</strong>Lockheed Martin Aeronautics Engineering and Technology is looking for Software Engineer Interns to support all our exciting opportunities. Our programs include Advance Development Programs, F-35, F-22, F-16 and Air Mobility Platforms. This role is for a Software Engineer.\n<br><br>\nNote: This position is located at an access controlled facility, Only US Citizens may be considered.\n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nPursuing a Bachelor's degree in Computer Science or Computer Engineering. Other Engineering degrees considered with significant engineering software development experience.\n<br>\nExperience with programming software languages such as C++ and/or Java.\n<br>\nObject Oriented Programming Principles\n<br>\n<strong>Desired Skills:</strong>\n<br>\n<strong>Desired skills :</strong>\n<br>\nRhapsody or other model-based software development\n<br>\nC#, Python, and/or PERLPython\n<br>\nAgile Software Development Experience\n<br>\nAbility to Travel\n<br>\nAbility to build and maintain relationships, collaborate with others, engage in constructive conflict, and manage interpersonal dynamics\n<br>\nStrong decision making and judgment\n<br>\nOral and written communication skills\n<br>\n<strong>BASIC QUALIFICATIONS:</strong>\n<br>\njob.Qualifications\n<br><br>\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nJoin us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. Theyre dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.\n<br><br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br>\n<strong>EXPERIENCE LEVEL:</strong>\n<br>\nCo-op/Summer Intern"
    },
    {
        "position": "Systems Software Engineer Intern - Vertica (US - REMOTE)",
        "company": "Micro Focus",
        "location": {
            "city": "Phoenix",
            "state": "AZ"
        },
        "posted": "2020-12-18T08:33:06.259Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=124&ao=242900&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_9c4bf796&cb=1608366651825&jobListingId=3690214251",
        "lastScraped": "2020-12-19T08:33:06.259Z",
        "description": "Systems Software Engineer Intern - Vertica (US - REMOTE)<br><br><strong>Job Description:</strong>\n<br><br>\n<strong>Title:</strong> <strong>Systems Software Engineer Intern - Vertica (US - REMOTE)</strong>\n<br><br>\n<strong>Location: Remote Eligible</strong>\n<br><br>\nVertica believes that each of us knows the work environment that makes us the most productive. That’s why we provide our employees with the ability to work how and where they will be the most successful. We enable a flexible approach to work location, meaning for roles where it makes sense, you can work from the office or from home, or a combination of both, but you make that choice including where you choose to live. Vertica invests in the best technologies and provides flexible benefits and collaborative work environments to empower employees to work productively in the setting that meets their personal needs. That’s why we’re so proud to have a highly productive and engaged team in every function of the company.\n<br><br>\nVertica provides a state-of-the-art Big Data Analytics platform that handles petabytes of data. It is a commercially successful, high performance, distributed database. We build tools which support many different use-cases, being flexible enough to be used for many applications. In this position, you would work on the core query engine components of Vertica, building features, improving performance, and fixing bugs. Write high performance C++ code! Figure out tricky concurrent algorithms! Create designs which will support parallelism and concurrency!\n<br><br>\nThe ideal candidate has knowledge of: (bold items required)\n<ul>\n<li><strong>C/C++</strong></li><li><strong>Multi-threading</strong></li><li><strong>Essential algorithms and data structures</strong></li><li><strong>Excellent technical communication</strong></li><li>SQL</li><li>Distributed systems</li><li>Database internals</li>\n</ul>\nYou must be pursuing a degree in Computer Science, Computer Engineering, or a related field.\n<br><br>\nYou can expect to learn more about all of the above, plus:\n<ul>\n<li>How to design changes which support real customer needs</li><li>How to debug a complex system</li><li>Working on a team</li><li>Testing your code</li><li>Practical software optimization techniques</li><li>Planning and executing on a software project</li>\n</ul>\n<strong>About our team</strong>\n<br><br>\nThe best ideas often come from fresh perspectives. At Vertica, our open-minded, diverse and inclusive team is always learning from each other. We approach intellectually challenging work with a \"get it done\" attitude. Vertica Engineers are given significant latitude and support to pursue what they are passionate about to make Vertica an even better place. If you are excited about building great technology with a proactive team, you will find yourself in good company at Vertica. Welcome to the family.\n<br><br>\n<strong>About our product</strong>\n<br><br>\nVertica is a recognized leader in analytics powering some of the world’s most data driven organizations like Uber, Wayfair, Intuit, Cerner, and more. Our columnar, MPP, distributed database delivers unprecedented speed, petabyte scale, with analytics and machine learning functions built into the core.\n<br><br>\nWe believe the future belongs to the fast. Join us for the ride!\n<br><br>\n<strong>Job:</strong><br><br>Administration<br><br><strong>Micro Focus is proud to be an Equal Opportunity Employer. Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</strong>"
    },
    {
        "position": "Science and Regulatory Intern",
        "company": "ARKRAY USA, Inc.",
        "location": {
            "city": "Minneapolis",
            "state": "MN"
        },
        "posted": "2020-12-18T08:33:10.574Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=125&ao=1044074&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_36f92296&cb=1608366651825&jobListingId=3774819653",
        "lastScraped": "2020-12-19T08:33:10.574Z",
        "description": "<div><p>Be involved with a company that is changing the lives of people across the globe.</p><p>\nARKRAY is currently hiring a Science and Regulatory Intern who has an interest in supporting ongoing pre-market development projects, contributing to FDA submissions, conducting quality control testing of commercialized products, and expanding their knowledge of the in vitro diagnostic (IVD) medical device industry.</p><p>\nThis internship will be for thespring semester and also offers the opportunity to take ownership of a semester long project of your own. You will choose a topic within ARKRAY's purview that interests you and, with the approval of your supervising scientist, plan, research, experiment, and report on your topic of interest.</p><p><b>\nDuties and Responsibilities</b></p><ul><li>\nReview and prepare study protocols.</li><li>\nParticipate in lab testing of different IVD products.</li><li>\nCapture test results, perform basic data analyses, and prepare draft study reports.</li><li>\nSupport related administrative activities.</li><li>\nComplete one project of your choosing.</li><li>\nOther duties and responsibilities as assigned.</li></ul><p><b>\nKnowledge and Skills</b></p><ul><li>\nUndergraduate or Graduate students pursuing degrees in Chemistry, Biology, Life Sciences, Engineering, Regulatory Affairs, or similar fields. Recent graduates are also eligible to apply.\n</li><li>Have a grade point average of 3.0 or better (on a 4.0 scale).</li><li>\nBasic computer skills and knowledge of common programs such as Microsoft Word, Excel, PowerPoint.</li><li>\nFamiliarity with statistical analysis tools or related course work is preferred.</li><li>\nEligible to work in the United States.</li></ul><p>\nARKRAY is an Equal Opportunity Employer: minorities, women, veterans, and individuals with disabilities are encouraged to apply.</p></div>"
    },
    {
        "position": "Symitar Software Engineer, Intern",
        "company": "Jack Henry and Associates, Inc.",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2020-12-18T08:33:14.318Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=126&ao=1044074&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_db543ee2&cb=1608366651825&jobListingId=3774818718",
        "lastScraped": "2020-12-19T08:33:14.318Z",
        "description": "<div><div>A Symitar Software Engineer, Intern will work alongside experienced subject matter experts at JHA to participate in the technical design and implementation of new products and enhancements. The chosen candidate will have the opportunity to participate in all phases of the development cycle; including concept, technical design, prototype, code development, testing, and release to QA and implementation.</div><div></div><br>\n<div>\nA student can expect to work on projects such as boosting the productivity of the IRS compliance releases or improving the customer experience around ACH posting. These deliverables will provide real customer and shareholder value.</div><div></div><br>\n<div><b>\nTo be successful, a student should have advanced working knowledge in Java, C#, SQL, and HTML.</b></div><div></div><br>\n<div>\nThe internship program begins June 7, 2021 and ends August 13, 2021. Based on successful completion of the 10-week program and business-unit need, continued employment may be offered. This position will be hired out of San Diego, CA.</div><div></div><br>\n<div><b>\nMinimum Qualifications</b><br>\nStudents Must:</div><ul>\n<li>Attend an accredited college or university.</li>\n<li>Pursue a bachelor’s degree or higher in: Software Engineering, Computer Science, Computer Information Sciences, Artificial Intelligence, Computer Architecture and Engineering, or Computer Networks.</li>\n<li>Have a cumulative 3.0 GPA.</li>\n<li>Remain in good academic standing throughout internship.</li>\n<li>Meet JHA employment requirements.</li>\n<li>Be able to work up to 40 hours per week throughout the summer internship.</li>\n<li>Be a senior at time of internship start date, at minimum.</li>\n<li>Meet legal requirements to work in the U.S. for an indefinite period of time.</li></ul><br>\n<div></div><br>\n<div><b>Preferred Qualifications</b></div><ul>\n<li>Microsoft and other modern programming/software engineering related certifications and/or an active desire to pursue such certifications.</li>\n<li>A curiosity and drive to provide contemporary approaches and ideas with enough self-independence to follow that curiosity.</li>\n<li>Basic understanding of today’s modern Fintech industry.</li></ul><br>\n<div></div><br>\n<div><b>Essential Functions</b></div><ul>\n<li>Works on projects and tasks that are pertinent to the needs of the business unit by applying knowledge, experience and/or education.</li>\n<li>Works with other team members to learn and assist with projects relevant to the department and pursuit of degree.</li>\n<li>Assists the team in their day-to-day functions of servicing our clients or internal customers.</li>\n<li>Assisting with special projects as needed.</li>\n<li>Essential functions to be specified at the department level.</li>\n<li>Begins with a new employee orientation and concludes 10 weeks later with a final project retrospective.</li>\n</ul><div>Equal Employment Opportunity</div><div><div><p>\nAt Jack Henry, we know we are better together. We value, respect, and protect the uniqueness each of us brings. Innovation flourishes by including all voices and makes our business—and our society—stronger. Jack Henry is an equal opportunity employer. We are committed to a work environment that supports, empowers, inspires, and respects all individuals and in which personnel processes are merit-based and applied without discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, marital status, age, disability, national or ethnic origin, military service status, citizenship, or any other characteristic protected under applicable federal, state, or local law.</p><p></p><p>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p><p></p><p>\nNo one will be subject to, and Jack Henry prohibits, any form of discipline, reprisal, intimidation, or retaliation for good faith reports or complaints of incidents of discrimination of any kind, pursuing any discrimination claim, or cooperating in related investigations.</p><p></p><br>\n<p>\nDECIND2</p></div></div></div><div></div>"
    },
    {
        "position": "Software Development Intern - Summer",
        "company": "Tyler Technologies",
        "location": {
            "city": "Troy",
            "state": "MI"
        },
        "posted": "2020-12-18T08:33:18.416Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=127&ao=4128&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_0ba6478c&cb=1608366651826&jobListingId=3719888503",
        "lastScraped": "2020-12-19T08:33:18.416Z",
        "description": "We are seeking software development interns to join our fast-paced, dynamic team during the summer of 2021. In this role, you will conduct research, test, and write code for our large-scale, mission-critical software products used by Public Safety agencies (i.e. Police, Fire, and 911 Dispatch) across the U.S.\n<br><br>\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Work on a 12-week software development project with a team of interns and/or full-time engineers</li><li>Use Microsoft .NET technologies and other software tools to solve problems that have an immediate impact on our product operations</li><li>Receive mentorship and guidance from our highly accomplished development team members, participate in team meetings and work on actual projects in our commercial software products</li><li>Learn and practice Agile/Scrum development methodologies in a highly collaborative, self-organizing team environment</li><li>Write code, be creative, and solve complex technical problems on a daily basis</li>\n</ul>\n\n<h2>Qualifications<br>\n</h2>\n\n<ul>\n<li>Computer Science or Software Engineering major</li><li>Junior or Senior status with 3.0 minimum GPA preferred</li><li>Passion for software development, technology, and learning</li><li>Excellent team interaction skills</li>\n</ul>"
    },
    {
        "position": "Software Development Intern | Summer 2021",
        "company": "Builders Mutual",
        "location": {
            "city": "Raleigh",
            "state": "NC"
        },
        "posted": "2020-12-18T08:33:21.630Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=128&ao=1091461&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_cf449ec2&cb=1608366651827&jobListingId=3748499065",
        "lastScraped": "2020-12-19T08:33:21.630Z",
        "description": "<div><div>At Builders Mutual, we take pride in creating a highly talented team, from our interns to executives dedicated to serving and providing commercial insurance coverage exclusively to the construction industry. It’s not just our specialty—it’s all we do. You will see that we set high standards of accountability, personal responsibility, and achievement. Our core values of people, teamwork, and results support our vision and reflect our identity to get the job done right.</div><div></div><br>\n<p><b>\nMake an impact as you gain meaningful experience and build your career toolbox!</b></p><p>\nOur intern program is focused on meaningful work that leaves an impact after you complete your intern experience while developing your technical, collaborative, professional, and interpersonal skills. You will thrive on a winning team in our employee-driven culture while networking with employees and executives.</p><div></div><br>\n<p><b>\nInternship Experience:</b></p><p><b>\nIntern Orientation and Capstone Presentation:</b><b> </b>We set you up for success with an orientation to kick start your program. Then, when your experience is complete, you will share your successes with our executives and leadership team.</p><div><b>\nCustomized Departmental Training and Shadowing:</b><b> </b>Learn and shadow the inner workings of your specific department and how your team contributes to the overall success of Builders Mutual.</div><div><b>\nDedicated Intern Manager:</b> Receive regular feedback from your manager, participate in career-related discussions, and provide feedback.</div><div><b>\nGiveBack</b><b>: </b>Contribute to the community with our summer volunteer project</div><div><b>\nBuilders University and Social Events:</b> Participate in weekly professional development sessions, individual assessments, and leadership roundtable discussions to build your career toolbox.</div><div><b>\nNetworking &amp; Intern Buddy</b>: Connect with industry experts, leaders, and your assigned new grad buddy to build your professional network.</div><div><b>\nRaleigh or Virtual</b>: Regardless of what is happening in our world, you will have a meaningful experience at our headquarters in Raleigh or remote from your home or college campus.</div><div><b>\nNew grad opportunities</b>: Take advantage of your intern experience while being a top performer; you may have an opportunity to join the Builders Mutual team after graduation.</div><div></div><br>\n<p><b>\n2021</b> <b>Software Development Intern</b>:</p><div>\nLike to develop and build software? Software developers are the creative minds behind software programs, and they have the technical skills to create and develop programs. You will build essential solution development skills through web apps, web services, testing, and release automation that allow you to understand how the software development function fits into the insurance life cycle. Your strengths will include innovation, focus, analytical, and communication skills. You will develop C# .NET Core and service-oriented architecture skills that allow our customers to see us differently and give us a competitive advantage in the industry.</div><div></div><br>\n<p><b>\nSkills to get the </b><b>INTERNSHIP</b><b> done RIGHT:</b></p><ul><li>\nCurrent undergraduate student working towards a degree in Computer Science, Computer Engineering, or related degree with a planned graduation between Spring 2022 and Fall 2023.</li><li>\nExperience or course work with Object Oriented Programming is a plus, C# is a plus</li><li>\nYou've got practical experience inside or outside of school or work.</li><li>\nLeader, you have demonstrable experience (group projects and/or clubs plus engaged in class)</li><li>\nExcellent communication skills, including written, verbal and interpersonal</li><li>\nProven team player who takes the initiative and works with others to achieve team goals</li><li>\nHigh-level analytical capabilities</li><li>\nProficient use of Microsoft Office (Excel, Word, and PowerPoint) plus you can learn new software or tools quickly</li><li>\nAbility to commit for 10 weeks during the summer of 2021, working 37.5 hours per week</li><li>\nWilling to live or commute to Raleigh during your intern experience</li></ul></div>"
    },
    {
        "position": "Software Development Intern | Summer",
        "company": "Builders Mutual",
        "location": {
            "city": "Raleigh",
            "state": "NC"
        },
        "posted": "2020-12-18T08:33:24.655Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=129&ao=134462&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_463d5658&cb=1608366651827&jobListingId=3748308343",
        "lastScraped": "2020-12-19T08:33:24.655Z",
        "description": "<div>At Builders Mutual, we take pride in creating a highly talented team, from our interns to executives dedicated to serving and providing commercial insurance coverage exclusively to the construction industry. Its not just our specialtyits all we do. You will see that we set high standards of accountability, personal responsibility, and achievement. Our core values of people, teamwork, and results support our vision and reflect our identity to get the job done right.\n<br><br>\nMake an impact as you gain meaningful experience and build your career toolbox!\n<br><br>\nOur intern program is focused on meaningful work that leaves an impact after you complete your intern experience while developing your technical, collaborative, professional, and interpersonal skills. You will thrive on a winning team in our employee-driven culture while networking with employees and executives.\n<br><br>\nInternship Experience:\n<br><br>\nIntern Orientation and Capstone Presentation: We set you up for success with an orientation to kick start your program. Then, when your experience is complete, you will share your successes with our executives and leadership team.\n<br><br>\nCustomized Departmental Training and Shadowing: Learn and shadow the inner workings of your specific department and how your team contributes to the overall success of Builders Mutual.\n<br><br>\nDedicated Intern Manager: Receive regular feedback from your manager, participate in career-related discussions, and provide feedback.\n<br><br>\nGiveBack: Contribute to the community with our summer volunteer project\n<br><br>\nBuilders University and Social Events: Participate in weekly professional development sessions, individual assessments, and leadership roundtable discussions to build your career toolbox.\n<br><br>\nNetworking &amp; Intern Buddy: Connect with industry experts, leaders, and your assigned new grad buddy to build your professional network.\n<br><br>\nRaleigh or Virtual: Regardless of what is happening in our world, you will have a meaningful experience at our headquarters in Raleigh or remote from your home or college campus.\n<br><br>\nNew grad opportunities: Take advantage of your intern experience while being a top performer; you may have an opportunity to join the Builders Mutual team after graduation.\n<br><br>\n2021 Software Development Intern:\n<br><br>\nLike to develop and build software? Software developers are the creative minds behind software programs, and they have the technical skills to create and develop programs. You will build essential solution development skills through web apps, web services, testing, and release automation that allow you to understand how the software development function fits into the insurance life cycle. Your strengths will include innovation, focus, analytical, and communication skills. You will develop C# .NET Core and service-oriented architecture skills that allow our customers to see us differently and give us a competitive advantage in the industry.\n<br><br>\nSkills to get the INTERNSHIP done RIGHT:\n<ul>\n<li>Current undergraduate student working towards a degree in Computer Science, Computer Engineering, or related degree with a planned graduation between Spring 2022 and Fall 2023.</li><li>Experience or course work with Object Oriented Programming is a plus, C# is a plus</li><li>You've got practical experience inside or outside of school or work.</li><li>Leader, you have demonstrable experience (group projects and/or clubs plus engaged in class)</li><li>Excellent communication skills, including written, verbal and interpersonal</li><li>Proven team player who takes the initiative and works with others to achieve team goals</li><li>High-level analytical capabilities</li><li>Proficient use of Microsoft Office (Excel, Word, and PowerPoint) plus you can learn new software or tools quickly</li><li>Ability to commit for 10 weeks during the summer of 2021, working 37.5 hours per week</li> <li>Willing to live or commute to Raleigh during your intern experience</li> </ul></div>\n<br>"
    },
    {
        "position": "Software Developer Intern - Summer",
        "company": "Blubrry",
        "location": {
            "city": "Columbus",
            "state": "OH"
        },
        "posted": "2020-12-18T08:33:28.195Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=130&ao=46442&s=58&guid=000001767a1f77ce91cfaa8c61e02cbe&src=GD_JOB_AD&t=SR&vt=w&cs=1_3dc68d31&cb=1608366651827&jobListingId=3774539904",
        "lastScraped": "2020-12-19T08:33:28.195Z",
        "description": "RawVoice/Blubrry, a longstanding provider in the podcasting industry, is looking for a Software Developer Intern. Students currently enrolled in college are encouraged to apply.\n<br><br>\nInterns will be developing web applications using PHP, Python and MySQL for services that benefit podcast creators and listeners. Development will involve creating new services, improving and adding features and squashing a bug or two in past projects. Examples of projects include:\n<ul>\n<li>Podcast analytics system</li><li>Progressive Web App for private podcasts</li><li>Media hosting and publishing platform</li><li>Podcast directory</li><li>Hosted WordPress websites</li><li>Ad insertion system for podcasts</li>\n</ul>\n<strong>Internships are available for Summer 2021.</strong> Interns usually work on-site 40 hours a week with the development team in Columbus, Ohio. However, due to the situation with COVID-19, all teams are currently working remotely (subject to change). Internships are co-op compatible and we accept multiple rotations. Please indicate co-op program if applicable.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Currently enrolled in a Bachelor's degree program in Computer Science or related major</li><li>Understanding of a C-style language (e.g. C, C++, Java, PHP or Swift)</li><li>Excellent communication and documentation skills</li>\n</ul>\n<strong>Beneficial Skills</strong>\n<ul>\n<li>Web Development with Python or PHP</li><li>SQL/MySQL</li><li>CSS, HTML5, Bootstrap, and/or JavaScript</li><li>WordPress theme/plugin development</li><li>Amazon Web Services</li><li>Linux</li>\n</ul>"
    },
    {
        "position": "Software Configuration Specialist Intern",
        "company": "Duck Creek Technologies ",
        "location": {
            "city": "Bolivar",
            "state": "MO"
        },
        "posted": "2020-12-18T08:33:33.208Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=201&ao=1049132&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_d4961446&cb=1608366654519&jobListingId=3689904027",
        "lastScraped": "2020-12-19T08:33:33.208Z",
        "description": "Challenging convention. Trying new things. Reshaping an industry.\n<br><br>\nThe team at Duck Creek helps insurance companies bring amazing ideas to life quickly and easily with software that thinks and works like they do. We're fueled by sharing ideas openly, challenging conventions, trying new things, and valuing \"Why not?\" over \"Why?\" Our certainty that there is always a better way to do things keeps carriers ahead of their competition and is helping to reshape an industry.\n<br><br>\nIf having a hand in transforming one of the world’s oldest and largest industries into a standard for innovation, open exchange, and peerless user experience sounds exciting, let us know. We may be looking for you.\n<br><br>\n<strong>Software Configuration Specialist Intern</strong>\n<br><br>\nThe Software Configuration Specialist Intern supports a project team in delivering technical implementation tasks for customers. The Software Configuration Specialist Intern is expected to learn basic implementation concepts while working under direct supervision and receiving instruction for completing assigned tasks.\n<br><br>\n<strong>ESSENTIAL JOB FUNCTIONS/RESPONSIBILITIES</strong>\n<ul>\n<li>Assists in designing the software configuration to meet the business process design and application requirements.</li><li>Develops working knowledge of the product or product line in order to provide pre-sales support, solution planning, product management expertise and customer support.</li><li>Works with other developers, designers, and architects to ensure the configuration and custom components meet application requirements and performance goals.</li><li>Participates in code reviews and fix any defects and performance problems discovered in testing.</li><li>Works primarily with internal project teams while having limited and supervised interaction with the customer</li><li>Performs other related duties and activities as required.</li>\n</ul>\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n<br><br>\n<strong>QUALIFICATIONS/REQUIREMENTS</strong>\n<ul>\n<li>Pursuing Bachelor’s degree in Computer Science or related field</li><li>No work experience required</li><li>Excellent communication skills, verbal and written</li><li>Strong analytical and problem-solving skills.</li><li><strong>Work Authorization:</strong> Legally authorized to work in the country of the job location.</li><li><strong>Physical:</strong> Exerting up to 10 pounds of force occasionally and/or negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting most of the time. Jobs are sedentary if walking and standing are required only occasionally and all other sedentary criteria are met.</li>\n</ul>"
    },
    {
        "position": "Java Developer Intern",
        "company": "Internet Brands",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        },
        "posted": "2020-12-18T08:33:37.438Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=202&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_6f722738&cb=1608366654520&jobListingId=3748097358",
        "lastScraped": "2020-12-19T08:33:37.438Z",
        "description": "<div>Los Angeles based Internet Brands is currently looking for a Java / big data intern developer. The ideal candidate is either a starting Java developer with a keen interest in data, or a budding data scientist who is eager to further their Java development skills. Either way, we're looking for a self-starter who is hungry to tackle big challenges, can prioritize tasks with minimal guidance, and can communicate effectively with both technical and business personnel.<br>\n<br>\nThis is a very desirable opportunity to join a high-profile team in its early stages. You'll be able to participate in the team's growth across the enterprise, while you grow your own skills with the latest technology.\n<br>\n<br>\n<b>Responsibilities:</b><br>\n<ul><li>Write code, review code by teammates, develop unit tests, and investigate bugs. This is a coding / engineering position.</li><li>Contribute to performant and scalable solutions for high-volume consumer web sites, such as WebMD, CarsDirect.com, etc.</li><li>Participate in design discussions with other engineers.</li><li>Collaborate with other teams to help roll out solutions across the company.</li><li>Participate in feature discussions with business personnel.</li><li>Work alongside operations teams on deployment tooling, monitoring, logging, and DevOps.</li></ul><br>\n<b>\nQualifications:</b><br>\n<ul><li>Proficiency with core Java technologies such as Spring Framework and Maven, or with big-data technologies such as Kafka and Spark.</li><li>Experience with either SQL or NoSQL databases, or other data storage tools such as Hadoop.</li><li>Experience with a version control system like Git or Subversion.</li><li>Strong technical, design, and communication skills.</li><li>Microscopic attention to detail.</li><li>Self-motivation, and a strong desire to learn and master new technologies.</li><li>BS or MS in Computer Science, mathematics, data science, electrical engineering, or equivalent work experience.</li></ul><br>\nAbout Internet Brands:<br>\n<br>\nHeadquartered in El Segundo, Calif., Internet Brands® is a fully integrated online media and software services organization focused on four high-value vertical categories: Health, Automotive, Legal, and Home/Travel. The company's award-winning consumer websites lead their categories and serve more than 250 million monthly visitors, while a full range of web presence offerings has established deep, long-term relationships with SMB and enterprise clients. Internet Brands' powerful, proprietary operating platform provides the flexibility and scalability to fuel the company's continued growth. Internet Brands is a portfolio company of KKR and Temasek. For more information, please visit www.internetbrands.com.\n<br>\n<br>\nInternet Brands and its wholly owned affiliates are an equal opportunity employer.</div>"
    },
    {
        "position": "Data Engineering Intern, Data Science and Engineering",
        "company": "Netflix",
        "location": {
            "city": "Los Gatos",
            "state": "CA"
        },
        "posted": "2020-12-17T08:33:41.299Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=203&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_06a7e65a&cb=1608366654521&jobListingId=3747917035",
        "lastScraped": "2020-12-19T08:33:41.299Z",
        "description": "<div></div><div><div><div><div><div><div><div><div>Los Gatos, California</div><div>\nRemote, United States</div></div></div></div><p></p><div><div><div><div>\nData Science and Engineering</div></div></div></div></div></div><div><div>\nWho are we?</div><div>\nNetflix is the world's leading streaming entertainment service with 195+ million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Netflix is reinventing entertainment from end to end. We are revolutionizing how shows and movies are produced, pushing technological boundaries to efficiently deliver streaming video at massive scale over the internet, and continuously improving and personalizing how content is presented around the globe.</div><div></div><br>\n<div>\nData Science and Engineering (DSE) team at Netflix is aimed at improving various aspects of our business. Data Engineers within DSE, are focused on providing our colleagues rich data so that we can make decisions on how to bring the most joy to our subscribers via compelling content, personalized product interactions, and stellar customer service. As well as building datasets to better understand and continuously improve efficiency in studio productions, platform utilization, and membership growth. Data Engineering function is foundational to the success of those areas and is an exciting space to gain hands-on experience with new technologies and unique culture.</div><div></div><br>\n<div><h2><b>\nWho are you?</b></h2><ul><li>\nCurious and motivated learner - competing for an MS/PhD degree in Computer Science, Engineering, Math, Statistics, graduating in Winter 2021 or Summer 2022.</li><li>\nClear communicator - you are concise and articulate in speech and writing</li><li>\nCoursework or some experience with data structures and dimensional data modeling, ETL, data warehouse architecture</li><li>\nUnderstand principles of distributed systems (Hadoop, Spark, MPP)</li><li>\nPractical knowledge of scripting languages (ideally Python or Scala)</li><li>\nAble to write a SQL query with minimal guidance</li></ul></div><div><h2><b>\nWhat will you learn?</b></h2><ul><li>\nBuild large-scale batch and real-time pipelines with data processing frameworks like Spark or Flink</li><li>\nCollaborate on designing components of analytical data model</li><li>\nDesign technical and business driven data audits to ensure data quality</li><li>\nMonitor and troubleshoot data issues in the data pipelines</li><li>\nCollaborate with other Data Engineers and build relationships with Analytics and ML Engineers, and Data Scientists</li><li>\nLearn how to work closely with business stakeholders in a high paced environment</li></ul></div><div></div><br>\n<div>\nThe Summer Internship</div><div>\nOur approach to internships is different: like Netflix itself, we offer a personalized experience for interns, and our aim is to offer an experience that mimics what it is like to actually work here. We match qualified interns with projects and groups based on interests and skill sets, and fully embed interns within those groups for the summer. Netflix is a unique place to work and we live by our values, so it's worth learning more about our culture.</div><div></div><br>\n<div>\nInternships will be a minimum of 12 weeks, with timing flexible to candidate needs. We expect these internships to be remote. Conditions permitting, we will aim to bring the intern cohort together for an optional experience at some point during the summer.</div><div></div><br>\n<div>\nNetflix is an equal opportunity employer that celebrates diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div></div></div><div><div><div>\nAPPLY NOW<p>\n</p></div><div><p>Share this listing:</p><div></div><div><div><div><div>\n</div></div></div><p></p><div><div><div>LINK COPIED</div></div></div></div></div></div></div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Apple",
        "location": {
            "city": "Sacramento",
            "state": "CA"
        },
        "posted": "2020-12-17T08:33:44.567Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=204&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_8959c366&cb=1608366654523&jobListingId=3747877713",
        "lastScraped": "2020-12-19T08:33:44.567Z",
        "description": "<div><div><div><div><p>Summary</p><div><div>\nPosted: <b>Nov 18, 2020</b></div><div>\nWeekly Hours: <b>40</b>\n</div><div>Role Number:<b>200207676</b></div></div></div><div>\nImagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\nAt Apple, it’s the diversity of people and their ideas that encourage the innovation and runs through everything we do, from amazing technology to industry-leading environmental efforts.</div></div></div><div><div><div><div><div><div>\nKey Qualifications</div></div></div><div><div><ul><li>\nA self-starter who loves to innovate</li><li>\nPassionate about learning to solve business problems with data</li><li>\nWillingness to learn new languages and technologies</li><li>\nAttention to details and concern of accuracy</li><li>\nFamiliar with any major programming languages like Java, Python, JavaScript, Go</li><li>\nStrong computer science fundamentals, including data structures, algorithms, and software design</li><li>\nWorking with high volume, business critical, transactional and complex data profiles</li></ul></div></div></div></div><div><div><div><div><div>\nDescription</div></div></div><div><div>\nApple's Strategic Data Solutions (SDS) team is seeking a Software Engineer intern who is passionate about learning and enjoys coding. During your internship on the Strategic Data Solutions team, you will be participating in design, modeling, development and testing of SDS systems. You will also get the opportunity to contribute in high level design discussions regarding system architecture and features. In accordance with your area of study, we will assign you a project related to system development, optimizations or new technology development.\nOur commitment to you: We will guide you through a challenge with opportunity for growth, recognition and accomplishment. As we learn more about you, we’ll connect you with mentors and teammates to assist in your personal and professional development. You’ll work cross-functionally with teams across Apple and gain valuable experience driving security improvements in a high tech environment.\nWhat we expect: High energy, positive attitude. Bring the best version of yourself. Be prepared to be curious, creative and to make an impact.</div></div></div></div><div><div><div><div><div>\nEducation &amp; Experience</div></div></div><div><div>\nCurrently enrolled in a degree-granting program pursuing a B.S. or M.S. in computer science, computer engineering, or closely related fields with equivalent experience.</div></div></div></div><div><div><div><div><div>\nAdditional Requirements</div></div></div><div><div><div><ul><li>Involvement in all the phases of software development within the team</li><li>Deliver high quality software using industry’s best practices</li><li>Developing efficient solutions for modeling, processing, and persisting data</li><li>Highly desirable to have knowledge of distributed data processing platforms (Hadoop, Hive, Spark, Kafka, etc.)</li></ul></div></div></div></div></div></div></div>"
    },
    {
        "position": "Machine Learning Research Intern",
        "company": "Baidu USA",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2020-12-17T08:33:49.805Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=205&ao=921511&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_457b6bb7&cb=1608366654525&jobListingId=3747866881",
        "lastScraped": "2020-12-19T08:33:49.805Z",
        "description": "Baidu Research USA is actively seeking talents with a Machine Learning background to join our vibrant research team in our Silicon Valley office. Our research team has board research interests among many different areas, such as natural language processing, speech synthesis and recognition, and more. The candidate will have the opportunity to work with top researchers on various exciting research projects. The ideal candidate should have solid machine learning related knowledge and experience to work together with the teammates on the research, implementation, experimentation, and analysis of algorithms. As a research intern at Baidu, you will benefit greatly by working in our creative environment.\n<br><br>\n<strong>Requirements:</strong>\n\n<ul>\n<li>Students enrolled in a PhD program in machine learning, computer science, statistics, or a related field.</li>\n<li>At least 2 years of relevant industry or research experience.</li>\n<li>Good knowledge of common machine learning models.</li>\n<li>Expertise in one or more of the following areas: natural language processing, computer vision, speech synthesis or recognition, computational biology, optimization, generative models.</li>\n<li>Strong publication record and good presentation and communication skills.</li>\n<li>A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design.</li>\n<li>Expert knowledge developing and debugging in python, C/C++ or CUDA is a plus.</li>\n</ul>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Conduct scientific research to design, implement, and evaluate novel machine learning algorithms.</li>\n<li>Collaborate with other researchers in developing machine learning algorithms.</li>\n<li>Prepare presentations and technical paper drafts to demonstrate research findings and experimental results.</li>\n<li>Participate in software prototyping and experimental evaluation.</li>\n</ul>\n<strong>Culture Fit:</strong>\n\n<ul>\n<li>Mission alignment: If you want to be part of a team to accomplish this great mission, we will provide you the best possible platform to do that.</li> \n\n<li>Self­-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting and useful things to do?</li>\n<li>Hungry to learn: We are eager to see you learn new skills and grow. But learning is hard work and this is something we hope you want to do.</li>\n<li>Team orientation: We work in small, fast­-moving teams. We don't believe in lone wolves. We watch out for each other and go after big goals together as a team.</li>\n</ul>"
    },
    {
        "position": "Security Engineer Intern",
        "company": "Linode",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2020-12-17T08:33:54.380Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=206&ao=1044074&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_de622c85&cb=1608366654525&jobListingId=3718707098",
        "lastScraped": "2020-12-19T08:33:54.380Z",
        "description": "<div><p>Linode's Security Engineer Intern is responsible for working on the analysis and implementation of tools and leveraging a mix of open source solutions as well as commercial off the shelf software to strengthen the security posture at Linode. The individual who is in this role is expected to do a comparative study on the feasibility of different reactive and proactive tools for security analytics, intrusion detection and prevention, and vulnerability detection through static, dynamic, and dependency analysis. There will be an emphasis on the concise documentation of feasibility and efficacy before initiating the implementation of potential solutions.</p>\n<p>The ideal intern will understand the current process and security posture at Linode and help Linode's agile culture to a Secure agile culture to mitigate future threats through optimized security controls, procedures, and automation.</p>\n<h1><b>Primary Responsibilities</b></h1>\n<ul><li>Build proof of concept or proof of value security control prototypes within the scope provided by Linode CISO.</li><li>\nParticipate in security projects including but not limited to: asset inventory &amp; classification, Identity &amp; Access Management, SOC, vulnerability management, configuration hardening/attack surface reduction.</li><li>\nTriage vulnerabilities submitted by security researchers through Hackerone and other threat/vulnerability sources.</li><li>\nAnalyze &amp; monitor external threats and develop mitigation solutions to protect Linode's services.</li><li>\nConduct advanced security research and development as requested.</li><li>\nImplement, maintain, and improve the accuracy of existing automation tools (SAST/DAST, DevOps, configuration hardening, etc.) to help reduce false positives.</li><li>\nResearch &amp; propose avenues to add security solutions from code editors (where code writing starts) through production (where code finally rests) – CI/CD pipeline through scripts.</li><li>\nIdentify hardware-related vulnerabilities and develop solutions to mitigate them.</li><li>\nHelp in the gap analysis if compliance-related audits emerge within the tenure.</li></ul>\n<ul><li>Instill a secure-by-design culture throughout the entire company by educating security best practices using effective principle-based persuasion techniques.</li></ul>\n<h1><b>Minimum Qualifications:</b></h1>\n<ul><li>Obtained or working towards a degree closely related to this position (Computer Science, CyberSecurity, etc)</li><li>\nUnderstanding of Linux, virtualization, and networking concepts</li><li>\nComputer Science fundamentals like complexity analysis, computational logic, and standard sort/search algorithms.</li><li>\nStrong communication skills to work with both collaborative cross-functional team of peers and departments within the company (product development, operations, networking, etc.)\n</li></ul><h1><b>Work With Us</b></h1><ul><li>\nFlexible work hours: We have flexible start times and a very generous paid time off package.</li><li>\nUnbelievable benefits: We provide comprehensive health insurance, 401(k) contributions, a profit-sharing program, and pension plans.</li><li>\nMonthly wellness reimbursements: up to $100 towards gym memberships, diet plans, massages, etc.</li><li>\nA Macbook Pro: to use around the office and at home.</li><li>\nFree hosting service: Take advantage of some Linode service - we'll pick up the tab.</li><li>\nLinode Lunch: What goes better with technology than food? Nothing. We bring in a catered lunch every week.</li><li>\nCompetitive salary: It all begins with fair compensation. We believe in paying people well and rewarding those who go the extra mile.</li></ul>\n<p>Since 2003, Linode has been providing cloud computing services to customers around the world. Linode offers compute, storage, and networking services from ten data centers in regions spanning across North America, Europe, Asia, and Oceania. We are committed to making Linode the most simple, powerful, and reliable hosting provider that thousands of customers—from the fastest-growing startups to established enterprises—trust. This industry moves fast, but we strive to hire the kind of people who can stay a step ahead and keep us - and themselves - at the top. We are an equal opportunity employer and we are committed to building a diverse, inclusive, and welcoming workplace for all.</p></div>"
    },
    {
        "position": "Intern, Software Engineering",
        "company": "EDF Renewables",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2020-12-17T08:33:58.512Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=207&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_ce52c49f&cb=1608366654525&jobListingId=3718445761",
        "lastScraped": "2020-12-19T08:33:58.512Z",
        "description": "Corporate Office, 15445 Innovation Dr, San Diego, California, United States of America Req #821\n<br>Wednesday, October 21, 2020\n<br><br>\nEDF Renewables North America, a subsidiary of EDF Renewables, is a leading North American independent power producer boasting over 30 years of experience across a broad spectrum of services. Our mission is to deliver renewable solutions to lead the transition to a sustainable energy future.\n<br><br>\nThe Software Engineering Intern will develop software, design algorithms, and build hardware and software testbeds to simulate large scale EV charging deployments. The Software Engineering Intern will work with other Senior Engineers to replicate customer use cases for performance optimization and debugging. The ideal candidate should have enthusiasm for learning about distributed systems and embedded systems.\n<br><br>\nThis position is intended to be close to full-time.\n<br><br>\n<b>Responsibilities:</b><br>\n95% Software Engineer\n<br>Formulate and improve EV charging algorithms.\n<br>Formulate and improve algorithms for EV analytics.\n<br>Build and maintain physical and virtual testbeds.\n<br>Design new software or improve existing software to run on individual Arduino boards or virtualized implementations.\n<br>Build automation software for testing of emulated customer use cases.\n<br>Build tools to capture analytics and performance metrics and process and present them in easy to understand formats to facilitate discussions and reviews among team members.\n<br>Create, edit, and maintain technical documents on code and software systems\n<br>5% - Other duties as assigned\n<br><br>\n<b>Supervision of Others:</b> (Include # of direct reports and consultants for which you have authority. Do not include # of indirect reports supervised by other EDF Supervisors or Managers)\n<br><br>\nNone\n<br><br>\n<b>Qualifications:</b> (Degree/Certifications/License/Experience/Specialized Knowledge/Skills)\n<br><br>\nEducation/Experience –\n<br><br>\nCurrent Graduate or Undergraduate Student in Computer Science or Software Engineering\n<br><br>\nSkills/Knowledge/Abilities –\n<br><br>\nExperience with convex optimization tools and concepts.\n<br>Comfortable working in a startup environment that requires strong discipline and self motivation.\n<br>Experience using Linux systems, preferrably Debian derivatives such as Ubuntu\n<br>Adequate knowledge in computer networks including Ethernet, TCP/IP, and HTTP protocols\n<br><b>Good programming skills in at least two of:</b> Python, Javascript, or C/C++\n<br><b>Experience with Databases:</b> InfluxDB or other SQL like databases\n<br>Ability to write/ present technical material to audiences with diverse backgrounds\n<br>Preferred experience (not required)\n<br>Amazon Web Services (AWS)\n<br>Zigbee knowledge is a significant plus\n<br><br>\n<b>Working Conditions:</b><br>\n95% of time is spent in the office environment, utilizing computers (frequent use of various Microsoft software/programs), phones, and general office equipment. 5% of time is spent outside of the office for training, site visits, meetings as required.\n<br><br>\nWe are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.\n<br><br>\nOther details\n<br>Pay Type Hourly"
    },
    {
        "position": "Data Science Summer Intern 2021 - PhD (Multiple Locations)",
        "company": "Evidation",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2020-12-17T08:34:04.290Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=208&ao=1053597&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_5602f8c1&cb=1608366654526&jobListingId=3747672556",
        "lastScraped": "2020-12-19T08:34:04.290Z",
        "description": "<strong>*Considering candidates in Santa Barbara, San Mateo, or US based remote*</strong>\n<br><br>\nWe're seeking a highly motivated Data Science Intern to join our data science team for the Summer of 2021. We are looking for computer scientists who want to apply AI to data from medical devices to understand health and disease progression. We value problem solving skills, continuous learning, great communication and accountability. We look at every application and are excited to hire individuals with a desire to learn, ask questions, and be a part of a great team!\n<br><br>\nHere are some projects that past interns have worked on. You could be a part of important and exciting work like this:\n\n<ul>\n<li>https://arxiv.org/abs/1812.01696\\</li>\n<li>https://evidation.com/wp-content/uploads/2018/08/The-impact-of-missing-data-in-user-generated-mHealth-time-series.pdf</li>\n</ul>\n\n<h4>QUALIFICATIONS</h4>\n\n\n<ul>\n<li>Currently pursuing a PhD in Computer Science, Applied Mathematics, Health Data Science, or a related technical discipline</li>\n<li>Experience with Python and Scikit-learn</li>\n<li>Experience with statistical modeling or data analysis</li>\n<li>Strong written and verbal communication</li>\n<li>Eagerness to contribute and learn</li> \n</ul>\n\n<h4>BENEFITS</h4>\n\n\n<ul>\n<li>Flexible work hours</li>\n<li>Support for remote work when needed</li>\n<li>Relaxed work environment</li>\n<li>Opportunity to work on fascinating challenges that improve people's lives</li>\n</ul>\n\n<h5>EVIDATION HEALTH VALUES DIVERSITY AND IS COMMITTED TO EQUAL OPPORTUNITY FOR ALL PERSONS WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, MARITAL STATUS, AGE, NATIONAL ORIGIN OR ANCESTRY, POLITICAL ACTIVITY OR AFFILIATION, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION INCLUDING GENETIC CHARACTERISTICS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, SEX OR GENDER.</h5>"
    },
    {
        "position": "Data Science Summer Intern 2021 - MS, BA (Multiple Locations)",
        "company": "Evidation",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2020-12-17T08:34:10.000Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=209&ao=1053597&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_2a9a1b56&cb=1608366654526&jobListingId=3747672555",
        "lastScraped": "2020-12-19T08:34:10.000Z",
        "description": "<strong>*Considering candidates in Santa Barbara, San Mateo, or US based remote*</strong>\n<br><br>\nWe're seeking a highly motivated Data Science Intern to join our data science team for the Summer of 2021. We are looking for computer scientists who want to apply AI to data from medical devices to understand health and disease progression. We value problem solving skills, continuous learning, great communication and accountability. We look at every application and are excited to hire individuals with a desire to learn, ask questions, and be a part of a great team!\n<br><br>\nHere are some projects that past interns have worked on. You could be a part of important and exciting work like this:\n\n<ul>\n<li>https://arxiv.org/abs/1812.01696\\</li>\n<li>https://evidation.com/wp-content/uploads/2018/08/The-impact-of-missing-data-in-user-generated-mHealth-time-series.pdf</li>\n</ul>\n\n<h4>QUALIFICATIONS</h4>\n\n\n<ul>\n<li>Currently pursuing a MS or BA in Computer Science, Applied Mathematics, Health Data Science, or a related technical discipline</li>\n<li>Experience with Python and Scikit-learn</li>\n<li>Experience with statistical modeling or data analysis</li>\n<li>Strong written and verbal communication</li>\n<li>Eagerness to contribute and learn</li> \n</ul>\n\n<h4>BENEFITS</h4>\n\n\n<ul>\n<li>Flexible work hours</li>\n<li>Support for remote work when needed</li>\n<li>Relaxed work environment</li>\n<li>Opportunity to work on fascinating challenges that improve people's lives</li>\n</ul>\n\n<h5>EVIDATION HEALTH VALUES DIVERSITY AND IS COMMITTED TO EQUAL OPPORTUNITY FOR ALL PERSONS WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, MARITAL STATUS, AGE, NATIONAL ORIGIN OR ANCESTRY, POLITICAL ACTIVITY OR AFFILIATION, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION INCLUDING GENETIC CHARACTERISTICS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, SEX OR GENDER.</h5>"
    },
    {
        "position": "Systems Software Engineer Intern - Vertica (US - REMOTE)",
        "company": "Vertica Systems",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2020-12-17T08:34:13.352Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=210&ao=618763&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_161da912&cb=1608366654526&jobListingId=3689723296",
        "lastScraped": "2020-12-19T08:34:13.352Z",
        "description": "Systems Software Engineer Intern - Vertica (US - REMOTE)<br><br><strong>Job Description:</strong>\n<br><br>\n<strong>Title: Systems Software Engineer Intern - Vertica (US - REMOTE)</strong>\n<br><br>\n<strong>Location: Remote Eligible</strong>\n<br><br>\nVertica believes that each of us knows the work environment that makes us the most productive. Thats why we provide our employees with the ability to work how and where they will be the most successful. We enable a flexible approach to work location, meaning for roles where it makes sense, you can work from the office or from home, or a combination of both, but you make that choice including where you choose to live. Vertica invests in the best technologies and provides flexible benefits and collaborative work environments to empower employees to work productively in the setting that meets their personal needs. Thats why were so proud to have a highly productive and engaged team in every function of the company.\n<br><br>\nVertica provides a state-of-the-art Big Data Analytics platform that handles petabytes of data. It is a commercially successful, high performance, distributed database. We build tools which support many different use-cases, being flexible enough to be used for many applications. In this position, you would work on the core query engine components of Vertica, building features, improving performance, and fixing bugs. Write high performance C++ code! Figure out tricky concurrent algorithms! Create designs which will support parallelism and concurrency!\n<br><br>\nThe ideal candidate has knowledge of: (bold items required)\n<ul>\n<li><strong>C/C++</strong></li><li><strong>Multi-threading</strong></li><li><strong>Essential algorithms and data structures</strong></li><li><strong>Excellent technical communication</strong></li><li>SQL</li><li>Distributed systems</li><li>Database internals</li>\n</ul>\nYou must be pursuing a degree in Computer Science, Computer Engineering, or a related field.\n<br><br>\nYou can expect to learn more about all of the above, plus:\n<ul>\n<li>How to design changes which support real customer needs</li><li>How to debug a complex system</li><li>Working on a team</li><li>Testing your code</li><li>Practical software optimization techniques</li><li>Planning and executing on a software project</li>\n</ul>\n<strong>About our team</strong>\n<br><br>\nThe best ideas often come from fresh perspectives. At Vertica, our open-minded, diverse and inclusive team is always learning from each other. We approach intellectually challenging work with a \"get it done\" attitude. Vertica Engineers are given significant latitude and support to pursue what they are passionate about to make Vertica an even better place. If you are excited about building great technology with a proactive team, you will find yourself in good company at Vertica. Welcome to the family.\n<br><br>\n<strong>About our product</strong>\n<br><br>\nVertica is a recognized leader in analytics powering some of the worlds most data driven organizations like Uber, Wayfair, Intuit, Cerner, and more. Our columnar, MPP, distributed database delivers unprecedented speed, petabyte scale, with analytics and machine learning functions built into the core.\n<br><br>\nWe believe the future belongs to the fast. Join us for the ride!\n<br><br>\n<strong>Job:</strong><br><br>Administration<br><br><strong>Micro Focus is proud to be an Equal Opportunity Employer. Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</strong>"
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Intel",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2020-12-17T08:34:16.827Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=211&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_46388692&cb=1608366654527&jobListingId=3773899805",
        "lastScraped": "2020-12-19T08:34:16.827Z",
        "description": "<div><b>Job Description</b><br>\n<p>\nCome intern with one of the largest electrical engineering companies in the world!<br>\n<br>\nCome Intern with our Programmable Solutions Group (PSG)!<br>\n<br>\nYou will work on some aspect of the Intel Quartus compile system.</p><p></p><p>\nRoles and responsibilities may include to work on some of the most difficult and interesting algorithmic problems around.</p><p></p><p>\nPreferable 6 months full-time internship.</p><p></p><p>\nTo start in Spring 2021.</p><p></p><p><br>\n<b>\nQualifications</b><br>\n</p><p>\nYou must possess minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.</p><p></p><p>\nMinimum Requirements</p><p></p><p>\nThe candidate must be pursuing a Master's or PhD degree in Computer Engineering, Engineering Science, Computer Science, Math, Electrical Engineering or equivalent.</p><p></p><p>\nMinimum of 6-9 months experience in:</p><ul><li><p>\nPrograming in C/C++.</p></li><li><p>\nHigh level scripting (python and/or TCL).</p></li></ul><p></p><p>\nPreferred qualifications:</p><ul><li><p>\nDeveloping high performance, threaded software.</p></li><li><p>\nDeveloping software for CPU/GPUs/FPGAs and/or ASICS.</p></li><li><p>\nEmbedded Firmware development.</p></li></ul><p></p><b>\nInside this Business Group</b><br>\n<p>\nThe Programmable Solutions Group (PSG) was formed from the acquisition of Altera. As part of Intel, PSG will create market-leading programmable logic devices that deliver a wider range of capabilities than customers experience today. Combining Altera's industry-leading FPGA technology and customer support with Intel's world-class semiconductor manufacturing capabilities will enable customers to create the next generation of electronic systems with unmatched performance and power efficiency. PSG takes pride in creating an energetic and dynamic work environment that is driven by ingenuity and innovation. We believe the growth and success of our group is directly linked to the growth and satisfaction of our employees. That is why PSG is committed to a work environment that is flexible and collaborative, and allows our employees to reach their full potential.</p><p></p><p><br>\n<b>\nPosting Statement</b><br>\n<br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.</p></div><p></p>"
    },
    {
        "position": "Summer 2021 Computer Science & Data Science Internship",
        "company": "Ericsson",
        "location": {
            "city": "Plano",
            "state": "TX"
        },
        "posted": "2020-12-17T08:34:20.132Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=212&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_e79fc1b7&cb=1608366654527&jobListingId=3774187076",
        "lastScraped": "2020-12-19T08:34:20.132Z",
        "description": "<div><p><b>Location: Multiple locations across United States</b></p><p></p><br>\n<p>\nAs the tech firm that created the mobile world, and with more than 54,000 patents to our name, we’ve made it our business to make a mark. When joining our team at Ericsson you are empowered to <b>learn, lead and perform at your best</b>, shaping the future of technology. This is a place where you're welcomed as your own perfectly unique self, and celebrated for the skills, talent, and perspective you bring to the team. Come, and be where it begins.</p><p></p><br>\n<p><b>\nIn our exciting opportunities as an intern, you will enjoy:</b></p><ul><li>\n1:1 Mentorship\n</li><li>Intern Specific Events &amp; Projects\n</li><li>Career Development</li><li>\nPeer &amp; Senior Level Networking\n</li><li>Participation in Employee Resource Groups</li></ul><p></p><br>\n<p><b>\nIn our internship roles you will need:</b></p><ul><li>\n3.0+ GPA\n</li><li>Currently pursuing an undergraduate, Master’s, or PhD on a full-time basis at a 4-year college or university\n</li><li>Be available to work 40 hours per week during the summer\n</li><li>Have at least 1 semester left (post-internship)\n</li><li>Major, experience, or demonstrable interest in the position you apply for</li></ul><p></p><br>\n<p><b>\nWe have several positions that fall under our Computer Science &amp; Data Science Internship, we are looking for competencies that include:</b></p><ul><li>\nComputer Science, Statistics, Economics, Mathematics, Data Science, or similar quantitative discipline</li><li>\nCoding skills (such as Python, R, Java, or Scala)</li><li>\nAnalytics tools experience (such as Pandas, R, SPSS, SQL, or Hadoop)</li><li>\nExperience performing analysis with large datasets</li><li>\nExcellent communication as well as intercultural skills</li><li>\nOpen-minded and motivated to work in multicultural team</li><li>\nStrong analytical and organizational skills</li><li>\nStrong customer service orientation</li></ul><p></p><br>\n<p><b>\nThe ideal Computer Science &amp; Data Science interns should:\n</b></p><ul><li>Be enthusiastic solution finders astute in the latest technologies, but with the non-technical savvy to be a valued and respected part of their team.\n</li><li>We are looking for undergrad, Master's, MBA, and PhD students.<br>\n</li></ul><p></p><p><b>Hiring Process</b></p><p>\nOur dedicated team of University Recruiters accept applications from September through April. Most of our positions are filled during the Fall semester though, so we strongly encourage students to apply early.\n</p><p>Our hiring process is as follows:</p><ul><li>\nApply online (Sept-April)</li><li>\nIf selected: A recruiter contacts you via email or phone\n</li><li>If selected: Hiring manager interview\n</li><li>If selected: Offer extended</li><li>\nStart Internship (May or June)</li></ul><p></p><br>\n<p><b>\nWhat´s in it for you?</b></p><p>\nHere at Ericsson, our culture is built on over a century of courageous decisions. With us, you will no longer be dreaming of what the future holds – you will be redefining it. You won’t develop for the status quo but will build what replaces it. Joining us is a way to move your career in any direction you want; with hundreds of career opportunities in locations all over the world, in a place where co-creation and collaboration are embedded into the walls. You will find yourself in a speak-up environment where empathy and humanness serve as cornerstones for how we work, and where work-life balance is a priority. Welcome to an inclusive, global company where your opportunity to make an impact is endless.<br>\n </p><p></p><p><b>Are you in?</b></p><p></p><br>\n<p>\nDo you believe that an organization fostering an environment of cooperation and collaboration to execute with speed creates better business value? Do you value a culture of humanness, where fact based decisions are important and our people are encouraged to speak up? Do you believe that diverse, inclusive teams drive performance and innovation? At Ericsson, we do.</p><p></p><br>\n<p>\nDISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Therefore employees assigned may be required to perform additional job tasks required by the manager.</p><div></div><br>\n<div>\nWe are proud to be an EEO/AA employer M/F/Disabled/Veterans. We maintain a drug-free workplace and perform pre-employment substance abuse testing.</div><div></div><br>\n<div>\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetics information. Ericsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.</div><div></div><br>\n<div>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.</div><div></div><br>\n<div>\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetic information.</div><div></div><br>\n<div>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) consistent with Ericsson’s legal duty to furnish information.</div><div></div><br>\n<div>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) Employee Polygraph Protection Act Notice - Employers are generally prohibited from requiring or requesting any employee or job applicant to take a lie detector test, and from discharging, disciplining, or discriminating against an employee or prospective employee for refusing to take a test or for exercising other rights under the Act. For more information, visit https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf.consistent with Ericsson’s legal duty to furnish information.</div><div></div><br>\n<div>\nEricsson is an equal opportunity employer and is committed to providing reasonable accommodation for qualified disabled individuals during the application and hiring process. Ericsson will make modifications or adjustments to the job application or interview process that will enable a qualified applicant to be considered for a position. If you require an accommodation due to a disability, please contact Ericsson at hr.direct.dallas@ericsson.com or (866) 374-2272 (US) or (877) 338-9966 (Canada) for further assistance.</div><div></div><br>\n<div>\nPrimary country and city: United States (US) || || Plano || Stud&amp;YP</div></div><p></p>"
    },
    {
        "position": "2021 Intern - Software Developer",
        "company": "Adobe",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-17T08:34:23.607Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=213&ao=132917&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_c310ceda&cb=1608366654527&jobListingId=3747501101",
        "lastScraped": "2020-12-19T08:34:23.607Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nJob Description\n<br><br>\nAt Adobe, you will be immersed in an exceptional work environment that is recognized around the world. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely. If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\n<br><br>\n<strong>Opportunity</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences. We’re passionate about empowering people to craft beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to building exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nThe Digital Imaging Build and Release team is looking for an engineering intern to innovate and advance complex automated software build systems. Remove redundant processes and automate everything to greatly increase developer velocity to create Adobe products faster!\n<br><br>\nOur initiative will lead to rapid success for the Adobe internal development community. More specifically, the Digital Imaging Build Engineering intern will work on both the infrastructure on which Photoshop and Lightroom is compiled and built in and the development processes that the computer scientists and software engineers use to develop Adobe Applications, such as Photoshop and Lightroom. Innovations that will remove the tedious part of current workflows and help these engineers unleash their creativity by removing cumbersome code development processes and improving developer’s velocity.\n<br><br>\nWhat you'll do:\n<ul>\n<li>You will be responsible for helping us set the technical direction, making architectural decisions, and implementing complex systems to advance velocity of Photoshop.</li><li>You will always drive for high product and engineering quality in our work.</li><li>You will be responsible for defining the tools and processes required to make advances across multiple applications</li><li>You will work closely with teams across Adobe, in different geographies. The technology you produce will have visibility at the highest levels of the company and materially affect the positive impact products have on our customers.</li>\n</ul>\nWhat you need to succeed:\n<ul>\n<li>Good knowledge of Linux and/or Mac command-line utilities</li><li>Good knowledge of basic scripting languages: Shell, Bash, Python</li><li>General understanding of distributed computing</li><li>General knowledge of build object caching like Ccache</li><li>Knowledge on compiling and linking C/C++ code</li><li>An interest and a focus on build time optimization</li><li>Currently undergoing a BS, MS or PhD in Computer Science or a related field.</li><li>Outstanding command of data structures and algorithms.</li> <li>Excellent written and verbal communication skills.</li>\n</ul>\nInternal Opportunities\n<br>\nWe’re glad that you’re pursuing career development opportunities at Adobe.<br><br>Adobe"
    },
    {
        "position": "Cloud Engineer Intern",
        "company": "Adobe",
        "location": {
            "city": "Lehi",
            "state": "UT"
        },
        "posted": "2020-12-17T08:34:26.709Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=214&ao=132917&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_6586eed2&cb=1608366654528&jobListingId=3717824653",
        "lastScraped": "2020-12-19T08:34:26.709Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\n<h1><strong>The Challenge</strong></h1><br><br>Adobe’s Digital Experience Cloud Engineering organization is seeking a motivated intern to join the Microservices Infrastructure team. The “Ethos” team equips Adobe DX products with a consistent experience for promoting and running code in production at scale with high availability &amp; efficiency while abstracting away the complexity of running multi-cloud infrastructure.<br><br><h1><strong>What you'll do</strong></h1>\n\n<ul>\n<li>We create programmatic automation to build, deploy and maintain Kubernetes clusters in multiple global public cloud regions and private cloud datacenters.</li><li>We integrate diverse technologies in multiple environments to provide monitoring, alerting, and reporting of performance and costs.</li><li>We work in an agile operations framework, balancing sprint and kanban-based work with daily operational needs.</li><li>We deliver highly secure and efficient solutions within comprehensive compliance regulations, including SOC2, ISO27001, HIPAA, PCI, etc.</li><li>You'll be part of a high-performing DevOps team!</li>\n</ul>\n\n<h1><strong>What you need to succeed</strong></h1><br><br>Software engineering experience, including multiple development languages. Python, Go preferred.\n<br><br>\nExperience running services in the Public Cloud, Azure/AWS preferred.\n<br><br>\nLinux systems administration experience, large scale OS deployment and automation preferred.\n<br><br>\nExperience running software container solutions desired, Docker and Kubernetes preferred.\n<br><br>\nExperience building orchestration, automation, and monitoring solutions.\n<br><br>\nEager to learn, able to take mentorship, and able to understand that there is always more to learn.\n<br><br>\nAbility to turn design, compliance, and support references/content into documentation, presentations, and training.\n<br><br>\nDegree in Computer Science or related field, or equivalent work experience.\n<br><br>\nAbility to recommend, design, build, and support complicated solutions at scale.\n<br><br>\nUnderstanding of TCP and IP networking protocols and related technologies.\n<br><br>\nExperience running customer-facing solutions in public clouds, Azure, AWS preferred.\n<br><br>\nExperience with cluster technologies desired, Mesos, Kubernetes preferred.\n<br><br>\nKnowledge of software version control systems and release management. Git preferred.\n<br><br>\nExcellent written and verbal communication\n<br><br>\nPassionate about designing and supporting complex IT systems while also being able to run day-to-day infrastructure operations.\n<br><br>\nAnalytical with the ability to solve complex system problems.\n<br><br>\nAbility to work hard as a member of a small team that is asked to do a lot, while always remaining customer focused.\n<br><br>\nCan work well as part of a multi-functional team of developers and operations.\n<br><br>\nIs able to manage time properly such that commitments are communicated and then met.<br><br>Adobe"
    },
    {
        "position": "Intern, Software Engineering",
        "company": "Dropbox",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-17T08:34:29.954Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=215&ao=37049&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_3972fa62&cb=1608366654528&jobListingId=3657865792",
        "lastScraped": "2020-12-19T08:34:29.954Z",
        "description": "<h2>Company Description</h2><br><br><strong>Dropbox is now a Virtual First company, which means work outside of an office will be the primary experience for all employees. Being Virtual First also means the location of our employees is targeted but flexible. If Location Flexible is listed in the job title of a role, the role can be located in any of the states where Dropbox is authorized to do business.** Some roles (including those which do not have Location Flexible in the job title), however, may have to be co-located with their teams in certain locations. Please work with your recruiter and your hiring manager to understand any location constraints of a particular role and to communicate your location preferences. \n\n\n</strong><ul><strong>\n</strong><li><strong>*Dropbox is authorized to do business in many, but not all, states. If you are not located in or able to work from a state where Dropbox is registered, you will not be eligible for employment. Please speak with your recruiter to learn more about where Dropbox is registered.</strong> </li>\n</ul>\n\nDropbox is one place to keep life organized and keep work moving. With more than 600 million registered users across 180 countries, were on a mission to design a more enlightened way of working. Dropbox is headquartered in San Francisco, CA, and has offices around the world. For more information on our mission and products, visit dropbox.com.<br><br><h2>Team Description</h2><br><br>New graduates and interns at Dropbox work alongside industry leaders, architecting the growing family of products that handle over a billion files a day for people and businesses around the world. From day one, youll have the responsibility and the support you need to make a difference on a massive scale.<br>\n<div>\n<h2><strong>Role</strong> <strong>Description</strong></h2></div><br>\n\n<div>The Dropbox internship program is a top-notch learning experience for engineering students from all backgrounds. You are paired with a dedicated mentor who is committed to your success throughout your 12-week internship. You can expect to have ownership of your project, collaborate with full-time engineers, and receive consistent and effective feedback. Our goal is to create a robust and impactful learning experience. Additionally you will connect with fellow interns, establish mentors, collaborate with other Dropboxers, and build the foundation of a strong professional network. We will work to accommodate your school end and start dates but this internship has a minimum of a twelve (12) week duration over the summer.</div>\n<br>\n<div>\n<h2><strong>Responsibilities</strong></h2></div><br>\n\n<div><strong>As an intern, you will go toe-to-toe with Dropbox engineers. We offer numerous types of roles and teams that you can have an impact on. Here are some of the things you may do:</strong></div><ul><li><strong>Application</strong> <strong>Engineering</strong>- You will build delightful full-stack user experiences that tackle real customer needs and help drive tons of revenue for Dropbox. As a product engineering intern you can expect to work across backend, API, desktop, mobile and web.</li><li><strong>Infrastructure Engineering</strong>- Craft the building blocks that let us scale Dropbox to handle millions of concurrent connections, hundreds of billions of files and hundreds of petabytes of data.</li><li><strong>Analytics</strong> <strong>Engineering</strong>- Measure, optimize, and build one of the industrys most advanced analytics platforms to derive meanings from vast amounts of data. Our massive scale means youll work with more data than many other analytics firms combined.</li><li><strong>Mobile</strong> <strong>Engineering</strong>- You are an Objective-C, Swift, Java and C++ magician - this team knows the ins and outs of iOS and Android SDK and will help you weave and bend the APIs to craft the Dropbox client experience on mobile devices. You are also responsible for building the backend systems that power the mobile experiences and optimize the protocol between client and server for reliability, efficiency and speed.</li><li><strong>Front End Engineering</strong>- You will work collaboratively to help keep our websites up and running - Dropbox.com and paper.dropbox.com! In addition to everything application engineers do but you are also deeply interested in building a fast, scalable, and responsive Dropbox experience for the modern web, using cutting-edge technologies like Typescript, React, and Redux.</li><li><strong>Site</strong> <strong>Reliability</strong> <strong>Engineering</strong> <strong>(SRE)</strong>- This team lives dangerously on the boundary of software and hardware - they have a deep understanding of the inner workings of our product and are committed to ensuring our products work well on real-world hardware in our data centers. You will build the software and automation that controls the hardware that runs our products, and serve as the first line of defense when something goes with our production infrastructure or services.</li><li><strong>Security</strong> <strong>Engineering</strong>- People trust Dropbox to keep their data secure, and at Dropbox we rely on our security engineers to make our products safe. You are a software engineer with a deep interest in building software that is secure yet easy to use. A passion for the shadowy computer underworld is a definite plus. Security engineers collaborate with product teams to secure our software, production infrastructure, website, desktop and mobile apps and our corporate infrastructure and devices.</li>\n</ul>\n\n<div>\n<h2>Minimum Qualifications</h2></div>\n\n<ul>\n<li>Currently pursuing a BS (or higher, e.g., MS, or PhD) in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience</li>\n</ul>\n\n<div>\n<h2>Preferred Qualifications</h2></div>\n\n<ul>\n<li>Experience writing or shipping software as part of internships, personal projects, coding competitions or research and the work we do at Dropbox resonates with you, we would love to learn more about you!</li><li>Students with a passion to learn, problem solve, and challenge the status quo</li>\n</ul>\n\n<h2>Benefits and Perks</h2>\n\n<ul>\n<li>Dedicated Mentorship</li><li>Market competitive salary</li><li>Intern Hack Week</li><li>Housing stipend</li> <li>Employee Resource Groups</li>\n</ul>\nDropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, Latinx, Pridebox (LGBTQ), Vets at Dropbox, Women at Dropbox, ATX Diversity (based in Austin, Texas) and the Dropbox Empowerment Network (based in Dublin, Ireland)."
    },
    {
        "position": "Software Engineering Intern",
        "company": "Daylight Solutions",
        "location": {
            "city": "Melbourne",
            "state": "FL"
        },
        "posted": "2020-12-17T08:34:32.923Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=216&ao=4127&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_4fdf1535&cb=1608366654529&jobListingId=3657846526",
        "lastScraped": "2020-12-19T08:34:32.923Z",
        "description": "<div><div></div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div><strong>Job</strong> 99903\n<br><br>\nThe Electro Optical Infrared Systems (EOIS) line of business within DRS has locations in Dallas, TX, Melbourne, FL, and Cypress, CA. EOIS develops, manufactures, and supports infrared and electro-optical solutions for soldiers, ground vehicles and airborne platforms. We offer an exciting and challenging work environment, a competitive salary and benefits package, and a business culture that rewards performance.\n<br><br>\n<em> Employing the world’s brightest. Supporting the world’s bravest.</em><br>\n<div><div><div>Job Summary</div>\n<div>Work closely with, learn from, and assist software engineers in the development of various engineering assignments related to state-of-the-art products by executing SW design, coding, and documentation tasks, and assist in the testing of software within finished products, systems or subsystems. This is a paid internship opportunity.</div>\n</div><div><div>Job Responsibilities</div>\n<div>\n\n\n<ul>\n\n\t<li>Carry out basic SW engineering tasks that will help in understanding SW development procedures and product development while learning new SW engineering skills.</li>\n<li>Conduct limited scope development and/or testing under the supervision of other SW engineers</li> \n\n<li>Complete assigned tasks on time, while developing skills that allow for more autonomy.</li>\n<li>You may be called upon to help in investigations needed to solve SW or HW problems by leveraging your strengths in software development and debugging skills.</li>\n<li>Must have good interpersonal skills and have the ability to build a good network</li>\n<li>Perform a wide variety of tasks to gain familiarity with the engineering staff, methods, programs and practices</li>\n<li>Learn, support, communicate, reinforce, and defend the mission, values and culture of the organization.</li> \n\n<li>Other duties as assigned</li>\n</ul>\n\n</div>\n</div><div><div>Qualifications</div>\n<div>\n\n\n<ul>\n\n\t<li>Enrolled in a 4 year Software or Electrical Engineering program.</li>\n<li>At least 2 years of college completed with 3.0 GPA or better.</li>\n<li>Experience with Linux and Python preferred.</li>\n<li>Strong communication and organizational skills.</li>\n<li>Ability to solve complex problems using your natural curiosity.</li>\n<li>Work effectively as a member of a team or on individual tasks.</li>\n</ul>\n\n</div>\n</div></div>\n<br><em>Leonardo DRS, Inc. and its subsidiaries and affiliates are equal opportunity employers and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.</em></div>\n</div>\n </div>\n </div>\n<br>"
    },
    {
        "position": "Summer Intern-Scholar (Tech or Non-Tech) Lumentum Diversity, Inclusion, and Belonging (DIB) (Howard University)",
        "company": "Lumentum Operations",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-17T08:34:38.018Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=217&ao=486117&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_9a9b3bb2&cb=1608366654529&jobListingId=3689585790",
        "lastScraped": "2020-12-19T08:34:38.018Z",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n<br>\nWe're committed to bringing passion and customer focus to the business.\n<br><br>\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n<br><br>\nLumentum (NASDAQ: LITE) is a market-leading manufacturer of innovative optical and photonic products enabling optical networking and commercial laser customers worldwide. Lumentum’s optical components and subsystems are part of virtually every type of telecom, enterprise, and data center network. Lumentum’s commercial lasers enable advanced manufacturing techniques and diverse applications including next-generation 3D sensing capabilities. Lumentum is headquartered in San Jose, California with R&amp;D, manufacturing, and sales offices worldwide. For more information, visit www.lumentum.com.\n<br><br>\n<strong><strong>Overview</strong></strong>\n<br><br>\nWe actively ENGAGE and WIN by making meaningful contributions to society and incorporate integrity in all we do. Lumentum seeks underrepresented diverse interns to participate in our 12-week paid summer 2021 internship program; this scholarship is in support of our efforts to identify and develop a diverse talent pipeline. Upon successful completion of the summer internship, Lumentum will provide a Diversity, Inclusion, and Belonging (DIB) scholarship. Students may be in technical or non-technical majors: Engineering, Data Science, Optics and Photonics, Lasers, Computer Science/Engineering, Business, Human Resources, Communications, Supply Chain or other disciplines supporting Lumentum's core business.\n<br><br>\nIn order to be eligible for the scholarship, students must be hired into a Lumentum internship and should also apply to other internship positions open at the company.\n<br><br>\n<strong><strong>Minimum Qualifications</strong></strong>\n<ul>\n\n<li>Qualified candidates will be currently enrolled in a Bachelor’s, Master’s or PhD degree program in the fall term of 2020. Recipient must be returning to school as full-time students following the internship and graduating no earlier than December 2021</li>\n\n</ul>\n<strong><strong>Preferred Qualifications</strong></strong>\n<ul>\n\n<li>Minimum 3.0 GPA</li>\n<li>Active membership in a diversity focused professional club for Women, Black/African-American, and/or Hispanic students related to technical/non-technical majors</li>\n<li>If a Bachelor's student, in their junior or senior year at Howard University as of fall 2021</li>\n\n</ul>"
    },
    {
        "position": "Software Engineer – Intern (US)",
        "company": "Citadel Securities",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-17T08:34:43.553Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=218&ao=406229&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_8aa0cff0&cb=1608366654530&jobListingId=3285755967",
        "lastScraped": "2020-12-19T08:34:43.553Z",
        "description": "<div>\n<h2>Job Description</h2>\n<br>\n <div></div>\n<br>\n<div>At Citadel Securities, Software Engineers design, develop, and maintain the advanced technology that powers our firm and allows us to challenge the impossible in trading.</div> \n<br>\n<div>As an intern, you’ll get to challenge the impossible in technology through an 11 week program that will allow you to collaborate and connect with senior team members and our CEO Peng Zhao. In addition, you’ll get the opportunity to network and socialize with peers at iconic venues.</div>\n<br>\n<div></div>\n<br>\n<strong><div>Your Objectives:</div>\n<br>\n</strong>\n<br>\n<div>\n· Create technological tools that bring trading strategies to life</div><br>\n\n<div>\n· Develop high-performance, large data research platforms</div><br>\n\n<div>\n· Work in small teams to build the future of finance</div><br>\n\n<div></div>\n<br>\n<strong><div>Your Skills &amp; Talents:</div>\n<br>\n</strong>\n<br>\n<div></div>\n\n\n<ul>\n<li>Degree in Computer Science, Computer Engineering or related fields (Bachelor’s, Master’s, PhD)</li>\n<li>Exceptional programming and design skills</li>\n<li>Strong analytical skills and familiarity with probability and statistics</li>\n<li>Ability to communicate effectively in a collaborative, complex and highly technical team environment</li>\n<li>Intellectual curiosity and passion for solving challenging problems using technology</li>\n</ul>\n\n<div>Opportunities available in Chicago, New York, London</div>\n<br>\n <h2>About Citadel Securities</h2><br><br>Citadel Securities is a leading global market maker across a broad array of fixed income and equity securities. Our world-class capabilities position us to meet the liquidity demands of our diverse group of institutional clients in all market conditions. In partnering with us, our clients, including asset managers, banks, broker-dealers, hedge funds, government agencies and public pension programs are able to gain a powerful trading advantage and are better positioned to meet their investment goals.\n<br><br>\nThe team makes its mark every day from our offices around the world: Chicago, New York, London, Hong Kong, Toronto, Shanghai, Sydney, Dublin.</div>\n\n<br>"
    },
    {
        "position": "Cybersecurity and Privacy Intern - Summer",
        "company": "Grant Thornton",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-12-17T08:34:47.262Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=219&ao=3839&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_49428766&cb=1608366654530&jobListingId=3657745513",
        "lastScraped": "2020-12-19T08:34:47.262Z",
        "description": "<strong>Who is Grant Thornton?</strong>\n<br><br>\nGrant Thornton is a collaborative, entrepreneurial\n<br>\nfirm on the move! As part of a dynamic, global organization of more than 42,000\n<br>\npeople serving clients in more than 120 countries, we have the agility and\n<br>\nfocus it takes to be a leader.\n<br><br>\nFounded in Chicago in 1924,\n<br>\nGrant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant\n<br>\nThornton International Ltd, one of the world’s leading organizations of\n<br>\nindependent audit, tax and advisory firms. Grant Thornton has revenue in excess\n<br>\nof $1.8 billion and operates 58 offices across the United States with more\n<br>\nthan 565 partners and 8,000+ employees.\n<br><br>\nGrant\n<br>\nThornton works with a broad range of publicly and privately held companies,\n<br>\ngovernment agencies, financial institutions, and civic and religious\n<br>\norganizations. Core industries served\n<br>\ninclude consumer and industrial products, financial services, not-for-profit,\n<br>\nprivate equity, and technology. Grant Thornton focuses on serving dynamic\n<br>\norganizations that pursue growth holistically – whether through revenue\n<br>\nimprovement, leadership, mission fulfillment or innovation.\n<br><br>\nWe\n<br>\nare committed to capitalizing on our strengths and serving dynamic\n<br>\norganizations that share our values and drive. \n<br>\nOur global values of collaboration, leadership, excellence, agility,\n<br>\nrespect, and responsibility (“CLEARR”) guide our behaviors and fuel our\n<br>\nambition to be the firm that makes a difference every day.\n<br><br>\nWe provide companies with the guidance that\n<br>\nthey need to help run their businesses, establish robust internal controls, use\n<br>\ninformation effectively and improve performance. These services include compliance, consulting\n<br>\nservices, information technology solutions, forensic accounting and\n<br>\ninvestigative services, recovery and reorganization, tax preparation, and\n<br>\nvaluation, to name a few.\n<br><br>\n<strong>Grant Thornton’s Cyber Risk Advisory Services Practice</strong>\n<br><br>\nWith\n<br>\nthe rise in cyber breaches across industries, companies are aggressively\n<br>\nlooking for consultants to help them protect their critical assets and\n<br>\nproactively prepare and respond to cyber breaches. The threat actors have shifted from simple,\n<br>\nnuisance based cyber hacks to criminals, activists, ransom hacks and nation\n<br>\nstates.<br><br>Our Cyber Risk Advisory practice offers an opportunity for you to leverage your technology background and experience to broaden your business and project management skills in a rewarding and challenging environment. Individuals will work on projects across our portfolio of Cyber Risk services and will assist in the development of cyber risk strategies, identity and access management programs, network security, cyber security analytics, ethical hacking, cloud security, privacy &amp; data protection, blockchain, etc.<br><br><strong>What\n<br>\nare we looking for in a BRS Cyber Intern?</strong>\n<br><br>\nInterested candidates should have analytical skills, be strong “thinkers”, with an affinity for learning and innovation. Interested candidates should be self-starters and should demonstrate strength in or a desire to build skills related to Grant Thornton’s core values of: Collaboration, Leadership, Excellence, Agility, Respect, and Responsibility.\n<br><br>\n<strong>Qualifications</strong>\n<ul>\n<li>B.S. in Engineering within computer science, electronics, electrical, mechanical, or information systems</li><li>B.S. program in Data analytics, Informatics, Management with Cybersecurity (minor)</li><li>B.S. program with a specialization in Technology – “Hands on technology experience”</li><li>B.S. program in Data Analytics with specialization in Blockchain, Cyber Security, RPA, Crypto</li><li>B.S. in Information Security</li><li>Major and overall GPA of 3.0 out of 4.0</li><li>Ability to travel 60�00% as required</li> \n</ul>\n<strong>Skill\n<br>\nRequirements</strong>\n<ul>\n<li>Strong business and technical aptitude and problem-solving skills</li><li>Likes to learn the business of our clients to help them solve problems</li><li>Ability to bridge the gap between business strategy and cybersecurity, technology to help deliver sustainable solutions to our clients</li><li>Excellent thinking, analytical, communication (written and verbal) and interpersonal skills</li><li>Effective time management skills for handling multiple priorities and simultaneous projects</li> <li>Enthusiasm to learn through a combination of structured, on-the-job and self-directed training</li><li>Ability to work efficiently and effectively in a team environment</li>\n</ul>\n\nInterns can expect to work closely with the Cyber Risk team on all phases of the engagement lifecycle including planning, engagement management, and project wrap up. Some of the typical projects are:\n\n<ul>\n<li>Ethical Hacking</li><li>Cyber threat monitoring</li><li>Cloud Security</li><li>Identity and Access Management</li><li>Privacy and Data Protection</li><li>Cyber Incident Management</li><li>Cyber War Gaming</li><li>Cyber Strategy and program design</li><li>Cyber Security within blockchain, RPA’s, IoT</li> <li>Secure code design</li><li>Business Strategy and Cyber strategy alignment</li>\n</ul>\n\n<strong>Training:</strong>\n<br><br>\nGrant Thornton LLP provides both local and national training programs related to an individual’s job responsibilities. We are committed to ongoing professional development and we encourage individuals to attend outside training seminars.\n<br><br>\n<strong>Benefits:</strong> \n<br><br>\nGrant Thornton LLP offers an outstanding opportunity for career growth and development, an attractive compensation and incentive program, generous benefits including immediate participation in our 401(k) plan, and a flexible work environment that offers individual enrichment opportunities in a team environment.\n<br><br>\nIt is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law.\n<br><br>"
    },
    {
        "position": "Software Engineering Intern, Machine Learning, PhD",
        "company": "Google",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2020-12-17T08:34:50.018Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=220&ao=37049&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_210a769b&cb=1608366654530&jobListingId=3747064485",
        "lastScraped": "2020-12-19T08:34:50.018Z",
        "description": "<strong>Please complete your application before February 26th, 2021.</strong>\n<br><br>\n<strong>Participation in the internship program requires that you are located in United States for the duration of the internship program.</strong>\n<br><br>\nThis internship is intended for students who are currently pursuing a PhD degree program in Computer Science or a related field with an anticipated graduation date on or after December 2021, depending on their program and unique circumstances.\n<br><br>\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n\n<ul>\n<li>1. In the “Resume Section:” attach an updated CV or resume.</li>\n<li>2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.</li>\n\n<ul>\n<li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul>\n</ul>\n\nNote: By applying to this position your application is automatically submitted to the following locations: <strong>Mountain View, CA, USA; Austin, TX, USA; Boulder, CO, USA; Cambridge, UK; Chapel Hill, NC, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Portland, OR, USA; Pittsburgh, PA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</strong><br><br>Minimum qualifications:\n\n<ul>\n<li>Currently pursuing a PhD degree in Computer Science, Artificial Intelligence, Machine Learning, or related technical field.</li>\n<li>Experience in Machine Learning or Artificial Intelligence.</li>\n<li>Experience with one or more of the following: Recommendation/Ranking/Prediction (RRP), Computer Vision (CV), Natural Language Processing (NLP), Speech/Audio, Deep Learning/Neural Networks, Reinforcement Learning, Distributed Machine Learning.</li>\n</ul>\nPreferred qualifications:\n\n<ul>\n<li>Examples of coding in one of the following programming languages including but not limited to: C, C++, Java, JavaScript, or Python.</li>\n<li>A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design.</li>\n</ul>\n\n<div><h2>About the job</h2><br><br>Join us for a unique 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. The Software Engineering Internship program will give you an opportunity to work on complex computer science solutions, develop scalable, distributed software systems, and also collaborate on multitudes of smaller projects that have universal appeal.\n<br><br>\nGoogle's Software Engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including distributed computing, performance measurement and analysis, operating systems, large-scale system design, networking, storage systems, security, compilers, UI design and mobile; the list goes on and is growing every day. As an intern you will work on a specific project critical to Google’s needs as our fast-paced business grows and evolves. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across a wide range of technologies.\n<br><br>\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</div><div><h2>Responsibilities</h2>\n\n\n<ul>\n<li>General responsibilities may include working with a team of engineers with any of the following: Applied Machine Learning, ML Recommendations / Ranking / Predictions, Data Visualization / Pipelining / Analysis, Computer Vision / Image &amp; Video Processing, Natural Language Processing / Understanding, Speech &amp; Audio Processing, Reinforcement Learning, Deep Learning / Neural Networks, Distributed Machine Learning / Infrastructure Human Computer Interaction, Machine Translation</li>\n</ul>\n\n</div>\n<br>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing this form."
    },
    {
        "position": "Software Engineering Intern, Embedded Systems, PhD",
        "company": "Google",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2020-12-17T08:34:54.715Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=221&ao=37049&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_3f5ea0cc&cb=1608366654531&jobListingId=3747064443",
        "lastScraped": "2020-12-19T08:34:54.715Z",
        "description": "<strong>Please complete your application before February 26th, 2021.</strong>\n<br><br>\n<strong>Participation in the internship program requires that you are located in United States for the duration of the internship program.</strong>\n<br><br>\nThis internship is intended for students who are currently pursuing a PhD degree program in Computer Science or a related field with an anticipated graduation date on or after December 2021, depending on their program and unique circumstances.\n<br><br>\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n\n<ul>\n<li>1. In the “Resume Section:” attach an updated CV or resume.</li>\n<li>2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.</li>\n\n<ul>\n<li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul>\n</ul>\n\nNote: By applying to this position your application is automatically submitted to the following locations: <strong>Mountain View, CA, USA; Austin, TX, USA; Boulder, CO, USA; Cambridge, MA, USA; Chapel Hill, NC, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Portland, OR, USA; Pittsburgh, PA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</strong><br><br>Minimum qualifications:\n\n<ul>\n<li>Currently pursuing a PhD degree in Computer Science or Computer Engineering, similar technical field of study (e.g., Electrical Engineering, Mathematics, Information Technology) or equivalent practical experience.</li>\n<li>Development experience in embedded systems/firmware design.</li>\n</ul>\nPreferred qualifications:\n\n<ul>\n<li>Examples of coding in C or C++.</li>\n<li>Knowledge of Unix/Linux environments, and kernel development.</li>\n<li>Knowledge of one or more of the following: Microcontrollers, SoC, device drivers, hardware bringup, power management, ARM processors, performance optimization, file systems, bootloading, firmware, x86 assembly, system BIOS or hardware/software integration.</li>\n<li>Experience with Audio &amp; Video Processing or DSP, including but not limited to AV synchronization, Open GL/CL, codecs, AV/Media, or speech/audio recognition and synthesis.</li>\n</ul>\n\n<div><h2>About the job</h2><br><br>Join us for a unique 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. The Software Engineering Internship program will give you an opportunity to work on complex computer science solutions, develop scalable, distributed software systems, and also collaborate on multitudes of smaller projects that have universal appeal.\n<br><br>\nGoogle's Software Engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including distributed computing, performance measurement and analysis, operating systems, large-scale system design, networking, storage systems, security, compilers, UI design and mobile; the list goes on and is growing every day. As an intern you will work on a specific project critical to Google’s needs as our fast-paced business grows and evolves. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across a wide range of technologies.\n<br><br>\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</div><div><h2>Responsibilities</h2>\n\n\n<ul>\n<li>Write server-side code for web-based applications.</li>\n<li>Develop for specialist domains: client application development for Windows/Mac (Chrome, Toolbar, etc.), embedded systems and mobile apps (Android), developer tools (IDEs, large-scale build systems, compilers), infrastructure, internationalization, networking, and more.</li>\n</ul>\n\n</div>\n<br>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing this form."
    },
    {
        "position": "Software Developer Intern -- Summer",
        "company": "Five Rings Capital",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-17T08:34:57.883Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=222&ao=4120&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_0dbeaefb&cb=1608366654531&jobListingId=3549628085",
        "lastScraped": "2020-12-19T08:34:57.883Z",
        "description": "<h3>Description</h3>\n <p>\n Interns will be mentored by experienced Software Developers and immersed in significant enhancements to our production trading system. They will also gain valuable technology knowledge with classroom training. Proficiency with C or C++ and Linux is preferred. Python is a plus.\n </p>\n <p></p>"
    },
    {
        "position": "Midland Loan Services Summer Intern Program",
        "company": "PNC Financial Services Group",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "posted": "2020-12-17T08:35:02.118Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=223&ao=1044074&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_9c4b96f4&cb=1608366654532&jobListingId=3772431153",
        "lastScraped": "2020-12-19T08:35:02.118Z",
        "description": "Job Profile\n<br><br>\nPosition Overview\n<br><br>\nAt PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. As a Midland Loan Services Intern within PNC's Corporate and Institutional Banking organization, you will be based in Overland Park, Kansas.\n<br><br>\nJob Description\n<br><br>\nAs a PNC Intern, you will participate in a best in class internship program. During this 10 week program, you will have the opportunity to gain exposure to a specific line of business, expand the tools you need to launch your career and complement your education with real-world experience.\n<br>Midland Loan Services falls under PNC’s Corporate &amp; Institutional Banking (C&amp;IB) Division. PNC is one of the largest U.S. banks with $409 billion in assets and $286 billion in deposits. PNC has approximately 52,000 employees across the United States and abroad; approximately 2,300 branches; and approximately 9,100 ATM’s as of September 30, 2019. PNC Real Estate has a national presence with approximately 1,000 employees located in 40 cities. Midland is the largest third party loan servicer, and the largest special servicer in the commercial real estate finance industry.\n<br>The Midland Loan Services Summer Internship Program enables inters to explore various aspects of the company including Asset Management, Loan Servicing, Business Development, Account Management, Underwriting, Due Diligence and or Collateral Surveillance.\n<br>Interns will work directly with management across the company to support daily operations. You may interact with lenders, borrowers and/or operators of commercial real estate assets across the country. Successful candidates will gain exposure to complex financing structures, and by the end of the internship, have an appreciation for the importance of loan servicing, asset management and customer service in commercial real estate finance.\n<br>The Summer Internship Program is a direct pipeline for talent to Midland Loan Services, providing interns with an unparalleled opportunity to learn the business while gaining visibility among the firm’s senior leadership.\n<br>Upon successful completion of the Summer Internship, interns may be offered an opportunity to join Midland Loan Services after graduation. Opportunities are available in Overland Park, KS.\n<br>Learn more about PNC’s Internships by visiting www.pnc.jobs/students .\n<br><br>\n<b>Job Profile :</b><br>\nParticipates as an intern in the PNC summer internship program.\n<br>Performs or assist the core activities of the group by applying knowledge learned to drive business results (e.g., deal, sales, process support, internal or external customer interaction, or supporting internal projects). Works under supervision and may have limited approval and/or exception authority.\n<br>Participates in social learning within the organization (e.g., identifies and networks with business representatives and peers, participates in mentoring, job shadowing and community outreach).\n<br><br>\n<b>Required Education and Experience :</b> Working toward a Bachelor's Degree, preferably business relevant majors (e.g., Finance, Accounting, IT, Economics, Marketing, Mathematics, Statistics, HR, Management, Communications, Business Law, Psychology, Logistics, Engineering, Computer Science, Actuarial Sciences), sophomore or junior status, Minimum GPA 3.2.\n<br><br>\nPNC provides equal opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.\n<br><br>\nCompetencies\n<br><br>\nAccuracy and Attention to Detail – Understanding of the necessity and value of accuracy and attention to detail; ability to process information with high levels of accuracy.\n<br><br>\nAnalytical Thinking – Knowledge of techniques and tools that promote effective analysis and the ability to determine the root cause of organizational problems and create alternative solutions that resolve the problems in the best interest of the business.\n<br><br>\nEffective Communications – Understanding of effective communication concepts, tools and techniques; ability to effectively transmit, receive, and accurately interpret ideas, information, and needs through the application of appropriate communication behaviors.\n<br><br>\nFlexibility and Adaptability – Knowledge of successful approaches, tools, and techniques for dealing with changes and adapting to a changing environment; ability to adapt as needed.\n<br><br>\nInformation Capture – Knowledge of the processes and the ability to identify, capture and document relevant business information in an auditable, organized, understandable and easily retrievable manner.\n<br><br>\nInitiative – Understanding of the value of self-motivation and initiative; ability and willingness to seek out work and the drive to accomplish goals.\n<br><br>\nProducts and Services – Knowledge of major products and services and product and service groups; ability to apply this knowledge appropriately to diverse situations.\n<br><br>\nSelf-Directed Growth and Development – Understanding of the necessity of continuous personal growth; ability to gauge one's strengths, limitations and interests, and use of this knowledge for purposes of performance effectiveness and self-development.\n<br><br>\nWork Experience\n<br><br>\nRoles at this level are filled by recent university / college graduates with little or no professional experience, but possessing relevant skills. Includes individuals joining the organization through a Corporate development/ training program. In lieu of a degree, a comparable combination of education and experience (including military service) may be considered.\n<br><br>\nEducation\n<br><br>\nNo Degree\n<br><br>\n<b>Disability Accommodations Statement:</b><br>\nThe PNC workplace is inclusive and supportive of individual needs. If you have a physical or other impairment that might require an accommodation, including technical assistance with the PNC Careers website or submission process, please call 877-968-7762 and select Option 4: Recruiting or contact us via email at pathfinder@pnc.com.\n<br><br>\nThe Human Resources Service Center hours of operation are Monday - Friday 9:00 AM to 5:00 PM ET.\n<br><br>\n<b>Equal Employment Opportunity (EEO):</b><br>\nPNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.\n<br><br>\nCalifornia Residents\n<br><br>\nRefer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "position": "Software Engineer (Intern-Mid)",
        "company": "SIEGE Technologies",
        "location": {
            "city": "Rome",
            "state": "NY"
        },
        "posted": "2020-12-16T08:35:07.520Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=224&ao=1044077&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_566c1b82&cb=1608366654532&jobListingId=3746739705",
        "lastScraped": "2020-12-19T08:35:07.520Z",
        "description": "<p><b>Job Title: Cyber Research Scientist/Software Engineer </b></p><p><b>(Intern/Entry-Level/Mid-Level/Senior all available)</b></p><p><b>Candidate Description: We are seeking highly motivated research scientists / software engineers for our cyber quantification team. The candidate will work in a dynamic team environment developing novel technologies to measure and predict cyber-attacks, defenses, and software behaviors in an applied research setting. An ideal candidate would be well-rounded in at least 3 of the following areas: penetration testing, reverse engineering, data analysis, machine learning, cyber ontologies, or web application development.</b></p><p><b>Clearance Requirements: Active DoD clearance or ability to acquire and maintain a DoD security clearance</b></p><p><b>US Citizenship is required</b></p><p><b>Candidates must have/be: </b></p><ul><li><b>Extremely Comfortable with Scripting/Command Line (Python 3, Batch/PowerShell, and Bash)</b></li></ul><ul><li><b>Kali, Pentesting Tools, and VMware/VirtualBox Experience</b></li></ul><ul><li><b>Web and Modern OO Programming Language Experience (HTML, CSS, Java 8, and JavaScript)</b></li></ul><ul><li><b>Git Version Control, Issue Tracking Experience</b></li></ul><p><b>Ideal candidates will have/be at least some of the following: </b></p><ul><li><b>Cybersecurity Certifications (Security+, PenTest+, OSCP or Equivalent)</b></li></ul><ul><li><b>Reverse Engineering/Security Experience (Ghidra, IDA, IDApython, Debuggers, Fuzzing, Metasploit)</b></li></ul><ul><li><b>Machine Learning Experience (Sklearn, Tensorflow, Keras, Spark)</b></li></ul><ul><li><b>Front-end Development Experience (AngularJS, Bootstrap, Webpack, ES6, SASS/CSS)</b></li></ul><ul><li><b>Java based Back-end Development Experience (Jersey, JUnit, Spring, Swagger)</b></li></ul><ul><li><b>Familiarity with Secure Development Lifecycle Best Practices</b></li></ul><ul><li><b>Exposure to Popular Cyber Taxonomies and Ontologies (e.g., MITRE ATT&amp;CK, CVE, CPE, CCE, CAPEC, CVSS, ...) and Knowledge Representation Standards (RDF, OWL)</b></li></ul><ul><li><b>Publications, Security Conference Presentations</b></li></ul><p><b>Education: </b></p><ul><li><b>Intern: Qualified applicants for this position should be pursuing a Bachelor’s degree in Computer Science/Engineering or a related field (or equivalent experience).</b></li></ul><ul><li><b>Required for Full Time: B.S degree in Computer Science, Data Science, Computer Engineering, or related field</b></li></ul><ul><li><b>Preferred for Full Time: M.S. degree in Computer Science, Data Science, Computer Engineering, or related field, and 5+ years of related experience.</b></li></ul><p>Job Type: Full-time</p><p>Benefits:</p><ul><li>401(k)</li><li>401(k) matching</li><li>Dental insurance</li><li>Disability insurance</li><li>Employee assistance program</li><li>Flexible schedule</li><li>Flexible spending account</li><li>Health insurance</li><li>Life insurance</li><li>Paid time off</li><li>Professional development assistance</li><li>Referral program</li><li>Relocation assistance</li><li>Retirement plan</li><li>Tuition reimbursement</li><li>Vision insurance</li></ul><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>Supplemental Pay:</p><ul><li>Bonus pay</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Machine Learning: 1 year (Preferred)</li></ul><p>Security Clearance:</p><ul><li>Top Secret (Preferred)</li></ul>"
    },
    {
        "position": "Intern - Marketing",
        "company": "iSolved HCM",
        "location": {
            "city": "Salt Lake City",
            "state": "UT"
        },
        "posted": "2020-12-16T08:35:11.974Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=225&ao=1033627&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_b2550fab&cb=1608366654532&jobListingId=3716941952",
        "lastScraped": "2020-12-19T08:35:11.974Z",
        "description": "<strong>Marketing Intern</strong>\n<br><br>\nAt isolved, we're on a mission to help our customers transform employee experience for a better today and a better tomorrow, and we want to tell the world about it. We know that human resources is always evolving, quite simply because it's a people business, and so our HCM platform, isolved People Cloud is not just built with people in mind but is ready for the future of work. As we continue to grow market share, we are now seeking outstanding new talent to develop within the following position:\n<br><br>\n<strong>Marketing Intern</strong>\n<br><br>\nAre you analytical, creative, web and social media savvy all at once, and looking to learn and develop marketing and related business skills in a fast-paced environment then read on!\n<br><br>\nAs a marketing intern you'll understudy and work alongside multiple members of our marketing team in order to develop a well-rounded view of the modern marketing mix across digital, traditional and channel marketing activities.\n<br><br>\nPrincipal Responsibilities\n<ul>\n<li>Help to design and manage the execution of integrated lead generation programs.\n\n<ul>\n<li>Develop program activities across website, email, events and paid advertising</li><li>Manage local campaign activities, create landing pages and manage website content</li><li>Collaborate with digital team to perform tests and optimize conversions</li><li>Help nurture active and passive leads with the goal of increasing interest in engaging</li><li>Assist in the development of social media content, such as info-graphics and blog posts, and then actively promote them on local social media, partner networks and other content sharing sites with the goal of generating leads</li></ul></li>\n<li>Support the heads of each marketing team in planning and lead management</li><li>Update and maintain data quality and customer records in CRM and MA tools, and work with Inside Sales and Business Development on lead qualification</li>\n</ul>\nEssential Requirements\n<ul>\n<li>No prior business experience is necessary but desirable.</li><li>Experience of social media such as LinkedIn and Facebook.</li><li>Strong analytical skills.</li><li>Agility to understand the relationship between marketing results and business outcomes.</li><li>Comprehensive knowledge of Microsoft 365, in particular Excel.</li></ul>\n\n<ul>\n<li>Experience of or prior exposure to marketing software (e.g. HubSpot, Outreach, Drift), analytics (e.g Google), and CMS (e.g. WordPress, Drupal).</li><li>Strong interpersonal, written and oral communication skills.</li><li>Ambitious yet flexible self-starter who can work in a rapidly changing environment.</li><li>Bachelor's Degree in Marketing, Computer Science, Information Technology or similar field or related business experience (completed or on-going).</li><li>A desire to work hard, make a difference, and have fun doing it.</li>\n</ul>\nLocation:Salt Lake City, Utah"
    },
    {
        "position": "Software Engineer, Intern",
        "company": "KLA-Tencor",
        "location": {
            "city": "Ann Arbor",
            "state": "MI"
        },
        "posted": "2020-12-16T08:35:15.269Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=226&ao=1136006&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_e476b954&cb=1608366654532&jobListingId=3746578861",
        "lastScraped": "2020-12-19T08:35:15.270Z",
        "description": "<div><p><b>Company Overview\n</b></p>KLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and in 2019 we invested 15% of sales back into R&amp;D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us.\n<p></p><p><b>Group/Division\n</b></p>The vision of KLA’s global human resources organization is to become a leader and partner to operating leadership in support of the company’s efforts to achieve its strategic growth, customer and operating objectives through strategic talent management. Our mission is to enable the business, and leverage human resources to achieve short and long-term business objectives. Our primary areas of strategic focus include talent acquisition, individual and organizational assessment and development, performance management, inclusion and engagement, and rewards. The global HR organization includes HR business partners, learning and development, talent acquisition, compensation and benefits, employee communications, and HR system operations.\n<p></p><p>Highly motivated self-driven individual to be part of a software engineering team to design, develop, test and qualify equipment control software. Perform software testing, software build and release activities.\n</p><p>Collaborate with a team of software and electrical engineers to provide software solutions for high priority projects.\n</p><p>.\n</p><p></p>Adaptability, Collaborates, Communication, Customer Focus, Decision Quality, Drives Results, Innovation, KLA Values, Problem Solving, Work Processes\n<p></p><p><b>Minimum Qualifications\n</b></p><p><b>Basic:\n</b></p><ul><li>Planned college graduation by June 2022, with primary coursework in computer science, data science, engineering (computer, electrical, systems).\n</li><li>Proficient coding in C++/C#/JAVA\n</li><li>Good understanding of Windows/Unix/Linux OS\n</li><li>Good knowledge on JavaScript\n</li><li>Good software design/implementation/debugging capabilities\n</li><li>Good understanding of data structures, and algorithms\n</li><li>Effective communication and team interaction skills\n</li><li>Creative problem-solver who is motivated to learn independently\n</li></ul><p><b>Desired </b>:\n</p><ul><li>Knowledge on source control tools such as RTC, ClearCase, Git\n</li><li>Good knowledge on Angular/NodeJS\n</li><li>Experience working in DevOps environment\n</li><li>Knowledge on Virtual Machine\n</li><li>Understanding of image processing algorithm\n</li><li>Experience working with RTOS (VxWorks), Solaris\n</li><li>Creating modifying build scripts for large applications\n</li><li>Understanding of SEMI Equipment control software architecture\n</li></ul><p></p><p>We offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees.\n</p><p></p><p>KLA is proud to be an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, national origin, sex, gender identity, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other status protected by applicable law. We will ensure that qualified individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at talent.acquisition@kla.com to request accommodation.</p></div><p></p>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Kiva.org",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-16T08:35:18.455Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=227&ao=1158547&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_f060511f&cb=1608366654533&jobListingId=3689054165",
        "lastScraped": "2020-12-19T08:35:18.455Z",
        "description": "<strong>About us:</strong>\n<br><br>\nKiva (kiva.org) is an international nonprofit with a mission to expand financial access to help underserved communities thrive. We run a global marketplace platform to crowdfund microloans for financially excluded entrepreneurs, farmers and students around the world. Our organization combines the culture and technological passion of an internet start-up with the compassion and empathy of a non-profit to create impact and opportunity at global scale. In just 13 years, we have raised more than $1.2 billion in loan capital for 2.7 million borrowers in 83 countries. Our lenders fund over $10 million in loans every month. With offices in San Francisco, Portland, New York, Nairobi, and Bangkok, Kiva's team includes 100+ employees and 400+ volunteers worldwide. Our team is growing as we pursue exciting new opportunities to create a financially inclusive world.\n<br><br>\n<strong>Role overview:</strong>\n<br><br>\nAs a Software Engineering Intern, you will be mentored by engineers from different technical backgrounds who all share a passion for technology, solving meaningful problems, and making tangible impact. You will join an established team at Kiva during an exciting time of growth and innovation. The ideal intern candidate is passionate about both our organizational mission and learning new skills. Effective communication is among the most important tools in your toolbox. You are always looking at how things can be improved and examine problems from all angles.\n<br><br>\n<strong>All interns must be physically based in the United States and have valid U.S. work authorization.</strong>\n<br><br>\n<strong>Internship Program:</strong>\n\n<ul>\n<li>Our 10 to 12-week summer internship program (with the option to extend) provides you with a comprehensive introduction to the microfinance, nonprofit, and tech spaces while being fully integrated into a team.</li>\n<li>You will have the option to complete the internship remotely or be based in Kiva's San Francisco or Portland if COVID-19 safety measures permits.</li>\n<li>You will report to and work closely with an engineering manager while also having the support of an engineering mentor buddy.</li> \n\n<li>You will have the opportunity to select from a wide range of projects. At the end of your internship, you will present your project to the engineering organization.</li>\n<li>We will pair you with a dedicated engineer to ensure the success of your project. They will be your go-to person for any questions, suggestions, advice, and providing constructive feedback.</li>\n<li>You will engage with executives and industry leaders through intern and company wide events.</li>\n<li>You will participate in professional career development workshops and memorable fun events with fellow interns, teammates, and full-timers.</li>\n</ul>\n<strong>You will:</strong>\n\n<ul>\n<li>Learn about microfinance, nonprofit, and engineering best practices at Kiva.</li>\n<li>Learn and work across a variety of technologies like Vue.js, node.js, kotlin, cloud-based microservices, and distributed ledger.</li>\n<li>Learn modern software engineering processes and experience development cycles from conception to deployment into production.</li>\n<li>Contribute to our core services and build scalable programs that standardize information flow and increase operational efficiency.</li>\n<li>Be part of a close-knit engineering team and have an experienced mentor who considers it their job to make sure you're growing the skills you need.</li>\n<li>Own a project that has a serious impact on Kiva's work. For example, a past intern project involved securely and quickly translating 3M+ citizen identities into blockchain wallets while another intern used the latest open source visual regression tools to ensure a consistent user experience when onboarding new banking customers in communities with limited financial assess.</li> \n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Preferred: Currently pursuing a BS or MS in Computer Science or a related technical discipline.</li> \n\n<li>Excited to learn new languages and technologies.</li>\n<li>Willing to dive in and learn by doing.</li>\n<li>Ready to work with others to solve hard problems.</li>\n</ul>\n<strong>What we offer:</strong>\n\n<ul>\n<li>Opportunities to improve real lives, solve hard problems, and change the world.</li>\n<li>Friendly, supportive, and adventurous environment with a team of engaged colleagues.</li>\n<li>Opportunities to connect with and learn from colleagues and partners around the world.</li>\n</ul>\n<strong>Perks:</strong>\n\n<ul>\n<li>Professional development and skills workshops.</li> \n\n<li>Open invitation to join Kiva's Employee Resource Groups (ERGs) and social activities such as happy hours and coffee chats.</li> \n\n<li>References gladly given for successful participants.</li> \n</ul>\n<em>A diverse and inclusive workplace where we learn from each other is an integral part of Kiva's culture. We actively welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!</em>"
    },
    {
        "position": "Data Collection Software Engineering Intern",
        "company": "Adobe",
        "location": {
            "city": "Lehi",
            "state": "UT"
        },
        "posted": "2020-12-16T08:35:22.724Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=228&ao=132917&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_108dc257&cb=1608366654533&jobListingId=3716475974",
        "lastScraped": "2020-12-19T08:35:22.724Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\nWe are seeking candidates for an exciting new internship opportunity on one of the best teams at Adobe! If you have been paying attention, you've seen the explosion of Mobile software development. Our team is responsible for a number of high fidelity systems used by many of the largest brands in the world. In fact, many of the technologies we build are likely embedded in many of the apps installed on your phone. We are also responsible for crafting one of the largest Data Collection Edges and Serverless Computing infrastructures on the globe! We process streaming data transactions on the order of billions coming from devices all over the globe. You'd be working on one of the greatest challenges faced by software engineers today. Who would not want an internship that puts them in the heart of an exciting new frontier and set them up for the future?\n<br><br>\nAs a Computer Science intern on Adobe Experience Platform, you’ll be paired with a mentor, and will work side-by-side with our engineering team to learn the technology and develop critical-path software. You'll experience first-hand the process of creating world-class enterprise SaaS applications. Internship projects may involve either client-side app development or backend service development. After joining, we’ll review possible project ideas and will match passions with potential projects.\n<br><br>\nKnowledge of common software development practices like Agile and Scrum will be critical. A good understanding of object-oriented programming will also be needed to be successful. Ideally candidates would have a basic understanding of design patterns, APIs, and Web Analytics. Above all else, candidates must have good communication skills and a genuine desire to learn.<br><br><h2>Desired Skills</h2>\n\n<ul>\n<li>Working Knowledge of Object-Oriented Development</li><li>Experience in Java Development</li><li>Technical Writing Skills</li><li>Good Communications Skills</li><li>Familiar with Software Development Lifecycle and Agile Development</li><li>Continuous Integrations and Continuous Deployment (CI/CD or DevOps)</li>\n</ul>\nAt Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists (http://www.adobe.com/careers/awards.html). You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In (http://www.youtube.com/watch?v=hmL6uQZhYhw&amp;list=UUlDSu3-Y4-BfI08784K-P4g&amp;feature=share&amp;index=1) approach where ongoing feedback flows freely.\n<br><br>\nAdobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status.<br><br>Adobe"
    },
    {
        "position": "Applications Developer - Intern",
        "company": "MarketAxess",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-16T08:35:27.796Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=229&ao=1134234&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_876dad52&cb=1608366654534&jobListingId=3716394455",
        "lastScraped": "2020-12-19T08:35:27.796Z",
        "description": "Company Description<br><br>Over the last twenty years, MarketAxess has completely revolutionized the fixed-income market by creating a single platform using proprietary technology that connects the world’s most influential financial institutions. Today, more than 1,700 institutional investors and broker-dealer firms rely on us to bring them accurate market data to assist with their trading decisions, connectivity solutions that facilitate straight-through processing and technology services to optimize trading environments.\n<br><br>\nIf you are graduating in December 2021 or May 2022 and are interested in exploring a career that places you at the crossroads of financial services and technology, please read more about our opportunity below.\n<br><br>\nThe development of our trading functionality and data services is at the core of our business. Our <strong>Technology team</strong> includes product specific trading teams, a group that works on connectivity to our institutional investor clients and broker-dealer clients, data and analytics, and web-based development.\n<br><br>\n<strong>What You’ll Do</strong>\n<br><br>\nIn this position, you will work with other developers, architects, test engineers and product management in the development of real-time fixed income trading systems. You will join an Agile Scrum team whose goal is to build new products and enhance existing ones. Being on an Agile Scrum team, you will be asked to engage in the following activities daily:\n<ul>\n<li>Understand business requirements</li><li>Participate in software design</li><li>Provide time estimates</li><li>Write code and unit tests</li><li>Participate in code reviews</li><li>Fix bugs</li>\n</ul>\n<strong>What You Bring to the Table</strong>\n<ul>\n<li>Working towards a Bachelor’s or Master’s degree in mathematics, Engineering, Computer Science, or similar (Master’s degree preferred)</li><li>Good understanding of various data structures and algorithms</li><li>Well-versed in modern application design paradigms and patterns</li><li>Exposure to JAVA programming language</li><li>Basic knowledge of enterprise RDBMS (Oracle, Sybase, SQL Server)</li><li>Experience with one of the following Enterprise Operating Systems: Linux, Windows</li><li>Experience in development/willingness to learn Java based server-side framework (Spring Boot)</li><li>Understanding of browser-based technologies/willingness to learn (HTML/CSS, JavaScript, React, AngularJS, AJAX)</li><li>Curiosity/interest related to cloud technologies and cloud design patterns (AWS)</li><li>Strong verbal and written communication skills as well as organizational and problem resolution skills</li><li>Team player and strong interpersonal skills</li><li>Ability to function well in a competitive, challenging environment, and the ability to deal with changing priorities</li>\n</ul>\n<strong>What’s In It For You</strong>\n<br><br>\nIn addition to working on cutting edge technology and in our culture of innovation, collaboration, and openness, we offer:\n<ul>\n<li>Healthcare and wellness options</li><li>401(k) match</li><li>Employee stock purchase plan</li><li>Training and tuition assistance</li><li>Other perks include generous time-off policies, stipends for gym memberships, exercise equipment and similar, and access to on-site healthcare</li>\n</ul>\nMarketAxess Corporation and its affiliates provide equal employment opportunities to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, veteran status or any other characteristic prohibited by federal and state law.<br><br>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."
    },
    {
        "position": "Data Analyst Intern",
        "company": "Cadent",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2020-12-16T08:35:31.599Z",
        "url": "https://glassdoor.com/partner/jobListing.htm?pos=230&ao=1163002&s=58&guid=000001767a1f82c990a016a07cdf8a08&src=GD_JOB_AD&t=SR&vt=w&cs=1_6de3f34a&cb=1608366654534&jobListingId=3771526956",
        "lastScraped": "2020-12-19T08:35:31.599Z",
        "description": "Cadent powers the evolution of TV brand advertising. We provide marketers, agencies, operators, and media owners with data-driven solutions for buying and selling TV advertising. By connecting brands with opportunities across national inventory sourcescable, broadcast, and digital mediaour technology improves efficiencies and boosts the results of linear, addressable, and cross-screen campaigns.\n<br><br>\nAs we continue to grow, we are looking for <strong>Data Analyst Intern</strong> to join our team for Spring 2021. This Intern will have an opportunity to gain hands-on experience virtually by working directly with our teams, not for them.\n<br><br>\nThis Intern will also spend the Spring on an individual project customized to their specific skill-set which they'll present to our Tech Leadership team at the end of the program. Details of the projects and timeline will be laid out by supervisors at the beginning of the program.\n<br><br>\nThe Data Analyst Intern will be responsible for fulfilling tasks set out by supervisors from the specific department they're working in, including but not limited to:\n\n<ul>\n<li>Attending team meetings,</li>\n<li>Performing research,</li>\n<li>Using department-specific software to complete day-to-day assignments.</li>\n</ul>\nPerks:\n\n<ul>\n<li>Competitive pay</li>\n<li>College credit (if applicable)</li> \n</ul>\nRequirements:\n\n<ul>\n<li>A rising senior pursuing a bachelor's degree in Computer Science at a college or university</li>\n<li>Able to commit to a part-time (20 hours per week) work schedule between February 16th 2021 April 27th, 2021</li>\n<li>Excellent verbal and written communicators</li>\n<li>Self-motivated with a desire to learn from a rapidly growing company</li>\n<li>Confident to take initiative and collaborate with teammates</li>\n<li>Excellent problem-solving skills</li>\n</ul>\nOur hiring teams are looking for candidates with one and/or more of the following technical skills:\n\n<ul>\n\n<li>\n<strong>Programming language:</strong> working knowledge using Python or R, we're currently using Python</li>\n<li>\n<strong>SQL</strong> need to write queries to retrieve data from different data stores, a good understanding of SQL is a must</li>\n<li>\n<strong>Communication/Presentation skills</strong> you will have to translate the data by documenting and presenting in a format that would be easier for folks to understand</li>\n</ul>\nSo, if the leading edge of media technology is the place you want to be, apply today and let's start the conversation!\n<br><br>\n/CADENT/ is an EOE M/F/D/V. We do not work with 3rd Party Staffing Agencies<br><br>]]&gt;"
    }
]