[
    {
        "position": "IT Operations Specialist",
        "company": "Decision Research Corporation",
        "location": "Honolulu",
        "posted": "2021-02-24T10:00:00.000Z",
        "url": "https://jobs.hawaiitech.com/job/decision-research-corporation-honolulu-3-it-operations-specialist/",
        "lastScraped": "2021-03-06T01:47:55.646Z",
        "description": "<p>DRC is looking for qualified individuals to join our team as a technical operations specialist. Ideal candidates must possess a solid understanding of the technology and hardware/software platforms.</p>\n<p>&nbsp;</p>\n<p><strong>Duties include:</strong></p>\n<p>Provide support, maintenance, and monitoring for systems on Microsoft Azure<br>\nAbility to script programs using power shell and batch<br>\nMonitor daily system cycles, in addition to running testing cycles as needed<br>\nReconcile daily system activity against 3rd party reports received from third parties<br>\nPerform as dispatcher, answering initial call, triaging the issue and assigning priority and resources<br>\nRespond to trouble tickets in a timely manner<br>\nProvide phone support to users and walk users through the problem solving process<br>\nThis position is a rotating shift with required night shift work<br>\nThis position also requires the ability to be an on-call 24×7 rotation<br>\nRemotely support users<br>\nDocument creation and maintenance<br>\nOther Duties as Assigned</p>\n<p>&nbsp;</p>\n<p><strong>Qualifications</strong>:</p>\n<p>A degree in Computer Science, Information Systems Management, or a computer-related field, One year of relevant Information Technology work experience can be used in lieu of degree<br>\nExperience working with IT hardware (i.e. desktops, laptops, servers, &amp; printers)<br>\nExcellent knowledge of or experience using Microsoft products including Windows, Office Suite (Word, Excel, Powerpoint, Outlook)<br>\nExperience in a customer support, help desk environment role<br>\nExcellent communication skills and troubleshooting skills<br>\nCompTIA or Microsoft certifications a plus<br>\nMust be able to work a flexible schedule<br>\nMust be able to work equally well in a team as well as individually<br>\nIndependent, self-motivated<br>\nThis position is located in our <strong>Honolulu, HI office</strong>. Applicants should reside or be in the process of relocating to Honolulu. Position requires <strong>night and weekend on call support.</strong></p>"
    },
    {
        "position": "IT Specialist",
        "company": "University of Hawaii",
        "location": "Error",
        "posted": "2021-02-10T10:00:00.000Z",
        "url": "https://jobs.hawaiitech.com/job/it-specialist/",
        "lastScraped": "2021-03-06T01:48:01.921Z",
        "description": "<p><strong>Title</strong>: Information Technology (IT Specialist)<br>\n<strong>Position Number</strong>: 79542T<br>\n<strong>Hiring Unit</strong>: Office of the Vice President for Community Colleges/Academic Affairs<br>\n<strong>Location</strong>: Manoa<br>\n<strong>Date Posted</strong>: February 05, 2021<br>\n<strong>Closing Date</strong>: February 23, 2021<br>\n<strong>Band</strong>: B<br>\n<strong>Salary</strong> :&nbsp;<a href=\"https://www.hawaii.edu/ohr/general-information/compensation/#apt-salary-schedules\">salary schedules and placement information</a><br>\n<strong>Full Time/Part Time</strong>: Full Time<br>\n<strong>Temporary/Permanent</strong>: Temporary – Not to Exceed: September 30, 2021</p>\n<p><strong>Other Conditions</strong>: Temporary position not to exceed 9/30/21. Possibility of extension contingent upon availability of funds.</p>\n<p><strong>Duties and Responsibilities</strong></p>\n<ol start=\"1\" type=\"1\">\n<li>Develop, integrate, customize, and support UH Community Colleges (UHCC) web and technical applications.</li>\n<li>Provide software development support, analyze requirements, develop technical specifications, and resolve any operational problems related to the maintenance of information systems.</li>\n<li>Develops software involving complex data exchange among multiple programs and/or requiring sophisticated program logic; modify existing tools and packages as needed; develops reusable software modules; develops software test procedures.</li>\n<li>Designs and develops web-based applications and front-end user interfaces using PHP, HTML, CSS, Javascript and/or any other programming or scripting language to meet project requirements and specifications.</li>\n<li>Confers regularly with content specialists and administrators to ensure that the user experience is positive across all touch points. Works closely with system administrators on back-end connectivity/functionality.</li>\n<li>Analyze project specific requirements; ensure projects are planned, programmed, tested, and implemented by project deadlines.</li>\n<li>Evaluate progress during project stages; work directly with departments and offices in implementing and testing the baseline, assessing and making necessary programming modifications, and maintaining and enhancing program functions and features.</li>\n<li>Provide technical support in a timely manner; identifies the cause(s), researches, assesses, solves and takes action to prevent programming and/or system problems from recurring.</li>\n<li>Maintain data accuracy, troubleshoot complex data problems which include but are not limited to programming, formatting, coding structures, data input/quality and data element definitions.</li>\n<li>Monitors and tracks software versions, fixes, and vendor announcements.</li>\n<li>Provide project implementation and post-implementation support for Office of the Vice President for Community Colleges.</li>\n<li>Serves as technical resource to non-technical administrators, staff, and other IT professionals.</li>\n<li>Keep abreast of advances in information technology and assess the feasibility of incorporating into project plans and specifications.</li>\n<li>Ensure website and content is in compliance with UH web standards and the American with Disabilities Act.</li>\n<li>Develop queries to extract data from a relational database; summarize and format data for use in web applications, visualization tools, and for reporting.</li>\n<li>Assist with ad-hoc reports and custom views on an as needed basis.</li>\n<li>Other duties as assigned</li>\n</ol>\n<p><strong>Minimum Qualifications</strong></p>\n<ol start=\"1\" type=\"1\">\n<li>Possession of a pertinent baccalaureate educational degree in Information &amp; Computer Sciences (ICS) or related field and 3 years of progressively responsible professional information technology experience with responsibilities for website management/development, of which 2 years of the experience must have been comparable in scope and complexity to the next lower payband in the University of Hawai’i broadband system; or equivalent education/training or experience.</li>\n<li>Considerable working knowledge of applications development as demonstrated by the broad knowledge and understanding of the full range of pertinent standard and evolving information technology concepts, principles and methodology.</li>\n<li>Considerable working knowledge and understanding of the broad technology, systems, hardware and software associated with coding practices necessary for developing web-based applications and websites; prototyping and iterative development techniques; and systems development methodology and techniques.</li>\n<li>Demonstrated ability to recognize a wide range of intricate problems, use reasoning and logic to determine accurate causes, and apply principles and practices to determine, evaluation, integrate, and implement practical and thorough solutions in an effective and timely manner.</li>\n<li>Demonstrated ability to interpret and present information and ideas clearly and accurately in writing, verbally and by preparation of reports and other materials.</li>\n<li>Demonstrated ability to establish and maintain effective working relationships with internal and external organizations, groups, team leaders and members, and individuals.</li>\n<li>For supervisory work, demonstrated ability to lead subordinates, manage work priorities and projects, and manage employee relations.</li>\n<li>Any equivalent combination of education and/or professional work experience which provides the required education, knowledge, skills and abilities as indicated.</li>\n<li>Working knowledge of PHP, HTML, JavaScript, and CSS.</li>\n<li>Working knowledge of user interface and user experience design.</li>\n<li>Working knowledge of Responsive Web Design frameworks.</li>\n<li>Working knowledge of content management systems such as WordPress.</li>\n<li>Working knowledge and/or experience with relational databases such as Oracle or MySQL, and writing SQL queries.</li>\n<li>Demonstrated ability to work cooperatively with supervisor, project staff, vendors &amp; customers in a team environment to accomplish tasks &amp; meet deadlines.</li>\n<li>Demonstrated ability to develop clean, structured code and conduct thorough testing.</li>\n<li>Working knowledge of American with Disabilities Act compliance, web privacy and copyright requirements.</li>\n<li>Demonstrated ability to understand oral and written instructions and documentation, write reports and procedures, and communicate effectively in a variety of situations.</li>\n<li>Demonstrated ability to exercise sound judgment, particularly in managing confidential information; understand and work within federal, state, and university policies and practices such as FERPA.</li>\n<li>Ability and aptitude for learning new software programs and applications; outstanding troubleshooting and technical support skills.</li>\n<li>Demonstrated ability to speak, read, comprehend, interpret and write fluently in English.</li>\n<li>Ability to work outside normally scheduled work hours including day, night, weekend and/or holiday hours, as directed.</li>\n</ol>\n<p><strong>Desirable Qualifications</strong></p>\n<ol start=\"1\" type=\"1\">\n<li>Familiarity with the DestinyOne non-credit registration system, or other higher education information management systems.</li>\n<li>Familiarity with the concept of badging and micro-credentialing, and/or knowledge or experience with badging/micro-credentialing software/tools.</li>\n<li>Considerable working knowledge of Angular and jQuery.</li>\n<li>Considerable working knowledge or experience with web services/API development.</li>\n<li>Working knowledge of RESTful Architecture.</li>\n<li>Considerable working knowledge of JSON file structure and JSON web tokens.</li>\n<li>Considerable working knowledge of content management systems like WordPress.</li>\n<li>Considerable working knowledge or experience with one or more Database Management Systems (DBMS) such as Oracle or MySQL.</li>\n<li>Considerable knowledge of Structured Query Language (SQL) and writing custom SQL for data extraction.</li>\n<li>Working knowledge of oAuth.</li>\n<li>Working knowledge and/or experience with data visualization software or tools (e.g., Fusion Charts, Tableau, D3).</li>\n</ol>\n<p><strong>TO APPLY:</strong></p>\n<p>Click on the “Apply” button to complete an application and attach the following required documents:</p>\n<p>1. Cover letter indicating how you meet the minimum and desirable qualifications of the position;<br>\n2. Resume;<br>\n3. Name and contact information (telephone number and email address) of at least three (3) professional references; and<br>\n4. Graduate and undergraduate transcript(s) showing degree and coursework to date appropriate to the position (original official transcript(s) will be required at the time of hire<strong>). &nbsp;Copies of transcripts must be attached to your application to receive credit for degree(s)</strong>. Transcripts issued outside the United States of America require a course-by-course analysis with an equivalency statement from an agency having membership with the National Association of Credential Evaluation Services, Inc., verifying the degree equivalency to that of an accredited institution within the USA. Expense of the evaluation shall be borne by the applicant.</p>\n<p>Late, incomplete or unreadable application materials will not be considered. Academic record/grade summaries will not be accepted. Diplomas and copies will NOT be accepted. Please REDACT references to social security numbers and birth date on submitted documents. NOTE: Please create a new account if this is your first time applying for a position using NEOGOV.</p>\n<p>Inquiries: Community Colleges Human Resources Office: cchro@hawaii.edu</p>\n<p><strong>EEO/AA, Clery Act, ADA</strong></p>\n<p>The University of Hawai’i is an&nbsp;<a href=\"http://www.hawaii.edu/offices/eeo/policies/\">Equal Opportunity/Affirmative Action Institution</a>&nbsp;and is committed to a policy of nondiscrimination on the basis of race, sex, gender identity and expression, age, religion, color, national origin, ancestry, citizenship, disability, genetic information, marital status, breastfeeding, income assignment for child support, arrest and court record (except as permissible under State law), sexual orientation, domestic or sexual violence victim status, national guard absence, or status as a covered veteran. &nbsp; For more information or inquiries regarding these policies, please refer to the following link:&nbsp;<a href=\"http://www.hawaii.edu/offices/eeo/eeo-coordinators/\">http://www.hawaii.edu/offices/eeo/eeo-coordinators/</a>.</p>\n<p>Employment is contingent on satisfying employment eligibility verification requirements of the Immigration Reform and Control Act of 1986; reference checks of previous employers; and for certain positions, criminal history record checks.</p>\n<p>In accordance with the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, annual campus crime statistics for the University of Hawai’i may be viewed at:&nbsp;<a href=\"https://www.hawaii.edu/titleix/help/campus-security/\">https://www.hawaii.edu/titleix/help/campus-security/</a>, or a paper copy may be obtained upon request from the respective UH Campus Security or Administrative Services Office.</p>\n<p>In accordance with Article 10 of the unit 08 collective bargaining agreement, bargaining unit members receive priority consideration for APT job vacancies. As a result, external or non BU 08 applicants may not be considered for some APT vacancies. BU 08 members with re-employment rights or priority status are responsible for informing the hiring unit of their status.</p>\n<p>Accommodation Request: &nbsp;The University of Hawai’i complies with the provisions of the Americans with Disabilities Act (ADA). &nbsp;Applicants requiring a reasonable accommodation for any part of the application and hiring process should contact the EEO coordinator directly. &nbsp; Determination on requests for reasonable accommodation will be made on a case-by-case basis. &nbsp;For further information, please refer to the following link:&nbsp;<a href=\"https://www.hawaii.edu/offices/eeo/accommodation-request/\">https://www.hawaii.edu/offices/eeo/accommodation-request/</a></p>"
    },
    {
        "position": "Digital Communications & Social Media Specialist",
        "company": "Hawaiian Electric",
        "location": "Honolulu",
        "posted": "2020-12-23T10:00:00.000Z",
        "url": "https://jobs.hawaiitech.com/job/digital-communications-social-media-specialist/",
        "lastScraped": "2021-03-06T01:48:13.090Z",
        "description": "<p>We recognize our competitive advantage — our people. &nbsp;We believe in our people, who share our vision of meeting the needs of our employees, customers, and communities and who carry out the continued success of the company.</p>\n<p>Our employees are committed to the company’s foundational values: integrity, excellence, teamwork, environmental stewardship, and community commitment. &nbsp;In turn, we invest in our employees, providing opportunities for challenge and advancement and offering a competitive compensation package.</p>\n<p><strong><u>BRIEF POSTING DESCRIPTION:</u></strong></p>\n<p>The Digital Communications Division at Hawaiian Electric Company has one (1) Management vacancy available. (Role: Professional)</p>\n<p><strong><u>JOB FUNCTION:</u></strong></p>\n<p>Helps Company prepare for and manage issues through communications planning for Social Media channels.&nbsp; Develops clear, concise and credible communications vital to the Company’s ongoing relationships with its employees, customers, legislators, regulators and other audiences through Social Media channels. Serves as an important communications link between Senior Management and all other Company employees as well as customers.</p>\n<p><strong><u>FUNDAMENTAL RESPONSIBLITIES:</u></strong></p>\n<ul>\n<li>Manages, maintains and performs Social Media activities which includes:</li>\n</ul>\n<ul>\n<li>Developing and implementing strategic plan to grow social media audience for key demographics</li>\n<li>Strengthening the brand and engaging our community in Social Media by producing creative and compelling content for all Social Media accounts.</li>\n<li>Writing clear, compelling communications through Social Media channels, such as but not limited to Facebook, Twitter and YouTube.</li>\n<li>Organizing or supporting community relations events and activities, including coordination of promotional efforts through Social Media for such initiatives.</li>\n<li>Developing and implementing Disaster Preparedness and Outage Communications Plan through Social Media.</li>\n<li>Maintaining consistent company voice and brand through Social Media channels.</li>\n<li>Monitoring Social Media accounts 24/7 and adhering to the Service Level Agreements (SLAs) agreed upon.</li>\n<li>Creating and maintaining process documentation for Social Media</li>\n<li>Providing guidance and expertise to Human Resources and additional internal customers that may have been granted access to use Social Media channels for their business needs, such as LinkedIn for recruiting purposes.</li>\n<li>Updates and maintains content for designated sections on Company website(s). Serves as backup to Online Communications Administrator when necessary.</li>\n<li>Works with internal departments to research and develop key issue communications for Social Media. Responds to any customer issue that comes through Social Media channels. Available to handle crisis situations through Social Media.</li>\n<li>Monitors and prepares reports to update internal staff on Social Media usage statistics and metrics. Prepares updates on Social Media progress and advancements for senior management and internal employees.</li>\n<li>Researches and implements new Social Media technology as necessary. Attends Social Media related events to manage relationships and build community support for efforts through this channel.</li>\n<li>Provides a full range of internal and external communications and consultative service related to Social Media to departments, HEI and its affiliate companies.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n<p><strong><u>FUNDAMENTAL REQUIREMENTS:</u></strong></p>\n<p><strong><u>Knowledge Requirements</u></strong></p>\n<ul>\n<li>Working knowledge in communications, journalism and/or public relations.</li>\n<li>Technical knowledge in online communications/information dissemination techniques.</li>\n<li>Working knowledge of issues facing Company and industry.</li>\n<li>Technical knowledge of print and online production, including layout and design principles and techniques.</li>\n<li>Technical knowledge of communications technology, including computers and related software applications.&nbsp; Working knowledge of web design and desktop publishing applications.</li>\n<li>Working knowledge of Company operations; Working understanding of utility industry operations; Basic familiarity with varying communities the Company serves.</li>\n<li>Basic knowledge of local news media structures.</li>\n<li>Basic knowledge of federal, state, economic, business and political climates.</li>\n<li>Basic knowledge of and ability to apply good photographic techniques.</li>\n</ul>\n<p><strong><u>Skills Requirements</u></strong></p>\n<ul>\n<li>Excellent oral, facilitation and presentation skills, including ability to think on one’s feet and respond to media and customer inquiries in clear, credible and concise terms.</li>\n<li>Excellent writing skills.&nbsp; Ability to write in a clear, concise and interesting manner.</li>\n<li>Ability to conceptualize new ideas quickly.</li>\n<li>Ability to translate complex issues into terms understandable by a broad range of audiences.</li>\n<li>Ability to remain flexible in a demanding work environment and adapt to rapidly changing priorities.</li>\n<li>Analytical and conceptual skills to assess issues, to recommend proper actions and to coordinate/follow through on implementation of details.</li>\n<li>Demonstrates strong initiative and ability to work with minimal supervision.</li>\n<li>Strong organizational and project management skills to handle many concurrent projects and programs.</li>\n<li>Ability to work well with people at all levels and from diverse departments in the company.&nbsp; Ability to work collaboratively as a member of a team.</li>\n<li>Ability to handle difficult and/or sensitive issues while using tact, courtesy and discretion.</li>\n<li>Ability to act as a liaison between Senior Management and other employees in the Company.</li>\n</ul>\n<p><strong><u>Experience Requirements</u></strong></p>\n<ul>\n<li>Bachelor’s degree in Communications, Marketing or 5-7 years equivalent experience in related field.</li>\n<li>Experience working with various Social Media platforms required.</li>\n<li>Experience with HTML and web page development highly desirable.</li>\n<li>Multiple (5+) years of related business experience, preferably in marketing, corporate communications, public relations or as a professional journalist, with an emphasis on experience in writing and issues analysis and management, including management of issues in politically sensitive environments or complex organizations.</li>\n</ul>\n<p><strong>Role:</strong>&nbsp;Professional</p>\n<p><strong>Number of Vacancies:</strong>&nbsp;1</p>\n<p><strong>Work Schedule:</strong>&nbsp;Monday – Friday</p>\n<p><strong>Work Hours:</strong>&nbsp;7:00 am – 3:30 pm</p>\n<p><strong>Lunch:</strong>&nbsp;30 Minutes</p>\n<p><strong>Location:&nbsp;</strong>ASB Tower&nbsp;– Oahu</p>\n<p><u><strong>About Hawaiian Electric Companies</strong></u></p>\n<p>Hawaiian Electric Companies provide electricity and services to 95 percent of the state’s 1.4 million residents. &nbsp;The company is also one of the state’s leading employers and a major contributor and supporter of community and educational programs.</p>\n<p>The demand for power that has fueled the growth of the Hawaiian Islands has been met by Hawaiian Electric Companies for well over a century. &nbsp;And as the next millennium unfolds, the company is committed to providing quality service and seeking clean local energy sources to power generations of Hawaii families and businesses to come. &nbsp;Visit us at&nbsp;<a href=\"http://hawaiianelectric.com/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=http://hawaiianelectric.com&amp;source=gmail&amp;ust=1608884622174000&amp;usg=AFQjCNHODUD1YIkZV4mF3Q0sU2yKcqNRjg\">http://hawaiianelectric.com</a>.</p>\n<p>Interested individuals should apply online.&nbsp; The application must clearly indicate the demonstrated experience/knowledge/skills/abilities the candidate possesses which specifically qualifies him/her for the position.</p>\n<p>Should there be no candidates with this experience, the company may consider applicants without such experience who meet the knowledge/skill requirements.&nbsp; If such a candidate is hired, he or she will initially be placed on a development plan commensurate with his/her&nbsp;education and experience level.</p>\n<p><u><strong>Applicant Certification</strong></u></p>\n<p>By submitting an application for the position, candidates:<br>\n1. Authorize&nbsp;the Hawaiian Electric Companies&nbsp;to confirm all statements contained in the application and/or any materials submitted and made a part of the application as they relate to the position and to the extent permitted by law;<br>\n2. Authorize and consent to, without reservation, the Hawaiian Electric Companies sharing any and all information regarding previous or present employment, educational training or personal information from their records and from any other source with the hiring department or subsidiary company;<br>\n3. Release, discharge, and hold harmless, Hawaiian Electric Companies, from any and all&nbsp;liability for any damage which may be claimed as a result of furnishing such information to the hiring department or subsidiary company;<br>\n4. Authorizes release and transfer of all personnel records to be maintained by the hiring company in the event of an inter-company transfer; and<br>\n5. Authorize, direct, and consent to Hawaiian Electric Companies and/or its authorized agents to conduct investigations into candidates’ background.&nbsp; These investigations may include, but are not limited to searches for information about applicants; record of criminal convictions to the extent permitted by law, education records, professional certifications, personal character references, and employment history.</p>\n<p><strong><u>EEO Statement</u></strong></p>\n<p>Hawaiian Electric Companies&nbsp;is an equal employment opportunity/affirmative action employer. We actively seek diversity among our employees. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex/gender (including gender identity/expression), ancestry/national origin, disability, marital status, arrest and court record, sexual orientation, pregnancy, veteran status, genetic information, domestic or sexual violence victim status, or other protected categories in accordance with state and federal laws. We further encourage individuals with disabilities, minorities, veterans and women to apply.</p>\n<p>Hawaiian Electric Companies complies with Title I of the Americans with Disabilities Act.&nbsp; Any request for&nbsp;reasonable&nbsp;accommodation needed&nbsp;during the application process should be communicated by the candidate to the HR Service Center at (808) 543-4848.</p>\n<p><strong><u>Affiliate Disclaimer</u></strong></p>\n<p>Hawaiian Electric Company, Inc., Maui Electric Company, and Hawaii Electric Light&nbsp;(“Company”) are&nbsp;Hawaii Public Utilities Commission (“PUC”) regulated companies.&nbsp; The disclosure relating to Affiliate Transaction Requirements that follows is made pursuant to the PUC’s Decision and Order No. 35962, issued on December 19, 2018, and subsequently modified by Order No. 36112, issued on January 24, 2019 in Docket No. 2018-0065.</p>\n<p>By submitting your application, you understand and acknowledge that, if you are hired by the Company and subsequently transferred, assigned or otherwise employed by an Affiliate, said Affiliate will be required to make a one-time payment to the Company in an amount equivalent to twenty-five percent (25%) of your base annual compensation.</p>\n<p>In addition, if you are hired by the Company and subsequently transferred, assigned or otherwise employed by an Affiliate or an Affiliate-Related Entity, for a period of one year, you cannot appear in negotiations or otherwise interact directly with the Company or work on the same matter that you worked on while with the Company.</p>\n<p>Affiliate is defined as “any person or entity that possesses an ‘affiliate interest’ in a utility as defined by section 269-19.5, Hawaii Revised Statutes (“HRS”), including a utility’s parent holding company, except as otherwise provided by HRS section 269-19.5(h).”</p>\n<p>Affiliate-Related Entity is defined as “a third party that provides electricity-related services in a regulated utility’s service territory that has a material financial, operational, or ownership interest with an unregulated affiliate of the utility and of whom the utility has reasonable knowledge.”</p>\n<p>For a current list of all Affiliates and Affiliate-Related Entities, please see:</p>\n<ul>\n<li><a href=\"https://www.hawaiianelectric.com/about-us/key-performance-metrics/financial/affiliate-transactions\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.hawaiianelectric.com/about-us/key-performance-metrics/financial/affiliate-transactions&amp;source=gmail&amp;ust=1608884622174000&amp;usg=AFQjCNFX7Jb3aRWvTUVxnoDRm8G2HmG6QA\">https://www.hawaiianelectric.com/about-us/key-performance-metrics/financial/affiliate-transactions</a></li>\n<li><a href=\"https://www.mauielectric.com/about-us/key-performance-metrics/financial/affiliate-transactions\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.mauielectric.com/about-us/key-performance-metrics/financial/affiliate-transactions&amp;source=gmail&amp;ust=1608884622174000&amp;usg=AFQjCNGnlEIa_nuo5CnK35c8-T3E_gYXEA\">https://www.mauielectric.com/about-us/key-performance-metrics/financial/affiliate-transactions</a></li>\n<li><a href=\"https://www.hawaiielectriclight.com/about-us/key-performance-metrics/financial/affiliate-transactions\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.hawaiielectriclight.com/about-us/key-performance-metrics/financial/affiliate-transactions&amp;source=gmail&amp;ust=1608884622174000&amp;usg=AFQjCNGzjaHhNPtMgTTWgPpmn-fgNMoasg\">https://www.hawaiielectriclight.com/about-us/key-performance-metrics/financial/affiliate-transactions</a></li>\n</ul>\n<p>This list may be amended, updated or revised from time to time without notice.</p>"
    }
]