[
    {
        "position": "IN-21038 Analytics Intern",
        "company": "Error",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-03-01T20:38:14.969Z",
        "url": "https://www.idealist.org/en/internship/d7a19f32a23f4ccd9731950788bb24d2-in-21038-analytics-intern-wwf-washington-dc-washington",
        "lastScraped": "2021-03-01T20:38:14.971Z",
        "description": "<p><strong>Overview</strong>\n</p><p>World Wildlife Fund (WWF), one of the world's \nleading conservation organization, seeks a Analytics Intern. The \ncandidate will use a variety of data mining/data analysis methods and \ntools to complete analysis of WWF's website visitors and WWF's marketing\n campaigns.</p><p>\n</p><p><br></p><p><br></p><p><strong>Responsibilities</strong></p><p><br></p><p><br></p><p>\n</p><ul><li>Performs exploratory analysis of website data</li><li>Cluster analysis of sessions and pages</li><li>Funnel analysis of conversions</li><li>Exit page analysis</li><li>Reporting/visualization of visitor journeys</li><li>Modeling of Next-best action</li><li>Modeling of visit purpose: information/donation/action</li><li>Performs other duties as assigned.</li></ul><p><br></p><p><strong>Qualifications</strong>\n</p><ul><li>Minimum of 15-20 hours per week.</li><li>Bachelor's degree in Mathematics, \nStatistics, Computer Science, Data Science, Business Analytics, \nEconomics, Finance, or other quantitative field required. Master's \nDegree or current enrollment in Master's program is preferred.</li><li>Minimum of 1 years of experience performing data analysis.</li><li>SAS experience (Enterprise Guide/Enterprise Miner/Viya) is required. SQL, R, Python or other programming experience is desired.</li><li>Knowledge and experience in statistical \nand data mining techniques: GLM/Regression, Random Forest, Boosting, \nDecision Trees, Neural Networks, text mining, social network analysis, \netc.</li><li>Excellent analytical skills, demonstrating the ability to create valuable strategic and financial analyses.</li><li>Strong communication skills with \nparticular emphasis on the ability to communicate effectively across \nteams with all levels of staff and consultants.</li><li>Preferred experience visualizing data using PowerBI or SAS Visual Analytics</li></ul><p>\n</p><p><strong><span>To Apply:</span></strong></p><p>\n</p><ul><li><strong>Submit cover letter and resume through our </strong><a href=\"https://careers-wwfus.icims.com/jobs?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong><span>Careers Page</span></strong></a><strong>, Requisition <span>#IN-21038</span></strong></li><li><strong>Due to the high volume of applications we are not able to respond to inquiries via phone</strong></li></ul><p>\n</p><p> </p><p>\n</p><p><strong>As an EOE/AA employer, WWF will \nnot discriminate in its employment practices due to an applicant's race,\n color, religion, sex, national origin, age, marital status, genetic \ninformation, sexual orientation, gender identity and expression, \ndisability, or protected Veteran status. WWF values diversity and \ninclusion and welcomes diverse candidates to apply.</strong></p><p><br></p><p>Apply Here: <a href=\"https://www.click2apply.net/V76BLmHrE2ZkuO22S8nRl?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.click2apply.net/V76BLmHrE2ZkuO22S8nRl</a></p><p><br></p><p>PI131035521\n                                                                        \n                                                                        \n                        </p><p><br></p>"
    },
    {
        "position": "Foodborne Disease Intern",
        "company": "The Fund for Public Health in New York City, Inc.",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-11-01T20:38:18.135Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/161b961aa4154ebda3fb417565cee89d-foodborne-disease-intern-the-fund-for-public-health-in-new-york-city-inc-new-york",
        "lastScraped": "2021-03-01T20:38:18.135Z",
        "description": "<p>The Fund for Public Health in New York City, (FPHNYC) is a 501(c)3 non-profit organization that is dedicated to the advancement of the health and well-being of all New Yorkers.&nbsp;To this end, in partnership with the New York City Department of Health and Mental Hygiene (DOHMH), FPHNYC incubates innovative public health initiatives implemented by DOHMH to advance community health throughout the city. It&nbsp;facilitates partnerships, often new and unconventional, between government and the private sector to develop, test, and launch new initiatives. These collaborations speed the execution of demonstration projects, effect expansion of successful pilot programs, and support rapid implementation to meet the public health needs of individuals, families, and communities across New York City.</p><p><br></p><p><strong><u>PROGRAM OVERVIEW</u></strong></p><p>The foodborne disease group at the New York City DOHMH, Bureau of Communicable Disease and Office of Environmental Investigations are working on a project, “Improving Foodborne Disease Outbreak Detection by Incorporating Complaints Identified in Social Media Data”.&nbsp;The project is a collaboration with the Columbia University Department of Computer Science and uses data from Yelp and Twitter to identify complaints of foodborne illness. The program is located primarily at 125 Worth St, New York, NY 10013 and 42-09 28th St, Long Island City, NY 11101.</p><p><br></p><p><strong><u>POSITION OVERVIEW</u></strong></p><p>The foodborne disease group has an opening for a new intern to assist foodborne disease environmental health specialists and epidemiologists with foodborne illness complaint detection and outbreak investigations.&nbsp;The candidate would start in October 2020, with the possibility of staying on for the entire 2020-2021 academic year. The candidate would work 20 hours/week during the school year, with daytime and evening hours from 9am-5pm.</p><p><strong><u>&nbsp;</u></strong></p><p><strong><u>RESPONSIBILITIES</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Follow-up and investigate reported foodborne disease complaints identified via social media and reported to the citywide complaint system (311); conduct telephone interviews using a standardized questionnaire</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Outbreak investigations</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data collection, data entry, data management, and data analysis</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other disease investigations within the Office of Environmental Investigations and Bureau of Communicable Disease where necessary</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Miscellaneous projects as needed</p><p><strong><u>QUALIFICATIONS</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent verbal and written communication skills</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Strong interest in infectious disease epidemiology and environmental health</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to multi-task</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Currently enrolled in a graduate (MPH, MS or PhD) program in public health or related field; Incoming students encouraged to apply</p><p><strong><u>SALARY AND BENEFITS</u></strong></p><p>The salary range for this position is commensurate with experience and education.</p><p><br></p><p><strong><u>TO APPLY</u></strong></p><p>To apply, send Resume, with Cover Letter, including salary requested and how your experience relates to this position <a href=\"https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?clientkey=30E67B8EB4D134CD03C82F22EB872BE9&amp;job=3251&amp;utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">here</a>. We ask that you do not contact our staff directly and no phone inquiries please. Applicants who best match the position needs will be contacted.</p><p><br></p><p><br></p><p><strong><em>The Fund for Public Health in New York City is an Equal Opportunity Employer and encourages a diverse pool of candidates to apply.</em></strong></p>"
    },
    {
        "position": "MEDICINE AND HEALTHCARE EXPERIENCE & OBSERVATION",
        "company": "Aldeas de Paz - Peace Villages",
        "location": {},
        "posted": "2019-05-11T20:38:21.465Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/6d0a8f7a795849059ae63ef86697fab8-medicine-and-healthcare-experience-observation-aldeas-de-paz-peace-villages-santa-barbara-de-samana",
        "lastScraped": "2021-03-01T20:38:21.465Z",
        "description": "<h2><strong>MEDICINE AND HEALTHCARE EXPERIENCE &amp; OBSERVATION - Work side by side with medical staff at the local hospital</strong></h2><p><strong>Gain invaluable hands-on experience, working side by side with medical staff and fellow volunteers at a hospital or a neighborhood health clinic.</strong> This opportunity will give you an insight into the running and daily routine of a hospital or a neighborhood health clinic. You will experience the stark contrast between Western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing, there are many challenges faced and as a result you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage. Therefore this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country.</p><p>Furthermore, you can gain experience in a range of different departments and activities within the hospital/health clinic, such as: emergency, pediatric, maternity (only female volunteers), diabetes, integral attention &amp; prevention for HIV, tuberculosis and uterine cancer as well as nursing, hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the hospital pharmacy. You are welcome to also work on our other projects such as the English and computer literacy classes for locals.</p><p>This opportunity will give you an insight into the day to day running of a hospital or clinic. You will experience the stark contrast between western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing there are many challenges faced and there are realities not often seen in developed countries. Therefore, this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country where you will be faced with the stark realities of the disparities between medical practice in the developed and developing world. This means that, sadly, you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage uncommon in developed countries. Furthermore, you can gain experience in a range of different departments and activities within the hospital, such as: Emergency, Pediatry, Maternity (only female volunteers), Diabetes and Integral Attention &amp; Prevention for HIV, Tuberculosis and Uterine Cancer as well as Nursing, Hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the pharmacy.</p><p>Your level of possible involvement will largely depend on your Spanish language skills and experiences in the field, as well as your motivation and willingness to get involved. It will also depend on the current needs and tasks at the hospital as we really want to help out wherever our help is needed most. Your work schedule will be created in a meeting with the departmental director and the volunteer coordinator and supervisor. In this process we always try to match your interests and skills with the current situation at the hospital. In order to gain the most out of your experience, and especially if you have a specific health care goal, please contact us in advance to discuss your options in detail. Please keep in mind that hospitalized patient care in the Dominican Republic is much less extensive compared to nursery practices in the western world! It is common to see that family members are expected to take care of their patient at the hospital.&nbsp;</p><p><strong>What to expect</strong></p><p>You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs.</p><p><strong>Activities can include but are not limited to&nbsp;</strong></p><ul><li>Observing, shadowing and assisting doctors and nurses during their work</li><li>Participating in patient care: comforting patients and assisting with examinations</li><li>Providing ambulance support when needed</li><li>Assisting, teaching and encouraging prevention, hygiene and checkups</li><li>Assisting in developing educational materials and engagement strategies for various prevention programs using multimedia&nbsp;</li><li>Helping regularly with hospital administration tasks and helping improve procedures and workflow</li><li>Some volunteers may also choose to teach English to the doctors, provided that there is a sufficient number of doctors interested</li><li>Foreign medical missions visit and work at the hospital several times a year. You may accompany them and translate for them and the patients</li></ul><p><strong>Requirements&nbsp;</strong></p><p>This program is suitable for pre-medical students and students of pharmaceutics as well as nursing students with free holiday time, pre-university students, students taking or planning to take specialist medical courses such as biomedical science, nursing and physiotherapy as well as professionals. The key requirements for a medical volunteer or intern are initiative, enthusiasm, and readiness to work in unfamiliar circumstances. If volunteers have more specialized skills, this will allow for more specialized activities. Basic conversational Spanish skills are required and the more advanced your level of experience and Spanish language skills, the larger the number of opportunities available. To allow a deeper engagement with your placement we offer free Spanish language lessons every week allowing for an enhanced experience as a volunteer/intern with us. Suggestions on what to bring: Please bring scrubs and easy to clean comfortable closed shoes to wear as they are mandatory</p><p>Please bring scrubs and closed shoes that are easy to clean for working in the hospital, as they are mandatory. Latex gloves, hand sanitizer and face masks (N95 for the TB patients) would be a very helpful donation to the dental clinic.</p><p><strong>Guidelines on medical Issues of the Dominican Republic:</strong></p><ul><li>WHO reportcon health care reform in Dominican Republic, 2010</li><li>Health System of the Dominican Republic, 2011. The website provides an excellent overview of common medical issues in the DR and the government health system. Only available in Spanish.</li></ul><p><strong>Volunteer Placement or Internship </strong></p><p>You can join this program as a volunteer and are free to commit from between 20 to 40 hours per week. Thats up to you! As an intern however you probably have to fulfill requirements set by your school or university. Please inform us of your school or university’s internship requirements in advance so that we can work out your personalized work plan together. Also tell us about your personal expectations and goals and we will see how we can help you achieve them.</p><p><strong>Time Commitment&nbsp;</strong></p><p>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a six to eight week minimum time commitment is encouraged. You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs. Spanish speakers will get the most out of the rotation. Friendly and welcoming physicians, nurses, and patients make this rotation a joy to be a part of! You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Availability </strong>this program is ongoing throughout the whole year</p><p><strong>Placement Locations</strong>: Hospital and neighbourhood health clinics in Samana, La Pascuala and Las Terrenas</p><p><strong>Time Commitment </strong>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a 6 to 8 week minimum time commitment is encouraged. You can join this program throughout the whole year.&nbsp;You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Financial Contribution &amp; Benefits&nbsp;</strong></p><p>Aldeas de Paz works hard to keep the required financial contribution to an absolute minimum and to offer financial transparency by practicing an open book policy. The calculation of your financial contribution or donation is set up so that the longer you stay the less you give per week. We do this to encourage longer stays, recognizing that longer stays lead to more significant volunteer work and more energy contributed in the form of donated time in place of money! The minimum contribution starts at €175 per week and includes Spanish language classes, double room at one of our fully equipped guesthouse apartments, a special program donation as well as a personal welcome service and pick-up at the airport, transfer to the bus, bus fare and free transfer to your placement location in Las Terrenas or Samana. If you wish a single room upgrade add €50 per week and an all in Host Family homestay upgrade is €150 per week, including a private bedroom and two meals per day. For more information about costs and benefits check out our <a href=\"http://www.peacevillages.org/fee?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">webpage</a>.</p><p><strong>What is included</strong></p><ul><li>Welcome Service at the airport and transport to your placement location&nbsp;</li><li>Volunteer or Internship placement</li><li>Accommodation of your choice</li><li>Placement introduction, training, supervision, briefings and meetings</li><li>Free regular Spanish lessons throughout your placement&nbsp;</li><li>Free Wifi and use of washing machine at all our facilities&nbsp;</li><li>Certificate, written reference and student credit</li><li>Information about adventure packages</li><li>Full support and 24/7 backup from local staff</li></ul><p><strong>Special Offer&nbsp;</strong></p><p><strong>Spanish language classes</strong>: Volunteers and interns receive free language lessons every week. The classes focus on developing communication skills so that students are able to put their knowledge to practical use as soon as they step outside the classroom. Our teaching method enables students to develop four basic skills: listening comprehension, speaking, reading and writing. The idea is to learn Spanish in a natural and spontaneous way, just as students have learned their mother tongue. Our students are encouraged to speak Spanish right from the very first day, using it in typical real-life situations: the basic syllabus is supplemented by special exercises, such as role-play, situational dialogues and work projects. Outside the classroom, the learning process continues as you are immersed in the Spanish language and the Dominican culture.</p><p><strong>Contact Information&nbsp;</strong></p><p>Contact Person: Manfred Mönnighoff</p><p>Project/charity name: Fundación Aldeas de Paz</p><p>Address: Samana, Dominican Republic</p><p>Whatsapp: +1 829 7055 123</p><p>E-Mail: <a href=\"mailto:mail@peacevillages.org\">mail@peacevillages.org</a></p><p>Webpage: <a href=\"https://www.peacevillages.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.peacevillages.org</a></p><p>Facebook: <a href=\"https://www.facebook/AldeasdePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.facebook/AldeasdePaz</a></p><p>Instagram: <a href=\"https://www.instagram.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.instagram.com/AldeasDePaz</a></p><p>Twitter: <a href=\"https://twitter.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://twitter.com/AldeasDePaz</a></p><p>YouTube: <a href=\"http://www.youtube.com/Peacevillages?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">http://www.youtube.com/Peacevillages</a></p>"
    },
    {
        "position": "MEDICINE AND HEALTHCARE EXPERIENCE & OBSERVATION",
        "company": "Aldeas de Paz - Peace Villages",
        "location": {},
        "posted": "2019-05-11T20:38:27.335Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/85cc12f67b7c4249aa084a40e01b8ee8-medicine-and-healthcare-experience-observation-aldeas-de-paz-peace-villages-santa-barbara-de-samana",
        "lastScraped": "2021-03-01T20:38:27.335Z",
        "description": "<h2><strong>MEDICINE AND HEALTHCARE EXPERIENCE &amp; OBSERVATION - Work side by side with medical staff at the local hospital</strong></h2><p><strong>Gain invaluable hands-on experience, working side by side with medical staff and fellow volunteers at a hospital or a neighborhood health clinic.</strong> This opportunity will give you an insight into the running and daily routine of a hospital or a neighborhood health clinic. You will experience the stark contrast between Western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing, there are many challenges faced and as a result you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage. Therefore this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country.</p><p>Furthermore, you can gain experience in a range of different departments and activities within the hospital/health clinic, such as: emergency, pediatric, maternity (only female volunteers), diabetes, integral attention &amp; prevention for HIV, tuberculosis and uterine cancer as well as nursing, hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the hospital pharmacy. You are welcome to also work on our other projects such as the English and computer literacy classes for locals.</p><p>This opportunity will give you an insight into the day to day running of a hospital or clinic. You will experience the stark contrast between western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing there are many challenges faced and there are realities not often seen in developed countries. Therefore, this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country where you will be faced with the stark realities of the disparities between medical practice in the developed and developing world. This means that, sadly, you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage uncommon in developed countries. Furthermore, you can gain experience in a range of different departments and activities within the hospital, such as: Emergency, Pediatry, Maternity (only female volunteers), Diabetes and Integral Attention &amp; Prevention for HIV, Tuberculosis and Uterine Cancer as well as Nursing, Hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the pharmacy.</p><p>Your level of possible involvement will largely depend on your Spanish language skills and experiences in the field, as well as your motivation and willingness to get involved. It will also depend on the current needs and tasks at the hospital as we really want to help out wherever our help is needed most. Your work schedule will be created in a meeting with the departmental director and the volunteer coordinator and supervisor. In this process we always try to match your interests and skills with the current situation at the hospital. In order to gain the most out of your experience, and especially if you have a specific health care goal, please contact us in advance to discuss your options in detail. Please keep in mind that hospitalized patient care in the Dominican Republic is much less extensive compared to nursery practices in the western world! It is common to see that family members are expected to take care of their patient at the hospital.&nbsp;</p><p><strong>What to expect</strong></p><p>You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs.</p><p><strong>Activities can include but are not limited to&nbsp;</strong></p><ul><li>Observing, shadowing and assisting doctors and nurses during their work</li><li>Participating in patient care: comforting patients and assisting with examinations</li><li>Providing ambulance support when needed</li><li>Assisting, teaching and encouraging prevention, hygiene and checkups</li><li>Assisting in developing educational materials and engagement strategies for various prevention programs using multimedia&nbsp;</li><li>Helping regularly with hospital administration tasks and helping improve procedures and workflow</li><li>Some volunteers may also choose to teach English to the doctors, provided that there is a sufficient number of doctors interested</li><li>Foreign medical missions visit and work at the hospital several times a year. You may accompany them and translate for them and the patients</li></ul><p><strong>Requirements&nbsp;</strong></p><p>This program is suitable for pre-medical students and students of pharmaceutics as well as nursing students with free holiday time, pre-university students, students taking or planning to take specialist medical courses such as biomedical science, nursing and physiotherapy as well as professionals. The key requirements for a medical volunteer or intern are initiative, enthusiasm, and readiness to work in unfamiliar circumstances. If volunteers have more specialized skills, this will allow for more specialized activities. Basic conversational Spanish skills are required and the more advanced your level of experience and Spanish language skills, the larger the number of opportunities available. To allow a deeper engagement with your placement we offer free Spanish language lessons every week allowing for an enhanced experience as a volunteer/intern with us. Suggestions on what to bring: Please bring scrubs and easy to clean comfortable closed shoes to wear as they are mandatory</p><p>Please bring scrubs and closed shoes that are easy to clean for working in the hospital, as they are mandatory. Latex gloves, hand sanitizer and face masks (N95 for the TB patients) would be a very helpful donation to the dental clinic.</p><p><strong>Guidelines on medical Issues of the Dominican Republic:</strong></p><ul><li>WHO reportcon health care reform in Dominican Republic, 2010</li><li>Health System of the Dominican Republic, 2011. The website provides an excellent overview of common medical issues in the DR and the government health system. Only available in Spanish.</li></ul><p><strong>Volunteer Placement or Internship </strong></p><p>You can join this program as a volunteer and are free to commit from between 20 to 40 hours per week. Thats up to you! As an intern however you probably have to fulfill requirements set by your school or university. Please inform us of your school or university’s internship requirements in advance so that we can work out your personalized work plan together. Also tell us about your personal expectations and goals and we will see how we can help you achieve them.</p><p><strong>Time Commitment&nbsp;</strong></p><p>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a six to eight week minimum time commitment is encouraged. You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs. Spanish speakers will get the most out of the rotation. Friendly and welcoming physicians, nurses, and patients make this rotation a joy to be a part of! You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Availability </strong>this program is ongoing throughout the whole year</p><p><strong>Placement Locations</strong>: Hospital and neighbourhood health clinics in Samana, La Pascuala and Las Terrenas</p><p><strong>Time Commitment </strong>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a 6 to 8 week minimum time commitment is encouraged. You can join this program throughout the whole year.&nbsp;You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Financial Contribution &amp; Benefits&nbsp;</strong></p><p>Aldeas de Paz works hard to keep the required financial contribution to an absolute minimum and to offer financial transparency by practicing an open book policy. The calculation of your financial contribution or donation is set up so that the longer you stay the less you give per week. We do this to encourage longer stays, recognizing that longer stays lead to more significant volunteer work and more energy contributed in the form of donated time in place of money! The minimum contribution starts at €175 per week and includes Spanish language classes, double room at one of our fully equipped guesthouse apartments, a special program donation as well as a personal welcome service and pick-up at the airport, transfer to the bus, bus fare and free transfer to your placement location in Las Terrenas or Samana. If you wish a single room upgrade add €50 per week and an all in Host Family homestay upgrade is €150 per week, including a private bedroom and two meals per day. For more information about costs and benefits check out our <a href=\"http://www.peacevillages.org/fee?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">webpage</a>.</p><p><strong>What is included</strong></p><ul><li>Welcome Service at the airport and transport to your placement location&nbsp;</li><li>Volunteer or Internship placement</li><li>Accommodation of your choice</li><li>Placement introduction, training, supervision, briefings and meetings</li><li>Free regular Spanish lessons throughout your placement&nbsp;</li><li>Free Wifi and use of washing machine at all our facilities&nbsp;</li><li>Certificate, written reference and student credit</li><li>Information about adventure packages</li><li>Full support and 24/7 backup from local staff</li></ul><p><strong>Special Offer&nbsp;</strong></p><p><strong>Spanish language classes</strong>: Volunteers and interns receive free language lessons every week. The classes focus on developing communication skills so that students are able to put their knowledge to practical use as soon as they step outside the classroom. Our teaching method enables students to develop four basic skills: listening comprehension, speaking, reading and writing. The idea is to learn Spanish in a natural and spontaneous way, just as students have learned their mother tongue. Our students are encouraged to speak Spanish right from the very first day, using it in typical real-life situations: the basic syllabus is supplemented by special exercises, such as role-play, situational dialogues and work projects. Outside the classroom, the learning process continues as you are immersed in the Spanish language and the Dominican culture.</p><p><strong>Contact Information&nbsp;</strong></p><p>Contact Person: Manfred Mönnighoff</p><p>Project/charity name: Fundación Aldeas de Paz</p><p>Address: Samana, Dominican Republic</p><p>Whatsapp: +1 829 7055 123</p><p>E-Mail: <a href=\"mailto:mail@peacevillages.org\">mail@peacevillages.org</a></p><p>Webpage: <a href=\"https://www.peacevillages.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.peacevillages.org</a></p><p>Facebook: <a href=\"https://www.facebook/AldeasdePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.facebook/AldeasdePaz</a></p><p>Instagram: <a href=\"https://www.instagram.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.instagram.com/AldeasDePaz</a></p><p>Twitter: <a href=\"https://twitter.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://twitter.com/AldeasDePaz</a></p><p>YouTube: <a href=\"http://www.youtube.com/Peacevillages?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">http://www.youtube.com/Peacevillages</a></p>"
    },
    {
        "position": "Communications Intern (m/f/d)",
        "company": "Democracy Reporting International",
        "location": {
            "city": "Elbestraße",
            "state": "Berlin"
        },
        "posted": "2019-09-08T20:38:32.730Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/6020e03007364e028fa068b2c023464e-communications-intern-mfd-democracy-reporting-international-berlin",
        "lastScraped": "2021-03-01T20:38:32.730Z",
        "description": "<p><strong>Background</strong></p><p> Democracy Reporting International (DRI) is a non-partisan, independent, not-for-profit organisation registered in Berlin. Democracy Reporting International promotes political participation of citizens, accountability of state bodies and the development of democratic institutions world-wide.</p><p>DRI is recruiting a <strong>Communications Intern</strong> for its Berlin headquarters to support our communications works across the headquarters and country offices.</p><p><strong>Your tasks:</strong></p><ul><li>Working under the supervision of DRI’s Communications Coordinator, you will assist the communications section with communication and public outreach efforts across the organisation;</li><li>Assist in developing design, multimedia products, stories and content for digital platforms including the DRI website, Twitter, Facebook, and LinkedIn;</li><li>Assist with monitoring media to determine trends and to inform communications efforts;</li><li>Proactively contribute ideas for projects and stories that will help to promote communications and build narrative on DRI’s work;</li><li>Perform any other duties as requested by DRI’s Communications Coordinator.</li></ul><p><strong>Your skills and experience:</strong></p><p> Required</p><ul><li>Ongoing studies in political science, international affairs, social sciences, design, journalism, communications or related fields;</li><li>Demonstrated relevant work experience;</li><li>Proficiency in key computer applications, such as Microsoft Word, Outlook, PowerPoint and Excel;</li><li>Diligence, eye for detail, pro-active attitude and strong willingness to learn and engage with different stakeholders in an international environment;</li><li>Excellent English writing and communication skills;</li><li><strong>Student status</strong>; you must be enrolled in university throughout the duration of the internship;</li><li><strong>Working permit for Germany</strong> (if you are a foreign student).</li></ul><p>Preferred</p><ul><li>Familiarity with design software such as Adobe Photoshop, Illustrator, InDesign, or with infographic-making tools;</li><li>Experience working with website Content Management Systems such as WordPress or Drupal;</li><li>Experience writing content that was subsequently published (online or in print);</li><li>Previous experience working with an NGO or non-profit organisation.</li></ul><p><br></p>"
    },
    {
        "position": "Community Engagement and Education Intern - Social Harvest",
        "company": "incubator13",
        "location": {
            "city": "Ottawa",
            "state": "ON"
        },
        "posted": "2020-06-04T20:38:37.491Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/91b65a4b87f2418f8a7e4df63949d1a3-community-engagement-and-education-intern-social-harvest-incubator13-ottawa",
        "lastScraped": "2021-03-01T20:38:37.491Z",
        "description": "<p><br></p><p><br></p><p><strong>Position Title:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>Community Engagement and Education Intern - Social Harvest</p><p><strong>Reports to:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>Social Harvest Project Lead</p><p><strong>Job Type:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>Three months short term contract, part-time (30 hours/week)</p><p><strong>Training period:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>February 26 – March 16 (90 hours)</p><p><strong>Start date:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>March 18<sup>th</sup> , 2021</p><p><strong>End date:</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;May 27<sup>th</sup>&nbsp;, 2021</p><p><strong>Wage:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>$18/hour</p><p><strong>Reference #&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2021-SH-02</strong></p><p><strong>&nbsp;</strong></p><p>&nbsp;Social Harvest Ottawa is one of the Rideau-Rockcliffe Community Resource Centre's (RRCRC) social enterprises. Under the supervision of the Social Harvest Project Officer, the Community Engagement and Education Intern will promote the Social Harvest Ottawa community engagement activities (i.e. community garden), prepare workshops related to food literacy and urban agriculture, and develop strong relationship with community members and partners. In this position, the intern will gain skills in project management, community education, and evaluation.</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>You can apply if you meet the following criteria to become a participant of the Youth Job Connection – CORE program hosted by the Youth Service Bureau:&nbsp;</strong></p><ul><li>Be between the ages of 18 and 29 years old;</li><li>Be unemployed</li><li>Be a resident of Ontario and eligible to work</li><li>Not enrolled in full-time education or training</li><li>Canadian citizen, permanent resident or a newcomer with a work permit (without restrictions);</li><li>Not have an active service plan with another Employment Ontario service provider</li><li>Provide a Police Check</li><li>Have a registered Social Insurance Number (SIN).</li></ul><p>&nbsp;</p><h5>&nbsp;A.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Community Garden</h5><ul><li>Participate at the Community Garden Board meetings and act as a liaison between community volunteers and the RRCRC</li><li>Assist in the preparation of documentation such as activity reports</li><li>Support and monitor gardening activities</li></ul><h5>&nbsp;B.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Community Education</h5><ul><li>Engage&nbsp;in conversation with community members to identify needs and desires</li><li>Create&nbsp;and present lesson plans and workshops for various audiences</li><li>Recruit and encourage participant and volunteer involvement</li></ul><p>&nbsp;</p><p>C.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other duties</p><ul><li>Research and apply&nbsp;for funding opportunities and grant proposals</li><li>Monitor&nbsp;and evaluate the efficacy of the education programs</li><li>Work closely with colleagues</li><li>Reports regularly&nbsp;to supervisor</li><li>Participate&nbsp;in team meetings</li><li>Other&nbsp;tasks as assigned by the supervisor&nbsp;</li><li>High School&nbsp;diploma and/or Post-secondary education in a field related to education or&nbsp;environmental sciences</li><li>Strong interest&nbsp;and basic&nbsp;experience&nbsp;in community engagement and gardening</li><li>Experience&nbsp;in project management and facilitating group activities</li><li>Fluency&nbsp;in French and English</li><li>Basic computer skills and experience with Microsoft Office Suite</li><li>Strong interpersonal&nbsp;skills&nbsp;and&nbsp;communication abilities</li><li>Ability&nbsp;to work flexible hours, including weekends</li><li>Ability&nbsp;and willingness to:</li><li>Be helpful, respectful, approachable and team-oriented (Collegiality)</li><li>Take ownership of work, do what is needed, follow through (Initiative)</li><li>Plan ahead, manage time well, be on time, be cost conscious, think of better ways to do things (Efficiency)</li><li>Be receptive to feedback, be willing to learn, embrace continuous improvement (Coaching ability)</li></ul><p><br></p><p>&nbsp;</p><p>&nbsp;Please send you <strong>resume</strong> &amp; <strong>cover</strong> <strong>letter, mentioning the Position Title </strong>until <strong>latest Thursday February 25</strong><sup><strong>th</strong></sup><strong>,&nbsp;2021</strong> (end of day) to the attention of Camila Pastran&nbsp;(<a href=\"mailto:camila.pastran@crcrr.org\">camila.pastran@crcrr.org</a>). Please complete your application at <a href=\"https://form.jotform.com/203225270902243?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://form.jotform.com/203225270902243</a></p><p>&nbsp;We thank all the candidates for their interest, however <u>only selected candidates for an interview will be contacted</u>.</p>"
    },
    {
        "position": "Paid Summer Internships in Advocacy & Communications (Remote)",
        "company": "Phi Beta Kappa Society",
        "location": {
            "city": "1606 New Hampshire Avenue NW",
            "state": "Washington"
        },
        "posted": "2020-09-02T20:38:42.123Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/d09d6a0539b0416da2c01f03a9b028de-paid-summer-internships-in-advocacy-communications-remote-phi-beta-kappa-society-washington",
        "lastScraped": "2021-03-01T20:38:42.123Z",
        "description": "<p>We are excited to share these opportunities for seasonal employment with The Phi Beta Kappa Society’s national office. We are looking for two part-time interns to work remotely on a variety of projects:</p><h3><strong>Events &amp; Advocacy&nbsp;</strong>Intern</h3><p>This intern will work primarily with our <a href=\"https://www.pbk.org/arts-sciences?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">National Arts &amp; Sciences Initiative</a> team to plan virtual events, conduct research, and develop materials to grow support for the liberal arts and sciences. The intern will also have an opportunity to learn the logistics of planning and executing major national large-scale convenings virtually as well as the day-to-day responsibilities of a major advocacy campaign. While the intern will work primarily with the National Arts &amp; Sciences Initiative, they will also assist with other programmatic and event-related tasks as needed.&nbsp;Duties will include:</p><ul><li>Supporting large-scale virtual event planning, which may include: assisting with logistical tasks related to the management of our <a href=\"https://www.pbk.org/KeyIntoPublicService?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Key into Public Service</a> and the Society’s <a href=\"https://www.pbk.org/triennial?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Triennial Council Meeting</a>, researching potential speakers, helping design promotional materials, providing support to conference attendees, and more.&nbsp;</li><li>Researching and compiling higher education news stories to feature in the monthly advocacy e-alerts;</li><li>Assisting in the development of event-related communications, such as social media posts and emails to members using mass mailing software;&nbsp;</li><li>Drafting general correspondence, developing copy, and proofreading documents as needed;&nbsp;</li><li>Completing a capstone project; and</li><li>Other duties as assigned.</li></ul><p><strong>Qualifications</strong></p><p>We are looking for a college student or recent graduate with a passion for the unique benefits of liberal arts and sciences and higher education advocacy issues. Exceptional time-management and organizational skills to manage and meet deadlines for multiple projects simultaneously along with strong writing and interpersonal communication skills are required. Familiarity with virtual conference platforms and Canva are pluses. The position will work remotely, and requires access to a computer, reliable internet, and a phone. Applicants are welcome to apply for both positions.</p><p><br></p><h3><strong>Communications &amp; Member Engagement Inter</strong>n</h3><p>This intern will work primarily with our Communications and Chapters &amp; Associations teams to conduct research and develop materials to join the national conversation on advancing the liberal arts and sciences and supporting the Society’s <a href=\"https://www.pbk.org/Chapters?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">290 chapters</a> and <a href=\"https://www.pbk.org/Associations?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">50 associations</a>. The intern will have an opportunity to participate remotely in the day-to-day responsibilities of running a non-profit with a nationwide reach. Duties will include:</p><ul><li>Assisting in the development of communications and social media posts;</li><li>Developing copy for Phi Beta Kappa national&nbsp;website;&nbsp;</li><li>Developing copy for regional Phi Beta Kappa association websites and newsletters;</li><li>Drafting general correspondence and proofreading documents as needed;</li><li>Sending local event emails to members using mass email platform Informz;</li><li>Updating the communications calendar with engagement opportunities;</li><li>Collaborating with the communications and web teams on new content and concepts;</li><li>Assisting in the planning and execution of the <a href=\"https://www.pbk.org/Key-Connections?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Key Connections</a> alumni events in September;&nbsp;</li><li>Assisting with other Society programs on an as needed basis, including the Visiting Scholar program, the <a href=\"https://www.pbk.org/Book-Awards?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Book Awards</a> and planning for the upcoming <a href=\"https://www.pbk.org/triennial?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Triennial Council Meeting</a> of the Society.</li><li>Completing a capstone project; and</li><li>Other duties as assigned.</li></ul><p><strong>Qualifications</strong></p><p>We are looking for a college student or recent graduate with a passion for the liberal arts and sciences and strong writing abilities. Familiarity with website editing and Canva are pluses. Preference will be given to Phi Beta Kappa members. The position will work remotely, and requires access to a computer, reliable internet, and a phone. Applicants are welcome to apply for both positions.</p>"
    }
]