[
    {
        "position": "Alumni Internship - Summer/Fall 2021",
        "company": "Society for Science & the Public",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-23T08:25:21.461Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/16b471322e664334871b22766ac8cb37-alumni-internship-summerfall-2021-society-for-science-the-public-washington",
        "lastScraped": "2021-07-08T08:25:21.461Z",
        "description": "<p>The Alumni Relations Intern works with a vibrant alumni relations and fundraising team – encompassing annual giving, corporate and foundation relations, major gifts, and development operations. The intern will help Society for Science improve our data and engagement with past participants of the Society’s Science Talent Search, ISEF, and Broadcom MASTERS competitions.</p><p>Start date is negotiable. Applicants planning to receive course credit for this internship should provide any necessary information regarding requirements to the Society.</p><h3>Primary Responsibilities:</h3><ul><li>Conduct research on past participants of the Society’s science competitions</li><li>Assist with identifying potential speakers and giving prospects</li><li>Perform data entry and analysis using Blackbaud Raiser’s Edge and Microsoft Access</li><li>Support the Alumni Relations Specialist with posting to and managing the Society Alumni Network</li><li>Assist with planning and/or executing virtual alumni events</li><li>Assist with general administrative duties</li></ul><h3>Desired Competencies:</h3><ul><li>Excellent written and verbal communication skills</li><li>Database experience preferred (Raiser’s Edge, Access, Excel)</li><li>Customer service experience</li><li>Proficiency in Microsoft Office: Word, Excel, PowerPoint, Outlook</li><li>High attention to detail and demonstrated proactive and strategic approach to daily tasks</li><li>Proficiency with Internet searches</li><li>Demonstrated ability to work with others as a team</li><li>Understanding of and affinity for the core values of the Society.</li></ul><h3>Work Environment</h3><p>Our office is located near the Dupont Circle and Farragut North Metro stations. This position usually works in an office setting but will temporarily work from home until at least September 7, 2021 with possible extensions.</p><h3>Physical Demands</h3><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to use hands and fingers to operate a computer and other office equipment.</p><h3>Position Type and Expected Hours</h3><p>This is a part-time internship with a term of 3-6 months. The Alumni Relations Intern will work 15-35 hours per week and will be paid a rate of $15 per hour. Days and hours of work are Monday through Friday during normal office hours of the Society.</p><h3>Required Education and Experience</h3><p>Interns must be current undergraduate or graduate students. Preference is given to students who are considering careers at educational institutions or non-profits and/or have an interest in alumni relations, STEM education, fundraising, membership, institutional giving, communications, advancement, or audience development.</p><h3>How To Apply</h3><p>Send your resume and cover letter to&nbsp;<a href=\"mailto:career@societyforscience.org\">career@societyforscience.org</a>. Emails should include “<strong>Alumni Intern</strong>” in the subject line. They can be addressed to Lauren Helms, Director of Alumni Relations . No phone calls please.</p><h3>EEO Statement</h3><p>The Society is an Equal Employment Opportunity Employer.</p><p>Society for Science is committed to equal employment opportunity. In order to provide equal employment and advancement opportunities to all individuals, the Society does not discriminate against employees or applicants for employment on any legally recognized basis, including but not limited to: veteran status, race, color, religion, gender, marital status, sexual orientation, gender identity or expression, ancestry, national origin, disability, personal appearance, family responsibilities, matriculation, political affiliation, age and/or any other categories protected by the laws of the United States or the District of&nbsp;Columbia.</p><h3>Other Duties</h3><p>Please note this job description is not designed to cover every duty, responsibility and activity that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.</p>"
    },
    {
        "position": "Advancement Internship",
        "company": "Society for Science & the Public",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-17T08:25:23.496Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/226290e750544f779bad2d9549acf9f5-advancement-internship-society-for-science-the-public-washington",
        "lastScraped": "2021-07-08T08:25:23.496Z",
        "description": "<p>The Advancement Intern works with a vibrant fundraising team – encompassing annual giving, corporate and foundation relations, major gifts, and development operations. The intern will help Society for Science  improve our data and communications with alumni, members, and donors, streamline internal processes, plan our approach to corporations and major foundations, and report to donors on the impact of their giving.</p><p>Start date is negotiable. Applicants planning to receive course credit for this internship should provide any necessary information regarding requirements to the Society.</p><h3>Primary Responsibilities:</h3><ul><li>Perform substantive, comprehensive research projects</li><li>Assist with identifying potential major gift or institutional giving prospects via online research and writing brief memos</li><li>Perform data entry and analysis using Blackbaud Raiser’s Edge</li><li>Assist with data integrity of major gift portfolios</li><li>Identify potential sponsors for Science News in High Schools program</li><li>Build logistics and templates for direct marketing plan</li><li>Assist with year-round fundraising campaigns</li><li>Analyze and organize department shared files to maximize efficiency and improve usage</li><li>Proofread various materials including donor letters, proposals, sponsorship documents, etc.</li><li>Assist with general administrative duties</li></ul><h3>Desired Competencies</h3><ul><li>Excellent written and verbal communication skills</li><li>Database experience preferred (Raiser’s Edge, Access, Excel)</li><li>Customer service experience</li><li>Proficiency in Microsoft Office: Word, Excel, PowerPoint, Outlook</li><li>High attention to detail and demonstrated proactive and strategic approach to daily tasks</li><li>Proficiency with Internet searches</li><li>Demonstrated ability to work with others as a team</li><li>Understanding of and affinity for the core values of the Society</li></ul><h3>Work Environment</h3><p>While performing the duties of this job, the employee regularly works in an office&nbsp;setting.<strong>&nbsp;</strong>Our office is located near the Dupont Circle and Farragut North Metro stations. This position usually works in an office setting but will temporarily work from home until at least September 7, 2021 with possible extensions.</p><h3>Physical Demands</h3><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this&nbsp;job, the employee is regularly required to use hands and fingers to operate a computer and other office equipment.</p><h3>Position Type and Expected Hours</h3><p>This is a part-time internship with a term of 3-6 months. The Advancement Intern will work 15-35 hours per week and will be paid a rate of $15 per hour. Days and hours of work are Monday through Friday during&nbsp;normal office hours of the Society.</p><h3>Required Education and Experience</h3><p>Interns must be current undergraduate or graduate students. Preference is given to students who are considering careers at educational institutions or non-profits and/or have an interest in fundraising, membership, institutional giving, alumni relations, communications, advancement, or audience development.</p><h3>How to Apply</h3><p>Send your resume and cover letter to&nbsp;<a href=\"mailto:career@societyforscience.org\">career@societyforscience.org</a>. Emails should include “<strong>Advancement Intern</strong>” in the subject line. They can be addressed to Bruce Makous, Chief Advancement Officer. No phone calls please.</p><h3>EEO Statement</h3><p>The Society is an Equal Employment Opportunity Employer.</p><p>Society for Science is committed to equal employment opportunity. In order to provide equal employment and advancement opportunities to all individuals, the Society does not discriminate against employees or applicants for employment on any legally recognized basis, including but not limited to: veteran status, race, color, religion, gender, marital status, sexual orientation, gender identity or expression, ancestry, national origin, disability, personal appearance, family responsibilities, matriculation, political affiliation, age and/or any other categories protected by the laws of the United States or the District of&nbsp;Columbia.</p><h3>Other Duties</h3><p>Please note this job description is not designed to cover every duty, responsibility and activity that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.</p>"
    },
    {
        "position": "Policy Intern, Healthcare Anchor Network",
        "company": "Democracy Collaborative",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-23T08:25:24.725Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/045d741df5634e558a188bdf10e09635-policy-intern-healthcare-anchor-network-democracy-collaborative-washington",
        "lastScraped": "2021-07-08T08:25:24.725Z",
        "description": "<p>The Democracy Collaborative (TDC) is hiring for a remote, part-time (up to 20 hours per week), paid intern position to support the work of the Healthcare Anchor Network (HAN). The internship will focus on public policy research, analysis, writing, advocacy, and communications. The intern will work directly with the Healthcare Anchor Network team and will have the opportunity to participate in policy discussions, conference calls, and meetings with middle and senior management from healthcare institutions from around the country. For further details, please see the position description below.&nbsp;</p><p>The Deadline for applications is July 16, 2021. Applications will be considered on a rolling basis.</p><p><strong>Healthcare Anchor Network (HAN) Background</strong></p><p>HAN is a nationally recognized and growing collaboration of health systems seeking to improve health and wellbeing by addressing economic and racial inequities in the communities they serve by leveraging their institutional assets, such as hiring, procurement, and investment practices—this is referred to as adopting an anchor mission.</p><p>Since 2017, HAN has coordinated the work of the Aligning to Advance Policy (AAP) initiative group, which seeks to identify policies at the local, state, and federal level that help foster healthy communities, ensure a healthy economy, and steward a healthy planet.&nbsp;</p><p><strong>Internship Description:&nbsp;</strong></p><p>Daily activities will primarily support the work the HAN Aligning to Advance Policy (AAP) initiative group. The intern will conduct policy research, analysis, writing, advocacy and communications on social determinants of health issues particularly affordable housing and workforce development. Secondary activities include providing communications work, and administrative and operational support for the AAP work and whole HAN team. The intern will also help the HAN team in advancing objectives through learning and applied experience and will have the opportunity to participate in learning opportunities across the organization. A list of learning areas and opportunities can be found below.</p><p>For more information about the Healthcare Anchor Network, please visit our website (<a>healthcareanchor.network</a>).&nbsp;</p><p>&nbsp;<strong>Learning Objectives and Deliverables:</strong></p><ul><li>Research, analyze, and write policy documents on social determinants of health issues.</li><li>Communications with and coordination of HAN members regarding the work related to the AAP initiative group.</li><li>Policy discussions, conference calls, and meetings with health system staff or other relevant stakeholders related to the AAP initiative group’s work.</li><li>Government relations work.</li><li>Events associated with advancing policy ideas.</li><li>Assist with HAN communications.</li><li>Administrative and operational support for the AAP work, including Policy Day, as well as the HAN team’s work as needed.</li></ul><p><strong>Required Qualifications:</strong></p><ul><li>Demonstrated interest in community economic development, health equity, economic democracy, and/or other social justice issues.</li><li>Experience with public policy research and writing.</li><li>Holding or pursuing a bachelor’s degree in political science, public affairs, economics, public health, social sciences, or another related field.</li></ul><p><strong>Desired Qualifications:</strong></p><ul><li>Experience with government relations.</li><li>Familiarity with coordinating and maintaining coalitions or networks is a plus.</li><li>Familiarity with health or the social determinants of health issues is a plus.</li></ul><p>The internship will last 4 months at a minimum, with a start date in early September 2021 (with some flexibility to accommodate semester schedules and holiday breaks). Preference will be given to candidates who are graduate students or who can commit to continuing the internship through the spring 2022 semester. The internship requires an ability to commit to 15-20 hours/week, and while we will work with the intern to set the days and times of work, these should be consistent week to week. Interns will need to have their own working computer and internet connection. The position will receive a $15 hourly stipend. Applications will be considered on a rolling basis until the position is filled.</p><p><strong>If interested,</strong>&nbsp;please send a resume, cover letter, and a 1-4 page writing sample* to The Democracy Collaborative at&nbsp;<a href=\"mailto:jobs@democracycollaborative.org\">jobs@democracycollaborative.org</a>. Please include </p><p>“Policy Internship, Healthcare Anchor Network” in the subject line.</p><p><em>*You may shorten longer writing samples for this purpose</em></p><p>&nbsp;</p><p><em>The Democracy Collaborative Foundation provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. We are committed to a diverse and inclusive workplace.</em></p><p><em>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em></p>"
    },
    {
        "position": "Policy Research Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T08:25:26.789Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/13b37a0f212c4212b190be2ae7ecb841-policy-research-intern-highstead-foundation-redding",
        "lastScraped": "2021-07-08T08:25:26.789Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation Policy Research Intern will work with Highstead’s Conservationists and staff to advance conservation in the region by bringing their writing, research, and communication skills to our Conservation Finance program. Interested candidates can expect to conduct research and policy analyses, assist with the writing and editing of conservation finance reports and communications materials, and collaborate with various Highstead partners and networks.</p><p>A major focus for this position will be leading the research and development of a series of articles exploring the current and emerging policy initiatives on climate finance in the U.S. The intern will work to produce materials that communicate the link between federal policy and finance for conservation to better understand and forecast trends in conservation finance.</p><p><u>Qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work to a variety of audiences through presentations, meetings, and online formats.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to synthesize information - strong analytical skills, and experience collecting, interpreting, and organizing data.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;Must be computer literate and proficient in Excel.</p><p>The Highstead Conservation Internship Program is also recruiting a GIS intern and a Conservation Communications and Events Intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "Conservation GIS Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T08:25:28.967Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/7ab0cc3a12304decbbacad92dbd74e0d-conservation-gis-intern-highstead-foundation-redding",
        "lastScraped": "2021-07-08T08:25:28.967Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation GIS Intern will work with Highstead’s Conservationists to advance conservation in the region by bringing their writing, researching, and mapping skills to our conservation programs. Interns will work on mapping projects across two or more of the following initiatives. Some examples include:</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://highstead.net/what-we-do/we-collaborate/northeast-bird-habitat-conservation-initiative?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Northeast Bird Habitat Conservation Initiative</strong></a><strong>- </strong>Assist RCPs and Audubon chapters in the production of mapping projects and analyses to support landscape-scale bird habitat conservation in the northeast.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://h2hrcp.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Hudson to Housatonic Regional Conservation Partnership (H2H)-</strong></a><strong> </strong>Support activities related to land protection planning and community engagement, including mapping urban assets and conservation values within the H2H region.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Northern Appalachian Trail Landscape Partnership- </strong>Support a developing partnership of organizations working in the landscape surrounding the Appalachian Trail corridor with various activities including mapping to support fundraising, partner outreach, and administration.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Provide GIS Support to new RCPs</strong>- Produce GIS maps to help new RCPs across New England identify their partnership’s boundaries and priority landscapes.<strong>&nbsp;</strong></p><p>Qualifications:</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficient in use of ESRI products such as ArcMap, ArcCatalog, and ArcGIS Online, to collect, analyze, and manipulate data, and create maps.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of cartographic principles for professional map layout and design.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Working knowledge of data availability and sources.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work and complex analyses to a variety of audiences through written materials, presentations, and at meetings.</p><p>The Highstead Conservation Internship Program is also recruiting a Conservation Communications and Events intern, and a Conservation Policy Research intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "Conservation Communications and Events Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T08:25:31.280Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/c67e720aa0bb4850a4a2ae1f2cb86761-conservation-communications-and-events-intern-highstead-foundation-redding",
        "lastScraped": "2021-07-08T08:25:31.280Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation Communications and Events Intern will work with Highstead’s Conservationists and staff to advance conservation in the region by bringing their event planning, writing, research, and communication skills to our conservation programs. A major focus for this position will be the support, organization, and administration of the virtual <a href=\"https://www.wildlandsandwoodlands.org/rcp-network-gatherings?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Regional Conservation Partnership (RCP) Network Gathering</strong></a><strong> Program, </strong>a multi-day training, and conference for over 300 regional conservation practitioners. The Communication and Events Intern will also work on two or more of the following projects:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Wildlands &amp; Woodlands Initiative (W&amp;WI) and RCP Network Communications:</strong> Work with communications and conservation staff to develop content for e-newsletters, social media, and websites in support of W&amp;WI and the RCP Network.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>RCP Spotlight Story Series- </strong>Develop a series of stories on the activities of specific RCPs that align with the steps to RCP success as outlined in the RCP Handbook. These stories, to be posted on various websites, social media platforms, and e-news editions, will help illustrate best practices.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Northeast Forest Network- </strong>Assist the steering committee with the development and launch of their communication assets and toolkits and in the development of a regional coordinated communication network designed to increase resources for forest conservation across the Northeast.</p><p><u>Qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Must be proficient in Microsoft Suite, specifically Excel and Publisher. Knowledge of WordPress is a plus.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Firm grasp of available tools and platforms in the social media space and experience creating and posting content in support of organizational goals.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work to a variety of audiences through email, presentations, meetings, and in online formats.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience with event planning and implementation.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to synthesize information - strong analytical skills, and experience collecting, interpreting, and organizing data.</p><p>The Highstead Conservation Internship Program is also recruiting a GIS intern and a Conservation Policy Research intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "Communications & Outreach Intern (m/f/d)",
        "company": "Democracy Reporting International",
        "location": {
            "city": "Berlin",
            "state": "Berlin"
        },
        "posted": "2021-06-22T08:25:33.905Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/f9af888bcdd2411d971ddaa7485f45f5-communications-outreach-intern-mfd-democracy-reporting-international-berlin",
        "lastScraped": "2021-07-08T08:25:33.905Z",
        "description": "<p><strong>Form of Employment:</strong>&nbsp;Full-time</p><p><strong>Starting Date:</strong>&nbsp;As soon as possible</p><p><strong>Duration:</strong>&nbsp;Three Months</p><p><strong>Location:</strong>&nbsp;Berlin</p><p><strong>Background:</strong></p><p>Democracy Reporting International (DRI) is a non-partisan, independent, not-for-profit organisation registered in Berlin. Democracy Reporting International promotes political participation of citizens, accountability of state bodies and the development of democratic institutions world-wide.</p><p>DRI is recruiting a&nbsp;<strong>Communications &amp; Outreach Intern</strong>&nbsp;for its Berlin headquarters to support our communications and outreach efforts, with a focus on the organisation’s messaging and&nbsp;digital presence.</p><p><strong>You Tasks</strong></p><ul><li>Working under the supervision of DRI’s Communications Coordinator and in close collaboration with DRI’s Fundraising Focal Point, you will assist the communications section with communication and public outreach efforts across the organisation;</li><li>Assist in drafting and reviewing programmatic factsheets and capacity statements based on information provided by colleagues, support the effective usage of communication products to inform donors about DRI’s strategies and work;</li><li>Assist in developing design, multimedia products, change stories and content for digital platforms including the DRI website, Twitter, Facebook, and LinkedIn;</li><li>Support donor cultivation and retention, including the development and implementation of strategies for engaging donors;</li><li>Assist with monitoring media to determine trends and to inform communications and outreach efforts;</li><li>Proactively contribute ideas for projects and stories that will help to promote communications and build narrative on DRI’s work;</li><li>Perform other related tasks as required.</li></ul><p><strong>Your skills and experience</strong></p><p>Required:</p><ul><li>Ongoing studies in political science, international affairs, social sciences, design, journalism, communications or related fields;</li><li>Demonstrated relevant work experience;</li><li>Proficiency in key computer applications, such as Microsoft Word, Outlook, PowerPoint and Excel;</li><li>Diligence, eye for detail, pro-active attitude and strong willingness to learn and engage with different stakeholders in an international environment;</li><li>Excellent English writing and communication skills;</li><li><strong>Student status</strong>; you must be enrolled in university throughout the duration of the internship;</li><li><strong>Working permit for Germany</strong>&nbsp;(if you are a foreign student).</li></ul><p>Preferred:</p><ul><li>Experience</li><li>Familiarity with design software such as Adobe Photoshop, Illustrator, InDesign, or with infographic-making tools. Experience working with website Content Management Systems such as WordPress or Drupal;</li><li>Experience writing content that was subsequently published;</li><li>Previous experience working with an NGO or non-profit organisation.</li></ul>"
    },
    {
        "position": "Fall 2021 Council on Foreign Relations Internship Program (Remote)",
        "company": "Council on Foreign Relations",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-24T08:25:35.309Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/ca0201f70cf444b0946090c69d296656-fall-2021-council-on-foreign-relations-internship-program-remote-council-on-foreign-relations-washington",
        "lastScraped": "2021-07-08T08:25:35.309Z",
        "description": "<p>In an ever-changing world, CFR’s work as a leading nonpartisan resource for information and ideas about foreign policy is more important than ever. At CFR, interns do work that matters alongside smart and dedicated staff in a diverse and inclusive environment. Interns are paid a competitive hourly wage while gaining valuable experience through exposure to leading foreign policy experts. They are also offered professional development training as a foundation for future work in the field of foreign policy and international affairs. Internship opportunities are offered through the Blavatnik Internship Program and Robina Franklin Williams Internship Program.</p><p>Interns are recruited year-round on a semester basis for positions in CFR’s New York and Washington, DC, offices. An intern’s duties generally consist of research, editing and writing, event coordination, and/or departmental support. Internships are offered in Digital Content, the Studies Program, Global Communications, Corporate Program, Washington Program, Meetings Program and many more, including&nbsp;Foreign Affairs.</p><p>Interns participate in CFR’s Intern Professional Development program, which complements their substantive work with a series of skill-based workshops, training, and career advice sessions. These events are designed to improve interns’ writing, editing, research, and program planning skills, while also helping to sharpen interns’ resumes and familiarize them with the multitude of foreign policy career paths and beyond.</p><p>CFR generally considers undergraduate and graduate students with majors in international relations, political science, economics, or a related field for its Internship Program. All applicants should&nbsp;have completed the equivalent of four semesters of college coursework (not including AP classes in high school) by the time they begin an internship.&nbsp;A regional specialization, language skills, and additional requirements may also be needed for some internships. In addition to meeting the intellectual requirements, applicants should have excellent skills in administration, writing, research, and computers, as well as previous office experience. Interns must also be willing to commit to fourteen to eighteen hours per week.</p><p><strong>All fall 2021 internships will be on a fully remote/virtual basis.</strong></p><p><strong>To apply, visit this link: https://www.cfr.org/career-opportunities/internships</strong></p><p><strong>CFR has rolling applications.</strong></p><p><strong>Interns are paid a competitive hourly wage.</strong></p><p>Since this is a paid opportunity, interns must have the legal right to work for any employer in the United States.&nbsp;</p>"
    },
    {
        "position": "Healthcare Anchor Network Research Intern",
        "company": "Democracy Collaborative",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-23T08:25:37.809Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/38cbd0de3552419e9e0346a2fcf234a0-healthcare-anchor-network-research-intern-democracy-collaborative-washington",
        "lastScraped": "2021-07-08T08:25:37.809Z",
        "description": "<p>The Democracy Collaborative (TDC) is hiring for a remote, part-time (up to 20 hours per week), paid intern position to support the work of the Healthcare Anchor Network (HAN). The internship will focus mainly on content development and applied research in service of HAN’s hiring, purchasing, and community engagement efforts. The intern will work directly with the Healthcare Anchor Network team and will have the opportunity to participate in conference calls and webinars with mid- and senior-level management from healthcare institutions across the country. The intern’s direct report will be the HAN Director of Communications and Policy and will work directly with the HAN Project Manager for Initiatives &amp; Advisory Services and Project Manager for Initiatives &amp; Member Engagement. For further details, please see the position description below.&nbsp;</p><p>The Deadline for applications is July 16, 2021. Applications will be considered on a rolling basis.</p><p><strong>Required Qualifications:</strong></p><ul><li>Availability to work at least 15 hours per week;</li><li>Strong written and oral communication skills;</li><li>Ability to work independently and collaboratively;</li><li>Familiarity with Microsoft Office Suite and Google, Slack and Salesforce a plus;&nbsp;</li><li>Demonstrated interest in community economic development, health equity, economic democracy, and/or other social justice issues; and</li><li>Holding or pursuing a bachelor’s degree in public affairs, economics, finance, business administration, public health, social sciences, or other related field.</li></ul><p><strong>Healthcare Anchor Network (HAN) Background</strong></p><p>HAN is a nationally recognized and growing collaboration of health systems seeking to improve health and wellbeing by addressing economic and racial inequities in the communities they serve by leveraging their institutional assets, such as hiring, procurement, and investment practices–this is referred to as adopting an anchor mission.&nbsp;</p><p><strong>Internship Description:&nbsp;</strong></p><p>Daily tasks will primarily include (roughly 80% of the intern’s time) developing content (case studies, templates and other resources, etc.) and conducting research on behalf of four initiative groups focused around:&nbsp;</p><ul><li>Advancing the organizational imperative for adopting and implementing an anchor mission;</li><li>Implementing anchor strategies around inclusive, local hiring and internal workforce development;&nbsp;</li><li>Implementing anchor strategies around inclusive, local purchasing; and&nbsp;</li><li>Effective collaboration with community stakeholders in implementing anchor strategies.</li></ul><p>Secondary activities (roughly 20% of the intern’s time) will include providing research related to other workstreams as well as administrative and operational support for HAN activities. The intern will play an important role in assisting the HAN project managers in advancing objectives through learning and applied experience. The intern may support other programmatic work of HAN as needs and interest arise. A list of learning objectives and deliverables can be found below.</p><p>For more information about the Healthcare Anchor Network, please visit our website (<a>healthcareanchor.network</a>).&nbsp;</p><p>Learning Objectives and Deliverables:</p><ul><li>Conduct research through the development of case studies, toolkits, templates, and other resources identified by HAN colleagues and members;&nbsp;</li><li>Provide administrative and operational support for HAN activities, including note-taking during initiative group meetings and other virtual engagement activities; and&nbsp;</li><li>Perform communications and outreach to HAN members as needed.</li></ul><p><strong>Desired Qualifications:</strong></p><ul><li>Familiarity with coordinating and maintaining coalitions or networks is a plus</li><li>Familiarity with social determinants of health issues is a plus</li></ul><p>The internship will last 4 months during the fall with a potential for extension through the spring and possibly summer of 2022, with a start date in early September (with some flexibility to accommodate semester schedules). The internship requires an ability to commit to 15-20 hours/week, and while we will work with the intern to set the days and times of work, these should be consistent week to week. Interns will need to have their own working computer and internet connection. The position will receive a $15 hourly stipend. Applications will be considered on a rolling basis until the position is filled.</p><p><strong>If interested,</strong>&nbsp;please send a resume, cover letter, and a 1-4 page writing sample* to The Democracy Collaborative at&nbsp;<a href=\"mailto:jobs@democracycollaborative.org\">jobs@democracycollaborative.org</a>. Please include  “Healthcare Anchor Network Research Internship” in the subject line.</p><p><em>*You may shorten longer writing samples for this purpose</em></p><p>&nbsp;</p><p><em>The Democracy Collaborative Foundation provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. We are committed to a diverse and inclusive workplace.</em></p><p><em>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em></p>"
    },
    {
        "position": "Fall 2021 Council on Foreign Relations Internship Program (Remote)",
        "company": "Council on Foreign Relations",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-06-24T08:25:40.210Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/aee7e17f507b4921a81c9f609cdb1fe5-fall-2021-council-on-foreign-relations-internship-program-remote-council-on-foreign-relations-new-york",
        "lastScraped": "2021-07-08T08:25:40.210Z",
        "description": "<p>Interns are recruited year-round on a semester basis for positions in CFR’s New York and Washington, DC, offices. An intern’s duties generally consist of research, editing and writing, event coordination, and/or departmental support. Internships are offered in Digital Content, the Studies Program, Global Communications, Corporate Program, Washington Program, Meetings Program and many more, including&nbsp;Foreign Affairs.</p><p>Interns participate in CFR’s Intern Professional Development program, which complements their substantive work with a series of skill-based workshops, training, and career advice sessions. These events are designed to improve interns’ writing, editing, research, and program planning skills, while also helping to sharpen interns’ resumes and familiarize them with the multitude of foreign policy career paths and beyond.</p><p>CFR generally considers undergraduate and graduate students with majors in international relations, political science, economics, or a related field for its Internship Program. All applicants should&nbsp;have completed the equivalent of four semesters of college coursework (not including AP classes in high school) by the time they begin an internship.&nbsp;A regional specialization, language skills, and additional requirements may also be needed for some internships. In addition to meeting the intellectual requirements, applicants should have excellent skills in administration, writing, research, and computers, as well as previous office experience. Interns must also be willing to commit to fourteen to eighteen hours per week.</p><p><strong>All fall 2021 internships will be on a fully remote/virtual basis.</strong></p><p><strong>To apply, visit this link: https://www.cfr.org/career-opportunities/internships</strong></p><p><strong>CFR has rolling applications.</strong></p>"
    }
]