[
    {
        "position": "Paid Internship - GIS & Land-Use Planning",
        "company": "SWALE Inc.",
        "location": {
            "city": "Grass Valley",
            "state": "CA"
        },
        "posted": "2021-06-10T06:47:30.854Z",
        "url": "https://www.idealist.org/en/consultant-internship/ab510ddc491848ecbf6fe29aff09a249-paid-internship-gis-land-use-planning-swale-inc-grass-valley",
        "lastScraped": "2021-06-21T06:47:30.855Z",
        "description": "<p>Position Open:   Paid Internship for Recent College Graduate</p><p><strong>Remote Position in California, </strong>United States </p><p>Ad Date:&nbsp; June 8, 2021   Applications are due by June 15, 2021</p><p>Consulting firm is seeking an intern to work on a part-time and temporary (i.e. short-term) basis. &nbsp;&nbsp;</p><p><u>Training</u>:&nbsp; The Intern will receive training in the following areas:</p><p>§&nbsp; Initial onboarding onto firm’s project management software</p><p>§&nbsp; Initial onboarding onto firm’s payroll software</p><p>§&nbsp; Brief training in how to use performance measures</p><p>§&nbsp; Brief training regarding how local government agencies function</p><p>§&nbsp; Brief training in land-use and water issues for a county in California</p><p><u>Timeline</u>:&nbsp; This internship will occur over a four-week time period at 28 hours per week (part-time basis).&nbsp;  This assignment begins in June 2021 and lasts for 4 weeks.&nbsp; This is a temporary position which will end after the 4-week term.&nbsp; There is no funding to permit continuation beyond the 4-week timeframe. &nbsp;This is a micro-internship. </p><p><u>Workday Schedule</u>:&nbsp; Although this internship can be completed remotely, interns are expected to fully attend and participate in on-line office hours conducted via on-line video chat tool (similar to Zoom).&nbsp; Attendance in daily on-line video call office hours are mandatory and will be collaborative and supervised.&nbsp; Office hours are Monday through Thursday from 8:00 a.m. to 3:30 p.m.&nbsp; </p><p><u>Qualifications</u>:&nbsp; The ideal candidate will have the following:</p><ul><li>Ability to work as part of a team on a  specific project.</li><li>Recent graduation from a university with   a B.A. or B.S. degree in geography, environmental science, public  administration, or land-use planning.&nbsp;  A 4<sup>th</sup> year or 5<sup>th</sup> year Senior student status  is also acceptable.</li><li>Familiarity with planning and social   issues facing California, including climate change and disadvantaged  communities.&nbsp; </li><li>Solid English writing skills. </li><li>Enjoys working with numbers and have  solid basic math and statistics skills.</li><li>Ability to utilize the internet and on-line tools such as email and dropbox etc.</li><li>Excellent computer skills including knowledge of: 1] Microsoft Office products such as Word, Excel, and PowerPoint; (or  related google docs) and 2] geographic information systems (GIS).&nbsp; &nbsp;</li></ul><p>§&nbsp; Able to provide their own desk, office supplies, telephone with service, and a computer.</p><p>§&nbsp; Intern is also required to have an active email address and a good internet connection.</p><p><u>Duties</u>:&nbsp; Interns will author a portion of a planning report on local government agency in a California county.&nbsp; Topics include land-use, population, and municipal services. Interns will utilize data from district plans and financial reports, on-line databases, and data from other government agencies. &nbsp;Geographic Information Systems (GIS) is an important tool to use for this project.&nbsp; Applicants must demonstrate they have taken at least one GIS class in college. </p><p>Other duties may include: participation in collaborative reading activities, creation of PowerPoint presentations, the provision of assistance with marketing by writing a blog post, and other related activities.</p><p><u>Professional Details</u>:&nbsp; The intern will gain exciting real-world environmental planning experience at an active small consulting firm.&nbsp; We hope the intern will gain the following: </p><p>o&nbsp;&nbsp; Mentoring with a seasoned professional land-use planner.</p><p>o&nbsp;&nbsp; Hands-on learning experience working on a complex, important issue at the crossroads of planning, water resources, water quality, and climate change.&nbsp; </p><p>o&nbsp;&nbsp; A solid understanding about how local government agencies actually work and function.</p><p>o&nbsp;&nbsp; A letter of recommendation to aid the intern in their future job searches.</p><p>o&nbsp;&nbsp; At the end of the internship, the intern will have a professional real-world writing sample and maps to add to their portfolio and to share with future prospective employers.&nbsp;  </p><p><u>Position Details</u>:&nbsp; Part-time,&nbsp;Temporary Employee.&nbsp; Hourly pay rate is minimum wage approximately $13.00/hour. Additionally, employer will reimburse intern’s costs associated with computer, phone, desk, and internet connection at a combined rate of $1.00 per hour.&nbsp; Intern will be paid weekly.&nbsp; There are no insurance benefits or other benefits provided with this internship.&nbsp; </p><p><br></p><p><br></p>"
    },
    {
        "position": "Advancement Internship",
        "company": "Society for Science & the Public",
        "location": {
            "city": "Washington",
            "state": "DC"
        },
        "posted": "2021-06-17T06:47:33.269Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/226290e750544f779bad2d9549acf9f5-advancement-internship-society-for-science-the-public-washington",
        "lastScraped": "2021-06-21T06:47:33.269Z",
        "description": "<p>The Advancement Intern works with a vibrant fundraising team – encompassing annual giving, corporate and foundation relations, major gifts, and development operations. The intern will help Society for Science  improve our data and communications with alumni, members, and donors, streamline internal processes, plan our approach to corporations and major foundations, and report to donors on the impact of their giving.</p><p>Start date is negotiable. Applicants planning to receive course credit for this internship should provide any necessary information regarding requirements to the Society.</p><h3>Primary Responsibilities:</h3><ul><li>Perform substantive, comprehensive research projects</li><li>Assist with identifying potential major gift or institutional giving prospects via online research and writing brief memos</li><li>Perform data entry and analysis using Blackbaud Raiser’s Edge</li><li>Assist with data integrity of major gift portfolios</li><li>Identify potential sponsors for Science News in High Schools program</li><li>Build logistics and templates for direct marketing plan</li><li>Assist with year-round fundraising campaigns</li><li>Analyze and organize department shared files to maximize efficiency and improve usage</li><li>Proofread various materials including donor letters, proposals, sponsorship documents, etc.</li><li>Assist with general administrative duties</li></ul><h3>Desired Competencies</h3><ul><li>Excellent written and verbal communication skills</li><li>Database experience preferred (Raiser’s Edge, Access, Excel)</li><li>Customer service experience</li><li>Proficiency in Microsoft Office: Word, Excel, PowerPoint, Outlook</li><li>High attention to detail and demonstrated proactive and strategic approach to daily tasks</li><li>Proficiency with Internet searches</li><li>Demonstrated ability to work with others as a team</li><li>Understanding of and affinity for the core values of the Society</li></ul><h3>Work Environment</h3><p>While performing the duties of this job, the employee regularly works in an office&nbsp;setting.<strong>&nbsp;</strong>Our office is located near the Dupont Circle and Farragut North Metro stations. This position usually works in an office setting but will temporarily work from home until at least September 7, 2021 with possible extensions.</p><h3>Physical Demands</h3><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this&nbsp;job, the employee is regularly required to use hands and fingers to operate a computer and other office equipment.</p><h3>Position Type and Expected Hours</h3><p>This is a part-time internship with a term of 3-6 months. The Advancement Intern will work 15-35 hours per week and will be paid a rate of $15 per hour. Days and hours of work are Monday through Friday during&nbsp;normal office hours of the Society.</p><h3>Required Education and Experience</h3><p>Interns must be current undergraduate or graduate students. Preference is given to students who are considering careers at educational institutions or non-profits and/or have an interest in fundraising, membership, institutional giving, alumni relations, communications, advancement, or audience development.</p><h3>How to Apply</h3><p>Send your resume and cover letter to&nbsp;<a href=\"mailto:career@societyforscience.org\">career@societyforscience.org</a>. Emails should include “<strong>Advancement Intern</strong>” in the subject line. They can be addressed to Bruce Makous, Chief Advancement Officer. No phone calls please.</p><h3>EEO Statement</h3><p>The Society is an Equal Employment Opportunity Employer.</p><p>Society for Science is committed to equal employment opportunity. In order to provide equal employment and advancement opportunities to all individuals, the Society does not discriminate against employees or applicants for employment on any legally recognized basis, including but not limited to: veteran status, race, color, religion, gender, marital status, sexual orientation, gender identity or expression, ancestry, national origin, disability, personal appearance, family responsibilities, matriculation, political affiliation, age and/or any other categories protected by the laws of the United States or the District of&nbsp;Columbia.</p><h3>Other Duties</h3><p>Please note this job description is not designed to cover every duty, responsibility and activity that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.</p>"
    },
    {
        "position": "Policy Research Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T06:47:35.382Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/13b37a0f212c4212b190be2ae7ecb841-policy-research-intern-highstead-foundation-redding",
        "lastScraped": "2021-06-21T06:47:35.382Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation Policy Research Intern will work with Highstead’s Conservationists and staff to advance conservation in the region by bringing their writing, research, and communication skills to our Conservation Finance program. Interested candidates can expect to conduct research and policy analyses, assist with the writing and editing of conservation finance reports and communications materials, and collaborate with various Highstead partners and networks.</p><p>A major focus for this position will be leading the research and development of a series of articles exploring the current and emerging policy initiatives on climate finance in the U.S. The intern will work to produce materials that communicate the link between federal policy and finance for conservation to better understand and forecast trends in conservation finance.</p><p><u>Qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work to a variety of audiences through presentations, meetings, and online formats.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to synthesize information - strong analytical skills, and experience collecting, interpreting, and organizing data.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;Must be computer literate and proficient in Excel.</p><p>The Highstead Conservation Internship Program is also recruiting a GIS intern and a Conservation Communications and Events Intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "Conservation GIS Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T06:47:38.581Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/7ab0cc3a12304decbbacad92dbd74e0d-conservation-gis-intern-highstead-foundation-redding",
        "lastScraped": "2021-06-21T06:47:38.581Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation GIS Intern will work with Highstead’s Conservationists to advance conservation in the region by bringing their writing, researching, and mapping skills to our conservation programs. Interns will work on mapping projects across two or more of the following initiatives. Some examples include:</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://highstead.net/what-we-do/we-collaborate/northeast-bird-habitat-conservation-initiative?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Northeast Bird Habitat Conservation Initiative</strong></a><strong>- </strong>Assist RCPs and Audubon chapters in the production of mapping projects and analyses to support landscape-scale bird habitat conservation in the northeast.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://h2hrcp.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Hudson to Housatonic Regional Conservation Partnership (H2H)-</strong></a><strong> </strong>Support activities related to land protection planning and community engagement, including mapping urban assets and conservation values within the H2H region.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Northern Appalachian Trail Landscape Partnership- </strong>Support a developing partnership of organizations working in the landscape surrounding the Appalachian Trail corridor with various activities including mapping to support fundraising, partner outreach, and administration.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Provide GIS Support to new RCPs</strong>- Produce GIS maps to help new RCPs across New England identify their partnership’s boundaries and priority landscapes.<strong>&nbsp;</strong></p><p>Qualifications:</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficient in use of ESRI products such as ArcMap, ArcCatalog, and ArcGIS Online, to collect, analyze, and manipulate data, and create maps.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of cartographic principles for professional map layout and design.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Working knowledge of data availability and sources.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work and complex analyses to a variety of audiences through written materials, presentations, and at meetings.</p><p>The Highstead Conservation Internship Program is also recruiting a Conservation Communications and Events intern, and a Conservation Policy Research intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "Conservation Communications and Events Intern",
        "company": "Highstead Foundation",
        "location": {
            "city": "Redding",
            "state": "CT"
        },
        "posted": "2021-06-15T06:47:40.266Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/c67e720aa0bb4850a4a2ae1f2cb86761-conservation-communications-and-events-intern-highstead-foundation-redding",
        "lastScraped": "2021-06-21T06:47:40.266Z",
        "description": "<p>Looking for an opportunity to gain real-world conservation experience? Highstead Foundation is currently recruiting for a remote Conservation Intern for the fall 2021 Semester. Applications must be submitted by July 17, 2021. The Conservation Intern will support Highstead’s Conservation Program for a twelve-week period from September 20, 2021, to December 10, 2021. The <strong>intern will work remotely during the entirety of the internship.</strong></p><p>Highstead is a regional non-profit conservation organization dedicated to working with regional partners and the best available science to conserve the New England landscape towards the <a href=\"https://www.wildlandsandwoodlands.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">Wildlands and Woodlands</a> vision. Its principal conservation programs include catalyzing the land protection activities through Regional Conservation Partnerships, conservation finance, ecological research, policy analysis, and land stewardship.</p><p><u>The applicant should:</u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Be a recent graduate of a Bachelor’s or Master’s degree program.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have a demonstrated interest in conservation science or natural resources management.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrate a collaborative spirit that enjoys both independent and group work.</p><p><u>Additional qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent written and verbal communication skills.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to effectively manage multiple projects and adhere to deadlines.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience conducting research.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Access to a computer with a reliable network connection and a webcam.</p><p><u>Overview: </u></p><p>The Conservation Communications and Events Intern will work with Highstead’s Conservationists and staff to advance conservation in the region by bringing their event planning, writing, research, and communication skills to our conservation programs. A major focus for this position will be the support, organization, and administration of the virtual <a href=\"https://www.wildlandsandwoodlands.org/rcp-network-gatherings?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Regional Conservation Partnership (RCP) Network Gathering</strong></a><strong> Program, </strong>a multi-day training, and conference for over 300 regional conservation practitioners. The Communication and Events Intern will also work on two or more of the following projects:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Wildlands &amp; Woodlands Initiative (W&amp;WI) and RCP Network Communications:</strong> Work with communications and conservation staff to develop content for e-newsletters, social media, and websites in support of W&amp;WI and the RCP Network.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>RCP Spotlight Story Series- </strong>Develop a series of stories on the activities of specific RCPs that align with the steps to RCP success as outlined in the RCP Handbook. These stories, to be posted on various websites, social media platforms, and e-news editions, will help illustrate best practices.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Northeast Forest Network- </strong>Assist the steering committee with the development and launch of their communication assets and toolkits and in the development of a regional coordinated communication network designed to increase resources for forest conservation across the Northeast.</p><p><u>Qualifications: </u></p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Must be proficient in Microsoft Suite, specifically Excel and Publisher. Knowledge of WordPress is a plus.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Firm grasp of available tools and platforms in the social media space and experience creating and posting content in support of organizational goals.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent and effective verbal and written communication skills and ability to convey work to a variety of audiences through email, presentations, meetings, and in online formats.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience with event planning and implementation.</p><p>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to synthesize information - strong analytical skills, and experience collecting, interpreting, and organizing data.</p><p>The Highstead Conservation Internship Program is also recruiting a GIS intern and a Conservation Policy Research intern. For more details <a href=\"https://highstead.net/wp-content/uploads/2021/06/Conservation-Internship-Announcement-2021-1.pdf?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">click here</a>.&nbsp;</p>"
    },
    {
        "position": "MEDICINE AND HEALTHCARE EXPERIENCE & OBSERVATION",
        "company": "Aldeas de Paz - Peace Villages",
        "location": {
            "city": "Santa Barbara de Samaná",
            "state": "Dominican Republic"
        },
        "posted": "2021-06-19T06:47:43.143Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/068102a83d414e9ba11b40f39cf6297d-medicine-and-healthcare-experience-observation-aldeas-de-paz-peace-villages-santa-barbara-de-samana",
        "lastScraped": "2021-06-21T06:47:43.143Z",
        "description": "<h2><strong>MEDICINE AND HEALTHCARE EXPERIENCE &amp; OBSERVATION - Work side by side with medical staff at the local hospital</strong></h2><p><strong>Gain invaluable hands-on experience, working side by side with medical staff and fellow volunteers at a hospital or a neighborhood health clinic.</strong> This opportunity will give you an insight into the running and daily routine of a hospital or a neighborhood health clinic. You will experience the stark contrast between Western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing, there are many challenges faced and as a result you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage. Therefore this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country.</p><p>Furthermore, you can gain experience in a range of different departments and activities within the hospital/health clinic, such as: emergency, pediatric, maternity (only female volunteers), diabetes, integral attention &amp; prevention for HIV, tuberculosis and uterine cancer as well as nursing, hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the hospital pharmacy. You are welcome to also work on our other projects such as the English and computer literacy classes for locals.</p><p>This opportunity will give you an insight into the day to day running of a hospital or clinic. You will experience the stark contrast between western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing there are many challenges faced and there are realities not often seen in developed countries. Therefore, this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country where you will be faced with the stark realities of the disparities between medical practice in the developed and developing world. This means that, sadly, you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage uncommon in developed countries. Furthermore, you can gain experience in a range of different departments and activities within the hospital, such as: Emergency, Pediatry, Maternity (only female volunteers), Diabetes and Integral Attention &amp; Prevention for HIV, Tuberculosis and Uterine Cancer as well as Nursing, Hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the pharmacy.</p><p>Your level of possible involvement will largely depend on your Spanish language skills and experiences in the field, as well as your motivation and willingness to get involved. It will also depend on the current needs and tasks at the hospital as we really want to help out wherever our help is needed most. Your work schedule will be created in a meeting with the departmental director and the volunteer coordinator and supervisor. In this process we always try to match your interests and skills with the current situation at the hospital. In order to gain the most out of your experience, and especially if you have a specific health care goal, please contact us in advance to discuss your options in detail. Please keep in mind that hospitalized patient care in the Dominican Republic is much less extensive compared to nursery practices in the western world! It is common to see that family members are expected to take care of their patient at the hospital.&nbsp;</p><p><strong>What to expect</strong></p><p>You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs.</p><p><strong>Activities can include but are not limited to&nbsp;</strong></p><ul><li>Observing, shadowing and assisting doctors and nurses during their work</li><li>Participating in patient care: comforting patients and assisting with examinations</li><li>Providing ambulance support when needed</li><li>Assisting, teaching and encouraging prevention, hygiene and checkups</li><li>Assisting in developing educational materials and engagement strategies for various prevention programs using multimedia&nbsp;</li><li>Helping regularly with hospital administration tasks and helping improve procedures and workflow</li><li>Some volunteers may also choose to teach English to the doctors, provided that there is a sufficient number of doctors interested</li><li>Foreign medical missions visit and work at the hospital several times a year. You may accompany them and translate for them and the patients</li></ul><p><strong>Requirements&nbsp;</strong></p><p>This program is suitable for pre-medical students and students of pharmaceutics as well as nursing students with free holiday time, pre-university students, students taking or planning to take specialist medical courses such as biomedical science, nursing and physiotherapy as well as professionals. The key requirements for a medical volunteer or intern are initiative, enthusiasm, and readiness to work in unfamiliar circumstances. If volunteers have more specialized skills, this will allow for more specialized activities. Basic conversational Spanish skills are required and the more advanced your level of experience and Spanish language skills, the larger the number of opportunities available. To allow a deeper engagement with your placement we offer free Spanish language lessons every week allowing for an enhanced experience as a volunteer/intern with us. Suggestions on what to bring: Please bring scrubs and easy to clean comfortable closed shoes to wear as they are mandatory</p><p>Please bring scrubs and closed shoes that are easy to clean for working in the hospital, as they are mandatory. Latex gloves, hand sanitizer and face masks (N95 for the TB patients) would be a very helpful donation to the dental clinic.</p><p><strong>Guidelines on medical Issues of the Dominican Republic:</strong></p><ul><li>WHO reportcon health care reform in Dominican Republic, 2010</li><li>Health System of the Dominican Republic, 2011. The website provides an excellent overview of common medical issues in the DR and the government health system. Only available in Spanish.</li></ul><p><strong>Volunteer Placement or Internship </strong></p><p>You can join this program as a volunteer and are free to commit from between 20 to 40 hours per week. Thats up to you! As an intern however you probably have to fulfill requirements set by your school or university. Please inform us of your school or university’s internship requirements in advance so that we can work out your personalized work plan together. Also tell us about your personal expectations and goals and we will see how we can help you achieve them.</p><p><strong>Time Commitment&nbsp;</strong></p><p>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a six to eight week minimum time commitment is encouraged. You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs. Spanish speakers will get the most out of the rotation. Friendly and welcoming physicians, nurses, and patients make this rotation a joy to be a part of! You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Availability </strong>this program is ongoing throughout the whole year</p><p><strong>Placement Locations</strong>: Hospital and neighbourhood health clinics in Samana, La Pascuala and Las Terrenas</p><p><strong>Time Commitment </strong>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a 6 to 8 week minimum time commitment is encouraged. You can join this program throughout the whole year.&nbsp;You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Financial Contribution &amp; Benefits&nbsp;</strong></p><p>Aldeas de Paz works hard to keep the required financial contribution to an absolute minimum and to offer financial transparency by practicing an open book policy. The calculation of your financial contribution or donation is set up so that the longer you stay the less you give per week. We do this to encourage longer stays, recognizing that longer stays lead to more significant volunteer work and more energy contributed in the form of donated time in place of money! The minimum contribution starts at €175 per week and includes Spanish language classes, double room at one of our fully equipped guesthouse apartments, a special program donation as well as a personal welcome service and pick-up at the airport, transfer to the bus, bus fare and free transfer to your placement location in Las Terrenas or Samana. If you wish a single room upgrade add €50 per week and an all in Host Family homestay upgrade is €150 per week, including a private bedroom and two meals per day. For more information about costs and benefits check out our <a href=\"http://www.peacevillages.org/fee?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">webpage</a>.</p><p><strong>What is included</strong></p><ul><li>Welcome Service at the airport and transport to your placement location&nbsp;</li><li>Volunteer or Internship placement</li><li>Accommodation of your choice</li><li>Placement introduction, training, supervision, briefings and meetings</li><li>Free regular Spanish lessons throughout your placement&nbsp;</li><li>Free Wifi and use of washing machine at all our facilities&nbsp;</li><li>Certificate, written reference and student credit</li><li>Information about adventure packages</li><li>Full support and 24/7 backup from local staff</li></ul><p><strong>Special Offer&nbsp;</strong></p><p><strong>Spanish language classes</strong>: Volunteers and interns receive free language lessons every week. The classes focus on developing communication skills so that students are able to put their knowledge to practical use as soon as they step outside the classroom. Our teaching method enables students to develop four basic skills: listening comprehension, speaking, reading and writing. The idea is to learn Spanish in a natural and spontaneous way, just as students have learned their mother tongue. Our students are encouraged to speak Spanish right from the very first day, using it in typical real-life situations: the basic syllabus is supplemented by special exercises, such as role-play, situational dialogues and work projects. Outside the classroom, the learning process continues as you are immersed in the Spanish language and the Dominican culture.</p><p><strong>Contact Information&nbsp;</strong></p><p>Contact Person: Manfred Mönnighoff</p><p>Project/charity name: Fundación Aldeas de Paz</p><p>Address: Samana, Dominican Republic</p><p>Whatsapp: +1 829 7055 123</p><p>E-Mail: <a href=\"mailto:mail@peacevillages.org\">mail@peacevillages.org</a></p><p>Webpage: <a href=\"https://www.peacevillages.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.peacevillages.org</a></p><p>Facebook: <a href=\"https://www.facebook/AldeasdePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.facebook/AldeasdePaz</a></p><p>Instagram: <a href=\"https://www.instagram.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.instagram.com/AldeasDePaz</a></p><p>Twitter: <a href=\"https://twitter.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://twitter.com/AldeasDePaz</a></p><p>YouTube: <a href=\"http://www.youtube.com/Peacevillages?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">http://www.youtube.com/Peacevillages</a></p>"
    },
    {
        "position": "MEDICINE AND HEALTHCARE EXPERIENCE & OBSERVATION",
        "company": "Aldeas de Paz - Peace Villages",
        "location": {
            "city": "Santa Barbara de Samaná",
            "state": "Dominican Republic"
        },
        "posted": "2021-06-19T06:47:46.508Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/d43b111264084bd3ab00c78a275ba226-medicine-and-healthcare-experience-observation-aldeas-de-paz-peace-villages-santa-barbara-de-samana",
        "lastScraped": "2021-06-21T06:47:46.508Z",
        "description": "<h2><strong>MEDICINE AND HEALTHCARE EXPERIENCE &amp; OBSERVATION - Work side by side with medical staff at the local hospital</strong></h2><p><strong>Gain invaluable hands-on experience, working side by side with medical staff and fellow volunteers at a hospital or a neighborhood health clinic.</strong> This opportunity will give you an insight into the running and daily routine of a hospital or a neighborhood health clinic. You will experience the stark contrast between Western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing, there are many challenges faced and as a result you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage. Therefore this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country.</p><p>Furthermore, you can gain experience in a range of different departments and activities within the hospital/health clinic, such as: emergency, pediatric, maternity (only female volunteers), diabetes, integral attention &amp; prevention for HIV, tuberculosis and uterine cancer as well as nursing, hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the hospital pharmacy. You are welcome to also work on our other projects such as the English and computer literacy classes for locals.</p><p>This opportunity will give you an insight into the day to day running of a hospital or clinic. You will experience the stark contrast between western medical practice and the realities of medicine in developing countries. As the hospitals and clinics are still modernizing there are many challenges faced and there are realities not often seen in developed countries. Therefore, this project not only provides you with responsibility, it also allows you to broaden your perspective by working at a hospital/health clinic in a developing country where you will be faced with the stark realities of the disparities between medical practice in the developed and developing world. This means that, sadly, you will also see medical conditions that have remained untreated and have developed to an advanced pathological stage uncommon in developed countries. Furthermore, you can gain experience in a range of different departments and activities within the hospital, such as: Emergency, Pediatry, Maternity (only female volunteers), Diabetes and Integral Attention &amp; Prevention for HIV, Tuberculosis and Uterine Cancer as well as Nursing, Hospital administration and management assisting with accountancy and helping with statistics. There is also the possibility to work in the pharmacy.</p><p>Your level of possible involvement will largely depend on your Spanish language skills and experiences in the field, as well as your motivation and willingness to get involved. It will also depend on the current needs and tasks at the hospital as we really want to help out wherever our help is needed most. Your work schedule will be created in a meeting with the departmental director and the volunteer coordinator and supervisor. In this process we always try to match your interests and skills with the current situation at the hospital. In order to gain the most out of your experience, and especially if you have a specific health care goal, please contact us in advance to discuss your options in detail. Please keep in mind that hospitalized patient care in the Dominican Republic is much less extensive compared to nursery practices in the western world! It is common to see that family members are expected to take care of their patient at the hospital.&nbsp;</p><p><strong>What to expect</strong></p><p>You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs.</p><p><strong>Activities can include but are not limited to&nbsp;</strong></p><ul><li>Observing, shadowing and assisting doctors and nurses during their work</li><li>Participating in patient care: comforting patients and assisting with examinations</li><li>Providing ambulance support when needed</li><li>Assisting, teaching and encouraging prevention, hygiene and checkups</li><li>Assisting in developing educational materials and engagement strategies for various prevention programs using multimedia&nbsp;</li><li>Helping regularly with hospital administration tasks and helping improve procedures and workflow</li><li>Some volunteers may also choose to teach English to the doctors, provided that there is a sufficient number of doctors interested</li><li>Foreign medical missions visit and work at the hospital several times a year. You may accompany them and translate for them and the patients</li></ul><p><strong>Requirements&nbsp;</strong></p><p>This program is suitable for pre-medical students and students of pharmaceutics as well as nursing students with free holiday time, pre-university students, students taking or planning to take specialist medical courses such as biomedical science, nursing and physiotherapy as well as professionals. The key requirements for a medical volunteer or intern are initiative, enthusiasm, and readiness to work in unfamiliar circumstances. If volunteers have more specialized skills, this will allow for more specialized activities. Basic conversational Spanish skills are required and the more advanced your level of experience and Spanish language skills, the larger the number of opportunities available. To allow a deeper engagement with your placement we offer free Spanish language lessons every week allowing for an enhanced experience as a volunteer/intern with us. Suggestions on what to bring: Please bring scrubs and easy to clean comfortable closed shoes to wear as they are mandatory</p><p>Please bring scrubs and closed shoes that are easy to clean for working in the hospital, as they are mandatory. Latex gloves, hand sanitizer and face masks (N95 for the TB patients) would be a very helpful donation to the dental clinic.</p><p><strong>Guidelines on medical Issues of the Dominican Republic:</strong></p><ul><li>WHO reportcon health care reform in Dominican Republic, 2010</li><li>Health System of the Dominican Republic, 2011. The website provides an excellent overview of common medical issues in the DR and the government health system. Only available in Spanish.</li></ul><p><strong>Volunteer Placement or Internship </strong></p><p>You can join this program as a volunteer and are free to commit from between 20 to 40 hours per week. Thats up to you! As an intern however you probably have to fulfill requirements set by your school or university. Please inform us of your school or university’s internship requirements in advance so that we can work out your personalized work plan together. Also tell us about your personal expectations and goals and we will see how we can help you achieve them.</p><p><strong>Time Commitment&nbsp;</strong></p><p>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a six to eight week minimum time commitment is encouraged. You can join this program throughout the whole year. Working hours will be primarily in the morning when the physicians are at the hospital/health clinic while in healthcare 24 hour rotations are implemented. As with any medical service, volunteers should recognize that their schedules may be subject to sudden changes and are dictated by patients’ needs. Spanish speakers will get the most out of the rotation. Friendly and welcoming physicians, nurses, and patients make this rotation a joy to be a part of! You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Availability </strong>this program is ongoing throughout the whole year</p><p><strong>Placement Locations</strong>: Hospital and neighbourhood health clinics in Samana, La Pascuala and Las Terrenas</p><p><strong>Time Commitment </strong>A minimum time commitment of 2 weeks is required. For volunteers and interns with little experience, a 6 to 8 week minimum time commitment is encouraged. You can join this program throughout the whole year.&nbsp;You are encouraged to also take part in weekend shifts and watches with doctors and nurses as this gives you excellent exposure to work observation and experience opportunities!</p><p><strong>Financial Contribution &amp; Benefits&nbsp;</strong></p><p>Aldeas de Paz works hard to keep the required financial contribution to an absolute minimum and to offer financial transparency by practicing an open book policy. The calculation of your financial contribution or donation is set up so that the longer you stay the less you give per week. We do this to encourage longer stays, recognizing that longer stays lead to more significant volunteer work and more energy contributed in the form of donated time in place of money! The minimum contribution starts at €175 per week and includes Spanish language classes, double room at one of our fully equipped guesthouse apartments, a special program donation as well as a personal welcome service and pick-up at the airport, transfer to the bus, bus fare and free transfer to your placement location in Las Terrenas or Samana. If you wish a single room upgrade add €50 per week and an all in Host Family homestay upgrade is €150 per week, including a private bedroom and two meals per day. For more information about costs and benefits check out our <a href=\"http://www.peacevillages.org/fee?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">webpage</a>.</p><p><strong>What is included</strong></p><ul><li>Welcome Service at the airport and transport to your placement location&nbsp;</li><li>Volunteer or Internship placement</li><li>Accommodation of your choice</li><li>Placement introduction, training, supervision, briefings and meetings</li><li>Free regular Spanish lessons throughout your placement&nbsp;</li><li>Free Wifi and use of washing machine at all our facilities&nbsp;</li><li>Certificate, written reference and student credit</li><li>Information about adventure packages</li><li>Full support and 24/7 backup from local staff</li></ul><p><strong>Special Offer&nbsp;</strong></p><p><strong>Spanish language classes</strong>: Volunteers and interns receive free language lessons every week. The classes focus on developing communication skills so that students are able to put their knowledge to practical use as soon as they step outside the classroom. Our teaching method enables students to develop four basic skills: listening comprehension, speaking, reading and writing. The idea is to learn Spanish in a natural and spontaneous way, just as students have learned their mother tongue. Our students are encouraged to speak Spanish right from the very first day, using it in typical real-life situations: the basic syllabus is supplemented by special exercises, such as role-play, situational dialogues and work projects. Outside the classroom, the learning process continues as you are immersed in the Spanish language and the Dominican culture.</p><p><strong>Contact Information&nbsp;</strong></p><p>Contact Person: Manfred Mönnighoff</p><p>Project/charity name: Fundación Aldeas de Paz</p><p>Address: Samana, Dominican Republic</p><p>Whatsapp: +1 829 7055 123</p><p>E-Mail: <a href=\"mailto:mail@peacevillages.org\">mail@peacevillages.org</a></p><p>Webpage: <a href=\"https://www.peacevillages.org?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.peacevillages.org</a></p><p>Facebook: <a href=\"https://www.facebook/AldeasdePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.facebook/AldeasdePaz</a></p><p>Instagram: <a href=\"https://www.instagram.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.instagram.com/AldeasDePaz</a></p><p>Twitter: <a href=\"https://twitter.com/AldeasDePaz?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://twitter.com/AldeasDePaz</a></p><p>YouTube: <a href=\"http://www.youtube.com/Peacevillages?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">http://www.youtube.com/Peacevillages</a></p>"
    },
    {
        "position": "Teaching English Maths Science Computer in Nepali Schools",
        "company": "Volunteer Society Nepal (VSN)",
        "location": {
            "city": "Kathmandu",
            "state": "Nepal"
        },
        "posted": "2021-06-19T06:47:49.137Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/b190ce1c90c34fb2a900b24a038b25b9-teaching-english-maths-science-computer-in-nepali-schools-volunteer-society-nepal-vsn-kathmandu",
        "lastScraped": "2021-06-21T06:47:49.137Z",
        "description": "<p>Schools in Nepal often lack appropriate funding and resources to adequately teach children. As English is an international language, it is becoming more and more of a required skill for job placement, educational advancement and future success. Many classes are delivered in English by Nepali teachers, who frequently have only a basic level English. Besides formal teaching,&nbsp;<a href=\"https://www.volunteersocietynepal.org/placements/internship-nepal/teaching-internship?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\"><strong>Teaching Internship in Nepal</strong></a>&nbsp;may get involved in organizing activities which encourage the personal development of students, using their initiative to learn life skills. teaching Interns may form student groups, which allow further educational experiences for the children, with a particular focus on capacity-building and English language development.</p><p>If you enjoy teaching and work great with children, this is the perfect internship for you. This is a very good opportunity for interns with an educational background to learn the basic fundamentals of teaching a class and gain some experience in their desired profession. Though no teaching experience or skill is needed, interns joining the teaching program should have good English, both written and verbal. Interns are expected to be flexible and patient. You should have passion and love for teaching, English and conversation.</p><p><strong>As an Intern Teacher, you may:</strong></p><ul><li>Teach English,&nbsp;mathematics, environmental science, pure science, international history, computer science</li><li>Organize extra-curricular activities like games, drawing, singing, dancing and other creative education activities</li><li>Support for educational tours, homework, monitoring academic progress and in administrative support.</li><li>Assist to main English teacher depending up on your confidence level and teaching experience.</li></ul><p>Most students of the school are between the ages of 5 and 13. In Nepal , the English teacher follows fixed English curricula. Therefore, you will mostly follow fixed English curricula (each grade has its own English book).If you want, you can work as a main teacher. Generally you are not alone and will be assisted by other teachers within the school. Interns who teach English in Nepal work with several teaching project in several Government or private schools in any parts of Nepal. In Nepal , English is not part of the standard primary public school curriculum. Compared to students at the private schools, students at the public schools have very little knowledge of basic English. Your role as an intern can make a difference in these student’s lives and prepare them for an easier transition to higher schools. Many Nepali children dream of speaking English.</p><p><a href=\"https://www.volunteersocietynepal.org/placements/internship-nepal/teaching-internship?utm_medium=referral&amp;utm_source=idealist\" target=\"_blank\">https://www.volunteersocietynepal.org/placements/internship-nepal/teaching-internship/</a></p>"
    },
    {
        "position": "Federal Volunteer Service or Internship as Consumer and Market Research Assistant in the Food Industry and Retail Department",
        "company": "ProVeg",
        "location": {
            "city": "Berlin",
            "state": "Berlin"
        },
        "posted": "2021-06-02T06:47:50.220Z",
        "url": "https://www.idealist.org/en/nonprofit-internship/5871b7f2194b4de1ad3f5a2977d37e06-federal-volunteer-service-or-internship-as-consumer-and-market-research-assistant-in-the-food-industry-and-retail-department-proveg-berlin",
        "lastScraped": "2021-06-21T06:47:50.220Z",
        "description": "<p>ROLE SUMMARY</p><p>Are you interested in assisting the international Food Industry &amp; Retail team in supporting companies along their journey to offering more plant-based alternatives? Then this Federal Volunteer Service or internship is for you!</p><p><br></p><p>We are active in the following fields:</p><p>- Primary and secondary market research</p><p>- Corporate consultancies</p><p>- Speaking at conferences and collaborating with trade fairs</p><p>- Media work</p><p>- Collaborations with experts from science and research</p><p>- Projects</p><p><br></p><p>An exciting opportunity has arisen to lead on the identification and cataloguing of existing academic research and market data related to the plant based-space. In the role, you will have the opportunity to identify and review academic literature, market data (from renowned market research agencies) and wider trends from the plant-based food and beverage sector, providing you with the unique opportunity to enhance your research skills by connecting with experts within the plant-based space.</p><p><br></p><p><br></p><p>RESPONSIBILITIES</p><p>- Independently searching, pre-selecting and structuring internal and external data and literature</p><p>- Shaping, refining and delivering the data-gathering process, taking a user-centric approach to the cataloguing of data, research and reports</p><p>- Carrying out regular data maintenance and ad-hoc research activities</p><p>- Taking over administrative and organisational tasks</p><p>- Preparing and carrying out own smaller projects.</p><p><br></p><p>QUALIFICATIONS</p><p>- Able to navigate academic literature, journals, sales data and market reports to gather and catalogue relevant information</p><p>- Confident in handling large amounts of data and information</p><p>- Skilled in identifying information and trends, and able to write clear concise summaries</p><p>- Ability to work in an independent, structured, proactive, pragmatic, and efficient manner.</p><p>- Excellent analytical skills and the ability to recognise interrelations.</p><p>- Excellent English language skills</p><p>- Excellent computer skills, with confidence in using basic functions of Excel and ideally some familiarity with WordPress or similar platforms</p><p>- You are a long-term thinker and don’t lose your motivation without short-term successes.</p><p>- You identify with the goals and values of ProVeg.</p><p>- Ideally, you are studying or have completed studies in the field of consumer studies, communication science, food technology, food economics, nutritional sciences, business administration or similar, or already have work experience in these areas.</p><p><br></p><p>WHEN?</p><p>Start: September</p><p>Period: BFD min. 6 to max. 18 months, voluntary internships 3 months, compulsory internships up to 6 months, Full-time or part-time (only available for interns)</p><p>Location: Berlin (or remotely - interns only)</p>"
    }
]