[
    {
        "position": "Information Technology Internship (IT Intern 3)- 3291",
        "company": "Huntington Ingalls Industries Inc.",
        "location": {
            "city": "Honolulu",
            "state": "HI",
            "zip": "96813"
        },
        "posted": "2021-06-15T20:59:15.597Z",
        "url": "https://www.indeed.com/rc/clk?jk=784e429ae7571cf1&fccid=9f2bb83bd9bfe2fc&vjs=3",
        "skills": "N/A",
        "lastScraped": "2021-06-16T20:59:15.597Z",
        "description": "<div></div><div><p><b>Date: </b>Jun 15, 2021\n</p><p><b>Location:</b> Honolulu, HI, US, 96813\n</p><p><b>Company: </b>HII's TSD\n</p><div><p>.</p>\n<div><div><div><h2 class=\"jobSectionHeader\"><b>\nJob Description</b></h2>\n</div><div><p>\nHII-Technical Solutions is currently seeking an IT Intern to work out of our Honolulu, HI office.</p><br>\n<p></p>\n<p>Huntington Ingalls Industries is seeking an Undergraduate Junior or Upcoming Junior to take part in our growing internship program. We are looking for a future IT professional, interested in breaking into the defense industry. As one of our interns, HII-TSD will offer you the opportunity to work alongside subject matter experts and assist in providing critical support to our clients. Our experts will provide on-the-job training, and ensure our interns complete our program with the confidence to accurately perform the skills learned throughout their careers. This opportunity not only provides you the opportunity to gain valuable work experience in a professional environment, but also allows you a look at what HII-TSD can offer you as an employee.</p><br>\n<p></p>\n<p><b><i>Internships are offered in 90 day increments. Students may be invited to remain in the internship program for another 90 days, following an evaluation after the term.</i></b></p>\n</div></div><div><div><h2 class=\"jobSectionHeader\"><b>\nEssential Job Responsibilities</b></h2>\n</div><div><ul><li>Support the IT team in maintaining hardware, software, and other systems in areas such as cybersecurity, programming, analytics, and data center management</li>\n<li>Assist with troubleshooting issues and provide technical support</li>\n<li>Perform on-site installation/ configuration/ repair/ recovery/ back-up and preventative maintenance on PCs and related peripherals</li>\n<li>Assist IT personnel in ensuring that hardware and software systems are fully deployed, implemented, and functioning</li>\n</ul></div></div><div><div><h2 class=\"jobSectionHeader\"><b>Minimum Qualifications</b></h2>\n</div><div><ul><li>Pursuing degree in the field of computer science, information sciences, or a related field</li>\n<li>High School Diploma or equivalent + Must be working towards a Bachelor's degree with between 40% and 60% of the required credits completed</li>\n<li>Moderate understanding of general job aspects and some understanding of the detailed aspects of the job</li>\n<li>Clearance- Ability to obtain and maintain a security clearance</li>\n</ul></div></div><div><div><h2 class=\"jobSectionHeader\"><b>Preferred Requirements</b></h2>\n</div><div><ul><li>Active Clearance: TS/SCI</li>\n<li>Valid CompTIA Security + certification</li>\n</ul></div></div><div><div><h2 class=\"jobSectionHeader\"><b>Physical Requirements</b></h2>\n</div><div><p>\nJob performance will normally require only minor lifting and carrying of boxes of records or equipment.</p>\n</div></div></div><p>\nA division of Huntington Ingalls Industries</p>\n<p>This opportunity resides with <b>Unmanned Systems</b>, a business group within Huntington Ingalls Industries’ Technical Solutions division, creates advanced unmanned maritime solutions for defense, marine research and commercial applications. Serving customers in more than 30 countries, HII provides design, autonomy, manufacturing, testing, operations and sustainment of unmanned systems, including unmanned underwater vehicles (UUVs) and unmanned surface vessels (USVs).</p>\n<p>Huntington Ingalls Industries is America’s largest military shipbuilding company and a provider of professional services to partners in government and industry. For more than a century, HII’s Newport News and Ingalls shipbuilding divisions in Virginia and Mississippi have built more ships in more ship classes than any other U.S. naval shipbuilder. HII’s Technical Solutions division provides a wide range of professional services through its Fleet Support, Mission Driven Innovative Solutions, Nuclear &amp; Environmental, and Oil &amp; Gas groups. Headquartered in Newport News, Virginia, HII employs more than 42,000 people operating both domestically and internationally.</p>\n<p>Huntington Ingalls Industries is an Equal Opportunity/Vets and Disabled Employer. U.S. Citizenship may be required for certain positions.</p><br>\n<p><br>\n<b>Nearest Major Market: </b>Honolulu\n<br>\n<b>Nearest Secondary Market: </b>Hawaii</p></div></div><div></div>"
    }
]