[
    {
        "position": "Fellowship in Machine Learning and Computer Vision",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:04:33.017Z",
        "url": "https://www.internships.com/posting/1edd34b5-e40d-4254-9b91-f1b85438ee79",
        "lastScraped": "2021-06-22T19:04:33.017Z",
        "description": "<p>The Department of Defense (DoD) is offering a postdoctoral fellowship for their Visiting Scientist Program at the National Geospatial-Intelligence Agency (NGA), a world leader in timely, relevant, accurate and actionable GEOINT.</p><p><br></p><p><strong>What will I be doing?</strong></p><p><br></p><p>With the omnipresence of high quality images available via the internet and social media, high resolution photographs from US -denied corners of the world are available like never before.&nbsp;Oftentimes, these images contain objects of very high interest and intelligence value.&nbsp;But, unlike highly calibrated space-borne and aerial cameras whose image metadata contains sensor position, orientation, calibration characteristics, etc., photographs harvested from personal devices and the internet are absent such metadata – metadata required for accurate photogrammetric exploitation of objects displayed within the image scene.</p><p><br></p><p>Even though images harvested from non-metric (unknown) sources typically display very high resolution quality, the process of obtaining accurate dimensions of objects depicted in those images is oftentimes immensely difficult and frequently unfruitful.&nbsp;This is partly attributed to the absence of sensor/lens data, sensor orientation and geolocation, and image cropping (non-full frame images).&nbsp;Additional constraints are presented by the absence of multiple images containing the object(s) of interest, i.e. only a single image being available, and finding object(s) of known size within an image scene, i.e. identifying a known scalar.&nbsp;Lastly, close range images often display perspective foreshortening, and sometimes wide-angle lens distortion, adding additional challenges to photogrammetric exploitation of objects in a scene.</p><p><br></p><p>As the selected candidate, you will utilize advances in computer vision and machine learning combined with well-established photogrammetric techniques to derive a camera sensor model from a single or very small-batch of metadata-absent images acquired using consumer grade cameras/mobile devices.&nbsp;The research will involve developing an automated or semi-automated process utilizing learned/recognized common objects, shapes, geometries, and architectural standards present in most photographic scenes.&nbsp;The derived sensor model will enable accurate dimensional analysis of metadata-absent images.</p><p><br></p><p><strong>Where will I be located?</strong></p><p><br></p><p>You will conduct research remotely under the direction of a mentor who will be based in Springfield, Virginia.&nbsp;</p><p><br></p><p><strong>What is the anticipated start date?</strong></p><p><br></p><p>NGA is ready to make appointments immediately. Exact start dates&nbsp;will be determined at the time of selection and in coordination with the selected candidate. Applications are reviewed on an ongoing basis and fellowships will be filled as qualified candidates are identified.</p><p><br></p><p><strong>What is the appointment length?</strong></p><p><br></p><p>Appointments are initially for one year with the option to extend the appointment for up to four additional years, contingent upon project needs and funding availability.</p><p><br></p><p><strong>What are the benefits?</strong></p><p><br></p><p>As a participant with NGA, you will receive:</p><p><br></p><ul><li>Stipend, determined by NGA, based on your academic credentials and commensurate with GS Locality Pay Tables</li><li>Health Insurance Allowance</li><li>Relocation Allowance, if you are located more than 50 miles one way from the hosting facility</li><li>Travel Expense Allowance</li><li>Education and Research Support Allowance</li></ul><p><br></p><p><strong>About NGA</strong></p><p><br></p><p>The National Geospatial-Intelligence Agency (NGA) delivers world-class geospatial intelligence that provides a decisive advantage to policymakers, warfighters, intelligence professionals, and first responders. Anyone who sails a U.S. ship, flies a U.S. aircraft, makes national policy decisions, fights wars, locates, target, responds to natural disasters, or even navigates with a cellphone relies on NGA. NGA enables all of these critical actions and shapes decisions that impact our world through the indispensable discipline of geospatial intelligence.&nbsp;&nbsp;For more information about NGA, please visit&nbsp;https://www.nga.mil/.</p><p><br></p><p><strong>About ORISE</strong></p><p><br></p><p>This program, administered by Oak Ridge Associated Universities (ORAU) through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and DoD.&nbsp;Participants do not enter into an employee/employer relationship with ORISE, ORAU, DoD or any other office or agency. Instead, you will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.&nbsp;For more information, visit the&nbsp;ORISE Research Participation Program at the U.S. Department of Defense.</p><p><br></p><p><strong>Qualifications</strong></p><p class=\"ql-align-right\"><br></p><p>The qualified candidate will have a doctoral&nbsp;degree or be within nine months of completion of that degree. Degree must have been received within five years of the appointment start date.&nbsp;U.S. military veterans who have been honorably discharged (or who have been medically discharged because of a service-connected disability) and who received a doctoral degree within ten years of the desired start date are also eligible.</p><p><br></p><p>Highly competitive applicants will have:</p><p><br></p><ul><li>A background in computer vision, machine learning or other relevant discipline.</li><li>Experience in the application of the scientific method.</li><li>A background in modern research techniques in a field highly related to the GEOINT Research.</li><li>Experience in conceptualizing a broad research agenda and in planning and executing specific research projects.</li><li>Knowledge of scientific computing/scripting languages such as Python.</li><li>Experience working with remote sensing and geographic data.</li><li>Ability to integrate with large data repositories.</li><li>A background in high-performance computing.</li></ul>"
    },
    {
        "position": "Data engineering intern",
        "company": "Roadz",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:04:41.865Z",
        "url": "https://www.internships.com/posting/ccm_3864b60d-b90f-4bc2-82b6-fd888acdeace",
        "lastScraped": "2021-06-22T19:04:41.865Z",
        "description": "<p>This is an internship position for passionate individuals who are interested in working on an innovative advanced data platform for processing connected vehicle data.</p>"
    },
    {
        "position": "USDA-ARS High Performance Computing and Big Data Science Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-05-23T19:04:50.761Z",
        "url": "https://www.internships.com/posting/ccm_d45baa63-7fd5-4f4f-a626-a2dfd1d4aab2",
        "lastScraped": "2021-06-22T19:04:50.761Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Throughout the course of this research project, the participant&nbsp;will learn about conducting agricultural research within the context of the ARS Big Data Initiative (BDI;&nbsp;scinet.usda.gov). The BDI is responsible for three major components: (1) a high-capacity network as the backbone of a research data and information conduit among ARS locations (SciNet); (2) high-performance computing and storage infrastructure available to all ARS scientific staff; and (3) a virtual research support core (VRSC), a group of personnel with diverse skills in scientific computing that provides support and training to ARS scientists and staff. Under the guidance of a mentor, the&nbsp;participant will have the opportunity to gain experience in and&nbsp;learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct analyses in an HPC and cloud-based environment.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will&nbsp;have the opportunity to learn AI technologies through our AI Center of Excellence, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice for a multi-disciplinary topic within our National Programs. The&nbsp;participant will also&nbsp;have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with agro-ecosystem problems across multiple spatial and temporal scales.</p>"
    },
    {
        "position": "Editorial Internship- The Triumphant Scoop",
        "company": "The Triumphant Group",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-22T19:05:02.940Z",
        "url": "https://www.internships.com/posting/ccm_9f53c240-3959-43a0-8e94-b718651c2144",
        "lastScraped": "2021-06-22T19:05:02.940Z",
        "description": "<p>The Triumphant Scoop is a global lifestyle news-site known for our intercultural accounts of Society, Life &amp; Style, and Big-City living. Featuring both international and local content, and utilizing first person commentary and reports, we keep readers entertained, enlightened, and most importantly- informed of global news and ways to <em>“live your best life in a big-city.” </em></p><p><br></p><p>Excitedly, we're currently looking for Lifestyle, Pop-culture and Entertainment editorial interns to assist us with writing and producing our weekly content, article writing, and event coverage across www.triumphantscoop.com as we prepare for our Summer relaunch.</p><p><br></p><p>Publishing your first-person voice on The Triumphant Scoop will expose you to our targeted readership and ensure your articles gain traction amongst a global readership. The Triumphant Scoop has been featured in The Huffington Post, Essence Magazine, The Washington Post, Numero', and many other mainstream blogs, news sites, and media platforms. When in full operation, we have an average of over 35,000 views per month.&nbsp; </p><p><br></p><p>Though this internship is technically unpaid, it does come with a stipend of $125/ mth. Perfect for someone looking for editorial, magazine, and publishing experience. Successful completion of this internship will lead to a paying position.</p><p><br></p><p>Duties will include a mix of</p><ul><li>- Assist with overseeing the daily editorial schedule of a fast-growing digital site.&nbsp;</li><li>- Create short but well-written and engaging content for our events section.&nbsp;</li><li>- Attending fun/cool/ exclusive events and providing a live, first-hand experience via social media and through editorial recaps.&nbsp;</li><li>- Provide creative input and ideas on upcoming stories and editorial calendar as a whole.&nbsp;</li><li>- Contribute your own work to the platform, including interviews, societal news, and op-ed pieces.&nbsp;</li><li>- Assist with the production of our weekly columns, social media, and monthly photoshoots.</li></ul>"
    },
    {
        "position": "Engineer Recruiter Interns (Immediate Start)",
        "company": "Minuteman Group",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-22T19:05:14.872Z",
        "url": "https://www.internships.com/posting/90c97ed4-3c94-4779-bcd3-4bc24b1b4f10",
        "lastScraped": "2021-06-22T19:05:14.872Z",
        "description": "<p>If you are a current engineering, software or data science intern, this is an interesting summer internship. We are seeking current students or 2021 graduates with technical degrees in engineering, or computer and data science, who are interested in working in the human resources function. This position will require you to review open positions, search for candidates, and screen resumes, talk to candidates, and discuss them with Senior Recruiters. </p><p><br></p><p>Our senior recruiters are primarily engineers who decided to take a different career path.  This position will give a sense of what recruiters are looking for, and teach you a lot about different roles in engineering.  We will train you on the job; we need to know you are passionate about this. </p><p><br></p><p><strong>Position Scope/Job Functions:</strong></p><p><strong> </strong>To provide highly skilled candidates for current job openings using expertise in engineering, IT and recruiting.</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Source candidates using various resources including job boards and internal database</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact active and passive candidates and build talent pipeline for hiring needs</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Send emails, texts and make phone calls to prospective candidates</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Screen candidates to determine fit with the active positions</p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work with Senior Recruiters to submit suitable candidates to the client</p><p><br></p>"
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:05:24.302Z",
        "url": "https://www.internships.com/posting/ccm_13b7c4c4-46e1-4489-96ee-11422507b366",
        "lastScraped": "2021-06-22T19:05:24.302Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Research Internship (Fall 2021, Computer Vision)",
        "company": "N/A",
        "location": {
            "city": "NY",
            "state": "United States"
        },
        "posted": "2021-05-23T19:05:42.264Z",
        "url": "https://www.internships.com/posting/sam_3369596862210b98",
        "lastScraped": "2021-06-22T19:05:42.264Z",
        "description": "<div><p>Type: Internship<br>\nExperience: PhD/Graduate Students</p>\n<p>\nWho we are:</p>\n<div>\n<p>Dataminr puts real-time AI and public data to work for our clients, generating relevant and actionable alerts for global corporations, public sector agencies, newsrooms, and NGOs. Our leading AI platform detects the earliest signals of high-impact events and emerging risks from vast amounts of publicly available information. Our real-time alerts enable tens of thousands of users at hundreds of public and private sector organizations to learn first of breaking events around the world, develop effective risk mitigation strategies, and respond with confidence as crises unfold.</p>\n<p>\nDataminr is making its mark for growth and innovation, recently earning recognition on the Deloitte Technology Fast 500, Forbes AI 50 and Forbes Cloud 100 lists. We also earned accolades for 'Most Innovative Use of AI' from the 2020 AI &amp; Machine Learning Awards.</p>\n<p>\nJoin our team and help the world manage risk in real time. You'll work with 600+ talented people across seven offices, united by our passion to collaborate, make a difference, and have fun while doing it!</p>\n</div>\n<p>Who you are:</p>\n<p>\nYou're a Ph.D. candidate who has published in top tier conferences and are passionate about having a positive impact on the world. You are enthusiastic about working on some of the most challenging problems in AI, working in a highly collaborative environment and directly contributing to products while advancing the state of the art. You are very creative, can work independently, and are an excellent collaborator and communicator.</p>\n<p>\nResponsibilities:</p>\n<ul>\n<li>Perform research to advance the state of the art and solve specific problems at scale in Computer Vision</li>\n<li>Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship.\n</li><li>Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact.</li>\n</ul>\n<p>Minimum qualifications:</p><br>\n<ul>\n<li>Must be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field.</li>\n<li>Ideal candidates will have had prior internship experience.</li>\n<li>Outstanding publication record in the candidate's field of study (ACL, CVPR, CHI, WWW, RecSys, ICCV, NIPS, ICML, etc.).</li>\n<li>Demonstrated ability to work independently, set up experiments and demonstrate progress through principled used of metrics.</li>\n</ul>\n<div><div><p>Dataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.</p>\n\n#LI-EL</div></div></div>"
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:05:57.433Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-06-22T19:05:57.433Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>"
    },
    {
        "position": "Data Scientist Intern",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-05-23T19:06:15.919Z",
        "url": "https://www.internships.com/posting/sam_3779471796",
        "lastScraped": "2021-06-22T19:06:15.919Z",
        "description": "<div>Job Description<p>Protection Engineering Consultants (PEC) is a unique and diverse small-business engineering firm, headquartered in Central Texas. PEC’s services range from security consulting and risk mitigation support to the design, research, analysis and testing of protective structures subjected to extreme loads, such as weapons effects, blast, vehicle impact, forced entry attack and natural hazards. We provide structural and mechanical engineering services; use machine learning (ML) and uncertainty quantification (UQ) techniques to deliver novel solutions to engineering problems; create specialized software for defense and anti-terrorism applications; perform advanced numerical modeling; develop, oversee and perform nonlinear and dynamic testing; develop criteria for protective applications; and, provide training. We work domestically and internationally.</p><p>As we continue to expand our services, PEC is looking for an eager and coding-capable engineer or computer scientist intern to support the development of novel ML algorithms that address the unique engineering challenges of our military and civilian clients. Candidates should display advanced problem-solving skills and a knack for implementing solutions to complex technical problems. This role will require strong data analysis abilities, experience with programming/scripting languages (Python), and excellent verbal/written communication skills. As project work can be highly variable, this position requires flexibility, cleverness, and autodidactic learning.</p><p>The responsibilities of this role will involve providing support for our current data science and machine learning efforts. Other opportunities to learn/bolster skills in version control, unit testing, software packaging, and marketing will become available as interests dictate.</p>Qualifications<ul><li>Pursuing B.S. or graduate degree in Data Science, Engineering, Computer Science, Mathematics, Physics, Information Systems, or a related field.</li><li>3.5 GPA or above.</li><li>Experience using Python (C++, SQL, and Ruby a plus).</li><li>Ability to clearly communicate verbal and written technical information.</li><li>Availability in Summer months (duration ~3 months)</li><li>Ability to work from Dripping Springs or San Antonio office (remote work is a possibility)</li><li>No professional experience required.</li><li>US citizen.</li></ul><p>Protection Engineering Consultants LLC (PEC) provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, PEC complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfers, leaves of absence, compensation and training.</p><p>Please send all applications and inquiries to careers@protection-consultants.com</p></div>"
    },
    {
        "position": "EPA Cyanobacteria and Microplastics Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:06:24.765Z",
        "url": "https://www.internships.com/posting/97198216-1270-440c-97ef-884f6a2670b9",
        "lastScraped": "2021-06-22T19:06:24.765Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA is concerned about the contamination from plastics in the water supply and the growth of cyanobacteria in lakes/streams that can produce harmful cyanotoxins to man and animals. The research will involve two projects:1) cyanobacteria and 2) microplastics. The aim of the microplastic project will be to detect small microplastics particles in solutions from environment samples using a brand new Cytek Spectral flow cytometer and different types optical imaging equipment. The uptake of micro and nano plastic particles will be studied using different sizes of sub-micron&nbsp;polystyrene beads in mammalian cells. Possible health effects of these microparticles will be studied on cells.&nbsp;The cyanobacteria projects will involve 1) the study of effects that chemicals (KMnO4, H2O2 and CuSO4)&nbsp;used in water treatment has on cyanobacteria, and 2) the study the effects of cyanobacteria toxins on plants using the Cytek spectral flow cytometer, a Nikon Ti2 research fluorescence microscope and hyperspectral imaging equipment.&nbsp;</p><p><br></p><p>The research participant will have the opportunity to prepare samples for use in the laboratory scientific experiments. The research participant will be able to gain experience using and operating the following state of the art scientific equipment:&nbsp;1) Nikon Ti2 research fluorescence microscope 2) Leica fluorescence stereo microscope, 3)&nbsp;Cytek Aurora spectra flow cytometer 4) PARISS hyperspectral equipment&nbsp;5) PARISS Macro hyperspectral optical equipment 6) Nexcelom cell counter and 7) general laboratory equipment.&nbsp;The research participant will have the opportunity to be involved in the operation of this equipment the lab that will be used to generate data for the cyanobacteria and microplastic projects. They will gain experience assisting in the evaluation of the data using scientific computer software programs.&nbsp;The research participant will have the opportunity to learn how to carry out general laboratory procedures that constitute a functional biological laboratory. In addition, with guidance from the mentor, the research participant will gain experience growing cyanobacteria cultures, mammalian tissue culture cells and water plant cultures.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The knowledge gained in the operation of this microscopic and flow cytometry scientific equipment will be an be invaluable for the research participant's educational development and their future laboratory research. The research participant will learn how to use state-of-the-art equipment in these research projects. They will have the opportunity to be engaged in educationally based research and learning activities that can benefit their scientific development.&nbsp;The knowledge gained can be helpful for future employment in different scientific research fields and could be useful if they decide on pursuing higher education. The mastering of the techniques used in the laboratory will provide the research participant an excellent skill set for future higher education studies or employment in scientific industries. If the research participant masters the operation of these laboratory equipment, the skills learned will be extremely useful for graduate research or employment in scientific research laboratories.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Robert Zucker (Zucker.robert@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;August&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment&nbsp;can be&nbsp;part-time or full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "EPA Postdoctoral Fellowship in Integrated Environmental Modeling",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:06:33.374Z",
        "url": "https://www.internships.com/posting/8e8a0326-7ad0-4cd4-b8ff-b8f9f56d9a82",
        "lastScraped": "2021-06-22T19:06:33.374Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM), Watershed and Ecosystem Characterization&nbsp;Division (WECD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina.</p><p><br></p><p>Safe and Sustainable Water Resources (SSWR) Research Program is one of the EPA ORD’s national research programs. One of the important research areas under the SSWR is “Nutrients and Harmful Algal Blooms”. While EPA has made great efforts toward reducing nutrient pollution nationwide, we continue to be challenged to consider the appropriate spatial and temporal context for reductions and alternative practices for tracking interventions to meet nutrient reduction goals in a comprehensive manner.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;&nbsp;This research opportunity,&nbsp;Integrated Environmental Modeling, is&nbsp;comprised of two broad components: 1) Develop and application of state of the science for nutrient study, and 2) seek and evaluate effectiveness of various mitigation practices for water quality improvement.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will have the opportunity to learn model development and application to better understand nutrient source, fate and transport in the large river basins, as well as seeking the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. land use/land management practices) leading to the sustainability of surface and subsurface water resources.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Dr. Yongping Yuan (yuan.yongping@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021 or as soon as a suitable candidate is found.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Data Analyst Internship",
        "company": "2Interact Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-22T19:06:41.988Z",
        "url": "https://www.internships.com/posting/251148d5-3a8e-4a07-aa54-617920fb709d",
        "lastScraped": "2021-06-22T19:06:41.988Z",
        "description": "<p>Either directly or with our business partners, we provide total implementation and system integration solutions for our Interact HRMS products depending on the client needs and requirements. Using our proven structured risk-free implementation methodology, we provide full HR Implementation and Deployment including Project Planning, Project Management, Implementation, Training, System Integration, Quality Assurance, Production, Deployment, and Production Support.</p><p>2Interact Inc. is seeking hardworking and passionate Data Analysts that will be part of a startup team that is focused on delivering a highly scalable platform that enables growth of current and future services to our customers. This Internship position will focus on engaging with our internal service teams to understand and provide solutions to complex data science problems. Duties for this position will include:</p><p><br></p><p>• Identify, analyze and interpret trends or pattern in complex data sets.</p><p>• Develop best practices for reporting, analytics, and generation of key metrics.</p><p>• Work with the data center teams and various stakeholders to create the relevant metrics for measuring and monitoring the business.</p><p>• Automate data collection, pre-processing and/or analysis.</p><p>• Write Microsoft SQL queries and generate Microsoft PowerPoint presentations.</p>"
    },
    {
        "position": "USFS Internship in Diversity-Forest Ecosystem Functioning Using GIS/Remote Sensing",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-22T19:06:50.838Z",
        "url": "https://www.internships.com/posting/a42ec2d0-dcf1-42c8-b7e5-f6d877ecd968",
        "lastScraped": "2021-06-22T19:06:50.838Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center located in Research Triangle Park, North Carolina. Initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Our proposed work therefore addresses all the four criteria of this solicitation. Through this research and collaboration, the follow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is part-time (20 hours per week).</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>"
    },
    {
        "position": "USFS Postdoctoral Fellowship in Biodiversity-Forest Ecosystem Functioning Using Remote Sensing/GIS",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-22T19:06:59.566Z",
        "url": "https://www.internships.com/posting/6b2a7004-aea2-4643-9dbe-bebd4566db71",
        "lastScraped": "2021-06-22T19:06:59.566Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A&nbsp;postdoctoral research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center in Research Triangle Park, North Carolina. The participant will mainly be stationed at the University of New Hampshire in Durham, New Hampshire, but will travel to Research Triangle Park periodically and South Carolina and Florida as needed if funding is available. The initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Through this research and collaboration, the fellow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.&nbsp;<strong>The annual stipend will be around $70,000. A health insurance supplement covering individual health and prescription coverage (excludes dental/vision) will also be provided.</strong></p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>"
    },
    {
        "position": "USFS Stream Flow Permanence Mapping Internship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-06-22T19:07:08.159Z",
        "url": "https://www.internships.com/posting/74f86673-381b-4484-89fa-5a6217487673",
        "lastScraped": "2021-06-22T19:07:08.159Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A&nbsp;research opportunity&nbsp;is available with the US Forest Service (USFS) located across western Oregon and the Pacific Northwest.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Forest managers in Oregon and in the Pacific Northwest are required to conduct stream surveys to understand the extent of perennially flowing streams to inform management practices, specifically, the size of stream-side harvest buffers which influence harvest methods as well as value estimates. Federal, state, and private entities spend thousands to millions of dollars to fund these surveys, yet the scope of monitoring is limited to a local project area and does not enhance the broader regional understanding of stream flow permanence. This interdisciplinary research project combines approaches to compile and analyze data derived from the National Hydrology Dataset (NHD) and high-resolution digital terrain models (DTMs) derived from Light Detection and Ranging (LIDAR) data compiled by Oregon Department of Geology and Mineral Industries (DOGAMI).</p><p><br></p><p>The goal of this research project is to develop a spatial model of stream flow permanence for the NHD flow line network for western Oregon by using flow permanence observations&nbsp;housed in an&nbsp;internally developed&nbsp;database,&nbsp;in conjunction with predictor variables&nbsp;derived from terrain, hydo-topographical, and environmental data. This research aims to improve the understanding of how climate, landscape, geological, and terrain conditions interact to influence stream flow permanence and will provide a state-of-the-art map of stream flow permanence for western Oregon at a very fine grain (&lt;10 m).&nbsp;&nbsp;</p><p><br></p><p>The two month period of the internship will consist primarily of field work across&nbsp;western Oregon with another ORISE intern. Approximately two weeks of lab time will be allocated for&nbsp;planning, processing, and data synthesis. Due to the rural nature of the field work, lodging accommodations will primarily consist of dispersed camping.&nbsp;&nbsp;</p><p>With guidance from the mentor, the research participant may be involved in any or all of the following research activities:</p><p><br></p><ul><li>Collect observation data related to stream flow permanence in Western Oregon</li><li>Use GIS to examine relationships among environmental, hydro-topographical, and observational data</li><li>Using complex models in R and Python to examine the relationships between stream flow permanence observations and the covariates of interest</li><li>Collaborating with federal partners on research and database improvement activities</li><li>Conducting scientific synthesis, data analysis, manuscript preparation, and literature searches</li><li>Testing new measurement methodologies for quantifying topographic features related to stream flow permanence</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will be mentored by USDA Forest Service scientists and have the opportunity to&nbsp;collaborate along side USGS scientists as well as USFS and BLM managers as part of a regionally focused collaborative to better understand drivers and influential factors on stream flow permanence in geomorphic headwater channels. The research participant will have the opportunity to learn about USDA PNW Research station research, conduct research on national geospatial data sets, validate models based on locally sourced field observations, and apply these to develop maps and databases to inform forest management objectives.&nbsp;Over the course of the internship the participant will learn field sampling methodology, apply sample design theory, and gain experience making maps for planning designed research as well as maps for sharing research results.&nbsp;</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>&nbsp;The mentor for this opportunity&nbsp;is Jonathan Burnett (jonathan.burnett@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentors.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 5, 2021.&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;two months, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens only.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "MBA Intern - Business Plan (Summer 2021)",
        "company": "OMICSCRAFT LLC",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-22T19:07:16.822Z",
        "url": "https://www.internships.com/posting/6211be60-959b-4f24-a6e2-81f35e68e8d8",
        "lastScraped": "2021-06-22T19:07:16.822Z",
        "description": "<p>Are you an MBA student who would like to work on developing a business plan for a start-up company focused on consulting services? Do you want to collaborate with engineers and computational scientists who are working on software development in a highly collaborative environment? If this sounds like you, OmicsCraft would like to invite you to come join us this summer.</p><p><br></p><p>Specific responsibilities of the MBA intern include:</p><ul><li>meet with potential customers one-on-one</li><li>listen to customer’s specific problems and analyze the critical challenges they are facing</li><li>conduct market research</li><li>develop a business plan</li></ul><p><br></p><p>The intern position is open for the summer of 2021. Applicants should send a cover letter, resume, and one academic or professional reference to info@omicscraft.com.</p>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "VA",
            "state": "United States"
        },
        "posted": "2021-05-23T19:07:35.506Z",
        "url": "https://www.internships.com/posting/sam_4013175150",
        "lastScraped": "2021-06-22T19:07:35.506Z",
        "description": "<div><p>Interos, founded by Jennifer Bisceglie, is one of the most transformative technologically advanced platforms that powers the global economy supply chain. By using ML and big data, Interos aspires to dynamically and continuously map all of a company's business relationships to multiple tiers of dependency on a global scale and endeavors to help customers understand risk in their multi-tier, global supply chains. The scope of this value proposition extends across a variety of different technology sectors including risk management, supply chain intelligence, financial intelligence and cyber-security. Interos has raised funding from two extraordinary venture capital firms: Venrock, led by Nick Beim, and Kleiner Perkins, led by Ted Schlein. We have doubled in size in 2020 and are planning a similar trajectory in 2021. Our offices are headquartered in Arlington, VA, we have presence in Menlo Park, CA and are hiring across the nation for remote team members.</p><p>We need an extraordinary team member who thrives as part of a fast-paced team and takes pride in their ability to succeed while delivering value to our customers. Be challenged by innovation and grow professionally by solving one of the most interesting challenges impacting businesses across the globe.</p><p>The Opportunity:</p><p>Interos is changing the future now on how organizations find risk and innovation in their network of business relationships (supply chain). We are looking for Software Engineer Interns who are curious, detail oriented and want to be entrusted with real responsibility and embrace the opportunity to make our product better. You will be a full member of the Application Development team and learning to solve real world problems. You will be working in a collaborative, agile environment, where every voice matters, outside the box thinking is encouraged, and the best ideas always win.</p><p>Dates of Internship: June 7, 2021-August 6, 2021</p><p>Essential Function/Duties</p><ul><li>Assume responsibility for key parts of the Interos Knowledge Graph product.</li><li>Write clean and well-crafted code in Python, TypeScript, and/or React.</li><li>Working within and across Agile teams to design, develop, test, implement, and support technical solutions across a full-stack of development tools and technologies.</li><li>Developing and maintaining applications for internal tools as well as our customer facing web application as well as backends for internal tools.</li><li>Bringing a passion to stay current with technology, experimenting with and learning new technologies.</li><li>Resolve customer-facing issues and fix bugs.</li><li>Develop practices to enhance code quality and ease of maintenance.</li></ul><p>Minimum Qualifications:</p><ul><li>Currently pursuing a Bachelor's Degree in Computer Science or Engineering.</li><li>Previous experience in front-end development in JavaScript and TypeScript or back-end development in Python.</li><li>Collaborative spirit and commitment to communicating well with colleagues in a remote environment as well as in-person.</li></ul><p>Preferred Qualifications:</p><ul><li>Familiarity with software engineering best practices – including unit tests, code review, version control, production monitoring, etc.</li><li>Solid understanding of development lifecycle (design, test, implement, document) and release management using modern collaboration tools.</li><li>Ability to show code samples or development portfolio.</li><li>Previous intern or professional development experience a plus!</li></ul><p>Interos is proud to be an Equal Opportunity Employer and will consider all qualified applicants without regard to race, color, age, religion, sex, sexual orientation, gender identity, genetic information, national origin, disability, protected veteran status or any other classification protected by law.</p><p>If you are a candidate in need of assistance or an accommodation in the application process, please contact HR@interos.ai</p></div><p></p>"
    },
    {
        "position": "USFS Internship in Diversity-Forest Ecosystem Functioning Using GIS/Remote Sensing",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-06-22T19:07:44.418Z",
        "url": "https://www.internships.com/posting/a42ec2d0-dcf1-42c8-b7e5-f6d877ecd968",
        "lastScraped": "2021-06-22T19:07:44.418Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:</strong>&nbsp;A research opportunity is available with US Forest Service (USFS), Southern Research Station, Eastern Forest Environmental Threat Assessment Center located in Research Triangle Park, North Carolina. Initial research location may be remote depending on COVID restrictions.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The overarching goal is to use structural measures from NASA’s Global Ecosystem Dynamics Investigation (GEDI) instrument and in situ measurements from the Experimental Forests&nbsp;Ranges (EFR) and the Forest Inventory and Analysis (FIA) to explore forest biodiversity and its relation to structural diversity, and to relate both types of diversity to productivity,&nbsp;carbon cycling and major disturbances such as fire, drought, invasive pest outbreaks, and sea-level rises.</p><p><br></p><p>The specific objectives designed to achieve the overarching goals are to:</p><ul><li>Map both structural and species diversity of southern forests using data from GEDI, other satellite data, and measurements from the EFR network and FIA;</li><li>Evaluate the performance of GEDI products for estimating forest structural and plant diversity of all species at the site level;</li><li>Quantify forest structural diversity - productivity (carbon cycling) relations at local and regional scales;</li><li>Elucidate how structural diversity regulates the resilience of forest productivity/carbon sequestration to fire and drought.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Our proposed project will examine how structural diversity is related to forest productivity and&nbsp;carbon sequestration (and thus water use), and explore the resilience of southern forests to fire and drought, and therefore will address SRS priority research areas in Fire, Water, and Restoration. This study combines expertise from multiple RWUs and Centers, incorporating field data from all the EFRs and FIA. Forest restoration to improve forest ecosystems services is a high priority area of R8 and Southern Group of State Foresters. Our proposed work therefore addresses all the four criteria of this solicitation. Through this research and collaboration, the follow will</p><ul><li>Gain an appreciation of the practical challenges and limitations of remote sensing in both short and long-term monitoring and assessments in forest ecosystems</li><li>Improve understanding of fundamental monitoring needs and how evolving technology can assist forest management in the future</li></ul><p><br></p><p><strong><u>Mentor</u>:&nbsp;</strong>&nbsp;The mentors for this opportunity&nbsp;include Qinfeng Guo, Jeff Atkins, Jingfeng Xiao, and Ge Sun. Please feel free to contact Qinfeng Guo (qinfeng.guo@usda.gov) or Jeff Atkins (Jeffrey.atkins@usda.gov)&nbsp;if you have questions about the nature of the research.</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;July 15, 2021.&nbsp;&nbsp;</strong>Start date is flexible and negotiable,&nbsp;and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;extended upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is part-time (20 hours per week).</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>"
    },
    {
        "position": "EPA Chemical Mixtures Evaluation & Modeling Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:07:53.146Z",
        "url": "https://www.internships.com/posting/05f13ed9-44ee-4e59-9fd0-ea8ca0abbd8f",
        "lastScraped": "2021-06-22T19:07:53.146Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>The Center for Public Health and Environmental Assessment (CPHEA) is tasked to provide support to the Safe and Sustainable Waters Research (SSWR) program by implementing in vitro tools for chemical toxicity and screening purposes. These methods utilize molecular initiating events (MIEs) that have been shown to activate adverse outcome pathways and related physiological/population-level adverse outcomes. Therefore, these efforts secondarily support the Chemical Safety for Sustainability (CSS) program.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The research participant will have the opportunity to conduct research related to goals of the SSWR, and to a lesser extent the CSS, programs.&nbsp;Research activities may include collaboration with an EPA team of investigators involved in toxicology research to understand impacts of environmentally relevant individual compounds and mixtures on nuclear receptor signaling pathways (e.g. estrogen, ER; androgen, AR; glucocorticoid, GR; peroxisome proliferator-activated receptor, PPAR; aryl hydrocarbon, AhR signaling pathways). The participant may gain experience assessing and modeling in vitro and in vivo responses of individual compounds, defined chemical mixtures, and also environmental samples containing unknown chemical mixtures.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>Under the guidance of a mentor, the participant will be the following training activities:</p><ul><li>cell culture techniques</li><li>in vitro chemical and environmental exposures and assessments&nbsp;</li><li>application and comparison of chemical mixtures models</li><li>in vivo physiological determinations relevant to ER, AR, GR and PPAR-related Adverse Outcome Pathways</li><li>necropsy and preparation of tissues for biochemical analyses (e.g. hormone production and quantitative-real time polymerase chain reaction)</li><li>data processing, statistical analysis, and graphical presentation</li><li>evaluating scientific literature and toxicological databases for information relevant to the presence of novel environmental contaminants and mixtures models.</li><li>maintain careful, easily legible, and accurate records in a laboratory notebook, electronic journal, or by other means acceptable to the mentor.&nbsp;</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity are Elizabeth Medlock Kakaley (medlockkakaley.elizabeth@epa.gov) and Earl Gray (gray.earl@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "USDA-ARS High Performance Computing and Prediction of Geospatial Dynamics Fellowship",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-05-23T19:08:01.804Z",
        "url": "https://www.internships.com/posting/ccm_929e68d0-31b8-4796-a497-54460da6b2d4",
        "lastScraped": "2021-06-22T19:08:01.804Z",
        "description": "<p>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of pests and animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with high performance computing (HPC) or cloud computing provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions. Under the guidance of a mentor, the participant will learn AI technologies relevant to these problems, and will help develop and co-lead ARS-wide workshops resulting in a community of scientific practice on geospatial problems with AI.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The&nbsp;participant will have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses and AI across multiple spatial and temporal scales.</p>"
    },
    {
        "position": "Data Analyst Internship",
        "company": "2Interact Inc.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-06-22T19:08:15.815Z",
        "url": "https://www.internships.com/posting/251148d5-3a8e-4a07-aa54-617920fb709d",
        "lastScraped": "2021-06-22T19:08:15.815Z",
        "description": "<p>Either directly or with our business partners, we provide total implementation and system integration solutions for our Interact HRMS products depending on the client needs and requirements. Using our proven structured risk-free implementation methodology, we provide full HR Implementation and Deployment including Project Planning, Project Management, Implementation, Training, System Integration, Quality Assurance, Production, Deployment, and Production Support.</p><p>2Interact Inc. is seeking hardworking and passionate Data Analysts that will be part of a startup team that is focused on delivering a highly scalable platform that enables growth of current and future services to our customers. This Internship position will focus on engaging with our internal service teams to understand and provide solutions to complex data science problems. Duties for this position will include:</p><p><br></p><p>• Identify, analyze and interpret trends or pattern in complex data sets.</p><p>• Develop best practices for reporting, analytics, and generation of key metrics.</p><p>• Work with the data center teams and various stakeholders to create the relevant metrics for measuring and monitoring the business.</p><p>• Automate data collection, pre-processing and/or analysis.</p><p>• Write Microsoft SQL queries and generate Microsoft PowerPoint presentations.</p>"
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "Financial Triangle Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:08:26.413Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-06-22T19:08:26.413Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>"
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:08:37.170Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-06-22T19:08:37.170Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "EPA Environmental Pollutant Fate and Transport Modeling Research Opportunity",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:08:47.775Z",
        "url": "https://www.internships.com/posting/350cd6f3-8ec5-47b1-a1c9-6a3524f99d15",
        "lastScraped": "2021-06-22T19:08:47.775Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM), Watershed and Ecosystem Characterization&nbsp;Division (WECD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina.</p><p><br></p><p>EPA ORD’s Research Programs include: Safe and Sustainable Water Resources (SSWR) Research Program, Chemical Safety for Sustainability (CSS) Research Program and Sustainable and Healthy Communities Research Program. Research for the SSWR focuses on developing an integrated modeling system for evaluation of policy options for water quality improvement at a large scale such as the Mississippi River Basin. Research for the CSS focuses on assessing human and environmental risk related to the use of chemicals. Both SSWR and CSS research programs require environmental pollutant fate and transport modeling, which would allow ORD to track the source and identify the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. fertilizer and pesticide application as well as other land use/land management practices).&nbsp;</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will focus on environmental pollutant fate and transport modeling. Under the guidance of a mentor, the participant will be involved in the following research activities:</p><ul><li>Using GIS and hydrological and water quality modeling skills to develop necessary input files for using the integrated modeling system to assist with evaluating nitrogen source, fate and transport under various scenarios</li><li>Reviewing and summarizing the effectiveness of BMPs/conservation practices for nutrient reduction</li><li>Developing and/or applying models and necessary input files for pesticide risk assessment and management</li><li>Interacting with a team of multi-disciplinary scientists/researchers</li><li>Presenting research results at national conferences&nbsp;</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant will have the opportunity to be involved in model development and application to better understand pollutant source, fate and transport in fields as well as in large river basins. The participant will also be involved in seeking the most effective alternative practices for minimizing the environmental impacts of different anthropogenic activities (e.g. land use/land management practices) leading to the sustainability of surface and subsurface water resources.&nbsp;Furthermore, the participant has the opportunity to publish and/or present research results at local and national conferences.&nbsp;</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Dr. Yongping Yuan (yuan.yongping@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021 or as soon as a suitable candidate is found.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment can be 20-40 hours per week, depending on the participant's availability.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;ORISE.EPA.ORD@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Bookkeeper-Intern 2021",
        "company": "EAGLE EYE HOME AND PROPERTY INSPECTIONS LLC",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:08:58.562Z",
        "url": "https://www.internships.com/posting/bfba583d-5928-4fb3-bdd0-d1a81ebe456a",
        "lastScraped": "2021-06-22T19:08:58.562Z",
        "description": "<p>We're currently seeking a Bookkeeper to join our team as an intern and work their way up! You will be responsible for preparing and examining financial records for our company. This internship will be paid. The intern may be responsible for special projects, database maintenance, conducting research, answering phones, writing reports, proofreading, and general administrative functions such as scanning, filing, and copying. All applicants must be available to start as soon as possible.</p><p><br></p><p>*Please do not come to our office location to drop off resumes. We will contact you for the next steps once your resume is reviewed by our team if you are deemed qualified.</p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><p>Obtain primary financial data for accounting records.</p><p><br></p><p>Compute and record numerical data.</p><p><br></p><p>Check the accuracy of business transactions.</p><p><br></p><p>Perform data entry and administrative duties.</p><p><br></p><p>Account Reconciles.</p><p><br></p><p><br></p>"
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-05-23T19:09:09.148Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-06-22T19:09:09.148Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "Financial Triangle Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:09:19.941Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-06-22T19:09:19.941Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>"
    },
    {
        "position": "Bookkeeper-Intern 2021",
        "company": "EAGLE EYE HOME AND PROPERTY INSPECTIONS LLC",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-05-23T19:09:32.472Z",
        "url": "https://www.internships.com/posting/bfba583d-5928-4fb3-bdd0-d1a81ebe456a",
        "lastScraped": "2021-06-22T19:09:32.472Z",
        "description": "<p>We're currently seeking a Bookkeeper to join our team as an intern and work their way up! You will be responsible for preparing and examining financial records for our company. This internship will be paid. The intern may be responsible for special projects, database maintenance, conducting research, answering phones, writing reports, proofreading, and general administrative functions such as scanning, filing, and copying. All applicants must be available to start as soon as possible.</p><p><br></p><p>*Please do not come to our office location to drop off resumes. We will contact you for the next steps once your resume is reviewed by our team if you are deemed qualified.</p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><p>Obtain primary financial data for accounting records.</p><p><br></p><p>Compute and record numerical data.</p><p><br></p><p>Check the accuracy of business transactions.</p><p><br></p><p>Perform data entry and administrative duties.</p><p><br></p><p>Account Reconciles.</p><p><br></p><p><br></p>"
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-05-23T19:09:52.663Z",
        "url": "https://www.internships.com/posting/bug_38993149157",
        "lastScraped": "2021-06-22T19:09:52.663Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time"
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-05-23T19:10:54.799Z",
        "url": "https://www.internships.com/posting/bug_38999957205",
        "lastScraped": "2021-06-22T19:10:54.799Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5842\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the IT teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time"
    },
    {
        "position": "Station Mobile Apparatus Technician Apprentice Or Journeyman",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-05-23T19:11:15.918Z",
        "url": "https://www.internships.com/posting/bug_39002223926",
        "lastScraped": "2021-06-22T19:11:15.918Z",
        "description": "Station Mobile Apparatus Technician Apprentice or Journeyman\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$32.69 - $47.42\n\nMinimum Age Requirement:\n\nJob Description:\n\nApprentice\n\nThe Station Mobile Apparatus Technician Apprentice assists Station Mobile Apparatus Technician to haul, operate, maintain, test, install, and repair Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nJourneyman\nThe Station Mobile Apparatus Technician hauls, operates, maintains, tests, installs, and repairs Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* OSHA regulations, chemical safety, and electrical safety related work practices\n* Rigging and fall protection\n* Bucket truck and man lift rescue\n* Utility system practices and field operation practices\n* Substation and power plant construction, safety procedures, and maintenance techniques\n* Safe operation of hand and power tools used in construction\n* Structural and mechanical drawings (i.e. elevations, plans, sections, details)\n* Heavy equipment operation (i.e. bucket truck, boom truck, backhoe, line bed, skid steer, and man lift)\n* Power transformers, load tap changers, potential and current transformers, power circuit breakers, metal-clad switchgear, circuit switchers, disconnect and air break switches, synchronous condensers, and series and shunt capacitors\n* Proper use of transit, surveying practices, and laying out station foundation baselines and elevations\n* Forming, pouring and finishing of concrete\n* Steel and aluminum welding\n* Cutting torch\n* Performance Management System, Corporate policies, Idaho Powers safety Program\n* PC use and basic software\n\nSkills in:\n\n* Strong interpersonal, verbal, and written communication\n* Problem identification\n* Problem solving\n* Troubleshooting\n* Operating test equipment\n* Basic use of personal computers using software applications such as word processing, spreadsheets, databases, and e-mail\n* Organization and time management\n\nAbility to:\n\n* Read and understand station drawings\n* Properly correct and document changes to station drawings\n* Establish and maintain effective working relationships\n* Work in a team environment, as well as independently and be self-motivated and flexible\n* Work with a high degree of accountability\n* Meet established project deadlines\n* Apply established guidelines and use good judgment and initiative in resolving work problems\n* Expected to work increasingly independently as evaluated by the Journeyman and/or Leader\n\nMINIMUM REQUIREMENTS\n\nApprentice\n\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Two years of work experience in an electrical, mechanical, maintenance, operation, or construction field\n\nJourneyman\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Five or more years work experience in an electrical, mechanical, maintenance, operation, or construction field, including at least two years of journey-level experience in substation maintenance or construction\n\nOR\n\n* Completion of a Department of Labor Office of Apprenticeship Substation program\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with an acceptable driving record based on driving requirements for the position\n* Valid DOT medical card or the ability to obtain one prior to hire\n* Valid Class A CDL or the ability to obtain one prior to hire - must obtain Double/Triple Trailers, Tank Vehicles, and Hazardous Materials CDL endorsements within 90 days\n* Certification in Telescopic Boom  Fixed Cab, Telescopic Boom  Swing Cab, Articulating Boom Crane/Load, and Overhead/Bridge Crane within 90 days\n* Must obtain First Aid/CPR card within 90 days\n\nPHYSICAL REQUIREMENTS\nThis position requires lifting up to 170 lbs., carrying up to 120 lbs., pushing up to 100 lbs., and pulling up to 180 lbs. in moving/assembling transformers. Crouching, bending/stooping, and crawling is required occasionally and sometimes in confined spaces.  Kneeling is required frequently.  Climbing of 24 foot ladders and onto transformers/equipment with fall restraint gear is performed occasionally as well as work from an elevated lift with sustained reaching.  Standing/walking is performed frequently, and sitting/driving is required up to 7 hours in duration to access job sites. Job placement is contingent upon successful completion of a pre-employment physical evaluation for the Department of Transportation (DOT) medical certificate. The above is a summary of the primary essential functions of the position. This job may require the performance of additional tasks assigned by company leaders or management. Questions regarding job requirements or accommodation requests should be directed to Human Resources.\n\nADDITIONAL REQUIREMENTS\nImmediately enroll in the Stations Technician Apprenticeship Program. Additional safety related training may be required.\n\nADDITIONAL INFORMATION\nThis position requires extensive travel across Idaho Powers service area.  The work schedule for this position may change week to week.  Typical work schedule includes four 10-hour days, and eight 10-hour days working back-to-back weeks.  Each workday may be an out-of-town, overnight stay.  This position requires the ability to work overtime and weekends when business need requires.\n\nMust abide by Idaho Power Company's safety rules and regulations. Complete required Company and safety training.\n\nCompetencies:\n\nAdaptability, Applied Learning, Communication, Decision Making, Safety Focus, Work Standards"
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-05-23T19:11:36.314Z",
        "url": "https://www.internships.com/posting/bug_38999958445",
        "lastScraped": "2021-06-22T19:11:36.314Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time"
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Georgia",
            "state": "United States"
        },
        "posted": "2021-05-23T19:11:56.842Z",
        "url": "https://www.internships.com/posting/bug_38999958445",
        "lastScraped": "2021-06-22T19:11:56.842Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5764\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the Human Resources and Talent Acquisition teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time"
    },
    {
        "position": "Station Mobile Apparatus Technician Apprentice Or Journeyman",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-05-23T19:12:17.299Z",
        "url": "https://www.internships.com/posting/bug_39002223926",
        "lastScraped": "2021-06-22T19:12:17.299Z",
        "description": "Station Mobile Apparatus Technician Apprentice or Journeyman\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$32.69 - $47.42\n\nMinimum Age Requirement:\n\nJob Description:\n\nApprentice\n\nThe Station Mobile Apparatus Technician Apprentice assists Station Mobile Apparatus Technician to haul, operate, maintain, test, install, and repair Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nJourneyman\nThe Station Mobile Apparatus Technician hauls, operates, maintains, tests, installs, and repairs Idaho Powers fleet of mobile apparatus.  Assembles, disassembles, and moves all new and used transformers in Idaho Powers system.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* OSHA regulations, chemical safety, and electrical safety related work practices\n* Rigging and fall protection\n* Bucket truck and man lift rescue\n* Utility system practices and field operation practices\n* Substation and power plant construction, safety procedures, and maintenance techniques\n* Safe operation of hand and power tools used in construction\n* Structural and mechanical drawings (i.e. elevations, plans, sections, details)\n* Heavy equipment operation (i.e. bucket truck, boom truck, backhoe, line bed, skid steer, and man lift)\n* Power transformers, load tap changers, potential and current transformers, power circuit breakers, metal-clad switchgear, circuit switchers, disconnect and air break switches, synchronous condensers, and series and shunt capacitors\n* Proper use of transit, surveying practices, and laying out station foundation baselines and elevations\n* Forming, pouring and finishing of concrete\n* Steel and aluminum welding\n* Cutting torch\n* Performance Management System, Corporate policies, Idaho Powers safety Program\n* PC use and basic software\n\nSkills in:\n\n* Strong interpersonal, verbal, and written communication\n* Problem identification\n* Problem solving\n* Troubleshooting\n* Operating test equipment\n* Basic use of personal computers using software applications such as word processing, spreadsheets, databases, and e-mail\n* Organization and time management\n\nAbility to:\n\n* Read and understand station drawings\n* Properly correct and document changes to station drawings\n* Establish and maintain effective working relationships\n* Work in a team environment, as well as independently and be self-motivated and flexible\n* Work with a high degree of accountability\n* Meet established project deadlines\n* Apply established guidelines and use good judgment and initiative in resolving work problems\n* Expected to work increasingly independently as evaluated by the Journeyman and/or Leader\n\nMINIMUM REQUIREMENTS\n\nApprentice\n\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Two years of work experience in an electrical, mechanical, maintenance, operation, or construction field\n\nJourneyman\nEducation:\n\n* High school diploma or GED and one of the following\n* Vocational degree in a mechanical maintenance, electrical, or construction discipline\n\nOR\n\n* Completion of a registered IPC Apprenticeship program\n\nOR\n\n* Completion of a related formal apprenticeship training program recognized by the Department of Labor Office of Apprenticeship\n\nOR\n\n* An equivalent combination of education, work experience, or military training\n\nExperience:\n\n* Five or more years work experience in an electrical, mechanical, maintenance, operation, or construction field, including at least two years of journey-level experience in substation maintenance or construction\n\nOR\n\n* Completion of a Department of Labor Office of Apprenticeship Substation program\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with an acceptable driving record based on driving requirements for the position\n* Valid DOT medical card or the ability to obtain one prior to hire\n* Valid Class A CDL or the ability to obtain one prior to hire - must obtain Double/Triple Trailers, Tank Vehicles, and Hazardous Materials CDL endorsements within 90 days\n* Certification in Telescopic Boom  Fixed Cab, Telescopic Boom  Swing Cab, Articulating Boom Crane/Load, and Overhead/Bridge Crane within 90 days\n* Must obtain First Aid/CPR card within 90 days\n\nPHYSICAL REQUIREMENTS\nThis position requires lifting up to 170 lbs., carrying up to 120 lbs., pushing up to 100 lbs., and pulling up to 180 lbs. in moving/assembling transformers. Crouching, bending/stooping, and crawling is required occasionally and sometimes in confined spaces.  Kneeling is required frequently.  Climbing of 24 foot ladders and onto transformers/equipment with fall restraint gear is performed occasionally as well as work from an elevated lift with sustained reaching.  Standing/walking is performed frequently, and sitting/driving is required up to 7 hours in duration to access job sites. Job placement is contingent upon successful completion of a pre-employment physical evaluation for the Department of Transportation (DOT) medical certificate. The above is a summary of the primary essential functions of the position. This job may require the performance of additional tasks assigned by company leaders or management. Questions regarding job requirements or accommodation requests should be directed to Human Resources.\n\nADDITIONAL REQUIREMENTS\nImmediately enroll in the Stations Technician Apprenticeship Program. Additional safety related training may be required.\n\nADDITIONAL INFORMATION\nThis position requires extensive travel across Idaho Powers service area.  The work schedule for this position may change week to week.  Typical work schedule includes four 10-hour days, and eight 10-hour days working back-to-back weeks.  Each workday may be an out-of-town, overnight stay.  This position requires the ability to work overtime and weekends when business need requires.\n\nMust abide by Idaho Power Company's safety rules and regulations. Complete required Company and safety training.\n\nCompetencies:\n\nAdaptability, Applied Learning, Communication, Decision Making, Safety Focus, Work Standards"
    },
    {
        "position": "Intern",
        "company": "N/A",
        "location": {
            "city": "Colorado",
            "state": "United States"
        },
        "posted": "2021-05-23T19:12:37.649Z",
        "url": "https://www.internships.com/posting/bug_38999957205",
        "lastScraped": "2021-06-22T19:12:37.649Z",
        "description": "Job Title\n\nIntern\n\nRequisition Number\n\n21-5842\n\nJob Description\n\nWe are seeking an energetic, responsible intern to join our growing organization. In this position, you will support the IT teams with special projects and administrative duties.\n\nESSENTIAL FUNCTIONS\n\n* Answer phone inquiries, direct calls, and provide basic company information; oversee mail deliveries, packages, and couriers\n* Perform clerical duties, take memos, maintain files, and organize documents; photocopy, fax, etc. as needed\n* Assist in preparing information and research materials; create and maintain PowerPoint presentations\n* Take notes and memos during meetings; type documents, drafts, and reports; sort and manage files\n* Run general industry related errands\n* Manage databases and input information, data, and records\n* Set up, break down, organize, and maintain conference rooms, training rooms, and meeting rooms; update company calendars\n* Attend company functions and networking events\n* Shadow multiple office positions and train in a variety of tasks\n\nREQUIREMENTS\n\n* Graduate Level Intern\n* Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)\n* Must be 18 years of age\n* Excellent written and verbal communication skills\n* Self-directed and able to work without supervision\n* Energetic and eager to tackle new projects and ideas\n\nWe value our team members and realize the importance of benefits for you and your family.\n\nModivCare offers a comprehensive benefits package to include the following:\n\n* Medical, Dental, and Vision insurance\n* Employer Paid Basic Life Insurance and AD&amp;D\n* Voluntary Life Insurance (Employee/Spouse/Child)\n* Health Care and Dependent Care Flexible Spending Accounts\n* Pre-Tax and Post --Tax Commuter and Parking Benefits\n* 401(k) Retirement Savings Plan with Company Match\n* Paid Time Off\n* Paid Parental Leave\n* Short-Term and Long-Term Disability\n* Tuition Reimbursement\n* Employee Discounts (retail, hotel, food, restaurants, car rental and much more!!)\n\nSalary: $14.33-$19.10 Hourly\n\nModivCare is an Equal Opportunity Employer\n\nWork Location(s)\n\nFull-Time/Part Time\n\nFull-time"
    },
    {
        "position": "Social Media & Content Intern",
        "company": "N/A",
        "location": {
            "city": "Indiana",
            "state": "United States"
        },
        "posted": "2021-05-23T19:12:57.980Z",
        "url": "https://www.internships.com/posting/bug_39002176527",
        "lastScraped": "2021-06-22T19:12:57.980Z",
        "description": "Social Media and Content Marketing InternThe Institute for Study Abroad (IFSA) was founded in 1988 as a provider of study abroad programming for U.S. undergraduates. With student success in mind, the organization creates global learning environments designed to foster the development of critical perspectives, knowledge and skills essential for students to thrive in the future. Offering more than 100 programs in 19 countries, we draw upon theory and evidence-based practice to create a variety of program models and flexible academic options in alignment with the needs of partners and students. We take our commitment to inclusive excellence, intercultural agility, individualized learning and enduring impact seriously.  We are committed to building an inclusive and equitable organization and we look for positive-minded, adaptable people from diverse communities and cultures to help us transform our industry and the students we serve.  Position Overview IFSA seeks an organized undergraduate or graduate student or recent college graduate to join our Strategic Marketing Team as Social Media and Content Marketing Intern. This position provides an exciting opportunity for professional growth and development. This role is remote and reports to the Brand Marketing Manager. The Social Media and Content Marketing Intern will complete various marketing tasks which may include, but are not limited to:  Schedule social media posts through an online scheduler tool (Salesforce Social Studio and Later.com) Research trends in social media generically, as well as in the international education space  Develop and implement a social media strategy based on current and forecasted trends  Track and analyze following, and adjust social strategy based on collected data  Run social media takeovers with partner institutions and student ambassadors Update website blog with periodic posts from student ambassadors and IFSA staff members Research keyword trends and incorporate them into website blog posts Other duties and projects, as assigned This is a part-time, paid position. In addition, we will work with you to complete the necessary paperwork so you can receive college credit for your work, if that is available at your institution.  Ideally, the internship will run for the summer term: end of April through the end of August.  The hours are flexible; however, we anticipate 15-20 hours per week.  The internship is eligible for extension, semester by semester.  The pay is $10-$12 per hour, based on experience.This position involves communication and interaction with colleagues, students and other external partners from a variety of backgrounds and communities. Every role at IFSA requires the embodiment of our commitments surrounding our dedication to Inclusive Excellence. To us, Inclusive Excellence is a devotion to building a community where the thoughts and opinions of all team members are valued.  Rather than solely defining diversity with numbers and statistics, our focus also includes building a dynamic culture where inclusivity is embraced and celebrated.   We are looking for team members who possess the dedication to and willingness to constantly improve the IFSA community to become a more inclusive environment, in addition to strive to better the world around us. Requirements, Education and Work ExperienceCurrent undergraduate or graduate student pursuing a degree in Marketing or related field such as Advertising or Journalism; or, recent college graduate seeking part-time work experience while actively securing full-time employment Demonstrated history of maintaining/growing non-personal social media accounts (i.e. businesses, clubs, or campus organizations) Experience in paid search or paid social media placements is a plus Authorized to work in the USAJob Knowledge, Skills and Abilities: Strong oral and written communication skillsMust have an understanding of U.S. college students and what drives and interests them  Experience with the major social media platforms including Facebook, YouTube, Instagram, Twitter, LinkedIn and Snapchat Ability to work effectively with multiple stakeholders from diverse communities and cultures Ability to relate to and support students with diverse lived experiences including students of color, students with mental and physical disabilities, first-generation college students, and LGBTQIA+ students Knowledge of social media analytics software including Facebook Insights, Google Analytics and Twitter Analytics to track audience engagement and campaign performance is a plus Software/technical skills: Proficiency in or an expressed willingness to learn social media scheduling tools (i.e. Social Studio, Hootsuite, Later.com) and website content management systems such as Wordpress Experience with graphic design, photo editing, video compiling and editing preferred but not required Keen attention to detail and a mature approach to communication; the ability to think strategically and creatively about solving business problems; and flexibility Physical and Work Environment  Usual office tasks such as computer work, typing, phone calls, video calls Remote position. Laptop will be provided, or you can use your own device. To Apply As an organization that is committed to the personal and intellectual development of students through global education, it is essential that our internal community reflect and reinforce the diverse perspectives and open-mindedness that we hope to instill in our students.  We hope that your background and experiences will contribute to our growing community.  In your cover letter, in addition to further sharing your experience as it relates to this role, we would like to get a sense of how you define Inclusive Excellence and how you strive to practice this value in your personal and professional life.  If possible, please share with us an experience that reflects your commitment to Inclusive Excellence.Qualified candidates should submit a cover letter and resume for this position via IFSAs career page: https://www.ifsa-butler.org/connect-with-us/ifsa-job-openings/     Review of applications will begin immediately and the position will remain open until filled.  Hiring decisions are made on the basis of an individuals qualifications, experience, overall performance and other employment-related criteria. IFSA provides equal opportunities for employment and advancement for all individuals, regardless of age, gender, ethnicity, religion, color, disability, veteran status, sexual orientation, national origin, or any other legally protected category."
    },
    {
        "position": "High Step Apprentice Or Journeyman Lineworker",
        "company": "N/A",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-05-23T19:13:18.198Z",
        "url": "https://www.internships.com/posting/bug_39002224077",
        "lastScraped": "2021-06-22T19:13:18.198Z",
        "description": "High Step Apprentice or Journeyman Lineworker\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n32.69 - 46.15 Hourly\n\nMinimum Age Requirement:\n\n21\n\nJob Description:\n\nIdaho Power  located in Twin Falls, Idaho  is looking for a High Step Apprentice or Journeyman Lineworker to join our Project team. Safety is a core value at Idaho Power and during this uncertain time we are dedicated to keeping you, our employees, and our community safe. Are you worried about starting in a new position at a new company right now?  If so, rest assured we will work with you to find a start date and onboarding timeline that works for you.\n\nIts an exciting time to work for an energy company, especially Idaho Power. We recently announced a goal of 100% clean energy by 2045. Our work plays a critical role in our customers lives and in the communities we serve across Idaho and Oregon.\n\nWhat does a High Step Apprentice or Journeyman Lineworker do for us? As a member of the Project Team, they perform new construction and maintenance work on overhead and underground distribution and transmission lines.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* Line core process of new business operations, outage response, planned and unplanned maintenance\n* Line construction methods, materials, standards, and equipment\n* Chemical safety and IPC safety program.\n\nSkills in:\n\n* Use of personal computers utilizing Microsoft products and time-entry software.\n\nAbility to:\n\n* Perform basic arithmetic calculations\n* Identify purposes of commonly encountered materials, parts, and equipment used in Lines construction\n* Maintain neat, accurate, and legible records\n* Respond to outages outside of normal working hours and work overtime at the discretion of the supervisor\n* Must have experience in energized safe work practices such as rubber gloving and hot stick work methods. Apprentice will perform this work alongside a qualified Journeyman Lineman\n* Read and understand construction drawings and diagrams, plat maps, feeder maps, and work order maps\n* Work 8-day hitch rotations &amp; 4-10 schedule depending on the business need\n* Establish positive working relationships with all team members and leadership\n* May be required to rotate crews, on an as needed basis to ensure apprentice are getting the appropriate training to complete apprentice requirements\n\nMINIMUM REQUIREMENTS\n\nHigh Step Apprentice\n\nEducation:\n\n* High school diploma or GED\n\nExperience:\n\n* Must currently be classified as an Apprentice\n* Have greater than 4,680 hours of documented OJT hours as part of a U.S. Department of Labor recognized, registered Apprentice Lineworker program\nAND\n* Have successfully completed coursework and be able to demonstrate knowledge in the areas of equipment operations and climbing skills as well as rigging, rubber gloving, hot sticks, and transformer connections through a skills assessment and a written exam\n\nLicenses &amp; Certifications:\n\n* Valid Class A CDL drivers license with acceptable driving record based on driving requirements for the position\n* Valid DOT (Department of Transportation) Medical Card or ability to obtain prior to hire\n* Must obtain First Aid/CPR card within 90 days.\n* Be capable of acquiring tanker and doubles endorsements\n* T&amp;D crews may require crossing of state lines\n* Must be 21 years an older to obtain this position\n\nJourneyman\n\nEducation:\n\n* High school diploma or GED.\n\nExperience:\n\n* Certificate of completion of an Apprentice Lineworker training program that is recognized by the Bureau of Office of Apprenticeship (OA), including at least 4 years of relevant work experience,\n\nOR\n\n* 6 years documented experience as a lineworker in distribution and/or transmission, (two of which must be documented at a journeyman level)\n\nOR\n\n* Any Idaho Power Company (IPC) employee currently or previously employed as a Journeyman Lineworker\n\nLicenses &amp; Certifications:\n\n* Valid Class A CDL drivers license with acceptable driving record based on driving requirements for the position\n* Valid DOT (Department of Transportation) Medical Card or ability to obtain prior to hire\n* Must obtain First Aid/CPR card within 90 days.\n* Be capable of acquiring tanker and doubles endorsements\n* T&amp;D crews may require crossing of state lines\n* Must be 21 years an older to obtain this position\n\nPHYSICAL REQUIREMENTS\nThis position requires the ability to work long hours performing manual labor, including occasional overhead work, lifting up to 75 lbs shoulder-height and above; occasionally lift 100 lbs chest-, waist-, and knee-high; occasionally carry items up to 125 lbs with two hands (75 lbs with one hand); occasionally push and pull weight in excess of 50 lbs; climb and work off of poles, ladders, and other structures that may be 40 to 150 ft high; work in and around energized lines; work long hours (up to 10 hours on average and occasionally up to 24 hours) in extreme weather conditions, with frequent and continuous standing/walking and occasional sitting; hike and snowshoe up to one mile; operate various all-terrain vehicles; walk on uneven terrain that may involve wet, rocky, muddy, snow-packed, or icy conditions; bend, stoop, squat, crouch, crawl, get in and out of vehicles, twist, and kneel; and balance, reach, operate foot controls, and use fine and gross hand manipulation. To ensure the manufacturer's rated capacity of climbing hooks are not exceeded, applicants body weight cannot exceed 300 lbs. Job placement is contingent upon successfully obtaining a DOT medical exam.\n\nADDITIONAL REQUIREMENTS\nAdditional safety related training may be required. Must be at least 21 years of age to meet the driving requirements as regulated by the Department of Transportation [DOT].\n\nADDITIONAL INFORMATION\nSuccessful candidate must abide by Idaho Power Company's Safety Rules and Regulations. The successful candidate will be required to work non-traditional hours, including daytime or evenings, weekdays and/or weekends. Must be able to work 4-10s, but applicants must also be able to work hitch schedules and out of town. To ensure the manufacturer's rated capacity of climbing hooks are not exceeded, applicants body weight cannot exceed 300 lbs.\n\nCompetencies:\n\nAdaptability, Collaborating, Communication, Decision Making, Safety Focus, Technical / Professional Knowledge and Skills, Work Standards"
    }
]