[
    {
        "position": "Data Science & Software Development (Python) Grad Intern",
        "company": "Apple Industries",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-01T07:15:56.607Z",
        "url": "https://www.internships.com/posting/1618dbc7-04d3-46b2-9324-a591ec3d3b3e",
        "lastScraped": "2021-03-01T07:15:56.607Z",
        "description": "<p class=\"ql-align-justify\">We are seeking an exceptional, self-motivated candidate who is eager to learn, innovate, and create something with tangible value for the millions of photo booth customers we have around the globe.  An intern at Apple Industries will have the ability to work on a new internal product that produces data storytelling and visualization of key business insights, sales analysis, and customer analysis with key responsibilities including:&nbsp;&nbsp;</p><p class=\"ql-align-justify\"><br></p><ul><li class=\"ql-align-justify\">Communicate with various teams and customers to understand gaps in business intelligence</li><li class=\"ql-align-justify\">Determine and/or create metrics to solve these gaps given data constraints/availability</li><li class=\"ql-align-justify\">Design and implement algorithms in Python to achieve these metrics</li><li class=\"ql-align-justify\">Create visual presentations of your findings and present directly to Apple Industries Executives</li><li class=\"ql-align-justify\">Ambitious candidates may also design real-time analysis and fraud-detection tools hosted in AWS&nbsp;&nbsp;</li></ul>"
    },
    {
        "position": "Software Development Engineer Internship - Directory Services",
        "company": "Smartsheet",
        "location": {
            "city": "Honolulu",
            "state": "HI"
        },
        "posted": "2021-03-01T07:16:03.979Z",
        "url": "https://www.internships.com/posting/bug_38953040893",
        "lastScraped": "2021-03-01T07:16:03.979Z",
        "description": "Job Information\n\nSmartsheet Software Development Engineer Internship - Directory Services in Honolulu, Hawaii\n\nSoftware Development Engineer Internship - Directory Services\n\nSoftware Development Engineer Internship - Directory Services Team\n\nThe Directory Services team builds capabilities that allow IT and Administrators to manage and govern their Smartsheet accounts at scale. We are challenged to improve our systems to make identity and access management easier and efficient for Administrators. One of the ways we accomplish this is to build integrations with third-party identity providers.You willhelp enhance these integration capabilities and work with our team of Software Development Engineers and product manager.\n\nYou will be a remote employee who will report to an Engineering Leader, based out of our Bellevue, WA office. This is a full-time internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nParticipate in the entire development life cycle, from requirements to release\n\n2.\n\nParticipate in requirements gathering\n\n3.\n\nDesign, develop and test the solution\n\n4.\n\nDeploy the code to production\n\n5.\n\nLead our internship Summer Project\n\nYou have:\n\n1.\n\nComputer Science degree or equivalent\n\n2.\n\nCompetency in a software development language (Java preferred)\n\n3.\n\nFamiliarity in building applications\n\n4.\n\nFamiliarity with JUnit test frameworks\n\n5.\n\nFamiliarity with REST APIs and micro services\n\n6.\n\nFamiliarity with SaaS apps and cloud hosted stacks\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. Were looking for people who are driven, authentic, supportive, effective, and honest. Youre encouraged to apply even if your experience doesnt precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who arent afraid to be innovativejoin us!\n\nDepartment\n\nEngineering - Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field"
    },
    {
        "position": "Civic Innovation Corps - Data Science Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:16:11.442Z",
        "url": "https://www.internships.com/posting/wup_488323757177362",
        "lastScraped": "2021-03-01T07:16:11.442Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States. \n \nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers. \n \n**Data Science Position Description**\n\n- Civic Innovation Corps members working on data science projects might work to clean large datasets, derive important insights using machine learning and other statistical models, and communicate those insights to their host teams. Corps members should expect a mixture of projects from data manipulation to generating data-driven reports. They should be comfortable in a highly analytical environment but also able to communicate their work to non-technical stakeholders. \n- Familiarity with any/all of the following practices: machine learning, data mining, information retrieval, natural language processing, and data visualization; \n- Perform analyses on large sets of data to extract actionable insights to drive decisions across the host team; \n- Communicate data-driven insights and recommendations to key stakeholders, both technical and non-technical; \n- Commitment to using human-centered design practices in government. \n \n**We value applicants who:**\n\n- Excel technically. Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- Are driven by our mission. You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- Work independently and carefully. You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- Are great to work with. You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Software Development Engineer Internship - Directory Services",
        "company": "Smartsheet",
        "location": {
            "city": "Honolulu",
            "state": "HI"
        },
        "posted": "2021-03-01T07:16:18.335Z",
        "url": "https://www.internships.com/posting/bug_38953040893",
        "lastScraped": "2021-03-01T07:16:18.335Z",
        "description": "Job Information\n\nSmartsheet Software Development Engineer Internship - Directory Services in Honolulu, Hawaii\n\nSoftware Development Engineer Internship - Directory Services\n\nSoftware Development Engineer Internship - Directory Services Team\n\nThe Directory Services team builds capabilities that allow IT and Administrators to manage and govern their Smartsheet accounts at scale. We are challenged to improve our systems to make identity and access management easier and efficient for Administrators. One of the ways we accomplish this is to build integrations with third-party identity providers.You willhelp enhance these integration capabilities and work with our team of Software Development Engineers and product manager.\n\nYou will be a remote employee who will report to an Engineering Leader, based out of our Bellevue, WA office. This is a full-time internship, that pays $35.00 an hour.\n\nYou will:\n\n1.\n\nParticipate in the entire development life cycle, from requirements to release\n\n2.\n\nParticipate in requirements gathering\n\n3.\n\nDesign, develop and test the solution\n\n4.\n\nDeploy the code to production\n\n5.\n\nLead our internship Summer Project\n\nYou have:\n\n1.\n\nComputer Science degree or equivalent\n\n2.\n\nCompetency in a software development language (Java preferred)\n\n3.\n\nFamiliarity in building applications\n\n4.\n\nFamiliarity with JUnit test frameworks\n\n5.\n\nFamiliarity with REST APIs and micro services\n\n6.\n\nFamiliarity with SaaS apps and cloud hosted stacks\n\nEqual Opportunity Employer:\n\nSmartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nAt Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. Were looking for people who are driven, authentic, supportive, effective, and honest. Youre encouraged to apply even if your experience doesnt precisely match our job descriptionif your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who arent afraid to be innovativejoin us!\n\nDepartment\n\nEngineering - Internships (Summer 2021)\n\nJob Location\n\nBellevue, WA or Field"
    },
    {
        "position": "EPA Bioinformatics and Data Science Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-01T07:16:28.926Z",
        "url": "https://www.internships.com/posting/cd96c04d-fdc4-4866-bab7-cece8611268c",
        "lastScraped": "2021-03-01T07:16:28.926Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Biomolecular &amp; Computational Toxicology Division (BCTD) located in Research Triangle Park, North Carolina.</p><p><br></p><p>The EPA&nbsp;CCTE is responsible for developing new experimental models that can be used to evaluate the potential for chemicals to produce adverse effects on human and ecological health for improving environmental risk assessments and regulatory decisions pertaining to chemical safety and sustainability.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This project aims to develop computational models to predict the safety of chemicals without running tests on whole animals. The tools to be used include high-throughput transcriptomic screening data across multiple cell lines, databases of previously run animal studies, data from other in vitro high-throughput screening experiments, data and models for in vitro to in vivo extrapolation of dose, and outputs of various predictive models of chemical action. The project integrates bioinformatics, data science, software engineering, applied statistics, and predictive mathematical modeling, with the broader goal of advancing safety assessment using new approach methodologies.</p><p><br></p><p>Under the guidance of a mentor, the research participant will learn to develop novel bioinformatics and biostatistics applications to integrate multiple data streams relevant to toxicological testing, including transcriptomics, biochemical assays, and other high-throughput screening methods. Research activities may include:</p><ol><li>Helping develop models to predict toxicological outcomes of animal testing from in vitro assays</li><li>Helping develop&nbsp;a data science infrastructure to simulate outcomes of tiered testing strategies that combine multiple in vitro screening methods</li><li>Learning how to curate and manage large-scale heterogeneous chemical safety screening data</li><li>Evaluating additional methods to integrate data across screening studies.</li></ol><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>This is a research training opportunity where in the candidate will gain education and training in the general areas of bioinformatics data science, transcriptomics, computational toxicology, and mathematical modeling in preparation for future career opportunities across government, industry, and academic sectors.</p><p><br></p><p>The research participant may also&nbsp;author or co-author on peer-reviewed publications, and present at local and national meetings. The participant will be a member of a multi-disciplinary research team.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentors for this opportunity&nbsp;are&nbsp;Katie Paul-Friedman (paul-friedman.katie@epa.gov) and Logan Everett (Everett.logan@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Summer Intern - Software Engineer",
        "company": "Salesforce",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-01-30T07:16:36.143Z",
        "url": "https://www.internships.com/posting/bug_38943196600",
        "lastScraped": "2021-03-01T07:16:36.143Z",
        "description": "Job Information\n\nSalesforce.com, Inc Summer 2021 Intern - Software Engineer in St. Paul, Minnesota\n\nTo get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nOur Futureforce University Recruiting program is dedicated to attracting, retaining and cultivating talent. Our interns and new graduates work on real projects that affect how our business runs, giving them the opportunity to make a tangible impact on the future of our company. With offices all over the world, our recruits have the chance to collaborate and connect with fellow employees on a global scale. We offer job shadowing, mentorship programs, talent development courses, and much more.\n\nJob Category\n\nIntern\n\nJob Details\n\nThis is your time to shine. Our software engineering interns are considered full-time employees by their peers. In fact, you will be expected to contribute right away as a member of our Engineering teams for future releases. As the world leader in enterprise cloud computing, we release 3 new versions every year with close to 100 new features each release. You will write code that reaches millions of subscribers who use a number of our applications ranging from Marketing Cloud, Service Cloud and Security to just name a few. Additionally, you will work on our automated testing infrastructure and craft the tools that provide real-time monitoring of our service. With such a quick turnaround, we dont want our interns to sit on the sidelines and enjoy the view we want you to change the way our customers connect their business to the world!\n\nAs a Futureforce intern, you will not only get to contribute to the meaningful work our teams are doing, but you will also have the opportunity to interact with senior executives and network with a number of employees at Salesforce. In addition to these impactful opportunities, ensuring that you get to participate in a number of events outside of your day-to-day duties is something that is top of mind for us. Throughout the summer, you will get to attend reoccurring Lunch and Learns where you will hear from a number of different representatives from the business about their career paths, attend events that take place outside of the office such as local Baseball games and finally, you will have the opportunity to give back to the community through a number of organized volunteer events. At Salesforce, we care deeply about the work that you do as an intern and additionally want to ensure that you are provided ample opportunities to create meaningful connections with other Salesforce employees as well as other students from across the country during your summer in the office.\n\nKey Responsibilities:\n\n*\n\nWork under the direction of software architects and senior developers on a project that you will get to present to other interns and Salesforce Developers\n\n*\n\nWork with your team members on timely and relevant projects that may be included in a future software release\n\n*\n\nContribute to our suite of automated tests and testing infrastructure\n\nRequired Skills:\n\n*\n\nEnrolled and working towards obtaining a BS or MS in Computer Science or related field. Please note that in order to be eligible for an internship, we require that you be returning to school the following quarter/semester to work towards completing your degree\n\n*\n\nMust be attending a University in North America\n\n*\n\nAcademic or professional/internship experience working in a professional coding setting is a plus\n\n*\n\nUnderstanding of object-oriented programming/design\n\n*\n\nStrong understanding of CS fundamentals and how to apply them to code\n\n*\n\nUnderstanding of algorithms and data structures and how to efficiently implement them into a solution\n\n*\n\nAbility to produce clear, efficient and concise code\n\nDesired Skills:\n\n*\n\nTeam-player with the ability to work effectively and efficiently with others\n\n*\n\nStrong analytical and problem-solving skills\n\n*\n\nCommitment to putting quality first and delivering quality solutions\n\n*\n\nBe a self-starter and possess a strong sense of self-motivation\n\n*\n\nAbility to quickly learn new technologies\n\n*\n\nCoursework in SQL and relational database concepts\n\n*\n\nStrong competency in javascript and associated frameworks\n\n*\n\nWorking knowledge of HTML and web technologies\n\n*\n\nGeneral knowledge of front end and back end languages\n\nAbout Futureforce University Recruiting\n\nOur Futureforce University Recruiting program is dedicated to attracting, retaining and cultivating talent. Our interns and new graduates work on real projects that affect how our business runs, giving them the opportunity to make a tangible impact on the future of our company.\n\nWith offices all over the world, our recruits have the chance to collaborate and connect with fellow employees on a global scale. We offer job shadowing, mentorship programs, talent development courses, and much more.\n\nFor Colorado-based roles: Minimum rate of $37.66/hr. You may also be offered benefits. More details about our company benefits can be found at the following link: https://www.getsalesforcebenefits.com/\n\nAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. (http://cloud.mail.salesforce.com/accommodations-request-form)\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFounded in 1999, Salesforce is the global leader in Customer Relationship Management (CRM). Companies of every size and industry are using Salesforce to transform their businesses, across sales, service, marketing, commerce, and more by connecting with customers in a whole new way. We harness technologies that can revolutionize companies, careers, and, hopefully, our world.\n\nSalesforce is built on a set of four core values: Trust, Customer Success, Innovation, and Equality. By making technology more accessible, we're helping create a future with greater opportunity and equality for all. This has taken our company to great heights, including being ranked by Fortune as one of the Most Admired Companies in the World and one of the 100 Best Companies to Work For eleven years in a row, and named Innovator of the Decade and one of the Worlds Most Innovative Companies eight years in a row by Forbes.\n\nThere are those who choose to work with the best and brightest. And then, there are those who want to do more than just a job. They are the ones improving lives, not only their careers. Having an impact now instead of later. Doing something thats so much bigger than themselves, an industry, and their company.\n\nWe believe everyone can be a Trailblazer. Join Salesforce and discover a future of new opportunities."
    },
    {
        "position": "Civic Innovation Corps - Data Science Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:16:43.113Z",
        "url": "https://www.internships.com/posting/wup_488323757177362",
        "lastScraped": "2021-03-01T07:16:43.113Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States. \n \nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers. \n \n**Data Science Position Description**\n\n- Civic Innovation Corps members working on data science projects might work to clean large datasets, derive important insights using machine learning and other statistical models, and communicate those insights to their host teams. Corps members should expect a mixture of projects from data manipulation to generating data-driven reports. They should be comfortable in a highly analytical environment but also able to communicate their work to non-technical stakeholders. \n- Familiarity with any/all of the following practices: machine learning, data mining, information retrieval, natural language processing, and data visualization; \n- Perform analyses on large sets of data to extract actionable insights to drive decisions across the host team; \n- Communicate data-driven insights and recommendations to key stakeholders, both technical and non-technical; \n- Commitment to using human-centered design practices in government. \n \n**We value applicants who:**\n\n- Excel technically. Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- Are driven by our mission. You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- Work independently and carefully. You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- Are great to work with. You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Data Science & Software Development (Python) Grad Intern",
        "company": "Apple Industries",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-01T07:16:50.082Z",
        "url": "https://www.internships.com/posting/1618dbc7-04d3-46b2-9324-a591ec3d3b3e",
        "lastScraped": "2021-03-01T07:16:50.082Z",
        "description": "<p class=\"ql-align-justify\">We are seeking an exceptional, self-motivated candidate who is eager to learn, innovate, and create something with tangible value for the millions of photo booth customers we have around the globe.  An intern at Apple Industries will have the ability to work on a new internal product that produces data storytelling and visualization of key business insights, sales analysis, and customer analysis with key responsibilities including:&nbsp;&nbsp;</p><p class=\"ql-align-justify\"><br></p><ul><li class=\"ql-align-justify\">Communicate with various teams and customers to understand gaps in business intelligence</li><li class=\"ql-align-justify\">Determine and/or create metrics to solve these gaps given data constraints/availability</li><li class=\"ql-align-justify\">Design and implement algorithms in Python to achieve these metrics</li><li class=\"ql-align-justify\">Create visual presentations of your findings and present directly to Apple Industries Executives</li><li class=\"ql-align-justify\">Ambitious candidates may also design real-time analysis and fraud-detection tools hosted in AWS&nbsp;&nbsp;</li></ul>"
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-01-30T07:17:00.369Z",
        "url": "https://www.internships.com/posting/ccm_13b7c4c4-46e1-4489-96ee-11422507b366",
        "lastScraped": "2021-03-01T07:17:00.369Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-01-30T07:17:07.435Z",
        "url": "https://www.internships.com/posting/ccm_13b7c4c4-46e1-4489-96ee-11422507b366",
        "lastScraped": "2021-03-01T07:17:07.435Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Faculty Opportunities at the U.S. Food and Drug Administration-NCTR",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-01-30T07:17:18.201Z",
        "url": "https://www.internships.com/posting/ccm_c7e0a26a-769a-4b58-b9f8-a1d5c27dbda7",
        "lastScraped": "2021-03-01T07:17:18.201Z",
        "description": "<p>The Oak Ridge Institute for Science and Education (ORISE) Research Participation Programs at the U.S. Food and Drug Administration (FDA) are educational and training programs designed to provide undergraduate and graduate students, post-master and post-doctoral, and faculty&nbsp;opportunities to participate in project-specific research and developmental activities at the National Center for Toxicological Research (NCTR).&nbsp;The FDA is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices; and by ensuring the safety of our nation’s food supply, cosmetics, and products that emit radiation.&nbsp;The mission of NCTR is to conduct scientific research to develop and support innovative tools and evaluation of approaches that FDA uses to protect and promote individual and public health.&nbsp;To accomplish its mission, NCTR has established three strategic goals to ensure the conduct of innovative regulatory-science research vital to FDA.&nbsp;Regulatory Science-the science of developing and establishing tools, standards, and approaches to assess the safety, efficacy, quality, and performance of regulated products-is the foundation of decision-making at FDA. The three strategic goals are:</p><ul><li>Advance scientific approaches and tools required to support public health.</li><li>Promote global interactions in regulatory science research.</li><li>Improve administrative management and develop new communication materials and methods to support HHS/FDA science goals.</li></ul><p><br></p><p>This is an open announcement to collect applicants for future research opportunities.&nbsp;The opportunities include full-time, part-time,&nbsp;and summer appointments at NCTR.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for one year, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time&nbsp;at FDA in the Jefferson, Arkansas, area. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul><p><br></p><p>See&nbsp;http://orise.orau.gov/fda/default.htm&nbsp;or&nbsp;http://www.fda.gov/&nbsp;for more information.</p>"
    },
    {
        "position": "Spring 2021: Embedded Robotics Software Engineering Intern",
        "company": "iRobot",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:17:25.311Z",
        "url": "https://www.internships.com/posting/wup_70352994405264",
        "lastScraped": "2021-03-01T07:17:25.311Z",
        "description": "**INTRODUCTION**\n\nAre you excited by the idea of making robots that are loved by millions of people all over the world? As a Floorcare Reactive Behaviors Software Engineering Intern, you will have an important hand in helping to ensure that our robots are operating at peak performance in their owners' homes. By developing and improving robotic behaviors that respond to their environment, our goal is to do just that.\n\nIf you are a consumer centric pioneer who wants to build innovative Robot products, keep reading!\nOur Floorcare Robotics Software Team is expanding and we're looking for an excellent Software Engineering Intern to join us. We're looking for someone with great interpersonal skills, passion, energy, and the desire to build.\n\n**WHAT YOU WILL DO**\n\n-   Develop tools to analyze the performance of robot behaviors\n-   Communicate findings and make recommendations\n-   Update robot behaviors for improved performance in more environments\n-   Develop physical and simulated automated tests for behaviors\n-   Collaborate across disciplines\n-   Participate in code reviews\n\n**TO BE SUCCESSFUL YOU WILL HAVE**\n\n-   A positive attitude, a strong work ethic, and self-motivation\n-   A desire to solve puzzles collaboratively\n-   Good communication and interpersonal skills\n-   Some experience with C or C++\n-   Experience with embedded software, python or SQL would be a plus\n\n**IN RETURN YOU CAN EXPECT**\n\n-   Robots! Create software that makes things happen in the real, physical world\n-   Work as part of a fun team\n-   A self contained project with results you can be proud of\n-   Mentorship from an experienced professional engineer\n-   Making a difference in products that make life easier for millions of customers every day"
    },
    {
        "position": "2021 Research & Development Intern (Biology)",
        "company": "Unilever",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-01-30T07:17:32.421Z",
        "url": "https://www.internships.com/posting/wup_179996447185498",
        "lastScraped": "2021-03-01T07:17:32.421Z",
        "description": "The R&amp;D Foods &amp; Refreshment Intern will learn about all aspects of a food company through team meetings and cross-team projects.\n\n**Duties:**\n\n- Work as part of the R&amp;D team on the development and formulation of new products and product renovation. This includes hands-on bench-top work, project research, and ingredient sourcing.\n- The R&amp;D intern must be ready to roll up their sleeves and get comfortable in an R&amp;D Lab or Kitchen.\n- Participate in cross-team workstreams such as recipe/concept ideation and innovation sessions.\n- Support the team with ordering, packing, and shipping any necessary supplies.\n\n**Internships start 5/27 and run for 10 weeks**"
    },
    {
        "position": "Civic Innovation Corps - Design Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:17:42.642Z",
        "url": "https://www.internships.com/posting/wup_265902648913595",
        "lastScraped": "2021-03-01T07:17:42.642Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States.\n\nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers.\n\n**Design Position Description**\n\nCivic Innovation Corps members working on design projects will have the opportunity to work within several different disciplines depending on the need of their host team, including graphic design, branding, UX, UI, and product design. Corps members should expect to work on a mix of projects, including those with established branding and design guidelines and those still developing their own systems. Corps members will work closely with their host teams and incorporate feedback in a constant iterative process.\n\n- Familiarity with any/all of the following practices: user experience, human-centered design, interaction design, user research, graphic design, data visualization, and service design;\n- Contribute to research synthesis to generate insights and inform design decisions;\n- Interest in using plain language to help members of the public access and interact with government services;\n- Create prototypes, design assets, and documentation;\n- Commitment to using human-centered design practices in government.\n\n**We value applicants who:**\n\n- **Excel technically.** Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- **Are driven by our mission.** You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- **Work independently and carefully.** You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- **Are great to work with.** You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Civic Innovation Corps - Product Management Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:17:49.563Z",
        "url": "https://www.internships.com/posting/wup_786731999798037",
        "lastScraped": "2021-03-01T07:17:49.563Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States. \n\nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers. \n\n**Product Management Position Description**\n\nCivic Innovation Corps members working on product management projects will have the opportunity to help develop a pre-existing or new product for their host team. Corps members should be comfortable navigating ambiguity and bureaucracy, coordinating between multiple stakeholders, and empathizing with users. Corps members should expect to ship a minimum viable product by the end of the summer. \n\n- Familiarity with any/all of the following practices: agile methodologies, developing product roadmaps, user research and testing; \n- Develop metrics and produce reports for products and initiatives; \n- Participate in the development and execution of quality assurance (QA) testing of products; \n- Assist with vendor and stakeholder management; \n- Shape product vision with user research, and turn user research insights and data into new product features or enhancements;\n- Create prototypes, design assets, and documentation; \n- Commitment to using human-centered design practices in government. \n\n**We value applicants who:**\n\n- **Excel technically.** Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- **Are driven by our mission.** You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- **Work independently and carefully.** You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- **Are great to work with.** You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Intern - Vmware Research Group - Statistical Machine Learning - Opportunity For Working Remotely",
        "company": "Vmware Incorporated",
        "location": {
            "city": "Honolulu",
            "state": "HI"
        },
        "posted": "2021-01-30T07:17:56.619Z",
        "url": "https://www.internships.com/posting/bug_38940348174",
        "lastScraped": "2021-03-01T07:17:56.619Z",
        "description": "Job Information\n\nVMware Intern - VMware Research Group - Statistical Machine Learning - Opportunity for Working Remotely in Honolulu, Hawaii\n\nBusiness Summary:\n\nVMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are building extraordinary experiences by mobilizing everything. Our customers are responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defense-in-depth approach to cybersecurity.\n\nJob Role and Responsibilities\n\nCome be part of VMwares Research Group (VRG)! With a dedicated research group, VMware continues its long tradition of research focus and academic reach. We continue VMware's history of ground-breaking, technological innovation and a culture of technical leadership and market disruption. We aim to build a community of deep and substantial relationships between academic research and the rest of the company and to maintain deep interaction and collaboration by recruiting premier researchers who are keen on driving impact.\n\nAs a research intern, your primary responsibilities would include conducting basic and applied research on important and challenging open computer science problems, along with engagement with the academic and wider research community. You have a history of research demonstrated by publications in peer-reviewed venues such as top journals and conferences. You will define and pursue creative research agendas with significant impact on both VMware and the broader research community.\n\nIn this project, you will focus on problems surrounding the intersection of Computer science, Statistics and Machine Learning.\n\nRequired Skills\n\n*\n\nYou are pursuing a PhD degree in Statistics, Computer Science, Mathematics, or equivalent field\n\n*\n\nYou should have proven ability to generate new ideas and innovate in an academic research setting.\n\n*\n\nYour research track record includes peer-reviewed research publications at top statistical or machine learning conferences.\n\n*\n\nYour current degree research showcases your implementation skills (Python especially, but R acceptable)\n\n*\n\nYou possess a strong interest in causal analysis, inference from observational data.\n\n*\n\nYou should have prior publication(s) in top-tier ML theory venues such as NeuRIPS, ICML, COLT, STOC, FOCS.\n\nPreferred Skills\n\n* You have prior degree research or industry experience working on statistical machine learning problems.\n\nCategory : University and Recent Grads\n\nSubcategory: Internships\n\nExperience: Internship\n\nFull Time/ Part Time: Full Time\n\nPosted Date: 2021-01-19\n\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape whats possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."
    },
    {
        "position": "CLIP Resident",
        "company": "CLIP-Central Louisiana Instructional Partnership",
        "location": {
            "city": "Louisiana",
            "state": "United States"
        },
        "posted": "2021-01-30T07:18:07.497Z",
        "url": "https://www.internships.com/posting/ccm_b56b55ab-d66c-4b15-9c48-f5dd6de01089",
        "lastScraped": "2021-03-01T07:18:07.497Z",
        "description": "<p><strong>Have a bachelor’s degree? Want to become a teacher?</strong></p><p>The Orchard Foundation is proud to introduce the Central Louisiana Instructional Partnership (CLIP)program. This is a 15-month teacher residency program focusing on developing middle school Math and Science teachers in high-needs schools. Residents will earn a Master of Arts in Teaching from Northwestern State University. Residents will learn best practices and how to apply technology in the classroom.</p><p><strong>The participating school districts for CLIP are Allen, Avoyelles, Catahoula, Grant, LaSalle,Natchitoches, Rapides, Vernon, and Winn.&nbsp;</strong>These school districts will host a CLIP resident for one academic school year. Residents will serve under the guidance of a mentor teacher while also completing the required graduate school coursework through Northwestern State University. All courses will be delivered online using the NSU course platform. Residents will also meet face-to-face once a month.</p><p>Once residents complete the program, there is a three-year commitment to serve. Residents will be placed in a school in one of the participating districts high-needs schools and receive coaching during the first two years.</p><p><br></p><p><strong>CLIP Incentives</strong></p><p>· Annual stipend of $36,000</p><p>· Additional stipend to cover the cost of tuition</p><p>· Books and course materials provided</p><p>· Hybrid format delivery of online courses and face-to-face monthly meetings</p><p>· Learn best practices and how to apply technology in the classroom</p><p>· Set of technology devices to use in the classroom</p><p>· Support from an Induction Coach during the first two years of teaching</p><p><strong>How to apply</strong></p><p><strong>Deadline to apply for the CLIP 2021 cohort is March 31, 2021.</strong></p><p>We have 13 spots available for the CLIP 2021 Cohort. Interviews for qualified applicants are scheduled to be held in late spring of 2021. Coursework with NSU will begin June of 2021.</p><p><strong>If you are graduating with a bachelor's degree in Spring 2021, you can apply to the program to be considered for the CLIP 2021 cohort.</strong></p><p>The CLIP program will select 13 residents each year for the next three years.</p><p>Here is the list of cohorts to apply for if you are graduating with your bachelor's on or prior to the following semester:</p><p>Fall 2020 or Spring 2021, apply for CLIP 2021 cohort</p><p>Fall 2021 or Spring 2022, apply for CLIP 2022 cohort</p>"
    },
    {
        "position": "Spring 2021: Embedded Robotics Software Engineering Intern",
        "company": "iRobot",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:18:18.619Z",
        "url": "https://www.internships.com/posting/wup_70352994405264",
        "lastScraped": "2021-03-01T07:18:18.619Z",
        "description": "**INTRODUCTION**\n\nAre you excited by the idea of making robots that are loved by millions of people all over the world? As a Floorcare Reactive Behaviors Software Engineering Intern, you will have an important hand in helping to ensure that our robots are operating at peak performance in their owners' homes. By developing and improving robotic behaviors that respond to their environment, our goal is to do just that.\n\nIf you are a consumer centric pioneer who wants to build innovative Robot products, keep reading!\nOur Floorcare Robotics Software Team is expanding and we're looking for an excellent Software Engineering Intern to join us. We're looking for someone with great interpersonal skills, passion, energy, and the desire to build.\n\n**WHAT YOU WILL DO**\n\n-   Develop tools to analyze the performance of robot behaviors\n-   Communicate findings and make recommendations\n-   Update robot behaviors for improved performance in more environments\n-   Develop physical and simulated automated tests for behaviors\n-   Collaborate across disciplines\n-   Participate in code reviews\n\n**TO BE SUCCESSFUL YOU WILL HAVE**\n\n-   A positive attitude, a strong work ethic, and self-motivation\n-   A desire to solve puzzles collaboratively\n-   Good communication and interpersonal skills\n-   Some experience with C or C++\n-   Experience with embedded software, python or SQL would be a plus\n\n**IN RETURN YOU CAN EXPECT**\n\n-   Robots! Create software that makes things happen in the real, physical world\n-   Work as part of a fun team\n-   A self contained project with results you can be proud of\n-   Mentorship from an experienced professional engineer\n-   Making a difference in products that make life easier for millions of customers every day"
    },
    {
        "position": "FDA CDER Summer 2021 Research Participation Program",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-01-30T07:18:27.723Z",
        "url": "https://www.internships.com/posting/ccm_7b3e203a-6018-4237-8095-7d88403e08f9",
        "lastScraped": "2021-03-01T07:18:27.723Z",
        "description": "<p><strong>*Although the application deadline is April 16th, mentors will start reviewing submitted applications before the deadline.</strong></p><p><br></p><p>Summer research&nbsp;opportunities&nbsp;are&nbsp;available at the U.S. Food and Drug Administration (FDA),&nbsp;Center for Drug Evaluation and Research (CDER).&nbsp;</p><p><br></p><p>The Center for Drug Evaluation and Research&nbsp;(CDER) performs an essential public health task by making sure that safe and effective drugs are available to improve the health of people in the United States.&nbsp;As part of the U.S. Food and Drug Administration (FDA), CDER regulates over-the-counter and prescription drugs, including biological therapeutics and generic drugs. CDER's mission is to protect and promote health by helping to ensure that these&nbsp;human drugs are safe and effective for their intended use, that they meet established quality standards, and that they are available to patients who need them.</p><p><br></p><p>Participants will have an opportunity to gain a&nbsp;hands-on research experience on a variety&nbsp;of regulatory research projects related to CDER's mission. The program is&nbsp;designed&nbsp;for participants to engage with&nbsp;an expert&nbsp;mentor or mentors during&nbsp;the summer to examine a&nbsp;question of interest&nbsp;related to those projects within the placement office.&nbsp;Past projects have been related to: drug metabolism, bio-statistical questions, in-vitro models for drug toxicology, safety and efficacy, benefit-risk assessments, etc.&nbsp;</p><p>Both full-time and part-time appointments are typically available. Anticipated start day is on or around May 3, 2021, but can be negotiated with the mentor to commence on any Monday throughout the summer in order to best align with school and/or vacation schedules.&nbsp;</p><p><br></p><p>Based on pandemic response, participants may be able to participate from an alternate location on a temporary basis.&nbsp;However, at the time when Mentors and FDA Staff return to their usual on-site work schedule, participants will no longer be able to conduct training from an off-site location and will be expected to report to the site in Silver Spring, Maryland or St. Louis, Missouri.</p><p><br></p><p>To avoid conflict of interest, participants cannot be placed in the same CDER program office where a relative works.</p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for&nbsp;2-3 months, but may be renewed upon recommendation of&nbsp;FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is&nbsp;part-time or full-time&nbsp;at FDA in the Silver Spring, Maryland or St. Louis, Missouri areas. Participants do not become employees of FDA, DOE or the program administrator, and there are no employment-related benefits.</p><p><br></p><p>Completion of a successful background investigation by the Office of Personnel Management is required for an applicant to be on-boarded at FDA.&nbsp;OPM can complete a background investigation only for individuals, including non-US Citizens, who have resided in the US for a total of three of the past five years.</p><p><br></p><p>FDA requires ORISE participants to read and sign their FDA Education and Training Agreement within 30 days of his/her start date, setting forth the conditions and expectations for his/her educational appointment at the agency.&nbsp;This agreement covers such topics as the following:</p><ul><li>Non-employee nature of the ORISE appointment;</li><li>Prohibition on ORISE Fellows performing inherently governmental functions;</li><li>Obligation of ORISE Fellows to convey all necessary rights to the FDA regarding intellectual property conceived or first reduced to practice during their fellowship;</li><li>The fact that research materials and laboratory notebooks are the property of the FDA;</li><li>ORISE fellow’s obligation to protect and not to further disclose or use non-public information.</li></ul>"
    },
    {
        "position": "ADMIN in international finances and Foreigners Clients",
        "company": "TriangleProperties.net",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-01-30T07:18:36.918Z",
        "url": "https://www.internships.com/posting/ccm_cee66868-ce7b-4bee-b21a-f3c5078af3ae",
        "lastScraped": "2021-03-01T07:18:36.918Z",
        "description": "<p> </p><p>candidate have to majors in finances or admin and wanted to have a carriers into that world of finances and real estate:</p><p>Number of positions available</p><p>4</p><p>Requirements</p><p>admin and very computer friendly</p><p>About&nbsp;financial Triangle Inc</p><p>global mortgage co specializing in loans to foreigners from all over the world. please see www.FinancialTriangle.com</p><p>our internship if a real One when candidate learn the world of finances and some of You will be hired before the end of the internship for along lasting final position with Ours offices all around USA. Choose, Florida California Texas or New York</p>"
    },
    {
        "position": "Civic Innovation Corps - Design Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:18:46.109Z",
        "url": "https://www.internships.com/posting/wup_265902648913595",
        "lastScraped": "2021-03-01T07:18:46.109Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States.\n\nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers.\n\n**Design Position Description**\n\nCivic Innovation Corps members working on design projects will have the opportunity to work within several different disciplines depending on the need of their host team, including graphic design, branding, UX, UI, and product design. Corps members should expect to work on a mix of projects, including those with established branding and design guidelines and those still developing their own systems. Corps members will work closely with their host teams and incorporate feedback in a constant iterative process.\n\n- Familiarity with any/all of the following practices: user experience, human-centered design, interaction design, user research, graphic design, data visualization, and service design;\n- Contribute to research synthesis to generate insights and inform design decisions;\n- Interest in using plain language to help members of the public access and interact with government services;\n- Create prototypes, design assets, and documentation;\n- Commitment to using human-centered design practices in government.\n\n**We value applicants who:**\n\n- **Excel technically.** Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- **Are driven by our mission.** You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- **Work independently and carefully.** You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- **Are great to work with.** You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Civic Innovation Corps - Product Management Internship",
        "company": "Coding it Forward",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:18:55.038Z",
        "url": "https://www.internships.com/posting/wup_786731999798037",
        "lastScraped": "2021-03-01T07:18:55.038Z",
        "description": "The Civic Innovation Corps is a paid, 10-week internship experience connecting mission-driven software engineers, data scientists, product managers, and designers to civic tech opportunities in city and state governments across the United States. \n\nAs a Civic Innovation Corps member, you will use your data and technology skills to make government more effective and efficient for all while working with a host office to improve the products and services that residents interact with every day––from data analysis and visualization of economic recovery datasets in Miami to COVID-19 evictions analysis in Los Angeles. You will also have the opportunity to participate in Corps-specific programming and professional development curated specifically for local and state context, and enjoy a community of like-minded mission-driven peers. \n\n**Product Management Position Description**\n\nCivic Innovation Corps members working on product management projects will have the opportunity to help develop a pre-existing or new product for their host team. Corps members should be comfortable navigating ambiguity and bureaucracy, coordinating between multiple stakeholders, and empathizing with users. Corps members should expect to ship a minimum viable product by the end of the summer. \n\n- Familiarity with any/all of the following practices: agile methodologies, developing product roadmaps, user research and testing; \n- Develop metrics and produce reports for products and initiatives; \n- Participate in the development and execution of quality assurance (QA) testing of products; \n- Assist with vendor and stakeholder management; \n- Shape product vision with user research, and turn user research insights and data into new product features or enhancements;\n- Create prototypes, design assets, and documentation; \n- Commitment to using human-centered design practices in government. \n\n**We value applicants who:**\n\n- **Excel technically.** Whether it’s software engineering, data science, design, or product management, you bring a valuable skill set to the table.\n- **Are driven by our mission.** You want to make a meaningful difference with your tech skills and are excited about public service and social impact.\n- **Work independently and carefully.** You are proactive and take initiative in your work, build on your ideas to produce high-quality results, and can manage multiple tasks at once.\n- **Are great to work with.** You’re collaborative and great with teams. You’ll help make the Civic Innovation Corps more inclusive for the whole cohort."
    },
    {
        "position": "Corporate Internship Program on Plasma Technology Applications (CIPPTA)",
        "company": "NSF EPSCoR CPU2AL",
        "location": {
            "city": "Alabama",
            "state": "United States"
        },
        "posted": "2021-01-30T07:19:04.226Z",
        "url": "https://www.internships.com/posting/f94cd211-e20d-4b73-aaa2-7d9fb94722ca",
        "lastScraped": "2021-03-01T07:19:04.226Z",
        "description": "<p><span>The Alabama NSF EPSCoR CPU2AL project sponsors a 10-week Corporate Internship Program on Plasma Technology Applications (CIPPTA) for students pursuing degrees in science, technology, engineering, and mathematics.&nbsp;The program provides students at&nbsp;</span><strong>CPU2AL partner institutions</strong><span>&nbsp;with quality experiences on plasma technology applications at private companies and allows students the opportunity to establish connections with industry and university professionals. It is open to undergraduate and graduate students in a broad spectrum of disciplines. The ultimate goal of the program is to engage a diverse, educated, and skilled pool of scientists and engineers to promote long-term relationships between students, academia, and industry to enhance the Alabama workforce.</span></p><p><span> For information about applying, visit </span>uah.edu/cpu2al/career-opportunities/cippta</p>"
    },
    {
        "position": "Asset Management Internship",
        "company": "Maximus",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-01-30T07:19:13.380Z",
        "url": "https://www.internships.com/posting/wup_689904271044367",
        "lastScraped": "2021-03-01T07:19:13.380Z",
        "description": "The IT Asset Management Intern is responsible for the quality delivery of services in relation to the IT Asset Management (ITAM) practice. \n \n**Familiar with IT and Accounting at basic levels**. \n\nThe ITAM team will teach processes and how to use our asset management tools. \nThe ITAM Analyst will support both tracking of physical hardware and software, and will need to be familiar, via education, and or have experience with the following: software licensing management, chassis, blade, and server, CPU, Cloud versus On Premises, inventory, leased assets, Workstation vs. Monitor, laptops and docking stations, memory and other components. \n\nThe candidate will concentrate on reviewing new orders, validating availability, ordering new assets and receiving assets. Must be a self-starter and motivated to work remotely with geographically dispersed collaboration. \n \n\n\n**Responsibilities will include:** \n\n- Update assets in Asset Management system based on requests. \n- Review and maintain CMDB (Configuration Management Database) to monitor and manage all devices and assets Identify best use through auditing of database and hardware, cross-checking of servers for relevant devices (e.g. radio's, laptops, mobile data) to meet auditing requirements. \n- Troubleshooting, analyzing and resolving issues and trends in liaison with the Service Desk, acting as a point of escalation for any issues that cannot be resolved at 1st point of contact. \n- Manage and maintain the life cycle of devices to include provisioning, repairing and decommissioning to ensure efficient and effective best use of assets. \n- Create articles for the knowledge database to ensure effective information sharing within the team. \n- Responsible for the authorized issuance, audit and return of assets \n- Responsible for managing the requests for loan hardware, including the recall of loaned items, to ensure the hardware items can be tracked and managed \n- Train users and asset owners in process and tools \n\nSince 1975, Maximus has operated under its founding mission of Helping Government Serve the People®, aimed to become a leading provider for the administration of government health and human services programs worldwide. Maximus develops high-quality solutions to reach the needs of communities on a state, federal and local government level for a growing range of services. Our projects assist in contract tracing efforts, help citizens choose and enroll in a healthcare plan, provide training to individuals for achieving employment, deliver modern and innovative answers to improving efficiencies, and more. \n\nMaximus offers the unique opportunity for our employees to positively impact people through the skills they use every day. We hire interns and recent college graduates from a wide range of majors (Social Sciences, Business, Public Policy, Government, STEM, Liberal Arts, etc.), leveraging experiences both in and outside of the traditional classroom environment. Our selection process emphasizes career readiness skills such as leadership, teamwork, critical thinking, communication and work ethic. \n\nMaximus is the place to put your passions to work!"
    },
    {
        "position": "EPA Cardiopulmonary Physiology and Toxicology Internship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-01T07:19:22.481Z",
        "url": "https://www.internships.com/posting/aed6e2f9-61bb-44ff-8b9c-26878ced876e",
        "lastScraped": "2021-03-01T07:19:22.481Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Public Health Environmental&nbsp;Assessment (CPHEA), within the&nbsp;Public Health and Integrated Toxicology Division&nbsp;(PHITD)&nbsp;located in Research Triangle Park, North Carolina.</p><p><br></p><p>PHITD research focuses on the characterization and biological mechanisms of adverse health effects of environmental pollutants. Results of this research are published in peer-reviewed journals and inform EPA’s environmental assessments and planning for air quality standards. The Division uses a variety of approaches to study toxicity of environmental pollutants, including cell cultures, animal models, and human studies. PHITD participates in several of EPA’s national research programs, especially the Air and Energy (AE) research program. Within the AE research portfolio, PHITD formulates and conducts research designed to: characterize the relationships between air quality, climate change, and adverse health effects; evaluate the health effects of energy generation and combustion products from biomass; characterize the health effects of individual major pollutants (such as ozone, nitrogen oxides, and particles) and multipollutant mixtures; assess the toxicity of pollutants near sources such as roads, ports, wildfires, and urban areas; and identify susceptibility factors of at-risk human populations (such as asthmatics and those with cardiovascular disease) who are disproportionately impacted by pollution, and characterize the effects and mechanisms of responses to specific pollutants in susceptible populations.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project addresses the growing need to assess the impacts of non-environmental factors that modify the body's response to a toxicant (e.g. air pollution). As such, investigations focus on the effects of psychosocial/noise stress or nutritional deficiency on the development of cardiovascular dysfunction. In particular, the goal is to determine how stressors modify toxicological responses and if environmental rejuvenation (e.g. greenspaces) can ameliorate the detrimental effects of exposure. We use in-vivo approaches in rodents to parallel human conditions and indicators, and assess resiliency.</p><p>Research activities may include: 1) rodent cardiopulmonary surgical techniques, 2) ultrasound echocardiography, 3) microbiome analysis, 4) cardiovascular physiology data analysis, 5) presenting study results, and 6) writing manuscripts.</p><p><br></p><p><strong><u>Learning Objectives</u>:</strong>&nbsp;While interacting with an interdisciplinary team, the research participant will have the opportunity to learn to 1) think critically regarding environmental air pollution and health concerns, and design and conduct hypothesis-driven research that addresses these issues, 2) learn rodent surgical techniques, 3) use state-of-the-art equipment to assess cardiovascular function in rodents in response to air pollution exposure using ultrasound technology, 4) perform cardiopulmonary data analysis, and 5) learn to prepare and submit manuscripts for publication in peer-reviewed journals.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is Mehdi Hazari (hazari.mehdi@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to&nbsp;three or four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Fall 2021: Robot Application Software Intern",
        "company": "iRobot",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-01-30T07:19:33.188Z",
        "url": "https://www.internships.com/posting/wup_740573991929703",
        "lastScraped": "2021-03-01T07:19:33.188Z",
        "description": "**INTRODUCTION**\n\nAre you excited by the idea of making robots that are loved by millions of people all over the world? As a Floorcare Application Software Engineering Intern, you will have an important hand in helping to ensure that our robots are operating at peak performance in the consumers' homes. By developing robotic system monitoring tools that evaluate the health of our robots around the world, our goal is to do just that. If you are a consumer centric pioneer who wants to build innovative Robot products, keep reading!\n\n**WHAT YOU WILL DO**\n\n-   Extend the use of robot health monitoring tools in place to create a visual report of robot performance over space &amp; time.\n-   Take individual robot data and represent the aggregate Robot performance across a fleet of robots.\n-   Deliver artifacts that help set the standard in your group for engineering excellence, from designs to implementations.\n-   Solve problems pragmatically, applying judgment and experience to balance trade-offs between competing interests."
    },
    {
        "position": "Marketing/Public Relations Intern",
        "company": "Family Service & Guidance Center Of Topeka, Inc",
        "location": {
            "city": "Kansas",
            "state": "United States"
        },
        "posted": "2021-03-01T07:19:42.470Z",
        "url": "https://www.internships.com/posting/bug_38954234991",
        "lastScraped": "2021-03-01T07:19:42.470Z",
        "description": "Back to Careers Apply Marketing/PR Internship Department: Marketing Job Status: Temporary  FLSA Status: Non-Exempt Reports to: Marketing &amp; Development Director Positions Supervised: None Amount of Travel Required: Occasional Work Schedule: Monday-Friday, 40 hours/week and occasional evening and weekend work may be required. Rate of Pay: $9.00/hr.; Work may also be completed for college credit. Position Summary We are seeking a creative, enthusiastic student to fill a full-time summer internship position (beginning May 17 or 24 through August 13, 2021) with our Marketing &amp; Development team. For the right individual, it will be an opportunity to gain hands-on experience with a large non-profit organization, not to mention, build your resume. The Marketing/PR Intern will assist with the planning and execution of marketing, advertising, fundraising and public relations functions. Duties may include, but are not limited to: Assisting with planning and execution FSGC's signature fundraising event - Works of Heart, which raised over $107,000 last year. Writing/editing copy for internal and external websites and e-newsletter. Conducting research for future marketing and communications projects. POSITION QUALIFICATIONS Education/Licensure: Must be at least a second year college student, actively enrolled . Major must include PR/Marketing, Advertising, Mass Media, Graphic Design and/or Communication Studies. Must successfully pass the KBI and DCF Central Registry and all other background investigations. Experience: Experience in graphics and layout is a plus. Excellent computer skills including MS Office Word, Excel and Outlook preferred. Submit your application for consideration at FSGCtopeka.com/careers by Friday, March 12. Interviews will be conducted on Thursday, March 18 and Friday, March 19. WORK ENVIRONMENT Minimal risk of exposure to aggressive and/or acting out (verbal and physical) children and youth. Position requires long periods of sitting, continual use of the keyboard and personal computer and/or speaking on the telephone. Ability to perform duties as required in a fast-paced office environment. The company has reviewed this job description to ensure that essential functions and basic duties have been included. It is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Supervisors as deemed appropriate may assign additional functions and requirements. This document does not represent a contract of employment, and the company reserves the right to change this job description and/or assign tasks for the employee to perform, as the company may deem appropriate. Apply For the best user experience please use one of the following supported browsers: IE10+, FireFox, Chrome, or Safari."
    },
    {
        "position": "Fall 2021: Robot Application Software Intern",
        "company": "iRobot",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-01-30T07:19:51.465Z",
        "url": "https://www.internships.com/posting/wup_740573991929703",
        "lastScraped": "2021-03-01T07:19:51.465Z",
        "description": "**INTRODUCTION**\n\nAre you excited by the idea of making robots that are loved by millions of people all over the world? As a Floorcare Application Software Engineering Intern, you will have an important hand in helping to ensure that our robots are operating at peak performance in the consumers' homes. By developing robotic system monitoring tools that evaluate the health of our robots around the world, our goal is to do just that. If you are a consumer centric pioneer who wants to build innovative Robot products, keep reading!\n\n**WHAT YOU WILL DO**\n\n-   Extend the use of robot health monitoring tools in place to create a visual report of robot performance over space &amp; time.\n-   Take individual robot data and represent the aggregate Robot performance across a fleet of robots.\n-   Deliver artifacts that help set the standard in your group for engineering excellence, from designs to implementations.\n-   Solve problems pragmatically, applying judgment and experience to balance trade-offs between competing interests."
    },
    {
        "position": "Generation Specialist Apprentice I, II Or Journeyman - Hydro Maintenance",
        "company": "Idaho Power Company",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-03-01T07:20:01.309Z",
        "url": "https://www.internships.com/posting/bug_38948057907",
        "lastScraped": "2021-03-01T07:20:01.309Z",
        "description": "Generation Specialist Apprentice I, II or Journeyman - Hydro Maintenance\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$27.14 - $47.42\n\nMinimum Age Requirement:\n\n21\n\nJob Description:\n\nIdaho Power is looking for a Generation Specialist Apprentice I, II or Journeyman  Hydro Maintenance for our Hells Canyon, Oregon location.\n\nIts an exciting time to bring your skills to Idaho Power. We recently announced a goal of 100% clean energy by 2045, and our work plays a critical role in the communities we serve across Idaho and Oregon. We're looking for hard-working, hands-on problem solvers to keep our equipment and systems running smoothly as we continue to provide safe, reliable, affordable energy.\n\nWhat does a Generation Specialist Apprentice I, II or Journeyman do for us? Under limited supervision: The Apprentice I and II performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities. The Journeyman performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities and Completes assigned tasks and assumes a lead role when required.\n\nIn addition to the meaningful work we do, we offer work-life balance, competitive pay and benefits, and both a 401k employer-match and a pension plan, making Idaho Power one of the best employers in the state.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* Basic electricity and the function, operation, troubleshooting and repair of complex equipment through use of drawings and instructional manuals\n\nSkills in:\n\n* Skills in maintenance of power plants\n* Inspection and maintenance of heavy equipment\n* Basic welding and fabrication\n* Basic computing\n* Personal communication\n* Interactive teamwork\n* Conflict resolution\n\nAbility to:\n\n* Ability to maintain high productivity with minimal supervision\n* Perform heavy manual labor in adverse conditions\n* Communicate effectively\n* Establish positive working relationships in a team-based environment\n* Respond to emergencies in excess of normal working hours\n* Perform other duties/tasks as assigned\n\nMINIMUM REQUIREMENTS\n\nApprentice I\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nApprentice II\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nAND\n\n* Enrollment in a Generation Apprenticeship Training Program\n\nOR\n\n* A combination of education and work experience that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Six months of power plant experience\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nJourneyman\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Certificate of completion of a Generation Specialist training program that is recognized by the Bureau of Office of Apprenticeship (OA)\n* At least three years of relevant work experience in power plant operations and/or maintenance\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nPHYSICAL REQUIREMENTS\nThis job will require occasional, physically strenuous work for long periods of time and in adverse conditions. Job requires the ability to bend, stoop, squat, crouch, crawl, climb into and out of vehicles, twist, kneel, balance and reach, and climb multiple flights of stairs. Occasionally lifting items weighing 75 lbs. shoulder height and above; occasionally lifting items weighing up to 100 lbs. waist high and knee high. Occasionally using exertional force up to 50 lbs. to push/pull cable, etc. Occasionally carrying items weighing up to 100 lbs. with two hands and occasionally carrying items weighing up to 75 lbs. with one hand. Requires the ability to operate a vehicle. Must be able to grasp and hold simple hand tools and testing equipment and use fine motor skills to use a computer keyboard, test equipment, and replace parts. Applicant must be able to perform the essential functions of the job with reasonable accommodation and without posing a direct threat of harm to self, others, or property. Job placement is contingent upon successful completion of a pre-employment DOT medical exam.\n\nADDITIONAL REQUIREMENTS\nMust be at least 21 years of age in when working in Hells Canyon. HCC employees required to complete respirator fit test after hire.\n\nADDITIONAL INFORMATION\nRequires occasional travel with overnight stays. Job requires the employee to obtain and wear approved safety footwear and FR clothing.\n\nCompetencies:\n\nAdaptability, Building Customer Loyalty, Communication, Contributing to Team Success, Decision Making, Initiating Action, Innovation, Managing Work (includes Time Management), Quality Orientation, Safety Awareness"
    },
    {
        "position": "Growth Marketing Intern- TikTok and Other Social Media Accounts",
        "company": "SparkNode",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-01T07:20:10.806Z",
        "url": "https://www.internships.com/posting/ccm_196492b7-04d2-4eba-b387-c1d0493e9ba6",
        "lastScraped": "2021-03-01T07:20:10.806Z",
        "description": "<p>Do you have a knack for creative solutions with a strong sense of organization? SparkNode is looking for a Growth Marketing Intern to join our startup team!</p><p>⁎ Duration: ~6 months</p><p>⁎ Start date: Immediate&nbsp;&nbsp;</p><p><br></p><p>What you will be doing in this role:&nbsp;</p><p>⁎ Strategize and execute outreach campaigns to grow user base</p><p>⁎ Social media management including TikTok, Facebook and Instagram</p><p>⁎ Lead content creation with your creative ideas and skills for social media</p><p>⁎ Conduct marketing and press research&nbsp;</p><p>⁎ Perform ad hoc marketing support</p><p><br></p><p>What we offer:&nbsp;</p><p>⁎ Flexible working arrangements&nbsp;</p><p>⁎ Opportunities for learning and development&nbsp;&nbsp;</p><p>⁎ Work closely with co-founders who have strong background in business and data science.</p><p><br></p><p>Additional Information&nbsp;</p><p>⁎ Job Level: Internship&nbsp;</p><p>⁎ Experience Level: Entry Level&nbsp;</p><p><br></p><p>⁎ Job Category: Marketing&nbsp;</p><p>⁎ You will work remote, but maintain close communication with co-founders.</p>"
    },
    {
        "position": "Generation Specialist Apprentice I, II Or Journeyman - Hydro Maintenance",
        "company": "Idaho Power Company",
        "location": {
            "city": "Idaho",
            "state": "United States"
        },
        "posted": "2021-03-01T07:20:20.595Z",
        "url": "https://www.internships.com/posting/bug_38948057907",
        "lastScraped": "2021-03-01T07:20:20.595Z",
        "description": "Generation Specialist Apprentice I, II or Journeyman - Hydro Maintenance\n\n\n\nJob Type:\n\nRegular\n\nJob End Date:\n\nExemption Status:\n\nNon-Exempt\n\nPay Range:\n\n$27.14 - $47.42\n\nMinimum Age Requirement:\n\n21\n\nJob Description:\n\nIdaho Power is looking for a Generation Specialist Apprentice I, II or Journeyman  Hydro Maintenance for our Hells Canyon, Oregon location.\n\nIts an exciting time to bring your skills to Idaho Power. We recently announced a goal of 100% clean energy by 2045, and our work plays a critical role in the communities we serve across Idaho and Oregon. We're looking for hard-working, hands-on problem solvers to keep our equipment and systems running smoothly as we continue to provide safe, reliable, affordable energy.\n\nWhat does a Generation Specialist Apprentice I, II or Journeyman do for us? Under limited supervision: The Apprentice I and II performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities. The Journeyman performs the necessary maintenance functions essential for the safe and efficient operation of the area plants and facilities and Completes assigned tasks and assumes a lead role when required.\n\nIn addition to the meaningful work we do, we offer work-life balance, competitive pay and benefits, and both a 401k employer-match and a pension plan, making Idaho Power one of the best employers in the state.\n\nREQUIRED SKILLS\n\nKnowledge of:\n\n* Basic electricity and the function, operation, troubleshooting and repair of complex equipment through use of drawings and instructional manuals\n\nSkills in:\n\n* Skills in maintenance of power plants\n* Inspection and maintenance of heavy equipment\n* Basic welding and fabrication\n* Basic computing\n* Personal communication\n* Interactive teamwork\n* Conflict resolution\n\nAbility to:\n\n* Ability to maintain high productivity with minimal supervision\n* Perform heavy manual labor in adverse conditions\n* Communicate effectively\n* Establish positive working relationships in a team-based environment\n* Respond to emergencies in excess of normal working hours\n* Perform other duties/tasks as assigned\n\nMINIMUM REQUIREMENTS\n\nApprentice I\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nApprentice II\n\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nAND\n\n* Enrollment in a Generation Apprenticeship Training Program\n\nOR\n\n* A combination of education and work experience that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Six months of power plant experience\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nJourneyman\nEducation:\n\n* High school diploma or GED\n\nAND\n\n* Appropriate education and/or work experience in electrical, generation, power plants, mechanical, hydraulic, or welding that provides the desired knowledge, skills, and abilities\n\nExperience:\n\n* Certificate of completion of a Generation Specialist training program that is recognized by the Bureau of Office of Apprenticeship (OA)\n* At least three years of relevant work experience in power plant operations and/or maintenance\n\nLicenses &amp; Certifications:\n\n* Valid driver's license with acceptable driving record based on driving requirements for the position\n* The ability to obtain a Class A commercial driver's license (CDL) within six months\n* DOT medical card prior to hire\n\nPHYSICAL REQUIREMENTS\nThis job will require occasional, physically strenuous work for long periods of time and in adverse conditions. Job requires the ability to bend, stoop, squat, crouch, crawl, climb into and out of vehicles, twist, kneel, balance and reach, and climb multiple flights of stairs. Occasionally lifting items weighing 75 lbs. shoulder height and above; occasionally lifting items weighing up to 100 lbs. waist high and knee high. Occasionally using exertional force up to 50 lbs. to push/pull cable, etc. Occasionally carrying items weighing up to 100 lbs. with two hands and occasionally carrying items weighing up to 75 lbs. with one hand. Requires the ability to operate a vehicle. Must be able to grasp and hold simple hand tools and testing equipment and use fine motor skills to use a computer keyboard, test equipment, and replace parts. Applicant must be able to perform the essential functions of the job with reasonable accommodation and without posing a direct threat of harm to self, others, or property. Job placement is contingent upon successful completion of a pre-employment DOT medical exam.\n\nADDITIONAL REQUIREMENTS\nMust be at least 21 years of age in when working in Hells Canyon. HCC employees required to complete respirator fit test after hire.\n\nADDITIONAL INFORMATION\nRequires occasional travel with overnight stays. Job requires the employee to obtain and wear approved safety footwear and FR clothing.\n\nCompetencies:\n\nAdaptability, Building Customer Loyalty, Communication, Contributing to Team Success, Decision Making, Initiating Action, Innovation, Managing Work (includes Time Management), Quality Orientation, Safety Awareness"
    },
    {
        "position": "Client Consulting Associate (Summer 2021 Undergraduate Intern)",
        "company": "Visa",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-01T07:20:30.069Z",
        "url": "https://www.internships.com/posting/wup_70084763188728",
        "lastScraped": "2021-03-01T07:20:30.069Z",
        "description": "**COMPANY DESCRIPTION**\n\nAs the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.\n\nAt Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.\nYOU'RE an Individual. WE'RE the team for you. TOGETHER, let's transform the way the world pays.\n\n**JOB DESCRIPTION**\n\nPLEASE NOTE: This summer internship role will be fully virtual. Application deadline is 3/5/2021, interviews mid March, offers out by end of March.\n\nThe Visa Consulting and Analytics team is looking for interns to support the team on strategic consulting engagements.The ideal candidate is a highly analytical individual ideally with previous business experience.\nTypical projects may include:\n\n-   How does a financial institution increase market share in consumer credit cards?\n-   How should a credit card issuer use emerging technology to acquire the best customers?\n-   How does a financial institution grow their credit card portfolio while mitigating credit risk?\n-   How does a financial institution optimize their product offering?\n\n**RESPONSIBILITIES:**\n\n-   Play an integral role on a team of experienced professionals in delivering strategic consulting services to key Visa clients\n-   Complete consulting engagements with other team members, including participating in interviews, analyzing confidential client data, and summarizing key findings\n-   Conduct industry research and identify internal and external data resources to create custom analytics\n-   Complete detailed analysis on client data and identify preliminary trends and themes in the data\n-   Develop client-specific presentations which address executive needs and deliver presentations to clients and internal Visa partners\n\n**WORK AUTHORIZATION:**\n\n-   Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.\n\n**LOCATION:**\n\n-   Remote - Virtual internship\n-   By applying to this position,you are open to working in one of the following locations if you receive a full time return offer: Foster City, CA; San Francisco, CA; Ashburn, VA; New York City; Atlanta, GA.\n\n**WORK HOURS:**\n\n-   Incumbent must make themselves available during core business hours.\n\n**TRAVEL**\n\n-   No travel required\n\n**PHYSICAL REQUIREMENTS**\n\n-   This position will be performed in an at-home office setting.The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms.\n\n**EEOC**\n\n-   Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law."
    },
    {
        "position": "Student Intern It , Gs",
        "company": "US Government",
        "location": {
            "city": "Honolulu",
            "state": "HI"
        },
        "posted": "2021-03-01T07:20:39.369Z",
        "url": "https://www.internships.com/posting/bug_38953147651",
        "lastScraped": "2021-03-01T07:20:39.369Z",
        "description": "Student Intern (IT), GS-2299-04 (SUMMER INTERN) \n          Department of Commerce Overview \n          Accepting applications\n         \n          Open &amp; closing dates\n          02/18/2021  to  02/26/2021 \n          Service\n          \n          Excepted\n          \n          Pay scale &amp; grade\n          \n          GS 04\n          \n          Salary\n          $32,501 to $42,250 per year \n          Appointment type\n          \n          Summer - Not to Exceed (NTE) September 30, 2021. This position may be extended in 1 year increments.\n          \n          Work schedule\n          \n          Full-Time\n          Locations Few vacancies in the following locations: \n          Barrigada, GU \n          \n          Honolulu, HI \n          \n          Relocation expenses reimbursed\n          \n          No\n          \n          Telework eligible\n          \n          Yes as determined by agency policy\n          This job is open to \n          Students\n          \n          Current students enrolled in accredited educational institutions from high school to graduate level. Includes internships, pathways and other student programs.\n          Clarification from the agency \n          Students who are currently enrolled in an accredited educational institution in good academic standing. Good academic standing is determined by the educational institution, but is typically a Grade Point Average of a 2.0 on a 4.0 scale. Applicants must provide proof of current enrollment in school and documentation indicating acceptance in an accredited educational institution (if applicable).\n          Share\n     Announcement number \n          NWS-2021-0048\n          Control number \n          592642000\n          \n          Duties\n          Duties  Summary This Summer Internship opportunity will start no sooner than April 2021. Please note that if you are a Spring or Summer 2021 graduate, you will not be eligible for this Internship opportunity unless you are accepted for enrollment at a qualifying educational institution seeking an additional degree (diploma, Certificate, degree program, etc.) or an advanced degree.  You must submit proof of acceptance along with your current transcripts for consideration.  Responsibilities NOAA is seeking bright, innovative, results-oriented students who are pursuing a degree or certificate program in an accredited educational institution for our Summer Intern Program.  The NOAA Summer Intern Program targets students currently enrolled (or currently enrolled and accepted for enrollment) in a degree-seeking or Certificate program at least on a half-time basis. (Applicants who do not meet the definition of student by the closing date of the announcement will not be considered). Due to the current global situation, applicants may be eligible to work remotely. This is depending on the hiring office's needs and will be worked out on a case by case basis. *Travel, transportation, and relocation expenses will not be paid.  All travel, transportation, and relocation expenses associated with reporting for duty in this position will be the sole responsibility of the selected employee. Salary ranges will vary based on the location. Please visit:   for specific salary information related to a specific location. Cost of Living Allowance (COLA) for Honolulu, HI is 10.28%, and 12.62% for Barrigada, Guam and is not federally taxed. The COLA is not reflected in the locality salary shown in this vacancy announcement. COLAs are exempt from Federal income taxes; post differentials are not. Post Differential may be authorized for hires outside of the local area. May be eligible to applicants from the mainland, Alaska, or Hawaii. You may be entitled to 20% post differential allowance in addition to the salary for Guam. Post differentials are not exempt from Federal income taxes. Performs basic and clerical IT assignments, such as providing IT support for local and remote users; tracking and documenting customer support tickets; providing basic IT information to other employees within the office; maintaining incident databases; performing basic maintenance on different equipment and technology; participating in IT security tests; installing commercial software and hardware on government computers; observing the work of higher-grade specialists; and assisting higher-level specialists in more complex and intricate tasks. This position is not in the bargaining unit. Travel Required Not required \n          Supervisory status\n          \n          No\n          \n          Promotion Potential\n          \n          04\n          Job family (Series) \n          Requirements\n          Requirements  Conditions of Employment Must be a U.S. Citizen or National to apply. Required to pass a background investigation and fingerprint check. Must be suitable for Federal employment. Must be registered for Selective Service, if applicable (www.sss.gov) Must sign a Pathways Programs Participant Agreement. A minimum one year trial period will be required. Must be at least 16 years of age at the time of appointment. Upon successful completion of the Pathways Internship Program and completion of their academic degree or Certificate program, individuals may be non-competitively converted to a term position or permanent position in the Competitive Service. (see Other Information). ELIGIBILITY REQUIREMENTS: Intern and Interns NTE must:  Be accepted for enrollment or enrolled and seeking a degree or certificate in a   on a half-time to full-time basis (as determined by the educational institution);  Meet the definition of a student throughout the duration of their appointments;  Meet agency-specific requirements as specified in the agency's Participant Agreement with the Intern and;  Meet the qualification standards (e.g., series and grade) for position. Applicants must demonstrate proof of enrollment for the Spring 2021 or equivalent term, by submitting an official proof of enrollment letter from a   or a transcript indicating courses to be taken in the Spring 2021 or equivalent term. Unofficial transcripts are acceptable. NOTE: This vacancy may be used to fill other Student Intern (IT), GS-2299-04 positions throughout NOAA. The position must be alike (e.g.: the same qualifications and eligibility requirements as indicated in this vacancy announcement).  Qualifications Qualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards.  This handbook is available on the Office of Personnel Management's website located at:  . Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. To qualify at the GS-04 level: Completion of 2 full academic years of post-high school study or an associate's degree. OR Previous related education and/or experience. Special Provisions/or Interns with Previous Related Education or Experience.  Previous education and/or experience may be evaluated to determine the highest grade level for which the individual is qualified.  Education Definition of Student:  Student is defined as an individual accepted for enrollment or enrolled and seeking a degree (diploma, or certificate) in a qualifying academic institution, on a half or full-time basis.  Half-time is defined by the educational institution in which the student is enrolled.  Students do not have to be in actual physical attendance in school, online curriculums are acceptable as long as the school is accredited by the Department of Education. All academic degrees or course work must be completed in an educational institution that has obtained accreditation from an accrediting body recognized by the U.S. Department of Education.  For a list of schools that meet this criteria, see  .  College Transcript:   Applicants must submit a copy of their college transcript that lists college courses, course title, and number of credit hours. You may submit an unofficial copy of the transcript at the initial phase of the application process, but an official certified copy must be received before you can report to duty. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.   Additional information can be found here:   . Proof of Enrollment:   NOAA will use applicant's transcript as proof of enrollment in the identified college/university provided it demonstrates definition of eligible student. A letter from an educational institution indicating acceptance may be used as proof of enrollment for those students who are continuing studies at a new college or university or for those student whose transcripts do not reflect in-progress courses. An official transcript will be required before you can report to duty. Additional information PROGRAM COMPLETION AND CONVERSION:  For both Intern and Intern NTE, agencies have the discretion to consider interns for non-competitive conversion to term or permanent positions in the competitive services, provided that the intern has met all academic and Program requirements, and are within 120 days of academic program completion.  There is no guarantee for conversion. To be eligible for conversion, an Intern or eligible Intern NTE must:  Be a United States citizen or national;  Complete at least 640 hours of work experience acquired through the Program while enrolled as a half-time or full-time degree or certificate seeking student;  Complete a course of academic study, within the preceding 120-day period, at a qualifying educational institution conferring a diploma, certificate or degree;  Meet the qualification standards for the position to which she or he will be converted;  Receive a favorable recommendation by an official of the agency or agencies in which she or he served; and   Meet agency-specific requirements, as specified in the Participant Agreement. NOAA participates in e-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees.  How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above. \n          Your resume, supporting documents and responses to the online questionnaire will be reviewed to determine if you meet eligibility and minimum qualification requirements. Veterans preference applies to all selections made under the Pathways authority in accordance with CFR, Part 302.  To preview questions please  . Background checks and security clearance Security clearance Drug test required \n          No\n          \n          Required Documents\n          Required Documents The following documents are required for your application to be complete.  Our office cannot be responsible for incompatible software, illegible fax transmissions, delays in mail service, your system failure or downtime, etc.  Encrypted documents will not be accepted. Resume  must include: 1) personal information; to includes address 2) education; 3 work experience including work schedule, hours worked per week, dates of employment; and title, series and grade, if applicable; 4) supervisors phone number, e-mail address for each work period listed, and whether or not we may contact them for reference checks; and 5) other qualifications, such as unpaid volunteer work experience. Proof of enrollment  in school or acceptance of enrollment stipulating that you are in good academic standing. A copy of your most recent transcripts  which show your field of study, school name, students name, current GPA or academic standing, past and current course work, degree program, and major/concentration; an unofficial copy is sufficient with the application provided it contains the required information.  If selected, an official college transcript will be required prior to entering on duty.   You must submit the document below if you claim any of the following: If you are a veteran with preference eligibility and you are claiming 5-points veterans' preference,  you must submit a copy of your Member 4 DD-214 stating disposition of discharge or character of service or other valid proof of eligibility (i.e., statement of service that shows service dates AND character of service).  If you are claiming 10-point veterans' preference,  you must also submit an SF-15, \"Application for 10-Point Veterans' Preference\"  plus the proof required by that form.  For more information on veterans' preference see . Active Duty Service Members  You must submit a statement of discharge/certification of release or an official written document from the armed forces that certifies you are expected to be discharged or released from active duty service in the armed forces under honorable conditions no later than 120 days from the date the announcement closes. Enlisted Record Briefs and military identification do NOT qualify as official documentation. If the appropriate information is not submitted to confirm the discharge status, dates of service, etc., you will not be considered for this job opportunity under Veteran Preference procedures. To gain access to your DD-214 online please visit  . Failure to provide all of the required documents as stated in this vacancy announcement may result in lost consideration, an ineligible rating, or may affect the overall rating. \n          If you are relying on your education to meet qualification requirements:\n          \n          Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n          .\n          \n          Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n          \n          Benefits\n          Benefits \n          A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding.  .\n          NOAA offers a comprehensive benefits package that includes, in part, paid vacation; sick leave; holidays; life insurance; health benefits; and participation in the Federal Employees Retirement System.  This link provides an overview of the benefits currently offered to Federal employees:   .  Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered. \n          How to Apply\n          How to Apply Your complete application, including required documents, must be received by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. To apply on-line, you must complete and submit an application by accessing the USAJOBS website at http://www.usajobs.gov. To begin, click the Apply Online button near the bottom of this screen and follow the prompts to register into your USAJOBS account, answer the questions, and submit all required documents. To return to your saved application, log in to your USAJOBS account at http://www.usajobs.gov and click on \"Application Status.\" Click on the position title, and then select Apply Online to continue. If you have problems completing your on-line application, including problems submitting your supporting documents, please contact the Help Desk by e-mail at mgshelp@monster.com or by phone at (866) 656-6831. The help desk is available Monday-Friday, 7:00 a.m. to 7:00 p.m. ET For instructions on submitting your application in an alternate format, please contac"
    }
]