[
    {
        "position": "Cutting Edge Computer Science Internship",
        "company": "The Rise Network",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:49:46.912Z",
        "url": "https://www.internships.com/posting/ccm_6794e696-2359-4d39-9547-a4f4c1163bb6",
        "lastScraped": "2021-04-07T07:49:46.912Z",
        "description": "<p>The Rise Network has an internship opportunity for creative and imaginative Computer Science majors who are interested in utilizing their skills to assist in setting the pace and leading the pack through our multi-media entertainment network.</p><p></p><p>Candidates must be forward-thinking and possess a strong knowledge and understanding of the digital media landscape, including AI and various social media websites functionalities.</p><p></p><p>Interns for this position will need strong critical thinking skills in order to integrate into our vibrant and passionate team.&nbsp;We are very excited to share this exciting experience with interns who are hoping to gain online and real world, hands on experience.</p><p></p><p>This is a year-round internship that works according to the intern’s availability that provides students with an opportunity to enhance their learning experience in their field(s) of interest.</p><p></p><p>This is a non-paid internship that will become a paid internship; however, only academic credit is currently available.</p>"
    },
    {
        "position": "Computer Programming Instructor (Intern-Unpaid/Part-Time)",
        "company": "IQuition Intuitive Learning",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:49:50.139Z",
        "url": "https://www.internships.com/posting/1668078a-d4ec-49b5-b6f5-5267cd1a354a",
        "lastScraped": "2021-04-07T07:49:50.139Z",
        "description": "<p><br></p><p><strong>We are a team of technology &amp; education experts with the mission to inspire the next generation of technologists.&nbsp;</strong></p><p><br></p><p><strong>IQuition</strong>&nbsp;offers Block-based, Text-based and Advanced Coding Programs for kids of all ages, grade levels and prior&nbsp;coding experience levels. Learn all about IQuition’s Intuitive and Fun Game Design &amp; Coding Courses and Curriculum on www.IQuition.com</p><p><br></p><p><strong>THE IQuition APPROACH</strong></p><ul><li><strong>Personalized Learning Pathway:&nbsp;</strong>Every IQuition student follows a customized pathway based on his/her strengths, goals, motivation and individual learning pace.</li><li><strong>Performance-based Achievement Levels:&nbsp;</strong>Our performance-based assessments measure the student's ability to apply their knowledge and every student must demonstrate the mastered skills to progress to the next level.</li><li><strong>Competency-based Progression:&nbsp;</strong>We continually assess every student’s progress towards their individual goals.</li><li><strong>Reward and Incentive System:&nbsp;</strong>The students are rewarded whenever they achieve a learning milestone and demonstrate mastery.</li></ul><p><br></p><p><br></p><p><strong><u>Your Responsibilities:</u></strong></p><ul><li>Teach coding/programming to kids ages 7-16 (Scratch, Python, Minecraft Programming)</li><li>Once weekly online class with a student on Microsoft Teams.</li><li>Complete weekly student progress report.</li></ul><p><br></p><p><br></p>"
    },
    {
        "position": "Computer Science Intern - REMOTE",
        "company": "Zsquare Solutions Inc",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:49:53.226Z",
        "url": "https://www.internships.com/posting/ccm_5cb1fc02-8589-493a-bf79-e259dd102565",
        "lastScraped": "2021-04-07T07:49:53.226Z",
        "description": "<p><span>We are looking for INTERNS to join our software teams. The right candidate will work alongside our software teams to support our services. This is an excellent opportunity to gain experience in software engineering and exposure to various technologies.</span></p><p><br></p><p><br></p><p><strong>Duties and Responsibilities</strong></p><p><br></p><ul><li><span>Work closely with software engineers and learn how to develop robust, scalable, production-level systems.</span></li><li><span>Involvement at all stages of development, from design to implementation, test, documentation, and deployment.</span></li></ul><p><br></p>"
    },
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:49:56.434Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-04-07T07:49:56.434Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>"
    },
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:49:59.555Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-04-07T07:49:59.555Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>"
    },
    {
        "position": "Research Internship - Summer 2021 (NLP, Computer Vision, or Machine Learning)",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-08T07:50:12.893Z",
        "url": "https://www.internships.com/posting/sam_i-7OwbC4bPioyiY9KLTrmIZsPJCcS6RGduXUa1E_6PO0vMj2e5qUSQ",
        "lastScraped": "2021-04-07T07:50:12.893Z",
        "description": "Type: Internship\n<br>Experience: PhD/Graduate Students\n<br><br>\nWho we are:<br>\nDataminr puts real-time AI and public data to work for our clients, generating relevant and actionable alerts for global corporations, public sector agencies, newsrooms, and NGOs. Our leading AI platform detects the earliest signals of high-impact events and emerging risks from vast amounts of publicly available information. Our real-time alerts enable tens of thousands of users at hundreds of public and private sector organizations to learn first of breaking events around the world, develop effective risk mitigation strategies, and respond with confidence as crises unfold.\n<br><br>\nDataminr is making its mark for growth and innovation, recently earning recognition on the Deloitte Technology Fast 500, Forbes AI 50 and Forbes Cloud 100 lists. We also earned accolades for 'Most Innovative Use of AI' from the 2020 AI &amp; Machine Learning Awards.\n<br><br>\nJoin our team and help the world manage risk in real time. You'll work with 600+ talented people across seven offices, united by our passion to collaborate, make a difference, and have fun while doing it!\n<br><br>\nWho you are:<br>\nYou're a Ph.D. candidate who has published in top tier conferences and are passionate about having a positive impact on the world. You are enthusiastic about working on some of the most challenging problems in AI, working in a highly collaborative environment and directly contributing to products while advancing the state of the art. You are very creative, can work independently, and are an excellent collaborator and communicator.\n<br><br>\nResponsibilities:<br>\nPerform research to advance the state of the art and solve specific problems at scale in one or more of the following areas: NLP, HCI, Machine Learning/Deep Learning, Computer Vision, Complex Networks.\n<br>Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship.\n<br>Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact.\n<br><br>\nMinimum qualifications:<br>\nMust be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field.\n<br>Ideal candidates will have had prior internship experience.\n<br>Outstanding publication record in the candidate's field of study (ACL, CVPR, CHI, WWW, RecSys, ICCV, NIPS, ICML, etc.).\n<br>Demonstrated ability to work independently, set up experiments and demonstrate progress through principled used of metrics.\n<br><br>\nDataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.\n<br><br>\n#LI-BM\n<br>#LI-Remote"
    },
    {
        "position": "Heterogeneous Computing Research Intern",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-04-07T07:50:26.185Z",
        "url": "https://www.internships.com/posting/sam_1006962483564",
        "lastScraped": "2021-04-07T07:50:26.185Z",
        "description": "<p>We are looking for an AI/ML software intern to participate in building industry-leading AI computing accelerating engines and platforms, developing the most cutting–edge artificial intelligence and applied machine learning systems and infrastructures which combine inference and training software and hardware to apply in the AI data centers and clusters.<br>We focus on managing and optimizing artificial intelligence and machine learning algorithms and workloads (for Cloud Computing, Search, Ads, News Feed, Autonomous Driving, Photos, Computer Vision, Speech, NLP, etc), improving computing efficiency and utilization, optimizing performance, and identifying next generation AI computing-systems and platform design.<br>Responsibilities: </p><ul><li>Participate in large-scale heterogeneous computing cluster/platform design and heterogeneous resources scheduling development</li><li>Participate in GPU virtualization solutions development for GPU utilization optimization</li><li>Participate in software and hardware co-design to optimize ML algorithm performance on heterogenous hardware accelerators</li><li>Research on compiler systems, communication libraries, and accelerations for AI/ML algorithms and workloads</li></ul><p>Qualifications: </p><ul><li>Currently pursuing a MS or PhD Degree in Computer Science/Electrical Engineering or related Machine Learning field</li><li>Good understanding of Computer System and Architecture, Operating System, Parallel Computing, and Distributed Computing</li><li>Familiar with at least one of the AI/ML algorithms and major frameworks (Tensorflow, Caffe, MXNet, PaddlePaddle, etc.)</li><li>Familiarity with performance profiling tools, system, framework, hardware, and kernel layers</li><li>Experience with DL workload programming &amp; optimization on various hardware accelerators</li><li>Excellent communication and interpersonal skills</li></ul><p>Preferred Qualifications: </p><ul><li>Experience with different AI hardware GPU/ASIC/FPGA/ ARM-GPU architectures</li><li>Experience with GPU virtualization, heterogeneous cluster scheduling, heterogeneous computing acceleration</li><li>Experience with LLVM/TVM, CUDA/OpenCL</li></ul><p>Culture Fit: </p><ul><li>Mission alignment: If you want to be part of a team to accomplish this great mission, we will provide you the best possible platform to do that.</li><li>Self-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting and useful things to do?</li><li>Hungry to learn: We are eager to see you learn new skills and grow. But learning is hard work and this is something we hope you want to do.</li><li>Team orientation: We work in small, fast-moving teams. We don't believe in lone wolves. We watch out for each other and go after big goals together as a team</li></ul><p>Job Type: Internship</p><p>Pay: $8,000.00 - $10,000.00 per month</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Work Location:</p><ul><li>Multiple locations</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul>"
    },
    {
        "position": "Accounting Information System Specialist intern",
        "company": "youbloom",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-07T07:50:29.388Z",
        "url": "https://www.internships.com/posting/ccm_f4876606-ec8b-4677-99c8-85ec528b4cc0",
        "lastScraped": "2021-04-07T07:50:29.388Z",
        "description": "<p>Vision: youbloom’s vision is to make live music performance easier and better for all.</p><p>&nbsp;</p><p>Mission: youbloom’s mission is to expand the deliver of amazing live music experiences by increasing the connectedness of fans, artists, promoters and venues.</p><p><br></p><p><span>We're currently seeking an Accounting major with minor or emphasis in Management Information Systems or Computer Science to become part of our team.</span></p><p><br></p><p><span>What you'll do</span></p><p><br></p><p><span>Demonstrate a clear pride of ownership for the team-owned applications.</span></p><p><span>Assist with the maintenance, administration and support of Finance Systems, and ancillary systems, in alignment w/ Finance programs, goals and initiatives.</span></p><p><span>Assist with developing, defining, and documenting business requirements that describe the business need and solution scope, and communicate them effectively to IT, HR, and business stakeholders within Treasury, Internal Audit, Tax, etc.&nbsp;</span></p><p><span>Assist with the system configurations and maintenance, development and maintenance of a reporting repository and support reporting and analytics requests.</span></p><p><span>Contribute to the maintenance and accuracy of systems data, in the form of data loads and audits.</span></p><p><br></p><p><br></p><p><span>Required skills:</span></p><p><br></p><p><span>Bachelor's degree in MIS or Computer Science, Finance or Business Administration or an equivalent combination of education.</span></p><p><span>Strong analytical skills, excellent communication skills (written and oral).ra</span></p><p><span>A working knowledge of one of more of the following applications desirable: DB2, Cognos Analytics, SPSS, JIRA, Slack, Splunk, advanced Excel, Robotic Process Automation, and other new technology data analytics tools.</span></p><p><br></p><p><br></p><p>Job Type: Internship</p><p>The intern term is 3 to 6 months. This is a non-paid internship, with flexible hours (minimum of 16 hours per week) to reflect your necessary college credit requirements. If the intern could hold the position very well, we may be able to offer a more full or part-time position with compensation.</p>"
    },
    {
        "position": "Embedded Software Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "Massachusetts",
            "state": "United States"
        },
        "posted": "2021-03-08T07:50:42.585Z",
        "url": "https://www.internships.com/posting/bug_38963827035",
        "lastScraped": "2021-04-07T07:50:42.585Z",
        "description": "Embedded Software Engineering Internship\n\nWe are constantly looking to add to our core talent. If you are seeking a career that is challenging and rewarding, a work environment that is diverse and dynamic, look no further  Haemonetics is your employer of choice.\n\nJob Details\n\nAt Haemonetics, we make it possible, you make it matter.  Our comprehensive portfolio of devices, information management, and consulting services offers blood management solutions for each facet of the blood supply chain  from plasma and blood collectors to hospitals. We believe that through proper blood management, our portfolio of products and services helps to prevent a transfusion for the patient who doesnt need one and provides the right blood product, at the right time, in the right dose to the right patient who does.\n\nInternships projects vary depending on the needs of both the student and the business. Haemonetics Interns are assigned to a meaningful project within the company to acquire a variety of experiences, try different skills, and learn what a future career might offer while also contributing to our innovation agenda by completing business-critical projects and assignments.\n\nIf you are seeking an internship experience that is challenging and rewarding, Haemonetics is your best next opportunity.\n\nPROJECT DESCRIPTION\n\nNexSys PCS, our flagship plasma apheresis device is always improving with new software and features. By joining Haemonetics internship program you will be working on automated testing continuous integration, architecture and scripts that test new and existing functionality. In order to expand automation you will work with the device embedded software code, python, network stack and our fully integrated product suite.\n\nPROJECT DELIVERABLES\n\n* Test automation architecture  document\n* Enhanced test automation suite\n* Automation continuous integration environment\n\nField of Study:  Computer Science\n\nEEO Policy Statement"
    },
    {
        "position": "Research Internship - Summer 2021 (NLP, Computer Vision, or Machine Learning)",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-03-08T07:50:56.285Z",
        "url": "https://www.internships.com/posting/sam_i-7OwbC4bPioyiY9KLTrmIZsPJCcS6RGduXUa1E_6PO0vMj2e5qUSQ",
        "lastScraped": "2021-04-07T07:50:56.285Z",
        "description": "Type: Internship\n<br>Experience: PhD/Graduate Students\n<br><br>\nWho we are:<br>\nDataminr puts real-time AI and public data to work for our clients, generating relevant and actionable alerts for global corporations, public sector agencies, newsrooms, and NGOs. Our leading AI platform detects the earliest signals of high-impact events and emerging risks from vast amounts of publicly available information. Our real-time alerts enable tens of thousands of users at hundreds of public and private sector organizations to learn first of breaking events around the world, develop effective risk mitigation strategies, and respond with confidence as crises unfold.\n<br><br>\nDataminr is making its mark for growth and innovation, recently earning recognition on the Deloitte Technology Fast 500, Forbes AI 50 and Forbes Cloud 100 lists. We also earned accolades for 'Most Innovative Use of AI' from the 2020 AI &amp; Machine Learning Awards.\n<br><br>\nJoin our team and help the world manage risk in real time. You'll work with 600+ talented people across seven offices, united by our passion to collaborate, make a difference, and have fun while doing it!\n<br><br>\nWho you are:<br>\nYou're a Ph.D. candidate who has published in top tier conferences and are passionate about having a positive impact on the world. You are enthusiastic about working on some of the most challenging problems in AI, working in a highly collaborative environment and directly contributing to products while advancing the state of the art. You are very creative, can work independently, and are an excellent collaborator and communicator.\n<br><br>\nResponsibilities:<br>\nPerform research to advance the state of the art and solve specific problems at scale in one or more of the following areas: NLP, HCI, Machine Learning/Deep Learning, Computer Vision, Complex Networks.\n<br>Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship.\n<br>Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact.\n<br><br>\nMinimum qualifications:<br>\nMust be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field.\n<br>Ideal candidates will have had prior internship experience.\n<br>Outstanding publication record in the candidate's field of study (ACL, CVPR, CHI, WWW, RecSys, ICCV, NIPS, ICML, etc.).\n<br>Demonstrated ability to work independently, set up experiments and demonstrate progress through principled used of metrics.\n<br><br>\nDataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.\n<br><br>\n#LI-BM\n<br>#LI-Remote"
    },
    {
        "position": "[Video Game] Software Engineering Intern",
        "company": "Space Dwarves Entertainment LLC.",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:50:59.457Z",
        "url": "https://www.internships.com/posting/ccm_dfbc2d80-aa00-4742-80a5-f536b3690bb0",
        "lastScraped": "2021-04-07T07:50:59.457Z",
        "description": "<p>Software Engineering Intern- Interns are responsible for creating C# code for Unity3d scripts as part of the game development for a game's features or tools. <strong><u>This is a Steam multi-player game and applicants must be advanced Unity3d programmers. </u></strong>Potential interns typically pursue a degree in computer science, computer engineering, or electrical engineering with a strong mathematical background. Candidates should have solid programming C# code. Other desired skills include bit-mapped graphics, 3D graphics, artificial intelligence, and physics. Game development experience is helpful but not required. Candidates should also have strong interpersonal and problem-solving abilities.&nbsp;</p><p>JOB RESPONSIBILITIES&nbsp;</p><p>• Maintain existing products, debug and apply bug fixes.&nbsp;</p><p>• Ability to implement and update gameplay requirements for multiple systems.&nbsp;</p><p>• Ability to work with a team, in a fluid, fast-paced work environment.&nbsp;</p><p>• Willingness to pitch in when needed to meet the needs of the business.&nbsp;</p>"
    },
    {
        "position": "Cloud Data Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T07:51:12.505Z",
        "url": "https://www.internships.com/posting/bug_38958590186",
        "lastScraped": "2021-04-07T07:51:12.505Z",
        "description": "Cloud Data Engineering Intern\nIt's fun to work in a company where people truly BELIEVE in what they're doing!\n\nWe're committed to bringing passion and customer focus to the business.\n\nJob Description Summary:\n\nEnvestnet is a leading independent provider of technology-enabled, web-based investment solutions and services to financial advisors. Our mission is to help investors achieve their financial goals, by providing financial advisors the access, tools, and support they need to deliver excellence in wealth management.\n\nThe Envestnet Summer Internship is a full-time internship program designed for qualified college students to gain hands on experience within the Envestnet \"location\" Office. Interns will work alongside various department experts and collaborate with fellow Envestnet interns on a project presented to leaders in the company.\n\nThe Summer Internship program will run from June 2, 2021 through August 6, 2021.\n\nJob Description:\n\nEssential Duties amp; Responsibilities\n\n* Deliver end-to-end data and analytics capabilities, including data ingest, data transformation, data science, and data visualization in collaboration with Data and Analytics stakeholder\n\nKnowledge, Skills, amp; Abilities\n\nLearn and apply tools and technologies proficiently, including:\n\n* Languages: SQL (standard and DB-specific), Python, Scala, Bash\n* Frameworks: Hadoop, Spark, Kafka\n* Cloud Computing: AWS\n* Tools/Products: Data Science Studio, Alteryx, Jupyter, Tableau, PowerBIQ6\n\nEducation/Experience:\n\n* Bachelor Degree in Computer Science relevant field, Masters Degree is a plus\n\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!"
    },
    {
        "position": "Programming & Playout Development Intern",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-03-08T07:51:25.731Z",
        "url": "https://www.internships.com/posting/sam_3784685502",
        "lastScraped": "2021-04-07T07:51:25.731Z",
        "description": "<div>Current employees and contingent workers click here to apply and search by the Job Posting Title.iHeartMedia<p><br></p><p>Job Summary:</p>iHeartMedia, Inc., is a global media and entertainment company that specializes in broadcast and digital radio, out-of-home, mobile, and on-demand entertainment and information services for national audiences and local communities. iHeartMedia focuses on providing a spectrum of multi-platform advertising and marketing opportunities for partners and world-class entertainment for listeners and users.<br><br>We are looking for talented, energetic, curious problem-solvers who will be a great fit into our fast moving culture. In turn, we will help you acquire specific skills where needed.<p><br></p><p>You will be building API capabilities with the Programming and Playout team using cutting edge cloud technologies. From managing metadata for all iHeart radio stations to processing a quarter of a billion records on a daily basis for big data processing, our team develop capabilities that are critical to our operations. Your responsibilities will include:</p><ul><li>Code new features / enhancements for Programming and Playout Systems and JIRA using Java, Javascript, Python</li><li>Analyze data, build dashboards, trends and reports</li></ul><p></p><p>To join the Team you will need the following experience:</p><ul><li>Pursuing a Bachelors or Masters degree in Computer Science, Software Engineering, or a related field from a 4-year institution; 3.0 GPA (strongly preferred)</li><li>Experience in Java, Javascript, Python / bash / other scripting languages</li><li>High levels of creativity and problem solving Strong in software engineering foundations – data structures and algorithms</li><li>A great attitude and hunger for learning and an ability to work within a team environment</li><li>Excellent analytical, written and oral communication skills<br></li></ul><p><br>Benefits:</p><ul><li>Exposure to building applications that run large businesses like iHeart</li><li>Opportunity to use Java / Javascript / Python in an enterprise world</li><li>Opportunity to learn and understand real world business needs and translate them to software products</li><li>Ultimate satisfaction of solving complex problems with software engineering</li></ul><p></p><p>#LI-Remote</p><br><p></p><p>Location</p>VIRTUAL CST, TX<p><br></p><p>Position Type</p>Temporary<p><br></p><p>The Company is an equal opportunity employer and will not tolerate discrimination in employment on the basis of race, color, age, sex, sexual orientation, gender identity or expression, religion, disability, ethnicity, national origin, marital status, protected veteran status, genetic information, or any other legally protected classification or status.<br></p><p></p><p>Our organization participates in E-Verify. Click here to learn about E-Verify.<br></p><p></p><p>Current employees and contingent workers click here to apply and search by the Job Posting Title.</p></div>"
    },
    {
        "position": "Data Science Intern",
        "company": "N/A",
        "location": {
            "city": "CA",
            "state": "United States"
        },
        "posted": "2021-04-07T07:51:38.917Z",
        "url": "https://www.internships.com/posting/sam_3725584793",
        "lastScraped": "2021-04-07T07:51:38.917Z",
        "description": "<strong>Our Company</strong>\n<br><br>\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n<br><br>\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n<br><br>\n<strong>The Opportunity</strong><br><br>We are looking for a summer intern to join the Adobe Data Science and New Product team in San Jose. We apply AI and machine learning techniques to customer data to address challenge business problems, such as driving go-to-market strategies, sales prioritization, growing product engagement and customer service improvement. The objective is to make machine learning offerings a world class, cutting edge, differentiating product in Adobe Cloud ecosystem. We match the pace, innovation and excitement of a startup, backed by the resources and infrastructure of Adobe!<br><br><strong>What You Will Do</strong><br><br>You will be working with team members to tackle complicated business problems, such as customer understanding, conversion / churn prediction and management, customer journey optimization, and customer engagement improvement. You will build a machine learning product prototype using real-world customer data. The prototypes will have the potentials to be incorporated into Adobe Sensei Intelligent Services.<br><br><strong>What You Need To Succeed</strong>\n\n<ul>\n<li>Currently enrolled in an accredited college or university and actively pursuing a PhD, or Master Degree in Computer Science/ Operations Research / Statistics / Electrical Eng/ Applied Math/ Econometrics</li><li>Deep understanding of machine learning, deep learning or data mining concepts, and a track record of solving problems with these methods.</li><li>Ability to take a business problem and translate that into a scalable mathematical model.</li><li>Proficient in one or more programming languages such as Python, Java and C</li><li>Familiar with machine learning or statistical modeling tools such as R, Matlab, and scikit learn.</li>\n</ul>\n\nAdobe"
    },
    {
        "position": "Internship - Graduate Data Science Intern",
        "company": "N/A",
        "location": {
            "city": "Minnesota",
            "state": "United States"
        },
        "posted": "2021-03-08T07:51:52.702Z",
        "url": "https://www.internships.com/posting/bug_38958519869",
        "lastScraped": "2021-04-07T07:51:52.702Z",
        "description": "Job ID: 11256511\n\nJob Location:\nJob Title: Internship - 2021 Graduate Data Science Intern\nWork Type: Work Days: Work Vary: No , Shift: First (Day), Hours Per Week: 40, Work Type: Regular\n\nSalary Offered: Unspecified\nBenefits: Unspecified.\n\nPhysical Required: Unspecified\nDrug Testing Required: Unspecified\nEducation Required:\n\nExperience Required: Unspecified\n\nRequired Skills:\nSee Job Description section for any required skills.\n\nJob Description:\nJob Description: The Graduate Data Science intern role is intended to start in Summer 2021. Collaborate with Innovative 3Mers Around the World Choosing where to start and grow your career has a major impact on your professional and personal life, so it's equally important you know that the company that you choose to work at, and its leaders, will support and guide you. With a diversity of people, global locations, technologies and products, 3M is a place where you can collaborate with 96,000 other curious, creative 3Mers. \"A long-lasting career at 3M comes from having vision, imagination and the ability to see what doesn't exist. 3Mers are groundbreaking innovators and it's important that we give every person the space for disruptive and creative thinking.\" - John Banovetz, senior vice president and chief technology officer at 3M An internship is a temporary position within 3M. Interns typically work a full-time schedule throughout a 10-12 week assignment. This position is limited to working 899 hours per service credit year. 3M provides eligible interns with temporary housing and round-trip travel reimbursement in accordance with current policy. This position provides an opportunity to transition from other private, public, government or military environments to a 3M career. The Impact You'll Make in this Role As a Data Science Intern, you will have the opportunity to tap into your curiosity and collaborate with some of the most innovative and diverse people around the world. Here, you will make an impact by: + Leveraging expertise to support development of new technologies, providing growth opportunities, in addition to supporting existing 3M products, businesses, and operations. + Optimizing algorithms for computational efficiency, speed, and usability + Building capabilities with software tools e.g., Microsoft Azure ML and/or AWS ML + Collaborating with research teams in corporate research and business labs on building capabilities and applications that use his/her scientific and computational skills + Supporting algorithm development and deploy solutions based on real-world data Your Skills and Expertise To set you up for success in this role from day one, 3M is looking for candidates who must have the following qualifications: + Currently pursuing a master's or doctoral degree in science or engineering from an accredited institution Additional qualifications that could help you succeed even further in this role include: + Currently pursuing a master's or doctoral degree in Computer Science, Electrical Engineering, Data Science, Software Engineering, or related discipline from an accredited institution + Experience with Microsoft Azure ML and/or AWS ML + Experience in machine learning, deep learning, data science, computer vision, artificial intelligence, statistics, and/or applied mathematics + Fluent in one or more programming languages (e.g. Python, MATLAB, C, C++, and/or R) + Experienced with Azure and AWS cloud services and data analytics tools + Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns + Strong problem solving skills + Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available + Leadership and networking skills + Self-motivated and self-directed + Excellent communication skills (oral, written and presentation) Responsibilities of this position may include direct and/or indirect physical or logical access to information, systems, technologies subjected to the regulations/compliance with U.S. Export Control Laws. U.S. Export Control laws and U.S. Government Department of Defense contracts and sub-contracts impose certain restrictions on companies and their ability to share export-controlled and other technology and services with certain \"non-U.S. persons\" (persons who are not U.S. citizens or nationals, lawful permanent residents of the U.S., refugees, \"Temporary Residents\" (granted Amnesty or Special Agricultural Worker provisions), or persons granted asylum (but excluding persons in nonimmigrant status such as H-1B, L-1, F-1, etc.) or non-U.S. citizens. To comply with these laws, and in conjunction with the review of candidates for those positions within 3M that may present access to export controlled technical data, 3M must assess employees' U.S. person status, as well as citizenship(s). The questions asked in this application are intended to assess this and will be used for evaluation purposes only. Failure to provide the necessary information in this regard will result in our inability to consider you further for this particular position. The decision whether or not to file or pursue an export license application is at 3M Company's sole election. Supporting Your Well-being 3M offers many programs to help you live your best life - both physically and financially. To ensure competitive pay and benefits, 3M regularly benchmarks with other companies that are comparable in size and scope. Resources for You For more details on what happens before, during and after the interview process, check out the Insights for Candidates page at 3M.com/careers. Learn more about 3M's creative solutions to the world's problems at www.3M.com or on Twitter @3M. Responsibilities of this position include that corporate policies, procedures and security standards are complied with while performing assigned duties. 3M is an equal opportunity employer. 3M will not discriminate against any applicant for employment on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status. Please note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly. 3M Global Terms of Use and Privacy Statement Carefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms. Please access the linked document by clicking here (http://multimedia.3m.com/mws/media/1274940O/3m-jobs-country-data-privacy-statements-external.pdf) , select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms. At 3M we apply science in collaborative ways to improve lives daily as our employees connect with customers all around the world. Learn more about 3M's creative solutions to global challenges at www.3M.com or on Twitter @3M or @3MNews."
    },
    {
        "position": "Cloud Data Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-08T07:52:05.978Z",
        "url": "https://www.internships.com/posting/bug_38958590186",
        "lastScraped": "2021-04-07T07:52:05.978Z",
        "description": "Cloud Data Engineering Intern\nIt's fun to work in a company where people truly BELIEVE in what they're doing!\n\nWe're committed to bringing passion and customer focus to the business.\n\nJob Description Summary:\n\nEnvestnet is a leading independent provider of technology-enabled, web-based investment solutions and services to financial advisors. Our mission is to help investors achieve their financial goals, by providing financial advisors the access, tools, and support they need to deliver excellence in wealth management.\n\nThe Envestnet Summer Internship is a full-time internship program designed for qualified college students to gain hands on experience within the Envestnet \"location\" Office. Interns will work alongside various department experts and collaborate with fellow Envestnet interns on a project presented to leaders in the company.\n\nThe Summer Internship program will run from June 2, 2021 through August 6, 2021.\n\nJob Description:\n\nEssential Duties amp; Responsibilities\n\n* Deliver end-to-end data and analytics capabilities, including data ingest, data transformation, data science, and data visualization in collaboration with Data and Analytics stakeholder\n\nKnowledge, Skills, amp; Abilities\n\nLearn and apply tools and technologies proficiently, including:\n\n* Languages: SQL (standard and DB-specific), Python, Scala, Bash\n* Frameworks: Hadoop, Spark, Kafka\n* Cloud Computing: AWS\n* Tools/Products: Data Science Studio, Alteryx, Jupyter, Tableau, PowerBIQ6\n\nEducation/Experience:\n\n* Bachelor Degree in Computer Science relevant field, Masters Degree is a plus\n\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!"
    },
    {
        "position": "Marketing Intern",
        "company": "Brand Knew",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:52:09.172Z",
        "url": "https://www.internships.com/posting/10346e7d-7602-46c5-a277-fb32d1bf413f",
        "lastScraped": "2021-04-07T07:52:09.172Z",
        "description": "<p>Are you an expert caption-writer, pop culture fanatic, and #social media aficionado?</p><p><br></p><p>Our Los Angeles office is seeking interns who are currently pursuing a bachelor of arts or masters in marketing, computer science, photography, design or other related fields to assist our marketing team. Ideal candidate has experience working with all social platforms, and is ready to think outside of the outside of the box. This opportunity is an unpaid internship and at the completion of the internship, interns must receive school credit.</p><p><br></p><p>Current Enrollment for: Summer 2021&nbsp;Program</p><p><br></p><p>NOTE:&nbsp;Applications that are not fully and properly filled out will not be considered.</p><p><br></p>RESPONSIBILITIES<ul><li class=\"ql-indent-1\">Support marketing team with client research and initiatives</li><li class=\"ql-indent-1\">Ideate creative concepts, campaigns, and activations for clients</li><li class=\"ql-indent-1\">Research key competitors in client industries</li><li class=\"ql-indent-1\">Craft and develop content across different social platforms</li><li class=\"ql-indent-1\">Analyze social growth and make recommendations</li><li class=\"ql-indent-1\">Provide weekly updates to marketing team on industry trends and developments</li></ul><br>REQUIREMENTS<ul><li class=\"ql-indent-1\">Unusually strong writing skills</li><li class=\"ql-indent-1\">Excellent communication skills</li><li class=\"ql-indent-1\">Serious multitasking skills</li><li class=\"ql-indent-1\">Flexibility and willingness to juggle multiple projects and tasks</li><li class=\"ql-indent-1\">Deep knowledge of Facebook, Twitter, Instagram, Tumblr, and Snapchat</li><li class=\"ql-indent-1\">Incredible attention to detail</li><li class=\"ql-indent-1\">Photoshop/Adobe Illustrator&nbsp;skills are a major plus, but not required</li></ul><br>PERKS<ul><li class=\"ql-indent-1\">Significant opportunity for growth in the company beyond the internship</li><li class=\"ql-indent-1\">Work alongside an incredible slate of clients and team members</li><li class=\"ql-indent-1\">Fun, creative and collaborative company culture</li><li class=\"ql-indent-1\">Unlimited Stumptown Cold Brew Coffee</li></ul><p><br></p><p><strong>To qualify, please submit your application through Lever:</strong> https://jobs.lever.co/brand-knew/bae9a1ec-10a4-48fc-94a5-1b45d964d8f4</p>"
    },
    {
        "position": "Software Development - Python",
        "company": "Annapurna Solutions",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-08T07:52:12.306Z",
        "url": "https://www.internships.com/posting/ccm_1fa5cd89-b186-4e8f-987b-e410f011d490",
        "lastScraped": "2021-04-07T07:52:12.306Z",
        "description": "<p>&nbsp;Joining Innovation Department as a Software Engineering intern gives you the opportunity to experience an exciting, fast-paced startup environment hands on. We’re looking for a passionate Computer Science student who has a strong understanding of Python to work on latest frontend and backend tools and technologies. Work directly with our Engineering team to learn how to build components of a SaaS e-Learning platform.</p><p><br></p><p>Innovation Department builds sustainability mobile solutions from the ground up. Our team of brand strategists, marketers, operators and builders are obsessed with reducing the time to product-market fit and creating repeatable success for the launch of early-stage products &amp; Services in the sustainability sector.</p><p><br></p><p>Responsibilities/ Tasks:</p><p>• Daily responsibilities will include:- Software development- Software quality assurance- Hardware/software troubleshooting and testing</p><p>• Gather requirements, develop test plans, and develop and deploy stable modules to support archiving and backup of data as required by external regulators</p><p>• Test and Validate automated backup solution along with an indexing strategy to easily retrieve relevant data based on archive properties</p><p><br></p><p>Requirements:</p><p>• Strong development skills using Python (and secondarily Perl/shell) is needed</p><p>• Require course credit or CPTOPT training for International students</p><p>• Strong expertise working in a Linux/Unix environment</p><p>• Good understanding of software design, local and cloud systems (Google cloud) is a plus</p><p>• Must have the ability to communicate effectively with engineers and software developers and be detail oriented and self-driven.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>"
    },
    {
        "position": "Security Analyst Intern",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-04-07T07:52:25.333Z",
        "url": "https://www.internships.com/posting/sam_0a4f80b8ce6a0417",
        "lastScraped": "2021-04-07T07:52:25.333Z",
        "description": "<div><p>Imagine a world dedicated to Security Without Compromise. Synack, headquartered in Silicon Valley with regional offices around the world, protects leading global organizations by reducing companies' security risk and increasing their resistance to cyber attack. How do we do this? By utilizing the world's best and most trusted team of ethical hackers who test through our powerful and controlled platform to deliver real security without compromise. At Synack, we aren't afraid to think outside the box or take on big challenges. Backed by top-tier venture capital firms including Kleiner Perkins Caufield &amp; Byers, Microsoft, and Google Ventures, Synack's mission is to leverage global security talent coupled with advanced technology to help enterprises discover security vulnerabilities before they become business problems. Discover the possibilities at Synack!</p>\n<p>\nAs the demand for cybersecurity grows, so does Synack's Vulnerability Operations team! Synack is seeking students who are passionate about exploring a career in cybersecurity. If you are a student pursuing a Computer Science degree with a concentration in cybersecurity or a similar discipline, we encourage you to apply for our internship. This internship opportunity is designed for Junior and Senior students, but Sophomore students with a strong CS background will also be considered.</p>\n<p>\nHere's what you'll do</p>\n<ul>\n<li>Assist the Vulnerability Operations team with the review and acceptance of various low-complexity vulnerability reports, specifically Synack Red Team's \"Missions\"</li>\n<li>Work with seasoned Computer Security Analysts in our office in Austin, TX (COVID-19 permitting, otherwise remote work is allowed)</li>\n<li>Learn what it's like to review complex vulnerability reports</li>\n<li>When core tasks are complete, shoulder surf other analysts and learn how to exploit vulnerabilities, bypass customer patch attempts, etc.</li>\n</ul>\n<p> Here's what you'll need</p>\n<ul>\n<li>Currently pursuing a degree in Computer Science, or be a participant in one of Synack's internship programs</li>\n<li>Strong written and verbal communication skills</li>\n<li>Basic understanding of various Computer Security topics</li>\n<li>Basic understanding of OWASP top ten</li>\n<li>Enthusiasm and a positive can-do attitude!</li>\n</ul>\n<p> It's all hands-on deck, it's hard work, it's winning, it's Synack</p>\n<p>\nSynack is committed to embracing diversity. Our people are our strength. Each addition to our team is an opportunity to grow and diversify our ideas, experiences, and viewpoints. We strive to be inclusive of Race, Ethnicity, Religion, Sex, LGBTQ+, Veterans, Disabilities, and Age. Synack welcomes you!</p></div>"
    },
    {
        "position": "Security Analyst Intern",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-04-07T07:52:38.534Z",
        "url": "https://www.internships.com/posting/sam_0a4f80b8ce6a0417",
        "lastScraped": "2021-04-07T07:52:38.534Z",
        "description": "<div><p>Imagine a world dedicated to Security Without Compromise. Synack, headquartered in Silicon Valley with regional offices around the world, protects leading global organizations by reducing companies' security risk and increasing their resistance to cyber attack. How do we do this? By utilizing the world's best and most trusted team of ethical hackers who test through our powerful and controlled platform to deliver real security without compromise. At Synack, we aren't afraid to think outside the box or take on big challenges. Backed by top-tier venture capital firms including Kleiner Perkins Caufield &amp; Byers, Microsoft, and Google Ventures, Synack's mission is to leverage global security talent coupled with advanced technology to help enterprises discover security vulnerabilities before they become business problems. Discover the possibilities at Synack!</p>\n<p>\nAs the demand for cybersecurity grows, so does Synack's Vulnerability Operations team! Synack is seeking students who are passionate about exploring a career in cybersecurity. If you are a student pursuing a Computer Science degree with a concentration in cybersecurity or a similar discipline, we encourage you to apply for our internship. This internship opportunity is designed for Junior and Senior students, but Sophomore students with a strong CS background will also be considered.</p>\n<p>\nHere's what you'll do</p>\n<ul>\n<li>Assist the Vulnerability Operations team with the review and acceptance of various low-complexity vulnerability reports, specifically Synack Red Team's \"Missions\"</li>\n<li>Work with seasoned Computer Security Analysts in our office in Austin, TX (COVID-19 permitting, otherwise remote work is allowed)</li>\n<li>Learn what it's like to review complex vulnerability reports</li>\n<li>When core tasks are complete, shoulder surf other analysts and learn how to exploit vulnerabilities, bypass customer patch attempts, etc.</li>\n</ul>\n<p> Here's what you'll need</p>\n<ul>\n<li>Currently pursuing a degree in Computer Science, or be a participant in one of Synack's internship programs</li>\n<li>Strong written and verbal communication skills</li>\n<li>Basic understanding of various Computer Security topics</li>\n<li>Basic understanding of OWASP top ten</li>\n<li>Enthusiasm and a positive can-do attitude!</li>\n</ul>\n<p> It's all hands-on deck, it's hard work, it's winning, it's Synack</p>\n<p>\nSynack is committed to embracing diversity. Our people are our strength. Each addition to our team is an opportunity to grow and diversify our ideas, experiences, and viewpoints. We strive to be inclusive of Race, Ethnicity, Religion, Sex, LGBTQ+, Veterans, Disabilities, and Age. Synack welcomes you!</p></div>"
    },
    {
        "position": "Intern – Data Analytics",
        "company": "N/A",
        "location": {
            "city": "NC",
            "state": "United States"
        },
        "posted": "2021-03-08T07:52:51.666Z",
        "url": "https://www.internships.com/posting/sam_4021172928",
        "lastScraped": "2021-04-07T07:52:51.666Z",
        "description": "<div><p>We are one of the world’s largest apparel, footwear and accessories companies connecting people to the lifestyles, activities and experiences they cherish through our family of iconic outdoor, active and workwear brands including Vans®, The North Face®, Timberland® and Dickies® .</p><p></p><p>We’re proud of the scale, diversity and resources we can make available for you so you can explore new and exciting options as your career advances forward.</p><p></p><p>We offer a uniquely supportive, people-first environment that gives you the chance to be yourself while making a real impact, every day.<br><br></p><p>We’re a down to earth and straight forward culture, filled with smart people, working incredibly hard, doing what they love while striving towards something we all believe in.</p><p></p><p>We’re determined to make a difference and set an example for social and environmental impact at scale. Everyone can play their part and see their efforts recognized, appreciated and rewarded.</p><p></p><p>All Internships will be remote. Depending on World Health Organization guidelines this may change over the course of your internship or be at the discretion of our management.</p><p></p><p>Job Title: Intern – Data Analytics</p><p></p><p>What you could be doing on a daily basis;</p><p>Join the tax department’s in-house technology team, and gain hands on experience developing applications to assist in the transformation and automation of existing manual processes as a part of Project Enable, a multi-year initiative to accelerate and transform our business model, and deliver $125M global cost savings.</p><p></p><p>You will develop code to process and manipulate inputs, perform calculations, visualized datasets, as well as perform required testing and bug fixes.</p><p></p><p>The types of strengths we would like you to bring;</p><ul><li>Pursuing a Bachelor’s/Master’s/PH.d degree in Computer Science or related Field</li><li>Experience with Python, R, RPAs, SQL</li></ul><p></p><p>Our Intern Program runs from June 7th through August 13th, 2021! During your time with us, you will have opportunities for training that will enhance you as a professional, give back in our communities and of course have FUN with your colleagues! All VF internships are paid and offer you work that matters with some of the best teams around!</p><p></p><p>Colorado Applicants :</p><p>If you are a Colorado resident and are interested in applying, you are able to request additional information about this position. To request additional information, please email us HERE. Please be sure to include the complete job title in the email message.</p></div>"
    },
    {
        "position": "Information Security, Risk & Compliance – Summer Intern",
        "company": "N/A",
        "location": {
            "city": "TX",
            "state": "United States"
        },
        "posted": "2021-04-07T07:53:04.723Z",
        "url": "https://www.internships.com/posting/sam_37c10ed87555a027",
        "lastScraped": "2021-04-07T07:53:04.723Z",
        "description": "<div><p>Information Security, Risk &amp; Compliance Intern – Summer Intern</p><br>\n<p>\nHow will this role have an impact?</p>\n<p>\nSignify Health is seeking an Summer Intern for its Information Security, Risk &amp; Compliance team. The summer intern's role will be focused on helping the team execute 1-2 key strategic projects with a likely focus on:</p>\n<ul>\n<li>Information Security, Third Party Risk Assessments</li></ul><br>\n<p><br>\nThis role will report to the Manager, Risk &amp; Compliance.<br>\n<br>\nWhat will you do?</p>\n<ul>\n<li>Create, process and track third party risk assessments with Signify Vendors and Customers.</li>\n<li>Support risk assessment activities, based on a review of vendor responses to questions around Confidentiality, Integrity and Availability of data and assets.</li>\n<li>Create and manage monthly metrics around the status of risk assessments.</li>\n<li>Follow-up on vendor risks, to identify if Corrective Action Plans (CAP's), have been implemented.</li></ul><br>\n<p></p>\n<p>\nWe are looking for someone with:</p>\n<ul>\n<li>Passion for the field of Information Security, and solving complex challenges</li>\n<li>Technical classwork or experience such as application development and computer science, networking, Information Security principles, and system administration</li>\n<li>Majors in computer science, computer engineering, information systems or business technology preferred</li>\n<li>Demonstrated leadership skills, including the ability to identify and manage work independently.</li>\n<li>Demonstrated ability to interface effectively with individuals across various levels, using clear written and verbal communication</li>\n<li>Must be currently enrolled in a full-time degree program and returning to the program after the completion of the internship/co-op</li></ul><br>\n<p></p>\n<p>\nProgram Perks:</p>\n<ul>\n<li>Competitive compensation</li>\n<li>Potential opportunity for full-time position following graduation</li>\n<li>Mentoring throughout the summer in preparation of Final Presentation</li>\n<li>Weekly Lunch &amp; Learns with executives throughout the company</li>\n<li>Buddy Program for socializing and guidance throughout the summer</li>\n<li>Networking opportunities at all levels of the company<br>\n<br>\n<br>\n</li></ul><p>About Us:</p>\n<p>\nSignify Health partners with leading health plans, healthcare providers, biotechnology and pharmaceutical companies, and technology companies to improve the quality of life by providing comprehensive care where and when it's needed most. In addition, Signify Health delivers software and services that enable payers, employers and at-risk providers to organize and finance healthcare delivery around a patient's episode of care. With an innovative logistics and clinical workflow technology platform, exhaustive data set, and an unparalleled national clinical network, the company provides tech-enabled care services to vulnerable populations within the routine of their daily lives to improve health and quality of life. Signify Health delivers its services to partners at more than 1,000 healthcare locations nationwide and serves well over one million health plan members each year, providing health risk evaluations, complex care management, outcomes-based pharma services, and specialized medical services in the home and other convenient locations. Signify Health has multiple offices in Texas with additional locations in Connecticut, New York and South Dakota. To learn more, please visit www.signifyhealth.com.</p>\n<p>\n#LI-GA1</p></div>"
    },
    {
        "position": "Programming Intern (Python)",
        "company": "Lemle & Wolff, Inc",
        "location": {
            "city": "New York",
            "state": "United States"
        },
        "posted": "2021-03-26T07:53:07.984Z",
        "url": "https://www.internships.com/posting/edd9f0d0-0c91-4571-8e7d-51cc3f1f6dac",
        "lastScraped": "2021-04-07T07:53:07.984Z",
        "description": "<p>Programmer will work with asset manager and finance team to work on database.</p>"
    },
    {
        "position": "Intern – Data Analytics",
        "company": "N/A",
        "location": {
            "city": "NC",
            "state": "United States"
        },
        "posted": "2021-03-08T07:53:21.370Z",
        "url": "https://www.internships.com/posting/sam_4021172928",
        "lastScraped": "2021-04-07T07:53:21.370Z",
        "description": "<div><p>We are one of the world’s largest apparel, footwear and accessories companies connecting people to the lifestyles, activities and experiences they cherish through our family of iconic outdoor, active and workwear brands including Vans®, The North Face®, Timberland® and Dickies® .</p><p></p><p>We’re proud of the scale, diversity and resources we can make available for you so you can explore new and exciting options as your career advances forward.</p><p></p><p>We offer a uniquely supportive, people-first environment that gives you the chance to be yourself while making a real impact, every day.<br><br></p><p>We’re a down to earth and straight forward culture, filled with smart people, working incredibly hard, doing what they love while striving towards something we all believe in.</p><p></p><p>We’re determined to make a difference and set an example for social and environmental impact at scale. Everyone can play their part and see their efforts recognized, appreciated and rewarded.</p><p></p><p>All Internships will be remote. Depending on World Health Organization guidelines this may change over the course of your internship or be at the discretion of our management.</p><p></p><p>Job Title: Intern – Data Analytics</p><p></p><p>What you could be doing on a daily basis;</p><p>Join the tax department’s in-house technology team, and gain hands on experience developing applications to assist in the transformation and automation of existing manual processes as a part of Project Enable, a multi-year initiative to accelerate and transform our business model, and deliver $125M global cost savings.</p><p></p><p>You will develop code to process and manipulate inputs, perform calculations, visualized datasets, as well as perform required testing and bug fixes.</p><p></p><p>The types of strengths we would like you to bring;</p><ul><li>Pursuing a Bachelor’s/Master’s/PH.d degree in Computer Science or related Field</li><li>Experience with Python, R, RPAs, SQL</li></ul><p></p><p>Our Intern Program runs from June 7th through August 13th, 2021! During your time with us, you will have opportunities for training that will enhance you as a professional, give back in our communities and of course have FUN with your colleagues! All VF internships are paid and offer you work that matters with some of the best teams around!</p><p></p><p>Colorado Applicants :</p><p>If you are a Colorado resident and are interested in applying, you are able to request additional information about this position. To request additional information, please email us HERE. Please be sure to include the complete job title in the email message.</p></div>"
    },
    {
        "position": "Data Science Intern - Engagement Optimization",
        "company": "N/A",
        "location": {
            "city": "CA",
            "state": "United States"
        },
        "posted": "2021-03-08T07:53:34.737Z",
        "url": "https://www.internships.com/posting/sam_bb0aef9a40ac3784",
        "lastScraped": "2021-04-07T07:53:34.737Z",
        "description": "<p></p><div>About the team\n<p>\nOn the Engagement Optimization team, we focus on leveraging quantitative models and machine learning algorithms to solve client-related business problems. By personalizing client interactions across multiple marketing platforms, we are able to increase our understanding of individual preferences, improve brand loyalty, develop promotion strategies, and maximize client long term value.</p>\n\nAbout the role\n<p>\nWe are looking for someone to join us over the summer for a 10 week duration. As an intern, you will utilize our rich datasets, and gain experience as a full stack end-to-end data scientist. You will work closely with marketing stakeholders on some interesting projects, such as personalizing client-facing imagery using image processing or developing sequential marketing strategies. Then, you will have the opportunity to get your prototype into production, and launch an A/B test on the real business problem.</p>\n\nYou're excited about this opportunity because you will…\n<ul><li>Apply modern machine learning techniques to real business problems with high impact</li>\n<li>Work as a full stack data scientist to not only build the model, but also bring it into production and testing</li>\n<li>Develop your applied machine learning and software engineering skills</li>\n<li>Effectively communicate and share results with both technical and non-technical cross-functional partners</li>\n</ul>We're excited about you because you...\n<ul><li>You are a graduate student or higher in Computer Science, Statistics, Mathematics, Operations Research, Engineering or related field</li>\n<li>You have experience implementing/designing machine learning algorithms</li>\n<li>You are familiar with programming languages (preferably python), and able to adapt to new technologies</li>\n<li>You have a creative, problem-solving mindset</li>\n<li>You work well with others and have strong communication skills</li>\n</ul>Why you'll love working at Stitch Fix...\n<ul><li>We are a group of bright, kind and goal-oriented people. You can be your authentic self here, and are empowered to encourage others to do the same!</li>\n<li>We are a successful, fast-growing company at the forefront of tech and fashion, redefining retail for the next generation</li>\n<li>We are a technologically and data-driven business</li>\n<li>We are committed to our clients and connected through our vision of \"Transforming the way people find what they love\"</li>\n<li>We love solving problems, thinking creatively and trying new things</li>\n<li>We believe in autonomy &amp; taking initiative</li>\n<li>We are challenged, developed and have meaningful impact</li>\n<li>We take what we do seriously. We don't take ourselves seriously</li>\n<li>We have a smart, experienced leadership team that wants to do it right &amp; is open to new ideas</li>\n<li>You will be proud to say that you work for Stitch Fix and will know that the work you do brings joy to our clients every day</li>\n</ul>About Stitch Fix\n<p>\nStitch Fix is an online personal style service for men and women combining art and science to disrupt and redefine the retail industry. We're the first fashion retailer to blend expert styling, proprietary technology, and unique product to deliver a refined and deeply personalized shopping experience. We leverage vast amounts of client data to make decisions throughout the company. All of this results in a simple, powerful offering to our customers and a successful, growing business. We believe we are only scratching the surface of our opportunity, and we're looking for incredible people to contribute! We'd love for you to help us carry on the trend.</p>\n<p>\nPlease review Stitch Fix's Recruiting Privacy Policy here:<br>\nhttps://www.stitchfix.com/privacy/usrecruitingprivacy</p>\n<p>\n#LI-SH1</p></div>"
    }
]