[
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-29T21:40:31.023Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-04-28T21:40:31.023Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>"
    },
    {
        "position": "Data Science Instructor - Summer Interns",
        "company": "Berkeley Coding Academy",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-29T21:40:40.947Z",
        "url": "https://www.internships.com/posting/661de661-a3b2-4733-9d25-9a37e90ad4f4",
        "lastScraped": "2021-04-28T21:40:40.947Z",
        "description": "<p><span>BCA is looking for outstanding, personable instructors to lead teens in small cohorts for our Machine Learning &amp; AI online summer programs, July 12 - July 30, 2021. Your job is to ensure that all BCA students are coding and happy as they navigate our original data science curriculum in Python. You will help students correct coding errors and answer questions based on interactive video lectures that you watch with them.</span></p><p><br></p><p><span>This position requires an excitement to learn, and confidence facilitating a positive online coding environment for teens. As a cohort lead, your optimism, persistence, and knowledge-base in the world of coding is of tremendous value. Cohort leads are at the heart of Berkeley Coding Academy. You will be a mentor to our students. The success of our programs relies on your positivity and ability to effectively guide students through lectures, problem sets, and projects with minimal oversight.</span></p><p><br></p><p><span>This position is ideal for someone who is:</span></p><ul><li><span>Pursuing Python, data science, or machine learning at the college level.</span></li><li><span>Looking for part-time summer income, or a summer internship.</span></li><li><span>Personable at the level of getting teens to open up and ask questions.</span></li><li><span>Confident quickly researching information and troubleshooting errors to answer questions.</span></li><li><span>An independent worker who shines when given a leadership role.</span></li><li><span>A fast learner interested in getting paid to develop a stronger foundation in data science.&nbsp;</span></li><li><span>Excited to work for a company breaking new ground in data science education for teens.</span></li></ul><p><br></p><p><span>Expectations for the Data Science Instructor Internship include:</span></p><ul><li><span>Available July 6 - July 8 and for the entire summer program (weekdays only) July 12 - July 30, 9:15AM - 12:45PM PDT.</span></li><li><span>Facilitate cohort bonding via non-coding ice-breakers and bonus time sessions.</span></li><li><span>Watch interactive lectures with students and answer all coding questions that arise (with chat support).</span></li><li><span>Actively communicate and follow-up with students during project/problem-solving time to ensure understanding and engagement.</span></li><li><span>Monitor Slack and respond to general staff and student inquiries.</span></li><li><span>Maintain Google Sheet with all student notebooks (Google Colab) for transparency.</span></li><li><span>Distribute weekly surveys to students and incorporate feedback to improve student experience.</span></li><li><span>Contribute positively to company culture by being optimistic and being yourself.</span></li></ul><p><br></p><p><span>The following are bonuses if they happen to fall within your domain:</span></p><ul><li><span>Background in pandas, scikit-learn, keras, TensorFlow, or Deep Learning.</span></li><li><span>Pursuing career in education or deep experience working with teens.</span></li><li><span>Proficient in social media and willing to spread word about our program.</span></li></ul><p><br></p><p><span>To be considered for this role, you must present yourself pleasantly and professionally in an online education environment that will translate well for teens. You do not need to be an expert in data science. It’s enough if you have a strong foundation in computer science, preferably in Python, although a background in pandas and scikit-learn is ideal. What’s most important is a friendly, positive, personable attitude and analytical problem-solving skills.</span></p><p><br></p><p><span>To apply for this position, please submit your resume and a cover letter. Good cover letters give an indication of who you are beyond the details of your resume, and provide clarity as to why you are an excellent candidate to inspire teens in data science. Please do not apply if you are unable to commit from July 12 - July 30, 9:15AM - 12:45PM PDT. If your cover letter and resume indicate that you are a good fit for this role, someone will get back to you with the next steps. Note that candidates moving on to the next round will be required to submit a Zoom video to answer basic coding questions and demonstrate comfort with ice-breakers as part of the interview process.</span></p><p><br></p><p><span>Berkeley Coding Academy is committed to hiring a diverse staff that reflects the diversity of our growing student body.</span></p><p><br></p>"
    },
    {
        "position": "Software Development - Python",
        "company": "Annapurna Solutions",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:40:51.108Z",
        "url": "https://www.internships.com/posting/ccm_1fa5cd89-b186-4e8f-987b-e410f011d490",
        "lastScraped": "2021-04-28T21:40:51.108Z",
        "description": "<p>&nbsp;Joining Innovation Department as a Software Engineering intern gives you the opportunity to experience an exciting, fast-paced startup environment hands on. We’re looking for a passionate Computer Science student who has a strong understanding of Python to work on latest frontend and backend tools and technologies. Work directly with our Engineering team to learn how to build components of a SaaS e-Learning platform.</p><p><br></p><p>Innovation Department builds sustainability mobile solutions from the ground up. Our team of brand strategists, marketers, operators and builders are obsessed with reducing the time to product-market fit and creating repeatable success for the launch of early-stage products &amp; Services in the sustainability sector.</p><p><br></p><p>Responsibilities/ Tasks:</p><p>• Daily responsibilities will include:- Software development- Software quality assurance- Hardware/software troubleshooting and testing</p><p>• Gather requirements, develop test plans, and develop and deploy stable modules to support archiving and backup of data as required by external regulators</p><p>• Test and Validate automated backup solution along with an indexing strategy to easily retrieve relevant data based on archive properties</p><p><br></p><p>Requirements:</p><p>• Strong development skills using Python (and secondarily Perl/shell) is needed</p><p>• Require course credit or CPTOPT training for International students</p><p>• Strong expertise working in a Linux/Unix environment</p><p>• Good understanding of software design, local and cloud systems (Google cloud) is a plus</p><p>• Must have the ability to communicate effectively with engineers and software developers and be detail oriented and self-driven.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>"
    },
    {
        "position": "Summer 2021 FOX Technology Virtual Internship Program",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-04-28T21:41:16.970Z",
        "url": "https://www.internships.com/posting/wup_935291545361337",
        "lastScraped": "2021-04-28T21:41:16.970Z",
        "description": "OVERVIEW OF THE COMPANY\n\nFox Corporation\n\nUnder the FOX banner, we produce and distribute content through some of the world's leading and most valued brands, including: FOX News, FOX Sports, the Fox Network, and the FOX Television Stations. We empower a diverse range of creators to imagine and develop culturally significant content, while building an organization that thrives on creative ideas, operational expertise and strategic thinking.\n\nJOB DESCRIPTION\n\nFOX is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industry's brightest talent. The FOX Technology Virtual Internship Program is for motivated college students who are passionate about technology and the media industry. FOX Interns are paid to gain real world work experience with guidance from top industry professionals. FOX Interns are assigned to a department that matches their skill set, work experience, and career aspirations. Please note this internship is available nationwide as a remote internship opportunity."
    },
    {
        "position": "EPA Postdoctoral Fellowship in Laboratory Systems Data Analysis",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-29T21:41:25.759Z",
        "url": "https://www.internships.com/posting/8cabfa3b-43cb-4969-8a60-a75f2a7aefe8",
        "lastScraped": "2021-04-28T21:41:25.759Z",
        "description": "<p><strong>*Applications will be reviewed on a rolling-basis.</strong></p><p><br></p><p>A research opportunity is available at the U.S. Environmental Protection Agency’s (EPA) Office of Transportation and Air Quality (OTAQ). This appointment will be served with the Testing and Advanced Technology Division located in Ann Arbor, Michigan.&nbsp;<strong>*While facility is closed due to Covid-19 precautions, the&nbsp;participant will perform all research remotely. Once the facility reopens, the&nbsp;participant is required to perform all research in the lab and telework will no longer be authorized except in special circumstances, such as facility closure due to hazardous weather.</strong></p><p><br></p><p>As transportation systems become increasingly complex, government and industry stakeholders are faced with a growing need to analyze large datasets, enabled by powerful on-vehicle computing systems, high-bandwidth data connectivity and massive data storage systems. The EPA's National Vehicle &amp; Fuel Emissions Laboratory, Testing and Advanced Technology Division, is seeking a post-doctoral researcher who will collaborate with NVFEL staff and university faculty to research the novel application of machine learning and artificial intelligence algorithms to transportation-related laboratory data. The participant will have the opportunity to develop effective communication materials based on their research which could train others in the application of advanced data analysis methods to laboratory data.</p><p><br></p><p>Through this research opportunity, the participant will survey the methods and sources of environmental data at NVFEL and identify and develop algorithms for analyzing the data; further their experience with regulatory science programs and data needs in a government laboratory setting, in collaboration with NVFEL staff; and enhance skills for effective communication related to machine learning and data science.</p><p><br></p><p>The mentor for this&nbsp;opportunity is Matthew Brusstar (brusstar.matt@epa.gov).</p><p><br></p><p><strong>Anticipated Appointment Start Date:&nbsp;Fall 2021</strong></p><p><br></p><p>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE)&nbsp;to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA. The initial&nbsp;appointment&nbsp;is for one year and may be renewed upon recommendation of EPA contingent on the availability of funds. The participant will receive a monthly stipend&nbsp;commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time. Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.</p>"
    },
    {
        "position": "EPA Exposure Pathway Modeling Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-29T21:41:34.346Z",
        "url": "https://www.internships.com/posting/b9e3fa77-6d2f-44ee-897b-ed9bf314a9e5",
        "lastScraped": "2021-04-28T21:41:34.346Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE), Chemical Characterization &amp; Exposure Division (CCED) located in Research Triangle Park, North Carolina.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The EPA Center for Computational Toxicology and Exposure (CCTE) is responsible for developing new computational tools and providing quantitative analysis for improving public health and environmental risk assessments and regulatory decisions pertaining to chemical safety. Throughout the course of this project, the&nbsp;participant will collaborate with a CCTE team developing computational tools (including mechanistic and statistical models) to predict population estimates of human exposures and doses to thousands of existing and emerging chemicals in commerce. This research project will focus on characterizing exposure pathways for which predictive data or models are lacking (e.g., via ambient pathways such as via chemicals in biosolids, or occupational pathways). The models and data developed by the participant will inform EPA consensus models for these pathways.&nbsp;</p><p><br></p><p>Under the guidance of a mentor, the research participant may be involved in the following research activities:</p><ul><li>Analyzing innovative data describing how individuals come into contact with chemicals (such as information on chemical use and sources or activities relevant to the pathways in questions).&nbsp;</li><li>Analyzing, modeling, and interpreting measurement data describing chemical concentrations measured in field studies of human exposure, including concentrations measured in occupational media.&nbsp;&nbsp;</li><li>Assisting in the development of&nbsp;computational models/algorithms of chemical fate, transport, or exposure processes for priority exposure pathways.</li><li>Parameterizing and running existing or newly developed models for various chemicals, and interpret and summarize results</li><li>Performing reviews of literature or other available data for identifying measurements for evaluating exposure model algorithms and results.</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will collaborate with an integrated team of agency scientists towards generating critical research hypotheses, developing programmatic tools to test these hypotheses, and ultimately solving complex environmental health problems. Through this research training opportunity, the research participant will have the opportunity develop their programming, analytical, and communication skills.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is&nbsp;Kristin Isaacs (isaacs.kristin@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring 2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be&nbsp;for one year&nbsp;and may be renewed up to&nbsp;three to four&nbsp;additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "EPA Postdoctoral Fellowship in Bioinformatics and Computational Toxicology",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-29T21:41:43.334Z",
        "url": "https://www.internships.com/posting/e57e2a5a-096b-4232-87b3-bb630ca8a4fb",
        "lastScraped": "2021-04-28T21:41:43.334Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>Two research opportunities are&nbsp;available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Computational Toxicology and Exposure (CCTE),&nbsp;Great Lakes Toxicology&nbsp;&amp;&nbsp;Ecology Division (GLTED) located in Research Triangle Park, North Carolina or Cincinnati, Ohio.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The Agency is faced with significant challenges related to characterizing the modes of action of chemicals, the effects of exposures to mixtures of chemicals, and in finding ways to group chemicals that facilitates read-across from data rich to data poor chemicals.&nbsp;The Molecular Indicators Branch within the Office of Research and Development is addressing these challenges through the characterization of molecular responses in aquatic organisms exposed to chemicals.&nbsp;In large part, MIB targets transcriptomic and epigenetic responses using next generation sequencing (NGS)-based tools (RNA-seq, reduced representation bisulfite sequencing - RRBS) to develop biomarkers that can discriminate chemical classes and provide an understanding of impacted biological processes and pathways.&nbsp;There are also opportunities to explore and analyze other omics data including metabolomic and proteomic data from whole animal responses and multigenerational studies.&nbsp;The research participant will be part of a team involved in designing of laboratory experiments, NGS data analysis and data interpretation, design and development of new statistical methods for integrated omics data analysis, and in the communication of results intra- and extramurally.&nbsp;The research participant will be trained in molecular genetics, bioinformatics, statistics, machine learning algorithms for big data analytics, and advanced statistical analysis of complex omics data sets.</p><p><br></p><p>With guidance from the mentor, the research participant may be involved in the following training activities:</p><ul><li>Learning how to develop statistical methods and tools to analyze NGS-based gene expression and epigenetic data</li><li>Learning how to design analysis pipelines and perform analysis of RNA-seq, RRBS, other omics environmental exposure data</li><li>Providing biological context and interpretation of NGS data to characterize chemical MOA</li><li>Applying machine learning algorithms for identification of biomarkers and classification of environmental toxicants</li><li>Contributing to the preparation of peer-reviewed journal articles and disseminating research results to project partners, stakeholders, and the research community</li><li>Presenting research at regional, national, and/or international conferences and workshops</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The research participant will be afforded the opportunity to interact with internationally recognized leaders, both within and outside the EPA, the area of bioinformatics and in ecotoxicogenomics.&nbsp;The research participant will have the opportunity to contribute to and to publish original research. This training opportunity will provide an early career scientist with knowledge, skills, and abilities needed to apply new technologies and associated data to regulatory decision-making at the local, national, or international scale and to pursue a professional career in life sciences research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Weichun Huang&nbsp;(huang.weichun@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>: Spring&nbsp;2021.&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed three to four additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "USDA-ARS High Performance Computing and AI Technologies in Agriculture Fellowship",
        "company": "ORISE",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-29T21:41:52.016Z",
        "url": "https://www.internships.com/posting/ccm_95b5ee54-01bf-4c11-a351-eb453bd3c788",
        "lastScraped": "2021-04-28T21:41:52.016Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong></p><p><br></p><p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple postdoctoral research opportunities are available and&nbsp;located at various&nbsp;facilities&nbsp;with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS).</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>The U.S. Department of Agriculture - Agricultural Research Service (USDA ARS) mission involves problem-solving research in the widely diverse food and agricultural areas encompassing plant production and protection; animal production and protection; natural resources and sustainable agricultural systems; and nutrition; food safety; and quality. The programs are conducted in 46 of the 50 States, Puerto Rico, and the U.S. Virgin Islands. For ARS to maintain its standing as a premier scientific organization, major investments in computing, networking, and storage infrastructure are required. Training in data and information management are integral to the integrity, security, and accessibility of research findings, results, and outcomes within the ARS research enterprise. Nearly 2000 scientists and support staff conduct research within the ARS research enterprise.</p><p><br></p><p>The SCINet/Big Data Research Participation Program of the USDA ARS offers research opportunities to motivated postdoctoral fellows interested in working on agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales. One of the goals of the SCINet Initiative is to develop and apply new technologies, including AI and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of this fellowship is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each applicant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p>Predicting the nation’s food supply and ensuring its safety while preserving the natural resources as the environmental drivers continue to change is challenging, and requires integrating and computing vast amounts of high quality data of many different types. Data on U.S. agriculture have been collected since the 1860s. Data streams now include ground-, UAV-, air-, and satellite-based sensors and imagery as well as analyses using genomic data and manually collected data, including animal behavior studies. The advanced computing technologies, such as high performance computing, cloud computing, and AI technologies, needed to fully take advantage of these data are still being developed.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The&nbsp;participant will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct these analyses. The participant will also learn AI technologies relevant to these problems, and will develop and co-lead ARS-wide workshops resulting in a community of scientific practice with AI. The participant will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with AI across multiple spatial and temporal scales. This unique&nbsp;fellowship will allow&nbsp;participants the opportunities to apply their programming skills to real-world problems.</p><p><br></p><p><strong><u>USDA-ARS Contact:</u></strong>&nbsp;If you have questions about the nature of the research please contact Debra Peters (deb.peters@usda.gov).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year, but may be&nbsp;renewed upon&nbsp;recommendation of ARS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant(s) will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS.&nbsp;Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USDA-ARS@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "N/A",
        "location": {
            "city": "VT",
            "state": "United States"
        },
        "posted": "2021-04-28T21:42:13.633Z",
        "url": "https://www.internships.com/posting/sam_4070107230",
        "lastScraped": "2021-04-28T21:42:13.633Z",
        "description": "<div><p>Software Engineer Intern<br>Systems &amp; Software - Remote<br><br>As a Software Engineer for Systems &amp; Software, you will be placed into a small Agile Development team where you will play an important role in helping design, build, test and deploy our products. You will work hand in hand with other members on your team to support our current product lines and build out the future of our product. You will have access to the latest tools, hardware and some of the brightest software engineers in this area.<br><br>We are an agile development organization, utilizing Kanban on the support side and Scrum for our development teams. We use industry standard software development tools such as Jira, Git, Docker, Slack and Confluence to manage our iterative design, build, test, and deployment process... any experience with the above is an asset.</p><p></p><p>What we are looking for</p><ul><li>B.S in Computer Science or Computer Information in the process of, or has recently completed a bachelor of science degree in Computer Science, Software Engineering or related field</li><li>Maintains an above average GPA especially in the areas of Engineering</li><li>Has some programming experience with Java or any flavor of C</li><li>Is familiar with HTML, CSS, and JavaScript</li><li>Has an exceptional work ethic and is ambitious</li><li>Communicates well with others and is a team player</li></ul></div>"
    },
    {
        "position": "Software Engineer - Internship",
        "company": "N/A",
        "location": {
            "city": "CO",
            "state": "United States"
        },
        "posted": "2021-04-28T21:42:31.697Z",
        "url": "https://www.internships.com/posting/sam_3662246509",
        "lastScraped": "2021-04-28T21:42:31.697Z",
        "description": "<div><div><div><p>This is the perfect internship for a student or recent graduate of Software Engineering, Computer Science, or Electrical Engineering with academic training in software code development and systems integration on embedded processors and Linux and Windows systems. We are looking for an innovative software developer with limited knowledge of hardware and firmware integration. This intern will work under the direction of a Senior Systems Engineer to help develop and test new NAVSYS GPS products. This intern will use C/C++, HTML, Java Script, MATLAB and Linux based tools, which enable GPS data analysis &amp; signal processing, and will focus on the use of data from Global Navigation Satellite Systems (GNSS). The intern will assist with writing and testing software code to support GPS development and write documentation while learning a lot about GPS and GNSS.</p></div></div></div><div></div>"
    },
    {
        "position": "Federal and Commercial Programs Internship",
        "company": "Capitol Advisors on Technology",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-03-29T21:42:41.666Z",
        "url": "https://www.internships.com/posting/5a4c09d5-5d49-426d-a958-ccbe9d365636",
        "lastScraped": "2021-04-28T21:42:41.666Z",
        "description": "<p><u>Position Summary</u>:</p><p>The intern will work under the direction of a Capitol Advisors on Technology staff member and provide strategic support for multiple programs to include One Acquisition Solution for Integrated Service (OASIS), the National Center for Manufacturing Sciences (NCMS), and future programs. </p><p><br></p><p>Responsibilities will include the management of electronic communications from OASIS 8(a) Sub-Pool1 &amp; Sub-Pool4.&nbsp;Identify mandatory training requirements or participation in seminars and report the information to pertinent staff.&nbsp;Provide an ongoing review of opportunities in databases such as, Capture Exec, GSA eBuy and Beta.gov and execute appropriate and timely responses in accordance with established guidelines and practices.&nbsp;Effectively manage the coordination of meetings with NCMS staff members.&nbsp;Provide prompt and professional follow-through on requests from NCMS and others.&nbsp;&nbsp;Lead the coordination and scheduling of regular conference calls for Capitol Advisors on Technology President and Program Managers. Marketing and Outreach projects may include creating and distributing&nbsp;Pozomy Capability Statements to designated Federal agencies and others as directed.&nbsp;Initiate communication with Federal, state, and local government POC’s to arrange meetings or presentations.</p>"
    },
    {
        "position": "USFS Bioacoustics Monitoring Program",
        "company": "ORISE",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-03-29T21:42:50.877Z",
        "url": "https://www.internships.com/posting/8de07b29-f7ea-4a7e-83dd-430276792b65",
        "lastScraped": "2021-04-28T21:42:50.877Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A&nbsp;research opportunity is&nbsp;available at the USDA Forest Service located in Springfield, Oregon.&nbsp;Research will take place in Oregon’s Cascade Range, near the HJ Andrews Study Area and Blue River, Oregon.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p>The mission of the Ecological Process and Function Program is to advance and communicate knowledge of fundamental ecological processes and interactions&nbsp;across scales and develop applications of this knowledge to enable improved management of ecosystems and resources.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The Bioacoustics Monitoring Program conducts passive bioacoustics research as an alternative method to monitor trends in wildlife populations that takes advantage of technological advancements in non-invasive detection equipment.&nbsp;</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant&nbsp;will gain first-hand, on the ground experience with logistics involved with conducting bioacoustics wildlife monitoring using autonomous recording units in remote mountainous areas to monitor for the presence of wildlife, including spotted owls, and other birds and mammals. Participant will also learn about emerging artificial intelligence frameworks and data organizational structures used for efficiently analyzing large amounts of bioacoustics data and will have the opportunity to connect with researchers on the forefront of this evolving field of wildlife research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Todd Wilson (todd.wilson@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring/Summer 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for three months, but may be&nbsp;renewed upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>"
    },
    {
        "position": "Intern Permitting Specialist",
        "company": "SMJ International",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:42:59.645Z",
        "url": "https://www.internships.com/posting/afad97f9-b084-4d5d-add0-24068f93be5e",
        "lastScraped": "2021-04-28T21:42:59.645Z",
        "description": "<p><span>This intern is responsible to research the permitting process for cell site modifications.&nbsp;Specific responsibilities include the assessment of appropriate zoning codes and regulations, the submission of zoning applications on behalf of individual wireless carriers and tower owners and following up to obtain all zoning and permitting approvals. &nbsp;Interns are responsible for gaining the appropriate building permit approvals in order to modify, improve, or construct a telecommunication site.</span></p><p><br></p><p><span>SMJ International is located in Wixom, MI.&nbsp;This position is remote and geographic presence is not required.&nbsp;The individual will typically be a college intern who is in prelaw, paralegal, real estate investment, etc.&nbsp;&nbsp;</span></p>"
    },
    {
        "position": "Intern Permitting Specialist",
        "company": "SMJ International",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:43:08.178Z",
        "url": "https://www.internships.com/posting/79ba4140-d7a8-4d37-ab64-c10f46de680f",
        "lastScraped": "2021-04-28T21:43:08.178Z",
        "description": "<p><span>This intern is responsible to research the permitting process for cell site modifications.&nbsp;Specific responsibilities include the assessment of appropriate zoning codes and regulations, the submission of zoning applications on behalf of individual wireless carriers and tower owners and following up to obtain all zoning and permitting approvals. &nbsp;Interns are responsible for gaining the appropriate building permit approvals in order to modify, improve, or construct a telecommunication site.</span></p><p><br></p><p><span>SMJ International is located in Wixom, MI.&nbsp;This position is remote and geographic presence is not required.&nbsp;The individual will typically be a college intern who is in prelaw, paralegal, real estate investment, etc.&nbsp;&nbsp;</span></p>"
    },
    {
        "position": "Software Development Intern",
        "company": "N/A",
        "location": {
            "city": "NC",
            "state": "United States"
        },
        "posted": "2021-04-28T21:43:26.251Z",
        "url": "https://www.internships.com/posting/sam_3667444793",
        "lastScraped": "2021-04-28T21:43:26.251Z",
        "description": "<div><p>If you are a current student looking for an opportunity with a company you can grow with…look no further! We are seeking part-time remote interns for the 2020-2021 school year to join our software development product team. We are interested in students who have at least completed their sophomore year of college within computer science, computer engineering, or a related discipline with professional/intern experience. Knowledge of various programming and database/network technologies, with a particular emphasis on Java are strongly preferred. This paid internship will start at a minimum of 15 hours per week with room to grow into a full time role during extended breaks or after graduation.</p><p>As an intern with Republic Wireless, you will have the opportunity to work with top engineers in the industry on cutting edge technologies including Java, Android, REST APIs, networking, telecommunication, cloud services, and Python. This is a small team with a large variety of responsibilities, so you may engage in a large breadth of topics. Take a look at our products at https://relaygo.com/ and https://play.google.com/store/apps/details?id=com.republicwireless.tel</p><p>Republic Wireless is reinventing the telecom industry, and now you have the opportunity to learn and grow with us. Take the next step in your career and apply!</p><p>Primary Responsibilities:</p><ul><li>Work in close coordination with other engineers in complex environments on a combination of the following: implement tools to enable teams to go faster, contribute directly to product functionality, and triage and resolve issues.</li><li>Analyze requirements to determine the feasibility and architecture of proposed projects and solutions, including risk assessment and simple project estimation.</li><li>Participate in the team's software development process and tooling.</li><li>Develop automated tests for the function you develop.</li><li>Have a strong interest in researching best practices in software development, and sharing new knowledge with the team.</li></ul><p>Required Qualifications:</p><ul><li>Currently enrolled in a Computer Science or equivalent course of study.</li><li>1+ years of development experience in Java. Android experience is a plus, but not required.</li><li>Strong development skills including knowledge of object-oriented programming (OOP) fundamentals and design patterns.</li><li>Ability to work well in a team environment and have empathy for others.</li><li>Strong communication and problem solving skills.</li><li>Commitment to tackle challenging problems, and hungry to learn.</li><li>Care deeply about quality and the customer experience. Build elegant and simple solutions.</li><li>Adaptable to change, can operate independently and with initiative.</li><li>Evaluate ideas based on merit, and consistently work to generate customer value.</li></ul></div>"
    },
    {
        "position": "USFS Bioacoustics Monitoring Program",
        "company": "ORISE",
        "location": {
            "city": "Oregon",
            "state": "United States"
        },
        "posted": "2021-03-29T21:43:34.991Z",
        "url": "https://www.internships.com/posting/8de07b29-f7ea-4a7e-83dd-430276792b65",
        "lastScraped": "2021-04-28T21:43:34.991Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis.</strong></p><p><br></p><p><strong><u>USFS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>A&nbsp;research opportunity is&nbsp;available at the USDA Forest Service located in Springfield, Oregon.&nbsp;Research will take place in Oregon’s Cascade Range, near the HJ Andrews Study Area and Blue River, Oregon.</p><p><br></p><p>At the heart of the U.S. Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the U.S. Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.</p><p><br></p><p>The mission of the Ecological Process and Function Program is to advance and communicate knowledge of fundamental ecological processes and interactions&nbsp;across scales and develop applications of this knowledge to enable improved management of ecosystems and resources.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;The Bioacoustics Monitoring Program conducts passive bioacoustics research as an alternative method to monitor trends in wildlife populations that takes advantage of technological advancements in non-invasive detection equipment.&nbsp;</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The participant&nbsp;will gain first-hand, on the ground experience with logistics involved with conducting bioacoustics wildlife monitoring using autonomous recording units in remote mountainous areas to monitor for the presence of wildlife, including spotted owls, and other birds and mammals. Participant will also learn about emerging artificial intelligence frameworks and data organizational structures used for efficiently analyzing large amounts of bioacoustics data and will have the opportunity to connect with researchers on the forefront of this evolving field of wildlife research.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity&nbsp;is&nbsp;Todd Wilson (todd.wilson@usda.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Spring/Summer 2021.&nbsp;&nbsp;</strong>Start date is flexible and will&nbsp;depend on a variety of&nbsp;factors.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for three months, but may be&nbsp;renewed upon&nbsp;recommendation of&nbsp;USFS&nbsp;and is contingent on the availability of funds.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.</p><p><br></p><p><strong><u>Citizenship Requirements</u>:&nbsp;</strong>This opportunity is available to U.S. citizens,&nbsp;Lawful Permanent Residents (LPR), and foreign nationals.&nbsp;Non-U.S. citizen applicants should refer to the&nbsp;Guidelines for Non-U.S. Citizens Details page&nbsp;of the program website for information about the valid immigration statuses that are acceptable for program participation.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USFS.&nbsp;Participants do not become employees of USDA, USFS, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please visit our&nbsp;Program Website. After reading, if you have additional questions about the application process please email&nbsp;USForestService@orise.orau.gov&nbsp;and include the reference code for this opportunity.&nbsp;</p>"
    },
    {
        "position": "EPA Air Pollution and Atmospheric Modeling Systems MS Fellowship",
        "company": "ORISE",
        "location": {
            "city": "North Carolina",
            "state": "United States"
        },
        "posted": "2021-03-29T21:43:43.547Z",
        "url": "https://www.internships.com/posting/ce9ccf58-297a-4690-9fdc-cf458c7200cd",
        "lastScraped": "2021-04-28T21:43:43.547Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>A research opportunity is available at the Environmental Protection Agency (EPA), Office of Research and Development (ORD), Center for&nbsp;Environmental&nbsp;Measurement and Modeling (CEMM),&nbsp;Atmospheric and Environmental&nbsp;Systems Modeling&nbsp;Division (AESMD)&nbsp;located in&nbsp;Research Triangle Park, North Carolina. Scientists in the&nbsp;CEMM AESMD&nbsp;develop and apply large scale comprehensive atmospheric systems to study various aspects of air pollution.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;This research project will attempt to quantify the effects of new model developments in both the hemispheric CMAQ (H-CMAQ) and the next generation global MPAS-CMAQ modeling system on background pollution and the contributions from domestic and international anthropogenic sources, along with natural emission sources. This research project may include developments of a consistent setup for both the H-CMAQ and MPAS-CMAQ modeling platforms; a protocol for quantifying background pollution through emission perturbation simulations, source apportionment, and/or DDM simulations; and, an approach for prioritizing which specific model updates (e.g. halogen chemistry, deposition, secondary organic aerosols) should be tested through this platform.</p><p><br></p><p>Research activities may include:</p><ul><li>Setting up, performing, and analyzing simulations using regional WRF-CMAQ, hemispheric WRF-CMAQ and global MPAS-CMAQ configurations to enable model inter-comparisons</li><li>Developing methods for quantifying observed and simulated hemispheric and global background air pollution</li><li>Obtaining new observation datasets (e.g. satellite data) and developing new tools/methods to use those data in hemispheric/global model evaluation</li><li>Use existing methods and/or develop new methods to estimate the impact of different model configurations on simulated background air pollution</li><li>Developing new methods to test the various individual components of the CMAQ modeling system to determine their importance in estimating background air pollution</li></ul><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>In collaboration with the AESMD scientists, the research participant will learn how to develop and apply large scale comprehensive atmospheric modeling systems to study various aspects of air pollution. This research training opportunity will give the research participant experience that extends skills acquired through their advanced degree education.</p><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for this opportunity is Wyat Appel&nbsp;(appel.wyat@epa.gov). If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for&nbsp;one year&nbsp;and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required </p><p>for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "EPA Water Quality Assessment Analysis Fellowship",
        "company": "ORISE",
        "location": {
            "city": "District of Columbia",
            "state": "United States"
        },
        "posted": "2021-03-29T21:43:56.389Z",
        "url": "https://www.internships.com/posting/e6a64e43-6f4d-4225-8de4-018460bfe327",
        "lastScraped": "2021-04-28T21:43:56.389Z",
        "description": "<p><strong>*Applications may be reviewed on a rolling-basis and this posting could close before the deadline.</strong>&nbsp;Click&nbsp;<strong>here</strong>&nbsp;for information about the selection process.</p><p><br></p><p><strong><u>EPA Office/Lab and Location</u>:&nbsp;</strong>One to two&nbsp;research opportunities are available at the U.S. Environmental Protection Agency (EPA) in the Office of Water (OW), Office of Wetlands, Oceans and Watersheds (OWOW) Nonpoint source Program located in Washington D.C.</p><p><br></p><p><strong><u>Research Project</u>:</strong>&nbsp;EPA research project involving research and&nbsp;analysis focused on the successful use of Clean Water Act Section 319 nonpoint source funding for achieving water quality improvements, as well as researching state Nonpoint Source Management Plans and local scale watershed plans.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>With guidance from the mentor the participant will have the opportunity to:</p><ul><li>evaluate water quality results in proposed nonpoint success stories from state agencies prior to publication</li><li>evaluate implementation of best management practices and water quality monitoring for controlling nonpoint source pollution</li><li>analyze effective approaches and measures in watershed planning to protect water quality</li></ul><p><br></p><p><strong><u>Mentor(s)</u>:&nbsp;</strong>The mentor for these opportunities is Cynthia Curtis (Curtis.cynthia@epa.gov).&nbsp;If you have questions about the nature of the research please contact the mentor(s).</p><p><br></p><p><strong><u>Anticipated Appointment Start Date</u>:&nbsp;Summer 2021.&nbsp;&nbsp;</strong>All start dates are flexible and vary depending on numerous factors. Click&nbsp;<strong>here</strong>&nbsp;for detailed information about start dates.</p><p><br></p><p><strong><u>Appointment Length</u>:&nbsp;</strong>The appointment will initially be for one year and may be renewed up to three additional years upon EPA recommendation and subject to availability&nbsp;of funding.</p><p><br></p><p><strong><u>Level of Participation</u>:&nbsp;</strong>The appointment is full-time.</p><p><br></p><p><strong><u>Participant Stipend</u>:&nbsp;</strong>The participant will receive a monthly stipend commensurate with educational level and experience.<strong>&nbsp;</strong>At this time, master's degree stipends are ~$60,129 per year. Click<strong>&nbsp;</strong><strong>here</strong>&nbsp;for detailed information about full-time stipends.</p><p><br></p><p><strong><u>EPA Security Clearance</u>:&nbsp;</strong>Completion of a successful background investigation by the Office of Personnel Management (OPM) is required for an applicant to be on-boarded at EPA.</p><p><br></p><p><strong><u>ORISE Information</u>:&nbsp;</strong>This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA.&nbsp;Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.&nbsp;Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.</p><p><br></p><p><strong><u>Questions</u>:</strong>&nbsp;Please see the&nbsp;FAQ section&nbsp;of our website. After reading, if you have additional questions about the application process please email&nbsp;EPArpp@orau.org&nbsp;and include the reference code for this opportunity.</p>"
    },
    {
        "position": "Software Development Intern",
        "company": "N/A",
        "location": {
            "city": "NC",
            "state": "United States"
        },
        "posted": "2021-04-28T21:44:14.327Z",
        "url": "https://www.internships.com/posting/sam_3667444793",
        "lastScraped": "2021-04-28T21:44:14.327Z",
        "description": "<div><p>If you are a current student looking for an opportunity with a company you can grow with…look no further! We are seeking part-time remote interns for the 2020-2021 school year to join our software development product team. We are interested in students who have at least completed their sophomore year of college within computer science, computer engineering, or a related discipline with professional/intern experience. Knowledge of various programming and database/network technologies, with a particular emphasis on Java are strongly preferred. This paid internship will start at a minimum of 15 hours per week with room to grow into a full time role during extended breaks or after graduation.</p><p>As an intern with Republic Wireless, you will have the opportunity to work with top engineers in the industry on cutting edge technologies including Java, Android, REST APIs, networking, telecommunication, cloud services, and Python. This is a small team with a large variety of responsibilities, so you may engage in a large breadth of topics. Take a look at our products at https://relaygo.com/ and https://play.google.com/store/apps/details?id=com.republicwireless.tel</p><p>Republic Wireless is reinventing the telecom industry, and now you have the opportunity to learn and grow with us. Take the next step in your career and apply!</p><p>Primary Responsibilities:</p><ul><li>Work in close coordination with other engineers in complex environments on a combination of the following: implement tools to enable teams to go faster, contribute directly to product functionality, and triage and resolve issues.</li><li>Analyze requirements to determine the feasibility and architecture of proposed projects and solutions, including risk assessment and simple project estimation.</li><li>Participate in the team's software development process and tooling.</li><li>Develop automated tests for the function you develop.</li><li>Have a strong interest in researching best practices in software development, and sharing new knowledge with the team.</li></ul><p>Required Qualifications:</p><ul><li>Currently enrolled in a Computer Science or equivalent course of study.</li><li>1+ years of development experience in Java. Android experience is a plus, but not required.</li><li>Strong development skills including knowledge of object-oriented programming (OOP) fundamentals and design patterns.</li><li>Ability to work well in a team environment and have empathy for others.</li><li>Strong communication and problem solving skills.</li><li>Commitment to tackle challenging problems, and hungry to learn.</li><li>Care deeply about quality and the customer experience. Build elegant and simple solutions.</li><li>Adaptable to change, can operate independently and with initiative.</li><li>Evaluate ideas based on merit, and consistently work to generate customer value.</li></ul></div>"
    },
    {
        "position": "USDA-ARS Research Opportunity in Geospatial Analyses of Agroecosystem Dynamics",
        "company": "Oak Ridge Institute for Science and Education",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:44:26.908Z",
        "url": "https://www.internships.com/posting/50ce241e-77c3-4139-8d3b-ecc0708feae0",
        "lastScraped": "2021-04-28T21:44:26.908Z",
        "description": "<p><strong><u>ARS&nbsp;Office/Lab and Location</u>:&nbsp;</strong>Multiple&nbsp;master's level research opportunities&nbsp;are currently&nbsp;available with&nbsp;the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS) located at multiple ARS units across the country.</p><p><br></p><p>This research opportunity is part of the SCINet Fellowship program at ARS. All fellows will spend time at headquarters for some of their training, but will be based&nbsp;in&nbsp;another ARS research unit&nbsp;for more specific training.&nbsp;The SCINet/Big Data Program at ARS offers research opportunities to motivated participants interested in&nbsp;solving agricultural- and natural resource-related problems at a range of spatial and temporal scales, from the genome to the continent, and sub-daily to evolutionary time scales, as well as metadata enhancement for data discovery. One of the goals of the SCINet Initiative is to develop and apply new technologies, including artificial intelligence (AI) and machine learning, to help solve complex agricultural problems that also depend on collaboration across scientific disciplines and geographic locations. In addition, many of these technologies rely on the synthesis, integration, linkage, and analysis of large, diverse datasets that benefit from high performance computers (HPC). The objective of these opportunities is to facilitate cross-disciplinary, cross-location research through collaborative research on problems of interest to each&nbsp;participant and amenable to or required by the HPC environment. Training will be provided in specific AI, machine learning, deep learning, and statistical software needed for the HPC.</p><p><br></p><p><strong><u>Research Project</u>:&nbsp;</strong>Agro-ecosystem dynamics across multiple spatial and temporal scales need to account for interactions within and among spatial units, such as movement of animals that can spread disease, spatial heterogeneity in soils leading to variability in crop yield, and extreme weather resulting in large pulses in production in one year followed by losses in the next year. Machine learning, deep learning, and other AI technologies combined with geospatial software for analysis (e.g., ArcGIS) provide promise to reduce uncertainty in predictions of agricultural production under these highly variable spatial and temporal conditions.</p><p><br></p><p><strong><u>Learning Objectives</u>:&nbsp;</strong>The successful candidate will have the opportunity to learn about the challenges in predicting dynamics of agro-ecosystems while learning a range of computational skills needed to conduct complex geospatial analyses in an HPC and cloud-based environment. The successful candidate will also learn AI technologies relevant to these problems. The successful candidate will also have the opportunity to collaborate with multiple USDA ARS scientists on data analysis projects, and to write collaborative scientific papers dealing with geospatial analyses across multiple spatial and temporal scales.</p>"
    },
    {
        "position": "Intern, Strategic Partnerships - Market Research & Business Development",
        "company": "SigFig",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:44:37.594Z",
        "url": "https://www.internships.com/posting/2176fdb9-b237-4291-b300-3edef233833b",
        "lastScraped": "2021-04-28T21:44:37.594Z",
        "description": "<p>We are SigFig.&nbsp;We’re here to empower everyone to achieve their life goals and ambitions. It takes extraordinary people to disrupt decades of legacy financial practices to reimagine solutions to be customer-centric, engaging, and intuitively designed that use technology to serve customers at scale.</p><p><br></p><p>We are committed to building impactful financial solutions that are accessible and affordable to everyone. Using a combination of design, data science, and technology, we help provide people with financial advice and guidance they need to achieve their life goals. Whether it’s through our direct-to-consumer or businesses-to-consumer products through partnerships with some of the world’s largest and most innovative financial institutions like Wells Fargo, UBS, and Citizens Bank, SigFig seeks to help consumers and institutions make better financial decisions.</p><p><br></p><p>Headquartered in San Francisco, we also have amazing talent solving interesting problems across our offices in Tucson, Calgary, Singapore, and New Delhi, but also remote employees in 14 states across the U.S.</p><p>Come thrive at SigFig!</p><p><br></p><p>The Team -- Strategic Partnerships</p><p>The Strategic Partnerships team exists to support our enterprise partners in leveraging SigFig-powered solutions to create meaningful value for their customers, employees, and organizations. Within Strategic Partnerships, a variety of sub-teams play specialized roles in acquiring new partners and driving the deployment and ongoing success of partner-specific programs across our Digital Wealth and Atlas solutions. These teams include Enterprise Sales, Relationship Management, Advisor Consulting, and Enterprise Product Marketing.</p><p><br></p><p>The Opportunity - Strategic Partnerships Intern</p><p>You will have the opportunity to directly support high-impact projects related to engaging and closing new partnerships, working across different lines of business and collaborating closely with Sales, Marketing, and other sub-teams. You will conduct market and account research to enable partnership activities and better inform our business development strategy, as well as drafting thought leadership and marketing content.This is a paid 2 to 3-month full-time REMOTE internship.</p><p><br></p><p>How You’ll Make an Impact</p><ul><li>Work closely with the VPs of Sales to create research-based account mappings and target buyer profiles for top opportunities.</li><li>Research, synthesize and write briefings to equip VPs of Sales with relevant and updated information on recent press, annual reports, and strategic priorities for top accounts.</li><li>Identify and organize target prospects and other key stakeholders at accounts, helping VPs of Sales to create strategic account-based plans.</li><li>Collaborate with Enterprise Marketing &amp; Demand Generation to research industry trends and market patterns to create useful, evidence-based thought leadership pieces.</li><li>Draft content copy for various marketing assets and SigFig blog, collaborating cross-functionally with Sales &amp; Marketing teams.</li><li>Support various revenue intelligence projects, such as improving deal forecasting models and analytics reportings within the CRM.</li><li>For candidates with strong creative design skills: support creation of custom sales collateral and assets, such as decks and one-pagers.</li><li><br></li></ul><p>Why We Value You</p><ul><li>Strong qualitative research skills and an excellent writer (as demonstrated by your cover letter!).</li><li>Curious about FinTech, Banking, Wealth Management, and/or Tech Startups.</li><li>Proactive, biased-to-action mentality.</li><li>Enrolled in a 4-year undergraduate program, preferably entering junior or senior year.</li><li>Able to work independently and dedicate 40 hours/week during the program.</li><li>Must be legally authorized to work in the United States without restriction.</li><li>Willing to submit to a background investigation, including verification of your employment and criminal history.</li><li>Must be 18 years of age or older.</li><li><br></li></ul><p>**To apply, please submit an updated resume/CV and a cover letter describing your interest in the role. Applications without cover letters will NOT be considered. You may also submit an optional work sample if you believe a project you’ve recently completed shows relevant transferable skills.**</p><p><br></p><p>Founded in 2006, SigFig is backed by premier venture capital firms, including Bain Capital Ventures, DCM Ventures, Nyca Partners, and Union Square Ventures as well as leading financial institutions including Wells Fargo, UBS, Santander, New York Life, Eaton Vance, and Comerica. We've raised $110 million to support our growth as the #1 online investment advisor for large financial institutions.</p><p>© Nvest. All rights reserved, SigFig is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, religion, color, gender identity, sexual orientation, age, disability, veteran status, or other applicable legally protected characteristics. We encourage people of different backgrounds, experiences, abilities and perspectives to apply. San Francisco Applicants: SigFig will consider applicants with arrest and conviction records (criminal histories) in a manner consistent with the San Francisco Fair Chance Ordinance.</p><p><br></p><p><br></p>"
    },
    {
        "position": "Process Improvement Intern - Systems",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-04-28T21:45:03.334Z",
        "url": "https://www.internships.com/posting/bug_38985729639",
        "lastScraped": "2021-04-28T21:45:03.334Z",
        "description": "Process Improvement Intern - Systems\n\nJob Summary:\n\nLooking for a high potential, summer internship candidate with the passion to apply University Technical Learning to real life applications. Someone with the interest to work with People and improve Processes. The candidate will support our 3 manufacturing facilities in establishing and adopting process standards and tools to be used to optimize manufacturing operations.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS  This job description reflects managements assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned.\n\nPercentage of Time\n\n70%\n\nEstablish Manufacturing Systems, Tools, and Templates\n\n* Partner with team members from each of our 3 factories to develop standard tools and templates to be leveraged in improvement and problem-solving activities at the sites.\n* With input from others, develop a methodology for when and how respective tools/templates are used by the Manufacturing team members.\n\n25%\n\nDevelop a SharePoint library for team members to access various tools and templates\n\n* Develop a framework and build a SharePoint (or other) library to house all continuous improvement and problem-solving tools and templates.\n* Implement a standard method for versioning/updating all content within the library, including a cadence for organizational review and sign-off.\n\n5%\n\nProject Status &amp; Completion Presentation\n\n* Assembly of work product into an end of assignment presentation to be given to an audience of Blue Diamond Senior Leaders\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior class standing at a university working towards a degree\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Working towards a degree in Engineering or Business Administration\n* Interested in working with people\n* Interested in Food Manufacturing\n* Interesting in Project Management\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Willingness to tackle the challenges presented to the candidate\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Safety, Quality, Finance, Operations, Process Improvement, Senior Site Leadership, etc.\n* Contractors, Operators, Mechanics, and Quality Technicians\n\nPHYSICAL DEMANDS\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nWORK ENVIRONMENT\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$25.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor."
    },
    {
        "position": "Staffing Sales Intern",
        "company": "Express Employment Professionals Brooklyn NY",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:45:14.546Z",
        "url": "https://www.internships.com/posting/ccm_a41c6776-f6cc-4571-af64-2233888172e3",
        "lastScraped": "2021-04-28T21:45:14.546Z",
        "description": "<p><strong>Remote/Outside Sales</strong></p><p><strong><em>*WORK REMOTELY*</em></strong></p><p>A very successful&nbsp;<strong>Staffing/Recruitment&nbsp;Firm&nbsp;</strong>located in&nbsp;<strong>Brooklyn, NY&nbsp;</strong>is looking for full-time/part-time (minimum of 25 hours weekly) motivated and high energy&nbsp;<strong>Remote/Outside Sales&nbsp;</strong>to join our team. You must possess a sales driven personality.</p><p><br></p><p><strong>APPLY IF YOU ARE OPEN TO COMMISSION ONLY MODEL</strong></p><p><br></p><p><strong><em>Full-time and Part-time positions are available</em></strong></p><p>Looking for motivated and high energy sales personnel to join our team. We are a fun, flexible, entrepreneurial company with high standards looking for individuals who want to work hard and find success in the exciting and growing staffing and recruiting industry.</p><p><br></p><p><strong>We provide full training and support to enhance your careers. Due to COVID-19 all training and support will be conducted remotely.</strong></p><p><br></p><p><strong>Responsibilities of the Remote/Outside Sales</strong></p><p>· Being able to multi-task in a fast paced environment and balance outbound &amp; inbound phone calls, email communications, and detailed database entries</p><p>· Utilizing excellent communication skills to interact with prospective and existing clients to describe job details, pay, and benefits</p><p>· Generating a high quality pipeline of potential client by making a high volume of calls daily</p><p>· Working in a fast paced, deadline sensitive business</p><p>· Providing excellent client service</p><p>· Outside Sales personnel will customarily be going outside of the office, soliciting new clients/sales</p><p><br></p><p><strong>Characteristics of a successful Recruiter/Outside Sales</strong></p><p>· Must be computer savvy</p><p>· Competitive nature</p><p>· A sales/recruiter background</p><p>· Dedicated hard-worker</p><p>· Independent</p><p>· Persuasive/Persistent</p><p>· Critical thinker</p><p>· Strong negotiating skills</p><p>· Good communication skills</p><p>· Must be a go-getter</p><p>· Able to handle potential customer objections</p><p><br></p><p>Experience:</p><ul><li>Sales: 1 year (Required)</li></ul><p>Hours per week:</p><ul><li>20-29</li></ul><p>Paid Training:</p><ul><li>No</li></ul><p>Management:</p><ul><li>Team Lead</li></ul><p>Typical start time:</p><ul><li>10 AM ET</li></ul><p>Typical end time:</p><ul><li>4 PM ET</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Aggressive -- competitive and growth-oriented</li><li>Outcome-oriented -- results-focused with strong performance culture</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p><br></p><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p><br></p>"
    },
    {
        "position": "Video Editor",
        "company": "Pearl Lemon",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:45:26.492Z",
        "url": "https://www.internships.com/posting/3976d31b-a331-4d35-b0d3-19f918d0a682",
        "lastScraped": "2021-04-28T21:45:26.492Z",
        "description": "<span>About Pearl Lemon</span><ul><li class=\"ql-align-justify\"><span>Pearl Lemon is a multiple-award-winning SEO &amp; Lead Generation Agency based in the heart of London but serving clients worldwide. With a team of 25 dotted across the UK, USA, Romania, India, Pakistan, Philippines and more, they operate around the clock and communicate predominantly through Whatsapp that function more like a silicon-valley-startup and have a work ethic comparable to investment bankers. It’s not a surprise when you consider their founder Deepak Shukla is an ex-Deloitte consultant and 30x marathon runner.&nbsp;</span></li></ul><p><br></p><ul><li class=\"ql-align-justify\"><span>Check out a lot of video and written testimonials of our team members as well as their weekly updates in the 'Blog' section and Apply Here - https://pearllemonplacements.com/</span></li></ul><span>Benefits of working with Pearl Lemon</span><ul><li><span>Learn Very Very Fast</span></li><li><span>Work with TedX Speakers</span></li><li><span>Work with ultramarathon runners, speakers of multiple languages</span></li><li><span>Work with a fully digital and remote team across different time zones</span></li><li><span>Build and grow entirely in the cloud</span></li><li><span>International work-cations where we meet and work in a foreign country for a week</span></li><li><span>Worst case - learn tons, get an amazing reference and move forward</span></li><li><span>Best case - go full time, build your personal brand and work from anywhere in the world</span></li><li><span>Take your digital skills you learn with us and apply to any job in any industry</span></li><li><span>Work remotely and manage 100% of your time</span></li></ul><span><span class=\"ql-cursor\">﻿</span>The role</span><p><span>Pearl Lemon is looking for a highly motivated and driven person to help drive forward our ambitious growth plans throughout 2021 and beyond. You will be an important part of a tight-knit team who have a hands-on approach and are passionate about taking the business to the next level.</span></p><p><span>The Video Editor is an integral part of our team. We are looking for someone that will be responsible for marketing and publicizing our services. A person that has a spirit of initiative, is thorough, works well with others, can develop concepts, has knowledge of computer operating systems, hardware and software.</span></p><p><span>There will be a focus on developing the Pearl Lemon and software brands through thought, leadership, content creation, design, research, and other steep learning-based tasks.</span></p><p><span>We are looking for someone who prides themselves on their speed of communication, attention-to-detail, and meticulous planning skills, but can adapt to change in a very fast-moving environment.</span></p><p><span>A strong understanding of digital marketing is essential, as are exceptional people and communication skills to work with an entirely remote team.</span></p><p><br></p><span>POSSIBLE responsibilities will include:</span><ul><li><span>Creating videos from scratch to post on our websites</span></li><li><span>Creating demo videos while using our tools</span></li><li><span>Editing existing content</span></li><li><span>Assembling all raw footage and adding subtitles to it</span></li><li><span>Inputting uncut rushes and sound to existing and new videos</span></li></ul><p><br></p><p><br></p>"
    },
    {
        "position": "Innovation Business Strategy & Analytics Intern, Snacks",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-04-28T21:45:46.578Z",
        "url": "https://www.internships.com/posting/bug_38985729641",
        "lastScraped": "2021-04-28T21:45:46.578Z",
        "description": "Innovation Business Strategy &amp; Analytics Intern, Snacks\n\nJob Summary:\n\nInnovation Business Strategy &amp; Analytics Intern  Support of Snacks Innovation Pipeline Build.\n\nIn this role, you will leverage your skills to drive new business opportunities through the discovery and evaluation phases and into the eventual integration of a new product, service, or technology at Blue Diamond Growers.\n\nThis position will start in June and complete in August. This position will require a 40 hour per week commitment.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS (w/ percentage of time)\n\n* Working with our internal Insights group, assess market research and compile detailed summary and recommendations for moving defined new product concepts into discovery phase.\n* Analyze and summarize IRI data for selected new concept target products / categories.\n* Conduct secondary market research, e.g., web-based research.\n* Prepare PowerPoint presentations that consolidate learnings into a concise and meaningful presentations, while ensuring key communications are covered.\n* On site visits to grocery stores, clubs, and mass merchants for product evaluation.\n* Assist Innovation team with ongoing projects as needed.\n\nPercentage of Time\n\n60%\n\n*  Essential Job Function: Research and Analysis\n* What learning or experience will the Intern gain:\n* How to think about the innovation process from the earliest stages of development.\n* Using analysis to compile learnings and ultimately develop a recommendation.\n\n30%\n\n* Essential Job Function: Presentation and Report Development\n* What learning or experience will the Intern gain:\n* Critical thinking to develop strategic recommendations.\n\n10%\n\n* Essential Job Function: Assist Innovation team on Various Projects\n* What learning or experience will the Intern gain:\n* Real time / real life on the job requirements.\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior or Senior class standing at a university working towards a degree.\n* Strong interest and experience in innovation, entrepreneurship, marketing, or related topics.\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Pursuing a degree in Business, Marketing, Design, Communications.\n* Strong communication, collaboration, research, and presentation skills.\n* Inquisitive, willing to challenge the status quo.\n* Proficient in Microsoft Office suite.\n* Ability to perform market research, data analytics, financial modeling.\n* Familiar with marketing and storytelling tactics.\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Assessment of analysis and critical thinking of proprietary data and IRI analytics.\n* Ability to complete tasks, quality, timeliness, and overall presentation.\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Innovation Marketing staff\n* Marketing staff\n* R&amp;D staff\n* VP Innovation\n\nPHYSICAL DEMANDS\n\n* Fast paced environment handling multiple demands. Must be able to exercise appropriate judgment, as necessary. Requires a high level of initiative and independence. Excellent written and oral communication skills required. Requires ability to use a personal computer for extended periods of time.\n\nWORK ENVIRONMENT\n\n* Home office and office based.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$23.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor."
    },
    {
        "position": "Software Developer",
        "company": "Comparatio",
        "location": {
            "city": "Remote",
            "state": "United States"
        },
        "posted": "2021-04-28T21:45:57.396Z",
        "url": "https://www.internships.com/posting/285ea663-1529-4af6-9713-b6068e68a925",
        "lastScraped": "2021-04-28T21:45:57.396Z",
        "description": "<p>Software Developer</p>"
    },
    {
        "position": "Procurement Intern",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-04-28T21:46:17.476Z",
        "url": "https://www.internships.com/posting/bug_38985729840",
        "lastScraped": "2021-04-28T21:46:17.476Z",
        "description": "Procurement Intern\n\nJob Summary:\n\nThe Procurement Internship position provides an opportunity for supply chain students or business students with a supply chain focus to get hands on experience working in a fast-paced manufacturing environment.\n\nThe Global Procurement group is a dynamic and fast paced group supporting the company in procurement operations, strategic sourcing, replenishment (MRP) innovation, procurement category management, and contract management. Activities include spend analysis, negotiations, contract terms analysis and sourcing engagements. The Global Procurement teams work with stakeholders across the organization including marking, engineering, IT, facilities management, capital, R&amp;D, legal, finance and innovation.\n\nThis position will start in June and complete in December. This position will require a minimum of 30 hour per week commitment.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS (w/ percentage of time)\n\n* Working closely with Procurement, the chosen candidates will gain experience utilizing strategic Procurement methodologies and world-class eProcurement tools\n* Work on data analysis initiatives and opportunities to improve the effectiveness of strategic sourcing activities\n* Daily networking and learning opportunities with a broad exposure to stakeholders who work with Procurement\n* Open innovation activities including sourcing, strategic alliance management and project management\n* Technology process and workflows within SAP and Ariba\n\nPercentage of Time\n\n40%\n\n* Essential Job Function: Issues/Reviews RFP/RFQ's and obtains/provides proposals/quotes for standard products and services in support of new business proposals and on-going projects. Seeks and promotes competition in the acquisition of goods and services. collect NDAs, RFQs, RFIs and RFPs and ensure all commercial terms are agreed and documented.\n\n* What learning or experience will the Intern gain:\n* Legal process, contract lifecycle and commercial term management.\n* Procure to Pay process (p2p)\n* Source to Settle process (s2s)\n* Evaluation / analytics of proposals\n* Utilization of world class technology in procurement and sourcing processes\n* Develop metrics and monitor supplier performance using supplier scorecards\n* Assist stakeholder groups with identifying alternate sources focusing on quality, delivery, and total cost as the drivers\n\n30%\n\n* Essential Job Function: Capital procurement- Internship will focus on capital projects defined by management and managed by the Intern to completion\n\n* What learning or experience will the Intern gain:\n* Capital procurement and governance process\n* Scope of work/Master service contracts\n* Change order process, justification\n* Capital procurement strategies, indexes, and benchmarking\n* Manage project deliverables, meeting action items, schedule, documentation, and content in support of capital projects.\n* Manage content, workflow, and approvals related to Request for Information, Project Submittals, and Project governance\n* Multiple aspects of engineering, design &amp; construction, and facilities asset maintenance programs\n\n30%\n\n* Essential Job Function: Innovation procurement, supplier onboarding and supplier diversity\n\n* What learning or experience will the Intern gain:\n* Supplier Diversity reporting and efforts to increase supplier diversity registration and compliance.\n* Innovation process from discovery through commercialization\n* Supplier onboarding process, supplier risk management and reporting\n* Open innovation frameworks\n* Presentation and communication skill building\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* College Junior or Senior majoring in Supply Chain, Operations Management, Procurement/Sourcing, Business Management, Business Administration, or equivalent field\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Sourcing, procurement, negotiation, contracting, construction management\n* Ability to work independently and as a member of a cross functional team\n* Ability to work virtually\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Desire to improve procurement processes and outcomes\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Procurement director, procurement category managers and administration Stakeholders from marketing, engineering, innovation and legal\n\nPHYSICAL DEMANDS\n\nFast paced environment handling multiple demands. Must be able to exercise appropriate judgment, as necessary. Requires a high level of initiative and independence. Excellent written and oral communication skills required. Requires ability to use a personal computer for extended periods of time.\n\nWORK ENVIRONMENT\n\n* Office\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$20.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor."
    },
    {
        "position": "Summer 2021 FOX Entertainment Virtual Internship Program",
        "company": "N/A",
        "location": {
            "city": "",
            "state": "United States"
        },
        "posted": "2021-04-28T21:46:37.501Z",
        "url": "https://www.internships.com/posting/wup_571557442850498",
        "lastScraped": "2021-04-28T21:46:37.501Z",
        "description": "OVERVIEW OF THE COMPANY\n\nFOX Entertainment\n\nThe FOX Network, a premier national television broadcaster, is renowned for its combination of appealing primetime entertainment and powerful sports programming. It delivers 15 hours of weekly primetime programming to 208 local market affiliates, reaching approximately 99.9% of all U.S. television households. Among 18- to 34-year-olds, the FOX Network has ranked among the top two networks in primetime entertainment for the past 23 years.\n\nJOB DESCRIPTION\n\nSUMMARY:\n\nFOX is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industry's brightest talent. The FOX Entertainment Virtual Internship Program is for motivated college students who are passionate about entertainment and the media industry. FOX Interns are paid to gain real world work experience with guidance from top industry professionals. FOX Interns are assigned to a department that matches their skill set, work experience, and career aspirations. Please note this internship is available nationwide as a remote internship opportunity."
    },
    {
        "position": "Pharmacy Technician/Pharm Technician Apprentice",
        "company": "N/A",
        "location": {
            "city": "Kaneohe",
            "state": "HI"
        },
        "posted": "2021-03-29T21:46:57.547Z",
        "url": "https://www.internships.com/posting/bug_38976804378",
        "lastScraped": "2021-04-28T21:46:57.547Z",
        "description": "Job Information\n\nWalgreens Pharmacy Technician / Pharm Tech Apprenticeship in KANEOHE, Hawaii\n\nJob Description:\n\nOur pharmacy technician positions have undergone an exciting transformation, moving from a transaction-based environment to a much more patient-centric one. As a Walgreens Pharmacy Technician or Pharmacy Technician Apprentice, you'll be front and center  interacting with our customers and developing strong patient relationships. Pharmacy is the core of our business, and our pharmacy technicians enjoy all the tools and support  including the latest technology  to grow their careers and reach their goals.\n\nWalgreens is proud to invest &amp; champion an earn while you learn Pharmacy Technician Training Program recognized by ASHP &amp; Department of Labor. This apprenticeship program gives you an entry point to a career in health care by guiding you in taking steps towards becoming a Pharmacy Technician Certification Board (PTCB) Certified Pharmacy Technician and helping you maintain the high level of skill required in the pharmacy care industry. Arming you with a nationally recognized, portable credential that will help you advance your career.\n\nWhether you are new to working in pharmacies or are an experienced Pharmacy Technician Apply Now! Walgreens will train you to use your skills and talents to serve and care for our patients and customers. The courses, learning activities, and resources provided to you in our pharmacy technician training program are designed to give you foundational and advanced knowledge, skills, and on-the-job experiences you need to prepare to become a certified pharmacy technician.\n\n*\n\nIn accordance with state and federal regulations, assists the pharmacist, under direct supervision, in the practice of pharmacy. Assists the pharmacist in the performance of other Pharmacy Department duties in accordance with Company policies and procedures.\n\n*\n\nResponsible for using pharmacy systems to obtain patient and drug information and process prescriptions. If PTCB certified, assists with and coaches pharmacy technicians in the operation of pharmacy systems and cashiers in the operation of the pharmacy cash registers.\n\n*\n\nModels and delivers a distinctive and delightful customer experience.\n\nCustomer Experience\n\n*\n\nEngages customers and patients by greeting them and offering assistance with products and services. Resolves customer issues and answers questions to ensure a positive customer experience.\n\n*\n\nModels and shares customer service best practices with all team members to deliver a distinctive and delightful customer experience, including interpersonal habits (e.g., greeting, eye contact, courtesy, etc.) and Walgreens service traits (e.g., offering help proactively, identifying needs, servicing until satisfied, etc.).\n\n*\n\nDevelops strong relationships with most valuable customers.\n\nOperations\n\n*\n\nUnder the supervision by the pharmacist, assist in the practice of pharmacy, in accordance with state, federal, and company policy. Reviews and complies with the Walgreen Co. Pharmacy Code of Conduct.\n\n*\n\nPerforms duties as assigned by Pharmacy Manager, Staff Pharmacist and Store Manager including utilizing pharmacy systems to enter patient and drug information, ensuring information is entered correctly, filling prescriptions by retrieving, counting and pouring pharmaceutical drugs, verifying medicine is correct, and checking for possible interactions. Assists pharmacists in scheduling and maintaining work flow.\n\n*\n\nReports, immediately, prescription errors to pharmacist on duty and adheres to Company policies and procedures in relation to pharmacy errors and the Quality Improvement Program.\n\n*\n\nStrictly adheres to the Walgreen Co. policy regarding Good Faith Dispensing during all applicable prescription dispensing activities.\n\n*\n\nResponsible and accountable for registering all related sales on assigned cash register, collects and handles cash as required. Takes customer to OTC aisle when possible to assist in locating products.\n\n*\n\nHandles telephone calls that do not require personal attention of the pharmacist, including those to physicians.\n\n*\n\nProcesses (corrects and resubmits) manual claims for third party program prescription services in a timely and efficient manner, and performs other clerical duties, as assigned by the Pharmacy Manager.\n\n*\n\nAssists and supports Pharmacy Department on inventory management activities, such as, ordering, unpacking, checking and storing shipment of pharmaceuticals. Maintains knowledge of Company asset protection techniques, and files claims for warehouse overages (merchandise received, but not billed), shortages (merchandise billed, but not received), order errors or damaged goods involving Rx drugs.\n\n*\n\nMay assist pharmacist in administering clinical services including the collection and proper labeling of blood/urine samples from patients and other clinical services as required; assists pharmacy staff in coordination of clinical services, Walgreens healthcare clinics and external providers.\n\n*\n\nAssists Pharmacy Manager and Staff Pharmacist in developing and maintaining good relationships with the local medical community, including physicians, nurses, and other health care providers, by medical provider detailing and outreach to health groups, retirement homes, nursing homes, and other forums for enhancing growth opportunities.\n\n*\n\nAssists with exterior and interior maintenance by ensuring the Pharmacy Department is stocked with adequate supplies, clean, neat and orderly in condition and appearance.\n\n*\n\nComplies with all company policies and procedures; maintains respectful relationships with coworkers.\n\n*\n\nCompletes special assignments and other tasks as assigned.\n\nTraining &amp; Personal Development\n\n*\n\nEarns and maintains PTCB certification through the designated PTCB training program and/or state required certification/registration. Otherwise, earns PTCB certification as condition of promotion to senior technician.\n\n*\n\nAttends training and completes PPLs requested by Manager and acquires continuing education credits. Maintains knowledge and skill in healthcare and pharmacy, including latest news and developments.\n\nJob ID: 582150BR\n\nTitle: Pharmacy Technician / Pharm Tech Apprenticeship\n\nCompany Indicator: Walgreens\n\nEmployment Type: Flexible hours\n\nJob Function: Retail\n\nFull Store Address: 46-021 KAMEHAMEHA HWY,KANEOHE,HI,96744\n\nFull District Office Address: 46-021 KAMEHAMEHA HWY,KANEOHE,HI,96744-03769-10048-S\n\nExternal Basic Qualifications:\n\n*\n\nMust be fluent in reading, writing, and speaking English. (Except in Puerto Rico)\n\n*\n\nRequires willingness to work flexible schedule, including evening and weekend hours.\n\nPreferred Qualifications:\n\n*\n\nPrefer six months of experience in a retail environment.\n\n*\n\nPrefer to have prior work experience with Walgreens.\n\n*\n\nPrefer good math skills so they can fill prescriptions accurately, including counting, measuring and weighing medications.\n\n*\n\nPrefer good computer skills.\n\n*\n\nPrefer the knowledge of store inventory control.\n\n*\n\nPrefer PTCB certification.\n\nAn Equal Opportunity Employer, including disability/veterans.\n\nThe following information is applicable to Colorado only, in accordance with the Colorado Pay Equity Act. In Colorado, an employee in this position can expect a salary/hourly rate between $14.00 and $20.00 depending on experience, seniority, geographic locations, and other factors permitted by law. To review the available benefits, please click here: jobs.walgreens.com/benefits .Walgreens will provide applicants in other states with information related to the positions, to the extent required by state or local law, by calling 1-866-967-5492\n\nShift: Various\n\nStore: 10048-KANEOHE HI"
    },
    {
        "position": "Process Improvement Intern - Systems",
        "company": "N/A",
        "location": {
            "city": "California",
            "state": "United States"
        },
        "posted": "2021-04-28T21:47:17.704Z",
        "url": "https://www.internships.com/posting/bug_38985729639",
        "lastScraped": "2021-04-28T21:47:17.704Z",
        "description": "Process Improvement Intern - Systems\n\nJob Summary:\n\nLooking for a high potential, summer internship candidate with the passion to apply University Technical Learning to real life applications. Someone with the interest to work with People and improve Processes. The candidate will support our 3 manufacturing facilities in establishing and adopting process standards and tools to be used to optimize manufacturing operations.\n\nJob Description:\n\nESSENTIAL JOB FUNCTIONS  This job description reflects managements assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned.\n\nPercentage of Time\n\n70%\n\nEstablish Manufacturing Systems, Tools, and Templates\n\n* Partner with team members from each of our 3 factories to develop standard tools and templates to be leveraged in improvement and problem-solving activities at the sites.\n* With input from others, develop a methodology for when and how respective tools/templates are used by the Manufacturing team members.\n\n25%\n\nDevelop a SharePoint library for team members to access various tools and templates\n\n* Develop a framework and build a SharePoint (or other) library to house all continuous improvement and problem-solving tools and templates.\n* Implement a standard method for versioning/updating all content within the library, including a cadence for organizational review and sign-off.\n\n5%\n\nProject Status &amp; Completion Presentation\n\n* Assembly of work product into an end of assignment presentation to be given to an audience of Blue Diamond Senior Leaders\n\n_____________\n\n100%\n\nMINIMUM REQUIREMENTS\n\n* Junior class standing at a university working towards a degree\n\nPREFERRED MAJOR, SKILLS AND EXPERIENCES\n\n* Working towards a degree in Engineering or Business Administration\n* Interested in working with people\n* Interested in Food Manufacturing\n* Interesting in Project Management\n\nHOW WILL SUCCESS BE MEASURED?\n\n* Willingness to tackle the challenges presented to the candidate\n* Drive progress and/or completion of assignments / projects\n\nWHO WILL THE INTERN BE INTERACTING WITH?\n\n* Safety, Quality, Finance, Operations, Process Improvement, Senior Site Leadership, etc.\n* Contractors, Operators, Mechanics, and Quality Technicians\n\nPHYSICAL DEMANDS\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nWORK ENVIRONMENT\n\nMust be able to physically move throughout the facility, including climbing multiple flights of stairs, ladders, elevated catwalks, and tight access areas.  Able to work at a desk for extended periods of time doing analytical work or preparing reports on a computer.\n\nEducation:\n\nHigh School/GED\n\nOther Job Details:\n\nWork Shift:\n\nDay\n\nPay Type:\n\nHourly\n\nHourly Rate (if applicable):\n\n$25.60\n\nGrow your career. Partner with us. We Are the Almond People!\n\nBlue Diamond Growers (BDG) is an Equal Employment Opportunity Employer. BDG provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status, or genetic information. BDG also complies with all provisions of the U.S. Government's Executive Order 11246 dated September 24, 1965 and the rules, regulations and relevant orders of the Secretary of Labor."
    }
]