[
    {
        "position": "Software Engineer Intern",
        "company": "Mobinity Global ",
        "location": {
            "city": " New Mexico",
            "state": "United States"
        },
        "posted": "2021-10-18T16:57:19.693Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-mobinity-global-2764170719?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=6TpVVn20lGRnaUVylzBfXw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <p><strong>About Mobinity Global:</strong></p><p>Mobinity Global is a recruitment consultancy firm that helps companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood, etc recruit faster and with more convenience.</p><p><br></p><p>We are transforming the way recruiting is done in the digital age. We work with a number of top-tier companies, tech startups, freelance companies, Industry professionals, and subject matter experts for projects, internships, jobs, and freelance work.&nbsp;</p><p><br></p><p>If you meet the below <strong>eligibility criteria</strong>, please apply and our recruitment team will</p><p>connect with you to understand your strengths and strategize your career ahead.&nbsp;</p><p>We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners now as well as in the future.</p><p><br></p><p><strong>Eligibility Criteria:</strong></p><ol><li>Your year of graduation is 2020 or later. <strong>(Masters Candidates can also apply)</strong></li><li>You have a bachelor's degree in Computer Science, Data Science, Electrical Engineering or related analytical field of study from a USA university.</li><li>You have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood etc.</li></ol><p><strong>&nbsp;</strong></p><p><strong>Your Key Accountabilities May Include</strong></p><p>The main responsibilities of the role will be:</p><ul><li>Independently complete basic coding tasks and provide careful code reviews.</li><li>Participate in design sessions with particular focus on asking questions and understanding why the team makes the design decisions that they do.</li><li>Working on Python, C++, etc. programming on time series analysis including plotting, calculations, and summarizing.</li><li>Data management, database queries, and other desktop applications.</li><li>Prepare and conduct effective presentations, participation in client meetings and interaction with clients and subcontractors.</li><li>Work on multiple, unique assignments simultaneously in a fast-paced environment.</li><li>Exercise judgment on details of work and in making preliminary selections and adaptations of engineering alternatives.</li></ul><p>&nbsp;</p><p>&nbsp;<strong>Requirements:</strong></p><ul><li>Highly motivated with a desire to learn.</li><li>Proficient in Microsoft Excel.</li><li>Be a great teammate — contribute quality work, help out, be flexible, and adapt easily to changing product needs based on customers and the market.</li></ul><p><br></p><p><strong>Benefits:</strong></p><ul><li>Shadowing, mentoring, and training opportunities.</li><li>Fast-paced work environment.</li><li>Opportunity to attend weekly meetings and occasional networking events.</li><li>Compensation available.</li></ul><p>&nbsp;</p><p><strong>Apply NOW and we'll connect with you to explore your best matches!</strong></p><p><br></p>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Mobinity Global ",
        "location": {
            "city": " Florida",
            "state": "United States"
        },
        "posted": "2021-10-18T16:57:26.737Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-at-johnson-service-group-inc-2747342173?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=ChTKJ%2FrN0jAnEOyZDVWPdw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <p>Mobinity Global is a recruitment consultancy firm that helps companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood, etc recruit faster and with more convenience.</p><p><br></p><p>We are transforming the way recruiting is done in the digital age. We work with a number of top-tier companies, tech startups, freelance companies, Industry professionals, and subject matter experts for projects, internships, jobs, and freelance work.&nbsp;</p><p><br></p><p>If you meet the below <strong>eligibility criteria</strong>, please apply and our recruitment team will</p><p>connect with you to understand your strengths and strategize your career ahead.&nbsp;</p><p><br></p><p>We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners now as well as in the future.</p><p><br></p><p><strong>Eligibility Criteria:</strong></p><ol><li>Your year of graduation is 2020 or later. <strong>(Masters Candidates can also apply)</strong></li><li>You have a bachelor's degree in Computer Science, Data Science, Electrical Engineering or related analytical field of study from a USA university.</li><li>You have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, ebay,  Robinhood etc.</li></ol><p><strong>&nbsp;</strong></p><p><strong>Your Key Accountabilities May Include</strong></p><p>The main responsibilities of the role will be:</p><p><br></p><ul><li>Independently complete basic coding tasks and provide careful code reviews.</li><li>Participate in design sessions with particular focus on asking questions and understanding why the team makes the design decisions that they do</li><li>Working on Python, C++, etc. programming on time series analysis including plotting, calculations, and summarizing.</li><li>Data management, database queries, and other desktop applications.</li><li>Prepare and conduct effective presentations, participation in client meetings and interaction with clients and subcontractors.</li><li>Work on multiple, unique assignments simultaneously in a fast-paced environment.</li><li>Exercise judgment on details of work and in making preliminary selections and adaptations of engineering alternatives.</li></ul><p>&nbsp;</p><p>&nbsp;<strong>Requirements:</strong></p><ul><li>Highly motivated with a desire to learn</li><li>Proficient in Microsoft Excel</li><li>Be a great teammate — contribute quality work, help out, be flexible, and adapt easily to changing product needs based on customers and the market</li></ul><p><strong>Benefits:</strong></p><p><br></p><ul><li>Shadowing, mentoring, and training opportunities.</li><li>Fast-paced work environment</li><li>Opportunity to attend weekly meetings and occasional networking events</li><li>Compensation available</li></ul><p>&nbsp;</p><p><strong>Apply NOW and we'll connect with you to explore your best matches!</strong></p><p><br></p>\n      "
    },
    {
        "position": "Computer Science Intern",
        "company": "Toshiba Global Commerce Solutions ",
        "location": {
            "city": " Durham",
            "state": "NC"
        },
        "posted": "2021-10-04T16:57:31.091Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-mobinity-global-2756946117?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=efYoYrMV3WrH41Wva2OEyQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <strong><u>Job Title<br><br></u></strong>Computer Science Intern (INNOV-INT-07262021-001)<br><br><strong><u>Introduction<br><br></u></strong>Toshiba is seeking an Intern to join the Retail Innovation team. This role is open to undergraduate students currently enrolled in a bachelor’s degree program, majoring in computer science or computer engineering. The intern will support the research, evaluation, and development of state-of-the-art Edge devices for use in potential retail technology market opportunities. The ideal candidate will have at least one year of undergraduate study in computer science/engineering, with a knowledge of Artificial Intelligence / Computer Vision, a passion for learning and research, and an interest in pursuing a career in this area.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Set up lab demo equipment.</li><li>Record, evaluate, and potentially annotate videos in demo scenarios.</li><li>Develop graphical / UI simulation to represent the output of demo scenarios.</li><li>Perform other related duties as assigned.<br></li></ul><strong><u>Required Skills</u></strong> <ul><li>Current pursuit of a bachelor’s degree in Computer Science / Computer Engineering.</li><li>Basic knowledge in one or more of the following programming languages</li><ul><li>C/C++, Python, Java, JavaScript</li></ul><li>Knowledge of Artificial Intelligence, Computer Vision, Deep/Machine Learning is preferred.</li><li>Analytical and problem-solving skills.</li><li>Excellent written and verbal communication skills</li><li>Ability to learn quickly and work independently on assigned tasks.</li><li>Ability to collaborate with diverse team members as needed.<br></li></ul><strong><u>About The Company<br><br></u></strong>Toshiba is a dynamic billion-dollar global company based in Research Triangle Park, NC, providing retail store solutions to your favorite brands. Have you ever been in a hurry and made use of the self-checkout at Lowe’s Foods, earned fuel rewards at Kroger, or just paid for purchases at retailers such as Walmart, Michaels, Carrefour, The Gap, Calvin Klein, Boots, Cencosud, BJ’s, or Costco? These are just a few examples of our in-store solutions and impressive customer base that made us the world's installed market share leader.<br><br>The nature of retail is changing quickly, so if you share our 'Together Commerce' vision of a seamless two-way, participatory shopping experience, let’s get together to drive the new economy.<br><br><strong>Toshiba offers a competitive salary and generous benefits package including the following: <br></strong><ul><li>Group health coverage (medical, dental, &amp; vision)</li><li>Employee Assistance Programs</li><li>Pre-tax spending accounts</li><li>401(k) plan (with company match)</li><li>Company provided life insurance </li><li>Pet Insurance</li><li>Employee discounts</li><li>Generous paid holiday schedule, paid vacation &amp; sick/personal days <br></li></ul><strong><u>Eeo<br><br></u></strong>Toshiba is an equal opportunity/affirmative action employer that evaluates qualified applicants without regard to age, ancestry, color, religious creed, disability, marital status, medical condition, genetic information, military or veteran status, national origin, race, sex, gender, gender identity, gender expression and sexual orientation or any other protected factor. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br><br>Individuals who need a reasonable accommodation because of a disability for any part of the employment process should email benefits@toshibagcs.com to request an accommodation.\n      "
    },
    {
        "position": "Computer Science Internship (3 months)",
        "company": "RediMinds, Inc ",
        "location": {
            "city": " Southfield",
            "state": "MI"
        },
        "posted": "2021-10-11T16:57:33.157Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-internship-3-months-at-rediminds-inc-2750696484?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=VC%2BCvzEo0RWdnaDS9iUvDw%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        We are looking for an intern to join the RediMinds Research Team.<br><br>If you are passionate about AI and want to join a mission driven group working to make surgery safer and more effective, please apply! Our team is developing a cutting-edge surgical augmented reality tool which will provide real-time guidance to surgeons performing minimally invasive kidney surgeries.<br><br>Our team has implemented a number of computer vision models (specifically instance segmentation models) to segment various landmarks of interest in specific surgeries. In this role, you will work with our team to develop models which will learn from temporal changes in the surgical video. This will introduce you to cutting edge Computer Vision techniques being applied in medical image analysis. You will also coordinate the image annotation process with physicians and curate data sets.<br><br>We believe in providing support and mentorship to interns. You will be paired with multiple mentors who will guide your research and make sure you are part of the team. We will also provide housing and a stipend during your three-month internship.\n      "
    },
    {
        "position": "Backend Engineering Internship",
        "company": "Primer.ai ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-09-27T16:57:36.160Z",
        "url": "https://www.linkedin.com/jobs/view/backend-engineering-internship-at-primer-ai-2756487405?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=cT7OhiEbYaiAGxFQDY%2FIOg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        The world is changing at an accelerating rate. But we cannot take in the information fast enough, let alone make sense of it. We are fundamentally limited by the speed at which we read and write — the speed of human thought. The challenges facing decision-makers today require a radically new technology.<br><br><strong>Primer</strong> is at the forefront of the natural language processing revolution. Our artificial intelligence platform is capable of reading text at a rate of millions of documents per hour, extracting information and updating a knowledge graph of billions of entities. It is capable of answering natural language questions and generating the first draft of natural language analytical reports in seconds. Our mission is to empower our customers by vastly reducing the cost of curiosity. What once took days of research can happen instantly.<br><br>Our customers include some of the world's largest corporations, financial institutions, and government agencies in the world. You can learn more about Primer's technology and the problems we solve at our blog, as well as in recent media coverage of our work.<br><br>Primer is looking for talented college and graduate students with a passion for problem solving, research, and building tools you can use. We want people who help us expand what is possible. At Primer, you'll grow your technical expertise while working hands-on with some of the world's largest companies and elite national security organizations to solve their most pressing challenges.<br><br><strong><u>What You'll Do<br></u></strong><ul><li>Work on a truly challenging, real-world software project that leverages machine learning technologies.</li><li>Develop strong skills in software architecture, engineering and delivery.</li><li>Imagine, plan, and create your own software development project. We are currently working on topics that include:</li><ul><li>Data Labeling and on demand Model training</li><li>Knowledge Base and document storage</li><li>Structured Data exploration and visualization</li><li>Data pipeline orchestration, scaling, and API-backed declaration</li><li>and a long tail of applied ML</li></ul><li>Go from idea to fully deployed in production.<br><br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently has or is in the process of obtaining their BA/BS, Master's, or Ph.D. in Computer Science, Mathematics, Physics, Engineering, or other quantitative fields, or work that demonstrates equivalent knowledge.</li><li>Eagerness to learn new techniques and to enjoy open-ended projects.</li><li>Proficiency in Python.</li><li>Experience with web services, database systems or distributed systems is a plus.<br><br></li></ul><strong>Frequently Asked Questions</strong>      <ul><li>When and how long is the internship?</li><ul><li>Internships will last about 3 months generally.</li></ul><li>Where will the internship be?</li><ul><li>Primer Offices are located in San Francisco and Washington, DC. Interns also have the option to work remotely.</li></ul><li>When are applications due?</li><ul><li>Applications will be accepted and evaluated on a rolling basis.</li></ul><li>What is the overall interview process?</li><ul><li>The process starts with the initial resume screening. Primer will then reach out directly to qualified applications to schedule virtual interviews.</li></ul><li>Is the internship paid?</li><ul><li>Yes.</li></ul><li>Will I be considered for a full time position?</li><ul><li>Yes, our conversion rate from intern to full time is excellent. The internship is a great way to join Primer as a full-time engineer. We are proud of how many people at Primer came in through the internship program.<br></li></ul></ul><strong><u>What We Offer<br></u></strong><ul><li>A rapidly growing company, with plentiful opportunities to grow into leadership roles</li><li>Healthcare with Dental </li><li>401K and Vision Benefits (US)</li><li>Unlimited PTO (US) or 25 days Holiday (Non-US) </li><li>Work from Home allowance</li><li>Smart, passionate co-workers who want to deliver the best outcomes</li><li>An honest and open environment for the exchange of ideas</li><li>Fortune 50 companies and globally recognized institutions as customers</li><li>Learning and teaching opportunities via individual book allowances, tech talks, and brown bag lunches</li><li>Team virtual offsites like escape rooms and company happy hours<br><br></li></ul>Primer is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. Please see the United States Department of Labor's EEO poster and EEO poster supplement for additional information.<br><br>If you need assistance or accommodation due to a disability, you may contact us at info@primer.com.<br><br>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n      "
    },
    {
        "position": "Software Engineer Intern - Winter 2022 (Remote - US based)",
        "company": "LinkedIn ",
        "location": {
            "city": " Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-09-27T16:57:38.331Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-winter-2022-remote-us-based-at-linkedin-2705880205?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=kHM8NMz%2BJocKlwxk%2FZZrdg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        Software Engineer Internship - Winter 2022<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in the United States.<br>• This internship will take place during Winter 2022<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br>This position will be remote based out of the United States and applicants must have appropriate work authorization.<br><br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful. <br> <br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation. <br> <br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to: <br> <br>-Documents in alternate formats or read aloud to you <br>-Having interviews in an accessible location<br>-Being accompanied by a service dog<br>-Having a sign language interpreter present for the interview<br> <br>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Garmin ",
        "location": {
            "city": " Salem",
            "state": "OR"
        },
        "posted": "2021-10-11T16:57:47.923Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-garmin-2754227943?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=YV9mz4t5wGjRqtcfhX9PTQ%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        We are seeking a full-time <strong>Software Engineer Intern </strong>for our Salem, Oregon location. In this role, you will be responsible for learning and training to develop software for Garmin’s communication and navigation products under supervision.<br><br><strong><u>Essential Functions<br></u></strong><ul><li>Learn to develop software using C, C++, C#, Java, assembly language, or other selected languages </li><li>Learn to test software using debuggers, emulators, simulators, and logic analyzers</li><li>Learn to perform software releases and software quality assurance activities</li><li>Learn to perform maintenance activities for products already in production in addition to new product software design<br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li>Completed coursework in Computer Science, Electrical Engineering, Computer Engineering, or a related field</li><li>Excellent academics (cumulative GPA greater than or equal to 3.0 as a general rule) </li><li>Must possess relevant experience and/or training in languages such as C, C++, C# or Java </li><li>Must possess relevant experience and/or training in data structures or object oriented design methodology<br></li></ul><strong><u>Desired Qualifications<br></u></strong><ul><li>Outstanding academics (cumulative GPA greater than or equal to 3.5)<br></li></ul><em>Garmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.</em>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "LeafTV ",
        "location": {
            "city": " Los Angeles",
            "state": "CA"
        },
        "posted": "2021-09-20T16:57:51.829Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-leaftv-2727307682?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=FRiSqhyuYnrxd6JphXIiFg%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <p>The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.&nbsp;</p><p>&nbsp;</p><p>Responsibilities</p><ul><li>Develop quality software and web applications</li><li>Analyze and maintain existing software applications</li><li>Design highly scalable, testable code</li><li>Discover and fix programming bugs</li></ul><p><br></p><p>Qualifications</p><ul><li>Development experience with programming languages</li><li>SQL database or relational database skills</li></ul>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Idelji ",
        "location": {
            "city": " Santa Monica",
            "state": "CA"
        },
        "posted": "2021-09-27T16:57:53.936Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-idelji-2738730597?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=0U2CZfZVccO2tmZiq8HL4w%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        We are looking for a motivated Software Engineer Intern to join our team! As a Software Engineer Intern, you will collaborate with our senior leaders on assignments.<br><br>Duties and responsibilities<br><ul><li>Developing applications (coding, programming) </li><li>Develop and deliver tests in automation framework tests in Python/Angular </li><li>Debugging and testing code </li><li>Documenting and testing new software applications </li><li>Researching, investigating, and fixing a wide range of technical issues </li><li>Collaborating with senior leaders </li><li>Approaching problems and creating solutions </li><li>Proactively learning about new technologies <br></li></ul><strong><u>Requirements And Qualifications<br></u></strong><ul><li>Bachelor's Degree in Computer Science, Software Engineering, or related area </li><li>Experience with various programming languages, preferably Angular </li><li>Experience with TDD frameworks, preferably Selenium </li><li>Strong communication and presentation skills </li><li>Self-motivated and results-oriented </li><li>Ability to interact with cross-functional teams </li><li>Strong problem-solving abilities </li><li>Highly developed analytical and organizational skills </li><li>Ability to work in a fast-paced environment <br></li></ul>Idelji has been in business for 30 years. We offer Automated Operation Management, and analytics software to top Enterprise companies around the world. Visit our web site ( www.idelji.com ) for more details.\n      "
    },
    {
        "position": "Software - Tesla Bot Internship (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-19T16:57:57.625Z",
        "url": "https://www.linkedin.com/jobs/view/software-tesla-bot-internship-spring-2022-at-tesla-2698177044?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=eFAaxcsR2vSZ8nfqVkwMEw%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <em>Disclaimer: These positions are expected to start around January 2022 and last through at least April/May 2022 or continue through the entire Summer term (i.e. through August/September). We ask for a minimum of 12 weeks, </em><strong><em>full-time</em></strong><em>. Please consider before submitting an application. <br><br></em><em>International Students: If your work authorization is through CPT, please consult your school </em><strong><em>before</em></strong><em> applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong><u>About The Team<br><br></u></strong>Tesla’s Mobile Robotics team designs and builds humanoid bi-pedal robots (Tesla Bot) to automate repetitive tasks and wheeled robots for manufacturing and autonomous logistics. The team joins mechanical, electrical, controls, software, and manufacturing engineering disciplines in a highly collaborative team<br><br>The Mobile Robotics team is seeking highly motivated software engineering interns who thrive in a fast-paced environment and want to apply engineering concepts to real world projects. As a software engineering intern within the Mobile Robotics group, you’ll have the opportunity to work with incredibly talented engineers who are responsible for many of Tesla’s innovations.<br><br><strong>Location: <br></strong><ul><li>Palo Alto, CA <br></li></ul><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Controls Engineering: The controls challenge in designing a fully autonomous robot includes robust dynamic and kinematic modeling, stabilization control architecture, optimal reference trajectory generation and tracking, disturbance avoidance, implementation in embedded systems and more. The ideal candidate will have an interest in modeling and control of multi DOF robots for use in real world applications. </li><li>Server/Robotic Interaction Software Engineering: We are looking for an engineering intern that will help build the server-side/robotic interaction software stack for Tesla Bot. Your contributions will automate end-to-end registration, movement, action management, job assignment, as well as the remote operation of these bots. The team builds a suite of applications that include: fleet management, mobile apps, video streaming, in addition to AR/VR apps that will help the team control, train, and orchestrate these bots. </li><li>Autonomy Engineering: Core to the Tesla Bot and wheeled vehicle’s full autonomy, the perception stack presents a unique opportunity to work on state-of-the-art algorithms for state estimation and motion planning, culminating in their deployment to real world production applications. The perception software engineer intern will help develop this stack from inception to deployment. The ideal candidate will have an interest in developing humanoid bi-pedal robot perception solutions for commercial applications. </li><li>Firmware Engineering: As a member of the hardware / embedded controls team, you will help design, layout and implement hardware interfaces and control loops to new Tesla products, using in-house hardware and proprietary bus systems. <br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Computer Science, Computer Engineering, Mechanical or Electrical Engineering </li><li>Experience in one or more of the following developer skills: C++, Python, MATLAB/Simulink or other common industry languages </li><li>Eagerness to collaborate cross-functionally with other engineering teams while able to work independently; detail-oriented and execution focused </li><li>Genuine curiosity and willingness to understand how our products are designed, built and how they operate</li></ul>\n      "
    },
    {
        "position": "IT Internship",
        "company": "Auburn Gear, LLC ",
        "location": {
            "city": " Auburn",
            "state": "IN"
        },
        "posted": "2021-10-17T16:58:00.172Z",
        "url": "https://www.linkedin.com/jobs/view/it-internship-at-auburn-gear-llc-2763665404?refId=r2DcXklpvmMpLQIopn5lvQ%3D%3D&trackingId=fdT10UMjMmqXSGfm1qo6%2Fg%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong><strong>POSITION SUMMARY:<br><br></strong>We are seeking a service-oriented and self-motivated professional to join our IT support team. In this role, you will work on maintaining and monitoring computer systems and networks. You will be tasked with solving basic technical issues and will also collaborate with IT members to assist them with their technical requirements.<br><br><strong><u>ESSENTIAL JOB FUNCTIONS And RESPONSIBILITIES<br></u></strong><ul><li> Investigates/troubleshoots user problems and identifies their sources; determines possible solutions; tests and implements solutions.</li><li> Walk colleagues or clients through steps to help them resolve their technical problems.</li><li> Maintain procedures and reports that provide technical support to the entire organization.</li><li> Analyze records and logs to spot underlying trends and potential issues.</li><li> Support the implementation of new solutions or applications.</li><li> Establish accounts for new users and assist with password or login problems.</li><li> Installs, configures and maintains personal computers/laptops, Windows networks, file servers, network cabling, and other related equipment, devices and systems; adds or upgrades and configures disk drives, printers and related equipment</li><li> First line of support for IT Help Desk tickets</li><li> Utilize ticket system, phone and email to track and solve support issues</li><li> Provide, replace and repair PCs, user accounts, landline/cell phones, and software</li><li> Troubleshoot software problems and diagnose error messages</li><li> Maintain inventory of hardware and software licenses</li><li> Develop basic instructions/procedures for end-users</li><li> Assists in departmental compliance with federal and state regulations concerning marketing strategies and all media.</li><li> Maintains a professional image and standards consistent with company policies and procedures.</li><li> Be dependable, on time to work and available to work consistently</li><li> Meet all established standards of conduct and work performance</li><li> Develop teamwork and positive relationships with co-workers</li><li> Responsible for a high level of confidentiality and security while handling company information; verbal and/or written documentation.</li><li> Performs other tasks as requested.<br></li></ul><strong>JOB MEASUREMENTS: (i.e. Quantitative or qualitative methods of measuring successful attainment of job objective)<br></strong><ul><li> 90% of time recorded in ticketing system vs. clocked time</li><li> Average of 2 hour response time per ticket</li><li> Average of 2 day close time per ticket</li><li> Projects based on timeline objectives<br></li></ul><strong>EDUCATION AND / OR EXPERIENCE/ KNOWLEDGE OR QUALIFICATIONS: (please list your education requirements and must have knowledge for this position</strong><strong>)<br></strong><ul><li> Has/pursuing a Degree a in Computer Science/Information Technology/Information Systems</li><li> HS diploma and aptitude towards Technology</li><li> Excellent verbal and written communications skills with emphasis on customer communications</li><li> Good understanding of Active directory and Group Policy<br></li></ul>Job Types: Part-time, Internship<br><br>Pay: From $15.00 per hour\n      "
    },
    {
        "position": "Intern, Software Engineering (Consumer)",
        "company": "Wonder ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-10-15T16:58:11.635Z",
        "url": "https://www.linkedin.com/jobs/view/intern-software-engineering-consumer-at-wonder-2762607374?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=kn4wzXqwl1wb3hOAePY6%2Fw%3D%3D&position=4&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <strong><u>About Us<br><br></u></strong>Wonder is a fast-growing food-tech startup that's raising the bar on the role food plays in peoples' lives. We're creating an on-demand dining experience where customers can receive high-quality meals perfectly prepared and served to their doorsteps within minutes. We partner with the best restaurants and chefs across a diverse range of cuisines to offer access to the world's most delicious food—anytime, anywhere. Meals are prepared in Wonder kitchens and finished by onboard chefs deployed in our customized mobile kitchens.<br><br>Wonder is led by a team of experienced entrepreneurs including some of the most accomplished leaders and operators in the technology, culinary, and logistics industries. Backed by top-tier venture capitalists, we're moving quickly to pioneer the future of food.<br><br>If you join our team, you'll work in a supportive and collaborative environment where our culture and our values—Mastery, Compassion, and Courage—are taken as seriously as delivering an incredible experience for our customers.<br><br><strong><u>About The Team<br><br></u></strong>The Consumer Technology Team is the bread and butter of Wonder. Consumer Tech's main focus is on the costumer and their experience with wonder; this includes the Wonder app, marketing, personalization, and recommendations. This is a small group of enthusiastic engineers eager to deliver impact to the customer hot and fresh.<br><br><strong><u>About The Role<br><br></u></strong>Wonder is hiring Software Engineer Interns to join our 12-week summer internship program, where you'll make impactful contributions while growing your professional and technical skills sets along with a class of other interns. In this role, you will:<br><ul><li> Learn our tech stack and development processes from our engineering teams </li><li>Contribute to Design Reviews, Sprint Grooming, Planning and Demos </li><li>Contribute to the code base of a production system </li><li>Be responsible for the end-to-end delivery of an appropriately scoped project </li><li>Contribute to a major system that impacts our operation or our customers </li><li>Work closely with business stakeholders (Product Managers and other team members on the consumer or operations team) </li><li>Have fun! <br><br></li></ul>The experience you have<br><ul><li>Experience in a modern programming language such as Kotlin, Java, C#, F#, Python </li><li>Currently enrolled student graduating in December 2022 or Spring 2023 </li><li>Pursuing a BS or MS in Computer Science, Electrical Engineering, or a related technical discipline <br><br></li></ul>The way you work<br><br>We welcome students who exhibit Wonder's core values:<br><ul><li>Courage to step out of your comfort zone and welcome new challenges with a bias for action </li><li>Master in in fine tuning newly learned skills, while instantly applying feedback received </li><li>Compassion towards your fellow peers, and colleagues demonstrating willingness to work as part of a team, contributing to our overarching company goals <br><br></li></ul><strong><u>Benefits<br><br></u></strong>Wonder's paid summer internship program provides competitive salary and benefits while ensuring you gain meaningful experiences through network opportunities, trainings and learnings, and exposure to leaders at the company. We will provide you with clear goals to accomplish and continuous feedback to help you in your journey.<br><br>A final note<br><br>At Wonder, we believe that in order to build the best team, we must hire using an objective lens. We are committed to fair hiring practices where we hire people for their potential and advocate for diversity, equity, and inclusion. As such, we do not discriminate or make decisions based on your race, color, religion, gender identity or expression, sexual orientation, national origin, age, military service eligibility, veteran status, marital status, disability, or any other protected class. If you have a disability, please let your recruiter know how we can make your interview process work best for you.<br><br><strong>We look forward to hearing from you! We'll contact you via email or text to schedule interviews and share information about your candidacy.</strong>\n      "
    },
    {
        "position": "Software Engineer, Intern",
        "company": "Nuro ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-09-20T16:58:15.090Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-nuro-2736272760?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=SwOomRZhdptDFX3PUtQbqg%3D%3D&position=6&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <strong><u>Who We Are<br><br></u></strong>Nuro exists to better everyday life through robotics. We have an elite team of entrepreneurs and engineers, designers, and scientists. We believe AI and robotics are at the cusp of transforming daily life and we are dedicated to building meaningful products with this technology. Join us and play a critical role in our mission.<br><br>Join us in our mission, as you'll play a significant role in our development and impact on everyday lives.<br><br><strong><u>About The Role<br><br></u></strong>Our software team is growing, and we are looking for talented engineers to join us and be instrumental to one of the following areas: product engineering, infrastructure, embedded systems, machine learning, mapping &amp; localization, perception, prediction, or planning &amp; controls.<br><br><strong><u>About The Work<br><br></u></strong>As a software engineering intern, you will work closely with leading experts in the field of machine learning, robotics, and software. Depending on your skill sets and areas of interest, you will work on some or all of the following: <ul><li>Product Engineering: Building a robust and automated service for our clients, partners and customers including back-end, front-end and full-stack software.</li><li>Infrastructure: Building foundational software to support Product Engineering, Autonomy, Hardware and Operations including but not limited to storage systems, processing pipelines, security, bot connectivity, simulation, data collection and machine learning infrastructure.</li><li>Site Reliability Engineering: Providing a solid foundation of infrastructure through metrics, monitoring, operational support, and collaboration with infrastructure teams; this team is where everything comes together.</li><li>Security: Architects and builds our security infrastructure and processes. </li><li>Embedded Systems: Design the brain stem software of Nuro’s robots - the critical code that makes the robot sense and move in the world.</li><li>Autonomy:</li><ul><li>Machine Learning: Work across the software organization to research and develop novel machine learning methods and algorithms. Mapping &amp; Localization: Research, develop and deploy algorithms to resolve large-scale mapping and real-time localization problems for our fleet of self-driving delivery robots. Perception: Research, develop and deploy algorithms to understand the scene around the robot from sensor data. Resolve real-world perception problems like object detection, tracking and classification using computer vision, machine learning, sensor fusion and state estimation. Prediction: Develop novel algorithms that process large amounts of real-world data to train and tune behavior models for a variety of agents around our autonomous vehicles. Planning &amp; Control: Work on manipulating and controlling our self-driving vehicles including path planning, navigation, optimization and control.<br></li></ul></ul><strong><u>About You<br></u></strong><ul><li>You are a current BS or MS candidate in Computer Science, Electrical Engineering, Robotics, or a related field graduating December 2022 or later</li><li>You have experience in one or more of the following areas: backend API design, applications development, large-scale distributed systems; data storage and processing systems; advanced algorithms using C++ and Python; machine learning, multithreading; x86 architecture; and software performance tuning and optimization, robotics software frameworks, different compute modalities (CPU, GPU, FPGA) etc.</li><li>You have strong problem solving and programming skills.<br></li></ul><em>At Nuro, we celebrate differences and are committed to a diverse workplace that fosters inclusion and psychological safety for all employees. Nuro is proud to be an equal opportunity employer and expressly prohibits any form of workplace discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, veteran status, or any other legally protected characteristics.</em>\n      "
    },
    {
        "position": "Software Engineering Intern (Summer 2022)",
        "company": "Cambly Inc. ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-09-20T16:58:18.012Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-summer-2022-at-cambly-inc-2757777780?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=82n8MRP8gu2L5USCG8Fb6g%3D%3D&position=7&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        We're looking for aspiring software engineers who are passionate about changing the way people learn languages. As a Cambly engineering intern, you'll be part of a small and fast-moving engineering team where you'll have a large impact on all parts of the Cambly platform. We've been growing rapidly among language learners around the world, so you'll get to learn what it's like to join a fast growing startup that's creating opportunities for our students and tutors alike.<br><ul><li>This posting is for the Summer 2022 internship. If you would like to apply for Winter/Spring 2022, please use that posting!<br><br></li></ul><strong> Requirements <br></strong><ul><li>A product-minded approach to engineering. You should be excited about working directly with our students and tutors to make sure they have an amazing experience.</li><li>Experience writing software in Python, Kotlin, Swift, react.js, or Javascript either in school, side projects, or professionally.</li><li>A passion for learning. Just as we believe in helping our students learn English, we're eager to help our interns learn software engineering - we hope you're as excited about learning as we are!</li><li>A global perspective. You should be excited about building an app in 10+ languages that integrates with the social networks and payment methods used by our students.</li><li>Currently enrolled in a Computer Science degree program with at least 3 years of study completed.</li><li>Able to work 30+ hours/week alongside our SF-based engineering team.</li></ul>On a small and nimble team, every engineer should be able to learn new technologies quickly and jump in anywhere in our stack. You should have experience using or be excited about learning all the parts of Cambly: iOS, Android, React, JS, Python, Mongo\n      "
    },
    {
        "position": "Computer Science Co-Op",
        "company": "Siemens Healthineers ",
        "location": {
            "city": " Rockford",
            "state": "TN"
        },
        "posted": "2021-09-18T16:58:24.549Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-co-op-at-siemens-healthineers-2747301420?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=oI%2FTrQ7bEbQCcpMDbxVzTg%3D%3D&position=11&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <strong>Now’s our time to inspire the future of healthcare together.<br><br></strong>At Siemens Healthineers, we are passionate about enabling healthcare professionals to deliver high quality patient care, and to do so affordably. A leading global healthcare company, Siemens Healthineers continues to strengthen our portfolio of medical imaging and laboratory diagnostics, while adding new offerings such as managed services, consulting, and healthcare IT services – as well as further technologies in the growing market for therapeutic and molecular diagnostics.<br><br>Siemens Healthineers develops innovations that support better patient outcomes with greater efficiencies, giving providers the confidence they need to meet the clinical, operational and financial challenges of a changing healthcare landscape. Join our team now at Siemens Healthineers as a <strong>Computer Science Co-Op</strong>.<br><br><strong>This is a role well suited to an ambitious professional, looking for the next step in their career. As a </strong><strong>Computer Science Co-Op</strong><strong>,</strong><strong> you will be responsible for</strong>:<br><br>The selected student will have the opportunity to learn about how radiation detectors, specifically PET detectors, operate in detail. The student, through test and support from Scientists within Detector Research and Development, will learn how different parameters within a PET detector impact performance.<br><br><strong>This position may suit you best if you are familiar with </strong><strong>what is below, and would like to do develop your career with Healthineers<br><br></strong>The co-op or intern will work with the Detector R&amp;D group of Detector Center in the detector electronics R&amp;D support. Candidate should have experience with Linux and C/C++ programming. Additionally, experience with Python, particularly Scientific Python (SciPy) or Numerical Python (NumPy) would be a plus. Interest or experience with FPGA programming would also be desirable. The successful candidate will work closely with senior technical personnel in testing and documenting software for data acquisition and processing.<br><br><ul><li>Technical experience to be applied during internship: </li><li>Linux and C/C++ programming</li><li>Python programming</li><li>Software development to harvest data and organize for analysis and reporting<br><br></li></ul>Task documentation experience to be applied during internship:<br><br><ul><li>Proficient in code documentation including requirements, concept records, etc.</li><li>Presenting data to the scientific staff and creating a written report.<br><br></li></ul><strong>Required skills to have for the success of this role<br><br></strong><ul><li>Current rising junior or senior actively enrolled in a bachelor’s degree program studying Computer Science/Electrical Engineering</li><li>Must have a minimum GPA of 3.2 or higher</li><li>Linux and C/C++ programming</li><li>Python programming</li><li>Software development</li><li>Must be comfortable working onsite while following organization COVID-19 protocol and site mandates</li><li>Must be available to work full time (up to 40 hours/per week) for the duration of the co-op cycle</li><li>Must be local to Rockford, TN (50 miles or less)</li><li>Permanent work authorization and F1 visa students will be considered for this position <br><br></li></ul><strong>Start date:</strong> <strong>January 2022, 6-8 month duration<br><br></strong>At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose: To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.<br><br>Siemens Healthineers has recently announced the next steps in our continued commitment to prioritize colleague health, comply with customer/business partner requirements, and help preserve our business continuity. Going forward, please be aware that <strong>Siemens Healthineers requires full vaccination for COVID-19 for our U.S. employees, contractors, and business partners, where local conditions allow, who</strong>:<br><br><ul><li> Are customer-facing (e.g., those required to visit a customer/business partner site or interact in-person with customers at any conference or meeting) OR</li><li> Come on-site, whether regularly or occasionally, at any Siemens Healthineers location.<br><br></li></ul><strong>(Note: Accommodations may be requested for certain medical or religious reasons)<br><br></strong>At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose: To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.<br><br><strong>If you want to join us in transforming the way healthcare is delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>. <br><br></strong>If you wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.<br><br><strong>Organization:</strong> Siemens Healthineers<br><br><strong>Company:</strong> Siemens Medical Solutions USA, Inc.<br><br><strong>Experience Level:</strong> Student (Not Yet Graduated)<br><br><strong>Job Type:</strong> Full-Time temporary<br><br><strong>Equal Employment Opportunity Statement<br><br></strong>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><strong>EEO is the Law<br><br></strong>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><strong>Pay Transparency Non-Discrimination Provision<br><br></strong>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><strong>California Privacy Notice<br><br></strong>California residents have the right to receive additional notices about their personal information. To learn more, click here.\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Unity ",
        "location": {
            "city": " Bellevue",
            "state": "WA"
        },
        "posted": "2021-10-13T16:58:28.215Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-unity-2722988060?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=2GIPxrjcyMKXTQj7Os2T5Q%3D%3D&position=13&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        At Unity, you’ll make a difference. We’re democratizing development, solving hard problems, and enabling the success of our Community in a collaborative, fast-growing environment. You and your desire to make the world a better place will be at the forefront of the real-time revolution, as we build exciting technological advancements in entertainment, film, retail, sales, and other industries – all made possible by the Unity Engine, the most widely used 3D development platform in the world.<br><br>We are looking for Software Engineer Summer Interns to join our highly dynamic teams in San Francisco, Bellevue, Orlando, and Austin. Opportunities span a wide range of areas, including monetization, cloud services, AI, the Unity Engine, platforms, and more!<br><br><strong><u>What To Expect From Your Internship At Unity<br><br></u></strong><ul><li>Duration: 10-12 weeks depending on your academic calendar</li><li>Mentorship: You’ll be working simultaneously with a manager and a mentor to help you develop your skills throughout your internship.</li><li>Impact: Our interns are working right alongside full time team members on projects that has a lasting impact on our product and services</li><li>Networking &amp; Development: Learning activities, networking opportunities, and social events take place throughout the summer to enrich your internship experience<br></li></ul><strong><u>What We’re Looking For<br><br></u></strong><ul><li>Current student pursuing a relevant degree and returning to their degree program for at least one semester</li><li>Citizen of or enrolled at a University in the desired country of work</li><li>Programming experience in a general-purpose programming language</li><li>Strong interpersonal skills, both in person and via digital means with the ability to work in a team environment<br></li></ul><strong>You might also have<br></strong><ul><li>A passion for games</li><li>Any experience with Unity or other 3d game engines - even if it was only a weekend project!</li><li>Experience with deploying and launching software to production for real users<br></li></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Unity ",
        "location": {
            "city": " Framingham",
            "state": "MA"
        },
        "posted": "2021-10-13T16:58:44.074Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-unity-2722983595?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=BvaaiBKWq4D%2B0FdHANAtpQ%3D%3D&position=23&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        At Unity, you’ll make a difference. We’re democratizing development, solving hard problems, and enabling the success of our Community in a collaborative, fast-growing environment. You and your desire to make the world a better place will be at the forefront of the real-time revolution, as we build exciting technological advancements in entertainment, film, retail, sales, and other industries – all made possible by the Unity Engine, the most widely used 3D development platform in the world.<br><br>We are looking for Software Engineer Summer Interns to join our highly dynamic teams in San Francisco, Bellevue, Orlando, and Austin. Opportunities span a wide range of areas, including monetization, cloud services, AI, the Unity Engine, platforms, and more!<br><br><strong><u>What To Expect From Your Internship At Unity<br><br></u></strong><ul><li>Duration: 10-12 weeks depending on your academic calendar</li><li>Mentorship: You’ll be working simultaneously with a manager and a mentor to help you develop your skills throughout your internship.</li><li>Impact: Our interns are working right alongside full time team members on projects that has a lasting impact on our product and services</li><li>Networking &amp; Development: Learning activities, networking opportunities, and social events take place throughout the summer to enrich your internship experience<br></li></ul><strong><u>What We’re Looking For<br><br></u></strong><ul><li>Current student pursuing a relevant degree and returning to their degree program for at least one semester</li><li>Citizen of or enrolled at a University in the desired country of work</li><li>Programming experience in a general-purpose programming language</li><li>Strong interpersonal skills, both in person and via digital means with the ability to work in a team environment<br></li></ul><strong>You might also have<br></strong><ul><li>A passion for games</li><li>Any experience with Unity or other 3d game engines - even if it was only a weekend project!</li><li>Experience with deploying and launching software to production for real users<br></li></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.<br><br></em>\n      "
    },
    {
        "position": "Software Developer Intern",
        "company": "Pycube, Inc. ",
        "location": {
            "city": " Virginia",
            "state": "United States"
        },
        "posted": "2021-09-20T16:58:46.138Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-pycube-inc-2729499714?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=f4XyzSHJ1%2F%2Bp2ND%2Ft%2BbmrQ%3D%3D&position=24&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        <p><strong><em><u>JOB DESCRIPTION</u></em></strong></p><p><em>&nbsp;</em></p><p><em>Software Developer Intern</em></p><p><strong>Pycube Inc, a leading provider of cutting-edge asset management, inventory management, and supply chain solutions to the healthcare industry, specifically hospitals. Our clients include some of the US News top 20 hospitals in the country.</strong></p><p><br></p><p><strong><u>Requirements:</u></strong></p><p>• Good knowledge in AngularJS, NodeJS</p><p>• Knowledge in python and ML</p><p>• Database concepts</p><p>• Must have strong Mathematical, Analytical, and problem-solving skills.</p><p>• Strong proficiency in building reports, dashboards, and business forecasting models using various intelligence dashboarding tools.</p><p>• Advanced Excel skills and proficiency in Microsoft Office applications required.</p><p>• Excellent problem-solving skills, as well as the ability to work without direct supervision and maintain a high degree of concentration required.</p><p>• Ability to work under pressure to meet short and long-term deadlines.</p><p>• Desire to learn and work with Business intelligence tools such as Power BI or Tableau.</p><p>• Strong communication and writing skills.</p><p>• Strong attention to detail.</p><p>• Bachelor’s degree in area information technology, business intelligence, or similar area required.</p><p><br></p><p>Start: Immediate.</p><p>Job Types: Internship, Full time.</p><p>Pay: TBD</p><p>Work Location - Sterling Virginia USA</p><p>Work type - Onsite (No remote work available)</p><p><br></p><p>*Currently pursuing students cannot be considered for this role*.</p>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Unity ",
        "location": {
            "city": " Austin",
            "state": "TX"
        },
        "posted": "2021-10-13T16:58:48.056Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-unity-2722986254?refId=QZVGR%2Fc%2BoccUTRqvb%2FYY6w%3D%3D&trackingId=xmyVVBuTTHXx%2BnYB%2FP%2FEog%3D%3D&position=25&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T16:57:18.164Z",
        "description": "\n        At Unity, you’ll make a difference. We’re democratizing development, solving hard problems, and enabling the success of our Community in a collaborative, fast-growing environment. You and your desire to make the world a better place will be at the forefront of the real-time revolution, as we build exciting technological advancements in entertainment, film, retail, sales, and other industries – all made possible by the Unity Engine, the most widely used 3D development platform in the world.<br><br>We are looking for Software Engineer Summer Interns to join our highly dynamic teams in San Francisco, Bellevue, Orlando, and Austin. Opportunities span a wide range of areas, including monetization, cloud services, AI, the Unity Engine, platforms, and more!<br><br><strong><u>What To Expect From Your Internship At Unity<br><br></u></strong><ul><li>Duration: 10-12 weeks depending on your academic calendar</li><li>Mentorship: You’ll be working simultaneously with a manager and a mentor to help you develop your skills throughout your internship.</li><li>Impact: Our interns are working right alongside full time team members on projects that has a lasting impact on our product and services</li><li>Networking &amp; Development: Learning activities, networking opportunities, and social events take place throughout the summer to enrich your internship experience<br></li></ul><strong><u>What We’re Looking For<br><br></u></strong><ul><li>Current student pursuing a relevant degree and returning to their degree program for at least one semester</li><li>Citizen of or enrolled at a University in the desired country of work</li><li>Programming experience in a general-purpose programming language</li><li>Strong interpersonal skills, both in person and via digital means with the ability to work in a team environment<br></li></ul><strong>You might also have<br></strong><ul><li>A passion for games</li><li>Any experience with Unity or other 3d game engines - even if it was only a weekend project!</li><li>Experience with deploying and launching software to production for real users<br></li></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>\n      "
    }
]