[
    {
        "position": "Software Developer Intern",
        "company": "Bastian Solutions ",
        "location": {
            "city": " Louisville",
            "state": "KY"
        },
        "posted": "2021-07-08T08:29:45.227Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-bastian-solutions-2638628053?refId=20xo6QKqiqJuyfvDcWg0Hg%3D%3D&trackingId=jhEsq%2FdTrQh2PwqlNq5NRw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Seeking creative, talented up and coming developers who are eager to learn, enjoy challenges, and looking to jump start their career in development. Bastian Software Solutions is the software division in Bastian Solutions, of one of the fastest growing material handling companies in the world. We develop state of the art Warehouse Management Software. We are seeking future Software Developers with a background in Computer Science, Computer Engineering or IT to come join us for their co-op or internship in order to gain real world experience.<br><br>Exacta is our proprietary software created in house at Bastian Software. Our internships and Co-op begin in the QA department doing manual integrated testing for existing, modified, or custom software to be implemented for our clients. Testing the software will give an introduction to our software and learn its functionality and purpose. You will have exposure to technical tools including MS Visual Studio/Team Foundation Server, MS Office, Hyper-V or VMware, Windows Server, and Oracle. As you grow and grasp the Exacta Software you will transition to the Development team.<br><br><strong><u>Requirements<br></u></strong><ul><li>In pursuit of their Bachelors or Master’s degree. </li></ul><ul><li>Eager to learn in Visual Studio, C#, Visual C++, SQL Server and/or Oracle</li></ul><ul><li>Strong quality control and computer skills including ability to learn how to manually deploy and test software</li></ul><ul><li>Strong troubleshooting skills. </li></ul><ul><li>Ability and willingness to learn</li></ul><ul><li>Must be eligible to work in the USA long term without sponsorship.<br><br></li></ul><strong><u>About Bastian<br><br></u></strong>Bastian Solutions, a Toyota Advanced Logistics company, is an independent material handling and robotics system integrator providing automated solutions for distribution, manufacturing, and order fulfillment centers around the world. Our team specializes in consulting, system design, project management, maintenance, and installation, while sourcing the best equipment and automation technology. We take great pride in providing exceptional service and flexibility to our customers.<br><br>In addition to exciting work at a growing company, we offer the following benefits:<br><ul> <li>Health, Dental, and Vision Insurance</li> <li>401(k) Retirement Plan with a company match</li> <li>Vacation/Holiday Pay</li> <li>Tuition Reimbursement</li> <li>Flexible Work Schedules</li> <li>Volunteer Work</li> <li>Professional Associations, Conferences and Subscriptions</li> <li>Company Meetings &amp; Events</li> <br><br></ul>Bastian Solutions does not work outside recruiting agencies. No solicitation phone calls please.\n      "
    },
    {
        "position": "Computer Vision Intern",
        "company": "Veo ",
        "location": {
            "city": " Illinois",
            "state": "United States"
        },
        "posted": "2021-07-01T08:29:47.211Z",
        "url": "https://www.linkedin.com/jobs/view/computer-vision-intern-at-veo-2626066749?refId=20xo6QKqiqJuyfvDcWg0Hg%3D%3D&trackingId=xYbrnEn9sZAnbWXSy8xhCQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Company OverviewAt Veo, we're bringing the next generation of mobility sharing to cities and universities globally through our dockless e-vehicle system.<br><br>We also offer fat-tire bikes, cargo bikes and ADA-compliant bikes – making us the only shared mobility provider with this breadth of options. We design and engineer our own vehicles, hardware and software systems to provide a greener, healthier mode of transportation to make the communities we serve more sustainable and livable. Our mission is to offer the best combination of multi-modal sharing technology and seamless customer service, so users can unlock joy in their day. We are looking for exceptionally talented individuals who are ready to take on exciting challenges and their own solutions. We are headquartered in Chicago, IL, but we are hiring across the U.S. Join us!Job SummaryDo you want to apply AI to a real product? Do you want to practice your skill sets in a production application to customers around the nation? Are you willing to build a bridge between software and hardware and apply cutting-edge techniques to serve the users? Are you excited about solving some of the most challenging problems in transportation and urban planning? If so, you might be Veo’s Computer Vision engineer Intern! *This role can be done as a co-op or internship. Hiring will be done a rolling basis.ResponsibilitiesResearch and develop prototype using deep learning algorithms with a special focus on the perception modules and object detectionOptimize our current modelsHelp engineering team integrate it into the production applicationTroubleshoot and debug modelQualifications and SkillsMS or Ph.D degree in Computer Science or equivalentSolid understanding of Deep Learning, Mathematics and StatisticsExperienced in Tensorflow or equivalentLogical thinker and effective communicator with a clean and efficient coding stylePassionate about making the world a better place to live and ridePublished papers are a strong bonusBenefits and PerksCompetitive compensationOpportunity to work in a fast-paced, hyper-growth technology companyVeo creditsA commitment to professional development and mentorshipPowered by JazzHR\n      "
    },
    {
        "position": "Software Engineering Intern (Fall 2021)",
        "company": "Cambly Inc. ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-06-10T08:29:49.119Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-fall-2021-at-cambly-inc-2634485660?refId=20xo6QKqiqJuyfvDcWg0Hg%3D%3D&trackingId=E9%2BPxpy7xEkMMUY0BG8IZg%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        We're looking for aspiring software engineers who are passionate about changing the way people learn languages. As a Cambly engineering intern, you'll be part of a small and fast-moving engineering team where you'll have a large impact on all parts of the Cambly platform. We've been growing rapidly among language learners around the world, so you'll get to learn what it's like to join a fast growing startup that's creating opportunities for our students and tutors alike.<br><ul><li>This posting is for the Fall 2021 internship. If you would like to apply for Spring 2022, please use that posting!<br><br></li></ul><strong> Requirements <br></strong><ul><li>A product-minded approach to engineering. You should be excited about working directly with our students and tutors to make sure they have an amazing experience.</li><li>Experience writing software in Java, Python, Swift, Objective C, or react.js either in school, side projects, or professionally.</li><li>A passion for learning. You fearlessly dive into new and unfamiliar technologies.</li><li>A global perspective. You should be excited about building an app in 10+ languages that integrates with the social networks and payment methods used by our students.</li><li>Currently enrolled in a Computer Science degree program with at least 3 years of study completed.</li></ul>On a small and nimble team, every engineer should be able to learn new technologies quickly and jump in anywhere in our stack. You should have experience using or be excited about learning all the parts of Cambly: iOS, Android, React, JS, Python, Mongo\n      "
    },
    {
        "position": "Software Development Intern",
        "company": "Bio-Rad Laboratories ",
        "location": {
            "city": " Ann Arbor",
            "state": "MI"
        },
        "posted": "2021-07-08T08:29:51.121Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-intern-at-bio-rad-laboratories-2630111568?refId=20xo6QKqiqJuyfvDcWg0Hg%3D%3D&trackingId=PtAxSJjlFn5FEr9NKAqD2Q%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        We are seeking a motivated student who has a strong interest in the design, manufacturing, and sustaining of complex systems in the field of life science. Are you passionate about being part of a team that develops products to help make a difference in the world? Bio-Rad is looking for a Software Development intern who gets excited about product development, prototype testing and analysis, and systems integration!<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Use best software development practices to design and develop reliable and maintainable software for embedded systems used in commercial products and in-house diagnostic tools.</li> <li>Create tools, utilities, and scripts to aid development team(s).</li> <li>Implement embedded software solutions and algorithms to enable electromechanical system operations including graphical user interfaces, feedback control, and hardware and software interface communications.</li> <li>Develop and execute unit, integration, and system testing, investigate and resolve issues, and perform debugging.</li> <li>Collaborate on designs and participate in cross-functional teams to support product development and troubleshooting.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Currently enrolled as an undergraduate student pursuing a degree in Computer Science or related discipline (recent graduates will also be considered).</li> <li>Must have a 3.0 cumulative overall GPA or better (on a 4.0 scale).</li> <li>Strong coding skills in Python and C++.</li> <li>Experience with real-time operating systems and an understanding of real-time issues.</li> <li>Problem solving, organizational, and communication skills are required.</li> <li>Able to work for a minimum of 10 consecutive weeks.</li> <li>Strong initiative and ability to work independently and in teams.</li> <li>Inspire collaboration, be a curious question asker, driven and self-motivated.</li> <br><br></ul><strong><u>About Bio-Rad<br><br></u></strong>Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 8,000 employees and a global network of operations serving our customers, we help people live longer, healthier lives.<br><br>Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.<br><br>EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age<br><br><strong><u>Agency Non-Solicitation<br><br></u></strong>Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\n      "
    },
    {
        "position": "Software Engineering Internship Program- Summer 2022",
        "company": "Susquehanna International Group, LLP (SIG) ",
        "location": {
            "city": " Bala-Cynwyd",
            "state": "PA"
        },
        "posted": "2021-06-08T08:30:59.955Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-program-summer-2022-at-susquehanna-international-group-llp-sig-2632019614?refId=G2c7C5lrDOS%2FxbEUf6Zssw%3D%3D&trackingId=jaBNSpPyQBYt9BZkS9cTCw%3D%3D&position=6&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Overview<br><br></u></strong><strong>We are currently accepting applications for summer 2022 internships, and we will be reviewing applications on a rolling basis.<br><br></strong>SIG is seeking highly motivated full-time students for our software engineering summer internship program. Our technologists build some of the most powerful trading systems in the finance industry by integrating sophisticated coding techniques with innovative engineering ideas. Our teams design and optimize systems that can process massive amounts of data while ensuring high performance and stability.<br><br><strong><u>What To Expect<br><br></u></strong>As a software engineering intern, you’ll work alongside our experienced software engineers on the development, delivery, support and enhancements of our trading systems and infrastructure. You will have the chance to work on challenging projects that will be pushed into production. In addition, throughout the summer you’ll meet with senior technologists to learn about SIG technology and how it impacts trading.<br><br><strong><u>What We're Looking For<br></u></strong><ul><li> Students pursuing a BS or MS in Computer Science, Computer Engineering or a similar major </li><li> Strong software development skills in any object oriented language (we use C++, Python, and C# the most) </li><li> Visa sponsorship is available for this position <br></li></ul><strong><u>Intern Perks<br><br></u></strong>In addition to a great work experience, intern perks include:<br><ul><li> In addition to a great work experience, intern perks include: </li><li> Housing provided for duration of internship </li><li> Relaxed dress code: jeans and sneakers are the norm and shorts all summer long </li><li> A 9,000 square-foot gym with cardio, cross fit and strength machines, plus yoga and indoor cycling classes </li><li> Social events such as a poker tournament, dinners in Philadelphia, and sporting events </li><li> Discounts for shopping, travel, dining, entertainment, and attractions </li><li> On-site services such as dry cleaning and laundry, auto repair and detailing, barber, and ATM </li><li> On-site Wellness Center staffed with full-time Nurse Practitioner <br></li></ul><strong><u>The Company<br><br></u></strong><strong>SIG IS A GLOBAL QUANTITATIVE TRADING FIRM FOUNDED WITH A GROWTH MINDSET AND AN ANALYTICAL APPROACH TO DECISION MAKING.</strong> As one of the largest proprietary trading firms in the world, we benefit the financial markets by providing liquidity and ensuring competitive prices for buyers and sellers. We bring together the brightest minds, the best technology, and the most expansive library of data in the industry to design and implement quantitative trading strategies that make us leaders in the financial markets. Beyond trading, SIG is active in global private equity, structured capital, and institutional brokerage.<br><br>We don’t post salary ranges externally so any salary estimate you see listed on a third party website was not provided by SIG and may not be accurate.<br><br>SIG is not accepting unsolicited resumes from search firms. All resumes submitted by search firms to any employee at SIG via-email, the Internet or directly without a valid written search agreement will be deemed the sole property of SIG, and no fee will be paid in the event the candidate is hired by SIG.\n      "
    },
    {
        "position": "Information Technology Intern",
        "company": "Singer Burke ",
        "location": {
            "city": " Encino",
            "state": "CA"
        },
        "posted": "2021-06-24T08:31:26.791Z",
        "url": "https://www.linkedin.com/jobs/view/information-technology-intern-at-singer-burke-2620660495?refId=G2c7C5lrDOS%2FxbEUf6Zssw%3D%3D&trackingId=UyggllSvBPaTKGsGVBxMRg%3D%3D&position=23&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Internship Description<br><br></u></strong>We are seeking a highly motivated IT intern with a passion for technology, collaboration, and creative problem-solving. The intern will actively contribute to meaningful projects and work closely with a mentor and under the direction of the Firm’s Technology Team. Primary responsibilities may include code generation; SharePoint / database development; troubleshooting and developing network systems under the supervision of more experienced colleagues.<br><br><strong><u>IT Intern Duties And Responsibilities<br></u></strong><ul><li>Support the Tech Team in developing and configuring database in SharePoint, create Power Automate flows to interact with Microsoft Teams and Sharepoint</li><li>Lend IT support in areas such as cybersecurity, programming, analytics, system configuration, data migration and database management</li><li>Support the Tech Team in maintaining hardware, software, and other systems</li><li>Assist with troubleshooting issues and provide technical support</li><li>Perform on-site installation/configuration/repair/recovery/backup/imaging</li><li>Install operating systems as well as PC software installation and hardware installation/repair/replacement as needed</li><li>Manage troubleshooting in various areas of configuration, network connectivity, windows installation, to customer email.</li><li>Organize and maintain IT resources<br></li></ul><strong>Requirements<br></strong><ul><li>Computer Science, Information Technology, or Management Information Systems major</li><li>Minimum GPA of 3.0</li><li>Familiar with basic programming languages like C++, Java &amp; Python.</li><li>Expert in Microsoft Office Suite of products including Microsoft Teams, Power Automate and SharePoint</li><li>Strong verbal and written communication</li><li>Excellent analytical and problem-solving skills</li><li>Ability to work well in teams</li><li>Strong work ethic and attention to detail<br></li></ul><strong>Benefits<br></strong><ul><li>Gain hands-on experience in an IT position</li><li>Shadowing and training experiences with knowledgeable professionals</li><li>Flexible schedule for students</li><li>Compensation available<br></li></ul><em><strong>Submission of a cover letter along with your resume is required.<br><br></strong></em><strong><u>Please Follow The Link Below (or Copy &amp; Paste)<br><br></u></strong><em><strong>We also require an employment assessment along with your resume submission before consideration.<br><br><strong>https://www.ondemandassessment.com/link/index/JB-1TXJOTX4J?u=1016550<br><br></strong>We are a comprehensive financial services firm headquartered in Encino, California. With two distinct companies under one roof - a professional accounting practice and an independent investment advisory firm - we are able to provide creative clients with one-stop, seamlessly coordinated financial services in an environment where your needs are understood.<br><br>Our mission is to provide quality, personalized service that empowers and positively affects the lives of our clients, staff members, and the professional and public community. At the same time, we build mutual respect, trust, appreciation, cooperation and profitability based on our commitment to integrity, teamwork and responsibility.</strong></em>\n      "
    },
    {
        "position": "Data Science - ML Internship",
        "company": "VidMob ",
        "location": {
            "city": " United States",
            "state": "United States"
        },
        "posted": "2021-06-24T08:31:42.880Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-ml-internship-at-vidmob-2606327018?refId=qri%2F7InKPUdKI1cHNgjPLQ%3D%3D&trackingId=Xc4JDSJeG3OtvnNWPEV%2Fdg%3D%3D&position=9&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Overview<br><br></u></strong>VidMob is an award-winning Intelligent Creative Platform that provides an end-to-end technology solution for all a brand's creative needs. It is an integrated platform combining first-of-a-kind creative analytics with best-in-class creative production to understand and improve marketing effectiveness.<br>We seek candidates that are curious, collaborative and committed to excellence. We take every hire seriously and only choose seriously talented team members. We care deeply about our employees and are dedicated to making VidMob an exceptional company to work for.<br>VidMob is an Equal Opportunity Employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. Above and beyond our legal obligations, we see our diversity as one of our strengths.<br>The Data Science team at VidMob is focused on developing, deploying, and maintaining machine learning models to help support and enhance the capabilities of various teams across VidMob. Whether it's understanding relationships between creative characteristics and performance data, analyzing how audiences interact differently with creative across major social platforms, or enabling visual classification of all videos, the Data Science team has a wide selection of projects in its future. By applying state-of-the-art open source solutions, or by creating our own, we're focused on deploying the latest and greatest in ML across our tech stack.<br>Data Science is the core to what VidMob does, and our projects have high visibility in directly affecting the results of our business and our clients.<br>What You'll Do<br><ul><li>Apply your expertise in quantitative analysis, machine learning, data mining, and data visualization to create an understanding of relationships between creative characteristics and performance data</li><li>Surface and analyze outputs from computer vision, natural language processing (NLP) and statistical modeling</li><li>Build models to understand how audiences interact differently with creative across major mobile/social channels and identify leading indicators of creative performance</li><li>Synthesize analytics and statistical approaches into easy-to-consume storylines, both visually and verbally, and provide indicated actions for executive audiences<br></li></ul><strong><u>What We're Seeking<br></u></strong><ul><li>You are currently pursuing a B.S. or M.S./Ph.D in Machine Learning, Computer Science, Software Engineering, or related technical field, with an expected graduation date of 2021 or 2022</li><li>You have experience working with the following languages: Python, SQL, R</li><li>You are familiar with machine learning libraries or frameworks such as tensorflow, sklearn, keras, pytorch,</li><li>You have experience in ML engineering, through previous internships, coursework or open-source projects</li><li>You are passionate about designing software systems and shipping high-quality code<br></li></ul><strong><u>Bonus Points<br></u></strong><ul><li>You are familiar with DevOps cloud tools (AWS/EC2/SageMaker)<br></li></ul>Remote\n      "
    },
    {
        "position": "Scientific Software Developer Paid Co-op/Internship",
        "company": "Stellar Science Ltd Co ",
        "location": {
            "city": " Albuquerque",
            "state": "NM"
        },
        "posted": "2021-07-02T08:32:12.857Z",
        "url": "https://www.linkedin.com/jobs/view/scientific-software-developer-paid-co-op-internship-at-stellar-science-ltd-co-2629830611?refId=iYXcT7FoRY1XtX1was7LnQ%3D%3D&trackingId=5BT%2Fe9XzAt4%2F4sBFesypAQ%3D%3D&position=4&pageNum=4&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong>Selected Interns or Co-op students will support object-oriented C++ software development in the following domains</strong>: computer vision and image processing, image simulation, high power microwave systems modeling and simulation, laser source generation and effects modeling, computational electromagnetics (CEM), space situational awareness (SSA), high performance computing (HPC), and computer aided design (CAD) tools, among others.<br><br><strong>The main requirements</strong> are that candidates be top-notch, responsible, self-motivated, honest, able to work well independently or in small teams, and be able to rapidly learn new languages, tools, and techniques as needed to meet mission requirements.<br><br><strong>Applicants who convey a passion for developing quality code</strong>, through listed projects, a github link, or other software development experiences, will be given preference.<br><br><strong>This is a paid cooperative/internship</strong> learning experience. Full-time positions are 40 hours per week. Part-time positions require a minimum commitment of 10 hours per week.<br><br><strong>Minimum Requirements:<br></strong><ul><li>Majoring in computer science, physics, math, engineering, or a related field</li><li>Software development experience in C++ </li><li>Ability to implement, understand, and maintain mathematical and scientific software libraries</li><li>Must be available for full time employment within a year of completing this internship</li><li>U.S. citizen willing to undergo background investigation and perform some work at Kirtland Air Force Base<br><br></li></ul><strong>Experience in any of the following is a plus:<br></strong><ul><li>Cross-platform software development on Linux and Windows</li><li>3D graphics using Open Scene Graph and/or OpenGL</li><li>User interface development with Qt, Java Swing, or GWT</li><li>Supercomputing, CUDA, OpenMP, MPI, threads</li><li>Google Closure or similar tools for large-scale JavaScript development</li><li>OSGi, Orekit, or Apache Commons Math</li><li>Image processing, imagery analysis, or computer vision</li><li>Aerospace vehicles, orbital mechanics, electromagnetics, or space situational awareness</li><li>Directed energy modeling and simulation</li><li>Computer aided design (CAD)<br><br></li></ul><strong>A representative sample of your code</strong> will be requested early in the evaluation process, e.g. something you've written for work, for a class, or for fun. It need not compile, but should be long enough to help evaluate your programming and software engineering skills.<br><br><strong>About Stellar Science: We are a growing Albuquerque-based computational science company seeking talented computer programmers to create and extend exciting scientific and engineering analysis applications.</strong> We maintain high standards in all our software development efforts, utilizing modern development practices including continuous integration, test-driven development, pair programming, and code reviews in order to develop high quality, maintainable, and reusable code. By employing a lightweight development process, we remain highly productive and responsive to changing customer needs.<br><br><strong>Stellar Science is a forward-thinking business</strong> that allows its developers and scientists to work at home on occasion when consistent with job requirements. Standard benefits include ten paid federal holidays (which may be floated as desired), three weeks vacation, a generous fully employer-funded SEP IRA, and fully employer-funded health insurance, as well as dental, disability, and life insurance.<br><br><em>Stellar Science is an </em><em>. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, disability, protected veteran status, or national origin, in accordance with <br><br></em>Powered by JazzHR<br><br>AouUL1GIiO\n      "
    },
    {
        "position": "IT Applications Intern",
        "company": "Jockey International, Inc. ",
        "location": {
            "city": " Wisconsin",
            "state": "United States"
        },
        "posted": "2021-06-17T08:32:24.173Z",
        "url": "https://www.linkedin.com/jobs/view/it-applications-intern-at-jockey-international-inc-2604798226?refId=iYXcT7FoRY1XtX1was7LnQ%3D%3D&trackingId=VUnxyb61biXJof2e6JJpYg%3D%3D&position=11&pageNum=4&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        In this role, you’ll work with our IT and Business team members to manage and support a variety of solutions. Based at our headquarters in <strong>Kenosha, WI </strong>(near <strong>Milwaukee, WI</strong> and <strong>Chicago, IL</strong>), you’ll have the opportunity to work on multiple business applications - including maintenance and providing internal technical support to our business users, while collaborating with other IT members. If you have a passion for IT business development, along with a zest to gain pertinent business experience, this position is for you!<br><br><strong>JOCKEY</strong> is a premier local employer, offering the following employee perks:<br><ul><li> Attractive salary!</li><li>Flexible work schedule to accommodate class schedules!</li><li>Onsite, professional training in the Computer/IT fields! <br></li></ul><strong><u>In This Role, You Will<br></u></strong><ul><li> Work with team members to deliver support to the end user.</li><li>Assess and trouble-shoot IT issues.</li><li>Assist in the maintenance of existing solutions to support business needs.</li><li>Support assigned systems as necessary.</li><li>Create and maintain documentation for support continuity.</li><li>Perform tasks in cataloging, maintaining, converting, and scheduling reports.<br></li></ul><strong><u>Candidate Requirements<br></u></strong><ul><li> Currently pursuing a Bachelor’s degree in Computer Science, or equivalent (current junior or senior preferred).</li><li>General knowledge of database terminology and functions preferred.</li><li>Understanding of software development lifecycle preferred.</li><li>Basic knowledge of networking and hardware concepts; exposure to MS Windows Server.</li><li>Basic knowledge of standard MS-Office software.</li><li>Strong communications and critical-thinking skills.</li><li>Solid understanding of current technology and trends.</li><li>Eagerness to learn new technologies.</li><li>Ability to work 20-30 hours per week during Summer 2021, and 15-20 hours per week during the school semesters (work schedule is flexible to accommodate class schedules).<br></li></ul>In return for your expertise, <strong>JOCKEY</strong> offers fitness club discounts, onsite health &amp; wellness programs, generous employee discounts, a business casual work environment, learning opportunities, and opportunities for advancement.<br><br>Follow us on Linkedin! To find out more about our history and what it's like working at <strong>JOCKEY</strong>, visit us on Pinterest http://www.pinterest.com/Jockey_Careers/.<br><br>Jockey International, Inc., and its subsidiaries, provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. We are committed to providing reasonable accommodations for qualified individuals with disabilities in our job application procedures. If you need assistance or an accommodation due to a disability, you may email us at human_resource@jockey.com or call us at 262-658-8111.\n      "
    },
    {
        "position": "Automation tester (Intern)",
        "company": "Spectraforce Technologies ",
        "location": {
            "city": " Afton",
            "state": "MN"
        },
        "posted": "2021-05-09T08:33:00.330Z",
        "url": "https://www.linkedin.com/jobs/view/automation-tester-intern-at-spectraforce-technologies-2603228594?refId=s951XL1hWf5EimAu6xR6zw%3D%3D&trackingId=wm1GSZGdfnN0z1L4kXrU%2Fg%3D%3D&position=10&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong>Title: Automation tester (Intern)<br><br></strong><strong>Location: Saint Paul, MN 55117<br><br></strong><strong>Duration: 09 months<br><br></strong><strong><u>Job Requirements<br></u></strong><ul><li>Working on automation testing</li><li>Python experience</li><li>Computer science background</li><li>Ability to multi task</li><li>BA in computer science</li><li>Good programing skills</li><li>C/C++, scripting language selenium experience<br></li></ul><strong><u>Top Skills<br></u></strong><ul><li>Strong programming skills</li><li>Test automation</li><li>Python and selenium</li></ul>\n      "
    },
    {
        "position": "Cybersecurity Graduate Student Intern",
        "company": "Jefferson Lab ",
        "location": {
            "city": " Newport News",
            "state": "VA"
        },
        "posted": "2021-06-10T08:33:08.457Z",
        "url": "https://www.linkedin.com/jobs/view/cybersecurity-graduate-student-intern-at-jefferson-lab-2635444223?refId=s951XL1hWf5EimAu6xR6zw%3D%3D&trackingId=u2HbE6fANm6pIn9fRzvcNg%3D%3D&position=15&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Position Description<br><br></u></strong>1 YEAR TERM POSITION -GRADUATE STUDENT INTERN<br><br>POSITION POSTED: JUNE 4, 2021<br>SALARY RANGE: $26,800 - $38,600 (SI III)<br><br>You ‘matter’ to us! Our diverse team at Jefferson Lab includes more than 700 people, including physicists, engineers, computer professionals, technicians and more. From probing the basic building blocks of matter to performing advanced computing and applied research, we are on the leading edge of science and technology. If you are looking for a great job in a unique place where your contributions truly matter, consider Jefferson Lab!<br><br>We are currently seeking a Cybersecurity Graduate Student Intern<br><br>The Computer Center Technical Student Intern works with the Cybersecurity Group within the CNI Department to assist with operation of the laboratory’s cybersecurity program and the development of solutions to cybersecurity challenges. This includes monitoring, investigations, application evaluations, software development, documentation, audits and other duties as assigned. The Student Intern will also work with other groups within the CNI Department and the IT Division providing operational cybersecurity support.\n      "
    },
    {
        "position": "Fall 2021- IT Security Intern - 90259962 - Washington",
        "company": "Amtrak ",
        "location": {
            "city": " Washington",
            "state": "DC"
        },
        "posted": "2021-07-03T08:34:17.320Z",
        "url": "https://www.linkedin.com/jobs/view/fall-2021-it-security-intern-90259962-washington-at-amtrak-2628847655?refId=rEFQ2AKLO2DoMDNhFnWCrA%3D%3D&trackingId=iDizqVMAq8YyZCHzpmMERQ%3D%3D&position=12&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong>Your success is a train ride away.<br><br></strong>Amtrak connects businesses and communities across the country and we move America’s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees.<br><br><strong>Are you ready to join our team?<br><br></strong><strong><u>Summary<br><br></u></strong>The Cyber Defense Engineering intern will be working closely within a small team of security engineers to improve Amtrak’s cyber defense resilience. This position will focus on several discipline areas including but not limited to: Cyber Defense Tools, Network Security, Infrastructure and Cloud Security. The intern will support the engineering, integration, and optimization of SIEM, SOAR, threat intel, and vulnerability management technologies.<br><br><strong><u>Essential Functions<br></u></strong><ul> <li>Coordinate with Cyber Defense Analysts to manage and administer the updating of rules and signatures (e.g., intrusion detection/protection systems, anti-virus, and content blacklists) for specialized cyber defense applications.</li> <li>Assist in assessing the impact of implementing and sustaining a dedicated cyber defense infrastructure.</li> <li>Identify potential conflicts with implementation of any cyber defense tools(e.g., tool and signature testing and optimization).</li> <li>Build, install, configure, and test dedicated cyber defense hardware.</li> <br><br></ul><strong><u>Minimum Qualifications<br></u></strong><ul> <li>Must be actively pursuing a degree at an accredited educational institution.</li> <li>Must be actively pursuing an undergraduate/graduate degree in Information Technology (Computer Science, Cybersecurity, Digital Forensics, Networking)</li> <li>Must have at least 1 year of academic undergraduate studies completed or a sophomore status at minimum.</li> <li>Must have a cumulative GPA of 3.0 or higher</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Python Programming, PowerShell or any scripting language (JavaScript, Bash)</li> <li>Network Security (Firewall, Switches, Routers, Access Control List, VLAN, Subnetting, Protocols)</li> <li>Basic understanding of malware, MITRE ATT&amp;CK or Cyber Kill Chain and cyber threats</li> <li>Experience with offensive tools: Metasploit, Kali Linux and Vulnerability Scanners (Nessus, Nmap, Nikto, Qualysis)</li> <li>Basic understanding of Windows and Linux operating systems</li> <li>Experience with searching through logs (Splunk, Windows Event Viewer, Sysmon, Logstash)</li> <br><br></ul><strong><u>Communication And Interpersonal Skills<br><br></u></strong>Must have excellent oral and written communication skills<br><br><strong>Requisition ID:</strong> 63142<br><strong>Posting Location(s):</strong> District of Columbia; Maryland; Virginia<br><strong>Job Family/Function:</strong> Information Technology<br><strong>Relocation Offered:</strong> No<br><strong>Travel Requirements:</strong> None<br><br><strong> Amtrak employees power our progress through their performance. <br><br></strong>We want your work at Amtrak to be more than a job – we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.<br><br>We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.<br><br>All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. Marijuana, notwithstanding any statute, ordinance, regulation, or other law that legalizes or decriminalizes the use or possession of marijuana, whether for medical, recreational, or other use. Candidates who engage in the usage of marijuana will not be qualified for hire. We appreciate your cooperation in keeping Amtrak safe and drug-free.<br><br>In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.<br><br>Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.<br><br>Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.<br><br>POSTING NOTES: Information Technology || Internships &amp; Co-Ops\n      "
    },
    {
        "position": "R&D Intern",
        "company": "ABB ",
        "location": {
            "city": " Shanghai",
            "state": "VA"
        },
        "posted": "2021-06-24T08:34:25.427Z",
        "url": "https://www.linkedin.com/jobs/view/r-d-intern-at-abb-2613998876?refId=rEFQ2AKLO2DoMDNhFnWCrA%3D%3D&trackingId=6c4T%2BkksDL1D2u36A5FbIQ%3D%3D&position=17&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Take your next career step at ABB with a global team that is energizing the transformation of society and industry to achieve a more productive, sustainable future. At ABB, we have the clear goal of driving diversity and inclusion across all dimensions: gender, LGBTQ+, abilities, ethnicity and generations. Together, we are embarking on a journey where each and every one of us, individually and collectively, welcomes and celebrates individual differences.<br><br>As an R&amp;D Intern, you will be responsible for serving as the supporter for the industrial robot hardware related research and development, for Robotics &amp; Discrete Automation Business Area in Shanghai, China. Reporting to the R&amp;D Team Manager, you will support and solve problems during unit test.<br><br>Your responsibilities<br><ul><li>Understanding the essential architecture of robot controller</li><li>Supporting hardware development</li><li>Ensuring verification and test on unit level</li><li>Supporting and solving problems during unit test<br></li></ul>Your background<br><ul><li>Experience on oscilloscope, logic analyzer, Spectrum Analyzer is preferred</li><li>Experience on ARM, FPGA, DSP is preferred.</li><li>Experience on VHDL or C is preferred.</li><li>Sound knowledge in analog and digital circuit design, eg. data acquisition, signal process, high speed circuit, etc.</li><li>An Undergraduate student, major in electronic engineering, automation and computer science, etc.</li><li>Highly responsible, self-motivated and autonomous at work</li><li>Fluency in both oral and written English<br></li></ul>More about us<br><br>ABB's Robotics and Discrete Automation business is writing the future of flexible factory and smart machines by providing value-added solutions in robotics, machine and factory automation. Our integrated automation solutions, application expertise across a wide scope of industries and our global presence deliver tangible customer value. We look forward to receiving your application (preferably in English). If you want to discover more about ABB, take another look at our website.<br><br><strong> 79169301</strong>\n      "
    },
    {
        "position": "Intern - Idea Labs",
        "company": "Itron, Inc. ",
        "location": {
            "city": " Austin",
            "state": "TX"
        },
        "posted": "2021-07-02T08:34:32.072Z",
        "url": "https://www.linkedin.com/jobs/view/intern-idea-labs-at-itron-inc-2625398127?refId=rEFQ2AKLO2DoMDNhFnWCrA%3D%3D&trackingId=Ozitu52W20ClrLyImS2Y7Q%3D%3D&position=21&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Itron is at the forefront of a rapidly evolving global industry. Through innovative technology and services, we are working to create more insightful utilities, smarter cities and a more resourceful world. Join us.<br><br>This position provides students the opportunity to gain real world experience in roles that require familiarity with computer programming languages, data science approaches and tools, cloud computing environments, wireless and cellular communications technologies, etc.<br><br><strong><u>Idea Labs Interns Might Contribute To These Projects This Summer<br><br></u></strong>Interns will collaborate with a diverse, skilled, and global team contributing to innovative projects that support smart utility infrastructure.<br><ul><li>Mobile application development for utility customers</li><li>Project Zero, helping companies and utilities reach their carbon neutral goals</li><li>Energy load disaggregation through machine learning<br></li></ul><strong><u>Duration:</u> </strong>This is a full-time (~40 hours/week) summer intern role, with the potential to continue in a part-time capacity into the fall academic term.<br><br><u><strong>Duties &amp; Responsibilities<br></strong></u><ul><li>Collaborate with Itron Idea Labs solution architects, engineers, data scientists, entrepreneurs and business managers</li><li>Learn about the technologies listed in the experience section below</li><li>Assist with development and technical implementation of customer pilots and support of demonstrations at trade shows</li><li>Ask questions and offer input when supervisors deal with more complex problems</li><li>Learn and understand any regulations related to departmental tasks</li><li>Help department stay abreast of latest technologies impacting our industry</li><li>Occasional travel required<br></li></ul><u><strong>Experience:</strong></u> This position requires no professional work experience.<br><br><strong><u>Required Qualifications &amp; Skills</u></strong> <ul><li><u>Education: Relevant high school or college level coursework in computer science, computer engineering, data science or related equivalent </u></li><li><u>Must be at least 18 years of age by date of hire</u></li><li><u>Located within reasonable commuting distance to Itron’s offices in Liberty Lake (WA), Austin (TX), or Raleigh (NC)</u></li><li><u>Experience working in Linux through coursework, independent learning and/or previous work experience</u></li><li><u>Skilled problem solver, curious to find and create solutions</u></li><li><u>Professional communication and collaboration skills with ability to use workplace tools (GitLab, Slack, Trello) </u></li><li><u><u>Familiarity with at least one subject matter area noted below<ul><li>Software development with a preference for strong Python skills (Python, WebServices, Java, C, JavaScript, etc)</li><li>Data science and statistics (which could include coursework in statistical theory; experience with common data science libraries, tools and models, such as numpy, pandas, and scikit-learn (Python); experience with neural networks; experience with Bayesian models) </li><li>Cloud computing tools (familiarity with AWS, Azure, Google GCP, etc.) </li><li>Hardware development platforms such as Raspberry Pi, Arduino, etc.<br></li></ul><u><strong>Travel:</strong></u> 10 - 20%<br><br><u><strong>Physical Demands:</strong></u> This is a typical office job, with no special physical requirements or unusual work environment.<br><br>Itron is an Equal Opportunity, Affirmative Action Employer. Qualified applicants are considered without regard to race, color, religion, sex, age, national origin, citizenship, sexual orientation, marital status, pregnancy, medical condition, veteran status, disability, genetic information, gender identity or other characteristics protected by law. If you require an accommodation in order to apply to this position, please contact your local recruiting representative at 1-800-635-5461 or email Accessibility@itron.com. #ItronUR<br><br>Itron enables utilities and cities to safely, securely and reliably deliver critical infrastructure services to communities in more than 100 countries. Our portfolio of smart networks, software, services, meters and sensors helps our customers better manage electricity, gas and water resources for the people they serve. By working with our customers to ensure their success, we help improve the quality of life, ensure the safety and promote the well-being of millions of people around the globe. Itron is dedicated to creating a more resourceful world. Join us: www.itron.com.<br><br></u></u></li></ul>\n      "
    },
    {
        "position": "Full Stack Software Engineering Internship Fall 2021 at the University of Illinois,Urbana-Champaign",
        "company": "Cargill ",
        "location": {
            "city": " Champaign",
            "state": "IL"
        },
        "posted": "2021-07-01T08:37:05.240Z",
        "url": "https://www.linkedin.com/jobs/view/full-stack-software-engineering-internship-fall-2021-at-the-university-of-illinois-urbana-champaign-at-cargill-2579826485?refId=vnHUQ4LyAKsZj6KxPSpdlA%3D%3D&trackingId=71vlJe9LnoYWjwUfhNtwQA%3D%3D&position=19&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Want to build a stronger, more sustainable future and cultivate your career? Join Cargill's global team of 160,000 employees who use new technologies, dynamic insights and over 154 years of experience to connect farmers with markets, customers with ingredients, and people and animals with the food they need to thrive.<br><br><strong><u>Job Description<br><br></u></strong><strong>YOU MUST CURRENTLY BE ENROLLED AT THE UNIVERSITY OF ILLINOIS, URBANA-CHAMPAIGN (UIUC) FOR THIS INTERNSHIP OPPORTUNITY WITH CARGILL AT THE UIUC RESEARCH PARK<br><br></strong>In partnership with the University of Illinois, Urbana-Champaign (UIUC) Research Park, you will be given the opportunity as an intern to work with Cargill Digital Labs through our local office, The Cargill Innovation Lab at UIUC, to gain hands on experience in real business situations and be exposed to many of Cargill’s businesses and functions during the work term.<br><br>As an intern, you would work in a project team where software engineering, analytical skills, product design, UX / UI design, leadership, collaboration, inclusion, and innovation are keys to success.<br><br>As an organization, Cargill’s mission is to lead in nourishing the world in a safe, responsible and sustainable way. Cargill Digital Labs (CDL) strives to help prepare Cargill for a digital future. The vision of this future includes a thriving digital culture, continually launching of new digital business initiatives, and that Cargill will be a digital thought leader in the food and agriculture industries.<br><br>In May 2019, Cargill established a research site within UIUC’s Research Park to further this mission. In its first iteration, we leverage the site to host digital research projects, such as software, hardware and engineering prototypes that are staffed by student interns from the University of Illinois, Urbana Champaign. As we gain learnings from the experience, we will grow and mature our development capabilities within the park to best suit Cargill’s evolving digital journey.<br><br>Job Purpose and Impact<br><br><strong>Why intern with us? <br></strong><ul><li>Professional Experience - Gain professional experience as a software engineer working in a cross-functional team. Learn best practices from industry professionals. Understand what it is like to work within an agile software product team.</li><li>Build Prototypes - Work on fast-paced, digital prototype projects. Ship a functioning prototype over the course of weeks. Collaborate with clients to test prototypes and gain real-world insights. </li><li>Cross-Functional - Gain exposure speaking with and presenting to a variety of stakeholders across business, engineering, design and product functions. Work in tandem with a UX UI designer on understanding the user’s journey, wireframes and user interface designs. </li><li>Startup Culture – Wonder what it would be like to work within a product team at a software company? Or how about getting a software MVP off the ground? Your project for the semester will include building a prototype from scratch or exploring future features of an existing app. You’re paired with other software engineers and UX UI designers to go from requirements gathering, planning, design, architecture, dev, quality assurance to testing with real users over the course of a semester.</li><li>Use Cases That Matter – Work on real innovation initiatives that serve a variety of clients at Cargill ranging from animal nutrition, animal supply chain, food industry, learning and development, to trading and analytics. Apply your talents on digital initiatives that transform global food systems. <br><br></li></ul><strong>Having the Right Mindset<br><br></strong>While engineering fundamentals are a must, we look for students that enjoy startup culture and are adept at working collaboratively within a team. Comfort with ambiguity is a must. Empathy for other functions and the end user is critical. Lean mindset to build the smallest thing possible is a key to success. We don’t expect you to be an expert on the entire stack, but we do look for students that are hungry to learn new things. Expand your skills in a high growth ag tech industry just a few blocks off campus.<br><br>Location<br><br>This position will be located at the University of Illinois Urbana-Champaign in Champaign, IL<br><br><strong><u>Qualifications<br><br></u></strong><strong>Required Qualifications:<br></strong><ul><li>Must be currently enrolled as a student at the University of Illinois, Urbana-Champaign graduating between December 2021 and Summer 2023</li><li> Currently pursuing a Bachelor’s degree with a major or minor in Computer Science, Computer Engineering or other technology related discipline OR commensurate experience with software engineering in lieu of pursuing a related major/minor.</li><li>Must have the right to work in the US that is not based solely on the possession of a student visa or a visa sponsored by a third-party employer.</li><li>Able to complete at minimum a semester-long internship during the Fall 2021 semester (September – December 2021).</li><li>Demonstrated ability to work effectively with individuals from diverse backgrounds and cultures</li><li>Must possess a high degree of initiative and resourcefulness in completing work with limited guidance</li><li>Willing to take ownership of project and work</li><li>Must be able to complete essential functions of this job as outlined in the job description with reasonable accommodations<br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Pursuing a cross-disciplined degree in either Economics, Business, Food Science, or Agriculture Business.</li><li>Overall 3.0 GPA preferred</li><li>Commercial product software development experience; experience with agile development methodologies</li><li>Strong prioritization and problem-solving skills; collaboration skills; verbal and written communication skills; and information research and gathering skills </li><li>Knowledge of full-stack or mobile development, database design, and basic software engineering principles</li><li>Interested in returning to the Lab across additional semesters beyond Summer 2022<br><br></li></ul>Equal Opportunity Employer, including Disability/Vet.\n      "
    },
    {
        "position": "Reject Validation and Test Development Graduate Intern",
        "company": "Intel Corporation ",
        "location": {
            "city": " Folsom",
            "state": "CA"
        },
        "posted": "2021-06-10T08:38:08.523Z",
        "url": "https://www.linkedin.com/jobs/view/reject-validation-and-test-development-graduate-intern-at-intel-corporation-2579854014?refId=Satrr4saTwHTSnIRWBKDEQ%3D%3D&trackingId=1drAnDSKXF28WcpUyszcpA%3D%3D&position=10&pageNum=13&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <ul><li>Qualifications</li><li>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience would be obtained through a combination of prior education level classes, and current level school classes, projects, research, and relevant previous job and/or internship experience.</li><li><strong>Minimum Qualifications</strong></li><li>The candidate must be pursuing a Master's or Ph.D. degree in Electrical Engineering, Computer Engineering, Computer Science, or a related field.</li><li>3+ months of experience with:</li><li><br></li><li>Computer architecture</li><li>VLSI design</li><li>Fab process/Device physics</li><li><strong>Preferred Qualifications</strong></li><li>Understanding principles of class sort test and design for test</li><li>Knowledge experience with Python Perl SQL.</li><li>Experience with x86 microprocessors.</li></ul><p></p>\n      "
    },
    {
        "position": "Data Management Intern",
        "company": "Student Conservation Association ",
        "location": {
            "city": " Arlington",
            "state": "VA"
        },
        "posted": "2021-06-08T08:38:24.993Z",
        "url": "https://www.linkedin.com/jobs/view/data-management-intern-at-student-conservation-association-2621842456?refId=Satrr4saTwHTSnIRWBKDEQ%3D%3D&trackingId=43S4msVfeEydQz097xjUNA%3D%3D&position=20&pageNum=13&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Expected Dates<br><br>August 2, 2021 to July 31, 2022<br><br>Site<br><br>NPS Natural Resource Program Center<br><br>Position ID<br><br>PO-00727953<br><br><strong><u>The Primary Duties Will Be To<br><br></u></strong>Selected students will work with National Park Service staff to evaluate and convert baseline biological inventory data into formats for use as a part of the NPS Inventory &amp; Monitoring Division's \"Inventories 2.0\" Program.<br><ul><li>Interns will work to convert products in older data formats to current formats, including the processing completed NPS Inventory and Monitoring (I&amp;M) inventory products and data sets from species and vegetation mapping inventory studies. </li><li>Conduct literature reviews to assist with the categorization of taxa found with NPS units based on ecology, conservation status, and management relevance. </li><li>Assist with the quality control of species observation data extracted from reports, published data sets, and external data sources. </li><li>Assist with the development and testing of tools to automate the processing, evaluation, publication, and visualization of species observation data throughout the NPS system. </li><li>Assist NPS staff in reviewing project reports prior to dissemination.<br></li></ul>The intern will work as part of the science team in the Inventory &amp; Monitoring Division central program oﬃce in Fort Collins, CO. Any applicant needs to have knowledge of the Windows environment (Windows XP or 7) and able to navigate Windows Explorer, access the Internet, and perform common tasks such as cut, copy, paste, and delete. Applicant needs to have been introduced to R and R-studio.This position will require most hours sitting (or standing if preferred) at a computer. Intern will have a few hours a week to receive training on a GIS/GPS skill of their choosing. There is no travel or field work involved in this position.Note: the advertised start date of May 17th is contingent upon the NPS oﬃce resuming normal (open) operations after current work-at-home orders are lifted. Consequently, the start date may be delayed. Compensation amounts: - $650 - one time RT travel allowance - $300 - weekly living allowance - $600 - monthly housing allowance (12 months of housing)- Optional monthly health coverage - AmeriCorps eligible ($6095 education award) *All allowances subject to applicable federal, state, and local taxes <ul><li>Location Description<br></li></ul>Fort Collins is located in northern Colorado, approximately 65 miles north of Denver, and home to Colorado State University. Recent estimates place its population at 165,000.<br><ul><li>Training Provided<br></li></ul>The member will have access to the LinkedIn Learning (formerly Lynda) library of classes that can advance their career (otherwise expensive but free to them) as well as NPS-specific training related to the use of R in support of resource management.<br><ul><li>Educational/Recreational Opportunities<br></li></ul>Interns will be exposed to how inventory and monitoring science is used to support park resource and management activities. Fort Collins provides many opportunities for outdoor activities, shopping, entertainment, and dining out.<br><ul><li>Handicap Accessible?<br></li></ul>Yes<br><br>Main Area of Focus<br><br>Natural Resources Mgmt<br><br>Education, Training &amp; Skills Expected<br><br>Biology<br><br>degree major or professional experience<br><br>Forestry<br><br>some coursework or experience<br><br>Mathematics &amp; Data Analysis<br><br>some coursework or experience<br><br>Resource Management<br><br>degree major or professional experience<br><br>Computer Science<br><br>competent without supervision<br><br>Data Entry<br><br>competent without supervision<br><br>Plant Identification<br><br>some experience<br><br>Writing/Publishing<br><br>competent with supervision<br><br>Data Analysis<br><br>some experience<br><br>Further Details<br><br>AmeriCorps Eligible<br><br>Eligible<br><br>Housing or Stipend Provided?<br><br>Yes<br><br>Indoor/Outdoor<br><br>Indoor<br><br>US Citizenship\n      "
    },
    {
        "position": "Student Tutor",
        "company": "Metropolitan State University of Denver ",
        "location": {
            "city": " Denver",
            "state": "CO"
        },
        "posted": "2021-06-08T08:39:20.225Z",
        "url": "https://www.linkedin.com/jobs/view/student-tutor-at-metropolitan-state-university-of-denver-2596723817?refId=mOJu%2Fbb66D2s0arjMGwzXA%3D%3D&trackingId=Zu8XYVvZ10%2FcGDpUTzAWdA%3D%3D&position=6&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong>Required Qualifications<br></strong><ul><li> Junior or Senior MSU Denver Computer Science students</li><li> Works independently</li><li> Analyzes theoretical and programming</li><li> Requires mastery of concepts and skills taught in relevant courses.<br></li></ul><strong><u>Duties/Responsibilities<br><br></u></strong><strong>Preferred Qualifications<br><br></strong>Provides online tutoring or tutoring in the CS lab or CS student lounge (AES237) for students in general studies and CS1030/1050/2050/1400/2400.\n      "
    },
    {
        "position": "Quantitative Investment Intern",
        "company": "Providence ",
        "location": {
            "city": " Renton",
            "state": "WA"
        },
        "posted": "2021-06-24T08:39:25.271Z",
        "url": "https://www.linkedin.com/jobs/view/quantitative-investment-intern-at-providence-2612561773?refId=mOJu%2Fbb66D2s0arjMGwzXA%3D%3D&trackingId=qtkQsjvZHOXC6Pen1MUx7Q%3D%3D&position=9&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Description<br><br></u></strong><strong>Providence St. Joseph Health is calling a</strong> <strong>Quantitative Investment Intern</strong> <strong>to our location in Renton, WA or Irvine, CA.<br><br></strong>We are seeking a Quantitative Investment Intern to assist the Manager of Investment Risk in assessing our internal tools for assessing and managing investment risks, and creating management reports summarizing the key themes and risks in the existing investment portfolio, focused on $5.5 billion of long term investment assets and $1.5 billion of pension assets. As an integral member of the System's investment team, the Quantitative RIsk Analyst will assist in enhancing and maintaining the System investment models and tools used to monitor portfolio performance, asset allocation and exposures, cash flows and liquidity. Additionally, the intern will prepare reports and support analysis for recommendations to senior management as well as to contribute to general reporting and control processes. In particular, the candidate is expected to assist the Manager of Risk in working with one or more outside vendors to implement a comprehensive risk management architecture for the system, which will cover $10bn plus of assets and over 100 external investment managers.<br><br><strong><u>In This Position You Will Have The Following Responsibilities<br></u></strong><ul> <li>Assist with managing, maintaining, and organizing various reports and documentation related to portfolio analytics.</li> <li>Utilizes investment related software and applications to generate portfolio analysis and perform reconciliation and other reports, including but not limited to monthly, quarterly reports, and other ad hoc requests.</li> <li>Ensures accuracy of data and timeliness of reporting for the system/region/entity/division.</li> <li>Assists with creating and maintaining financial models.</li> <li>Assists in preparing and compiling various reports, templates and analysis to support annual reporting and audit work.</li> <br><br></ul><strong><u>Qualifications<br><br></u></strong><strong>Required qualifications:<br></strong><ul> <li>Bachelor's Degree in Finance/Accounting/Computer Science.</li> <li>3 months Finance/Computational Finance role in a financial institution or related entity.</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Master's Degree in Computational Finance/Financial Engineering or equivalent education/experience.</li> <br><br></ul><strong><u>About The Department You Will Serve.<br><br></u></strong>Providence Shared Services provides a variety of functional and system support services for our Providence family of organizations across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.<br><br><strong>We offer comprehensive, best-in-class benefits to our caregivers. For more information, visit<br><br></strong>https://www.providenceiscalling.jobs/rewards-benefits/<br><br><strong>Our Mission<br><br></strong>As expressions of God’s healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.<br><br><strong><u>About Us<br><br></u></strong>Providence is a comprehensive not-for-profit network of hospitals, care centers, health plans, physicians, clinics, home health care and services continuing a more than 100-year tradition of serving the poor and vulnerable. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.<br><br><strong>Schedule:</strong> Part-time<br><br><strong>Shift:</strong> Day<br><br><strong>Job Category:</strong> Student/Interns<br><br><strong>Location:</strong> Washington-Renton<br><br><strong>Other Location(s):</strong> California-Irvine<br><br><strong>Req ID:</strong> 300261\n      "
    },
    {
        "position": "Outreach Intern",
        "company": "Caltech ",
        "location": {
            "city": " Hanford",
            "state": "WA"
        },
        "posted": "2021-06-08T08:39:57.134Z",
        "url": "https://www.linkedin.com/jobs/view/outreach-intern-at-caltech-2614148643?refId=Mkt%2FwzR43TgY4bb2lnd2jg%3D%3D&trackingId=oIqYTStzACniSCmIzO66bg%3D%3D&position=4&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Caltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.<br><br><strong>Job Summary<br><br></strong>LIGO Laboratory (the Laser Interferometer Gravitational-wave Observatory) seeks a highly motivated and skilled Outreach Intern to join its team. LIGO Laboratory is a National Science Foundation major facility dedicated to observing the newly discovered gravitational-wave universe. Jointly operated by the California Institute of Technology and Massachusetts Institute of Technology, the LIGO Laboratory operates world-leading observatories near Richland, WA and Baton Rouge, LA as well as R&amp;D centers on the Caltech and MIT campuses. The LIGO Laboratory’s mission spans a broad and vibrant array of activities related to gravitational-wave physics and astronomy, including detector operations, R&amp;D toward detector improvements, gravitational-wave astrophysics, observatory operations, and education and public outreach.<br><br><strong><u>For More Information, Please Visit The Laboratory Website At<br><br></u></strong>This position is located in Richland, WA.<br><br><strong>Life at LIGO Hanford Observatory as a Caltech Employee<br><br></strong>LIGO’s observatory in the shrub-steppe of Eastern Washington is an approximately 20-minute commute from Richland, WA., where it is located on the edge of the Department of Energy Hanford Site. Caltech employs a staff of 49 at the Hanford observatory. Caltech has an extraordinary science impact across many fields. Its small size creates a community where innovation and collaboration are the norm. Caltech manages the Jet Propulsion Laboratory (JPL) for NASA, the leading US center for the robotic exploration of the Solar System. Caltech also operates large-scale research facilities such as the Palomar and Keck Observatories.<br><br><strong><u>Caltech HR Diversity Page<br><br></u></strong>Caltech and LIGO Laboratory’s goal is to build a world-class, diverse workforce and support an inclusive environment that encourages professional development and offers top-notch benefits. Our talented staff, who work at the Caltech campus, or one of our Observatories, come from a variety of fields. Positions include scientists, engineers, information technology staff, outreach professionals, managers, writers, business professionals, and administrative staff. We are deeply committed to encouraging people of all backgrounds to apply for these opportunities. Our experience has demonstrated that the broader the styles, characteristics, backgrounds, and abilities of our staff—in other words, the more diverse our team is—the greater potential we have for success. Caltech is an equal opportunity employer.<br><br>LIGO Laboratory is committed to being a welcoming place for everyone regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, or veteran status.<br><br><strong>Job Duties<br><br></strong>LIGO seeks a highly motivated and skilled Outreach Intern to join its team. Interns will spend time both with outreach and scientific staff facilitating the growth of their communication, as well as technical, knowledge and skills. Outreach interns assist EPO staff in leading outreach activities such as field trips, STEM nights, and classroom activities. In addition to assisting with current outreach activities interns use their creativity and knowledge to design new lessons, activities, and programs. When not assisting with outreach activities interns have the opportunity to work on project with one of several groups on site such as the electrical engineering lab or the computer science group. Interns are expected to work approximately 10 hours a week during school and 40 hours per week during the summer. Schedules are flexible and will take into account other commitments interns may have. Occasional nights and weekends may be required. Due to COVID interns are currently working remotely, but when it is safe work will be on-site at the LIGO Hanford Observatory and at local schools.<br><br><strong><u>Basic Qualifications<br></u></strong><ul><li>Candidate should be currently pursuing an undergraduate degree for one of the following fields of study: education, engineering, computer science, or physics.<br></li></ul><strong>Preferred Qualifications<br></strong><ul><li>Previous experience working with K-12 students and/or the public.<br></li></ul><strong><u>Required Documents<br></u></strong><ul><li>Resume</li><li>Cover Letter<br></li></ul><strong> EEO Statement <br><br></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, or national origin, disability status, protected veteran status, or any other characteristic protected by law.<br><br>Caltech is a VEVRAA Federal Contractor.<br><br>To read more Equal Employment Opportunity (EEO) go to eeoc_self_print_poster.pdf.<br><br><strong> Disability Accommodations <br><br></strong>If you would like to request an accommodation in completing this application, interviewing, or otherwise participating in the employee selection process, please direct your inquiries to Caltech Recruiting at employment@caltech.edu<br><br>Share\n      "
    },
    {
        "position": "Software Engineering Intern/Co-op Student - Fall 2021",
        "company": "Becht ",
        "location": {
            "city": " Medina",
            "state": "OH"
        },
        "posted": "2021-06-10T08:40:36.512Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-co-op-student-fall-2021-at-becht-2632987921?refId=76K6zWFaT4nB%2FBT%2BEoJgXQ%3D%3D&trackingId=q1SPtoLyoSPrwH%2BLieUB%2BQ%3D%3D&position=4&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong>Becht is a 5 STAR rated Glassdoor, a Top 100 Best Places to Work in New Jersey according to NJBIZ and a Great Place to Work-Certified™ company!<br><br></strong><strong> <u> Please attach a recent unofficial transcript with your resume. If you are a Master's degree student, please also upload your Bachelor's degree transcript. Failure to do so will create a delay in the review of your application. </u> <br><br></strong><strong>Who is Becht? <br></strong>Founded in 1964, Becht is a rapidly-growing, multi-discipline consulting firm relied on by customers to relentlessly solve their most difficult and entrenched problems. We combine vast experience through our network of over 1500 technical experts with both engineering expertise and professional experience. Becht is a company founded on excellence, and as such we seek individuals who want to be part of our passionate and energetic team.<br><br><strong>Who Do We Want? <br><br></strong><strong><u>Becht Strives To Provide The Student With<br><br></u></strong>Becht is seeking junior, senior, master’s or doctorate computer science/software engineering students with interest in web app development with a database back end who want to learn more by joining our world-class, family-owned engineering organization. Becht is committed to developing young professionals by providing opportunities to explore the dynamic environment of engineering consulting services.<br><ul><li> Real world experience with a consulting company operating with the latest technology</li><li> Guidance in the form of a highly trained mentor</li><li> A positive, team approach work environment</li><li> Hands on experience with the full SDLC during your internship<br></li></ul>At Becht, our intern/co-op program gives students the opportunity to explore the practical applications of their college classes while working with customers from around the globe. We offer full-time student positions for every semester. These positions actively support current projects and are constantly evolving. As a student with Becht, you will learn to develop internal and client facing web apps, web pages, and productivity tools with a team of other software developers and engineers. You will be involved in the entire process from setting application requirements, creating data models, and designing the interface, developing the front and back ends, testing and assisting in deployment. You will be at the forefront of our most advanced and technically rewarding projects to assist clients in improving reliability and profitability while also reducing risks to people and the environment.<br><br><strong>Build Your Career with Becht<br></strong>A creative and innovative work environment isn’t all we have to offer! When you join Becht, you can expect:<br><ul><li> A positive, collaborative workforce</li><li> Access to further training and development</li><li> Mentoring programs</li><li> Company and family events such as baseball games, go-karting, and bowling</li><li> Opportunities that provide stability as well as variety</li><li> Work day events such as birthday lunches</li><li> Community outreach programs such as Red Cross blood drives, Toys for Tots collections/volunteering, and United Way campaigns<br></li></ul><strong>Your Knowledge and Expertise <br></strong><ul><li> Passion for technology and can navigate across complex and rapidly changing landscapes</li><li> Detail oriented and organized</li><li> Creative and confident to express new ideas</li><li> Proven troubleshooting skills</li><li> Self-motivated and self-disciplined</li><li> Should be comfortable working in a virtual team</li><li> Ability to compartmentalize efforts—put one task down, pick up another, then resume the first with minimal ramp up required</li><li> Strong verbal and written communication skills</li><li> Object oriented programming experience</li><li> Database experience</li><li> MSSQL, Bootstrap, C# and/or .NET Core experience are a plus.</li><li> Must be enrolled in a Bachelor’s or Master’s Software Engineering, Computer Science, or equivalent, degree</li><li> Must be available to work 40 hours per week for a minimum of one semester</li><li> Remote or must be local or willing to temporarily relocate to the Medina, OH; Liberty Corner, NJ; or Humble, Houston, TX areas or KC or MO; Northland area.<br></li></ul><strong><u>6 Months Internship/Co-op Blocks Are Preferred.<br><br></u></strong>BECHT is an Equal Opportunity Employer.\n      "
    },
    {
        "position": "Summer Internship Opportunity - Computer Science related major - Position available immediately for this summer",
        "company": "Application Consulting Group ",
        "location": {
            "city": " Parsippany",
            "state": "NJ"
        },
        "posted": "2021-07-03T08:41:05.017Z",
        "url": "https://www.linkedin.com/jobs/view/summer-internship-opportunity-computer-science-related-major-position-available-immediately-for-this-summer-at-application-consulting-group-2621876950?refId=76K6zWFaT4nB%2FBT%2BEoJgXQ%3D%3D&trackingId=thK8ljBPGoAhiZUS6%2BrBKg%3D%3D&position=22&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Description<br><br></u></strong>ACG believes in successful career development. As an Intern with ACG you will experience hands-on training, and learn how to apply IBM Business Analytics Technologies to develop business solutions. Learn from top consultants and work alongside IT professionals, designing, developing, implementing and supporting first-rate business solutions. Commonly used technologies are IBM Cognos TM1, Python, VBA, Oracle and SQL Server.<br><br><strong><u>Qualifications<br><br></u></strong>Looking for a rising college senior entering their final year of an undergraduate degree. Major must be in Computer Science, MIS or Finance/Business with experience in a programming capacity along with solid programming coursework. Previous classes and an interest in Finance is also a strongly desired skill set in a candidate. Will consider the following programming skills: General Object Orientated Programming concepts, Java, C, Python or Visual Basic, Relational Technologies (SQL Server, Oracle, SQL querying) . Must have excellent communication skills.\n      "
    },
    {
        "position": "2022 Analytics and Data Science Intern (EPIC)",
        "company": "Trane Technologies ",
        "location": {
            "city": " North Carolina",
            "state": "United States"
        },
        "posted": "2021-07-02T08:41:38.151Z",
        "url": "https://www.linkedin.com/jobs/view/2022-analytics-and-data-science-intern-epic-at-trane-technologies-2619815632?refId=k9p9ypC03aIxHdQtAqLk%2BA%3D%3D&trackingId=5y0FuMA5CGKrLNh98zDk1Q%3D%3D&position=18&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        At Trane Technologies® we Challenge Possible. Our brands – including Trane® and Thermo King® - create access to cooling and comfort in buildings and homes, transport and protect food and perishables, connect customers to elevated performance with less environmental impact, dramatically reduce energy demands and carbon emissions, and innovate with a better world in mind. We boldly challenge what’s possible for a sustainable world.<br><br>Job Summary:<br> Trane Technologies Enterprise Program for Interns and Co-ops (EPIC) provides current college students with challenging assignments, leadership training, valuable exposure to our company's senior leaders and opportunities to network. Our 12-week summer EPIC opportunity offers candidates working toward their Bachelor’s in Management Information Systems, Business Information Technology, Computer Science or similar majors’ exposure to a variety of assignments which could include: Project Management, Business Analysis, Supplier Management, Infrastructure, and Application Management.<br>Here at Trane Technologies, we value our people and their development. Through our EPIC program, participants will have an opportunity to interview for our full-time, post-graduate Accelerated Development Program for IT. Click here to learn more.<br>Successful Candidate’s Profile:<br>We are looking for performance-driven, innovative leaders who understand the importance of collaboration and customer focus.<br>- Collaborate with others to foster effective teamwork by linking own responsibilities to the team’s goals and needs - zeal for new information, knowledge, and experiences<br>- Ensure effective planning, coordination, and implementation of plans with other functions and key stakeholders<br>- Identify complex problems and review related information to develop and evaluate options and implement solutions<br>- Willing to be mobile and relocate anywhere in the United States<br>- Pursuing a BS/BA in Management Information Systems, Information Technology, or Computer Science with a cumulative overall GPA at or above 3.0<br>- Minimum Work Experience: At least one internship or work experience<br>- Demonstrated leadership skills such as: campus organizations, sports team captain, resident advisor, etc. or exceptional leadership of work projects<br>- U.S. citizen or have the legal right to work in the U.S. without requiring sponsorship now or in the future<br><br>We offer competitive compensation and comprehensive benefits and programs that help our employees thrive in both their professional and personal lives. We are proud of our winning culture which is inclusive and respectful at its core. We share passion for serving customers, caring for others, and boldly challenging what’s possible for a sustainable world.<br><br>We are committed to achieving workforce diversity reflective of our communities. We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, pregnancy, age, marital status, disability, status as a protected veteran, or any legally protected status.\n      "
    },
    {
        "position": "Computing Graduate Student Intern - Fall",
        "company": "Lawrence Livermore National Laboratory ",
        "location": {
            "city": " Livermore",
            "state": "CA"
        },
        "posted": "2021-06-17T08:42:05.180Z",
        "url": "https://www.linkedin.com/jobs/view/computing-graduate-student-intern-fall-at-lawrence-livermore-national-laboratory-2628599888?refId=cu9t2xkDxeo%2By96eSxZqmA%3D%3D&trackingId=WkbT8bSwwzCOpbHe4OBg0w%3D%3D&position=10&pageNum=19&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Company Description<br><br></u></strong><strong>Join us and make YOUR mark on the World!<br><br></strong>Are you interested in joining some of the brightest talent in the world to strengthen the United States’ security? Come join Lawrence Livermore National Laboratory (LLNL) where our employees apply their expertise to create solutions for BIG ideas that make our world a better place.<br><br>We are committed to a diverse and equitable workforce with an inclusive culture that values and celebrates the diversity of our people, talents, ideas, experiences, and perspectives. This is essential to innovation and creativity for continued success of the Laboratory’s mission.<br><br><strong><u>Job Description<br><br></u></strong>We have multiple openings for our Fall Graduate Internship Program taking place from October 1, 2021 to December, 2021. Our openings are for graduate level students or students who have completed their bachelor’s or master’s degree who will be given the opportunity to engage in practical research to further their educational goals. The selected interns will provide technical and/or research support to projects in the areas of computational science, cyber defense, computer science, numerical methods, mathematics, or other related fields.<br><br><strong>In this role you will <br></strong><ul><li>Work with scientists, engineers, and technical staff members to provide technical and/or research support to projects in the areas of computational science, numerical methods, mathematics, or other related fields.</li><li>Support documentation, testing, creation or modification of Laboratory software, hardware, or Computer operating systems.</li><li>Under limited direction and supervision, will conduct research in assigned area.</li><li>Perform technical assignments of basic degree of complexity and provide technical support to scientists in scientific research and development projects.</li><li>Present work through presentations and/or poster sessions.</li><li>Perform other duties as assigned.<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Must be a continuing college student in good standing at an accredited institution pursuing a graduate degree or has completed their bachelor’s or master’s degree.</li><li>Ability to apply computational science and/or mathematical principles to solve technical problems.</li><li>Demonstrated academic achievement in scientific curriculum.</li><li>Demonstrated effective communication skills.</li><li>Ability to present and communicate concepts and ideas.</li><li>Experience applying advanced computational science and/or mathematical principles to solve technical problems.</li><li>Experience working with personal computers and familiarity with Word, Excel and PowerPoint.</li><li>Ability to work in a team environment.<br><br></li></ul><strong><u>Qualifications We Desire<br></u></strong><ul><li>GPA of 3.0 or above.<br><br></li></ul><strong><u>Additional Information<br><br></u></strong><strong>Why Lawrence Livermore National Laboratory?<br></strong><ul><li>Included in 2021 Best Places to Work by Glassdoor!</li><li>Work for a premier innovative national Laboratory</li><li>Comprehensive Benefits Package</li><li>Flexible schedules (*depending on project needs)</li><li>Collaborative, creative, inclusive, and fun team environment<br></li></ul>Learn more about our company, selection process, position types and security clearances by visiting our Career site.<br><br><strong>Security Clearance<br><br></strong>LLNL is a Department of Energy (DOE) and National Nuclear Security Administration (NNSA) Laboratory. Some positions will require a DOE L or Q clearance (please reference Security Clearance requirement above). If you are selected and a clearance is required, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. An L or Q clearance requires U.S. citizenship. For additional information please see DOE Order 472.2.<br><br><strong>Equal Employment Opportunity<br><br></strong>LLNL is an affirmative action and equal opportunity employer that values and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, pregnancy, protected veteran status, age, citizenship, or any other characteristic protected by applicable laws.<br><br>If you need assistance and/or a reasonable accommodation during the application or the recruiting process, please submit a request via our online form.<br><br><strong>California Privacy Notice<br><br></strong>The California Consumer Privacy Act (CCPA) grants privacy rights to all California residents. The law also entitles job applicants, employees, and non-employee workers to be notified of what personal information LLNL collects and for what purpose. The Employee Privacy Notice can be accessed here.\n      "
    },
    {
        "position": "Quantitative Investment Intern",
        "company": "Providence ",
        "location": {
            "city": " Renton",
            "state": "WA"
        },
        "posted": "2021-06-24T08:43:09.266Z",
        "url": "https://www.linkedin.com/jobs/view/quantitative-investment-intern-at-providence-2612561773?refId=xn9Is3RFwNyHnTZIRJQCMA%3D%3D&trackingId=i0lHZzI0PR3jxfwwEjMh9A%3D%3D&position=1&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Description<br><br></u></strong><strong>Providence St. Joseph Health is calling a</strong> <strong>Quantitative Investment Intern</strong> <strong>to our location in Renton, WA or Irvine, CA.<br><br></strong>We are seeking a Quantitative Investment Intern to assist the Manager of Investment Risk in assessing our internal tools for assessing and managing investment risks, and creating management reports summarizing the key themes and risks in the existing investment portfolio, focused on $5.5 billion of long term investment assets and $1.5 billion of pension assets. As an integral member of the System's investment team, the Quantitative RIsk Analyst will assist in enhancing and maintaining the System investment models and tools used to monitor portfolio performance, asset allocation and exposures, cash flows and liquidity. Additionally, the intern will prepare reports and support analysis for recommendations to senior management as well as to contribute to general reporting and control processes. In particular, the candidate is expected to assist the Manager of Risk in working with one or more outside vendors to implement a comprehensive risk management architecture for the system, which will cover $10bn plus of assets and over 100 external investment managers.<br><br><strong><u>In This Position You Will Have The Following Responsibilities<br></u></strong><ul> <li>Assist with managing, maintaining, and organizing various reports and documentation related to portfolio analytics.</li> <li>Utilizes investment related software and applications to generate portfolio analysis and perform reconciliation and other reports, including but not limited to monthly, quarterly reports, and other ad hoc requests.</li> <li>Ensures accuracy of data and timeliness of reporting for the system/region/entity/division.</li> <li>Assists with creating and maintaining financial models.</li> <li>Assists in preparing and compiling various reports, templates and analysis to support annual reporting and audit work.</li> <br><br></ul><strong><u>Qualifications<br><br></u></strong><strong>Required qualifications:<br></strong><ul> <li>Bachelor's Degree in Finance/Accounting/Computer Science.</li> <li>3 months Finance/Computational Finance role in a financial institution or related entity.</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Master's Degree in Computational Finance/Financial Engineering or equivalent education/experience.</li> <br><br></ul><strong><u>About The Department You Will Serve.<br><br></u></strong>Providence Shared Services provides a variety of functional and system support services for our Providence family of organizations across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.<br><br><strong>We offer comprehensive, best-in-class benefits to our caregivers. For more information, visit<br><br></strong>https://www.providenceiscalling.jobs/rewards-benefits/<br><br><strong>Our Mission<br><br></strong>As expressions of God’s healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.<br><br><strong><u>About Us<br><br></u></strong>Providence is a comprehensive not-for-profit network of hospitals, care centers, health plans, physicians, clinics, home health care and services continuing a more than 100-year tradition of serving the poor and vulnerable. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.<br><br><strong>Schedule:</strong> Part-time<br><br><strong>Shift:</strong> Day<br><br><strong>Job Category:</strong> Student/Interns<br><br><strong>Location:</strong> Washington-Renton<br><br><strong>Other Location(s):</strong> California-Irvine<br><br><strong>Req ID:</strong> 300261\n      "
    },
    {
        "position": "Mobile App Development Intern",
        "company": "Axtria - Ingenious Insights ",
        "location": {
            "city": " Berkeley Heights",
            "state": "NJ"
        },
        "posted": "2021-07-01T08:43:31.720Z",
        "url": "https://www.linkedin.com/jobs/view/mobile-app-development-intern-at-axtria-ingenious-insights-2628660484?refId=xn9Is3RFwNyHnTZIRJQCMA%3D%3D&trackingId=v%2F%2Ff9zHxGYjgCQevS3Tapw%3D%3D&position=15&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Introduction<br><br></u></strong>Axtria is a global provider of cloud software and data analytics to the Life Sciences industry. We help Life Sciences companies transform the product commercialization journey to drive sales growth and improve healthcare outcomes for patients. Our work impacts millions of patients and results in improved health outcomes.<br><br>Since our founding in 2010, technology innovation has been our winning differentiation, and we continue to leapfrog competition with platforms that deploy Artificial Intelligence and Machine Learning. Our cloud-based platforms Axtria DataMax™, Axtria InsightsMax™, Axtria SalesIQ™, and Axtria MarketingIQ™ enable customers to efficiently manage data, leverage data science to deliver insights and bring insights to the point of decision. Clients use our platforms and services to manage end-to-end commercial operations and drive improved patient health outcomes.<br><br>With customers in over 75 countries, Axtria is one of the largest global commercial solutions providers in the Life Sciences industry. We continue to win industry recognition for growth and are featured in some of the most aspirational lists - INC 5000, Deloitte FAST 500, NJBiz FAST 50, SmartCEO Future 50, Red Herring 100, and several other growth and technology awards.<br><br>Axtria is looking for exceptional talent to join our rapidly growing global team. People are our biggest asset! Our transparent and collaborative culture offers a chance to work with some of the brightest minds in the industry. Axtria Institute, our in-house university, offers the best training in the industry and an opportunity to learn in a structured environment. A customized career progression plan ensures every associate is setup for success and able to do meaningful work in a fun environment. We want our legacy to be the leaders we produce for the industry. Will you be next?<br><br><strong><u>Job Description<br><br></u></strong>We are looking for a mobile app developer intern having 1+ years of experience who welcomes both engineering and sustenance tasks. The primary focus will be to write code for user interfaces, features, and unit tests. You will be working on a react-native application with a global team of mobile developers and mentored by senior mobile app developers. The candidate will demonstrate an ability to think creatively, strategically and communicate efficiently. The candidate will personally benefit from the internship experience.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Develop new features and user interfaces from wireframe models for the mobile app product</li><li> Fix bugs and performance problems-Writing clean, readable, and testable code-Working with back-end developers, designers, and the rest of the team to deliver high quality readable code.</li><li> Continuously discover, evaluate, and implement new technologies to maximize development efficiency<br></li></ul><strong><u>About Yourself<br></u></strong><ul><li> You should be a self-starter with either some iOS mobile development experience using React-Native, Ionic, Cordova, Swift and Xcode OR Android development experience using iOS.</li><li> Someone who enjoys learning new technologies and integrating with 3rd party APIs</li><li> Some Proficiency in Java/JavaScript</li><li> Familiarity with Git</li><li> Familiarity with salesforce mobile sdk and salesforce apis would be bonus</li><li> Qualification– Rising Seniors pursuing BA/BS/MS degree in Computer Science or related technical field</li><li> Available to start as soon as possible.</li><li> Able to dedicate up to 20 hours a week during the internship period</li><li> US Citizens or Students with OPT visa only accepted. We are not able to sponsor visas for interns at this time</li></ul>\n      "
    },
    {
        "position": "Marketing and Sales Analyst Intern - Bentonville, AR",
        "company": "McKee Foods Corporation ",
        "location": {
            "city": " Collegedale",
            "state": "TN"
        },
        "posted": "2021-07-07T08:43:41.601Z",
        "url": "https://www.linkedin.com/jobs/view/marketing-and-sales-analyst-intern-bentonville-ar-at-mckee-foods-corporation-2627243612?refId=xn9Is3RFwNyHnTZIRJQCMA%3D%3D&trackingId=rXkgWsTNB0oBeTVsTXBiJg%3D%3D&position=21&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Current employees who have worked for McKee Foods for at least six months and have a good performance record may apply and be considered for an internship. If selected, they are eligible for regular hourly part-time employee benefits. Current employees should apply using our internal posted jobs process.<br>Internship may be remote but is subject to change based on Covid-19 guidelines and company decisions. This is a year-round internship. Candidates must live within commuting distance to Bentonville, Arkansas.<br>Best known for Little Debbie® snack cakes, America's leading snack cake brand, Sunbelt Bakery® granola products, and Drake's Cakes®, McKee Foods Corporation is seeking a student Intern who will work in the Category Insights Department. This position will be conducting data analysis in support of the work done by Category Analysts, which has a direct impact on our products in the marketplace. The ideal candidate has the potential to work and learn with us throughout his/her college career. This is an exciting opportunity to gain valuable experience with a company that is committed to providing consumers with quality products at an excellent value. McKee Foods Corporation, a privately-held, family-owned bakery, has been in business since 1934. We have a long history of innovation and treating employees with respect, and a deeply held belief in the importance of doing business with integrity.<br>Schedule<br>Monday - Friday, flexible work schedule with hours varying between 7:00 a.m. - 6:00 p.m. (expected to work approximately 20 hours per week during school year and up to 40 during summer months and school breaks)<br><br><strong><u>Job Summary<br><br></u></strong>You'll learn from a great team of business analysts and report to our Category Advisor, supporting Walmart, one of largest retailers. As an Intern in Category Insights, you will be an active part of the team that analyzes sales data for key insights and new opportunities at retail. You will compile data into reports and presentations, and monitor reports for existing business opportunities and historical performance. This includes providing support for sales and execution strategies, preparing planograms, developing sales stories, and communicating key information to internal and external customers.<br>Make McKee Foods a stable part of your education plan and you will develop the technical, business and customer service skills needed to become a well-rounded business professional!<br><br><strong><u>Required Qualifications<br></u></strong><ul><li> Current enrollment in a bachelors or graduate degree program in Business Management, Accounting, Marketing, Statistics, Data Analytics, Mathematics, Business Intelligence, Computer Science, or related field</li><li> Sophomore, Junior, Senior or Graduate student</li><li> Demonstrated ability with Microsoft Office and Excel (i.e. ability to create charts, graphs, pivot tables, advanced formulas, statistical tools, pivot tables, etc.)</li><li> Ability to present findings and data to multiple levels of management</li><li> Interest in business analysis and insight discovery skills</li><li> Interest in and/or aptitude for working with Analytics, Retail, Sales and Marketing departments</li><li> Customer service skills</li><li> Willing and able to work in a team-oriented environment</li><li> Willing to accept responsibility and perform with minimal supervision</li><li> High level of initiative and drive</li><li> Good oral and written communication skills</li><li> Strong organizational skills</li><li> Ability and willingness to learn new skills</li><li> Ability to work with a diverse customer base<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> 3.0 GPA or higher on a 4.0 scale</li><li> Tableau or other Visual Analysis software experience</li><li> Category Management Association (CMA) Certification(s)</li><li> Ability to work with basic statistical functions such as linear regression algorithms</li><li> Understanding of advanced database techniques, data visualization, data warehousing, online analytical processing (OLAP), data mining, decision support systems (DSS), artificial intelligence (AI) methods and other Business Intelligence (BI) topics</li><li> Demonstrated understanding of both qualitative and quantitative research methodologies</li><li> Demonstrated abilities with both custom and syndicated research</li><li> Experience in the consumer packaged goods business or working in a retail environment</li><li> Experience in category management processes and/or consumer/shopper insights<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Competitive pay scale</li><li> 401(k) with matching contributions</li><li> Direct deposit payroll</li><li> Credit Union</li><li> Exercise and recreation facility<br></li></ul>Please note: Spare and limited employees (*including interns) are not eligible for some company benefits.<br><ul><li> Please upload your current resume to be fully considered for this position.<br></li></ul>EOE, including disability/veterans\n      "
    },
    {
        "position": "Gas Power Digital Technology Intern – 2022",
        "company": "GE Power ",
        "location": {
            "city": " Greenville",
            "state": "SC"
        },
        "posted": "2021-06-10T08:43:52.929Z",
        "url": "https://www.linkedin.com/jobs/view/gas-power-digital-technology-intern-%E2%80%93-2022-at-ge-power-2638633212?refId=rxMbTUksPRWv0HTtnjfiwA%3D%3D&trackingId=DayzxcpxZ2uR%2F%2FYhvtjOTQ%3D%3D&position=3&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Job Description Summary<br><br></u></strong><strong>Job Description Summary<br><br><br></strong><strong>Job Description<br><br></strong>GE Gas Power is seeking sharp, personable, highly-organized interns who are looking for the opportunity to grow their technical and professional skills while building a career with unlimited potential. Interns will learn from the best in the industry and work on substantial projects with real world implications, getting hands-on with digital technologies!<br><br><strong><u>Essential Responsibilities<br><br></u></strong>We offer meaningful, impactful assignments as well as an assignment that includes team building, career development opportunities, and more! Digital Technology Interns are GE’s primary pipeline to full-time employment opportunities either as a direct hire or as a member of one of our worldclass early talent leadership programs. Digital Technology Interns are hired to focus on a particular area of the GE business based on availability of positions, the interviewer's assessment, and the applicant's preference.<br><br>Focus areas could include but are not limited to Predix/Digital Platforms, Digital Engineering, Data Analytics &amp; Operations, Technical Product Management, and more.<br><br>Digital intern assignments, typically 10 to 12 weeks in length, are dynamic and challenging based on the business needs and the type of work required. Interns have significant exposure to key IT and Software business leaders at GE; as well as a global internship support network to accelerate learning and development.<br><br><strong>Potential Locations Include:<br></strong><ul><li>Greenville, South Carolina; Schenectady New York; Atlanta, GA; and other Gas Power Locations<br><br></li></ul><strong>Relocation Assistance:<br><br></strong>Co-op/Interns will be reimbursed for reasonable, proper, and documented expenditures incurred while initially reporting to work and returning to school/home upon completion of the assignment. Employees with a permanent address greater than 50 miles from the work location are eligible.<br><br><strong><u>Housing Allowance<br><br></u></strong>Co-op/Interns employees receive a weekly housing allowance to help off-set living expenses when the co-op/Intern’s permanent residence is at least 50 miles away from the work location.<br><br><strong><u>Employment Dates<br></u></strong><ul><li>January to May 2022 (Spring) </li><li>May/June to August 2022 (Summer) </li><li>August to December 2022 (Fall)</li><li>Co-Op opportunities to be staffed and defined as applicable<br><br></li></ul><strong><u>Qualifications/Requirements<br></u></strong><ul><li>Currently enrolled in a Bachelor’s or Master’s Degree program at an accredited university or credentialed software accelerator program. </li><li>Degree focused in Computer Science, Computer Engineering, Computer Information Systems, IT Security, Informatics, Information Science/Technology, Management Information Systems, Software Engineering, Security and Risk Analysis, or other relevant STEM majors with Software/IT experience. </li><li>Must maintain a minimum 3.0 cumulative GPA (without rounding). </li><li>Must submit your application for employment through https://www.ge.com/university </li><li>Must be willing to take a drug test as part of the selection process </li><li>Must be willing to submit to a background investigation as part of the selection process </li><li>Must be 18 years of age or older </li><li>Must be able to develop and maintain good customer relationships </li><li>Must have reliable transportation and a valid driver's license </li><li>Must be willing to work in geographical area specified by the business </li><li>Must have the ability to work in the US for an unlimited amount of time without sponsorship<br><br></li></ul><strong><u>Desired Characteristics<br></u></strong><ul><li>Prior intern, co-op, or research experience in software, IT or relevant area. </li><li>Leadership experience inside and/or outside the classroom. </li><li>A strong commitment to a career in technology and passion/aptitude for both software and information technology. </li><li>Strong analytical and technical skills with experience in software industry standards and development tools. </li><li>Excellent written and verbal communication skills and ability to articulate clearly. </li><li>Demonstrated creative problem solving and proactive learning.</li></ul><strong> <strong><strong><strong>Additional Information<br><br></strong>GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer . Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.<br><br>GE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).<br><br><strong>Relocation Assistance Provided: </strong> No</strong></strong></strong>\n      "
    },
    {
        "position": "Systems Administrator Intern - 4 Month Fall Term",
        "company": "BlackBerry ",
        "location": {
            "city": " Plano",
            "state": "TX"
        },
        "posted": "2021-06-08T08:44:08.922Z",
        "url": "https://www.linkedin.com/jobs/view/systems-administrator-intern-4-month-fall-term-at-blackberry-2607316380?refId=rxMbTUksPRWv0HTtnjfiwA%3D%3D&trackingId=5RwzWGeFiHk9cVWIrwfXXg%3D%3D&position=13&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <strong><u>Worker Sub-Type<br><br></u></strong>Student (Fixed Term)<br><br><strong><u>Position Summary<br><br></u></strong><strong><strong><strong> Job Description: <br><br></strong></strong></strong>As a Systems Administrator Student in the Regional IT Support Team, you will be part of a small team in our Irving, Texas office that provide excellent support to our end users. End users, as we all, need to have very little down time so it is important that we help them resolve any issues that impact their ability to do their job.<br><br>The Regional IT Support Team at BlackBerry provides support to end users globally. This support includes analyzing and repairing issues with computers, assisting in the users in the configuration of their mobile devices and, as needed, provides support in data centers in Irving, with racking and cabling servers. Your quick and educated response to customer issues will ensure that the customers can continue to work.<br><br>Reporting to the Senior System Administrator in Irving, you will be responsible for checking a ticket queue and resolving issues within a certain amount of time depending on priority. This position will require you to pull all your computer science skills into play and offer many leaning opportunities in this field.<br><br>Term: 4 Months<br><br>Location: Irving, Texas, US<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Provide world-class support and reinforce customer confidence while a resolution is being investigated</li><li>Partner with other System Administrators to effectively manage customer issues and escalations as well as customer satisfaction</li><li>Delegate escalations, as needed, to other members of the team or specific providers in IT</li><li>Triage incoming emails from various stakeholders and customers</li><li>Maintain and update the Computer Inventory - place and track orders for accessories and devices</li><li>Create new/update Knowledge Base documentation as required<br><br></li></ul><strong><u>Skills And Qualifications<br></u></strong><ul><li>Currently pursuing an Associate or Bachelor degree in a related field, or equivalent combination of education and experience. (Degrees/Diplomas in Computer Science)</li><li>Ability to support Windows 10, Ubuntu and Mac operating systems</li><li>Basic understanding of Active Directory</li><li>Basic understanding of IP</li><li>Superior communication (fluent English written and verbal) skills required</li><li>Strong customer service orientation with a keen sense of urgency and priorities</li><li>Excellent judgment and decision making skills which enable you to juggle several priorities whilst continuing to meet deadlines</li><li>Strong partnership and collaboration skills; able to develop and maintain effective relationships with peers, executives, customers, and other internal and external stakeholders.</li><li>Solid planning and project management skills<br><br></li></ul><strong><u>Additional Assets<br></u></strong><ul><li>Previous experience working in a computer science field</li><li>Previous experience in customer support<br><br></li></ul><strong><u>Job Family Group Name<br><br></u></strong>Business Administration &amp; Operations<br><br><strong><u>Scheduled Weekly Hours<br><br></u></strong>40\n      "
    },
    {
        "position": "Product Management Intern - Hardware",
        "company": "Formlabs ",
        "location": {
            "city": " Somerville",
            "state": "MA"
        },
        "posted": "2021-06-08T08:44:12.431Z",
        "url": "https://www.linkedin.com/jobs/view/product-management-intern-hardware-at-formlabs-2621948328?refId=rxMbTUksPRWv0HTtnjfiwA%3D%3D&trackingId=ivoQ25ZK12zALnzySL4foA%3D%3D&position=15&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        To reinvent an industry, you have to build the best team. <strong>Join Formlabs</strong> if you want to bring groundbreaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.<br><br>The product team at Formlabs helps guide hardware, materials, and software products to completion. From defining the requirements for new products, determining features and user experience, and following products through development all the way to shipping, the Product team is looking for someone with instincts for product development, who is ready to help us develop great hardware, materials, and digital experiences.<br><br>If you want to evaluate user needs for our products through market research, use your findings to provide insights on essential decisions, and connect our designers and engineers to the voice of the customer, we want you as our <strong>Hardware Product Intern</strong>.<br><br><strong>The Job:<br><br></strong><ul> <li>Evaluate user needs for our products</li> <li>Conduct user and market research</li> <li>Collect and analyze data from our resources to understand how our customers are using their printers</li> <li>Collaborate across multiple diverse teams</li> <br></ul><strong>You:<br><br></strong><ul> <li>Have an analytical or research background</li> <li>Highly curious and creative</li> <li>Data-driven and self-motivated to accomplish tasks</li> <li>Have some technical and lab experience</li> <li>Value collaboration with internal partners</li> <li>Inspire with your projects and are always aiming to push something further</li> <br></ul><strong>Bonus Skills</strong> (Optional):<br><br><ul> <li>Background in engineering, computer science, materials, or chemistry</li> <li>Experience with user research, market research, or product management</li> <br></ul><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br></em><strong><em>Even if you don't check every box, but see yourself contributing, please apply.</em></strong><em> Help us build an inclusive community that will change the face of 3D printing.</em>\n      "
    },
    {
        "position": "BT-1988 Junior Quality Assurance Specialist (Internship) - AL0002948619",
        "company": "Bastion Technologies, Inc. ",
        "location": {
            "city": " Huntsville",
            "state": "AL"
        },
        "posted": "2021-05-09T08:45:29.179Z",
        "url": "https://www.linkedin.com/jobs/view/bt-1988-junior-quality-assurance-specialist-internship-al0002948619-at-bastion-technologies-inc-2599496574?refId=Ow4llG2gbldDibykc0e8lQ%3D%3D&trackingId=ww64gxYJzv5OBJxDkOzBVA%3D%3D&position=14&pageNum=24&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Job Description:Candidate will be working towards a degree or seeking experience in one of the fields listed below:Engineering ( ME, EE, IE, CE or related Engineering degree)Supply Chain Management (Supply Chain Management or related business degree)Business Administration (Business or Finance Degree)Management Information Systems (MIS or Computer Science degree)Quality Assurance (AS degree or Quality Assurance knowledge)The duration of this task is approximately 10 12 weeks(to coincide with typical university calendars for Spring, Summer, and Fall semesters). Longer durations are negotiable. This internship will expose the candidate to as many NASA Safety Mission Assurance (SMA) processes as practical.Required Skills:HS or equivalent GED Education required0-3 Years of ExperienceMust be a US citizenMust be able to pass a national agency checkMust be able to pass pre-employment and periodic random drug and alcohol screenings.Knowledge of Microsoft OfficeOther Desired Skills:Position requires a competent communicator (verbal and written) with ability to work harmoniously and effective with co-workers, Bastion Management and all levels of customer personnel. NASA or NASA related experience is a plus. MSFC experience is a big plus. Required to be regular in attendance (per agreed to work hours schedule), consistently punctual and be relied upon to successfully completed, the all assignments.Bastion participates in the e-Verify and EEOFor more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.https://www.applicantpro.com/j/1786405-68988\n      "
    },
    {
        "position": "IT Support Intern with Security Clearance",
        "company": "ClearanceJobs ",
        "location": {
            "city": " Albuquerque",
            "state": "NM"
        },
        "posted": "2021-06-24T08:45:59.292Z",
        "url": "https://www.linkedin.com/jobs/view/it-support-intern-with-security-clearance-at-clearancejobs-2621553190?refId=pqUQ8QzcqMy1MCo9NEavXw%3D%3D&trackingId=gTdsWvn1qF2gTR6kb4BBPw%3D%3D&position=8&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Responsibilities JOB Description Summary and Objective A-Tech, LLC, A BlueHalo Company (ATA) has an opportunity for a Computer Science student. The intern will provide technical support to our company's staff. The Technician should have good technical knowledge of computer systems, hardware and software. They should be able to understand and troubleshoot a problem as well as effectively communicate its solution. The Technician will be expected to respond fast to technical issues in order to minimize downtime of our employees. The performance goals for the position are to provide fast and useful technical assistance in order to support the working availability of our IT infrastructure and to identify and implement corrective and preventative changes to sustain and improve availability. Work Environment This job operates in professional/secure office &amp; laboratory environment. This position routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets, fax machines and other equipment as needed. Physical Demands The physical demands described here are representative of those that must be met by an intern to successfully perform the essential functions of this job. While performing the duties of this job, the intern is occasionally required to stand, walk, sit, use hands to finger, handle or feel objects, tools or controls, reach with hands and arms, climb stairs, talk or hear. The intern must occasionally lift or move up to 100 pounds. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Position Type and Expected Hours of Work This is a part-time position (up to 40 hours per week) for a limited duration, determined by the student's academic calendar. Flexible work hours may be authorized subject to approval by the project manager. Travel Travel is not required for this internship. Primary Location: Albuquerque, NM Relocation Available: No Qualifications Required Education and Experience * Must be a US Citizen, able to obtain and maintain a US DoD Security Clearance. * Enrolled in Associates or Bachelor of Science in Computer Science with interests in Information Technology, Cyber Security, and Computer Networking. Proficiency with Linux, TCP/IP networking, Windows domain environments, and Active Directory\n      "
    },
    {
        "position": "Perception Research Engineer Internship- Fusion",
        "company": "TuSimple ",
        "location": {
            "city": " West Lafayette",
            "state": "IN"
        },
        "posted": "2021-06-24T08:47:05.208Z",
        "url": "https://www.linkedin.com/jobs/view/perception-research-engineer-internship-fusion-at-tusimple-2619448784?refId=3jR7Wr8ounAxBMylhuVkDA%3D%3D&trackingId=hVyVWMQyVohZZY1IKtU2og%3D%3D&position=25&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        <em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><strong><u>Job Description<br><br></u></strong>The perception team develops cutting edge technologies to help our truck perceive the world. You will play an important role in creating novel algorithms for advanced perception and applying your algorithm on terabytes of data. You will also work closely with other talents in this field in building the next-generation of autonomous sensing algorithms.<br><br>Example projects that we are working on:<br><ul> <li>Temporal association of data from multiple sensors, including camera, LiDAR, RADAR and more</li> <li>Object tracking and state estimation in challenging real world scenarios</li> <li>Encoding perception uncertainty and collaborate with prediction team to make the system safe and robust</li> <br><br></ul><strong><u>Responsibilities<br></u></strong><ul> <li>Formulate, prototype and deploy robust and reliable solutions to cutting-edge perception problems, including sensor fusion, tracking, and state estimation.</li> <li>Investigate and develop computer vision algorithms and machine learning models for the perception system.</li> <li>Build benchmark with proper methodology and analyze large-scale data to characterize algorithms performance.</li> <li>Closely collaborate with other teams to conduct system design, integration and tests.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>M.S. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Hands-on experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Strong coding skills in C/C++ and Python</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Ph.D. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Extensive experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Publications in top-tier computer vision/machine learning conferences and/or journals.</li> <li>Knowledge and experience of GPU computation or CUDA acceleration.</li> <br></ul><strong>Perks<br></strong><ul> <li>Work with world class AI Engineers.</li> <li>Shape the landscape of autonomous driving.</li> <li>Daily breakfast, lunch, and dinner.</li> <li>Full Kitchen with unlimited snacks and fruits.</li> <br></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Intern with Security Clearance",
        "company": "ClearanceJobs ",
        "location": {
            "city": " Lorton",
            "state": "VA"
        },
        "posted": "2021-06-08T08:47:24.244Z",
        "url": "https://www.linkedin.com/jobs/view/intern-with-security-clearance-at-clearancejobs-2621520998?refId=9IBoi%2BbYmmQ7kt1TuFF9oQ%3D%3D&trackingId=gg3OaBHn5APpG%2BdsyBxAVQ%3D%3D&position=12&pageNum=27&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-08T08:29:43.691Z",
        "description": "\n        Description Who Are We? QinetiQ Inc. is a leading innovator with over 25 years of experience rapidly developing advanced C5ISR sensor solutions and is a renowned world leader in robotics and autonomy. The combined QinetiQ U.S. business unit brings capabilities across the full lifecycle of technology development from applied research and development to rapid prototyping, testing, fielding, and sustainment. Our expertise with unmanned platforms, broad sensing modalities, and cross-domain interoperability ensures that we deliver integrated solutions for Warfighter dominance in all phases of combat. We are a world-class team of professionals who deliver next generation technology and products in robotic and autonomous platforms and systems, ground systems, soldier systems, maritime systems, airborne sensors and payloads, processing and exploitation capabilities, and integrated C2 solutions. Much of our work contributes to innovative research in ﬁelds such as sensor science, signal processing, data fusion, artiﬁcial intelligence (AI), machine learning (ML), and augmented reality (AR). Our customers are always our number one priority and we consistently deliver Mission-Led Innovation to empower and protect our Defense and Security forces in the U.S. and abroad. Your Contribution to Our Mission: QinetiQ Inc. is offering summer internship opportunities to exceptional students from the following disciplines: Mechanical Engineering, Electrical Engineering, Computer Science/Engineering, Systems Engineering, Physics, and Math. Successful candidates will work alongside industry leaders in the development of advanced technology development in support of the military and warfighter effort.<li>Learn about how the business functions and how you may become a valuable asset to the company if you were to be brought on in a full-time employment capacity</li><li>Assist in the design and build of advanced technology systems</li><li>Participate in special projects as required<br><br>To Land This Job, You Need:</li><li>To be a current Bachelor's or Master's Degree student at an accredited US institution, preferably majoring in an engineering or technical field</li><li>Strong analytical and problem-solving skills</li><li>Excellent organizational skills Clearance Level Must Be Able to Obtain: DOD Secret Why QinetiQ Inc.?</li><li>Your work will contribute to the protection of American Warfighters and Security Forces.</li><li>Opportunity to work with cutting edge technology.</li><li>Extensive opportunities for continuous learning, professional growth and advancement.</li><li>We only hire the best! No matter if you are entry or senior level, you will have the opportunity learn from some of the best in the industry.</li><li>We have fun! We regularly have company events, from luncheons and costume contests to golf tournaments.</li><li>We care about YOU and YOUR FAMILY. We offer competitive benefits and health insurance options. No One Has Time for Long Job Applications! We completely understand. That is why we have made the application process easy. We promise. This will be simple. Accessibility/Accommodation: If because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please send an e-mail to or call (540) 658-2720 Opt 4 and let us know the nature of your request and your contact information. QinetiQ Inc. is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</li>\n      "
    }
]