[
    {
        "position": "Software Development Intern",
        "company": "Bio-Rad Laboratories ",
        "location": {
            "city": " Ann Arbor",
            "state": "MI"
        },
        "posted": "2021-07-01T18:46:14.303Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-intern-at-bio-rad-laboratories-2618734333?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=6uYtj2OeSI9WxwXYN4%2FJdA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        We are seeking a motivated student who has a strong interest in the design, manufacturing, and sustaining of complex systems in the field of life science. Are you passionate about being part of a team that develops products to help make a difference in the world? Bio-Rad is looking for a Software Development intern who gets excited about product development, prototype testing and analysis, and systems integration!<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Use best software development practices to design and develop reliable and maintainable software for embedded systems used in commercial products and in-house diagnostic tools.</li> <li>Create tools, utilities, and scripts to aid development team(s).</li> <li>Implement embedded software solutions and algorithms to enable electromechanical system operations including graphical user interfaces, feedback control, and hardware and software interface communications.</li> <li>Develop and execute unit, integration, and system testing, investigate and resolve issues, and perform debugging.</li> <li>Collaborate on designs and participate in cross-functional teams to support product development and troubleshooting.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Currently enrolled as an undergraduate student pursuing a degree in Computer Science or related discipline (recent graduates will also be considered).</li> <li>Must have a 3.0 cumulative overall GPA or better (on a 4.0 scale).</li> <li>Strong coding skills in Python and C++.</li> <li>Experience with real-time operating systems and an understanding of real-time issues.</li> <li>Problem solving, organizational, and communication skills are required.</li> <li>Able to work for a minimum of 10 consecutive weeks.</li> <li>Strong initiative and ability to work independently and in teams.</li> <li>Inspire collaboration, be a curious question asker, driven and self-motivated.</li> <br><br></ul><strong><u>About Bio-Rad<br><br></u></strong>Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 8,000 employees and a global network of operations serving our customers, we help people live longer, healthier lives.<br><br>Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.<br><br>EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age<br><br><strong><u>Agency Non-Solicitation<br><br></u></strong>Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\n      "
    },
    {
        "position": "Software Developer Intern",
        "company": "Security Benefit ",
        "location": {
            "city": " Topeka",
            "state": "KS"
        },
        "posted": "2021-07-01T18:46:16.357Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-security-benefit-2628446617?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=U3K9f7RbyWotspJ%2BnEdS0A%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Security Benefit a Kansas based company is seeking an experienced Software Developer Intern to join the Investment Department. SB fosters strong partnerships to provide insightful and customized retirement solutions for employers and individual investors nationwide. As an industry leader in service technology, our affiliates offer business processing and broker/dealer solutions tailored to the financial services. Headquartered in Topeka, KS, we are a fast-paced business that has experienced significant growth in the past few years, and we expect to continue on a steady growth trajectory.<br><br><strong><u>Responsibilities<br><br></u></strong>The Derivatives Technology Team is seeking an intern experienced in coding and debugging with an exposure to software design principles. We are currently looking for candidates to participate in an intern-to-hire track.<br><br><strong><u>Other Responsibilities Include<br><br></u></strong>The intern will work with the Derivatives Technology Team and assist in the design, development, testing, deployment, and integration of software applications. The intern will work under a senior developer to assist in the completion of various technology initiatives.<br><ul> <li>Work with a team to address system issues</li> <li>Utilize issue tracking systems to identify and document technology issues and improvements</li> <li>Support the other developer through researching, developing, and testing software</li> <li>Collaborate with other team members on projects</li> <li>Other projects and tasks as needed</li> <br><br></ul><strong><u>In Addition To Valuable Experience Working In FinTech, The Intern Can Expect To Be Exposed To The Few Of The Following Technologies<br></u></strong><ul> <li>Business IT Systems Architecture and Web 2.0 Application Design</li> <li>Computer programing languages: C#, Python</li> <li>Scripting languages: HTML, CSS, JavaScript, TypeScript, T SQL</li> <li>Databases: Microsoft SQL Server, MongoDB</li> <li>Frameworks: .Net, .Net Core, ASP.NET, Angular, ASP.NET Core, AngularJS</li> <li>Technologies: Git, GitLab, JupyterNotebook, JupyterLab, Amazon Web Services</li> <li>Tools: Visual Studio, Visual Studio Code, Microsoft SQL Server Management Studio (SSMS)</li> <br></ul><strong>Eligibility<br><br></strong>Students eligible for the internship will be current, fulltime students available to work approximately 19 hours a week, beginning immediately. Student will be expected to work during and in between semesters and up to full-time during the summer. This is not a summer only internship.<br>Currently pursuing a degree in computer science, mathematics, or finance<br><ul> <li>Familiarity with code design principals such as Object Orientated Programming</li> <li>Familiarity with web application operation and design</li> <li>Familiarity with data structures, data bases, computer systems design and operation</li> <li>Strong written and verbal communication skills</li> <li>Strong skills in analysis and problem solving</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Experience with web technologies such as Angular or AngularJS</li> <li>Experience with object orientated programming languages such as C# or C/C++</li> <li>Experience with querying data from a database</li> <li>Hands on experience with Visual Studio and Visual Studio Code</li> <li>An interest in computer science, finance, investments, and mathematics</li> <br></ul>Consider joining our progressive team in our nationally recognized company. Apply online at www.securitybenefit.com/careers and submit your resume. EOE\n      "
    },
    {
        "position": "Computer Vision Intern",
        "company": "Veo ",
        "location": {
            "city": " Illinois",
            "state": "United States"
        },
        "posted": "2021-06-30T18:46:18.395Z",
        "url": "https://www.linkedin.com/jobs/view/computer-vision-intern-at-veo-2626066749?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=pHfcukYfCmwJDWkDc%2FEbXQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Company OverviewAt Veo, we're bringing the next generation of mobility sharing to cities and universities globally through our dockless e-vehicle system.<br><br>We also offer fat-tire bikes, cargo bikes and ADA-compliant bikes – making us the only shared mobility provider with this breadth of options. We design and engineer our own vehicles, hardware and software systems to provide a greener, healthier mode of transportation to make the communities we serve more sustainable and livable. Our mission is to offer the best combination of multi-modal sharing technology and seamless customer service, so users can unlock joy in their day. We are looking for exceptionally talented individuals who are ready to take on exciting challenges and their own solutions. We are headquartered in Chicago, IL, but we are hiring across the U.S. Join us!Job SummaryDo you want to apply AI to a real product? Do you want to practice your skill sets in a production application to customers around the nation? Are you willing to build a bridge between software and hardware and apply cutting-edge techniques to serve the users? Are you excited about solving some of the most challenging problems in transportation and urban planning? If so, you might be Veo’s Computer Vision engineer Intern! *This role can be done as a co-op or internship. Hiring will be done a rolling basis.ResponsibilitiesResearch and develop prototype using deep learning algorithms with a special focus on the perception modules and object detectionOptimize our current modelsHelp engineering team integrate it into the production applicationTroubleshoot and debug modelQualifications and SkillsMS or Ph.D degree in Computer Science or equivalentSolid understanding of Deep Learning, Mathematics and StatisticsExperienced in Tensorflow or equivalentLogical thinker and effective communicator with a clean and efficient coding stylePassionate about making the world a better place to live and ridePublished papers are a strong bonusBenefits and PerksCompetitive compensationOpportunity to work in a fast-paced, hyper-growth technology companyVeo creditsA commitment to professional development and mentorshipPowered by JazzHR\n      "
    },
    {
        "position": "Internship, IT (remote)",
        "company": "Minim ",
        "location": {
            "city": " Hampton",
            "state": "NH"
        },
        "posted": "2021-06-30T18:46:20.265Z",
        "url": "https://www.linkedin.com/jobs/view/internship-it-remote-at-minim-2626205927?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=dyXkEiQ4gHNZN4vbkyGT9w%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Minim® (OTCQB: MINM) is the creator of innovative internet access products that make everyone’s connected home easier to use for life and work. Headquartered near Boston (Manchester, NH), the company delivers smart software-driven communications products under the globally recognized Motorola® brand. We value the talents, passion and creativity of all candidates and employees to help us build and grow a stronger, more creative and resilient company. We are currently seeking an Intern with solid IT and customer service skills who is interested in providing top notch customer support to our clients. The position is fully remote and requires someone who is energetic, willing to learn and wants to be involved in a fast paced and exciting environment. This internship is perfect for a college student to get their foot in the door of a progressive company with whom they can learn and grow and possibly land a full-time job upon graduation.<br><br>What you will learn:How to ensure customers receive adequate level of support, and to provide technical issue resolution via E-Mail, phone, remote and other electronic medium. How to provide internal company IT support for hardware, software, networks when needed. How to onboard for new employees. How to handle general IT support tasks in the Microsoft office 365 environment How to administrate Microsoft office, Jira/Confluence and Slack and many other SaaS services;How to develop strong organizational skills with ability to handle multiple tasks concurrently and prioritize appropriately. How to provide superior customer service skills, including timely response to user's inquiries and/or complaints. How to manage SSO for an enterprise Qualifications and Skills An undergraduate enrolled in a BS degree program with a major in IT/computer science or related with a GPA of 3.0 or better.<br><br>Things that will make you stand outKnowledge of Microsoft O365 or Google SuiteBack ground in customer support Minim values the talents, passion and creativity of all candidates and employees to help us build and grow a stronger, more creative and resilient company. Minim provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.Powered by JazzHR\n      "
    },
    {
        "position": "Computer Science Internship (3 months)",
        "company": "RediMinds, Inc ",
        "location": {
            "city": " Southfield",
            "state": "MI"
        },
        "posted": "2021-06-10T18:46:28.468Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-internship-3-months-at-rediminds-inc-2585206837?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=sUL%2BUNElCjbcNSOia14ApA%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        We are looking for an intern to join the RediMinds Research Team.<br><br>If you are passionate about AI and want to join a mission driven group working to make surgery safer and more effective, please apply! Our team is developing a cutting-edge surgical augmented reality tool which will provide real-time guidance to surgeons performing minimally invasive kidney surgeries.<br><br>Our team has implemented a number of computer vision models (specifically instance segmentation models) to segment various landmarks of interest in specific surgeries. In this role, you will work with our team to develop models which will learn from temporal changes in the surgical video. This will introduce you to cutting edge Computer Vision techniques being applied in medical image analysis. You will also coordinate the image annotation process with physicians and curate data sets.<br><br>We believe in providing support and mentorship to interns. You will be paired with multiple mentors who will guide your research and make sure you are part of the team. We will also provide housing and a stipend during your three-month internship.\n      "
    },
    {
        "position": "Computer Vision Intern",
        "company": "Black Sesame Technologies Inc ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-07-01T18:46:35.021Z",
        "url": "https://www.linkedin.com/jobs/view/computer-vision-intern-at-black-sesame-technologies-inc-2624435831?refId=dL2JnPybGBbfJo789eOa6Q%3D%3D&trackingId=b2KMvGxFktkXkmhPEw26qw%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Responsibilities<br></u></strong><ul><li>Develop novel computer vision and image processing algorithms</li><li>Work on algorithm deployment on target platforms<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Pursuing a PhD or master?s degree in computer science, electrical engineering, or related field</li><li>Solid understanding of camera fundamentals and cutting-edge computer vision and deep learning approaches</li><li>Experience in applying computer vision, image and video processing, and/or deep learning algorithms</li><li>Solid programming skills with Python and C/C++</li><li>Familiarity with deep learning frameworks such as TensorFlow and PyTorch</li><li>Excellent independent working and communication skills<br></li></ul>Job Types: Full-time, Internship<br><br><strong><u>Schedule<br></u></strong><ul><li>Monday to Friday<br></li></ul>Work Location:<br><ul><li>One location<br><br></li></ul><strong><u>Work Remotely<br></u></strong><ul><li>Temporarily due to COVID-19</li></ul>\n      "
    },
    {
        "position": "Software Developer Intern",
        "company": "NV5 ",
        "location": {
            "city": " Akron",
            "state": "OH"
        },
        "posted": "2021-06-01T18:47:40.678Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-nv5-2606721133?refId=7SRCXEv5mwI1hlyRmfb0NQ%3D%3D&trackingId=SfTLL7fPEd%2FfhV%2BJYQXTng%3D%3D&position=15&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        NV5 (NASDAQ NVEE) is a provider of engineering and consulting services to public and private sector clients, delivering solutions through six business verticals Testing, Inspection &amp; Consulting; Infrastructure; Utility Services; Environmental Health Sciences; Buildings &amp; Program Management; and Geospatial Technology. With offices nationwide and abroad, NV5 helps clients plan, design, build, test, certify, and operate projects that improve the communities where we live and work.<br><br>As engineers, architects, construction/program managers, environmental professionals and beyond, we play a significant role in shaping our communities through the services we provide. We are looking for passionate, driven individuals to join our team focused on <em>Delivering Solutions and Improving Lives</em>.<br><br><strong>Job Summary<br><br></strong>The Software Developer Intern will contribute to the company by working closely with internal employees to improve, extend, and debug existing internal applications. The intern will work directly with the IT Manager to learn about the software development lifecycle, from coding to testing to deployment.<br><ul><li>Develop and debug internal applications in C#, VB.NET, and SQL.</li><li>Provide end-user support for internal applications.</li><li>Ideally a junior or senior pursuing a bachelor’s degree in Computer Science, Information Systems, or a related field.</li><li>Some experience with C#, VB.NET, and SQL Server.</li><li>Some experience working in Visual Studio 2019.</li><li>Exposure to AWS and Microsoft Azure a plus.<br></li></ul>NV5 offers a competitive compensation and benefits package including medical, dental, life insurance, PTO, 401(k) and professional development/advancement opportunities.<br><br><em>NV5 provides equal employment opportunities (EEO) to all applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, creed, citizenship status, ancestry, pregnancy, childbirth or related medical conditions, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. NV5 complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.</em>\n      "
    },
    {
        "position": "IT Applications Intern",
        "company": "Jockey International, Inc. ",
        "location": {
            "city": " Wisconsin",
            "state": "United States"
        },
        "posted": "2021-06-17T18:48:11.026Z",
        "url": "https://www.linkedin.com/jobs/view/it-applications-intern-at-jockey-international-inc-2604798226?refId=g8eqo6HjPdN%2FXzcxelk%2Fyg%3D%3D&trackingId=U2bdOLc86OreruR4pzk0xw%3D%3D&position=10&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        In this role, you’ll work with our IT and Business team members to manage and support a variety of solutions. Based at our headquarters in <strong>Kenosha, WI </strong>(near <strong>Milwaukee, WI</strong> and <strong>Chicago, IL</strong>), you’ll have the opportunity to work on multiple business applications - including maintenance and providing internal technical support to our business users, while collaborating with other IT members. If you have a passion for IT business development, along with a zest to gain pertinent business experience, this position is for you!<br><br><strong>JOCKEY</strong> is a premier local employer, offering the following employee perks:<br><ul><li> Attractive salary!</li><li>Flexible work schedule to accommodate class schedules!</li><li>Onsite, professional training in the Computer/IT fields! <br></li></ul><strong><u>In This Role, You Will<br></u></strong><ul><li> Work with team members to deliver support to the end user.</li><li>Assess and trouble-shoot IT issues.</li><li>Assist in the maintenance of existing solutions to support business needs.</li><li>Support assigned systems as necessary.</li><li>Create and maintain documentation for support continuity.</li><li>Perform tasks in cataloging, maintaining, converting, and scheduling reports.<br></li></ul><strong><u>Candidate Requirements<br></u></strong><ul><li> Currently pursuing a Bachelor’s degree in Computer Science, or equivalent (current junior or senior preferred).</li><li>General knowledge of database terminology and functions preferred.</li><li>Understanding of software development lifecycle preferred.</li><li>Basic knowledge of networking and hardware concepts; exposure to MS Windows Server.</li><li>Basic knowledge of standard MS-Office software.</li><li>Strong communications and critical-thinking skills.</li><li>Solid understanding of current technology and trends.</li><li>Eagerness to learn new technologies.</li><li>Ability to work 20-30 hours per week during Summer 2021, and 15-20 hours per week during the school semesters (work schedule is flexible to accommodate class schedules).<br></li></ul>In return for your expertise, <strong>JOCKEY</strong> offers fitness club discounts, onsite health &amp; wellness programs, generous employee discounts, a business casual work environment, learning opportunities, and opportunities for advancement.<br><br>Follow us on Linkedin! To find out more about our history and what it's like working at <strong>JOCKEY</strong>, visit us on Pinterest http://www.pinterest.com/Jockey_Careers/.<br><br>Jockey International, Inc., and its subsidiaries, provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. We are committed to providing reasonable accommodations for qualified individuals with disabilities in our job application procedures. If you need assistance or an accommodation due to a disability, you may email us at human_resource@jockey.com or call us at 262-658-8111.\n      "
    },
    {
        "position": "IT Developer Intern - Noke",
        "company": "Janus International ",
        "location": {
            "city": " Lehi",
            "state": "UT"
        },
        "posted": "2021-06-01T18:48:25.341Z",
        "url": "https://www.linkedin.com/jobs/view/it-developer-intern-noke-at-janus-international-2606719389?refId=g8eqo6HjPdN%2FXzcxelk%2Fyg%3D%3D&trackingId=ieBrdaLyRqZWWRSFWzRI9g%3D%3D&position=19&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Work closely with the Noke team to develop the front end, backend or mobile application.<br><br><strong>Front End Developer Intern<br></strong><ul><li>Assist in developing and maintaining the front-end experience.</li><li>Ensure high-performance and availability and assist with technical aspects of the front end.</li><li>Assist in formulating an effective, responsive design.</li><li>Collaborate with team to deliver compelling user-facing products.</li><li>Work closely with the backend team to implement new features.</li><li>Provide accountability and ownership for all task assignments.</li><li>Adhere to development schedules and best practices.</li><li>Other duties as requested.<br></li></ul><strong>Mobile Application Developer Intern<br></strong><ul><li>Build and maintain high-performance, scalable consumer native mobile applications for iOS and Android. </li><li>Work with the bluetooth stack of all major phone providers.</li><li>Partner with designers and user experience specialists to create consumer-first user experiences.</li><li>Bridge the gap between elegant front-end design and existing enterprise backend architectures.</li><li>Reproduce defects to effectively test and fix solutions.</li><li>Create clean, maintainable, and tested code with supporting documentation.</li><li>Provide accountability and ownership for all task assignments.</li><li>Identify internal/outside technologies and when/how to use them.</li><li>Test and profile code written by yourself and others.</li><li>Other duties as requested.<br></li></ul><strong>Backend Developer Intern<br></strong><ul><li>Build high-quality, robust features for Nokē products.</li><li>Own development for features of medium to large complexity.</li><li>Contribute to product design and requirements discussions.</li><li>Work independently and own multiple features.</li><li>Design &amp; implement features, APIs, test suites or technology according to specifications, while keeping a strong customer focus.</li><li>Transform requirements into architectural and feature specs.</li><li>Coordinating with other internal and external teams to help ensure proper workflows throughout the entire app experience.</li><li>Provide accountability and ownership for all task assignments.</li><li>Identify internal/outside technologies and when/how to use them.</li><li>Test and profile code written by yourself and others.</li><li>Provide status and feedback to management.</li><li>Other duties as requested.</li><li>Pursuing degree in Computer Science or comparable work experience</li><li>Solid understanding of databases, servers and APIs, and at least one major native mobile programming language (Swift, JAVA, Objective C, or Kotlin)</li><li>Excellent written and verbal communication skills.</li><li>Previous experience building &amp; publishing iOS and Android apps. Comfortable with latest dev platforms.</li><li>Working experience in front-end technologies, including HTML5, CSS3, JavaScript; building user interfaces for websites and/or web applications; designing and developing responsive websites.</li><li>Proficient understanding and experience with consuming and interacting with RESTful API's.</li><li>React or similar frontend framework experience (Angular, Ember, backbone etc).</li><li>Ability to understand CSS changes &amp; their ramifications to ensure consistent style across platforms and browsers.</li><li>Understanding of the entire web development process, including design, development, and deployment.</li><li>Proficient understanding of Git or other similar repository technology.<br></li></ul><strong>Physical Demands<br></strong><ul><li>Regularly required to sit, stand, and walk.</li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the position.</li></ul>\n      "
    },
    {
        "position": "Software Engineering Intern",
        "company": "Watch Systems LLC ",
        "location": {
            "city": " Covington",
            "state": "LA"
        },
        "posted": "2021-06-01T18:48:31.909Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-watch-systems-llc-2604552587?refId=g8eqo6HjPdN%2FXzcxelk%2Fyg%3D%3D&trackingId=XybjqupdF9G7H10Jdhq08Q%3D%3D&position=23&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Watch Systems is looking for an organized, highly motivated intern to help us test and roll out brand new products.<br><br>We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.<br><br><strong><u>Responsibilities<br><br></u></strong>Document and test new software applications<br>Assess new application ideas<br>Research competitor offerings<br>Develop applications (coding, programming)<br>Software quality assurance<br>Hardware / software troubleshooting<br>Interview beta testers, product owners<br><br><strong><u>Requirements<br><br></u></strong>Pass a background check and drug screening<br>Computer Science/Network Engineering, Engineering, or Mathematics major<br>Excellent analytical, troubleshooting, documenting and software development skills<br>Ability to work in teams<br>Solid understanding of the .NET Framework and ASP.NET development, web development skills using ASP.NET (C#), SQL Server, JavaScript/JQuery etc, MVC Frameworks<br>PHP, React development experience a plus<br>Minimum schedule of 20 hours/week with a minimum of 6 month contract<br><br><strong><u>Benefits<br><br></u></strong>Practical experience with a wide variety of software engineering tasks<br>Collaborating hand-in-hand with skilled teams of software engineers<br>Shadowing, mentoring, and training opportunities with seasoned professionals<br>Opportunity to participate in networking events and company meetings<br>Flexible schedule for students<br>Compensation available\n      "
    },
    {
        "position": "Full-Stack Development Intern",
        "company": "Axtria - Ingenious Insights ",
        "location": {
            "city": " Berkeley Heights",
            "state": "NJ"
        },
        "posted": "2021-06-29T18:48:55.899Z",
        "url": "https://www.linkedin.com/jobs/view/full-stack-development-intern-at-axtria-ingenious-insights-2624958313?refId=4RvrhsEu4pcLqnZ7lFpvoQ%3D%3D&trackingId=y0I9yPX3sKKGO4pZ%2BhpZpA%3D%3D&position=14&pageNum=4&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Introduction<br><br></u></strong>Axtria is a global provider of cloud software and data analytics to the Life Sciences industry. We help Life Sciences companies transform the product commercialization journey to drive sales growth and improve healthcare outcomes for patients. Our work impacts millions of patients and results in improved health outcomes.<br><br>Since our founding in 2010, technology innovation has been our winning differentiation, and we continue to leapfrog competition with platforms that deploy Artificial Intelligence and Machine Learning. Our cloud-based platforms Axtria DataMax™, Axtria InsightsMax™, Axtria SalesIQ™, and Axtria MarketingIQ™ enable customers to efficiently manage data, leverage data science to deliver insights and bring insights to the point of decision. Clients use our platforms and services to manage end-to-end commercial operations and drive improved patient health outcomes.<br><br>With customers in over 75 countries, Axtria is one of the largest global commercial solutions providers in the Life Sciences industry. We continue to win industry recognition for growth and are featured in some of the most aspirational lists - INC 5000, Deloitte FAST 500, NJBiz FAST 50, SmartCEO Future 50, Red Herring 100, and several other growth and technology awards.<br><br>Axtria is looking for exceptional talent to join our rapidly growing global team. People are our biggest asset! Our transparent and collaborative culture offers a chance to work with some of the brightest minds in the industry. Axtria Institute, our in-house university, offers the best training in the industry and an opportunity to learn in a structured environment. A customized career progression plan ensures every associate is setup for success and able to do meaningful work in a fun environment. We want our legacy to be the leaders we produce for the industry. Will you be next?<br><br><strong><u>Job Description<br><br></u></strong>We are looking for an intern who is excited about software development. Axtria’s DataMAx application is a modern data warehouse platform designed specifically for the pharmaceutical industry. The primary focus will be to write code for user interfaces, APIs, and asynchronous back-end processes. You will be working with a team of experienced software engineers and learning the latest cloud technology. The candidate will demonstrate inquisitiveness, technical aptitude, and good communication skills. Take advantage of this wonderful opportunity to show what you can do in an agile software development environment.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Develop new features and user interfaces from wireframe models using Angular and Python</li><li> Implement changes to data model and build data access code to integrate with APIs</li><li> Diagnose and fix minor bugs by writing clean, readable, and testable code</li><li> Write automated unit tests to provide adequate code coverage</li><li> Attend daily stand-up calls to review progress and identify blockers</li><li> Participate in requirements review sessions and design sessions with senior developers and development leads</li><li> Potentially participate in proof-of-concept and technology spikes for the purpose of evaluating new technologies<br></li></ul><strong><u>About You<br></u></strong><ul><li> A strong desire to enter the field of software engineering</li><li> Some experience with full-stack development (including any experience with Javascript, Angular, Python, and SQL)</li><li> Qualification– Rising Seniors pursuing BA/BS degree in Computer Science or related technical field</li><li> Available to start as soon as possible.</li><li> Able to dedicate up to 20 hours a week during the internship period</li><li> US Citizens or Students with OPT visa only accepted. We are not able to sponsor visas for interns at this time</li></ul>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Cohu, Inc. ",
        "location": {
            "city": " Poway",
            "state": "CA"
        },
        "posted": "2021-06-01T18:49:16.456Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-cohu-inc-2603279030?refId=FRh1%2Fc7TY3qRW0k%2B4Zvb4w%3D%3D&trackingId=wGPzt5HgO9UYXJ8NyGVDWQ%3D%3D&position=4&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        This intern will work as a member of a software development team designing, developing and unit testing company applications. The intern will also work independently to identify and solve problems in existing software; this includes debugging as well as developing solutions. Performs other duties as required.<br><br><strong><u>Knowledge, Skills And Abilities<br></u></strong><ul> <li> BS or MS in Computer Science or Software Engineering student with degree in process required </li> <li> Experience writing C/C++ code </li> <li> Familiarity with Visual Studio a plus </li> <li> Experience with the Win32 API </li> <li> Knowledge of data structures and algorithms </li> <li> Experience in working within a team environment </li> <li> Able to meet deadlines and achieve and maintain expected productivity levels </li> <li> Strong problem solving and analytical skills </li> <li> Able to follow procedures </li> <li> Communicates effectively both verbally and in writing </li> <li> Understands own strengths and weaknesses and is willing to learn quickly </li> <li> Excellent attendance record, strong accountability and integrity </li> <li> Familiarity with database programming concepts helpful</li></ul>\n      "
    },
    {
        "position": "General Software Engineer Intern",
        "company": "WeRide.ai ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-06-01T18:49:37.653Z",
        "url": "https://www.linkedin.com/jobs/view/general-software-engineer-intern-at-weride-ai-2605306905?refId=FRh1%2Fc7TY3qRW0k%2B4Zvb4w%3D%3D&trackingId=HTNQ92YeUcfhW1SUayHJlA%3D%3D&position=17&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        WeRide is a smart mobility start-up whose mission is to transform mobility with autonomous driving. We are committed to build better transportation experience that’s safe, efficient, affordable and joyful. We have an elite team of entrepreneurs and technologists who share the same passion and pursue continuous excellence in their work.<br><br><strong> In Our Internship Program, You Will <br><br></strong>Join one of our teams, such as Perception, Planning and Control, Mapping and Localization, Infrastructure<br><br>Be expected to be an equal contributor on teams of world-class engineers to develop and implement software for our next version of autonomous driving solution<br><br>Learn various technical skills through different projects<br><br>Experience in 1-on-1 mentorship and training<br><br><strong> Requirements <br></strong><ul><li>MS/PhD degree in Robotics, Computer Science or other related majors.</li><li>Has related research experience, or internship </li><li>Strong coding skill in C++ or python</li><li>Graduating in Dec 2020 or May 2021</li></ul>WeRide.ai offers competitive salary depending on the experience. Employee benefits include:<br><br>Premium Medical, Dental and Vision Plan (No cost from employees or their families)<br><br>Free Daily Breakfast, Lunch and Dinner<br><br>Paid vacations and holidays<br><br>401K plan\n      "
    },
    {
        "position": "Software Engineering Intern",
        "company": "General Dynamics Mission Systems ",
        "location": {
            "city": " Dedham",
            "state": "MA"
        },
        "posted": "2021-06-17T18:49:39.600Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-general-dynamics-mission-systems-2592686603?refId=FRh1%2Fc7TY3qRW0k%2B4Zvb4w%3D%3D&trackingId=1qyJ%2BP8ro%2BN82K6gm5GyHQ%3D%3D&position=18&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <p>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation.&nbsp; With a global team of 13,000 top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas.&nbsp; Given the nature of our work and who we are, we value trust, honesty, alignment and transparency.&nbsp; We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose.&nbsp; If who we are and what we do resonates with you, we invite you to join our high performance&nbsp;team!<br><br></p><p><br>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran.<br><br></p><p>&nbsp;<br><br></p><p>Currently pursuing a Bachelor's degree in Computer Science, Computer, Software Engineering, or a related field with a&nbsp;<span>preference for a standing of a junior or higher.&nbsp;<br><br></span></p><p>&nbsp;<br><br></p><p>Due to the nature of work performed within our facilities, U.S. citizenship is required.<br><br></p><p>&nbsp;<br><br></p><p>General Dynamics Mission Systems is searching for a&nbsp;<span>Software Engineering Intern.</span>&nbsp;You will be an individual technical contributor on a team of engineers that are highly trained and experienced in all areas of technology. You’ll participate in the implementation and test of software for secure&nbsp;systems,&nbsp;for&nbsp;enhancements, and new product development.<br><br></p><p>&nbsp;<br><br></p><p>You will&nbsp;apply principles and techniques of computer science, engineering, and mathematical analysis. Our engineering environment applies the highest standards, the most efficient processes and procedures, and cutting-edge tools throughout the development life cycle to bring the best products to our customers.<br><br></p>\n      "
    },
    {
        "position": "Fall 2021: Software Engineering Intern, Train Engine",
        "company": "Motional ",
        "location": {
            "city": " Santa Monica",
            "state": "CA"
        },
        "posted": "2021-06-01T18:51:05.538Z",
        "url": "https://www.linkedin.com/jobs/view/fall-2021-software-engineering-intern-train-engine-at-motional-2608454168?refId=b9929oPuNpRKTBxLFJKi4w%3D%3D&trackingId=Ga4LHGnsW7mjNwCOe%2FlKqQ%3D%3D&position=2&pageNum=8&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <em>The Motional Santa Monica office is located in the heart of 3rd Street Promenade in Santa Monica at 312 Arizona Avenue. With all the modern amenities for productive work and play, it is steps away from the popular pedestrian outdoor shopping area and Santa Monica beach.<br><br></em>The Machine Learning department is led by Oscar Beijbom https://www.linkedin.com/in/oscar-beijbom-696aa6/. Our Machine Learning team is behind some great such as: nuScenes (https://www.nuscenes.org), PointPillars (https://arxiv.org/abs/1812.05784), and PointPainting (http://arxiv.org/abs/1911.10150). The ML Team is doubling in size in 2021, and we are adding engineers and researchers to join us in our mission to launch a level 5 autonomous taxi system.<br><br><strong><u>What You'll Be Doing<br></u></strong><ul> <li>Help build and improve our training platform.</li> <li>Optimize ML training speed by identifying &amp; addressing bottlenecks.</li> <li>Optimize ML model inference runtime/workflow for large scale of inference jobs.</li> <br><br></ul><strong><u>What We're Looking For<br></u></strong><ul> <li>BS or MS in Computer Science </li> <br><br></ul><strong>Motional is making driverless vehicles a safe, reliable, and accessible reality.<br><br></strong>Our team is commercializing a world-class driverless system. The Motional team is behind some of the industry's largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world's first robotaxi pilot, and operation of the world's most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group and Aptiv, Motional is fundamentally changing how people move through their lives.<br><br>Headquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on Twitter, LinkedIn, Facebook, Instagram and YouTube.<br><br><em>Motional AD Inc. is an EOE. We celebrate diversity and are committed to creating an inclusive environment for all employees. To comply with Federal Law, we participate in E-Verify. All newly-hired employees are queried through this electronic system established by the DHS and the SSA to verify their identity and employment eligibility.</em>\n      "
    },
    {
        "position": "Intern – IT Application Development",
        "company": "MCPHS University ",
        "location": {
            "city": " Boston",
            "state": "MA"
        },
        "posted": "2021-05-02T18:51:38.539Z",
        "url": "https://www.linkedin.com/jobs/view/intern-%E2%80%93-it-application-development-at-mcphs-university-2539343562?refId=b9929oPuNpRKTBxLFJKi4w%3D%3D&trackingId=w6BM%2F7J0YSGUV2yLHsSQSA%3D%3D&position=23&pageNum=8&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        The Intern - IT Application Development will assist in the design, development, implementation and support of mission-critical enterprise solutions and reports. It is anticipated that the duration of the internship will be six months.<br><ul><li>Assists Executive Director in the creation and maintenance of enterprise architecture documentation</li><li>Assists development staff in the creation and maintenance of technical specifications</li><li>Assists in development of test transactions and runs tests to find errors and confirm systems meet specifications. Consults with users to prototype, refine, test, and debug systems to meet needs.</li><li>Provides technical assistance by responding to inquiries regarding errors, problems, or questions about systems. Trains end users or technical support staff to use systems</li><li>Provides reporting software training to reporting specialists in administrative departments, as well as to IT staff</li><li>Supports workflow for daily updates and overall general maintenance of the University's official website, Intranet, student portal, alumni site, and future sites</li><li>Develops new web pages, forms and site functions, maintaining content accuracy, presentation, navigability<br></li></ul><strong>Required<br></strong><ul><li>Course of study in four-year university toward Computer Science degree preferred</li><li>Familiarity with object-oriented information architecture/design and user experience best practices</li><li>Database application development experience using SQL</li><li>Proficiency with web-related technologies such as HTML, CSS, JavaScript/jQuery, ASP.NET, C#, XML</li><li>Valid driver’s license</li><li>Strong interpersonal, negotiation, influence and relationship management skills that enable collaborative working relationships to be developed with other departments</li><li>Ability to manage multiple assignments of varying complexity on concurrent timelines within deadlines and constraints</li><li>Highly motivated, organized, able to multi-task and work under tight deadlines</li><li>Excellent verbal and written skills are required</li><li>Demonstrated commitment to valuing diversity and contributing to an inclusive working and learning environment<br></li></ul>Come join us and be a part of a diverse community that is at the forefront of advancing the healthcare landscape! To learn more about working at MCPHS University, please click here.<br><br><strong>Apply<br><br></strong>Please attach a cover letter and a resume. Finalist candidate(s) for this position will be subject to a pre-employment background check as a condition of employment.<br><br><strong>MCPHS University </strong>is an equal opportunity employer that celebrates a diverse community. We seek to recruit, develop and retain the most talented people from a diverse candidate pool. All qualified applicants will receive consideration for employment without regard to any characteristic protected by law.<br><br>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled\n      "
    },
    {
        "position": "Core Developer Intern",
        "company": "Point72 ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-01T18:51:43.585Z",
        "url": "https://www.linkedin.com/jobs/view/core-developer-intern-at-point72-2617791415?refId=ojY172FM8JXdqgC1Vrq%2FEg%3D%3D&trackingId=OQWY3AJ94MED7oLluFJ5Pg%3D%3D&position=1&pageNum=9&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>About Cubist<br><br></u></strong>Cubist Systematic Strategies is one of the world’s premier investment firms. The firm deploys systematic, computer-driven trading strategies across multiple liquid asset classes, including equities, futures and foreign exchange. The core of our effort is rigorous research into a wide range of market anomalies, fueled by our unparalleled access to a wide range of publicly available data sources.<br><br><strong><u>Job Description<br><br></u></strong>A portfolio management team focused on systematic options trading is seeking a highly talented intern to assist in the development, optimization, and monitoring of our production trading platform and research infrastructure. We are a small, highly collaborative team. From day one you will learn about, and contribute to, our entire investment process.<br><br>Desirable Candidates<br><ul><li>Undergraduate or graduate candidates in computer science or engineering</li><li>Significant experience in Python, C++, C, or Java</li><li>Serious interest in systems programming (e.g. Linux kernel development, compilers, embedded systems, networking, file systems, debuggers)</li><li>In-depth understanding of how userland programs run on Linux and interact with the kernel</li><li>Some basic knowledge of Git, databases (e.g. MySQL), and web development frameworks is a plus</li><li>Clear, concise, and proactive communicator</li><li>Detail-oriented</li><li>Willing to take ownership of his/her work, working both independently and within a small team<br></li></ul>We’re looking for exceptional colleagues with unparalleled passion. If you’d like your resume to stand out, tell us about your exceptional personal achievements, even if they have nothing to do with finance. Of course we love to hear more about specific engineering or data projects that you’ve worked outside of school, or as part of your curriculum. If you’re proud of the work you did we want to hear about it. In addition to exceptional statisticians and engineers, we work with talented musicians, writers, mathematicians, and founders of non-profits; we’d love to learn more about what excites you.<br><br>Point72 is an Equal Opportunity Employer. Point72 is committed to the principles of equal employment opportunity for all employees and applicants for employment. Point72 complies with applicable, local, state and federal laws on the subject of equal employment opportunity.\n      "
    },
    {
        "position": "J2EE Developer Intern",
        "company": "Core Software Technologies Inc ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-06-17T18:52:04.192Z",
        "url": "https://www.linkedin.com/jobs/view/j2ee-developer-intern-at-core-software-technologies-inc-2598475064?refId=ojY172FM8JXdqgC1Vrq%2FEg%3D%3D&trackingId=FOUSJsx9JlpoJPs3A6tHSw%3D%3D&position=14&pageNum=9&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        We are hiring junior J2EE / Java Backend Developers for various contract / full-time requirements.<br><br>We train and place candidates at various clients. We have a good vendor network.<br><br><strong>Job Summary<br><br></strong>Looking for a Jr.Java developer or Entry level Java developer in our technical team who will be responsible for designing, developing, and implementing web-based Java applications to support business requirements. you will also responsible for writing code in java to maintain the server-side application. Qualification: Bachelor's/Master's degree in computer science or related field. Should have 0-3 years of working experience as a Java developer.<br><br><strong><u>Technical Skills<br></u></strong><ul><li>J2EE, Spring MVC, Spring Boot, Micro-services, SQL, Oracle, DB2.</li><li>Knowledge of Java 1.7 and 1.8 and an upgraded version.</li><li>Knowledge of Wildfly, Tomcat, and Apache.</li><li>Knowledge of JavaScript, XML, HTML, JDBC.</li><li>Knowledge of any of the cloud technology will be an added advantage.</li><li>Knowledge of other technologies as Python, DevOps, AWS (cloud computing) would be preferable.<br></li></ul>We train and deploy candidates at various client locations through our vendor network for both full-time and contract positions.<br><br>If you need a demo, kindly fill the below google form and our team will get back to you soon.<br><br><em>https://forms.gle/f1xnsHEJKXtfgc8v5<br><br></em>To discuss more please call me on 408-784-9330 or WhatsApp on 408-784-9330.<br><br>Thanks.<br><br>Contact at 408-784-9330.<br><br><strong><u>About Core Soft Tech<br><br></u></strong>Core Software Technologies Inc is an emerging, U.S-based consulting company that can provide your business with clear solutions.It specializes in providing state-of-the-art business technology solutions to organizations.\n      "
    },
    {
        "position": "Intern",
        "company": "Hawaiian Telcom ",
        "location": {
            "city": " Honolulu",
            "state": "HI"
        },
        "posted": "2021-06-24T18:52:24.722Z",
        "url": "https://www.linkedin.com/jobs/view/intern-at-hawaiian-telcom-2601683790?refId=3E%2F%2FM7I4cTAXi9qOC04qtw%3D%3D&trackingId=QMEFRakBWWZ4R3mwDzPBow%3D%3D&position=4&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Applicants are required to be currently enrolled in a University/College for this internship opportunity.<br><br><strong><u>Job Purpose<br><br></u></strong>The Outside/Inside Plant Engineering Intern will provide support to the Network Development Team. The role will involve drafting schematic, electrical and scale drawings for engineer job plans and specifications. Duties may also include updating databases, developing and updating provisioning sheets, and site walks with an HT engineer to validate poles, pull boxes, utility holes, and addresses. Frequent interaction with Planning and Engineering is required to coordinate related work activities. Performs other related, marginal duties associated with engineering as needed.<br><br><strong><u>Essential Functions<br></u></strong><ul><li> Assist Engineers with projects while learning the workflow process of day to day engineering. Perform all aspects of technical deployment projects, including an implementation plan, methods of procedures, additional technical resource identification, and execution of work. 50%</li><li> Develop/modify provisioning sheets, graphs, and charts as required. 10%</li><li> Assist engineers with reviewing plans, tracking permit submittals, assisting with administrative functions of engineering.10%</li><li> Update various databases and systems.10%</li><li> Interact and communicate with planners and engineers when necessary to determine work requirements.10%</li><li> Perform other related marginal duties as required.10%<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li> High School Diploma or equivalent</li><li> Have a valid driver's license</li><li> Must be enrolled in an Associate's, Bachelor's or Master's degree program in CAD Drafting and Design, Engineering Technology, Computer Science, or Information Sciences with a technical concentration from a two-year college or university.</li><li> Completion of any one or combination of the following: drafter or architectural, mechanical, or similar drafting courses.</li><li> Knowledge of TCP/IP and MPLS Networks</li><li> Microsoft Office Suite: Familiar with all applications from the Microsoft Office Suite to create reports, analyze data, and present information.</li><li> Ability to learn to utilize new software applications with little/no training and documentation essential.</li><li> Microsoft Office</li><li> Ability to quickly learn and utilize new technologies/programming skills</li><li> 2 or more of the following college course equivalents: UH written communication (FW), UH focus requirement (O, OC), social sciences (DS), or any equivalent</li><li> Undergraduate students in the following disciplines (major or minor) are preferred: Business Administration, Engineering (any), Computer Science, Communication and Information Sciences, Communications</li><li> Minimum GPA: 3.0/4.0<br></li></ul>Aloha! Welcome to Hawaiian Telcom's listing of current job openings. Hawaiian Telcom, the premier telecommunications company headquartered in Honolulu, offers Hawaii's consumers and businesses a spectrum of telecommunication solutions, taking full advantage of proven and emerging technologies. We are focused on building and maintaining a diverse team of employees who are committed to delivering an outstanding customer experience.<br>We call the communities we serve home and giving back to these communities is an important part of our culture.<br>Hawaiian Telcom offers an amazing Mālama Hours Program, Employee Resource Groups, and organized corporate community service events that further strengthen our community relationships.<br>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, age, disability, religion, sex, sexual orientation, gender identity, gender expression, protected veteran, military status or any other characteristic protected by law.<br>Due to U.S. Government requirements applicable to foreign-owned telecommunications providers, non-US citizens will be required to submit to an extensive government agency background check which will necessitate disclosure of sensitive Personally Identifiable Information.\n      "
    },
    {
        "position": "Intern - NJ",
        "company": "Urban Science ",
        "location": {
            "city": " Woodcliff Lake",
            "state": "NJ"
        },
        "posted": "2021-06-03T18:52:29.700Z",
        "url": "https://www.linkedin.com/jobs/view/intern-nj-at-urban-science-2621331738?refId=3E%2F%2FM7I4cTAXi9qOC04qtw%3D%3D&trackingId=mSXW1PBpoZ%2FUQAuaYGKwxg%3D%3D&position=7&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        We are Automotive Business Scientists. We empower our clients to turn overwhelming industry data into discovery, action and measured success. We are unique market leaders because we find and examine possibilities through the clarity of a scientific lens. To solve the toughest client challenges, we need curious, creative and dedicated people to join our team.<br><br>We search out individuals who align with our core values and who adhere to the highest standards of integrity and ethics in everything they do. Our company is filled with the brightest minds and the biggest hearts at every level. We recognize that personal success takes on many different forms of the course of our lives - both professional and personally - so we provide a myriad of benefits and programs focused on Wellbeing, Growth, Community and Recognition. One size does not fit all, so we encourage every Urban Scientist to discover their own formula for success. If this sounds like the kind of company you would like to work with, Apply Now!<br><br>This is a paid internship. Remote, work from home, will be considered.<br><br><strong>Assigned To One Or Different Projects, The Intern Will<br></strong><ul><li>Actively participate in Urban Science’s intern program, attending virtual networking activities with interns from other teams, attending learning sessions with business leaders, and other unique opportunities to learn about the broader business and useful career enhancing topics.</li><li>With manager guidance, plan, organize, develop and deliver client-requested reports, deliverables and projects on time, adhering to client requested specifications.</li><li>Work with extensive databases utilizing Urban Science proprietary software.</li><li>Track, process, analyze and verify data using Microsoft products, such as Excel and Access</li><li>Help plan, organize, develop and deliver client-requested projects and ad hoc requests within in prescribed time schedule. </li><li>Focus on improving new and existing processes to effectively and efficiently communicate data from various sources such as dealership sales and financials, vehicle registrations, customer satisfaction, demographics, economics, etc.</li><li>Adhere to quality control standards for Urban Science and the client.</li><li>Other duties as assigned.<br></li></ul>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><ul><li>Have a fundamental understanding of database concepts in order to complete client requests </li><li>Have a fundamental understanding of MS Excel for charting and graphing of data, writing formulas within cells, and/or filtering, sorting, and formatting data</li><li>Have fundamental computer programming knowledge and skills</li><li>College level math skills and solid mathematical grounding required</li><li>Ability to prioritize competing demands, manage multiple concurrent tasks and adapt to changing priorities</li><li>Ability to collaborate with other team members and have dedication to meeting and exceeding their expectations</li><li>Strong organizational skills and attention to detail<br></li></ul><strong>EDUCATION And/or EXPERIENCE<br></strong><ul><li>Current enrollment in a Baccalaureate or Master’s program in a technical field (engineering, applied math, computer science, applied science, MIS, or other) at an accredited U.S. college or university, or equivalent foreign institution is required</li><li>Technical skills necessary to support Urban Science systems </li><li>Microsoft Word, Access, Excel, and PowerPoint skills required</li><li>Knowledge of SQL preferred<br></li></ul><strong>WORK ENVIRONMENT <br><br></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n      "
    },
    {
        "position": "Summer Intern (RF Test Labs)",
        "company": "SpinLaunch ",
        "location": {
            "city": " Long Beach",
            "state": "CA"
        },
        "posted": "2021-06-01T18:52:58.072Z",
        "url": "https://www.linkedin.com/jobs/view/summer-intern-rf-test-labs-at-spinlaunch-2571841313?refId=3E%2F%2FM7I4cTAXi9qOC04qtw%3D%3D&trackingId=4heYbocDL0F8jArcxDQOpg%3D%3D&position=25&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        You will help change the landscape of the satellite industry. As an integral and unique part of a close-knit team of individuals operating in a high energy environment. As our <strong>Summer Intern</strong>, you will help set up a new RF test lab. This job is a temporary position located at our new Long Beach, CA facility.<br><br><strong>Your Mission<br></strong><ul> <li>Set up test equipment. </li> <li>Automate test setups. </li> <li>Run tests on new technologies under development. </li> <br></ul><strong>You Have<br></strong><ul> <li>At least 3 years of study in Computer Science or a related field. </li> <li>Proficiency in Python, LabVIEW, or other computer language common in RF test equipment. </li> <li><strong>Local candidates to Long Beach</strong><strong> and surrounding area</strong><strong> only need apply</strong> </li> <br></ul><strong>Strongly Desired <br></strong><ul> <li>Experience creating and programming prototype electronics. </li> <li>Basic understanding of networking and experience setting up a local area network. </li> <li>Undergraduate degree in a STEM field and working on a graduate degree in a STEM field. </li> <br><br></ul><strong><u>ITAR Requirements<br><br></u></strong>SpinLaunch is required by the U.S. Government to comply with various space technology export regulations including the International Traffic in Arms Regulations (ITAR).  All applicants must be a U.S. citizen, lawful permanent resident (“green card holder”) as defined by ITAR (22 CFR <li>120.15) or eligible to obtain the required authorizations from the U.S. Department of State. More information on ITAR can be found here.<br><br><em>SpinLaunch is committed to creating a diverse environment and is proud to be an equal opportunity employer. Each individual has the right to work in a professional environment that promotes equal employment opportunity and prohibits discriminatory practices, including harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></li>\n      "
    },
    {
        "position": "Summer Intern (RF Test Labs)",
        "company": "SpinLaunch ",
        "location": {
            "city": " Long Beach",
            "state": "CA"
        },
        "posted": "2021-06-01T18:52:59.665Z",
        "url": "https://www.linkedin.com/jobs/view/summer-intern-rf-test-labs-at-spinlaunch-2571841313?refId=hZpnHIaHbGzJAqZ%2Bi6ijpw%3D%3D&trackingId=XKLqB5sqRCawQqXYRO3MGg%3D%3D&position=1&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        You will help change the landscape of the satellite industry. As an integral and unique part of a close-knit team of individuals operating in a high energy environment. As our <strong>Summer Intern</strong>, you will help set up a new RF test lab. This job is a temporary position located at our new Long Beach, CA facility.<br><br><strong>Your Mission<br></strong><ul> <li>Set up test equipment. </li> <li>Automate test setups. </li> <li>Run tests on new technologies under development. </li> <br></ul><strong>You Have<br></strong><ul> <li>At least 3 years of study in Computer Science or a related field. </li> <li>Proficiency in Python, LabVIEW, or other computer language common in RF test equipment. </li> <li><strong>Local candidates to Long Beach</strong><strong> and surrounding area</strong><strong> only need apply</strong> </li> <br></ul><strong>Strongly Desired <br></strong><ul> <li>Experience creating and programming prototype electronics. </li> <li>Basic understanding of networking and experience setting up a local area network. </li> <li>Undergraduate degree in a STEM field and working on a graduate degree in a STEM field. </li> <br><br></ul><strong><u>ITAR Requirements<br><br></u></strong>SpinLaunch is required by the U.S. Government to comply with various space technology export regulations including the International Traffic in Arms Regulations (ITAR).  All applicants must be a U.S. citizen, lawful permanent resident (“green card holder”) as defined by ITAR (22 CFR <li>120.15) or eligible to obtain the required authorizations from the U.S. Department of State. More information on ITAR can be found here.<br><br><em>SpinLaunch is committed to creating a diverse environment and is proud to be an equal opportunity employer. Each individual has the right to work in a professional environment that promotes equal employment opportunity and prohibits discriminatory practices, including harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></li>\n      "
    },
    {
        "position": "Associate Consultant Intern",
        "company": "Bullhorn ",
        "location": {
            "city": " Boston",
            "state": "MA"
        },
        "posted": "2021-06-24T18:54:10.165Z",
        "url": "https://www.linkedin.com/jobs/view/associate-consultant-intern-at-bullhorn-2610971502?refId=3pD038yRMkm%2FjQS28UgqEw%3D%3D&trackingId=xzJJ8%2BTxGOwfuuaiHYPagg%3D%3D&position=22&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Do you have an interest in Software or Consulting? Do you like to problem solve or to help with organizational efficiency? Do you want to help implement a software that is specific to the staffing industry that helps people find jobs? As an Associate on the Solutions team at Bullhorn, you’ll work with Strategic Consultants (SC), Solutions Architects (SA) and Leadership to help improve internal processes and assist with the team's goal of providing our Clients with an incredible experience.<br><br>Bullhorn is the leading global software provider for the staffing and recruitment industry. More than 10,000 companies rely on Bullhorn’s cloud-based platform to power their staffing processes from start to finish. Through our incredible products and services, we create raving fan customers, resulting in company growth that consistently offers new opportunities for our talent to advance their careers. 25% of our global workforce gets promoted or moves into a new role every year, expanding their skills and working with new people. Bullhorn is large enough to provide these exciting opportunities but small enough to maintain the energy of a startup, and we’re consistently ranked as a great place to work for our strong culture and rewarding career opportunities.<br><br>As a Bullhorn Associate Consultant, some of your responsibilities would include:<br><ul> <li>Creating documentation needed for SC/SAs for client implementations</li> <li>Configuration of multiple applications in Bullhorn product portfolio</li> <li>Documentation of client business processes, workflows, and functional to identify solutions</li> <li>Leadership reports for management of team capacity/forecast, tasks, and risks</li> <li>Document repository clean up in Google Drive and Confluence</li> <li>Assist with development of internal training / mentoring programs &amp; Materials</li> <li>Review/updating of Standard Operating Procedures, templates, internal materials</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Actively pursuing a degree in Information Systems, Computer Science, Business, or related disciplines</li> <li>Excellent organizational abilities</li> <li>Excellent interpersonal skills: verbal communications and listening skills</li> <li>Ability to work independently as well as collaboratively</li> </ul> <strong>Bullhorn is committed to our core values and we are looking for people who exhibit these traits: <br></strong><ul> <li><strong>Service</strong> - You go beneath the surface to solve problems.</li> <li><strong>Energy</strong> - You build up your teammates and leave people positively charged.</li> <li><strong>Ownership</strong> - You take action and own up to your mistakes.</li> <li><strong>Speed &amp; Agility</strong> - You go around obstacles and demonstrate urgency.</li> <li><strong>Being Human</strong> - You consider other people's perspectives, laugh, and have fun.</li></ul>\n      "
    },
    {
        "position": "Intern, Publishing Technologies Digital Accessibility",
        "company": "SAGE Publishing ",
        "location": {
            "city": " Washington",
            "state": "DC"
        },
        "posted": "2021-06-17T18:54:13.617Z",
        "url": "https://www.linkedin.com/jobs/view/intern-publishing-technologies-digital-accessibility-at-sage-publishing-2607113656?refId=3pD038yRMkm%2FjQS28UgqEw%3D%3D&trackingId=o%2Fy3572QHz4TUWp6mNjnoA%3D%3D&position=24&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Overview<br><br></u></strong>The SAGE Publishing Technologies Digital Accessibility Internship offers the opportunity to learn more about the academic publishing industry while developing the skills needed to succeed in digital accessibility and technology positions.<br><br>The role will allow someone to gain hands-on experience and learn about digital accessibility and general academic publishing. They will engage in work pertaining to digital educational products that is project-based, multifaceted, fast-paced, intellectually exciting, and above all, collaborative. This position assists, maintains, and helps drive a range of accessibility testing and documentation activities.<br><br>This role is best suited for self-starters who are curious, organized, take initiative, ask questions, share feedback, participate in meetings, and are passionate about digital accessibility in higher education.<br><br>This internship is paid, part-time (16–25 hours per week during normal office hours) position for the fall 2021 academic semester with the possibility of extending into future semesters and/or the summer based on performance and continued interest. Interns will work remotely and, in the SAGE Washington, DC, office on a mutually agreed schedule.<br><br><strong><u>Essential Job Functions &amp; Responsibilities<br><br></u></strong>Job functions include, but are not limited to, the following:<br><ul><li> Assist accessibility specialist in conducting automated, manual, and screen reader testing on SAGE platforms and content </li><li> Record test results for incorporation into SAGE accessibility documentation </li><li> Support digital resource and assessment development </li><li> Provide user feedback on new products and platforms </li><li> Conduct research </li><li> Participate in regular and ad hoc meetings <br><br></li></ul><strong><u>Qualifications &amp; Education<br></u></strong><ul><li> Must be an active student currently working toward the completion of a degree at an accredited college or university. Preferred programs of study are Digital Accessibility, Universal Design, Web Design, Computer Science, Publishing, or a related field </li><li> It is essential to have a basic knowledge of HTML, CSS and/or JavaScript </li><li> Important to be a quick learner and independent problem solver </li><li> Able to read, analyze, and interpret concepts, documents, requirements, etc. </li><li> Familiarity with the W3C’s WCAG 2.1 and/or Section 508 of the Rehabilitation Act is a plus </li><li> Able to communicate potentially complicated information to non-digital accessibility experts. </li><li> Able to maintain high level of confidentiality and professionalism while working with tact and diplomacy </li><li> Able to multitask while maintaining attention to detail </li><li> Able to work in a constantly evolving, fast-paced environment requiring flexibility </li><li> Able to meet deadlines and work expertly under pressure </li><li> Possess exemplary communication skills </li><li> Possess effective decision-making skills <br><br></li></ul><strong> SAGE U.S. Diversity and Inclusion (D&amp;I) Charter <br><br></strong>SAGE Publishing is committed to being an inclusive employer where all individuals are treated with fairness and respect, regardless of age, disability, gender identity, marriage and partnership status, pregnancy and parental responsibilities, race, religion and belief, sex, or sexual orientation.<br><br>We believe that diversity is a cornerstone of a vibrant culture. We want SAGE to be an organization where the most talented staff and high-potential staff are recruited, have the opportunity to grow, and want to work. We strive to achieve a better representation of diverse talent at all levels, including leadership, across our workforce.\n      "
    },
    {
        "position": "Intern, Content Developer",
        "company": "Verint ",
        "location": {
            "city": " Alpharetta",
            "state": "GA"
        },
        "posted": "2021-06-01T18:55:05.407Z",
        "url": "https://www.linkedin.com/jobs/view/intern-content-developer-at-verint-2595417286?refId=wHLWIeTIQ1Ibs%2BYsP72suA%3D%3D&trackingId=DNj0GQ5M1euxqQdP6f%2BwoQ%3D%3D&position=9&pageNum=14&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Overview Of Job Function<br><br></u></strong>An Intern Content Developer works on assigned documentation projects for Verint Systems products. The Intern is assumed to be pursuing a degree in Technical Communication, Journalism, Instructional Design, or Media Arts and is seeking hands-on experience with technical communication principles, tools, practices, and procedures. The internship may involve extended work on one project or it may include a variety of shorter assignments<br><br>The Intern Content Developer produces clear, concise technical content deliverables to support Verint Systems software applications, which may include documentation, online help, training materials, elearning, or other assigned content deliverables. The Intern Content Developer ensures all content deliverables adhere to established standards and are adequately reviewed for technical accuracy by identified subject matter experts.<br><br><strong><u>Principal Duties And Essential Responsibilities<br></u></strong><ul><li>Designs, develops, and updates content deliverables (e.g., online help, installation guides, training materials, elearning, job aids) per approved content plans, ensuring content deliverables adhere to established standards. </li><li>Supports and/or installs software applications/operating systems to ensure content accuracy. </li><li>Participates in the testing and validation of content deliverables to ensure content accuracy. </li><li>Coordinates informal and formal reviews with subject matter experts and other applicable product team members. </li><li>Prepares content deliverables for deployment and distribution in relevant content repositories according to established procedures. </li><li>Participates in periodic project reviews. </li><li>Escalates urgent issues to Content Development management. </li><li>Regularly reports project status to the Content Development Manager or assigned Project Lead. <br></li></ul><strong><u>Minimum Requirements<br></u></strong><ul><li>A rising junior or senior university student currently enrolled and pursuing a BS in Technical Communication, Instructional Design, Information Technology or related field; or a recent graduate with a BS in Computer Science, Information Technology or related field with no more than 6 months of professional experience. </li><li>Ability to work in a cross-functional team environment. </li><li>Detail oriented and focused on assigned tasks. </li><li>Ability to understand and use software. </li><li>Possess strong analytical and technical skills. </li><li>Possess good written and verbal communication skills. </li><li>Understanding of instructional design principles, including needs analysis, . </li><li>Fast learner and able to pick up new ideas and approaches quickly. </li><li>Has strong organizational and time management skills. </li><li>Successful completion of the background check process, including but not limited to employment, education, criminal convictions, OFAC, SS Verification and credit, where available and in accordance with federal and local regulations. <br></li></ul><strong><u>Preferred Requirements<br></u></strong><ul><li>Demonstrates an applied knowledge of instructional design principles, including audience and task analysis, content development, and evaluation and assessment. </li><li> Knowledge of HTML and CSS a plus. </li><li>In-depth, hands-on knowledge of elearning technologies such as Camatasia, Captivate, or Articulate. </li><li>Ability to work both independently as well as in a dynamic, distributed team environment. </li><li>Ability to adhere to strict delivery schedules and successfully manage multiple projects simultaneously. </li><li>Exceptional analytical and problem-solving skills. </li><li>Strong time management. </li><li>Exceptional attention to detail. </li><li>Experience with larger-scale software development projects. </li><li>Knowledge of various software development methodologies (particularly Agile) and experience in all stages of the software development lifecycle.</li></ul>\n      "
    },
    {
        "position": "Quantitative Investment Intern",
        "company": "Providence Health & Services ",
        "location": {
            "city": " Renton",
            "state": "WA"
        },
        "posted": "2021-06-24T18:55:52.388Z",
        "url": "https://www.linkedin.com/jobs/view/quantitative-investment-intern-at-providence-health-services-2600687225?refId=tmg0HI0KfOz%2B8FuUWecl%2Bg%3D%3D&trackingId=1FcMRvLMLmhDhRckVGO2TA%3D%3D&position=14&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Description<br><br></u></strong><strong>Providence St. Joseph Health is calling a</strong> <strong>Quantitative Investment Intern</strong> <strong>to our location in Renton, WA or Irvine, CA.<br><br></strong>We are seeking a Quantitative Investment Intern to assist the Manager of Investment Risk in assessing our internal tools for assessing and managing investment risks, and creating management reports summarizing the key themes and risks in the existing investment portfolio, focused on $5.5 billion of long term investment assets and $1.5 billion of pension assets. As an integral member of the System's investment team, the Quantitative RIsk Analyst will assist in enhancing and maintaining the System investment models and tools used to monitor portfolio performance, asset allocation and exposures, cash flows and liquidity. Additionally, the intern will prepare reports and support analysis for recommendations to senior management as well as to contribute to general reporting and control processes. In particular, the candidate is expected to assist the Manager of Risk in working with one or more outside vendors to implement a comprehensive risk management architecture for the system, which will cover $10bn plus of assets and over 100 external investment managers.<br><br><strong><u>In This Position You Will Have The Following Responsibilities<br></u></strong><ul><li>Assist with managing, maintaining, and organizing various reports and documentation related to portfolio analytics.</li><li>Utilizes investment related software and applications to generate portfolio analysis and perform reconciliation and other reports, including but not limited to monthly, quarterly reports, and other ad hoc requests.</li><li>Ensures accuracy of data and timeliness of reporting for the system/region/entity/division.</li><li>Assists with creating and maintaining financial models.</li><li>Assists in preparing and compiling various reports, templates and analysis to support annual reporting and audit work.<br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Required qualifications:<br></strong><ul><li>Bachelor's Degree in Finance/Accounting/Computer Science.</li><li>3 months Finance/Computational Finance role in a financial institution or related entity.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Master's Degree in Computational Finance/Financial Engineering or equivalent education/experience.<br></li></ul><strong><u>About The Department You Will Serve.<br><br></u></strong>Providence Shared Services provides a variety of functional and system support services for our Providence family of organizations across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.<br><br><strong>We offer comprehensive, best-in-class benefits to our caregivers. For more information, visit<br><br></strong>https://www.providenceiscalling.jobs/rewards-benefits/<br><br><strong>Our Mission<br><br></strong>As expressions of God’s healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.<br><br><strong><u>About Us<br><br></u></strong>Providence is a comprehensive not-for-profit network of hospitals, care centers, health plans, physicians, clinics, home health care and services continuing a more than 100-year tradition of serving the poor and vulnerable. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.<br><br><strong>Schedule:</strong> Part-time<br><br><strong>Shift:</strong> Day<br><br><strong>Job Category:</strong> Student/Interns<br><br><strong>Location:</strong> Washington-Renton<br><br><strong>Other Location(s):</strong> California-Irvine<br><br><strong>Req ID:</strong> 300261\n      "
    },
    {
        "position": "Supply Chain Analytics Intern",
        "company": "Public Health Institute ",
        "location": {
            "city": " Washington",
            "state": "DC"
        },
        "posted": "2021-06-01T18:57:07.653Z",
        "url": "https://www.linkedin.com/jobs/view/supply-chain-analytics-intern-at-public-health-institute-2608891469?refId=Cdt7jB6niflqKHX7H%2F03pw%3D%3D&trackingId=u7OKE4m2YW%2Fb2EZ%2BR5BV%2Bw%3D%3D&position=12&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Posting Number:</strong> #175-21<br><br><strong>Position Title:</strong> Supply Chain Analytics Intern<br><br><strong>Closing Date:</strong> Until Filled<br><br><strong>Location:</strong> Washington, DC<br><br>m\"&gt;<br><ul><li>Facebook</li><li>Email</li><li>Linkedin</li><li>Twitter<br></li></ul>Apply Here<br><br>SUSTAINING TECHNICAL AND ANALYTIC RESOURCES<br><br>INTERN TITLE: Supply Chain Analytics Intern<br><br>HOST ORGANIZATION: Strategic Information/Knowledge Management Team Supply Chain for Health Division, Office of HIV/AIDS, Global Health Bureau, United States Agency for International Development<br><br>LOCATION: Washington DC/Virtual due to COVID-19<br><br>POSITION LEVEL: Masters<br><br>INT-P3-XXX<br><br>SALARY: $1,868.66 bi-weekly (exempt, salaried position)<br><br>ANTICIPATED TIMEFRAME: 6 Months, full-time<br><br><strong><u>Star Program Description<br><br></u></strong>Sustaining Technical and Analytic Resources (STAR) is a project of the Public Health Institute (PHI) in partnership with the Johns Hopkins University (JHU) and the University of California, San Francisco (UCSF), supported by the US Agency for International Development (USAID). STAR is a Global Health talent hub. Through fellowships, internships, and strategic partnerships, STAR supports building the capacity of diverse global health professionals and organizations at all levels to make inclusive, collaborative, and innovative contributions to global health. STAR participants collaborate in the development of systems and tools that strengthen and sustain the local and global health response.<br><br><strong><u>Background<br><br></u></strong>INTERNSHIP DESCRIPTION<br><br>USAID procures and distributes over $1B in health pharmaceuticals and supplies every year and invests over $200M annually to strengthen supply chains in developing countries. With over 100 points of origin, over 50 destination countries, more than 4000 SKUs and hundreds of shipments a year, the amount of data generated from its supply chain operation is significant. In addition, there is data residing in multiple country systems and many other data sources that can further support USAID’s supply chain program. USAID is in the process of bringing online a data warehouse and business intelligence tool to house and use these disparate datasets in the management of its supply chain programs and investments.<br><br><strong><u>Introduction<br><br></u></strong>The Supply Chain for Health Division within the Office of HIV/AIDS in the Bureau of Global Health is seeking a Supply Chain Analytics Intern (Intern) to assist the team (1) to evaluate the quality of critical datasets, (2) contribute to the design of solutions to address the root causes of missing and erroneous data, (3) to contribute to the design strategic reports and dashboards to support key management units within USAID Global Health, and (4) to identify business process improvement opportunities centered around the newly developing analytics platform.<br><br><strong><u>Reporting Structure<br><br></u></strong>The Intern will work closely with the Strategic Information/Knowledge Management team and receive technical guidance from the SCH Division Chief, who will serve as their Point of Contact.<br><br>OUTCOMES<br><br>By the end of the internship, the Intern will have gained experience and exposure to:<br><ul><li>Understanding of global health supply chain data, data mapping processes and standards, core supply chain processes, business intelligence tools, dashboarding and analytics.</li><li>Skills in collaboration and coordination within a complex organizational and implementation structure.</li><li>Experience working on analytics projects contributing to the creation of a new data warehouse and business intelligence tool for international datasets.<br></li></ul><strong><u>Essential Duties<br></u></strong><ul><li>Work with the Strategic Information/Knowledge Management team (SIKM) to develop an analytics project to advance OHA’s understanding and use of supply chain data, relying heavily on work in R, Python, or other open-source statistical packages.</li><li>Support the development of routine and ad-hoc analysis using 20+ supply chain datasets for data quality, contributing to the identification of root causes of error through data analysis, business process review, and stakeholder interviews.</li><li>Assist in recommending solutions to improve overall data quality (changes in processes, input automation, input masks, etc.).</li><li>Work with key personnel across the organization to design dashboards and reports to provide decision support and enable more efficient, effective and strategic management.<br></li></ul><strong><u>Anticipated Learning Outcomes<br><br></u></strong>All STAR Interns will participate in learning activities (*approximately 10% time) during their internship. By the end of the internship, the Intern will be able to:<br><ul><li>Gain exposure to data analytics and supply chain data/knowledge management through global health programming.</li><li>Apply effective communication skills across a broad network of peers and advisors within global health to support learning and professional development.<br></li></ul><strong><u>Required<br><br></u></strong>INTERNSHIP REQUIREMENTS<br><ul><li>Currently enrolled masters or other post-bachelor’s degree candidate or completion of such within the past 12 months related to supply chain management, business, information systems, computer science or related field.</li><li>Proficiency in R, Python or another open-source statistical package.</li><li>Professional or academic experience with global health, data analytics, supply chain management, procurement, and/or logistics for a large organization and/or HIV programs.</li><li>Ability to analyze data from different sources/databases utilizing multiple data analytic platforms.</li><li>Ability to create and present data visuals.</li><li>Strong interpersonal, facilitation and team-building skills, and ability to work cross-culturally with diverse teams.</li><li>Demonstrated innovative thinking and problem-solving skills.</li><li>Excellent analytical, written and oral communication skills.</li><li>This position may require travel. Ability to participate in a field experience, which may involve domestic and/or international travel and overnight stays for up to 2 weeks pending lifting of COVID-19 travel restrictions.</li><li>US citizenship or US permanent residency required.<br></li></ul><strong><u>Preferred (not Required)<br></u></strong><ul><li>Academic or professional experience working with dashboards/knowledge management tools.<br></li></ul><strong><u>Salary And Benefits<br></u></strong><ul><li>The Public Health Institute offers a comprehensive benefits package including learning programs.<br></li></ul>TO APPLY<br><ul><li>All applicants are required to apply for this position through STAR’s online recruitment system at recruitment.ghstar.org, which allows you to create a profile and upload a CV/resume and cover letter.<br></li></ul>The Public Health Institute is committed to a policy that provides equal employment opportunities to all employees and applicants for employment without regard to race, color, sex, religion, national origin, ancestry, age, marital status, pregnancy, medical condition including genetic characteristics, physical or mental disability, veteran status, gender identification and expression, sexual orientation, and to make all employment decisions so as to further this principle of equal employment opportunity. To this end, the PHI will not discriminate against any employee or applicant for employment because of race, color, sex, religion, national origin, ancestry, age, marital status, pregnancy, medical condition including genetic characteristics, physical or mental disability, veteran status, gender identification and expression, sexual orientation, and will take affirmative action to ensure that applicants are offered employment and employees are treated during employment without regard to these characteristics.<br><br>To apply for any position, you must create an account on the Public Health Institute’s job application site. After creating your account, you may search the open positions and apply for the specific position that interests you. Please note, mailed and emailed applications will not be accepted.<br><br>We’re so pleased the Public Health Institute is an organization you would like to work with. Do you have questions about this opportunity? If so, email our recruitment team at Recruitment@phi.org.<br><br>Find out more about the benefits of working at PHI.\n      "
    },
    {
        "position": "Data Analytics Intern, Arlington, VA",
        "company": "Management Systems International ",
        "location": {
            "city": " Arlington",
            "state": "VA"
        },
        "posted": "2021-06-10T18:57:14.260Z",
        "url": "https://www.linkedin.com/jobs/view/data-analytics-intern-arlington-va-at-management-systems-international-2591488923?refId=Cdt7jB6niflqKHX7H%2F03pw%3D%3D&trackingId=D5ioKbk5YOD3FXTs0BZKeg%3D%3D&position=16&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Data Analytics Intern, Arlington, VA<br><br></strong><strong><u>Position Summary<br><br></u></strong>MSI is now accepting applications for an internship to help our Chevron five year \"Bangladesh Partnership Initiative\" (BPI). The position will last approximately three months, with the possibility for extension based on performance, how well the candidate works with the team, and the needs of the team. Internships require a commitment of 28 hours per week. Applicants residing or attending school in the D.C. Metropolitan area are preferred. This is a paid position.<br><br><strong>The Bangladesh Partnership Initiative<br><br></strong>In 2014, Chevron launched the five-year “Bangladesh Partnership Initiative” (BPI) to complement and maximize the impact of its existing economic development and social investment programs. The goal of the project is to sustainably improve the livelihoods, employability, incomes, and inclusiveness of communities near Chevron’s operations in Greater Sylhet in the districts of Sylhet, Moulvibazar, and Hobiganj. BPI is currently comprised of two projects — “Jibika II,” an enterprise development and access to finance project, the latter of which is being implemented by BRAC and its partner, Institute of Development Affairs (IDEA), and “Uttoron,” a workforce development program being carried out by Swisscontact. Chevron has contracted with MSI to collect monthly monitoring data on village development organizations’ operations, finances, and outcomes.<br><br><strong><u>Responsibilities<br><br></u></strong>The intern’s primary responsibility would be to help engineer a workflow process starting with a collection of Excel worksheets and workbooks, leading to a collection of cleaned and merged data files which are then processed into multiple indicator tables and visualizations displayed in a static dashboard. Further development may include display in an interactive dashboard.<br><br><strong><u>Qualifications<br></u></strong><ul> <li>Masters degree student in any quantitative social science (economics, epidemiology, sociology) or explicitly an analytics field such as data science, operations research, information technology, computer science, etc.</li> <li>High abilities with R programming language, including use of R for automation of data handling, static or interactive dashboards, and hosting active web pages. </li> <li>Abilities with Git for hosting, version control, and reproducible research</li> <li>Professional demeanor and diplomatic communication skills, especially via email.</li> <li>Attention to detail and ability to prioritize within a multi-tasking environment.</li> <li>Excellent writing/editing skills.</li> <li>Strong organizational skills.</li> <li>Knowledge of Microsoft Office applications and the ability to learn new software programs quickly.</li> <li>Fluency in a second language, preferably Arabic, French or Spanish preferred</li> <br></ul>Only candidates who have been selected for an interview will be contacted. No phone calls, please.<br><br>MSI is an EEO/AA/ADA Veterans Employer.<br><br><strong> Reasonable Accommodations: </strong> MSI is dedicated to hiring an inclusive workforce. If you would like to request reasonable accommodations during the application process, please email <strong>MSI.Dept.HRRecruiting@tetratechinc.onmicrosoft.com</strong> with “Reasonable Accommodations” in the title. Our recruitment team looks forward to engaging in an interactive process to provide reasonable accommodations for candidates.\n      "
    },
    {
        "position": "Commercial Operations Intern",
        "company": "AiCure ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-01T18:57:23.924Z",
        "url": "https://www.linkedin.com/jobs/view/commercial-operations-intern-at-aicure-2608448225?refId=Cdt7jB6niflqKHX7H%2F03pw%3D%3D&trackingId=TtCP3MjWQR17JeH2BqsqSg%3D%3D&position=22&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Description:<br><br></strong>Under the direction of Manager, Commercial Operations and Analytics and the Assistant Manager, Commercial Operations, the intern will be tasked with literature review, market research, development of market research reports and assist with Salesforce admin requests and troubleshoot issues, whilst working with diverse user groups across the Commercial operations, Account Directors and marketing teams.<br><br>Our ideal candidate has a passion for learning in an organization that utilizes technology to change the healthcare industry. This person should possess exceptional writing skills and has the ability to understand AiCure's market. The position supports the various members of our commercial team, most notably our Account Directors and Marketing staff as we expand our customer base through successful collaborations with customers in the pharmaceutical and biotech industries.<br><br><strong>Responsibilities:<br><br></strong><ul> <li>Use GlobalData and other data sources to research and identify relevant clinical trials that are potential targets for our Account Directors</li> <li>Use ZoomInfo, LinkedIn, and company websites to identify people involved in relevant therapeutic areas or within certain roles, for purposes of sales targeting</li> <li>Uploading contact/conference lists into CRM in addition to deal opportunities from our lead funnel</li> <li>Review conference attendee lists and conduct targeted outreach to secure key meetings</li> <li>Help build market intelligence by conducting rigorous competitive research and analyses</li> <li>Conduct literature searches to identify data points with citations to support client presentations and other deliverables</li> <li>Learn and become a power user of AiCure's Salesforce, assist in cleaning up/optimizing CRM data and help finalize the implementation of Salesforce CPQ</li> <li>Review RFP information and put appropriate requests in Salesforce</li> <li>Provide recommendations on process optimizations and improvements</li> <li>Other special projects and client-focused deliverables, as needed</li> <br></ul><strong>Requirements:<br><br></strong><ul> <li>Bachelor's degree in life sciences or computer sciences</li> <li>Extreme level of attention to detail</li> <li>High ability to multitask</li> <li>Comfortable working in fast-paced, highly demanding environment</li> <li>Ability to effectively and professionally communicate</li> <li>Proficient in Microsoft Word, Excel and other productivity software</li></ul>\n      "
    },
    {
        "position": "Product Management Intern",
        "company": "Zaloni ",
        "location": {
            "city": " Durham",
            "state": "NC"
        },
        "posted": "2021-06-01T18:57:25.792Z",
        "url": "https://www.linkedin.com/jobs/view/product-management-intern-at-zaloni-2593718812?refId=Cdt7jB6niflqKHX7H%2F03pw%3D%3D&trackingId=x6Ozs37RXkhqX48S3xPF6w%3D%3D&position=23&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Our Amazing #TeamZaloniWe are the frontline evangelists and trusted advisors to our customers. Zaloni understands its customers require industry expertise as well as an ability to help them meet their business objectives. The Product Management team at Zaloni is responsible for building a product strategy that will please our customers as well as provide an industry leading vision for our overall market. The Zaloni Product Management team serves as a bridge between our customers and the Zaloni Development, Marketing, and Sales teams.<br>What You'll Do in This Role to Add Value<br>Zaloni is transforming the way organizations enable, govern, and engage with their big data platforms. We are seeking exceptional product management talent to collaborate with internal and external product influencers. You will help define and deliver the product direction and requirements for assigned products included in the Zaloni product portfolio. Activities will vary in reach and require constant collaboration with Zaloni Marketing, Development, Sales, and Technical Support Teams.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> The intern will assist all members of the Product Management team with the range of activities we perform on a regular basis:</li><li> Define detailed product requirements based on customer, prospect, and internal stakeholder inputs.</li><li> Define detailed user personas and use cases.</li><li> Deliver technical, fact-oriented content for pricing, positioning, and collateral.<br></li></ul><strong><u>Required Skills/Qualifications<br></u></strong><ul><li> Interest in the software industry and product management</li><li> A background in Computer Science, Data Science, Business, or similar</li><li> Currently enrolled in an undergraduate or graduate program with a technical or business focus</li><li> Demonstrated critical thinking skills and drive to learn and adapt to new technologies</li><li> Ability to complete a 2-3 month program beginning Summer 2021</li><li> Exceptional oral and written communication skills; ability to communicate effectively via email, slack, video, phone, and similar technologies with colleagues, customers, and partners.<br></li></ul>Our Awesome CompanyZaloni simplifies big data for transformative business insights. We work with pioneering enterprises to modernize their data architecture and operationalize their data lakes to incorporate data into everyday business practices. Zaloni's data management platform, Arena, provides total control throughout the data pipeline from ingestion to analytics, with comprehensive data management, governance and self-service data preparation capabilities for IT and business users. A leader in big data for more than a decade, Zaloni's expertise is deep, spans multiple industries, and has proven invaluable to customers at many of the world's top companies. We are proud to be recognized by CRN's 2017 Big Data 100 list, Forbes top 20 big data companies to work for, and Red Herring's Top 100 North America Award.<br>For additional information, please visit www.zaloni.com.<br>Zaloni, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.<br>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n      "
    },
    {
        "position": "HBK Engineering Co-op Program 2021",
        "company": "HBK - Hottinger Brüel & Kjær ",
        "location": {
            "city": " United States",
            "state": "United States"
        },
        "posted": "2021-06-10T18:57:27.782Z",
        "url": "https://www.linkedin.com/jobs/view/hbk-engineering-co-op-program-2021-at-hbk-hottinger-br%C3%BCel-kj%C3%A6r-2585131154?refId=Cdt7jB6niflqKHX7H%2F03pw%3D%3D&trackingId=NHOxO04NhK73HFkJrrVXZQ%3D%3D&position=24&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <p>HBK Engineering&nbsp;Co-op&nbsp;Program&nbsp;</p><p>&nbsp;</p><p>Throughout the&nbsp;Co-op program,&nbsp;participants are exposed to many different core&nbsp;business units, while learning&nbsp;HBK’s&nbsp;processes and operating systems to achieve success. There are endless opportunities to build networks, develop strong relationships, and gain credible work experience. This program enables growth and development across the organization, with structured mentoring from senior engineers&nbsp;and business leaders. The unique design of&nbsp;the&nbsp;ERP focuses on career-driven individuals looking to maximize their learning, solve complex problems, and work for an&nbsp;industry leader in test and measurement. At the conclusion of the program, participants&nbsp;may&nbsp;have the opportunity to be placed in a dedicated role&nbsp;in our Americas team.&nbsp;</p><p>&nbsp;</p><p>Our Cooperative Education Program gives students the opportunity to supplement their education with valuable hands-on experience and training. Co-ops are paid and are typically 4 to 5&nbsp;months.&nbsp;&nbsp;<strong>Start date, September 2021.</strong>&nbsp;</p><p>&nbsp;</p><p><strong>Locations: Detroit, MI, Marlborough, MA,&nbsp;Tucson, AZ,&nbsp;Duluth, GA and or Remote&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>Co-op opportunities depending on&nbsp;location&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>Design Engineering/Sound&nbsp;and Vibration Engineering</strong>&nbsp;</p><p>The student will become acclimated to the engineering workplace, design concepts, and improve skills in the daily utilization of&nbsp;engineering tools.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Inside Sales</strong>&nbsp;</p><p>Interact with sales team, product managers, and&nbsp;engineers&nbsp;to determine customer requirements and expectations to recommend specific products and solutions. In addition, students are expected&nbsp;to provide&nbsp;quotes and responses to RFPs.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Applications Engineering</strong>&nbsp;</p><p>Learn about the&nbsp;HBK&nbsp;suite of products with a focus in areas like&nbsp;data acquisition, sensors, and vibration test. Work in tandem with Application Engineers on customer projects and assist training activities.&nbsp;</p><p>&nbsp;</p><p><strong>GCC&nbsp;&amp;&nbsp;Calibration and Repairs</strong>&nbsp;</p><p>Very important to our business to understand the workflow and support our customers.&nbsp;</p><p>Working with equipment that students may be familiar with. Calibrations helps complete the picture of what we do.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Technical Marketing&nbsp;&amp; HR</strong>&nbsp;</p><p>Create product technology collateral (presentations, white papers,&nbsp;etc.) to highlight HBK sounds and vibration applications&nbsp;and case studies. Assist in the creation of product videos for various HBK products.&nbsp;Assist with thought leadership on social&nbsp;media&nbsp;</p><p>&nbsp;</p><p>At the completion of the&nbsp;Co-op&nbsp;program students are&nbsp;expected to meet with their&nbsp;mentor to&nbsp;synthesize their&nbsp;observations&nbsp;and experiences in the various roles. The students are encouraged to discuss&nbsp;learned&nbsp;skills and&nbsp;accomplished&nbsp;goals with their mentor to maximize their experience&nbsp;at HBK.&nbsp;The&nbsp;Co-op student will also&nbsp;do a presentation of her/his&nbsp;project to an audience that&nbsp;could&nbsp;include peers, managers and leadership so that the&nbsp;Co-op&nbsp;student&nbsp;can showcase their learnings, contributions&nbsp;and&nbsp;network.&nbsp;</p><p><br></p><p><strong>What we want to see</strong>&nbsp;</p><ul><li>Candidate must be enrolled in an accredited a 4-year Accredited university/college in an Engineering discipline or Computer&nbsp;Science&nbsp;</li><li>Minimum cumulative Grade Point Average of 2.7/4.0(no rounding) at current institution&nbsp;</li><li>You must be enrolled in at least six units in an academic program related to the Co-Op project and must receive course credit for the co-op.&nbsp;</li><li>Agree to work a minimum of two (2) co-op terms on an alternating term basis (more than two co-op terms is preferred)&nbsp;</li><li>Candidates must be available to work full time for up to 6 consecutive months&nbsp;beginning&nbsp;August/September&nbsp;2021&nbsp;</li><li>Flexible with work assignment location/relocation&nbsp;</li><li>Provide your own transportation to and from work location for each co-op&nbsp;assignment.&nbsp;</li><li>Previous technical internship/co-op is a&nbsp;plus&nbsp;&nbsp;&nbsp;</li><li>Candidate must be a Citizen or National of the United States, a lawful, permanent resident, or have authorization to work in the United States.&nbsp;Applicants must not now, or in the future, require sponsorship for an employment&nbsp;visa&nbsp;</li></ul><p>&nbsp;</p><p>We&nbsp;offer&nbsp;</p><p>The job will provide you with an opportunity to work on real projects and gain practical, hands-on experience alongside some of the best and most passionate technology experts from around the world in a leading company within the test and measurement industry. You will be a strong contributor who collaborates closely with colleagues from various business functions all over the world while enjoying a flexible work schedule.&nbsp;&nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>One company – HBK</strong>&nbsp;</p><p>On 1st&nbsp;January 2019,&nbsp;Brüel&nbsp;&amp;&nbsp;Kjær&nbsp;Sound &amp; Vibration Measurement A/S and HBM merged their activities into a new company called HBK (Hottinger&nbsp;Brüel&nbsp;&amp;&nbsp;Kjær). With more than 3000 employees worldwide and production facilities in Denmark, Germany, the UK, the USA, China and Portugal, and presence in 80 countries, HBK becomes a leading global powerhouse.&nbsp;&nbsp;</p><p>&nbsp;&nbsp;</p><p>Both companies currently operate within the Test and Measurement segment of Spectris, the productivity-enhancing instrumentation and controls company. For further info please visit&nbsp;www.hbkworld.com.&nbsp;</p><p></p>\n      "
    },
    {
        "position": "HBK Engineering Co-op Program 2021",
        "company": "HBK - Hottinger Brüel & Kjær ",
        "location": {
            "city": " United States",
            "state": "United States"
        },
        "posted": "2021-06-10T18:57:29.456Z",
        "url": "https://www.linkedin.com/jobs/view/hbk-engineering-co-op-program-2021-at-hbk-hottinger-br%C3%BCel-kj%C3%A6r-2585131154?refId=6oGIsmR4%2FM09ig2VAkcV1w%3D%3D&trackingId=%2B57D4nCBv3%2BEhd1B%2B80K7g%3D%3D&position=1&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <p>HBK Engineering&nbsp;Co-op&nbsp;Program&nbsp;</p><p>&nbsp;</p><p>Throughout the&nbsp;Co-op program,&nbsp;participants are exposed to many different core&nbsp;business units, while learning&nbsp;HBK’s&nbsp;processes and operating systems to achieve success. There are endless opportunities to build networks, develop strong relationships, and gain credible work experience. This program enables growth and development across the organization, with structured mentoring from senior engineers&nbsp;and business leaders. The unique design of&nbsp;the&nbsp;ERP focuses on career-driven individuals looking to maximize their learning, solve complex problems, and work for an&nbsp;industry leader in test and measurement. At the conclusion of the program, participants&nbsp;may&nbsp;have the opportunity to be placed in a dedicated role&nbsp;in our Americas team.&nbsp;</p><p>&nbsp;</p><p>Our Cooperative Education Program gives students the opportunity to supplement their education with valuable hands-on experience and training. Co-ops are paid and are typically 4 to 5&nbsp;months.&nbsp;&nbsp;<strong>Start date, September 2021.</strong>&nbsp;</p><p>&nbsp;</p><p><strong>Locations: Detroit, MI, Marlborough, MA,&nbsp;Tucson, AZ,&nbsp;Duluth, GA and or Remote&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>Co-op opportunities depending on&nbsp;location&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>Design Engineering/Sound&nbsp;and Vibration Engineering</strong>&nbsp;</p><p>The student will become acclimated to the engineering workplace, design concepts, and improve skills in the daily utilization of&nbsp;engineering tools.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Inside Sales</strong>&nbsp;</p><p>Interact with sales team, product managers, and&nbsp;engineers&nbsp;to determine customer requirements and expectations to recommend specific products and solutions. In addition, students are expected&nbsp;to provide&nbsp;quotes and responses to RFPs.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Applications Engineering</strong>&nbsp;</p><p>Learn about the&nbsp;HBK&nbsp;suite of products with a focus in areas like&nbsp;data acquisition, sensors, and vibration test. Work in tandem with Application Engineers on customer projects and assist training activities.&nbsp;</p><p>&nbsp;</p><p><strong>GCC&nbsp;&amp;&nbsp;Calibration and Repairs</strong>&nbsp;</p><p>Very important to our business to understand the workflow and support our customers.&nbsp;</p><p>Working with equipment that students may be familiar with. Calibrations helps complete the picture of what we do.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Technical Marketing&nbsp;&amp; HR</strong>&nbsp;</p><p>Create product technology collateral (presentations, white papers,&nbsp;etc.) to highlight HBK sounds and vibration applications&nbsp;and case studies. Assist in the creation of product videos for various HBK products.&nbsp;Assist with thought leadership on social&nbsp;media&nbsp;</p><p>&nbsp;</p><p>At the completion of the&nbsp;Co-op&nbsp;program students are&nbsp;expected to meet with their&nbsp;mentor to&nbsp;synthesize their&nbsp;observations&nbsp;and experiences in the various roles. The students are encouraged to discuss&nbsp;learned&nbsp;skills and&nbsp;accomplished&nbsp;goals with their mentor to maximize their experience&nbsp;at HBK.&nbsp;The&nbsp;Co-op student will also&nbsp;do a presentation of her/his&nbsp;project to an audience that&nbsp;could&nbsp;include peers, managers and leadership so that the&nbsp;Co-op&nbsp;student&nbsp;can showcase their learnings, contributions&nbsp;and&nbsp;network.&nbsp;</p><p><br></p><p><strong>What we want to see</strong>&nbsp;</p><ul><li>Candidate must be enrolled in an accredited a 4-year Accredited university/college in an Engineering discipline or Computer&nbsp;Science&nbsp;</li><li>Minimum cumulative Grade Point Average of 2.7/4.0(no rounding) at current institution&nbsp;</li><li>You must be enrolled in at least six units in an academic program related to the Co-Op project and must receive course credit for the co-op.&nbsp;</li><li>Agree to work a minimum of two (2) co-op terms on an alternating term basis (more than two co-op terms is preferred)&nbsp;</li><li>Candidates must be available to work full time for up to 6 consecutive months&nbsp;beginning&nbsp;August/September&nbsp;2021&nbsp;</li><li>Flexible with work assignment location/relocation&nbsp;</li><li>Provide your own transportation to and from work location for each co-op&nbsp;assignment.&nbsp;</li><li>Previous technical internship/co-op is a&nbsp;plus&nbsp;&nbsp;&nbsp;</li><li>Candidate must be a Citizen or National of the United States, a lawful, permanent resident, or have authorization to work in the United States.&nbsp;Applicants must not now, or in the future, require sponsorship for an employment&nbsp;visa&nbsp;</li></ul><p>&nbsp;</p><p>We&nbsp;offer&nbsp;</p><p>The job will provide you with an opportunity to work on real projects and gain practical, hands-on experience alongside some of the best and most passionate technology experts from around the world in a leading company within the test and measurement industry. You will be a strong contributor who collaborates closely with colleagues from various business functions all over the world while enjoying a flexible work schedule.&nbsp;&nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>One company – HBK</strong>&nbsp;</p><p>On 1st&nbsp;January 2019,&nbsp;Brüel&nbsp;&amp;&nbsp;Kjær&nbsp;Sound &amp; Vibration Measurement A/S and HBM merged their activities into a new company called HBK (Hottinger&nbsp;Brüel&nbsp;&amp;&nbsp;Kjær). With more than 3000 employees worldwide and production facilities in Denmark, Germany, the UK, the USA, China and Portugal, and presence in 80 countries, HBK becomes a leading global powerhouse.&nbsp;&nbsp;</p><p>&nbsp;&nbsp;</p><p>Both companies currently operate within the Test and Measurement segment of Spectris, the productivity-enhancing instrumentation and controls company. For further info please visit&nbsp;www.hbkworld.com.&nbsp;</p><p></p>\n      "
    },
    {
        "position": "StateFarm MAGNet Intern – Fall 2021StateFarm",
        "company": "University of Illinois Research Park ",
        "location": {
            "city": " Champaign",
            "state": "IL"
        },
        "posted": "2021-06-17T18:57:34.430Z",
        "url": "https://www.linkedin.com/jobs/view/statefarm-magnet-intern-%E2%80%93-fall-2021statefarm-at-university-of-illinois-research-park-2604545261?refId=6oGIsmR4%2FM09ig2VAkcV1w%3D%3D&trackingId=BFW4QtSnl4DzC3TQkk06mQ%3D%3D&position=4&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Overview<br><br></u></strong><strong> About the job<br><br></strong>We are not just offering a job but a meaningful career! Come join our passionate team!<br><br>As a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.<br><br>We offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!<br><br><strong><u>Responsibilities<br><br></u></strong>State Farm has developed a unique internship opportunity for graduate students at the University of Illinois – the Modeling and Analytics Graduate Network (MAGNet). MAGNet interns apply their statistical modeling and analytic skills to a wide variety of business problems faced by the State Farm organization.<br><br>Most MAGNet interns are in the Statistics Department’s graduate program, but graduate students in other highly quantitative disciplines may also be considered. While participating in the MAGNet program, students are evaluated and given consideration for full time post graduate employment at various State Farm locations: Bloomington IL, Atlanta GA, Dallas TX or Champaign IL.<br><br>Marketing, Insurance And Banking) Including<br>MAGNet interns apply their predictive modeling and data analysis skills to a variety of business problems, in many different lines of business and departments (e.g.)<br><ul><li> Pricing and Underwriting Risk Predictive Modeling</li> <li> Claims Automation Predictive Modeling</li> <li> Sales/Growth Forecasting, Econometric and Predictive Modeling</li> <li> Data mining applications for Claims and Competitive Analysis</li> <li> Evaluating new statistical methods and tools for potential use by State Farm Modelers<br></li></ul><strong><u>Qualifications<br><br></u></strong>Interns are assigned based to a wide variety of departments for experience, based on major and interest area.<br><br>Majors Considered<br><ul><li> Statistics</li> <li> Mathematics</li> <li> Computer Science</li> <li> Finance</li> <li> Economics</li> <li> Actuarial Science</li> <li> Data Science<br></li></ul>We Are Looking For The Following<br><ul><li> Applicants must be accepted or currently enrolled in an approved Graduate program at University of Illinois</li> <li> Statistical modeling and/or data mining experience</li> <li> Data analysis and experience with database tools</li> <li> Computer programming (specifically SAS, R, or Python) skills</li> <li> Communication and presentations skills<br></li></ul>What You Can Expecting<br><ul><li> During the academic year, MAGNet interns will work 20 hours a week</li> <li> Internship duration: Fall 2021 semester 8/23/2021 to 12/10/2021<br></li></ul>What’s In It For You<br>MAGNet is similar to a 50% graduate assistantship offered by the University and interns receive hourly pay comparable to that offered by the University for graduate assistants, as well as full tuition assistance for the duration of the internship. As with an assistantship, tuition costs are covered.<br><br>Some State Farm benefits may also apply, including the following:<br><ul><li> Relaxed dress code</li> <li> Direct experience you can leverage for you future career</li> <li> An opportunity to learn and network with industry-leading influencers</li> <li> A Learning Environment: Mentoring and Development to help you succeed</li> <li> We love to give back! Being involved in volunteer opportunities to give back to the community</li> <li> A culture that embraces Diversity and Inclusion – it is simply the right thing to do!<br></li></ul>\n      "
    },
    {
        "position": "Technology Experience for Women (Summer 2021 Internship) - PEAK6",
        "company": "1871 ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-06-01T18:58:46.616Z",
        "url": "https://www.linkedin.com/jobs/view/technology-experience-for-women-summer-2021-internship-peak6-at-1871-2612846422?refId=1DDZeB5ZDvtTyUNEiw7YNQ%3D%3D&trackingId=hOLirpEZd2%2FvwyGiJPfElQ%3D%3D&position=25&pageNum=19&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>About The Role<br><br></u></strong>PEAK6 is a leading investment firm headquartered in Chicago. More than 20 years ago, we were one of the first firms to develop sophisticated proprietary technology in our trading business. We’ve taken our passion for technology and created a software development experience designed to introduce women to the FinTech industry. Our Tech Experience is meant to encourage smart, ambitious, tech-savvy women to break the mold. We’ve heard all the myths about FinTech—too cutthroat, too intense, too risky—but we know that’s not the case at PEAK6. We know women make outstanding developers and technologists, but there are not enough female developers in the FinTech field yet. We are changing that.<br><br>You can expect the Technology Experience to include<br><ul> <li>Working on an impactful project from concept to delivery and presenting your work to senior leadership</li> <li>Developing innovative tools to integrate with our proprietary trading platform. Some examples from previous years include tooling for low-latency market data streams, a data dependency framework and visualization tool, and an analytics framework and visualization tool for application usage.</li> <li>Working with a variety of languages/frameworks, such as Java, Python, Go, JavaScript, HTML/CSS, and React, and technologies such as MS SQL Server, PostgreSQL, Redis, MongoDB, Airflow, Kafka, Kubernetes, and Docker</li> <li>One-on-one mentorship focused on your learning and growth while progressing on your project</li> <li>Education sessions to learn about financial markets and the tech behind our trading platform</li> <li>Rotations and project deep-dives with our development teams</li> <li>Exposure to various other PEAK6 businesses and senior leadership</li> <li>Multiple opportunities to hear and learn from women in the FinTech space, both within PEAK6 and from other organizations</li> <li>Integration with our development teams – including stand-ups, team meetings, and project planning sessions</li> <li>Close collaboration with business stakeholders and end users on projects</li> <li>Dynamic, fast-paced work environment where the need to stay ahead of the curve means you’ll learn every day</li> <br><br></ul><strong><u>Requirements<br><br></u></strong>You’ll gain loads of experience in our Tech Experience but before you do, you should have<br><ul> <li>A graduation date between December 2021 – June 2022 in a Bachelor’s or Master’s program in Computer Science, Electrical or Computer Engineering, or a related discipline</li> <li>Software development skills in a modern, object-oriented programming language such as Java, Python, or Go, and the ability to learn new languages and technologies quickly</li> <li>Exceptional problem-solving skills with high attention to detail</li> <li>Curiosity to learn and a drive to improve</li> <li>Ability to thrive in collaborative environments</li> <li>Effective communication skills</li> <li>Demonstrated leadership ability</li> <br></ul>Bonus points if<br><ul> <li>You have a background or strong interest in financial markets</li> <li>You’re familiar with service-oriented software architectures and distributed systems</li> <li>You have experience with multithreading and concurrent programming</li> <br></ul><em>Due to the unprecedented situation of COVID-19, PEAK6 has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, onboarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities and the CDC.</em>\n      "
    },
    {
        "position": "Technology Experience for Women (Summer 2021 Internship) - PEAK6",
        "company": "1871 ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-06-01T18:58:48.296Z",
        "url": "https://www.linkedin.com/jobs/view/technology-experience-for-women-summer-2021-internship-peak6-at-1871-2612846422?refId=0xEZ0WN3HGhlRBQShn0%2BWA%3D%3D&trackingId=9CoMe0MZTUAhwjWuZli%2BUA%3D%3D&position=1&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>About The Role<br><br></u></strong>PEAK6 is a leading investment firm headquartered in Chicago. More than 20 years ago, we were one of the first firms to develop sophisticated proprietary technology in our trading business. We’ve taken our passion for technology and created a software development experience designed to introduce women to the FinTech industry. Our Tech Experience is meant to encourage smart, ambitious, tech-savvy women to break the mold. We’ve heard all the myths about FinTech—too cutthroat, too intense, too risky—but we know that’s not the case at PEAK6. We know women make outstanding developers and technologists, but there are not enough female developers in the FinTech field yet. We are changing that.<br><br>You can expect the Technology Experience to include<br><ul> <li>Working on an impactful project from concept to delivery and presenting your work to senior leadership</li> <li>Developing innovative tools to integrate with our proprietary trading platform. Some examples from previous years include tooling for low-latency market data streams, a data dependency framework and visualization tool, and an analytics framework and visualization tool for application usage.</li> <li>Working with a variety of languages/frameworks, such as Java, Python, Go, JavaScript, HTML/CSS, and React, and technologies such as MS SQL Server, PostgreSQL, Redis, MongoDB, Airflow, Kafka, Kubernetes, and Docker</li> <li>One-on-one mentorship focused on your learning and growth while progressing on your project</li> <li>Education sessions to learn about financial markets and the tech behind our trading platform</li> <li>Rotations and project deep-dives with our development teams</li> <li>Exposure to various other PEAK6 businesses and senior leadership</li> <li>Multiple opportunities to hear and learn from women in the FinTech space, both within PEAK6 and from other organizations</li> <li>Integration with our development teams – including stand-ups, team meetings, and project planning sessions</li> <li>Close collaboration with business stakeholders and end users on projects</li> <li>Dynamic, fast-paced work environment where the need to stay ahead of the curve means you’ll learn every day</li> <br><br></ul><strong><u>Requirements<br><br></u></strong>You’ll gain loads of experience in our Tech Experience but before you do, you should have<br><ul> <li>A graduation date between December 2021 – June 2022 in a Bachelor’s or Master’s program in Computer Science, Electrical or Computer Engineering, or a related discipline</li> <li>Software development skills in a modern, object-oriented programming language such as Java, Python, or Go, and the ability to learn new languages and technologies quickly</li> <li>Exceptional problem-solving skills with high attention to detail</li> <li>Curiosity to learn and a drive to improve</li> <li>Ability to thrive in collaborative environments</li> <li>Effective communication skills</li> <li>Demonstrated leadership ability</li> <br></ul>Bonus points if<br><ul> <li>You have a background or strong interest in financial markets</li> <li>You’re familiar with service-oriented software architectures and distributed systems</li> <li>You have experience with multithreading and concurrent programming</li> <br></ul><em>Due to the unprecedented situation of COVID-19, PEAK6 has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, onboarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities and the CDC.</em>\n      "
    },
    {
        "position": "HitS Platform Intern-Data Engineering",
        "company": "WuXi AppTec ",
        "location": {
            "city": " Natick",
            "state": "MA"
        },
        "posted": "2021-06-25T18:59:13.565Z",
        "url": "https://www.linkedin.com/jobs/view/hits-platform-intern-data-engineering-at-wuxi-apptec-2612485009?refId=0xEZ0WN3HGhlRBQShn0%2BWA%3D%3D&trackingId=oQys0WTSGATykfZo93WqAQ%3D%3D&position=17&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        DEL (DNA-encoded library) is a rapidly growing drug discovery platform at HitS Business Unit in WuXi AppTec. This cutting-edge multidisciplinary platform combines the latest technologies in chemistry, chemical biology, biology and informatics. We are seeking for highly motivated and enthusiastic intern to join this platform. The candidate will collaborate closely with other functional teams in maintaining and developing our data platform, developing data-based applications and participating in data analysis and reporting.<br><ul><li>Participate in developing machine learning applications.</li><li>Participate in developing web-based applications.</li><li>Maintain and develop the cloud-based data analytics platform.</li><li>Assist the team in cloud system administration.</li><li>Assist the team in database management.</li><li>Work with the scientists as a team to assist DEL data analysis and reporting.</li><li>S, or M.S. students in software engineer, computer science, computational biology, computational chemistry and related fields. </li><li>Additional experience in chemistry, bioinformatics, cheminformatics, and biophysics is a plus</li><li>Any combination of education/experience<br></li></ul><strong>Knowledge / Skills / Abilities<br></strong><ul><li>Familiarity with AWS tools and infrastructures;</li><li>Understanding in docker, RDMS, batch computing, and/or deep learning.</li><li>Good technical communication skills;</li><li>Good problem solving skills;</li><li>Solid coding experience in shell scripting, python, java, PhP or Go. <br></li></ul><strong>Physical Requirements<br></strong><ul><li>Ability to stand /Sit/walk for long periods of time;</li><li>Ability to travel via plane or train.<br></li></ul><strong>An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability</strong>.<br><br>This job description does not state or imply that the above are the only duties and responsibilities assigned to this position. Employees holding this position will be required to perform any other job-related duties as requested by Management.\n      "
    },
    {
        "position": "Research Intern - Image and Video Algorithms",
        "company": "Kuaishou Technology ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-06-17T18:59:15.868Z",
        "url": "https://www.linkedin.com/jobs/view/research-intern-image-and-video-algorithms-at-kuaishou-technology-2187513828?refId=0xEZ0WN3HGhlRBQShn0%2BWA%3D%3D&trackingId=cMImcSINde5rJvOQlnFPLw%3D%3D&position=18&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <p><strong>Company: Kuaishou TechnologyC</strong></p><p><strong>Position: Research Intern - Image and Video Algorithms&nbsp;&nbsp;</strong></p><p><strong>Location: Palo Alto, CA</strong></p><p>&nbsp;</p><p><strong>About the company:</strong></p><p>Kuaishou is a short video social platform for all users to record and share their lives, with the core mission to \"Capture the World, Share Your Story\" to increase every individual's happiness through Big Data and AI technology.</p><p>&nbsp;</p><p>Kuaishou is one of the world's leading life-sharing community with more than 300 million daily active users and more than 20 billion short videos at the end of January 2020.</p><p>&nbsp;</p><p>Kuaishou enables users to record their daily lives in short videos and share memorable moments as well as interact with followers in real-time through live streaming. For the first time in history, users from all over the world are connected and their stories shared in the form of video at Kuaishou.</p><p>&nbsp;</p><p>You may visit https://usrdc.kuaishou.com/  to learn more about us.</p><p>Contact us: career-us@kuaishou.com&nbsp;</p><p>&nbsp;</p><p><strong>About the position:</strong></p><p>Image and video live everywhere in our life, image and video related algorithms play crucial roles from content creating to consuming in Kuaishou’s ecosystem. The Lab of Advanced Image and Video Algorithms is responsible for researching and developing innovative and optimized solutions to ensure the best user experiences, inspire the creation of more contents, and maintain the highest efficiency on different platforms, including mobile devices and CPU/GPU servers.&nbsp;We are looking for research interns who are excited in developing cutting-edge algorithms and solutions for image/video applications with skills in image/video processing, computational photography, computer vision, and algorithm optimization for both mobile devices and servers.</p><p><strong>&nbsp;</strong></p><p><strong>Job Responsibilities:</strong></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Explore and develop innovative algorithms in the areas of image and video processing, computational photography, computer vision, and deep learning</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Collaborate with other researchers and engineers on algorithm optimization and product integration</p><p><strong>&nbsp;</strong></p><p><strong>Qualifications:</strong></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Graduate student actively pursuing MSc or PhD degree in Computer Science, Electrical Engineering, or related majors</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Familiar with image and video processing, deep learning, computer vision, and/or computational photography</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good communication skills and teamwork</p>\n      "
    },
    {
        "position": "2021 Fall/Winter Graduate Intern - Robotics R&D Center- San Jose",
        "company": "ABB ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-06-17T18:59:19.327Z",
        "url": "https://www.linkedin.com/jobs/view/2021-fall-winter-graduate-intern-robotics-r-d-center-san-jose-at-abb-2613997541?refId=0xEZ0WN3HGhlRBQShn0%2BWA%3D%3D&trackingId=aX3ZXUr%2FUYqnOOcaVJVTsA%3D%3D&position=20&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Take your next career step at ABB with a global team that is energizing the transformation of society and industry to achieve a more productive, sustainable future. At ABB, we have the clear goal of driving diversity and inclusion across all dimensions: gender, LGBTQ+, abilities, ethnicity and generations. Together, we are embarking on a journey where each and every one of us, individually and collectively, welcomes and celebrates individual differences.<br><br>ABB US Robotics R&amp;D Center seeks intern to work at the US Robotics R&amp;D Center in San Jose, CA in various areas of research for limited periods. The internship (or part-time) may last from 3 to 12 months, typically 3 months. Reporting to the R&amp;D Manager, you will be working with robotics specialists who have a wide range of experiences and competencies, including but not limited to industrial robots, mechanics, user-interface design, software development, methodologies implementation for machine learning, computer vision, etc.<br><br>Your responsibilities<br><ul><li>Take part in the development of cut-of-edge algorithms in computer vision and machine learning for intelligent software agents to enable creation of future autonomous robotics.</li><li>Build modular software systems for image processing and machine learning.</li><li>Improve robot performance using 3D vision technology, including algorithms to identify and classify meaningful structures around a robot.</li><li>Develop and integrate advanced perception technologies for robotic applications.<br></li></ul>Your background<br><ul><li>Currently enrolled Masters/PhD student in electrical engineering, computer science or other related engineering fields.</li><li>Strong background in 2D and 3D vision and/or machine learning techniques, such as deep learning, reinforcement learning, etc.</li><li>Experiences in machine learning spanning supervised and unsupervised learning methods and applying ML to real world problems.</li><li>Experience with deep learning frameworks such as Tensorflow, Keras, PyTorch.</li><li>Proficiency in implementing algorithms in C/C++/ Python /GPU.</li><li>Experience with robotics, Linux, ROS, PCL, OpenCV, SLAM.</li><li>Ability to interact effectively with a global team and in culturally diverse environments.</li><li>Credibility/accountability in delivering on quality and schedule commitments.</li><li>Must be currently authorized to work for ABB in the US.<br></li></ul>More about us<br><br>ABB Robotics &amp; Discrete Automation is a pioneer in robotics, machine automation and digital services, providing innovative solutions for a diverse range of industries, from automotive to electronics to logistics. As one of the world’s leading robotics and machine automation suppliers, we have shipped over 500,000 robot solutions. We help our customers of all sizes to increase productivity, flexibility and simplicity and to improve output quality. We support their transition towards the connected and collaborative factory of the future. ABB Robotics &amp; Discrete Automation employs more than 11,000 people at over 100 locations in more than 53 countries. We look forward to receiving your application. If you want to discover more about ABB, take another look at our website www.abb.com. Equal Employment Opportunity and Affirmative Action at ABB ABB is an Equal Employment Opportunity (EEO) and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, creed, color, ancestry, religion, sex, national origin, citizen status, age, sexual orientation, gender identity, disability, marital status, family medical leave status, or protected veterans status. For more information regarding your (EEO) rights as an applicant, please visit the following websites: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf http://www1.eeoc.gov/employers/poster.cfm. http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf As an Equal Employment Opportunity and Affirmative Action Employer, applicants may request to review the Affirmative Action Plan of a particular ABB facility between the hours of 9:00 A.M. - 5:00 P.M. EST Monday through Friday by contacting an ABB HR Representative at 1-888-694-7762. Protected veterans and qualified individuals with a disability may request a reasonable accommodation if you are unable or limited in your ability to use or access ABB's career site as a result of your disability. You may request reasonable accommodations by calling an ABB HR Representative at 1-888-694-7762 or by sending an email to US-AskHR@abb.com. Resumes and applications will not be accepted in this manner.<br><br><strong> 79096203</strong>\n      "
    },
    {
        "position": "Summer Internship",
        "company": "Smart Software Solutions, Inc ",
        "location": {
            "city": " Pierre",
            "state": "SD"
        },
        "posted": "2021-06-03T18:59:32.103Z",
        "url": "https://www.linkedin.com/jobs/view/summer-internship-at-smart-software-solutions-inc-2613414903?refId=kIZLSk2xNDeRGRL1%2FO0yjA%3D%3D&trackingId=rTsw4wyuUxRfp%2Bq9GptkBg%3D%3D&position=3&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Our summer internship program is a preferred opportunity by the University of South Dakota. We have a close working relationship with their computer science department and actively encourage students to enlist in our internship program.<br>We only accept interns who are presently a Quality Assurance Tester and have been accepted into the University's Internship program.<br>During the internship, we will provide the interns with housing in Pierre, SD. There, they will work closely with our Leads and Software Developers in contributing to actual projects. They will be treated as new hire employees and expected to perform all the duties of an entry level Software Engineer.<br>Job Responsibilities<br><br><strong><u>Job Responsibilities Include But Are Not Limited To<br></u></strong><ul><li> Be able to learn from mentors</li><li> Write and implement efficient code</li><li> Maintain and upgrade existing systems</li><li> Regularly communicate with management and colleagues</li><li> Multi-task efficiently to be able to switch from one task to another<br></li></ul>Salaried Employee Benefits<br>Full-time Benefits<br><ul><li> Fulltime Salaried position, paying twice monthly</li><li> Casual Work Atmosphere</li><li> Spacious Office</li><li> Flexible Hours; set your own schedule</li><li> 5 Hours of Paid Time Off accrued per pay period</li><li> 12 Paid Holidays and 5 Optional Holidays</li><li> $300 contributed to monthly health insurance premium</li><li> Simple IRA with 3% contribution match<br></li></ul>\n      "
    },
    {
        "position": "2021 Intern- Battery Test",
        "company": "Aurora Flight Sciences ",
        "location": {
            "city": " Cambridge",
            "state": "MA"
        },
        "posted": "2021-06-25T18:59:43.338Z",
        "url": "https://www.linkedin.com/jobs/view/2021-intern-battery-test-at-aurora-flight-sciences-2618182023?refId=kIZLSk2xNDeRGRL1%2FO0yjA%3D%3D&trackingId=D%2BawF3D99R2PRHEl7nl3Yw%3D%3D&position=10&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Job Brief<br></strong>Aurora Flight Sciences, a Boeing Subsidiary, is seeking qualified Interns to actively participate in real-world assignments, help solve challenging problems and contribute to the development of the next-generation of autonomous aircraft.<br><br>Aurora Flight Sciences, a Boeing Subsidiary, is seeking qualified Interns to actively participate in real-world assignments, help solve challenging problems and contribute to the development of the next-generation of autonomous aircraft.<br><br><strong><u>We Are Seeking Individuals With<br></u></strong><ul> <li>Structures Engineering or related experience.</li> <li>A strong academic record.</li> <li>Experience contributing to a team in a fast-paced, competitive and self-directed environment.</li> <br></ul>The duration of an internship typically lasts 8 - 12 weeks in any one of our sites:<br><br>Manassas, VA Headquarters, Engineering and Product Development<br>Cambridge, MA Research and Development<br>Bridgeport, WV Manufacturing<br>Columbus, MS Manufacturing and Final Assembly<br><br>Aurora offers a competitive compensation, housing and transportation allowance if required. Our mentors and team members guide you through your work, help you integrate in our culture of collaboration and further develop and gain new skills. Finally, during your time with us, we are interested in your input on how we can continue to enhance your experience in an environment of learning and at the end of your internship, we ask you to present your work experience and lessons learned to the company.<br><br><strong><u>Requirements<br></u></strong><ul> <li>Enrollment in bachelor’s program with a focus in Engineering or a related field</li> <li>Experience contributing to a team in a fast-paced/comparative and/or self-directed environment</li> <li>Background knowledge in one of the following areas:<br><ul> <li>Aerospace/General Aviation</li> <li>Flight Physics</li> <li>Aerostructures</li> <li>Computer Science</li> <li>Autonomy</li> <li>Robotics</li> <li>Mechanical Systems</li> <li>Propulsion</li> <li>Manufacturing</li> <li>Systems Engineering</li> </ul> </li> </ul> <strong>Preferred Requirements:<br></strong><ul> <li>Enrollment in a Master’s or PhD program</li> <li>Participation in extracurricular activities</li> </ul> <strong>Physical Requirements:<br></strong><ul> <li>The ability to travel to Aurora locations. </li> <br><br></ul><strong>Aurora’s Mission<br><br></strong>Aurora is a leader in the development and manufacturing of advanced unmanned systems and aerospace vehicles. Our mission is to apply autonomy and robotics to the development, production, and operation of advanced aircraft. We aim to change the way we travel. During the last three decades, Aurora has designed, rapid prototyped, and flown an average of one new vehicle a year for government and commercial customers. Now as an independent subsidiary of Boeing, Aurora’s innovation is combined with Boeing’s size and strength, creating an unprecedented opportunity to disrupt the future of the aerospace industry.<br><br>Come change the future of the aerospace industry with Aurora Flight Sciences.<br><br><strong><u>Aurora Company Overview<br><br></u></strong>Aurora Flight Sciences, a Boeing Company, is a leader in the development and manufacturing of advanced unmanned systems and aerospace vehicles. Our mission is to apply autonomy and robotics to the development, production, and operation of advanced aircraft. During the last three decades, Aurora has designed, rapid-prototyped, and flown an average of one new vehicle a year for both government and commercial customers. Now, as an independent subsidiary of Boeing, Aurora’s innovation is combined with Boeing’s size and strength, creating an unprecedented opportunity to shape the future of aerospace systems.<br><strong>Equal Opportunity Employer<br></strong>Aurora Flight Sciences, A Boeing Company, is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.\n      "
    },
    {
        "position": "Machine Learning (NLP) Internship",
        "company": "Vee ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-01T18:59:46.741Z",
        "url": "https://www.linkedin.com/jobs/view/machine-learning-nlp-internship-at-vee-2608403752?refId=kIZLSk2xNDeRGRL1%2FO0yjA%3D%3D&trackingId=iSg6Ub7jDMxcaQn06dw4Pw%3D%3D&position=12&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Position:</strong> Machine Learning (NLP) Intern (REMOTE)<br><br><strong>Reports to: </strong>CTO<br><br><strong>Location:</strong> Remote<br><br><strong>Are you passionate about exploring where, how, and why data can drive business decisions? Interested in how organizations use analytics and data to innovate, grow and transform? Driven to help establish, define, and evangelize how data science can help drive a strategy? <br><br></strong><strong><u>Company Overview<br><br></u></strong>Vee inspires people to align on <em>Purpose</em> so they can unlock their individual and collective human potential. We are an early stage startup poised for dramatic growth. We specialize in developing ways to drive greater strategic alignment to unlock enterprise innovation and growth. After spending considerable time exploring the need for better alignment models across diverse organizations, we have developed a framework and methodology based on insights from extensive research. We are building products to assess gaps and are offering our consulting services to help 21st century leaders develop and implement their organizational and people strategies, along with the capabilities required to operationalize their <em>Purpose</em> as they transform.<br><br><strong><u>Position Overview<br><br></u></strong>Join our fast-growing team! You will help drive intelligent, insightful, and predictive business results to help Vee and Vee's clients drive value in the realms of people, purpose, and performance. You will help build Vee's data capability and data strategy.<br><br><strong><u>General Responsibilities<br></u></strong><ul> <li>Design and execute <strong>Natural Language Processing</strong> experiments to help advance Vee's strategy </li> <li>Research and run topic analysis on targeted content </li> <li>Scrape targeted content from social media and open Web sources</li> <li>Collaborate with Data Engineering, People Science, business partners, and Chief Technology Officer to create robust <strong>NLP</strong> pipelines using <strong>AWS Comprehend</strong></li> <li>Communicate results and ideas to key stakeholders at Vee</li> <br><br></ul><strong><u>Core Experience &amp; Requirements<br></u></strong><ul> <li>Masters degree in Computer Science, Applied Statistics, Applied math, Data Science, or a related field</li> <li><strong>Previous experience running NLP</strong> projects, ideally in a corporate or startup context </li> <li>Practical experience with multiple statistical languages (SAS, R, Pandas), data processing, database programming, and data analytics</li> <li>Solid background in data mining and statistical analysis</li> <li>Experience with programming languages such as Python and R</li> <li>Knowledge of data visualization tools (e.g. Tableau)</li> <li>Strong collaboration skills - you partner well with others to solve problems and actively incorporate input from various sources</li> <li>Excellent oral and written communication skills</li> <li>Working with key stakeholders to drive business results</li> <br></ul><strong>Profile<br><br></strong>Purpose is what drives you. Your passion for your work has led you here. You are ready to combine your experience with ours to help our client companies gain competitive advantage. You bring strong creative thinking skills in addition to superior communication skills, allowing you to develop creative solutions for any challenge that comes your way.<br><br>You:<br><ul> <li>Love what you do, love to be busy, and love to produce by being organized and methodical</li> <li>Work with a sense of urgency and have a strong drive for results</li> <li>Have the resilience and agility to adapt quickly in a fast-paced environment</li> <li>Work independently as well as collaboratively to stretch thinking into creative solutions</li> <li>Have strong verbal and written communication skills</li> <li>Are excited about and suited for a startup, where you'll be wearing a few hats</li> <li>Are smart and fun with an empathetic nature, which will add to our culture</li> <br><br></ul><strong><u>About Vee<br><br></u></strong>Our founders and team have deep expertise in branding, innovation, design, I/O psychology, organization design, digital &amp; data product development, enterprise software and application development complemented by experience with clients ranging from emerging Silicon Valley unicorns to established leaders in government and the public and private sectors including American Express, Bank of America, BMW, Box, HP, Lowe's, Mastercard, Microsoft, Nissan, Pepsico, Procter &amp; Gamble, SAP and The Clorox Company, among others. For more information, check out our website in transition at https://www.letsvee.com/.\n      "
    },
    {
        "position": "LMC Internships",
        "company": "Lordstown Motors Corporation ",
        "location": {
            "city": " Lordstown",
            "state": "OH"
        },
        "posted": "2021-06-24T18:59:48.556Z",
        "url": "https://www.linkedin.com/jobs/view/lmc-internships-at-lordstown-motors-corporation-2606346890?refId=kIZLSk2xNDeRGRL1%2FO0yjA%3D%3D&trackingId=ZjRTsBafv0s1yLq5aeGd1Q%3D%3D&position=13&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Apply<br><br><strong><u>Description<br><br></u></strong>Lordstown Motors Corp seeks to eliminate inefficiencies that exist in modern work by creating electric vehicles that radically improve the way work gets done. Cost effective for fleets, safer, and designed to be more productive than traditional commercial vehicles, Lordstown pickup trucks and fleet vehicles are built to fix challenges that limit modern work. Our mission is to create the leading electric vehicle epicenter in the region. This plant-combined with the legendary capability of the people who work there-is where we will build the work vehicles of the future. Join us to make a difference!<br>Culture - as a Startup, we are looking for Leaders that want to create an organization and structure where you can make an impact, have your voice heard, ambitious to step up to dynamic challenges and be accountable, for your results.<br><br><strong><u>Intern Job Responsibilities<br></u></strong><ul><li> Understands the overall concept of the company, including the brand, customer, product goals, and all other aspects of service.</li><li> Rotates through our divisions of responsibility and provides ideas to grow and improve the business.</li><li> Accepts designated, business-focus projects to research, propose ideas and solutions, and present final project during the internship.</li><li> Engages with customers or clients and provides service and/or sales.</li><li> Provide suggestions to management for improving customer service and internal processes.</li><li> Learns and becomes proficient on internal software systems.</li><li> Assists in creating reports.<br></li></ul><strong><u>Intern Qualifications / Skills<br></u></strong><ul><li> Verbal communication</li><li> Organization</li><li> Scheduling</li><li> Professionalism</li><li> Customer focus</li><li> Confidentiality</li><li> Possess strong thinking/problem-solving skills which can be applied to business processes with a \"can-do\" attitude<br></li></ul><strong><u>Requirements<br><br></u></strong>We look for leaders with strong academic results who have 1-2 summers before graduating with a BS or MS, Computer Science, Industrial or Computer/Systems Engineering, Information Security, Sales, Marketing, Human Resources, Applied Math, Statistics, Operations Research, Analytics, and MBAs with a technical undergraduate degree or background (or like degrees).<br><br><strong><u>Education, Experience, And Licensing Requirements<br></u></strong><ul><li> In 3rd or 4th year of college student<br></li></ul>OR<br><ul><li> Graduate Student<br></li></ul>\n      "
    },
    {
        "position": "Development Internship - C++, Summer 2022",
        "company": "Akuna Capital ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-06-03T19:00:02.212Z",
        "url": "https://www.linkedin.com/jobs/view/development-internship-c%2B%2B-summer-2022-at-akuna-capital-2628459423?refId=kIZLSk2xNDeRGRL1%2FO0yjA%3D%3D&trackingId=FeVqCTWVdJlWSxuLVXbY8A%3D%3D&position=21&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>About Akuna:<br><br></strong>Akuna Capital is a young and booming trading firm with a strong focus on cutting-edge technology, data driven decisions and automation. Our core competency is providing liquidity as an options market maker – meaning we provide competitive quotes that we are willing to both buy and sell. To do this successfully we design and implement our own low latency technologies, trading strategies and mathematical models.<br><br>Our Founding Partners, including Akuna's CEO Andrew Killion, first conceptualized Akuna in their hometown of Sydney. They opened the firm's first office in 2011 in the heart of the derivatives industry and the options capital of the world – Chicago. Today, Akuna is proud to operate from additional offices in Sydney, Shanghai, and Boston.<br><br><strong>What you'll do as a Development Intern on the C++ Team at Akuna: <br><br></strong>We are seeking Development Interns to join our innovative and growing technology team for our 10-week Akunacademy summer internship program. In this role you will work alongside our trading and software teams to design and implement elegant solutions to complex and interesting problems.<br><br>Development Interns at Akuna have the opportunity to use cutting-edge technology while working on high performance/low latency systems. We offer a team-based approach to trading and software engineering, believing that productive integration of the two groups is vital for success in this industry. Akuna loves Development interns who are self-starters and have the ability to problem solve and think outside of the box. We value innovation and hard work, and want you to make an impact in the firm. Whether you are interested in trading infrastructure, algorithms, models, exchange gateways, performance engineering, hardware, data capture and analysis, or front-end user interfaces, there's work to be done. If you are excited to jump in and make a difference, Akuna could be the place for you.<br><br><strong>The C++ teams </strong>work on applications where C++ is used for computational heavy-lifting and for applications that have timing-critical, low-latency processes such as trading strategies. C++ provides the flexibility and low-level control that our developers need to get maximum performance out of multi-core, super-scalar processors. No previous experience in finance or trading is required. Training and continuous education is provided for all engineers to ensure they have the skills and knowledge needed to be successful.<br><br><strong>Qualities that make great candidates:<br><br></strong><ul> <li>Pursuing a BS/MS/ PhD in Computer Science, Engineering, Math, Physics or related field</li> <li>Experience programming in C++</li> <li>Experience with several of the following -- distributed systems, networking, data structures &amp; algorithms, and operating systems</li> <li>Exposure to scripting and rudimentary data mining and regression analysis, ideally in Python with Pandas and Numpy</li> <li>Strong analytic and problem-solving skills</li> <li>Ability to communicate with the trading team, obtain requirements, find solutions and implement them in a clean and concise way</li> <li>Passion for innovation and building systems from the ground up</li> <li>Ability to adapt to an ever-changing environment</li> <li>Self-starter attitude with the ability to work independently</li> <li>Strong sense of ownership</li> <li>Must be graduating by Summer 2023 or prior</li> <li>Major GPA of 3.0 or above</li> <li>Legal authorization to work in the U.S. is required on the first day of employment including F-1 students using CPT, OPT, or STEM</li> <br></ul><strong><em>Please note:</em></strong><em> If you apply to multiple roles, you may be asked to complete multiple coding challenges and interviews.</em>\n      "
    },
    {
        "position": "Aftersales Technical Training Intern",
        "company": "Porsche Cars North America ",
        "location": {
            "city": " Atlanta",
            "state": "GA"
        },
        "posted": "2021-06-24T19:00:41.592Z",
        "url": "https://www.linkedin.com/jobs/view/aftersales-technical-training-intern-at-porsche-cars-north-america-2610600791?refId=bY4z27ayGrh83QrT58ziYQ%3D%3D&trackingId=bmg1ZE4bNU9iIDtcvInp2g%3D%3D&position=21&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Tasks<br><br></strong><strong><u>Position Objective<br><br></u></strong>Execute administrative functions in support of the Aftersales Technical Training Department.<br><br>Additionally, assist on an ad-hoc basis with various training projects and issues.<br><br><strong><u>Primary Responsibilities<br></u></strong><ul> <li> Assist with documenting business projects related to budgeting, vehicle usage and curriculum planning </li> <li> Review and grade all certification workbooks from the technicians </li> <li> Coordinate with dealers on managing certification testing. </li> <li> Assist with invoices and purchase requisitions </li> <li> Audit, on a weekly basis, fleet management documentation to insure it is current </li> <li> Provide ad-hoc assistance on projects </li> <br><br></ul><strong><u>Qualifications<br><br></u></strong><strong>Education/Skills/Experience/Certifications:<br></strong><ul> <li> Pursuing Bachelor Degree or higher in Business, Communications, Economics, Education, Finance, Computer Science or IT. (minimum of 3 years completed) </li> <li> Excellent communication skills, written and oral. </li> <li> Analytical thinking skills that can comprehend the big picture and drill down to the details. </li> <li> Strong knowledge of MS Office suite applications </li> <li> Background or knowledge in the automotive field is preferred, but not required. </li> <br><br></ul><strong>Exclusive look behind the scenes<br><br></strong>Porsche is an equal opportunity employer and we take pride in our diversity. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at Porsche will be based on merit, qualifications and abilities. Porsche does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, pregnancy, status as a parent, national origin, age, disability, family medical history, ancestry, medical condition, genetic information, sexual orientation, gender, gender identity, gender expression, marital status, familial status, registered domestic partner status, family and medical leave status, military status, criminal conviction history, or any other characteristic protected by federal, state or local law.\n      "
    },
    {
        "position": "Fall 2021- IT Labor Mgmt Intern - 90291087 - Wilmington",
        "company": "Amtrak ",
        "location": {
            "city": " Wilmington",
            "state": "DE"
        },
        "posted": "2021-06-17T19:00:46.730Z",
        "url": "https://www.linkedin.com/jobs/view/fall-2021-it-labor-mgmt-intern-90291087-wilmington-at-amtrak-2606161087?refId=bY4z27ayGrh83QrT58ziYQ%3D%3D&trackingId=%2BP24LD%2F4lF886WEd0IQs8A%3D%3D&position=24&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>Your success is a train ride away.<br><br></strong>Amtrak connects businesses and communities across the country and we move America’s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees.<br><br><strong>Are you ready to join our team?<br><br></strong><strong><u>Summary<br><br></u></strong>Start your career and bring your IT skills to the next level when you join AMTRAK IT Systems Operations Support. We’re looking for an individual who has finished their 1st year of College studying Computer Science or any other discipline within Information Technology. If you enjoy a wide variety of IT efforts and are open to learning different aspects of IT, then you may be the right fit for the role.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Open to learning Mulesoft technologies to assist with efforts.</li> <li>Join project team meetings, collecting meeting minute and action items.</li> <li>Assist with Electronic Data Interface (EDI) project to remove the current EDI off the Mainframe.</li> <li>Assisting with updating Knowledgebase documentation for Service Desk use.</li> <li>Assist with building API, providing end users access to various systems, auditing access and disabling accounts where warranted, and monitoring external vendors certificates</li> <br><br></ul><strong><u>Communication And Interpersonal Skills<br><br></u></strong>Must have excellent oral and written communication skills<br><br><strong>Requisition ID:</strong> 56781<br><strong>Posting Location(s):</strong> Delaware<br><strong>Job Family/Function:</strong> Information Technology<br><strong>Relocation Offered:</strong> No<br><strong>Travel Requirements:</strong> None<br><br><strong> Amtrak employees power our progress through their performance. <br><br></strong>We want your work at Amtrak to be more than a job – we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.<br><br>We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.<br><br>All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. Marijuana, notwithstanding any statute, ordinance, regulation, or other law that legalizes or decriminalizes the use or possession of marijuana, whether for medical, recreational, or other use. Candidates who engage in the usage of marijuana will not be qualified for hire. We appreciate your cooperation in keeping Amtrak safe and drug-free.<br><br>In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.<br><br>Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.<br><br>Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.<br><br>POSTING NOTES: Information Technology || Internships &amp; Co-Ops\n      "
    },
    {
        "position": "IT - Infrastructure Internship (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Fremont",
            "state": "CA"
        },
        "posted": "2021-06-01T19:01:36.887Z",
        "url": "https://www.linkedin.com/jobs/view/it-infrastructure-internship-fall-2021-at-tesla-2607164777?refId=estZTUo9xIsyxXu8bGI%2BBg%3D%3D&trackingId=2hWhRkt5jRkI49WlfL65qw%3D%3D&position=6&pageNum=24&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA</li><li>Palo Alto, CA</li><li>Reno, NV</li><li>Remote<br><br></li></ul><strong><u>About The Team<br><br></u></strong>As an intern you will partner with experienced IT infrastructure and automation engineers to help design, build, and manage the underlying infrastructure that runs various services for all business units.<br><br><strong>IT Infrastructure Departments<br><br></strong><li> Core Infrastructure</li><li> Production Infrastructure</li><li> IT Database Platform</li><li> Engineering IT</li><li> Site Reliability Engineering</li><li> IT Manufacturing Support<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Design, provision &amp; manage core systems, data center &amp; load balancing infrastructure 24/7/365 for all business units in Tesla globally</li><li> Work as a platform engineer resolving complex infrastructure issues working on multitude of technologies simultaneously</li><li> Architect, design and deliver globally scalable Database platform that can support self-service by internal customers</li><li> Provisioning via automation including operational aspects such as backup, monitoring, and supporting on boarded Applications for tuning, DB refreshes via automation and provide consultancy as needed</li><li> Act as primary support contact for network operations support issues and requests at Tesla data center, HQ locations, retail stores, and factories worldwide</li><li> Problem solve network, compute, data bases, storage, and public private cloud issues<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently working towards a BS, MS in Computer Science, Computer Engineering, Information Technology, Information Systems)</li><li> Experience with configuration management systems such as Ansible, Puppet or Terraform is an advantage</li><li> Knowledge of TCP/IP, Linux operating system internals, file systems, disk/storage technologies and storage protocols</li><li> Knowledge on container-based workloads, using Kubernetes or other orchestration software</li><li> Proficiency in a high-level language like Python, Go, Ruby and/or Java</li><li> Knowledge with Ticketing systems</li><li> You must be self-managed and committed to working in a fast-paced environment</li><li> Professional and positive communication skills</li><li> Previous internship and/or project experience is a plus</li><li> This role is based out of Fremont, CA so must be open to relocation</li>\n      "
    },
    {
        "position": "Development Internship - User Interface (C#, Web), Summer 2022",
        "company": "Akuna Capital ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-06-03T19:02:25.893Z",
        "url": "https://www.linkedin.com/jobs/view/development-internship-user-interface-c%23-web-summer-2022-at-akuna-capital-2628457677?refId=KB%2BbEIGYnfHWhwUZN2tS1Q%3D%3D&trackingId=pUgXHCJJqmrhj%2FkoC6z7vw%3D%3D&position=12&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>About Akuna: <br><br></strong>Akuna Capital is a young and booming trading firm with a strong focus on cutting-edge technology, data driven decisions and automation. Our core competency is providing liquidity as an options market-maker – meaning we provide competitive quotes that we are willing to both buy and sell. To do this successfully we design and implement our own low latency technologies, trading strategies and mathematical models.<br><br>Our Founding Partners, including our global CEO Andrew Killion, first conceptualized Akuna in their hometown of Sydney. They opened the firm's first office in 2011 in the heart of the derivatives industry and the options capital of the world – Chicago. Today, Akuna is proud to operate from additional offices in Sydney, Shanghai, and Boston.<br><br><strong>What you'll do as a Development Intern on the User Interface Team at Akuna:<br><br></strong>We are seeking Development Interns to join our innovative and growing technology team at Akuna. In this role you will work directly with traders, quants, and other software developers to design, build, test, and maintain real-time data visualization tools. As a Development Intern on the UI Team, you'll be part of a knowledgeable, collaborative, and motivated engineering team made up of both C# and Web Developers.<br><br><strong>C# Developers: <br><br></strong>As a C# Development Intern, you'll learn to write high performance C# applications, help develop and fine tune our existing systems and work towards developing our next-gen UI solutions. The UI team uses C# to create multithreaded user interfaces which handle high volumes of data and provide traders with a real-time view of the markets. Performance is key and we're always looking for more efficient and innovative ways to view the markets.The applications you build will aid traders in understanding market conditions, assessing risk and managing other components in our system.<br><br>The ideal C# Development candidate would have experience using a C-style object-oriented programming language: <strong>C#, Java, and/or C++</strong>.<br><br><strong>Web Developers: <br><br></strong>As a Web Developer, you'll write Python-powered back-ends and dynamic JavaScript front-ends. Using Javascript (React.js, Redux and more) and Python (with Tornado), you'll help improve our existing visualization tools and develop new and innovative ways of displaying key information to traders, providing them with real-time applications to assist them in making accurate decisions. The tools you build will also aid traders in managing volatility, assessing risk, and fine-tuning the parameters of our system.<br><br>The ideal Web Development candidate will have experience using a modern web programming language: <strong>Javascript, Python, and/or experience with HTML/CSS</strong>. Familiarity with REST interfaces, WebSockets / Server push, Linux, git, scrum etc. is also a plus.<br><br><strong>Qualities that make great candidates for the UI team:<br><br></strong><ul> <li>BS/MS/PhD in Computer Science, Engineering, Math, Physics or related field completed upon employment</li> <li>Strong analytic and problem-solving skills</li> <li>Familiarity with network and concurrent programming is a plus</li> <li>An interest in user interface technologies and UX</li> <li>Excellent communication skills and an ability to collaborate with the team to develop innovative solutions</li> <li>Ability to adapt to an ever-changing environment</li> <li>Knowledge of / willingness to learn about finance (derivatives, exchanges, market-making etc.)</li> <li>Self-starter attitude with the ability to work independently</li> <li>Major GPA of 3.0 or above</li> <li>Must be graduating Summer 2023 or prior</li> <li>Legal authorization to work in the U.S. is required on the first day of employment including F-1 students using OPT or STEM</li> <br></ul><strong><em>Please note:</em></strong><em> If you apply to multiple roles, you may be asked to complete multiple coding challenges and interviews.</em>\n      "
    },
    {
        "position": "Intern-Research",
        "company": "Scripps Research ",
        "location": {
            "city": " La Jolla",
            "state": "CA"
        },
        "posted": "2021-05-02T19:02:32.426Z",
        "url": "https://www.linkedin.com/jobs/view/intern-research-at-scripps-research-2527435868?refId=KB%2BbEIGYnfHWhwUZN2tS1Q%3D%3D&trackingId=%2BqZyGd2%2B495RSxEMCEGxyg%3D%3D&position=16&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>ABOUT US: </u></strong>Scripps Research is ranked the most influential institution in the world for its impact on innovation. We expand basic knowledge in the biosciences, and use these fundamental advancements to develop profound innovations that improve wellbeing. Our educational and training programs mold talented and committed students and postdocs into leading edge scientists. Scientists in the institute’s five academic research departments work hand-in-hand with researchers of the Scripps Research Translational Institute and Calibr to merge foundational studies in biology, chemistry and computer science with translational science to produce pioneering drugs and advances in digital and precision medicine. Together, we cultivate new scientific leaders and expand the frontiers of knowledge to deliver medical breakthroughs to better human health around the globe. If you have a passion for making a difference, this could be your opportunity to join our transformative team.<br><br><strong><u>POSITION TITLE:</u></strong> Intern-Research<br><br><strong><u>Position Summary<br><br></u></strong>The lab of Ilia Droujinine at the Scripps Research Institute is hiring a highly motivated Intern. We are a young lab aiming to develop novel methods to identify and characterize secreted factors that coordinate organ and organism functions in homeostasis and disease, with an emphasis on the mouse system (https://www.nature.com/articles/s41467-021-22599-x). To learn more please visit scripps.edu/droujinine. Ideal candidates will perform general laboratory maintenance, mammalian cell culture, mouse and/or <em>Drosophila</em> stock maintenance. The hired candidate may perform techniques including quantitative PCR genotyping, setting up matings/crosses, TMT mass spectrometry, metabolomics, western blot, pulldowns, DNA cloning, immunostaining, confocal microscopy, high throughput screens, bioinformatic data analysis.<br><br><strong><u>Additional Information<br><br></u></strong>Position is estimated to start June 1, 2021 and continues through the 2021-2022 school year.<br><br>Part-time: Up to 19 hours per week, up to 40 hours per week when school is not in session.<br><br>This position is not eligible for benefits.<br><br>This is a year-round position, not a summer intern or other short-term internship.<br><br><strong><u>COMPENSATION: </u></strong> $14.00 hourly<br><br><strong><u>Requirements<br></u></strong><ul><li>Requires current enrollment in either a high school or college/university educational program. Undergraduate enrolled in a relevant scientific program, e.g., biological or life science, strongly preferred.</li><li>Interest in cutting edge biological research</li><li>Some laboratory experience in biology, chemical biology, biological engineering, or related discipline (relevant courses may be considered for laboratory experience)</li><li>High motivation and independence in reading scientific literature and performing experiments</li><li>Experience in basic biologic techniques, mammalian cell culture or mouse experience and experience with techniques outlined in the position summary preferred.<br></li></ul>This position works in a laboratory or vivarium environment. Further details of the physical requirements of established essential functions for this position will be addressed/discussed during the interview process.<br><br><em>The above statements describe the level of work performed and expected in general terms. The statements are not intended to list all the responsibilities, duties and/or skills required of employees so classified, and the content herein is subject to change due to the business needs of Scripps Research, with or without notice. Furthermore, nothing in this job description shall be interpreted to be in conflict with or to eliminate or modify in any way the employment-at-will status of Scripps Research staff.<br><br></em><strong><u>EEO Statement<br><br></u></strong><em>Scripps is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.</em>\n      "
    },
    {
        "position": "Internal Audit Manager, Technology",
        "company": "DraftKings Inc. ",
        "location": {
            "city": " Las Vegas",
            "state": "NV"
        },
        "posted": "2021-06-01T19:02:34.400Z",
        "url": "https://www.linkedin.com/jobs/view/internal-audit-manager-technology-at-draftkings-inc-2598549044?refId=KB%2BbEIGYnfHWhwUZN2tS1Q%3D%3D&trackingId=7zlAMFWWIiZfkUyc6635nw%3D%3D&position=17&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong>We are DraftKings.<br><br></strong>We’re inspired by our shared passion for developing creative solutions to complex challenges and empowering the people around us to do their best work. We are industry leaders in the digital entertainment and technology space propelled by constant curiosity and diverse perspectives.<br><br>Our teams are fueled by innovation. We are looking ahead, building what’s next, and continuously reinventing the industry. We’re a publicly traded (NASDAQ: DKNG) technology company headquartered in Boston, with teams around the world and an expanding global presence.<br><br><strong>The strategy behind the game.<br><br></strong>DraftKings is building our first Internal Audit team to lead the effort to develop a Sarbanes-Oxley (SOX) compliance program. More immediately, the Internal Audit Manager, Technology will play a critical role in the initial and then ongoing effort to ensure the company complies with SOX.<br><br>Overall, this role will be responsible for all aspects of the DraftKings technology control environment, including the identification and mitigation of risk throughout the organization, including engineering, security operations, product, platform, site reliability, business intelligence, R&amp;D (not just SOX). With our business and technologies changing as rapidly as they are, DraftKings Internal Controls need to be as nimble to ensure our controls are mitigating the risks.<br><br><strong><u>What You’ll Do As Internal Audit Manager, Technology<br></u></strong><ul><ul><li>Perform assessments of in-scope systems, processes, and controls to verify that technology controls are optimized.</li><li>Update technology SOX process documentation and risks &amp; controls matrices to reflect the current environment. </li><li>Perform process and control assessments for new acquisitions, divisions, and locations new to SOX scope for potential IT general controls, application controls, and process improvements.</li><li>Perform the annual SOX scoping exercise to determine if any changes to systems, applications, or related business processes should be considered.</li><li> Provide regular updates regarding the status of SOX testing.</li><li>Serve as the interface with the external IT audit team and our various technology teams regarding technology SOX matters.</li><li>Understand the general computing control structure and be able to apply that knowledge to supporting business processes. </li><li>Improve the efficiency and effectiveness of department operations through continuous improvement. <br><br></li></ul></ul><strong><u>What Skills You Will Use<br></u></strong><ul><ul><li>Ideally, you have at least 7 years of related work experience.</li><li>Experience in SOX and technology auditing.</li><li>CISA, CISM, CISSP, CPA/CA, CIA, or CFE certification required.</li><li>Knowledge of SDLC, ERP, systems implementations, including the agile development methodology and general computing controls required.</li><li>Experience in Amazon Web Services (AWS), service-oriented architecture (SOA) NetSuite, and Coupa preferred.</li><li>Bachelor's degree in Computer Science, Information Systems, Information Technology, Accounting, Business, or related field.</li><li>Knowledge of COBIT, ITIL, ISO is a plus.</li><li>You are able to travel domestically and internationally (up to 15%).<br><br></li></ul></ul><strong>Join Us!<br><br></strong>We strive to create a place where all feel safe, empowered, engaged, championed, and inspired. DraftKings is proud to be an equal opportunity employer. This means we do not tolerate discrimination of any kind and are committed to providing equal employment opportunities regardless of your gender identity, race, nationality, religion, sexual orientation, status as a protected veteran, or status as an individual with a disability.<br><br>Ready to build what’s next? <strong>Apply now.<br><br></strong>As a regulated gaming company, you may be required to obtain a gaming license issued by the appropriate state agency as a condition of employment.<br><br>\n      "
    },
    {
        "position": "PHP & Java Intern",
        "company": "Internet Brands ",
        "location": {
            "city": " Los Angeles",
            "state": "CA"
        },
        "posted": "2021-05-02T19:02:40.941Z",
        "url": "https://www.linkedin.com/jobs/view/php-java-intern-at-internet-brands-2534712261?refId=KB%2BbEIGYnfHWhwUZN2tS1Q%3D%3D&trackingId=qMsiyDvX0HtaVoEJZG%2FQeg%3D%3D&position=21&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Description<br><br></u></strong>Los Angeles based Internet Brands is currently seeking PHP and Java Interns to join our Web development team. We are looking for innovative PHP and Java Interns who love the Internet and social media.<br><br>Our PHP and Java Interns work directly with development teams on consumer facing websites.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Design and code new features and enhancements.</li><li> Assist with all aspects of the product lifecycle, from specifications through QA.</li><li> Collaborate on finding and fixing bugs.<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Completed or working towards a B.S. or M.S. in Computer Science or related field.</li><li> Strong programming skills (Java, .Net, PHP).</li><li> Strong CSS skills and some web design skill preferred.</li><li> Excellent problem solving skills.</li><li> Strong familiarity with Web 2.0 and social networking websites.<br></li></ul><strong><u>About Internet Brands<br><br></u></strong>Headquartered in El Segundo, Calif., Internet Brands® is a fully integrated online media and software services organization focused on four high-value vertical categories: Health, Automotive, Legal, and Home/Travel. The company's award-winning consumer websites lead their categories and serve more than 250 million monthly visitors, while a full range of web presence offerings has established deep, long-term relationships with SMB and enterprise clients. Internet Brands' powerful, proprietary operating platform provides the flexibility and scalability to fuel the company's continued growth. Internet Brands is a portfolio company of KKR and Temasek. For more information, please visit www.internetbrands.com.<br><br>Internet Brands and its wholly-owned affiliates are an equal opportunity employer.\n      "
    },
    {
        "position": "Lk Chas Information Technology Co-op/Intern",
        "company": "CITGO ",
        "location": {
            "city": " Westlake",
            "state": "LA"
        },
        "posted": "2021-06-03T19:02:50.608Z",
        "url": "https://www.linkedin.com/jobs/view/lk-chas-information-technology-co-op-intern-at-citgo-2618216273?refId=KN%2BoVpdrBEvENU4OpLPOCg%3D%3D&trackingId=PUh4ZdPwy8e4EYhLtItkwA%3D%3D&position=2&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Relocation Benefits are available for this position.<br><br>Employer will not sponsor visas for position<br><br>Headquartered in Houston, Texas, CITGO Petroleum Corporation is a recognized leader in the refining industry with a well-known brand. CITGO operates three refineries located in Corpus Christi, Texas; Lake Charles, La.; and Lemont, Ill., and wholly and/or jointly owns 42 terminals, six pipelines and three lubricants blending and packaging plants. With approximately 3,400 employees and a combined crude capacity of approximately 769,000 barrels-per-day (bpd), CITGO is ranked as the sixth-largest, and one of the most complex independent refiners in the United States. CITGO transports and markets transportation fuels, lubricants, petrochemicals and other industrial products and supplies a network of approximately 4,600 locally owned and operated branded retail outlets, all located east of the Rocky Mountains. CITGO Petroleum Corporation is owned by CITGO Holding, Inc.<br><br>The Information Technology Co-op/Intern will be introduced to the Refinery and the Information Technology Department. They will become familiar with IT policies, processes, and procedures, and will provide assistance to technical projects and services throughout their assignment.<br><br><strong><u>Job Responsibilities<br></u></strong><ul><li>Performs and assists with hardware/software evaluations and implementations</li><li>Hardware/Software troubleshooting and user support</li><li>Workstation lease replacements</li><li>Testing and execution of Windows 10, MS Office365, and MS OneDrive upgrades</li><li>Custom application and database development, maintenance, and support</li><li>SharePoint team site development, support, and security analysis</li><li>Additional projects may be assigned, with regular status reports required</li><li>End of term presentation expected<br></li></ul><strong><u>Minimum Requirements<br></u></strong><ul><li>Currently enrolled in an accredited degree program pursuing a bachelor's degree in Computer Science or closely related field</li><li>Overall GPA of 3.0 or above (A=4.0) (Must provide proof of current GPA at time of hire to verify education requirements are met)</li><li>Must have completed at least 60 credit hours (JR or SR classification)</li><li>Valid Driver's License </li><li>The Maritime Transportation Security Act requires all persons who will need unescorted access to a regulated facility to have a valid Transportation Worker Identification Credential (TWIC), issued in accordance with the rules established by the United States Coast Guard and the Transportation Security Administration. Candidates selected for employment must meet eligibility criteria to obtain a TWIC card. To obtain more information on the Transportation Worker Identification Credential (TWIC), please visit the Transportation Security Administration’s website https://www.tsa.gov/for-industry/twic.<br></li></ul><strong><u>Preferred Skills<br></u></strong><ul><li>Windows 10</li><li>MS Office</li><li>SharePoint</li><li>Application Development</li><li>Database Management<br></li></ul>(Equal Opportunity Employer)\n      "
    },
    {
        "position": "Backend Engineer Internship, Autopilot (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-06-03T19:03:03.512Z",
        "url": "https://www.linkedin.com/jobs/view/backend-engineer-internship-autopilot-fall-2021-at-tesla-2611800898?refId=KN%2BoVpdrBEvENU4OpLPOCg%3D%3D&trackingId=VhT1%2B8Not8KkITx1qZUZow%3D%3D&position=10&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>The Role<br><br></u></strong>As a member of the Autopilot AI Tooling team, you will design and implement a diverse set of tools that power our machine learning workflows. You will work closely with some of the best, world-class AI researchers and machine learning experts towards Tesla’s goal of a self-driving future.<br><br>The AI Tooling team is a central part of Autopilot AI. The systems you build will have a large impact on the entire lifecycle of model development. This includes data processing, data discovery, annotation, and visualization. This also includes tools that help us automate the entire workflows of training, validation, and productionization of our Autopilot neural networks.<br><br>As an engineer on the AI Tooling team, you bring top-notch software engineering skills and can contribute to our tooling systems immediately. Knowledge of machine learning, computer vision, or neural networks is a plus but not required. That can be learned on the job as you work with our machine learning experts. A strong candidate for the AI Tooling team will either be an excellent software generalist, or someone who is exceptionally strong in either backend or frontend engineering.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Design and implement large-scale data processing pipelines that handle a diverse set of Autopilot related data such as images, sensor inputs, and human labels. </li><li>Design and implement tools, tests, metrics, and dashboards to accelerate the development cycle of our model training. </li><li>Work closely with frontend engineers to seamlessly integrate with backend systems. </li><li>Work closely with AI researchers to support evolving research projects and implement new production features. <br><br></li></ul><strong><u>Requirements<br></u></strong><ul><li>BS/MS in Computer Science or related field, or equivalent industry experience. </li><li>Strong knowledge of at least one programming language related to data engineering, such as Python or Scala is required. </li><li>Experience with scientific computing libraries such as numpy, pandas, or scikit-learn is a plus. </li><li>Experience with big data systems such as Spark, Hadoop/MapReduce is a plus. </li><li>Experience with cloud computing such AWS EC2/S3/RDS is a plus. </li><li>Experience with ElasticSearch or other scalable search systems is a plus. </li><li>Experience with real-time data processing is a plus. </li><li>Knowledge of machine learning, computer vision, or neural networks is a plus but not required.</li></ul>\n      "
    },
    {
        "position": "Adjunct Intern Supervisor Pool - College of Education (19-20, 20-21)",
        "company": "Athens State University ",
        "location": {
            "city": " Athens",
            "state": "AL"
        },
        "posted": "2021-04-02T19:03:10.105Z",
        "url": "https://www.linkedin.com/jobs/view/adjunct-intern-supervisor-pool-college-of-education-19-20-20-21-at-athens-state-university-2530579509?refId=KN%2BoVpdrBEvENU4OpLPOCg%3D%3D&trackingId=EHh%2BjzE7ffHSEvFxjkAJDQ%3D%3D&position=14&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <strong><u>Department/College<br><br></u></strong>College of Education<br><br><strong><u>Position Title<br><br></u></strong>Adjunct Intern Supervisor Pool - College of Education (19-20, 20-21)<br><br><strong><u>Job Category<br><br></u></strong>Faculty<br><br><strong><u>Posting Number<br><br></u></strong>00216<br><br><strong><u>Flsa<br><br></u></strong>Exempt<br><br><strong><u>Full Or Part Time<br><br></u></strong>Part-Time<br><br><strong><u>Temporary<br><br></u></strong>Yes<br><br><strong><u>If Temporary, Number Of Months<br><br></u></strong>varies by semester<br><br><strong><u>Duties<br><br></u></strong>Athens State University invites applications for adjunct intern supervisor positions within the city and county school systems for the following areas: Jackson County, AL, Lauderdale County, AL, Madison County, AL, Jefferson County, AL, Franklin County, AL, and Lincoln County, TN. These positions are part-time, non-tenured positions, supervising an assigned number of undergraduate students completing their internship (student teaching) per semester. Previous teaching is preferred, but not required.<br><br><strong><u>Qualifications<br><br></u></strong>Minimum requirements include a Master’s degree with 18 graduate semester hours in the teaching discipline.<br><br><strong><u>Salary Schedule<br><br></u></strong>Salary is based upon number of assigned students as determined by the University. No benefits are offered for this temporary position.<br><br><strong><u>University Information<br><br></u></strong>Located in historic Athens, Alabama, Athens State University offers junior and senior-level coursework to community college graduates and transfer students holding sufficient credits from other institutions. Presently, over 3,100 students have selected Athens State because of its neighborly environment where 50 major and degree programs are offered with courses taught by a supportive and exceptional faculty. Approximately 80% of the students are enrolled in at least one online course. The typical student is a working adult who commutes. Recently, the University was featured in the 2015 Best Value Online College Rankings by OnlineU.org for four online programs including computer science, accounting, education and human resources. The University offers undergraduate degree programs in Liberal Arts, Teacher Preparation, and Business. The University employs more than 350 full and part-time employees with approximately 90 full-time faculty members in three colleges: College of Arts and Sciences, College of Business, and College of Education. Seventy-five percent of the full-time faculty members hold a terminal degree. The University is accredited by the Southern Association of Colleges and Schools Commission on Colleges.<br><br>Athens, Alabama is located in north Alabama equidistant between Nashville, TN and Birmingham, AL. Athens is home to several events and festivals that have been featured as the Southeast Tourism Society’s “Top 20 Events in the Southeast” including the Athens Storytelling Festival and the Tennessee Valley Old Time Fiddlers Convention.<br><br><strong><u>EEO Statement<br><br></u></strong>Non-Discrimination Policy Statement Athens State University, as an equal opportunity/affirmative action institution, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. Athens State University does not discriminate on the basis of race, color, national origin, age, marital status, gender, gender identity, gender expression, pregnancy, sexual orientation, disability, religion, genetic information, or veteran status in employment, or admissions to or participation in educational programs and activities. Inquiries or concerns may be addressed to the Office of the Vice President of Enrollment and Student Support Services, 300 N. Beaty St., Athens, AL 35611, 256- 233-8175.<br><br><strong><u>Background Check Statement<br><br></u></strong>In accordance with Athens State University Policy and guidelines, the applicant chosen for employment will be required to sign a consent form for a criminal background check. Employment will be contingent upon the receipt of a clearance notification from that criminal background check.<br><br><strong><u>Open Until Filled<br><br></u></strong>Yes<br><br><strong><u>Special Instructions To Applicants<br><br></u></strong>Unofficial transcripts should be from the college or university which verifies minimum qualifications for the position. Upon an offer of employment, official transcripts from all colleges and universities attended must be submitted. Continued employment is contingent upon receipt of transcripts from all colleges and universities attended.<br><br>Please provide contact information for three professional references on your application<br><br><strong><u>Additional Information<br><br></u></strong>Athens State University participates in the E-verify System to verify employment eligibility for all newly-hired employees.<br><br>You are applying to an applicant pool. Adjunct Intern Supervisors are hired each semester as needed. The number of students to supervise will vary each semester.<br><br>For continued consideration, it is suggested that applicants apply every two years.<br><br>For assistance, contact the Human Resources Office at 256-216-3333 or email us at employment@athens.edu.\n      "
    },
    {
        "position": "Intern-Compiler Testing",
        "company": "Futurewei Technologies, Inc. ",
        "location": {
            "city": " Santa Clara",
            "state": "CA"
        },
        "posted": "2021-06-01T19:03:27.601Z",
        "url": "https://www.linkedin.com/jobs/view/intern-compiler-testing-at-futurewei-technologies-inc-2605977863?refId=KN%2BoVpdrBEvENU4OpLPOCg%3D%3D&trackingId=SQeDMbrWM6N3hM%2BFZ5bKIw%3D%3D&position=25&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Futurewei Technologies based in Santa Clara, CA is actively pursuing innovative ideas and different new and disruptive technologies. For one of our projects in the Silicon Valley Infrastructure Software Technology Lab we are seeking an intern with research experience in Compiler Testing and Quality Assurance. The ideal candidate will have experience compiling C and C++ programs and identifying defects in compilers.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li> Work closely with a group of compiler engineers working on open source compilers </li> <li> Identify and collect C and C++ test suites and use them to test the subject compiler for correctness and stability </li> <li> Set up test harnesses within the continuous integration development environment </li> <li> Ensure good test coverage based on the functionalities provided by the subject compiler </li> <li> Identify compiler defects from the testing and submit issues for compiler engineers to resolve </li> <li> Put up regression tests for past known defects to catch potential re-occurrence </li> <li> Compile statistics to ensure continuous progress towards production quality </li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li> Graduate students in computer science with strong programming background </li> <li> Good understanding of the C and C++ language </li> <li> Experience compiling programs using the GNU and LLVM compilers </li> <li> Experience using debuggers to debug programs </li> <li> Experience working with makefiles and scripting languages </li> <li> Experience reading assembly languages of the mainstream CPUs is an advantage </li> <li> Strong communication skills, both verbal and written </li> <br><br></ul><strong> Futurewei Technologies, Inc . </strong> <strong> is proud to be an Equal Opportunity Employer.<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n      "
    },
    {
        "position": "Product Management Intern - Hardware",
        "company": "Formlabs ",
        "location": {
            "city": " Somerville",
            "state": "MA"
        },
        "posted": "2021-06-03T19:03:45.082Z",
        "url": "https://www.linkedin.com/jobs/view/product-management-intern-hardware-at-formlabs-2621948328?refId=pVThObU9JhhKDrcH6TbzNA%3D%3D&trackingId=gZv%2B0wauCZNU4LD2zQyxaQ%3D%3D&position=11&pageNum=27&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        To reinvent an industry, you have to build the best team. <strong>Join Formlabs</strong> if you want to bring groundbreaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world.<br><br>The product team at Formlabs helps guide hardware, materials, and software products to completion. From defining the requirements for new products, determining features and user experience, and following products through development all the way to shipping, the Product team is looking for someone with instincts for product development, who is ready to help us develop great hardware, materials, and digital experiences.<br><br>If you want to evaluate user needs for our products through market research, use your findings to provide insights on essential decisions, and connect our designers and engineers to the voice of the customer, we want you as our <strong>Hardware Product Intern</strong>.<br><br><strong>The Job:<br><br></strong><ul> <li>Evaluate user needs for our products</li> <li>Conduct user and market research</li> <li>Collect and analyze data from our resources to understand how our customers are using their printers</li> <li>Collaborate across multiple diverse teams</li> <br></ul><strong>You:<br><br></strong><ul> <li>Have an analytical or research background</li> <li>Highly curious and creative</li> <li>Data-driven and self-motivated to accomplish tasks</li> <li>Have some technical and lab experience</li> <li>Value collaboration with internal partners</li> <li>Inspire with your projects and are always aiming to push something further</li> <br></ul><strong>Bonus Skills</strong> (Optional):<br><br><ul> <li>Background in engineering, computer science, materials, or chemistry</li> <li>Experience with user research, market research, or product management</li> <br></ul><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br></em><strong><em>Even if you don't check every box, but see yourself contributing, please apply.</em></strong><em> Help us build an inclusive community that will change the face of 3D printing.</em>\n      "
    },
    {
        "position": "QA Engineer - Intern",
        "company": "Domo, Inc. ",
        "location": {
            "city": " American Fork",
            "state": "UT"
        },
        "posted": "2021-06-01T19:04:00.984Z",
        "url": "https://www.linkedin.com/jobs/view/qa-engineer-intern-at-domo-inc-2617680140?refId=pVThObU9JhhKDrcH6TbzNA%3D%3D&trackingId=1oi8fkShZ6XmZ54VJ2SXIQ%3D%3D&position=21&pageNum=27&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        We are Domosapiens- uniquely skilled, passionate data lovers anchored in a culture of connectivity. We are transforming the way business is managed by putting real-time data into the hands of every decision-maker across organizations. Diversity is valued here because homogenized teams create echo chambers; and nobody benefits from that. The insight garnered from diverse backgrounds, perspectives, and lived experiences results in pioneering innovations across the organization and better experiences for our customers. The more diverse our talent, the more impactful the Domosphere becomes.<br><br><strong><u>Position Summary<br><br></u></strong>As a QA Intern you will be helping with both manual and automated regression tests and help design and build features that customers want and want to use. This position will also help gather feedback from customers, designers, and developers to help ensure a quality experience.<br><br><strong><u>Key Responsibilities<br></u></strong><ul> <li>Take broad, conceptual ideas and designs to create both manual and automated regression test suites that prove and maintain feature viability;</li> <li>Maintain high standards for App platform while moving new and existing projects/features from R&amp;D to Production;</li> <li>Contribute to high-level strategic decisions to help design and build the features customers want and want to use;</li> <li>Partner with product managers and engineers to oversee the user experience of a product from conception to launch;</li> <li>Give and solicit feedback from customers, designers and developers in order to continually raise our bar for quality;</li> <li>Design and build custom applications using our platform to prove out new and existing functionality.</li> <br><br></ul><strong><u>Job Requirements<br></u></strong><ul> <li>Good working knowledge of at least 1 object oriented programming language;</li> <li>Demonstrated aptitude for learning new technologies;</li> <li>Ability to communicate and interface with technical and non-technical members of the organization;</li> <li>Working on a College degree in Computer Science, Information Systems, or related field and/or equivalent combination of experience and education;</li> <li>Experience in BI, SaaS, and SQL are a plus.</li> <br></ul><strong>Domo is an equal opportunity employer.</strong>\n      "
    },
    {
        "position": "Student Trainee (Data Scientist) GS-1599-07/09 (Intern) with Security Clearance",
        "company": "ClearanceJobs ",
        "location": {
            "city": " Alexandria",
            "state": "VA"
        },
        "posted": "2021-06-24T19:04:41.817Z",
        "url": "https://www.linkedin.com/jobs/view/student-trainee-data-scientist-gs-1599-07-09-intern-with-security-clearance-at-clearancejobs-2621564038?refId=niBr9cR%2FWLBK0dHRsIrb8w%3D%3D&trackingId=XKUVf9%2BpDXDzhF%2F7YGw0QA%3D%3D&position=22&pageNum=28&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        Duties Summary This is an interdisciplinary Student Trainee (Data Scientist) position for use in any one of the program offices across the Foundation, with responsibility for data science work to design, develop, and adapt analytic and quantitative methods and techniques to research, analyze, interpret, evaluate assignments to enhance the mission and increase the efficiency and effectiveness of NSF programs. Learn more about this agency Responsibilities As a Student Trainee (Data Scientist) you will: <li> Conduct statistical analysis, modeling, and simulation to identify efficiencies in NSF programs and operations by researching, analyzing, interpreting, and evaluating difficult, but well precedented assignments.<br></li><li> Develop analytical approaches and analyzes data of qualitative, quantitative, structured, and data types using established techniques to select and modify appropriate methods of operation, analyze, and interpret results, and prepare reports.</li><li> Develop and monitor the application of models, tools, risk, and decision science techniques, operations research, mathematics, statistics, computer, and information sciences, economics, and related fields (e.g., quantitative policy analysis, data science, etc.) to develop and enhance NSF analytic capabilities under the guidance of a higher graded employee. </li><li> Manipulate existing databases using a relational database management system (Oracle, Microsoft Access, MySQL, SQL Server, VBA, Python, R, Tableau, Qlik, JavaScript, etc.) and information technology to accomplish projects, designs, plans, and reports under the guidance of a higher graded employee. Competencies:</li><li> Data Wrangling</li><li> Data Visualization</li><li> Mathematical Reasoning</li><li> Communicating Results</li><li> Oral Communication</li><li> Written Communication Travel Required Not required Supervisory status No Promotion Potential 09 - This position has a full performance level of GS-9 * Job family (Series) 1599 Mathematics And Statistics Student Trainee * Requirements Help Requirements Conditions of Employment * Background investigation. * Selective Service registration required for male applicants, unless exempt. * You must have a cumulative GPA of 2.5 or higher on a 4.0 scale. * You must be taking at least a half-time course load. It is NSF policy that NSF personnel employed at or IPAs detailed to NSF are not permitted to participate in foreign government talent recruitment programs. Failure to comply with this NSF policy could result in disciplinary action up to and including removal from Federal Service or termination of an IPA assignment and referral to the Office of Inspector General. Foreign Talent Definitions </li><li> Eligible students must be enrolled at least half-time in an accredited academic institution &amp; maintain a cumulative 2.5 GPA or higher.</li><li> Students may be hired for Internship positions at any time during the year, &amp; may work full-time or part-time based on office needs.</li><li> Students will be on indefinite appointments during their period of eligibility under the Internship Program.</li><li> Interns will be required to sign an agreement that outlines the parameters of the Internship Program.</li><li> The Internship Program allows students an opportunity to be converted non-competitively to a career-conditional or term position once the student completes all requirements of the Internship Program.</li><li> Noncompetitive conversion to a permanent or term position is NOT guaranteed. The Intern's eligibility for conversion does not guarantee that the agency will opt for conversion.</li><li> Interns may be required to submit updated transcripts and proof of enrollment upon selection. From the closing date of this vacancy announcement, applicants MUST have at least one year remaining in their required coursework for completion of their degree. Experience refers to paid &amp; unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) &amp; other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills &amp; can provide valuable training &amp; experience that translates to paid employment. You will receive credit for all qualifying experience, including volunteer experience. All qualification requirements must be met by the closing date of the announcement. You must answer all job-related questions in the eRecruit questionnaire. All online applicants must provide a valid email address. If your email address is inaccurate or your mailbox is full /blocked, you may not receive important communication that could affect your consideration for this position. This position is in the bargaining unit. Qualifications For all grade levels, you must possess the basic education and/or experience requirement as follows: 1. Degree: Mathematics, statistics, or actuarial science. The degree must be in a major field of study (at least at the baccalaureate level) that is appropriate for the position. OR 2. Combination of education and experience: Courses equivalent to a major, as shown in 1 above, plus appropriate experience or additional education. In addition to meeting the basic education requirement described above, you must have: For the GS-7 level, you must have at least 1 year of specialized experience equivalent to the GS-5 level in the Federal service. Examples of specialized experience include: Analyzing qualitative, quantitative, and structured data; performing routine scientific, or technical tasks and projects; planning and collaborating with stakeholders and customers to identify the appropriate data, methodological approach, and design for a variety of data science or analytics project; OR Have a bachelor's degree in Mathematics, statistics, actuarial science, or a field directly related and meets the superior academic achievement which is (1) being in the upper third of graduating class; or (2) have a GPA of 3.0 or higher; or (3) national honor society membership; OR Have at least 1 year of progressively higher graduate level education in Mathematics, statistics, actuarial science, or a field directly related; OR Have combinations of successfully completed graduate level education and specialized experience that meets the total experience requirements. For the GS-9 level, you must have at least 1 year of specialized experience equivalent to the GS-7 level in the Federal service. Examples of specialized experience include: Analyzing, Interpreting, and correlating qualitative, quantitative, and structured data; applying project management principles; performing routine scientific, or technical tasks and projects; using and manipulating existing databases and relational database systems; collaborating with teammates, customers, and stakeholders in a reproducible and organized manner; OR A Master's degree in Mathematics, statistics, actuarial science, or a field directly related; OR Completion of at least 2 years of graduate education in an accredited college or university in Mathematics, statistics, actuarial science, or a field directly related; OR Combinations of successfully completed graduate level education and specialized experience that meets the total experience requirements. From the closing date of this vacancy announcement, applicants must have at least one year remaining in their required coursework for completion of their degree. Education You must meet the minimum education requirements as described in \"Qualifications.\" All Education must be accredited by an accredited institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications (particularly positions with a positive education requirement.) Therefore, applicants must report only attendance and/or degrees from schools accredited by accredited institutions recognized by the U.S. Department of Education. Applicants may verify accreditation at the following website: Accreditation. PLEASE NOTE: Certificate program is defined as post-secondary education in a qualifying educational institution equal to at least one academic year of full-time study that's part of an accredited college-level, technical, trade, vocational, or business school curriculum. Additional information Relocation expenses will NOT be paid. This announcement is open to all US Citizens who meet citizenship and eligibility requirements. Federal Appropriations Law requires that Non-Citizens meet certain eligibility criteria to be considered. Therefore, Non-Citizens must certify eligibility by signing and attaching this Citizenship Affidavit to their application. Non-citizens who do not provide the affidavit at the time of application will not be considered. Non-citizens may NOT be converted to competitive service appointments. This announcement may be used to fill like positions in other organizations within the National Science Foundation. NSF has determined that all of its positions are eligible for telework. Work suitable for telework depends on job duties; therefore, employees must receive approval from their supervisor for telework and have a telework agreement in place. Entering into a telework agreement is voluntary. The Selected Candidate(s) may be subject to a background investigation. Interagency Career Transition Assistance Program (ICTAP): ICTAP and CTAP provide eligible displaced Federal competitive service employees with selection priority over other candidates for competitive service vacancies. If your agency has notified you in writing that you are a displaced employee eligible for ICTAP or CTAP consideration, you may receive selection priority if: 1) this vacancy is within your ICTAP or CTAP eligibility; 2) you apply under the instructions in this announcement; and 3) you are found well-qualified for this vacancy. To be well-qualified you must meet the following: OPM qualification requirements for the position, all selective factors, where applicable; special OPM approved qualifying conditions for the position; i</li>\n      "
    },
    {
        "position": "Energy - EV Infrastructure Data Scientist Internship (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-06-01T19:06:09.880Z",
        "url": "https://www.linkedin.com/jobs/view/energy-ev-infrastructure-data-scientist-internship-fall-2021-at-tesla-2607158941?refId=SMjoBKzz%2BzEmwh%2FFnzPD9w%3D%3D&trackingId=LpqO5dP2YY6tP1LizQ1%2BIA%3D%3D&position=3&pageNum=31&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-01T18:46:12.760Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong><u>About The Team<br><br></u></strong>We are the team that uses data analytics to bridge the engineering, service, and deployment of Tesla’s charging infrastructure and to enhance the charging experience worldwide.<br><br>With over 18,000 Superchargers and several thousand destination charging sites around the world, Tesla’s charging infrastructure aims to accelerate the world’s transition to sustainable transportation by enabling electric mobility without compromises.<br><br>We use large-scale data analysis, machine learning, and modeling to retrieve actionable insights for enhancing the charging experience while minimizing the costs to Tesla. We also build the software tools and pipelines needed to maximize the leverage of these insights across our global operations.<br><br><strong><u>What To Expect<br><br></u></strong>Intern projects may include analyzing travel and charging behavior, proposing and prototyping charging related customer experience metrics, and building models to forecast charging demand based on first principles and machine learning techniques.<br><br>Intern will be expected to learn fast, solve problems in a fundamental way, and communicate internally and externally to drive decision making.<br><br><strong><u>Requirements<br></u></strong><ul><li>Currently pursuing a Master’s or PhD in a related field (e.g., Transportation Study, Computer Science, Statistics, Engineering) </li><li>Strong programming skills with a solid foundation in data structures and algorithms </li><li>Proficiency in Python and pydata stack (numpy, scipy, pandas, scikit-learn, flask) </li><li>Proficiency in SQL relational databases and/or NoSQL databases </li><li>Experience with statistical data analysis such as linear models and time series forecasting </li><li>Smart but humble, with a bias for action <br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Background in travel and charging behavior analysis, modeling, and infrastructure optimization </li><li>Background in statistical learning with experience in using both supervised and unsupervised models </li><li>Experience in an agile working environment </li><li>Quantitative projects available online (github, blog posts, etc.)</li></ul>\n      "
    }
]