[
    {
        "position": "Software Engineer Intern",
        "company": "Mobinity Global ",
        "location": {
            "city": " New Mexico",
            "state": "United States"
        },
        "posted": "2021-10-18T17:04:45.662Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-mobinity-global-2764170719?refId=Mf4B%2Bm8OW566fRbrwpJ1eA%3D%3D&trackingId=TuFTaocWTvEUMgY8fxY%2BLg%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-10-18T17:04:44.079Z",
        "description": "\n        <p><strong>About Mobinity Global:</strong></p><p>Mobinity Global is a recruitment consultancy firm that helps companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood, etc recruit faster and with more convenience.</p><p><br></p><p>We are transforming the way recruiting is done in the digital age. We work with a number of top-tier companies, tech startups, freelance companies, Industry professionals, and subject matter experts for projects, internships, jobs, and freelance work.&nbsp;</p><p><br></p><p>If you meet the below <strong>eligibility criteria</strong>, please apply and our recruitment team will</p><p>connect with you to understand your strengths and strategize your career ahead.&nbsp;</p><p>We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners now as well as in the future.</p><p><br></p><p><strong>Eligibility Criteria:</strong></p><ol><li>Your year of graduation is 2020 or later. <strong>(Masters Candidates can also apply)</strong></li><li>You have a bachelor's degree in Computer Science, Data Science, Electrical Engineering or related analytical field of study from a USA university.</li><li>You have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood etc.</li></ol><p><strong>&nbsp;</strong></p><p><strong>Your Key Accountabilities May Include</strong></p><p>The main responsibilities of the role will be:</p><ul><li>Independently complete basic coding tasks and provide careful code reviews.</li><li>Participate in design sessions with particular focus on asking questions and understanding why the team makes the design decisions that they do.</li><li>Working on Python, C++, etc. programming on time series analysis including plotting, calculations, and summarizing.</li><li>Data management, database queries, and other desktop applications.</li><li>Prepare and conduct effective presentations, participation in client meetings and interaction with clients and subcontractors.</li><li>Work on multiple, unique assignments simultaneously in a fast-paced environment.</li><li>Exercise judgment on details of work and in making preliminary selections and adaptations of engineering alternatives.</li></ul><p>&nbsp;</p><p>&nbsp;<strong>Requirements:</strong></p><ul><li>Highly motivated with a desire to learn.</li><li>Proficient in Microsoft Excel.</li><li>Be a great teammate — contribute quality work, help out, be flexible, and adapt easily to changing product needs based on customers and the market.</li></ul><p><br></p><p><strong>Benefits:</strong></p><ul><li>Shadowing, mentoring, and training opportunities.</li><li>Fast-paced work environment.</li><li>Opportunity to attend weekly meetings and occasional networking events.</li><li>Compensation available.</li></ul><p>&nbsp;</p><p><strong>Apply NOW and we'll connect with you to explore your best matches!</strong></p><p><br></p>\n      "
    }
]