[
    {
        "position": "Information Technology Intern",
        "company": "Singer Burke ",
        "location": {
            "city": " Encino",
            "state": "CA"
        },
        "posted": "2021-06-26T18:10:49.969Z",
        "url": "https://www.linkedin.com/jobs/view/information-technology-intern-at-singer-burke-2620660495?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=oGE5Xn7aGrnJr%2FYXlkFxrw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Internship Description<br><br></u></strong>We are seeking a highly motivated IT intern with a passion for technology, collaboration, and creative problem-solving. The intern will actively contribute to meaningful projects and work closely with a mentor and under the direction of the Firm’s Technology Team. Primary responsibilities may include code generation; SharePoint / database development; troubleshooting and developing network systems under the supervision of more experienced colleagues.<br><br><strong><u>IT Intern Duties And Responsibilities<br></u></strong><ul><li>Support the Tech Team in developing and configuring database in SharePoint, create Power Automate flows to interact with Microsoft Teams and Sharepoint</li><li>Lend IT support in areas such as cybersecurity, programming, analytics, system configuration, data migration and database management</li><li>Support the Tech Team in maintaining hardware, software, and other systems</li><li>Assist with troubleshooting issues and provide technical support</li><li>Perform on-site installation/configuration/repair/recovery/backup/imaging</li><li>Install operating systems as well as PC software installation and hardware installation/repair/replacement as needed</li><li>Manage troubleshooting in various areas of configuration, network connectivity, windows installation, to customer email.</li><li>Organize and maintain IT resources<br></li></ul><strong>Requirements<br></strong><ul><li>Computer Science, Information Technology, or Management Information Systems major</li><li>Minimum GPA of 3.0</li><li>Familiar with basic programming languages like C++, Java &amp; Python.</li><li>Expert in Microsoft Office Suite of products including Microsoft Teams, Power Automate and SharePoint</li><li>Strong verbal and written communication</li><li>Excellent analytical and problem-solving skills</li><li>Ability to work well in teams</li><li>Strong work ethic and attention to detail<br></li></ul><strong>Benefits<br></strong><ul><li>Gain hands-on experience in an IT position</li><li>Shadowing and training experiences with knowledgeable professionals</li><li>Flexible schedule for students</li><li>Compensation available<br></li></ul><em><strong>Submission of a cover letter along with your resume is required.<br><br></strong></em><strong><u>Please Follow The Link Below (or Copy &amp; Paste)<br><br></u></strong><em><strong>We also require an employment assessment along with your resume submission before consideration.<br><br><strong>https://www.ondemandassessment.com/link/index/JB-1TXJOTX4J?u=1016550<br><br></strong>We are a comprehensive financial services firm headquartered in Encino, California. With two distinct companies under one roof - a professional accounting practice and an independent investment advisory firm - we are able to provide creative clients with one-stop, seamlessly coordinated financial services in an environment where your needs are understood.<br><br>Our mission is to provide quality, personalized service that empowers and positively affects the lives of our clients, staff members, and the professional and public community. At the same time, we build mutual respect, trust, appreciation, cooperation and profitability based on our commitment to integrity, teamwork and responsibility.</strong></em>\n      "
    },
    {
        "position": "Computer Science Intern",
        "company": "Johnson Service Group, Inc. ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-05-31T18:10:52.085Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-at-johnson-service-group-inc-2620308035?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=enS62Nw5uqGVUB2eun2ILA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong>JobID: 384004<br><br>Johnson Service Group is looking for a Computer Science Undergrad or Grad Student Intern. This is a long-term assignment, working part time during school and full-time during breaks. Will assist in the development and implementation of several computer applications designed to optimize workflow within an active engineering unit.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Will be involved in transitioning from a legacy data storage system to an updated relational system.</li> <li>This internship will involve the acquisition of highly evolved training skills via an explanation of software utilization with technical and administrative staff.</li> <li>The intern will gain considerable exposure to fundamentals of Engineering Project Management coupled with Relational Database Principles and fundamentals of computer programming necessary for Automation of Business Rules and Business Practices</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Relational Data Analysis skills, enabling the candidate to assist staff in standardizing the structure and naming conventions of computer folders and files.</li> <li>Rudimentary understanding of computer programming languages such as Visual Basic, Python, etc.</li> <li>Prior usage of database applications such as Microsoft Access to generate reports.</li> <li>Experience with training others to use sophisticated software packages such as MATLAB, AutoCAD, etc.,</li> <li>Comfortable dealing with complex concepts and can clearly explain these principles to technical and administrative staff members.</li> <li>Currently enrolled as a continuing student in an accredited college or university and carrying at least 9 units per school term for an Undergrad or 6 units for a Grad student, or a recent college graduate.</li> <li>The candidate should be working towards a mechanical engineering degree.</li></ul>\n      "
    },
    {
        "position": "Software - Applications Engineering Internship (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Fremont",
            "state": "CA"
        },
        "posted": "2021-05-31T18:10:53.957Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-fall-2021-at-tesla-2607161958?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=aJh9V5qPHpHIiwNK8qdPEA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br><br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br><br></u></strong><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li>\n      "
    },
    {
        "position": "IT Intern",
        "company": "Schwaab, Inc. ",
        "location": {
            "city": " Brookfield",
            "state": "WI"
        },
        "posted": "2021-06-28T18:10:55.981Z",
        "url": "https://www.linkedin.com/jobs/view/it-intern-at-schwaab-inc-2622009435?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=uHO9uTVuFOrmz9O03Bzyog%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Job Description<br><br></strong>The IT Internship role is to provide a front-line point of contact for end users to receive support for basic computer and software issues.<br><br>Internship with the possibility of hire-on pending performance reviews after 6-months.<br><br><strong>Responsibilities<br></strong><ul><li>Provide front-line level 1 technical support as needed</li><li>Troubleshoot problem areas (in person, by telephone, via e-mail, or remotely) in a timely and accurate fashion, and provide end-user assistance where required</li><li>Installing, diagnosing, repairing, maintaining, and upgrading computers and equipment to ensure optimal workstation performance<br></li></ul><strong><u>Education &amp; Certification<br></u></strong><ul><li>Entry level experience with MS Windows Desktop/Laptop operating systems (Windows 7, 8,10) and business/office productivity applications suite management</li><li>Degree in the field of computer science and/or equivalent work experience is preferred </li><li>Certifications in a related field is a plus<br></li></ul><strong>Knowledge<br><br></strong>&amp; Experience<br><ul><li>Good technical knowledge of PC and desktop hardware, etc. </li><li>Hands-on hardware troubleshooting experience is a plus </li><li>Ability to operate tools, components, and peripheral accessories</li><li>Able to read and understand technical manuals, procedural documentation, and OEM guides<br></li></ul><strong>Personal Attributes<br></strong><ul><li>Self-motivated and appetite for learning Information Technology</li><li>Ability to conduct research into PC issues as required</li><li>Effective interpersonal skills and relationship-building skills</li><li>Ability to present ideas in user-friendly language</li><li>Ability to effectively prioritize and execute tasks in a high-pressure environment</li><li>Experience working in a team-oriented, collaborative environment<br></li></ul><strong>Work Conditions<br></strong><ul><li>On-call availability for nights/weekend</li><li>Dexterity of hands and fingers to operate a computer keyboard, mouse, hand and power tools, and to handle other computer components</li><li>Lifting and transporting of heavy to moderately heavy objects, such as computers and peripherals<br></li></ul>EOE/M/F/Vet/Disabilities\n      "
    },
    {
        "position": "IT Intern",
        "company": "Odyssey House ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-23T18:11:02.645Z",
        "url": "https://www.linkedin.com/jobs/view/it-intern-at-odyssey-house-2611350738?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=CDkLfaHPaRJHJUg6JR4aCg%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Summary<br><br></u></strong>The IT Intern will support efficient IT operations by providing vital hardware and software support for internal team members to enhance IT service delivery.<br><br><strong><u>Responsibilities And Duties<br></u></strong><ul><li> Perform computer system setup and maintenance on desktops, notebooks, printers, mobile and handheld devices</li><li> Respond to incoming service requests from employees.</li><li> Providing first and/or basic second level support via in-person, phone, chat and email including a variety of technologies and business applications.</li><li> Inventory management of technology components including computer hardware and software.</li><li> Work collaboratively and communicate often with IT team.</li><li> Assist in maintaining and updating internal documentation for processes and procedures.</li><li> Assist with ad-hoc projects.</li><li> Assist on other projects as needed<br></li></ul><strong><u>Education And Requirements<br></u></strong><ul><li> Completion of at least 1-year of college with a GPA of 3.0 or higher.</li><li> Pursuing a BS/BA in Computer Science or Information Technology</li><li> This is a hybrid position, part remote and part in-office.<br></li></ul>\n      "
    },
    {
        "position": "Computer Science Internship (3 months)",
        "company": "RediMinds, Inc ",
        "location": {
            "city": " Southfield",
            "state": "MI"
        },
        "posted": "2021-06-14T18:11:04.713Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-internship-3-months-at-rediminds-inc-2585206837?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=GGZRWBYulfRldwaSkvHS1Q%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        We are looking for an intern to join the RediMinds Research Team.<br><br>If you are passionate about AI and want to join a mission driven group working to make surgery safer and more effective, please apply! Our team is developing a cutting-edge surgical augmented reality tool which will provide real-time guidance to surgeons performing minimally invasive kidney surgeries.<br><br>Our team has implemented a number of computer vision models (specifically instance segmentation models) to segment various landmarks of interest in specific surgeries. In this role, you will work with our team to develop models which will learn from temporal changes in the surgical video. This will introduce you to cutting edge Computer Vision techniques being applied in medical image analysis. You will also coordinate the image annotation process with physicians and curate data sets.<br><br>We believe in providing support and mentorship to interns. You will be paired with multiple mentors who will guide your research and make sure you are part of the team. We will also provide housing and a stipend during your three-month internship.\n      "
    },
    {
        "position": "Summer Intern- Computer Science",
        "company": "Xerox ",
        "location": {
            "city": " Webster",
            "state": "NY"
        },
        "posted": "2021-05-31T18:11:06.570Z",
        "url": "https://www.linkedin.com/jobs/view/summer-intern-computer-science-at-xerox-2577508127?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=BEZWiksS3zzghrJjLtgc%2FQ%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Xerox (NYSE: XRX) makes every day work better. We are a workplace technology company, building and integrating software and hardware for enterprises large and small. As customers seek to manage information across digital and physical platforms, Xerox delivers a seamless, secure and sustainable experience. Whether inventing the copier, the ethernet, the laser printer or more, Xerox has long defined the modern work experience. Learn more at [1] www.xerox.com and explore our [2] commitment to diversity and inclusion.  <br><br>Qualifications:<br><br>\t* MS Student in data science, computer science, software engineering, electrical engineering etc. to help build a Proof of Concept for a computer vision based system to identify retail products.<br>\t* No specific language expertise needed, rather a willingness to learn new subject matter, and a grounding of basic computer science skills, including understanding of network protocols, software development, API development, embedded systems.  <br>\t* Experience with Microsoft Azure preferred, but not necessary.<br><br> <br><br>Xerox is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity or expression, sex, marital status, sexual orientation, physical or mental disability, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. Learn more at [3] www.xerox.com and explore our [4] commitment to diversity and inclusion! People with disabilities who need a reasonable accommodation to apply or compete for employment with Xerox may request such accommodation(s) by sending an e-mail to XeroxStaffingAdminCenter@xerox.com. Be sure to include your name, the job you are interested in, and the accommodation you are seeking. <br><br>\t© 2020 Xerox Corporation. All rights reserved. Xerox® and Xerox and Design® are trademarks of Xerox Corporation in the United States and/or other countries. <br>References<br><br>Visible links<br>1. http://www.xerox.com<br>2. https://www.xerox.com/en-us/jobs/diversity<br>3. https://www.xerox.com/<br>4. https://www.xerox.com/en-us/jobs/diversity\n      "
    },
    {
        "position": "Software Engineer Intership",
        "company": "Solu Technology Partners ",
        "location": {
            "city": " Rochester",
            "state": "NY"
        },
        "posted": "2021-06-28T18:11:11.779Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intership-at-solu-technology-partners-2623041618?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=tBZIzaKA17rAXn7z%2FHJVog%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <p>Solü Technology Partners is a national technology staffing and solution provider. For more than 20 years, we have worked with businesses to source and retain the most talented technical professionals and deliver innovative solutions to evolving real-world business problems.</p><p><br></p><p>As member of the Solü team, you will be a part of a dynamic, Agile project team working with industry leading platforms and technologies such as Azure, AWS, Angular, Kotlin, Spring, and MongoDB. You will contribute to the technical and product design, infrastructure, development, verification, and delivery of multiple software projects.</p><p><br></p><p>We are looking for someone that is:</p><p><br></p><ul><li>Self-motivated, results oriented and comfortable setting and meeting deadlines</li><li>An excellent communicator with the ability to effectively document and present ideas both verbally and visually</li><li>A strong listener, with the ability to quickly understand and incorporate general direction and specific feedback in project work</li><li>A strong problem solver, with the ability to document and communicate solution options, design and implement solutions, and identify and resolve issues quickly</li><li>Naturally detail-oriented, with ability to balance value versus effort</li><li>Passionate about new and innovative technologies - particularly cloud platforms - guided by end-user, technology, and business drivers</li><li>A positive, thoughtful teammate that enjoys collaborating with, teaching, and learning from other engaged technologists</li></ul><p><strong>&nbsp;</strong></p><p><strong>Responsibilities: </strong></p><ul><li>Design sophisticated and efficient solutions for new problems within the context of an existing implementation</li><li>Apply application specific technical skills to independently produce deliverables</li><li>Exemplify and uphold rigorous personal and team code quality and process standards</li></ul><p><br></p><p><strong>Qualifications: </strong>&nbsp;</p><ul><li>Analysis/Design - Understanding and appreciation for object-oriented analysis and design, microservice architectures and cloud-based applications</li><li>Working towards a Bachelors or Master degree in Computer Science, Software Engineering, Computer Engineering or related discipline</li><li>Experience building and maintaining cloud applications and possession of cloud platform certifications are a plus</li></ul><p><br></p><p><br></p><p><br></p><p>*Solü Technology Partners provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics.</p>\n      "
    },
    {
        "position": "Student / Intern",
        "company": "Oracle ",
        "location": {
            "city": " Bozeman",
            "state": "MT"
        },
        "posted": "2021-06-28T18:11:13.585Z",
        "url": "https://www.linkedin.com/jobs/view/student-intern-at-oracle-2623061840?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=DdrybRTFcmSUv0xhueUAgw%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong><strong> Computer Science Internship in Bozeman, Montana <br><br></strong><strong>Required for Candidates - NO exceptions, please do not apply of all 4 requirements are not met:<br></strong><ul> <li> Attending Montana State University in Computer Science or closely related field </li> <li> Currently living in Bozeman, Montana or surrounding areas </li> <li> GPA of 3.8 or higher </li> <li> Junior, Senior, or Graduate status </li> <br></ul>Do you enjoy solving a diverse set of challenging technical problems? Are you looking for a dynamic, fast-paced environment where you can stand out and showcase your programming skills? We need intelligent and motivated people to help us deliver and improve upon our innovative, market-leading Cloud applications. Our focus is on an enterprise class, performant, scalable and reliable service backend that manages billions of transactions a month and terabytes of data. We offer a great opportunity to work on a successful and growing team where you will be likely to see and use the software you build in your daily life as you interact with brands around the world.<br><br><strong><u>We Are Looking For Creative Problem Solvers And Innovative Thinkers Who Can<br><br></u></strong>As a Software Developer on our Platform team, you will write clean, well-designed, readable, and elegant code.<br><ul> <li> Use industry standard development processes and testing practices to add new functionality to existing software </li> <li> Modify, test, debug and maintain existing code and the associated unit and acceptance tests </li> <li> Participate in design discussions and code reviews </li> <li> Collaborate with other team members </li> <li> Understand and improve underlying architecture </li> <li> Work closely with your Scrum team and actively participate in meetings </li> <br><br></ul><strong><u>Preferred Knowledge, Skills, Abilities, And Background<br></u></strong><ul> <li> Strong skills in several of the following: SQL/database skills, particularly with MySQL, SOAP, Linux, C, C++, Java </li> <li> Familiarity with Test Driven Development, Continuous integration, Scrum </li> <li> Familiarity with Microservices and Enterprise Messaging Services </li> <li> Passion for problem solving and troubleshooting code </li> <li> Self-motivated, organized, with strong interpersonal communication skills </li> <li> Ability to complete tasks to meet tight deadlines </li> <br></ul>This is a year round position. The hours are flexible to work around your school schedule, with part time during the school year and full time in summer. Pay starts at $30/hr.<br><br>If this sounds like something that you would like to be a part of, then apply today.<br><br>This job code is utilized for the majority of our temporary hires. The individual is performing hourly job duties as defined under the Fair Labor Standards Act.<br><br><strong><u>About Us<br><br></u></strong>Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.<br><br>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\n      "
    },
    {
        "position": "Intern - Programmer",
        "company": "DSI Renal ",
        "location": {
            "city": " Plano",
            "state": "TX"
        },
        "posted": "2021-06-14T18:11:15.411Z",
        "url": "https://www.linkedin.com/jobs/view/intern-programmer-at-dsi-renal-2589509799?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=CARhftBRkcf4OScfjaiQwg%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        The Intern - Programmer will participate in software development, research, and analysis of IT tools, and implement web development standards in the current system. This position will also assist with troubleshooting and business functionality with the support of Senior Developers.<br>ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties and tasks may be assigned.<br><ul><li> Understand current applications in the ecosystem and assist senior developers in business functionalities development.</li><li> Research various development &amp; automation IT tools available in marketplace and provide SWOT analysis to the architecture team.</li><li> Participate in database design sessions and generate business flow and entity relationship diagrams.</li><li> Learn web application development standards and implement them in current ecosystem.</li><li> Understand and actively participate in Scrum methodology of software development.</li><li> Assist with troubleshooting issues and resolve defects reported by business users.</li><li> Actively promote GUEST customer service standards; develop effective relationships at all levels of the organization.</li><li> Participate in team concepts and promote a team effort; perform duties in accordance with company policies and procedures.</li><li> Regular and reliable attendance is required for the job.<br></li></ul><strong><u>Qualifications/Requirements<br><br></u></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.<br><br><strong><u>Requirements Include<br></u></strong><ul><li> Currently enrolled in four (4) year accredited degree program and returning to the program upon completion of the internship.</li><li> Currently pursuing a degree in Computer Science, Mathematics or Engineering related field is preferred.</li><li> Basic knowledge of programming is preferred.</li><li> Experience working on web development technologies will be a plus.<br></li></ul>U.S. Renal Care is an Equal Opportunity Employer/Disabled/Veteran.<br>Additional Information\n      "
    },
    {
        "position": "Software Engineering Intern",
        "company": "Umba ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-05-31T18:11:17.479Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-umba-2617028766?refId=O1u5E52ByQ6f81tezf5TVg%3D%3D&trackingId=WoC7RO%2Fhcae4dXcxMWT8Eg%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About Umba<br><br></u></strong>At Umba, we are building a digital bank for emerging markets, offering intelligent, affordable financial products. We are currently live with an Android app in Kenya &amp; Nigeria with our digital banking services.<br><br>One-third of the world's 2 billion unbanked people live in Sub-Saharan Africa, and we are here to bring these customers free banking services and bring them into the formal financial system. It's an exciting mission and one that we are excited to deliver on.<br><br>We welcome people from all backgrounds who seek the opportunity to help build a future where everyone has access to liquid capital, free money transfers, and saving &amp; investment opportunities. If you're curious about Fintech or emerging markets and have a passionate, hardworking spirit, come work with us and help put opportunity in everyone's pocket.<br><br>What we do:<br><br>Building a software platform that is reliable, scales, and achieves excellent uptime while serving emerging markets with immature tech stacks is a serious technical challenge.<br><br>As an SWE intern, you work with our engineering team. You will also work directly with our Data Science, Product, and Management teams to deliver features that improve our customer's experiences and drive business growth.<br><br><strong>Responsibilities</strong>:<br><ul><li>Craft, code, test and launch new features</li><li>Participate in brainstorming sessions and contribute ideas to our technology, algorithms, and products</li><li>Work with the core engineering team on a daily basis</li><li>Connect with intern peers, new teammates, and colleagues from across the business<br></li></ul>Basic Qualifications:<br><ul><li>BA/BS in Computer Science or a related technical field, or equivalent experience</li><li>BA/BS Graduation Year: 2021 or 2022</li><li>Strong understanding of computer architecture and CS fundamentals</li><li>Proficient in one of the following programming languages: Java, Go, Python, C/C++</li><li>Eagerness to investigate challenges and present reasonable solutions reliably and quickly</li><li>Excitement to pick up a new language and be productive with it in a week</li><li>Desire to work collaboratively in a team environment<br></li></ul>Bonus Qualifications:<br><ul><li>You're fun to work with! We are a very diverse and friendly team that prioritizes building relationships and unlocking everyone's full potential</li><li>You're willing to work onsite in our office in North Beach, San Francisco!<br></li></ul>Work Status:<br><ul><li>Valid work authorization for the US<br></li></ul>Umba is proud to be an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.<br><br>Powered by JazzHR<br><br>bJaaNKmQl5\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "Domo, Inc. ",
        "location": {
            "city": " American Fork",
            "state": "UT"
        },
        "posted": "2021-05-31T18:11:52.020Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-domo-inc-2577925013?refId=2GsSab6ep6rY8GyywBjyrQ%3D%3D&trackingId=GAsYTZbiLBysYl8mW7OAmg%3D%3D&position=17&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        We are Domosapiens- uniquely skilled, passionate data lovers anchored in a culture of connectivity. We are transforming the way business is managed by putting real-time data into the hands of every decision maker across organizations. Diversity is valued here because homogenized teams create echo chambers; and nobody benefits from that. The insight garnered from diverse backgrounds, perspectives and lived experiences results in pioneering innovations across the organization and better experiences for our customers. The more diverse our talent, the more impactful the Domosphere becomes.<br><br><strong><u>Position Summary<br><br></u></strong>Our engineering team is rapidly growing, and we are looking for Software Engineer Interns to be a part of our fast-paced, high-energy team. Our engineering interns are serious about the success of the company and are given the tools and environment they need to succeed. If you are looking for an internship with a passion for learning cutting edge web technology, solving interesting business problems, and you believe that planning, hard work, teamwork, and creating high quality experiences is what it takes to succeed, then this is the job for you.<br><br><strong><u>Key Responsibilities<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in development areas such as algorithms, databases, and distributed systems;</li> <li>Help with the design and development of Domo's data analysis platform;</li> <li>Work with other engineering teams to optimize the usage and efficiency of Domo's data analysis platform;</li> <li>Help develop methods and tools to monitor the performance and reliability of Domo's data analysis platform.</li> <br><br></ul><strong><u>Job Requirements<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in web technologies such as HTML/CSS, Java, and Spring;</li> <li>Demonstrated aptitude for learning new technologies;</li> <li>Ability to communicate and interface with technical and non-technical members of the organization;</li> <li>Working on a College degree in Computer Science, Information Systems, or related field and/or equivalent combination of experience and education.</li> <br><br></ul><strong>Domo is an equal opportunity employer.</strong>\n      "
    },
    {
        "position": "Cloud Engineer Intern",
        "company": "Fetch Rewards ",
        "location": {
            "city": " Madison",
            "state": "WI"
        },
        "posted": "2021-06-26T18:12:28.044Z",
        "url": "https://www.linkedin.com/jobs/view/cloud-engineer-intern-at-fetch-rewards-2619481761?refId=KhXPhX91W8qnuzQGQBu5jA%3D%3D&trackingId=LA4hWKWXWRwqjsZOWdVREQ%3D%3D&position=18&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Who We Are:<br><br></strong>We reward shoppers for digitizing their shopping experience.<br><br>Our mission is to delight the world's shoppers with a free smartphone app that is easy, smart and fun.<br><br><strong>Why Join the Fetch Family?<br><br></strong>We make it better for users even when that's difficult for us<br><br>We empower people with information and trust<br><br>We challenge ideas, not people<br><br>We think bigger and keep building<br><br>We find ways to bring the fun to Fetch!<br><br>We're committed to building an empowered and inclusive community of innovative and passionate people. As a growing organization, we need team players who can go above and beyond their individual responsibilities to help our company build towards its vision. If you are a creative, hard-working, and fun-seeking person interested in working with a close-knit group of highly talented people, this is the right place for you.<br><br><em>Fetch Rewards is an equal employment opportunity employer.<br><br></em><strong>The Role!<br><br></strong>Fetch's next step in evolving the shopping experience will require a <strong>Cloud Engineer, Internship/Apprenticeship. </strong>You will build and improve the tools used at Fetch to deploy, manage and monitor highly performant cloud resources. Using Infrastructure as Code your team will improve the security, resiliency and scalability of Fetch's microservices. Success in this role requires the ability to take on challenging problems and design &amp; develop an appropriate solution with limited assistance. (We seek interns that can work full time once the 3 month internship is complete!)<br><br><strong>In your tool-bag<br></strong><ul> <li>Familiarity with AWS or other cloud providers</li> <li>Demonstrated success with functional or object-oriented programming. (Fetch is broadly language agnostic, but our existing IaC framework is a combination of Ansible and Python)</li> <li>Experience building extendable applications/systems for internal engineering teams</li> <li>Effective communication, strong listening and strategic thinking skills including the ability to translate and explain technical issues to non-technical team members.</li> <li>Ability to learn quickly and apply learning to problems or activities. </li> <br><br></ul><strong><u>You Have Experience With<br></u></strong><ul> <li>Required: Modern cloud architecture (virtualization, databases, message queueing)</li> <li>Developing and operating software applications (Python, boto3)</li> <li>Infrastructure as Code (Ansible, CloudFormation, CDK)</li> <li>Building highly available, scalable, fault-tolerant infrastructure</li> <br></ul><strong>Bonus Points<br></strong><ul> <li>Comfort with the use of a variety of programming languages and data stores (Python, Java, Go, MongoDB, Postgres, MySQL, Redis)</li> <li>Experience managing highly available and scalable hosting solutions in a microservice environment</li> <li>Undergraduate or graduate degree in computer science, engineering or mathematical field of study</li> <br></ul>#BI-Remote\n      "
    },
    {
        "position": "Graduate intern Fall (Data Engineering)",
        "company": "Visual BI Solutions ",
        "location": {
            "city": " Plano",
            "state": "TX"
        },
        "posted": "2021-05-31T18:12:33.586Z",
        "url": "https://www.linkedin.com/jobs/view/graduate-intern-fall-data-engineering-at-visual-bi-solutions-2621062961?refId=KhXPhX91W8qnuzQGQBu5jA%3D%3D&trackingId=PIqHcJ7WpREQi6Y%2Fwc73eA%3D%3D&position=21&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Location Plano, TX or any location in the US<br><br></strong><strong>Duration (Summer or Fall 2021) with Opportunity Earn Full-Time Roles<br><br></strong><strong><u>Job Summary<br><br></u></strong>Visual BI Solutions Inc is seeking Graduate Interns with strong expertise/passion in Data Engineering / Data warehousing tools to join our <strong>College Recruiting Hiring Program</strong>.<br><br>In this role, you would be building best-in-class BI, Analytics &amp; Big Data Solutions that would be consumed by leaders and executives of Fortune 500 organizations.Visual BI will invest in training and transition traditional EDW skills (SQL, Oracle) to Cloud EDW Platforms like Snowflake, Azure Synapse.<br><br>As a market leader in BI &amp; Analytics - Visual BI is very selective in student hiring and so candidates with portfolio of non-academic project work/technical blogs will be preferred over work experience or academic GPA Scores.<br><br><strong><u>Requirements<br><br></u></strong><li>2+ years of Data Engineering / Data warehousing tools experience is Required</li><ul> <li>Has experience in ETL, Data Engineering Pipelines</li> <li>Strong SQL skills</li> <li>Good understanding of Data Modelling, data flows.</li> <li>Masters Degree in Analytics, Computer Science or MIS Required</li> <br><br></ul><u><strong>Benefits<br></strong></u><ul> <li>Be on the forefront of learning and innovation! You'll have 24x7 access to Visual BI Labs, our learning environment that hosts all leading-edge innovations in BI with excellent training and development opportunities during Internship</li> <li>12 - 16 weeks of Paid Internship</li> <li>Opportunities to secure full-time roles in BI &amp; Analytics with Visual BI</li></ul>\n      "
    },
    {
        "position": "IT Applications Intern",
        "company": "Jockey International, Inc. ",
        "location": {
            "city": " Wisconsin",
            "state": "United States"
        },
        "posted": "2021-06-14T18:12:44.807Z",
        "url": "https://www.linkedin.com/jobs/view/it-applications-intern-at-jockey-international-inc-2604798226?refId=%2FK7V05do50LUmli6mmjjSQ%3D%3D&trackingId=9eIh613RIjhIAlLvj%2BMxQA%3D%3D&position=5&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        In this role, you’ll work with our IT and Business team members to manage and support a variety of solutions. Based at our headquarters in <strong>Kenosha, WI </strong>(near <strong>Milwaukee, WI</strong> and <strong>Chicago, IL</strong>), you’ll have the opportunity to work on multiple business applications - including maintenance and providing internal technical support to our business users, while collaborating with other IT members. If you have a passion for IT business development, along with a zest to gain pertinent business experience, this position is for you!<br><br><strong>JOCKEY</strong> is a premier local employer, offering the following employee perks:<br><ul><li> Attractive salary!</li><li>Flexible work schedule to accommodate class schedules!</li><li>Onsite, professional training in the Computer/IT fields! <br></li></ul><strong><u>In This Role, You Will<br></u></strong><ul><li> Work with team members to deliver support to the end user.</li><li>Assess and trouble-shoot IT issues.</li><li>Assist in the maintenance of existing solutions to support business needs.</li><li>Support assigned systems as necessary.</li><li>Create and maintain documentation for support continuity.</li><li>Perform tasks in cataloging, maintaining, converting, and scheduling reports.<br></li></ul><strong><u>Candidate Requirements<br></u></strong><ul><li> Currently pursuing a Bachelor’s degree in Computer Science, or equivalent (current junior or senior preferred).</li><li>General knowledge of database terminology and functions preferred.</li><li>Understanding of software development lifecycle preferred.</li><li>Basic knowledge of networking and hardware concepts; exposure to MS Windows Server.</li><li>Basic knowledge of standard MS-Office software.</li><li>Strong communications and critical-thinking skills.</li><li>Solid understanding of current technology and trends.</li><li>Eagerness to learn new technologies.</li><li>Ability to work 20-30 hours per week during Summer 2021, and 15-20 hours per week during the school semesters (work schedule is flexible to accommodate class schedules).<br></li></ul>In return for your expertise, <strong>JOCKEY</strong> offers fitness club discounts, onsite health &amp; wellness programs, generous employee discounts, a business casual work environment, learning opportunities, and opportunities for advancement.<br><br>Follow us on Linkedin! To find out more about our history and what it's like working at <strong>JOCKEY</strong>, visit us on Pinterest http://www.pinterest.com/Jockey_Careers/.<br><br>Jockey International, Inc., and its subsidiaries, provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. We are committed to providing reasonable accommodations for qualified individuals with disabilities in our job application procedures. If you need assistance or an accommodation due to a disability, you may email us at human_resource@jockey.com or call us at 262-658-8111.\n      "
    },
    {
        "position": "Full Stack Developer Intern/part-time",
        "company": "Bainbridge ",
        "location": {
            "city": " San Diego",
            "state": "CA"
        },
        "posted": "2021-06-21T18:13:38.287Z",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-intern-part-time-at-bainbridge-2522662061?refId=hs26dILNM6hH7tOIgDd1pw%3D%3D&trackingId=DyQjaEslUdn3a6ZAVNy4KQ%3D%3D&position=14&pageNum=4&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About This Position<br><br></u></strong><strong>Full Stack Developer Intern/part-time<br><br></strong><strong>BC Capital, LLC (Bainbridge affiliate) San Diego, CA<br><br></strong><strong>Job Type<br><br></strong>Part-time/ intern, minimum 20 hours per week<br><br><strong>Location<br><br></strong>San Diego, Remote agnostic<br><br><strong>Start date: Immediate openings<br><br></strong><strong>How to Apply</strong>: Please include a <strong>cover letter</strong> with your<strong> resume</strong>, briefly explaining your interest in this position. Resumes without cover letters will not be reviewed.<br><br><strong>Summary<br><br></strong>/Objective<br><br>We are looking for full-stack developers to join our growing web development team. The team is working on developing a web-based application. The individuals will use JavaScript to develop new features of the platform. The ideal candidate will have knowledge in both front-end and back-end. We are looking for students for a part-time internship.<br><br><strong>Essential Duties and Responsibilities<br><br></strong>Include<br><ul><li>Collaborate with lead developer building web-based application</li><li>Communicate and report to the team on daily basis </li><li>Ensure responsiveness of the application</li><li>Troubleshoot and debug application</li><li>Work on other tasks as assigned<br></li></ul><strong>Qualifications<br></strong><ul><li>Have graduated from or currently enrolled in a B.S. degree program in Computer Science or related field</li><li>0-2 years of web application development experience</li><li>Proficient in JavaScript </li><li>Experience in Bootstrap, React/Redux, Node.js, Express.js, MongoDB</li><li>Strong knowledge of Rest APIs</li><li>Familiar with cloud platform such as Heroku and AWS</li><li>Knowledge of code versioning control tool such as Git</li><li>Good communication and teamwork skills</li><li>Ability to work independently and dependently within a team environment</li><li>Be able to work a minimum of 20 hours/week (Intern only)<br></li></ul><strong>Why Work Here?<br><br></strong><em>Forbes-rated, award winning professional consultancy with exceptional growth in new technology, meritocracy, expanding management team. <br><br></em>BC Capital Group is a separately-owned affiliate to Bainbridge, a global strategic consulting firm, delivering high value advisory services to the Fortune 1000. Founded out of MIT, our main goal is to help clients achieve their strategic objectives while our team members achieve their highest professional goals. The company was recently ranked by Forbes Magazine among the 99th percentile of national management consulting firms and by Vault Magazine as a top 50 national management consulting firm. Our culture is one of teamwork, achievement, and excellence in customer service. From 2016-2020, Bainbridge was recognized by Forbes ranking of <em>America's Best Management Consulting Firms</em> across 14 industries of expertise. In 2016 Bainbridge was ranked in the Top 50 Most Prestigious Consulting Firms in North America by Vault. In 2007, Bainbridge Consulting was recognized as an employer of choice by the San Diego Business Journal, reflecting the values of teamwork, scholarship, excellence, and impactful value.\n      "
    },
    {
        "position": "Graduate Research Intern (Fall 2021)",
        "company": "Roblox ",
        "location": {
            "city": " San Mateo",
            "state": "CA"
        },
        "posted": "2021-06-14T18:14:00.613Z",
        "url": "https://www.linkedin.com/jobs/view/graduate-research-intern-fall-2021-at-roblox-2590434045?refId=26OB815TJkHSEEh2sfecmw%3D%3D&trackingId=5PwoG3wuyqH9AoePPKOcVg%3D%3D&position=4&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Every day, tens of millions of people from around the world come to Roblox to play, learn, work, and socialize in immersive digital experiences created by the community.<br><br>Our vision is to build a platform that enables shared experiences among billions of users. This is what’s known as the metaverse: a persistent space where anyone can do just about anything they can imagine, from anywhere in the world and on any device. The breadth of opportunities, and the evolving demands of this first-of-its-kind platform, ensure that your avenues for growth are always expanding and flexible.<br><br>Join us and you’ll usher in a new category of human interaction while solving exceptional challenges that you won’t find anywhere else.<br><br>This creates many research opportunities at the intersection of computer science, data science, psychology, economics, and digital art:<br><ul> <li><em>Systems</em>: scaling network, datacenter, and client resources for tens of thousands of players in the same real-time simulated environment.</li> <li><em>Voice, Avatars, and NLP</em>: emotion detection, natural language translation, TTS/STT, voice transformation, 3D audio, facial expressions, accessibility for hearing and vision impairment </li> <li><em>Content Creation</em>: programming languages; non-player characters, dialog and narrative; high-level world creation; non-expert geometry creation and manipulation; UX</li> <li><em>Analytics</em>: content moderation, anti-harassment and anti-bullying, behavioral analysis, social analysis, recommendation systems</li> <br><br></ul>Many of these are particularly amenable to deep neural networks and other machine learning techniques.<br><br>In 2020, we were honored to be one of the Top 100 Internship Programs in the US.<br><br><strong>Roblox is seeking a passionate and highly motivated Graduate Research Intern for Fall 2021. <br><br></strong><strong><u>You Are<br></u></strong><ul> <li>Enrolled in a computer science or computer engineering Ph.D. program</li> <li>Studying analytics, NLP, machine learning, systems, or graphics</li> <li>Proficient in C++ and Python</li> <li>Computer science undergraduate degree or equivalent experience</li> <br><br></ul><strong><u>You Will<br></u></strong><ul> <li>Collaborate with Ph.D. mentors in Research and Analytics departments, as well as engineers</li> <li>Conduct experiments via prototypes and data analysis</li> <li>Help shape the vision for the metaverse and invent solutions for its challenges</li> <li>Prepare an article for submission to a peer-reviewed venue</li> <li>Enjoy whole-company social events in both the real and virtual worlds</li> <br></ul><strong>Location:</strong> San Mateo, CA with remote possibilities in 2021<br><br><strong>Duration: </strong>12 Weeks<br><br><strong><u>You'll Love<br></u></strong><ul> <li>Excellent medical, dental, and vision coverage</li> <li>A rewarding 401k program</li> <li>Flexible vacation policy</li> <li>Free catered lunches five times a week and several fully stocked kitchens with unlimited snacks</li> <li>Onsite fitness center and fitness program credit</li> <li>Annual CalTrain Go Pass</li> <li>A Roblox Admin badge for your avatar</li></ul>\n      "
    },
    {
        "position": ".NET Developer Intern (SA5)",
        "company": "Real Green ",
        "location": {
            "city": " Walled Lake",
            "state": "MI"
        },
        "posted": "2021-05-31T18:14:10.494Z",
        "url": "https://www.linkedin.com/jobs/view/net-developer-intern-sa5-at-real-green-2617012573?refId=26OB815TJkHSEEh2sfecmw%3D%3D&trackingId=XuM8Pe3XgcP4gfSjfUyL5Q%3D%3D&position=10&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Position Summary</strong>:<br><br>Us: Looking for a strong .NET Developer Intern.<br><br>You: Excited to grow in your field, creative in your approach, passionate about your work, ready to join an amazing team in a fun, open environment.<br><br>We are looking for a .Net Developer Intern to help build software using the .NET framework, JavaScript, JQuery, HTML5, and DevExpress control library.<br><br>In this role, you should be able to write functional code with a sharp eye for optimization. You should be a team player and excellent communicator. If you are also passionate about writing web applications and working with awesome teams in a fun environment, we want to meet you! Please note that this position is not eligible for benefits.<br><br><strong>Responsibilities</strong>:<br><ul><li>Here, the day-to-day job duties will be listed in bullet points. For examples, see below:</li><li>Responsible for the implementation of Salesforce serving as the primary system administrator.</li><li>Configure Salesforce platform to support critical business functions and meet project objectives, internal stakeholder requirements and company goals.</li><li>Handle all basic administrative functions including user account maintenance, reports and dashboards, workflows and other routine tasks.</li><li>Complete regular internal system audits and prepare for upgrades.<br><br></li></ul><strong>Requirements</strong>:<br><ul><li>Must be a college student (junior level or higher) or recent graduate in Computer Science, Engineering, or another closely related field</li><li>Understands databases and how they are used</li><li>Experience with C++, C# or Java (Any object oriented programming language)</li><li>Understands Object Oriented programming </li><li>Excellent troubleshooting and communication skills </li><li>Attention to detail </li><li>Works well with others <br><br></li></ul><strong>About Us:<br><br></strong>We are Real Green Systems, and you want to work with us! We're a Michigan-based software company that started as a lawn care company, a history that gives us a unique and uniquely awesome vibe and drive. RGS is the leading provider of software solutions to lawn care, landscape management, pest control and other green industries. Our special sauce is our team: We're a group of makers, doers, creative thinkers and hard workers, and we're always looking for like-minded individuals to come and help us grow. When you become a Real Greener, you'll become part of a dynamic, friendly, fun and forward-looking community. Here's what you can expect when you join the Real Green team:<br><br><strong>Benefits<br><br></strong>:<br><ul><li>Michigan is the best state (don't @ us), but we know that great people come from everywhere. Many of our roles are open to people who work from home</li><li>Plenty of room for growth – we recognize and nurture our talent</li><li>We work hard but we play hard too, and we understand that everyone needs time off. You'll get 16 days of PTO per year (earned at 1.33 days per month) along with 8.5 paid holidays</li><li>Great benefits package including strong medical, dental and vision plans</li><li>Flexible Spending Accounts (FSAs) using pre-tax dollars for qualified medical expenses</li><li>401k program with a safe-harbor match of 100% on the first 3% of your contributions and 50% on the next 2% of contributions; in other words, you get money when you save money!</li><li>Free life insurance for $25,000 upon eligibility, with the option to purchase additional coverage</li><li>If you work in the office, we're strictly business casual so you can skip the dry cleaner</li><li>Our corporate office is conveniently located in Walled Lake, MI, easy to access from the entire Metro Detroit area<br><br></li></ul><strong>EEO Policy:<br><br></strong>Real Green Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.<br><br>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br><br>_________________________________________________________________________<br><br><em>The above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities or physical requirements. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br></em>Powered by JazzHR<br><br>6pZveRfXfN\n      "
    },
    {
        "position": "Research Internship (Fall 2021, Computer Vision)",
        "company": "Dataminr ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-24T18:14:37.710Z",
        "url": "https://www.linkedin.com/jobs/view/research-internship-fall-2021-computer-vision-at-dataminr-2531625661?refId=h1FU9kugyADwyRW4j2XmAg%3D%3D&trackingId=6bD6rsjcByGbJPTA2ZayYg%3D%3D&position=3&pageNum=6&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <ul><li>COVID-19 Hiring Update--<br></li></ul><strong>As the health and safety of our candidates and our employees come first, we're excited to provide virtual experiences for interviews and new hire on-boarding.<br><br></strong><strong>Who We Are<br><br></strong>Dataminr puts real-time AI and public data to work for our clients, generating relevant and actionable alerts for global corporations, public sector agencies, newsrooms, and NGOs. Our leading AI platform detects the earliest signals of high-impact events and emerging risks from vast amounts of publicly available information. Our real-time alerts enable tens of thousands of users at hundreds of public and private sector organizations to learn first of breaking events around the world, develop effective risk mitigation strategies, and respond with confidence as crises unfold.<br><br>Dataminr is making its mark for growth and innovation, recently earning recognition on the Deloitte Technology Fast 500, Forbes AI 50 and Forbes Cloud 100 lists. We also earned accolades for ‘Most Innovative Use of AI’ from the 2020 AI &amp; Machine Learning Awards.<br><br>Join our team and help the world manage risk in real time. You’ll work with 600+ talented people across seven offices, united by our passion to collaborate, make a difference, and have fun while doing it!<br><br><strong> Type: Internship<br><br></strong><strong>Experience<br><br></strong>PhD/Graduate Students<br><br><strong>Who You Are<br><br></strong>You’re a Ph.D. candidate who has published in top tier conferences and are passionate about having a positive impact on the world. You are enthusiastic about working on some of the most challenging problems in AI, working in a highly collaborative environment and directly contributing to products while advancing the state of the art. You are very creative, can work independently, and are an excellent collaborator and communicator.<br><br><strong>Responsibilities<br></strong><ul><li> Perform research to advance the state of the art and solve specific problems at scale in Computer Vision </li><li> Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship. </li><li> Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact. <br></li></ul><strong>Minimum Qualifications<br></strong><ul><li> Must be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field. </li><li> Ideal candidates will have had prior internship experience. </li><li> Outstanding publication record in the candidate’s field of study (ACL, CVPR, CHI, WWW, RecSys, ICCV, NIPS, ICML, etc.). </li><li> Demonstrated ability to work independently, set up experiments and demonstrate progress through principled used of metrics. <br></li></ul>Dataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.<br><br>\n      "
    },
    {
        "position": "Core Developer Intern",
        "company": "Point72 ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-05-31T18:14:57.044Z",
        "url": "https://www.linkedin.com/jobs/view/core-developer-intern-at-point72-2617791415?refId=h1FU9kugyADwyRW4j2XmAg%3D%3D&trackingId=A0RYr%2F8grgLjD%2F%2FfjsJTeg%3D%3D&position=15&pageNum=6&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About Cubist<br><br></u></strong>Cubist Systematic Strategies is one of the world’s premier investment firms. The firm deploys systematic, computer-driven trading strategies across multiple liquid asset classes, including equities, futures and foreign exchange. The core of our effort is rigorous research into a wide range of market anomalies, fueled by our unparalleled access to a wide range of publicly available data sources.<br><br><strong><u>Job Description<br><br></u></strong>A portfolio management team focused on systematic options trading is seeking a highly talented intern to assist in the development, optimization, and monitoring of our production trading platform and research infrastructure. We are a small, highly collaborative team. From day one you will learn about, and contribute to, our entire investment process.<br><br>Desirable Candidates<br><ul><li>Undergraduate or graduate candidates in computer science or engineering</li><li>Significant experience in Python, C++, C, or Java</li><li>Serious interest in systems programming (e.g. Linux kernel development, compilers, embedded systems, networking, file systems, debuggers)</li><li>In-depth understanding of how userland programs run on Linux and interact with the kernel</li><li>Some basic knowledge of Git, databases (e.g. MySQL), and web development frameworks is a plus</li><li>Clear, concise, and proactive communicator</li><li>Detail-oriented</li><li>Willing to take ownership of his/her work, working both independently and within a small team<br></li></ul>We’re looking for exceptional colleagues with unparalleled passion. If you’d like your resume to stand out, tell us about your exceptional personal achievements, even if they have nothing to do with finance. Of course we love to hear more about specific engineering or data projects that you’ve worked outside of school, or as part of your curriculum. If you’re proud of the work you did we want to hear about it. In addition to exceptional statisticians and engineers, we work with talented musicians, writers, mathematicians, and founders of non-profits; we’d love to learn more about what excites you.<br><br>Point72 is an Equal Opportunity Employer. Point72 is committed to the principles of equal employment opportunity for all employees and applicants for employment. Point72 complies with applicable, local, state and federal laws on the subject of equal employment opportunity.\n      "
    },
    {
        "position": "Data Analyst (Paid Internship)",
        "company": "Props Project ",
        "location": {
            "city": " United States",
            "state": "United States"
        },
        "posted": "2021-04-29T18:15:06.699Z",
        "url": "https://www.linkedin.com/jobs/view/data-analyst-paid-internship-at-props-project-2581607172?refId=h1FU9kugyADwyRW4j2XmAg%3D%3D&trackingId=V8zj3YEbuuofHN74kbt3cg%3D%3D&position=21&pageNum=6&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong>We are looking for a talented Data Analyst Intern to join our fast-growing team. The successful candidate will work on business intelligence, protocol and partner apps analytics, driving deep understanding and improvement across our protocol and business process. The roll will primarily involve analysing and visualizing data across multiple sources to identify interesting patterns and trends to support decision making.<br><br>If you are an independent, high-achieving individual, who is able to excel through self-motivation and personal drive, we’d love to work with you.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Apply your expertise in data mining, and data visualization to extract insights that can inform our business and protocol decisions</li><li>Develop clear visualizations to convey complicated data in a straightforward fashion</li><li>Work together with the product / marketing team to identify the key metrics to measure the different aspects of the business. Create and maintain dashboards to visualize those metrics and track KPIs</li><li>Develop expertise on building blockchain APIs and on-chain data analysis<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Actively pursuing a degree in STEM (Mathematics, Computer Science, Engineering) or similar field</li><li>Proficient in Python, SQL and Excel</li><li>Experience with business intelligence tools preferred (We use Mode!)</li><li>Passionate about crypto </li><li>Work up to 40 hours a week</li><li>Commit to the full length (12 weeks) of the internship program <br></li></ul><strong>Attributes<br></strong><ul><li>Fast learner</li><li>Take ownership and work independently</li><li>Critical thinking, analytical and problem solving abilities</li><li>Good interpersonal and communication skills</li><li>Ability and intent to collaborate with different teams</li><li>Scrappy, entrepreneurial attitude that gets high-quality projects done quickly</li><li>Take initiative</li></ul>\n      "
    },
    {
        "position": "INFORMATION SYSTEMS INTERN",
        "company": "Inspira Health Network ",
        "location": {
            "city": " Bridgeton",
            "state": "NJ"
        },
        "posted": "2021-05-31T18:15:14.854Z",
        "url": "https://www.linkedin.com/jobs/view/information-systems-intern-at-inspira-health-network-2619394311?refId=wIe1HQQWGFnYLFF%2BEtqDIQ%3D%3D&trackingId=X%2BWA1XOHvPfYeBq5MSfvXA%3D%3D&position=2&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>OUR MISSION:</strong><strong> Our mission is to provide high quality health services that improve the lives of all we serve.<br><br></strong><strong><u>Major Function<br><br></u></strong>Responsible for data entry, installations, and customer service. Additional responsibilities include working on projects to ensure the appropriate end user computer equipment is specified, ordered, tested and installed; and working to establish policies and procedures for installing, testing, and deploying end user devices.<br><br><strong><u>Qualification<br><br></u></strong><strong><li> Education:<br><ul> <li>High School Diploma/GED required.</li> <li>In the process of seeking at least an Associate’s degree in computer science or related field of study required. </li> <br><br></ul><strong></strong></li><li><strong> Experience: <br><ul> <li>Familiar with networking equipment and desktop hardware/software troubleshooting techniques and repair. </li> <li>Experience in a healthcare setting a plus. </li> <br><br></ul><strong></strong></strong></li><li><strong><strong> Certification/Licensure: Must possess a valid driver’s license in order to drive between facilities.</strong></strong></li></strong>\n      "
    },
    {
        "position": "Devops Intern",
        "company": "Novetta ",
        "location": {
            "city": " Springfield",
            "state": "VA"
        },
        "posted": "2021-06-21T18:15:32.233Z",
        "url": "https://www.linkedin.com/jobs/view/devops-intern-at-novetta-2597809828?refId=wIe1HQQWGFnYLFF%2BEtqDIQ%3D%3D&trackingId=8PW3WjGSwyIdrhNwsYSpJg%3D%3D&position=13&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Join our team dedicated to developing and executing innovative solutions in support of customer mission success. Novetta is committed to cultivating a diverse, inclusive workplace culture, embracing our differences and perspectives to build a stronger, more successful company.<br><br><strong><u>Job Description<br><br></u></strong>Novetta is seeking a motivated individual for its Mission Platform Automation groups internship program. The Mission Platform Automation group, a part of Novettas Emerging Technologies division, fully embraces infrastructure as code while shifting to provide continued development and improvement through a CICD pipeline. As a member of this team, you will have the opportunity to work with cutting-edge DevOps technologies while working within a Scaled Agile (SAFe) development environment. You will aid in the integration and testing of code in support of DoD operations within the DevOps team and work alongside an experienced group of engineers on a complex production system<br><br>Responsibilities include<br><br>Participate in technical solution and design discussion<br><br>Utilize infrastructure as code tools to implement DevOps solutions<br><br>Aid in the development of new features focused on reliability and efficiency of infrastructure<br><br><strong><u>Basic Qualifications<br><br></u></strong>2+ years of education in computer science, information technology, engineering or related fields.<br><br>OR<br><br>Equivalent experience within the IT professions involving at least ONE of the following areas virtualization containerization automation infrastructure<br><br><strong><u>Desired Skills<br><br></u></strong>Understanding of Infrastructure as Code and technologies such as Ansible, Troposphere or Terraform<br><br>Understanding of Agile Development Practices<br><br>Experience or training on Devops pipeline technologies such as Jenkins or Auto Scaling Group<br><br>Experience or training on virtualization and containerization technologies such as Kubernetes, Docker, or ESXi<br><br>Security Clearance<br><br>Must be eligible to obtain a security clearance<br><br>Novetta, from complexity to clarity.<br><br>Novetta delivers highly scalable advanced analytics and secure technology solutions to address challenges of national and global significance. Focused on mission success, Novetta pioneers disruptive technologies in machine learning, data analytics, full-spectrum cyber, cloud engineering, open source analytics, and multi-INT fusion for Defense, Intelligence Community, and Federal Law Enforcement customers. Novetta is headquartered in McLean, VA with over 1,300 employees across the U.S.<br><br>Our culture is shaped by a commitment to our core values<br><br>Integrity We hold ourselves accountable to the highest standards of integrity and ethics.<br><br>Customer Success We strive daily to exceed expectations and achieve customer mission success.<br><br>Employee Focus We invest in our employees professional development and training, respecting individuality, and fostering a culture of diversity and inclusion.<br><br>Innovation We know that discovering new and innovative ways to solve problems is critical to our success and makes us a great company.<br><br>Excellence in Execution We take pride in flawless execution as we build a company that is best in class.<br><br>Earn a REFERRAL BONUS for the qualified people you know.<br><br>For more details or to submit a referral, visit<br><br>Novetta is an equal opportunityaffirmative action employer.<br><br>All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.\n      "
    },
    {
        "position": "Software Development Co-Op",
        "company": "FM Global ",
        "location": {
            "city": " Johnston",
            "state": "RI"
        },
        "posted": "2021-06-21T18:15:48.192Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-co-op-at-fm-global-2461147588?refId=wIe1HQQWGFnYLFF%2BEtqDIQ%3D%3D&trackingId=rbAL3IAG7wBnYr06nAvLuw%3D%3D&position=23&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Overview<br><br></strong>More information about this job:<br><br>We are a leading property insurer of the world's largest businesses providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles.<br><br>FM Global has several rewarding and exciting <strong>full-time, 6-month, paid </strong>co-op opportunities to offer to students that are motivated to apply their classroom experience, professional demeanor, and personal ambition. You will get firsthand experience while earning college credits and getting paid!<br><br>FM Global’s co-op opportunities are based at our corporate headquarters in <strong>Johnston, RI</strong>, which is part of the <strong>greater Providence area</strong>. With a large college-age population, Providence offers a vibrant arts and entertainment scene that includes local theatre and music, collegiate and minor league sporting events, great restaurants. Also, we are not that far from the beautiful RI beaches!<br><br><strong>Responsibilities<br><br></strong><strong>SOFTWARE DEVELOPMENT</strong>: As a software development co-op, you will have the opportunity to work on real-world problems and solutions with a team of hardworking developers. Your projects may consist of developing or modifying business applications, integrating business applications and databases, augmenting rapid software delivery and deployment processes, and automating software testing processes.<br><br><strong>Qualifications<br><br></strong>Skills we are seeking for the <strong>software development</strong> role:<br><ul><li>Enrolled in Computer Science or related degree program</li><li>Theory and principles of software engineering</li><li>Fluency in high-level programming languages (including OOP), environments, and tools for computing</li><li>Knowledge of databases and computer operating systems and basic knowledge of networks</li><li>Ability to work effectively in teams and solve problems<br></li></ul>FM Global is an Equal Opportunity Employer and is committed to attracting, developing and retaining a diverse workforce.\n      "
    },
    {
        "position": "Research Internship, Aristo",
        "company": "Allen Institute for AI (AI2) ",
        "location": {
            "city": " Seattle",
            "state": "WA"
        },
        "posted": "2021-05-29T18:16:02.429Z",
        "url": "https://www.linkedin.com/jobs/view/research-internship-aristo-at-allen-institute-for-ai-ai2-2609368890?refId=%2FDgBmYYwMA97ktmP%2BxX0Cg%3D%3D&trackingId=U5euozHSzDYBdx7Tp8s32Q%3D%3D&position=8&pageNum=8&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Who You Are:<br><br></strong>Are you passionate about taking artificial intelligence to the next level, to solve problems that require modeling, reasoning, and explanation? We are looking for talented researchers interested in applying their skills towards the next generation of intelligent systems, and pursuing our mission of AI for the common good.<br><br>After our success on Eighth Grade Science Exams, the Aristo project has broadened its mission towards problems requiring a both reading and explanation. This ambitious undertaking will require new advances in machine reading, natural language understanding, common-sense knowledge acquisition, machine inference, and more. We are looking for motivated people ready to take on a complex challenge with huge potential impact for the future of AI.<br><br>At AI2, you will be working with world-class AI researchers and talented software engineers. We perform team-based, ambitious research, with a mandate to strive for big breakthroughs, not just incremental progress, in an exciting and interactive workplace.<br><br><strong>Your Next Challenge:<br><br></strong>PhD, Masters and Undergraduate students in computer science are invited to apply for an internship on the Aristo team year-round. Applicants should have an interest in natural language processing, machine learning, knowledge representation, semantics, question answering, textual entailment, or computer vision. All interns are paired with an Aristo mentor and participate in AI2's groundbreaking work. There are no restrictions on publications based on internships. Pay is competitive, and visa sponsorship is available.<br><br>To see more about our current, future, and past interns, check out our internship page on our website!<br><br><strong>AI2 Intern of the Year Opportunity:<br><br></strong>AI2 offers an Intern of the Year Award that will recognize a research intern who has performed outstanding research that will lead to a high-quality paper aligned with one of AI2's projects. This winning intern will receive:<br><br><ul> <li>$10,000 cash prize (applicable to tax)</li> <li>Invitation to return to AI2 for another internship</li> <li>Potential future employment opportunity at AI2</li> <li>External announcement of their award</li> <br></ul><strong>Why AI2:<br><br></strong>In addition to AI2's core mission, we also aim to contribute to humanity through our treatment of each member of the AI2 Team. Some highlights are:<br><br><ul> <li><strong>We are a learning organization</strong> — because everything AI2 does is ground-breaking, we are learning every day. Similarly, through weekly AI2 Academy lectures, a wide variety of world-class AI experts as guest speakers, and our commitment to your personal on-going education, AI2 is place where you will have opportunities to continue learning alongside your coworkers.</li> <li><strong>We value diversity</strong> — We seek to hire, support, and promote people from all genders, ethnicities, and all levels of experience regardless of age. We particularly encourage applications from women, non-binary individuals, people of color, members of the LGBTQA+ community, and people with disabilities of any kind.</li> <li><strong>We value inclusion</strong> — We understand the value that people's individual experiences and perspectives can bring to an organization, and we are building a culture in which all voices are heard, respected and considered.</li> <li><strong>We emphasize a healthy work/life balance</strong> — we believe our team members are happiest and most productive when their work/life balance is optimized. While we value powerful research results which drive our mission forward, we also value dinner with family, weekend time, and vacation time. We offer generous paid vacation and sick leave as well as family leave.</li> <li><strong>We are collaborative and transparent</strong> — we consider ourselves a team, all moving with a common purpose. We are quick to cheer our successes, and even quicker to share and jointly problem solve our failures.</li> <li><strong>We are in Seattle </strong>— and our office is on the water! We have mountains, we have lakes, we have four seasons, we bike to work, we have a vibrant theater scene, and we have so much else. We even have kayaks for you to paddle right outside our front door. We welcome interest from applicants from outside of the United States.</li> <li><strong>We are friendly</strong> — chances are you will like every one of the 100+ (and growing) people who work here. We do.</li> <br></ul>AI2 is proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n      "
    },
    {
        "position": "Engineering Intern",
        "company": "Elbit Systems Ltd ",
        "location": {
            "city": " Orlando",
            "state": "FL"
        },
        "posted": "2021-03-30T18:17:12.643Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-intern-at-elbit-systems-ltd-2484661783?refId=u6tvXcR%2BnrYGNYAfBgUYIw%3D%3D&trackingId=brWWySJqzAuRD1o0HdVPbw%3D%3D&position=4&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        The position is for an Algorithm/Artificial Intelligence (AI) Engineering Intern with 0-3 years’ experience, to work on Machine Learning &amp; Artificial Intelligence R&amp;D and Rapid Prototyping efforts at the Elbit Systems of America (ESA) Orlando site. The job is critical to developing, demonstrating, and quantifying AI capabilities across ESA’s product and market portfolio. Algorithm development and deployment are central to this job function.<br><br><ul><li>Develop and analyze highly complex algorithms.</li><li>Implementation of algorithms in hardware and an understanding of the system design architecture trade space. </li><li>Provide technical support to customer, user lab, and on-aircraft testing</li><li>Perform system/product integration. </li><li>Verification and validation of highly complex system designs to ensure conformance with functional specifications and customer requirements. </li><li>Produce and/or review technical documents, specifications and standards. </li><li>Prepare Technical level presentations. </li><li>Provide outside contact with ESA affiliates and other contractors.</li><li>An ability to effectively document and communicate designs, results, reports, status and presentations.</li><li>Work independently and with internal/external organizations</li><li>Willingness to travel Domestically and Internationally.</li></ul><ul><li>Current pursuit of a Bachelor's Degree is required, Master’s Degree is highly desired<br><ul><li><strong>Specific Degree Field</strong> Computer Science, Software Engineering, Systems Engineering, Machine Learning, Artificial Intelligence, Data Science, or related</li></ul></li><li>0 to 3 years of defense, academic, or industrial experience in artificial intelligence, statistical machine learning, deep learning, Computer Vision, and natural language processing.</li><li>C, C++, Python, Matlab, Java experience</li><li>Experience implementing algorithms in Cuda (Highly Desired)</li><li>Unix/Linux OS experience (Highly Desired)</li><li>Embedded Software experience (Highly Desired)</li><li>Experience with Image processing / computer vision algorithm development</li><li>Machine Learning (ML) Network optimization for tactical applications</li><li>Hardware/software integration </li><li>Simulation and Modeling</li><li>User Interface development</li><li>Experience creating and presenting model output and performance of data to stakeholders.</li><li>Ability to read recent AI/ML research papers and adapt those into models to solve real world problems.</li><li>Experience creating and applying advanced statistical methods and complex algorithms such as regression, clustering, simulation, scenario analysis, neural networks, deep/reinforcement learning, genetic algorithms, and other machine learning techniques.</li><li>Experience with any deep learning framework, including Tensorflow, Caffe, MxNet, Torch, Theano.</li></ul>\n      "
    },
    {
        "position": "Electrical Engineer, Intern (Fall)",
        "company": "Square ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-06-07T18:17:17.641Z",
        "url": "https://www.linkedin.com/jobs/view/electrical-engineer-intern-fall-at-square-2580730600?refId=u6tvXcR%2BnrYGNYAfBgUYIw%3D%3D&trackingId=sbfpwdaHqdQBm114h%2FYvdQ%3D%3D&position=7&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Company Description<br><br></u></strong>Square builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We’re working to find new and better ways to help businesses succeed on their own terms—and we’re looking for people like you to help shape tomorrow at Square.<br><br><strong><u>Job Description<br><br></u></strong>Square's Hardware Team builds the tangible connection to Square. We started with a simple Reader that turns any phone or tablet into a mobile point of sale - and we continue to lead this category with advances in technologies that define point of sale hardware (NFC, display, WiFi, Bluetooth, touch). Our hardware engineers design and develop outstanding hardware products. They understand the subtleties of user interaction, robust communication interfaces, and smart product design.<br><br><strong><u>For This 12-week Remote Internship, You Will<br></u></strong><ul><li>Become intimately familiar with Square's hardware products and manufacturing processes.</li><li>Research technologies for our next-generation hardware products.</li><li>As part of the Systems Engineering track, you will develop device characterization plans and measurement-setup prototypes for new technologies.</li><li>As part of the Electrical Design Engineering track, you will help design and test electrical systems for new Square hardware products</li><li>Work with Square's Devices Software Engineering group to understand embedded test access and APIs.</li><li>Write and debug engineering automation software for the lab and the factory.</li><li>Reach beyond boundaries to make Square's products better wherever you see the chance<br><br></li></ul><strong><u>You Are<br><br></u></strong><strong>Qualifications<br></strong><ul><li>Pursuing a degree in Computer Engineering, Electrical Engineering, Computer Science, or related technical field, graduating between May 2022 and June 2024.</li><li>Familiar with Python, MATLAB, or similar programming language</li><li>Experience with EE schematics and PCB layout</li><li>EE skills including switch mode power supplies, amplifiers, microcontrollers, batteries and charging systems, and high speed digital signals.</li><li>Familiar with hardware lab equipment for test, measurement (e.g. oscilloscope, power supply, function generator, spectrum analyzer, DMM), or prototyping (Soldering, Raspberry Pi, Arduino, 3D printing, powertools)</li><li>Excited to work on hands-on projects and to make things work in EE or software realms</li><li>Eager to apply engineering skills to dig into challenges that are outside of your expertise.</li><li>You're collaborative and excited to work as part of a team, ask questions, and share information to solve problems.<br><br></li></ul><strong><u>Even Better<br></u></strong><ul><li>Experience measurement systems automation.</li><li>Knowledgeable of statistics</li><li>Familiar with the co-existence of multiple technologies in a unified system.</li><li>Experience with Altium Schematic and PCB design tools<br><br></li></ul><strong><u>Additional Information<br><br></u></strong>At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\n      "
    },
    {
        "position": "Summer Internship - Digital Innovation Support",
        "company": "JCS Solutions LLC ",
        "location": {
            "city": " Fairfax",
            "state": "VA"
        },
        "posted": "2021-05-31T18:18:28.008Z",
        "url": "https://www.linkedin.com/jobs/view/summer-internship-digital-innovation-support-at-jcs-solutions-llc-2617030329?refId=J9Yt50GOnAr2B6dtQcnXPQ%3D%3D&trackingId=oOhxuRoiLTUIp7SOW8TV5A%3D%3D&position=3&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        JCS is seeking an intern to support its digital innovation team. Under the guidance of our digital innovative team, you will have the opportunity to work on a summer project that delivers value to the business. Applicants will be reviewed on a regular basis until the position is filled. Our summer internships are paid and will start in June. The rate will be based on experience. If you are interested in being considered for an internship, please send us your resume and include a cover letter introducing yourself and tell us what you are interested in and what your career goals are and how an internship can help you get there.<br><br><strong>Requirements<br><br></strong>- Candidates must:<br><ul><li>Be enrolled in a computer science or similar program at a college or university</li><li>Intellectually curious, enjoy solving problems, highly collaborative and an understanding of the digital landscape.</li><li>Cares about creating the best experience for your customer whether is an internal or external customer</li><li>Works well independently and within a team</li><li>Strong writing, editing, and online research skills.<br><br></li></ul><strong>About JCS Solutions LLC:<br><br></strong>JCS Solutions LLC is an IT Government Contracting company dedicated to providing the highest quality of services and solutions. Our employees enjoy a work culture that promotes innovation, and we've been certified as a Great Place to Work!<br><br>JCS Solutions LLC benefits include 401k retirement plans, paid time off, health insurance, dental insurance, vision insurance, life insurance, long term disability, short term disability, and opportunities for professional development.<br><br>It is JCS’s policy to promote equal employment opportunities. All qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law.<br><br>If you require additional accommodation, please contact us at HR@jcssolutions.com or (703) 972-9115.<br><br>Powered by JazzHR<br><br>GEaP1z3jH8\n      "
    },
    {
        "position": "NLP Research Intern",
        "company": "Abridge ",
        "location": {
            "city": " United States",
            "state": "United States"
        },
        "posted": "2021-05-31T18:18:37.753Z",
        "url": "https://www.linkedin.com/jobs/view/nlp-research-intern-at-abridge-2621946905?refId=J9Yt50GOnAr2B6dtQcnXPQ%3D%3D&trackingId=rw%2ByQX3ziUYcCeL2Mr1flQ%3D%3D&position=9&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        When you think about your last doctor’s appointment, how much do you actually recall? If you’re like most people, you’ll likely forget over 40% of the conversation. Details fall through the cracks, generic printouts you receive end up in the trash, and important information never makes it to other doctors. Ultimately, you’re left needing to connect the dots in your care. That’s why we started Abridge with a simple thesis: if we can shift agency to consumers, we can help them stay on top of their health. When you use Abridge to record your health conversations, the conversations themselves become your medical record. It’s as easy as that.<br><br>We are looking for research interns to working on exciting NLP challenges using our large annotated proprietary healthcare datasets. You will be able to create/customize your internship research statement and collaborate with our in-house Machine Learning research team. At the end of the internship, you will also have the opportunity to publish your work at top tier conferences such as NeurIPS, ICML, ICLR, NAACL, and ACL.<br><br>The goal of the internship is to advance the state-of-the-art in one or many of the following research areas:<br><ul><li> Dialog Understanding</li><li> Sequence-to-Sequence Modeling</li><li> Clinical Natural Language Processing</li><li> Information Extraction</li><li> Machine Learning using Ontologies or Knowledge graphs<br><br></li></ul><strong> Required Qualification <br></strong><ul><li> Must be accepted to or currently enrolled in an MS or Ph.D. program in Computer Science or a related field</li><li> Must have at least one NLP machine learning paper submitted or published</li><li> Experience in utilizing theoretical and empirical research to solve problems</li><li> Ability to communicate complex research ideas in a clear, precise, and actionable manner</li><li>Research internships are offered year-round with flexible durations<br><br></li></ul><strong>Compensation<br></strong><ul><li>$80,000-$100,000 per year</li></ul>Life at Abridge<br><br>At Abridge, we’re driven by our mission to bring understanding and follow-through to every medical conversation. Our culture is founded on doing things the “inverse” way in a legacy system—focusing on patients, instead of the system; focusing on outcomes, instead of billing; and focusing on the end-user experience, instead of a hospital administrator's mandate.<br><br>Abridgers are engineers, scientists, designers, and health policy experts from a diverse set of backgrounds—an experiment in alchemy that helps us transform an industry dominated by EHRs and enterprise into a consumer-driven experience, one recording at a time. We believe in strong ideas, loosely held, and place a high premium on a growth mindset. We push each other to grow and expose each other to the latest in our respective fields. Whether it’s holding a PhD-level deep dive into understanding fairness and underlying bias in machine learning models, debating the merits of a Scandinavian design philosophy in our UI/UX, or writing responses for Medicare rules to influence U.S. health policy, we prioritize sharing our findings across the team and believe that \"you need to taste good things to have good taste.\"<br><br>Abridge is an equal opportunity employer. Diversity and inclusion is at the core of what we do. We actively welcome applicants from all backgrounds (including but not limited to race, gender, educational background, and sexual orientation).\n      "
    },
    {
        "position": "Data Analyst Internship - Emory Rollins Earn & Learn Program",
        "company": "Integrity Management Services, Inc. ",
        "location": {
            "city": " Alexandria",
            "state": "VA"
        },
        "posted": "2021-06-22T18:18:44.466Z",
        "url": "https://www.linkedin.com/jobs/view/data-analyst-internship-emory-rollins-earn-learn-program-at-integrity-management-services-inc-2613754067?refId=J9Yt50GOnAr2B6dtQcnXPQ%3D%3D&trackingId=%2BaVGeEm%2FEfsbrA4nDd5jhA%3D%3D&position=13&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>This is a remote internship program for Emory University Rollins Earn and Learn Students only. <br><br></strong><strong><u>Description Of Mission &amp; Target Clients<br><br></u></strong>IntegrityM has a record of success supporting government agencies and private sector businesses that sustain major government programs, such as Medicare and Medicaid. Clients include the Centers for Medicare &amp; Medicaid Services, United States Postal Service, Office of Inspector General, state governments, and a variety of private sector government support contractors.<br><br>IntegrityM brings the highest standards of excellence and professionalism to every engagement. Integrity isn’t just in our name, it’s in all we do. We work closely with our clients, listening to their specific needs and tailoring services to meet and exceed their expectations. We are focused on driving results, on-time and within budget.<br><br>The IntegrityM team includes former government program managers, subject matter experts, clinicians, and highly-qualified technical staff with advanced degrees across a range of disciplines – from economics, law, and public health, to statistics, computer science, and information technology.<br><br><strong><u>Data Analyst Internship Posting Description<br><br></u></strong>At IntegrityM, our employees are driven by a passion for advancing with balancing quality of life and sustainability. We deliver creative solutions that exceed our goals and foster an environment that creates unlimited opportunities for employees.<br><br>We are now seeking Data Analyst Interns to join our team to support data analysis and visualization projects across the organization. During this internship, you will be responsible for modeling complex problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques.<br><br><strong>You Will <br></strong><ul> <li>Perform study design, data analysis and report preparation</li> <li>Study preliminary data analysis (trends), literature review, experience and expertise of the team, and mandated projects</li> <li>Conduct data analysis, including data preparation and presentation of findings is performed in conjunction with other analytics</li> <li>Create reports of your findings</li> <br><br></ul><strong>Specific Data Analysis Projects <br></strong><ul> <li> <strong>Ad hoc data analysis </strong> Perform feasibility analysis using policy and data to determine if a data analysis study has merit to become a full data analysis project. </li> <li> <strong>GLYDE </strong> Support running and enhancement of IntegrityM’s proprietary GLYDE tool. Must possess strong statistical experience/strength understanding sampling and extrapolation, excellent attention to detail and strong programming skills including use of SAS, R, Python.</li> <li> <strong>Disparate data aggregation</strong> Perform data matching and scoring techniques to make disparate data meaningful.</li> <br></ul><strong>Public Health Competencies/Projects Potentially Involved <br></strong><ul> <li> <strong>Covid-19 Data Analysis </strong> Conduct research, policy analysis, data analysis, data mining with regards to various relevant Covid-19 initiatives, including assistance with our internal proprietary tool C.O.D.A. </li> <li> <strong>Fraud Waste and Abuse (FWA) Analysis</strong> Conduct an analysis of the data and provide modeling support for analysis of FWA of medical claims based on publicly available data.<br><ul> <li>Centers of Medicare &amp; Medicaid Services - Medicare Physician and Other Supplier National Provider Identifier (NPI) Aggregate Report Calendar Years 2015-2017</li> <li>List of Excluded Individuals and Entities from the Office of Inspector General (OIG)</li> <li> NPI Registry – used to map NPIs to LEIE fraud list </li> </ul> </li> <li> <strong>CMS Limited Data Set Files (LDS) Conduct analysis using CMS LDS files</strong> and provide support for potential whitepaper development<strong>. </strong> </li> <li> <strong>CMS Public Used Files</strong> Conduct analysis using CMS Public Use Files and provide support for potential whitepaper/blog development. CMS has developed a public use file that enables researchers and policymakers to evaluate geographic variation in the utilization and quality of health care services for the Medicare fee-for-service population. The Geographic Variation Public Use File includes demographic, spending, utilization, and quality indicators at the state level (including the District of Columbia, Puerto Rico, and the Virgin Islands), hospital referral region (HRR) level, and county level.</li> <li> <strong>FEMA Open Data Sets</strong> Conduct analysis on FEMA Open Data Sets and support whitepaper/blog development. FEMA collects vast amounts of data on multiple aspects of emergency management — Disaster Information, Individual Assistance, Public Assistance, Hazard Mitigation, National Flood Insurance Program (NFIP), and Grants. Data sets are available for download, along with an application programming interface (API) that provides data in an easily digestible, machine readable format. </li> <br><br></ul>The Centers for Medicare &amp; Medicaid Services (CMS) is responsible for administering the Medicare, Medicaid and State Children's Health Insurance Programs, as well as a number of health oversight programs. CMS gathers and formats data to support the agency's operations. Information about Medicare beneficiaries, Medicare claims, Medicare providers, clinical data, and Medicaid eligibility and claims are included. These data are made available to the public, subject to privacy release approvals and the availability of computing resources.<br><br>https //www.cms.gov/Research-Statistics-Data-and-Systems/Files-for-Order/LimitedDataSets<br><br>https //www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/Medicare-Geographic-Variation/GV_PUF# ~ text=The%20Centers%20for%20Medicare%20%26%20Medicaid,fee%2Dfor%2Dservice%20population.<br><br>https //www.fema.gov/about/openfema/data-sets<br><br><strong><u>About Us<br><br></u></strong>Integrity Management Services, Inc. (IntegrityM) is an award winning woman-owned small business specializing in assisting government healthcare organizations prevent and detect fraud and abuse in their programs and ensuring compliance with regulations. Results are achieved through consulting services such as statistical and data analytics, technology solutions, compliance, audit, investigation, medical review and training.<br><br>At IntegrityM, we offer a culture of opportunity, recognition, collaboration, and supporting our community. We thrive off of these fundamental elements that make IntegrityM a great place to work. We offer the flexibility our employees need to challenge themselves and focus on advancing their professional development and careers. Large company perks…Small company feel! http //www.integritym.com<br><br><strong><u>Requirements<br><br></u></strong>You Are<br><ul> <li>An Emory University Rollins School of Public Health full-time MPH/MSPH student (Epidemiology and/or Biostatistics preferred)</li> <li>Possess strong statistical skills and able to work hands-on with SAS or other statistical programs (Python or R)</li> <li>Experience with health care data analysis</li> <li>Familiar with health related policy research</li> <li>Possess effective at oral and written communication</li> <li>Able to work on multiple projects</li> <li>Motivated &amp; driven to succeed</li> <br><br></ul>Integrity Management Services, INC, is an Equal Opportunity Employer and we do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, and gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.\n      "
    },
    {
        "position": "Insight Analyst Intern",
        "company": "The Marketing Store, North America ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-05-29T18:19:51.557Z",
        "url": "https://www.linkedin.com/jobs/view/insight-analyst-intern-at-the-marketing-store-north-america-2605500865?refId=jwRv3SCAZkhjz%2BEYG6P7sw%3D%3D&trackingId=ZplESKuJMYAqWm7zzWE6BA%3D%3D&position=8&pageNum=14&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Overview<br><br></u></strong><strong> A BIT ABOUT US <br><br></strong>The Marketing Store is a consumer engagement agency that believes in the power of experience to build brands. Experience is any valuable interaction between a brand and consumer, and it’s the currency of 21st century marketing; consumers are placing greater value on it, technology provides brands with greater opportunity to deliver, and it’s the key to unlocking huge growth.<br><br>Our core skill is therefore transforming brands, products and services into experiences. To leave lasting impressions and influence future purchasing decisions.<br><br>We do this through our expertise in the sharing of experience and the science of experience. Yet none of this can be achieved without our investment in people and culture. We’re committed to breaking down silos to create more efficient and better-connected working processes. That’s why we are a people-first agency, built to serve consumer-first brands.<br><br><strong> WHAT ARE OUR PEOPLE LIKE? <br><br></strong>Our agency is home to creative problem solvers. Those who overcome any obstacle to successfully put consumer-first ideas, products and technologies into market.<br><br>People who wear their talent lightly. Willing to be part of a close community that pushes them to be better.<br><br>Because our goal is to bring people and brands closer together. Closer insights, closer connections and closer collaboration breed better, more effective work. It’s this dedication to getting closer that drives us to go further.<br><br><strong><u>Who We Work With<br><br></u></strong>We apply insightful, strategic, brand-building processes to the creation industry-leading, award-winning promotions, digital experiences, retail activations, CRM and loyalty programs, premiums and brand events.<br><br>Our clients include McDonald’s, Nissan, Infiniti, T-Mobile and more!<br><br><strong> WHY WE THINK YOU WILL LOVE THIS ROLE <br><br></strong>The Decision Science team works to help bring client data to life, measuring and interpreting complex data sets, delivering actionable insights to our clients. We act as business consultants to our clients, enabling them to make data-driven decisions about their marketing programs and optimize customer communications.<br><br><strong><u>Responsibilities<br><br></u></strong><strong> RESPONSIBILITIES <br></strong><ul><li> Work with large, complex data sets to derive actionable business insights and optimization opportunities for key clients </li><li> Support the communication of results to clients through the preparation of reports, dashboards and presentations, in conjunction with decision scientists and managers </li><li> Assist in the definition, setup and execution of omnichannel measurement plans, including digital tagging of websites and mobile apps </li><li> Manipulate, query and extract data from relational databases to answer ad-hoc client queries </li><li> Work with and present results to stakeholders in multiple areas and levels of the agency <br><br></li></ul><strong><u>Desired Skills &amp; Experience<br><br></u></strong><strong> SKILLS AND EXPERIENCE WE WOULD LIKE YOU TO HAVE <br></strong><ul><li> Working towards a degree in a quantitative/scientific discipline, e.g., computer science, computer engineering, mathematics, physics, statistics, engineering, psychology, neuroscience, cognitive science, decision science, economics, etc. </li><li> Experience with relational database languages (e.g. SQL) </li><li> Strong experience with Excel and intermediate PowerPoint </li><li> Experience translating analysis results into business recommendations </li><li> Experience cleansing, manipulating and transforming datasets </li><li> Strong written and verbal communication skills </li><li> A team-first attitude and willingness to do whatever it takes to accomplish goals </li><li> A desire to learn new techniques and share knowledge with others </li><li> Passion for understanding behavior, influence, and marketing <br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> Experience with digital tagging using Google Analytics, Google Tag Manager, and/or Adobe Analytics (Omniture) </li><li> Experience using business intelligence software such as Tableau, PowerBI, Looker etc</li></ul>\n      "
    },
    {
        "position": "Fall Intern - Software Engineering with Security Clearance",
        "company": "ClearanceJobs ",
        "location": {
            "city": " Irvine",
            "state": "CA"
        },
        "posted": "2021-06-14T18:20:27.613Z",
        "url": "https://www.linkedin.com/jobs/view/fall-intern-software-engineering-with-security-clearance-at-clearancejobs-2621552495?refId=vJGWLIR5utRSvJufjr6bLw%3D%3D&trackingId=0QUcqIePoUDFhM1hmXF%2BOw%3D%3D&position=6&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Anduril is a defense technology company, bringing Silicon Valley talent and funding to the defense sector. Our technology helps our customers solve their toughest challenges by enabling them to make better, more informed decisions in life-and-death situations. We've assembled a diverse team of experts in artificial intelligence, computer vision, sensor fusion, optics, and data analysis that are creating software and hardware solutions to radically evolve the capabilities of the United States and our allies. If you are passionate about solving problems that have real impact, come join Anduril and build the future of defense. As a Software Engineer Intern, you will be working alongside a team of engineers with a diverse set of backgrounds and skills. Anduril has a collaborative culture with plenty of opportunities for ownership. As a member of the team, your decisions today will have a large impact on the company now and into the future, as well as our customers. We believe that simple systems are easier to understand, maintain, and scale. You will be making trade-offs as you work to ensure that our systems are prepared to scale - so being able to effectively communicate these trade-offs with your teammates is a must. WHAT YOU'LL DO * Engineers are responsible for the full product lifecycle, including design, implementation, deployment, and maintenance.<br><li> Collaborate with cross-functional internal hardware &amp; software teams to incorporate their innovations and vice versa.</li><li> Take feedback to iterate on and improve Anduril's software systems. REQUIRED QUALIFICATIONS * Prior engineering internship experience, along with current academic pursuits &amp; studies in the areas of: Computer Science, Computer/Software Engineering, Mathematics, or Physics.</li><li> Approaching Junior year or beyond at the time of the internship.</li><li> Familiarity with algorithms, data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.</li><li> Proficiency in a variety of programming languages such as Go, Java, C++, Python, JavaScript, etc.</li><li> A desire to work on software and applications that have real-world impact.</li><li> U.S. Person status is required as this position needs to access export controlled data. PREFERRED QUALIFICATIONS * Have a bias for action. If you see a problem, you want to solve and fix it.</li><li> Be naturally curious about the technologies and tools you use.</li><li> Have a point-of-view, but are still low-ego. Anduril is an equal-opportunity employer, and we encourage candidates from all backgrounds to apply. If you are someone passionate to work on problems that matter, we'd love to hear from you!</li>\n      "
    },
    {
        "position": "Summer Internship - Wireless Optical Communications - Communication architecture analysis",
        "company": "X, the moonshot factory ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-02-28T18:20:54.304Z",
        "url": "https://www.linkedin.com/jobs/view/summer-internship-wireless-optical-communications-communication-architecture-analysis-at-x-the-moonshot-factory-2444800725?refId=vJGWLIR5utRSvJufjr6bLw%3D%3D&trackingId=U%2B2SCm7u3cfLZm794jxv%2BA%3D%3D&position=23&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.<br><br><strong>THE FOUNDATION OF AN AMAZING JOURNEY<br><br></strong>Our goal at X is to make the world a radically better place. In order to do that we seek fresh unexpected perspectives, from different fields, and that’s why we’re excited about you.<br><br>Life here isn’t easy, but it’s fun. We’re trying to build things most people can’t even imagine, and we’re doing it with the hope of making a huge, positive impact on the world. You’ll be embedded into a moonshot project, where you’ll partner with team members to solve key challenges.<br><br>This isn’t your ordinary internship. You’ll be positively challenged and pushed professionally, in ways that you may have never experienced. If this excites you - keep reading.<br><br><strong><u>During Your Internship You Can Expect<br></u></strong><ul><li> To be placed on one of our confidential or public X projects </li><li> To get paid competitively and with Google benefits </li><li> To be part of a lively community of other Interns and Residents </li><li> To addend colloquium and discussions with team leads from across Google, DeepMind and external organizations <br><br></li></ul><strong><u>Details<br></u></strong><ul><li> Due to Covid-19, internships are held remotely through 2021 </li><li> Laptops and equipment will be provided </li><li> Duration: May-June 2021 start date; 12-14 weeks on average <br><br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Must be enrolled in an academic program and working towards completing an Undergraduate or Master’s degree <br><br></li></ul><strong><u>What You'll Be Working On<br></u></strong><ul><li> Analysis of performance for fixed-point wireless optical communications systems that use coherent (e.g., heterodyne, homodyne, intradyne) or intensity modulation and detection techniques. </li><li> Investigation and identification of key system requirements and specifications for integrated photonic communication platforms that employ the aforementioned communication schemes. </li><li> Modeling and simulation of the atmospheric channel for evaluation of coherent communication systems. </li><li> Analysis of field data to validate assumptions and models, as well as extract key insights for system design. <br><br></li></ul><strong><u>Minimum Qualifications<br></u></strong><ul><li> Currently enrolled in a Graduate program in Electrical Engineering, Aerospace Engineering, Computer Science, Physics or other similar discipline. </li><li> Experience with one or more scientific computing tools, such as MATLAB, Python, C/C++. </li><li> Experience with implementation and performance analysis of wireless optical telecommunications systems in terms of channel capacity, bit error rate etc. </li><li> Knowledge of parameter estimation and detection in noisy channels. <br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> Familiarity with integrated photonics platforms and the nominal specifications for various device technologies (e.g., amplifiers, filters, lasers, photodetectors). </li><li> Experience with modeling of atmospheric turbulence for terrestrial horizontal path scenarios. </li><li> Experience with designing, testing, and characterizing coherent optical systems for terrestrial communications.</li></ul>\n      "
    },
    {
        "position": "Summer Internship - Wireless Optical Communications - Communication architecture analysis",
        "company": "X, the moonshot factory ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-02-28T18:20:57.560Z",
        "url": "https://www.linkedin.com/jobs/view/summer-internship-wireless-optical-communications-communication-architecture-analysis-at-x-the-moonshot-factory-2444800725?refId=7k7QIKf%2BhEjU%2FhlRMyBSUA%3D%3D&trackingId=z%2B53DMOtDk2GuuwySvnkAQ%3D%3D&position=1&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.<br><br><strong>THE FOUNDATION OF AN AMAZING JOURNEY<br><br></strong>Our goal at X is to make the world a radically better place. In order to do that we seek fresh unexpected perspectives, from different fields, and that’s why we’re excited about you.<br><br>Life here isn’t easy, but it’s fun. We’re trying to build things most people can’t even imagine, and we’re doing it with the hope of making a huge, positive impact on the world. You’ll be embedded into a moonshot project, where you’ll partner with team members to solve key challenges.<br><br>This isn’t your ordinary internship. You’ll be positively challenged and pushed professionally, in ways that you may have never experienced. If this excites you - keep reading.<br><br><strong><u>During Your Internship You Can Expect<br></u></strong><ul><li> To be placed on one of our confidential or public X projects </li><li> To get paid competitively and with Google benefits </li><li> To be part of a lively community of other Interns and Residents </li><li> To addend colloquium and discussions with team leads from across Google, DeepMind and external organizations <br><br></li></ul><strong><u>Details<br></u></strong><ul><li> Due to Covid-19, internships are held remotely through 2021 </li><li> Laptops and equipment will be provided </li><li> Duration: May-June 2021 start date; 12-14 weeks on average <br><br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Must be enrolled in an academic program and working towards completing an Undergraduate or Master’s degree <br><br></li></ul><strong><u>What You'll Be Working On<br></u></strong><ul><li> Analysis of performance for fixed-point wireless optical communications systems that use coherent (e.g., heterodyne, homodyne, intradyne) or intensity modulation and detection techniques. </li><li> Investigation and identification of key system requirements and specifications for integrated photonic communication platforms that employ the aforementioned communication schemes. </li><li> Modeling and simulation of the atmospheric channel for evaluation of coherent communication systems. </li><li> Analysis of field data to validate assumptions and models, as well as extract key insights for system design. <br><br></li></ul><strong><u>Minimum Qualifications<br></u></strong><ul><li> Currently enrolled in a Graduate program in Electrical Engineering, Aerospace Engineering, Computer Science, Physics or other similar discipline. </li><li> Experience with one or more scientific computing tools, such as MATLAB, Python, C/C++. </li><li> Experience with implementation and performance analysis of wireless optical telecommunications systems in terms of channel capacity, bit error rate etc. </li><li> Knowledge of parameter estimation and detection in noisy channels. <br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> Familiarity with integrated photonics platforms and the nominal specifications for various device technologies (e.g., amplifiers, filters, lasers, photodetectors). </li><li> Experience with modeling of atmospheric turbulence for terrestrial horizontal path scenarios. </li><li> Experience with designing, testing, and characterizing coherent optical systems for terrestrial communications.</li></ul>\n      "
    },
    {
        "position": "Project Management Data Analyst Fall Intern",
        "company": "Osmose ",
        "location": {
            "city": " Peachtree City",
            "state": "GA"
        },
        "posted": "2021-06-14T18:21:07.127Z",
        "url": "https://www.linkedin.com/jobs/view/project-management-data-analyst-fall-intern-at-osmose-2584348882?refId=7k7QIKf%2BhEjU%2FhlRMyBSUA%3D%3D&trackingId=vTJOF8RUsW13Y0FdowpcDQ%3D%3D&position=7&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About Osmose<br><br></u></strong>With 85 years of experience, Osmose proudly serves the electric utility and telecommunications industries across the U.S., helping enable the delivery of safe, reliable and affordable electricity and communications services to millions of customers nationwide. We are the industry leader in wood and steel structure condition assessment, life-extension and rehabilitation services. Our mission is to accurately inspect and mitigate aging infrastructure in a planned, programmatic manner that minimizes owner costs while maximizing benefits.<br>Headquartered in Peachtree City, Georgia, with satellite offices in Atlanta, Buffalo, Syracuse and Boston, the Osmose footprint extends throughout the country. Our employees are inspired to perform each and every day by our core values of integrity, customer focus, safety, respect, excellence, flexibility, efficiency and ownership. Our staff and field personnel represent some of the most tenured, well trained, and innovative professionals in the industry.<br>Osmose is currently seeking a Data Analyst Intern in our Project Management Department to become an integral part of our team this Fall! You will analyze data to understand business and market trends in order to increase company revenue and efficiency.<br>This position is based at our corporate office in Peachtree City, GA. Pay is between $14 - $17 per hour.<br>Preference will be given to student pursuing a bachelors degree in industrial engineering, math or computer science with focus on database management.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Generate project dashboards and reports</li><li> Use data to understand business patterns and trends</li><li> Analyze internal and external data through quantitative research</li><li> Communicate findings to company through standard and ad hoc reports</li><li> Promote best practices in data analysis and reporting</li><li> Collaborate with cross-functional teams<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li> Previous experience in business intelligence, analysis, or other related field</li><li> Knowledge of statistical tools and business reporting</li><li> Strong problem solving and critical thinking skills</li><li> Strong attention to detail</li><li> Ability to prioritize and multitask</li><li> Must be a self-starter with proficiency in MS Excel, MS Word, MS PowerPoint, and the ability to lead presentations with confidence</li><li> Candidates with basic programming experience with tools such as MATLAB are preferred<br></li></ul>Osmose is an Equal Opportunity employer. EOE M/F/Disabled/Vet<br>REQ ID 766\n      "
    },
    {
        "position": "Intern-Cloud Networking",
        "company": "Futurewei Technologies, Inc. ",
        "location": {
            "city": " Bellevue",
            "state": "WA"
        },
        "posted": "2021-05-29T18:22:39.108Z",
        "url": "https://www.linkedin.com/jobs/view/intern-cloud-networking-at-futurewei-technologies-inc-2605980692?refId=UBGpV5N%2BI1jN3%2B4omLFlWg%3D%3D&trackingId=uxaeB9LvCHei8Xx0DgRbvA%3D%3D&position=18&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        The Futurewei Cloud Networking team is pioneering cutting-edge technologies on Cloud Computing, with a focus on design and implementation of Futurewei's next generation cloud infrastructure for virtual networking services including Virtual Private Cloud, Elastic Load Balancer, and Elastic IP, among others. We are seeking a summer intern to focus on cloud native SDN research and development to build world-class networking solutions for the public cloud from the ground up. The ideal candidate is expected to have a strong background in distributed systems and computer networking. Candidates with prior or ongoing research on software-defined networking, networking virtualization, and SmartNIC offloading, are strongly preferred.<br><br><strong><u>Requirements &amp; Qualifications<br><br></u></strong>The successful candidate will have:<br><ul> <li> BS or MS in Computer Science or related fields. Doctoral or master’s students in a research track are preferred. </li> <li> Experience with SDN, network virtualization, OpenStack, L3 and above, or experience with hardware offloading to SmartNICs, or networking programming with P4. </li> <li> Proficiency with Java, Go or C/C++ with excellent problem-solving skills. </li> <li> Broad familiarity with modern concepts/algorithm/data structures in the area of distributed systems. </li> <li> Great understanding of software development life cycle. </li> <li> Excellent written and verbal communication skills. Must be able to clearly articulate ideas and concepts to fellow engineers and researchers. </li> <li> A true team player, willing to work within a multi-culture organization. </li> <br></ul>This is an intern position at our Bellevue, WA location; working with researchers and engineers within the Cloud Networking team.<br><br><strong> Futurewei Technologies, Inc . </strong> <strong> is proud to be an Equal Opportunity Employer.<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n      "
    },
    {
        "position": "Technical Support Intern",
        "company": "Verkada ",
        "location": {
            "city": " San Mateo",
            "state": "CA"
        },
        "posted": "2021-06-07T18:23:05.838Z",
        "url": "https://www.linkedin.com/jobs/view/technical-support-intern-at-verkada-2479992168?refId=nc8PllSWsY4Sx8u2c95OKQ%3D%3D&trackingId=%2F%2BKvK8ROY2Xuem%2FF5xUz7A%3D%3D&position=10&pageNum=19&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About Verkada<br><br></u></strong>At Verkada, we’re rethinking what it means to be physically safe. Today, we build security cameras that detect action, identify danger and help keep people and places safe and secure. Using a combination of software and hardware, we’re transforming an industry that has seen little innovation for decades—and we already support thousands of customers. But this is just the beginning. We envision a world in which security systems feel as seamless and modern as the organizations they protect and our enterprise solution becomes a model for not just business security, but public security as well.<br><br>Verkada is the leader in cloud managed video surveillance and physical security. Our mission is to be the essential physical security software layer for every building, and the foundation of a larger enterprise IoT infrastructure. As a Technical Support Intern, you will work on leading-edge cloud managed IoT technology while providing troubleshooting, design, and integration assistance to our growing base of enterprise customers. Interns work on the same issues and projects as full-time Technical Support Engineers, so if you are interested in making an impact and learning valuable career skills in a highly technical real-world environment, come join us.<br><br><strong><u>Responsibilities<br></u></strong><ul><ul><li>Troubleshoot network, hardware and software issues related to the Verkada platform.</li><li>Provide best practice design and integration expertise to enterprise customers.</li><li>Communicate technical matters to customers both orally and in writing.</li><li>Own customer issues from creation to resolution.</li><li>Collaborate with Engineering and Product teams to test new products and identify bugs.</li><li>Contribute content to our Knowledge Base.</li><li>Lab testing and team projects.<br><br></li></ul></ul><strong><u>Requirements<br></u></strong><ul><ul><li>Third or Fourth year college student working towards a Bachelor’s or Master's degree in a related technical discipline: Networking, Telecommunications, Systems Administration, Information Technology, Computer Science, Computer Engineering, or Cybersecurity from an accredited college.</li><li>Coursework with a focus on computer networking, Linux, computer systems, Python or other coding language.</li><li>Ability to communicate complex technical matters both orally and in writing.</li><li>Demonstrated problem-solving skills and attention to detail.</li><li>Ability to work within a team environment.</li><li>Industry certifications are a plus: CCNP, CCNA, CCENT, CCDA, CWNP, CWNA, MCSE, CEH, Network+, Security+, A+.<br><br></li></ul></ul><strong><u>About Our Team<br><br></u></strong>Behind the scenes, we’re a team of computer scientists, hardware engineers and experienced founders who saw a chance to make a real impact. We’re united by the challenge of building beautiful products, designed for real people—and by our commitment to using technology responsibly. We believe keeping data private and secure is core to our safety as individuals, businesses and communities and we put great care into building systems that embody our values as people. Likewise, many of Silicon Valley’s top investors believe in us: we’re backed by Sequoia Capital, FirstRound, Meritech and Siemens (Next47).<br><br>Verkada is an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status, and encourage all qualified applicants to apply.\n      "
    },
    {
        "position": "Water Quality Intern-Local Only ( SLC , UT )",
        "company": "Student Conservation Association ",
        "location": {
            "city": " Arlington",
            "state": "VA"
        },
        "posted": "2021-04-29T18:23:30.978Z",
        "url": "https://www.linkedin.com/jobs/view/water-quality-intern-local-only-slc-ut-at-student-conservation-association-2562673294?refId=JoH5ZISmCVezj6wJeEOPMw%3D%3D&trackingId=zGboykUYwD3HMefkBa6m5w%3D%3D&position=1&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Expected Dates<br><br>June 15, 2021 to October 11, 2021<br><br>Site<br><br>USBR Upper Colorado Region<br><br>Position ID<br><br>PO-00731710<br><br><strong>Local Salt Lake City area candidates only</strong>This position is located within the Water Quality Group of the Upper Colorado Region, Bureau of Reclamation, in Salt Lake City, Utah. The Upper Colorado Region manages water and related resources within the Colorado, Rio Grande, and Great Basin river drainages in the states of Arizona, Colorado, New Mexico, Texas, Utah, and Wyoming. The Water Quality Group conducts field water quality monitoring investigations on Reclamation projects within those states on reservoirs including Lake Powell (AZ-UT), Flaming Gorge (UT-WY), Navajo (CO-NM), and many more. The responsibilities and duties of the intern will include assisting with preparing and conducting water quality field investigations on Reclamation reservoirs and for other Reclamation projects. Investigations on Reclamation reservoirs will be conducted from watercraft operated by trained Reclamation personnel. The intern will receive training on the use of water quality sampling apparatus and equipment and in sample and data collection methods. The intern will assist with documentation of field conditions, data, and samples. On other Reclamation projects the intern may assist with groundwater monitoring and sampling and stream water quality monitoring and sampling. The intern will assist with processing and reviewing data for accuracy and completeness. The intern will receive training on and utilize general and specialized computer software to review and summarize data. The intern will also assist with analyzing and preparing data for technical reports and studies and other water quality related tasks. Required Skills<br><br><strong>Compensation<br><br></strong>Amounts<br><br>To be eligible for the internship applicants must be pursuing a bachelor's degree, or higher, in an environmental or water resource science or engineering related field. Applicants should provide transcripts showing coursework in hydrology, watershed science, environmental engineering, geology, biology, chemistry, etc. or equivalent education or experience. Proficiency with general computer software or specialty software including database programs, programming languages, GIS systems, environmental modeling programs, etc. is preferred. Applicants must be in excellent physical condition to handle the rigors of the work. Field work will be performed in various environments with exposure to extreme weather conditions. The work will require walking short distances over uneven and steep terrain, and lifting and transporting, for short distances, objects weighing up to 50 lbs. The selected applicant will be required to complete a security background check prior to beginning service.<br><ul><li>$25- weekly commuting allowance </li><li>$175 - weekly living allowance </li><li>$3,000- duty-related travel funds </li><li>AmeriCorps eligible ($2,360 education award)</li><li>Work-related travel could be limited due to Covid. *All allowances subject to applicable federal, state, and local taxesSCA 1957 </li><li>Location Description<br></li></ul>Salt Lake City, UT and surrounding area.<br><ul><li>Training Provided<br></li></ul>Water quality sampling apparatus and instrumentation, environmental software<br><ul><li>Educational/Recreational Opportunities<br></li></ul>Introductions to limnology, hydrology, and water quality. Work and travel throughout scenic regions of the Rocky Mountains and Colorado Plateau.<br><ul><li>Handicap Accessible?<br></li></ul>Yes<br><br>Main Area of Focus<br><br>Natural Resources Mgmt<br><br>Education, Training &amp; Skills Expected<br><br>Biology<br><br>some coursework or experience<br><br>Earth Sciences<br><br>some coursework or experience<br><br>Mathematics &amp; Data Analysis<br><br>some coursework or experience<br><br>Resource Management<br><br>some coursework or experience<br><br>Boating<br><br>some experience<br><br>Customer Service<br><br>some experience<br><br>Field Research<br><br>competent with supervision<br><br>GIS<br><br>competent with supervision<br><br>Data Analysis<br><br>competent without supervision<br><br>Further Details<br><br>AmeriCorps Eligible<br><br>Eligible<br><br><strong>Certification<br><br></strong>Requirements<br><br>Environmental Education<br><br>Indoor/Outdoor<br><br>Indoor<br><br>US Citizenship\n      "
    },
    {
        "position": "2021 AI Research Intern (NLP/ML)",
        "company": "JD.COM ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-05-29T18:23:40.586Z",
        "url": "https://www.linkedin.com/jobs/view/2021-ai-research-intern-nlp-ml-at-jd-com-2608674863?refId=JoH5ZISmCVezj6wJeEOPMw%3D%3D&trackingId=lQS65ONgZJc7oPZCzmeu6A%3D%3D&position=7&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Job Description: </strong>2021 AI Research Intern (NLP/ML)<br><br><strong>Job Location: </strong>Mountain View, CA<br><br><strong>Job Type: </strong>Spring/Summer Internship<br><br><strong>Department: </strong>AI Research<br><br><strong>NLP Research Intern<br><br></strong>JD.com AI Research is looking for student interns to work on research areas in natural language processing, including natural language understanding, natural language generation, spoken dialog systems, question answering, machine reading comprehension, and knowledge graph learning.<br><br><strong>Qualifications:<br></strong><ul> <li>Ph.D. or masters degree in computer science or NLP related field.</li> <li>Ability to communicate/collaborate with other researchers/engineers including our team members in China (ability to speak Chinese is NOT required).</li> <li>Ability to implement experiments using scripting languages (Python, Perl, bash) and tools written in C/C++.</li> <li>Experience working with deep learning frameworks (Tensorflow, Pytorch, Torch, Mxnet, CNTK, etc.) and related tools in each special field.</li> <li>Publication record in top NLP conferences (ACL, NAACL, EMNLP, NIPS, SIGIR, WWW etc) is a plus. </li> <br><br></ul><strong>Machine Learning Research Intern<br><br></strong>JD AI Research is looking for student interns to work on a wide variety of research areas in machine learning, including knowledge graph, deep learning, reinforcement learning, representation learning, etc.<br><br><strong>Qualifications:<br></strong><ul> <li>Ph.D. or master's degree in computer science, machine learning related field.</li> <li>Ability to communicate/collaborate with other researchers/engineers including our team members in China (ability to speak Chinese is NOT required)</li> <li>Ability to implement experiments using scripting languages (Python, Perl, bash) and tools written in C/C++.</li> <li>Experience working with deep learning frameworks (Tensorflow, Pytorch, Torch, Mxnet, CNTK, etc.) and related tools in each special field;</li> <li>Publication record in top conferences (ICML, ICLR, NIPS, KDD, IJCAI, AAAI etc ) is a plus.</li> <br><br></ul><strong><u>About JD.com And Silicon Valley Labs<br><br></u></strong>JD.com is China's largest online retailer and the biggest overall retailer, as well as the country's biggest Internet company by revenue. In 2017, JD.com reported a net revenue that reached 362.3 billion CNY (US$55.689 billion), an increase of 40.3 percent year-over-year. Google, Walmart, Tencent, Intel, and Farfetch are our strategic partners.<br><br>JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivaled nationwide fulfillment network provides standard same-day and next-day delivery, covering a population of more than 1 billion with a level of service and speed that is unmatched globally.<br><br>As a technology-driven company, JD.com is the world's leading company in high tech and AI delivery through drones, autonomous technology, and robots, and possesses the largest drone delivery system, infrastructure, and capability in the world. Our global R&amp;D efforts are headquartered at Silicon Valley Labs in Mountain View, CA. The Silicon Valley Labs focus on building technology and services that will improve user experience and empower our business partners. Areas of research and development include: artificial intelligence, autonomous driving, robotics, computer vision, natural language processing, machine and deep learning, big data, and AR/VR.<br><br>Visit https://corporate.jd.com/ for more information.<br><br><strong><u>About JD AI Research (JDAIR)<br><br></u></strong>JD AI Research (JDAIR) focuses on the continuous innovation and optimization of algorithms to meet our developing business needs. Significant areas of research include natural language processing, spoken dialog systems, computer vision, and machine learning (including deep learning and reinforcement learning). JDAIR has established research centers in Beijing and Silicon Valley, and we are in the process of opening an additional research center in Europe.<br><br>Visit https://air.jd.com/ for more information.<br><br><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>\n      "
    },
    {
        "position": "Fire Science Live-In Internship Coordinator - ME00572538",
        "company": "Eastern Maine Community College ",
        "location": {
            "city": " Bangor",
            "state": "ME"
        },
        "posted": "2021-06-28T18:24:16.907Z",
        "url": "https://www.linkedin.com/jobs/view/fire-science-live-in-internship-coordinator-me00572538-at-eastern-maine-community-college-2622723183?refId=H0XCwolilElCKiXyg%2FOmuQ%3D%3D&trackingId=s56xSPjWZwSZKTJRsGLJiQ%3D%3D&position=5&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        This job was posted by https://joblink.maine.gov : For more information, please see: https://joblink.maine.gov/ada/r/jobs/572538<br><br>Title of Position: Live-In Internship Coordinator (Contracted position)<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Serve as an adjunct instructor for the FIR 127 course each semester</li> <li>Recruitment and retention of EMCC students for the Live-In Internship</li> <li>Maintaining relationships with current host site locations</li> <li>Monitor and advise live-in students on their overall academic progress</li> <li>Evaluating and acquiring new host site locations</li> <li>Serve as student advisor and mentor for students currently enrolled in the Live-In Internship program</li> <li>Be available in an “on-call” setting at all times while internship students are in service at host locations during the school year</li> <li>Ensure that all interns have adequate supervision while operating at their respective host locations.</li> <li>Periodically check in on Live-In students’ progress by making site visit</li> <li>Provides administrative support to the Fire Science Department Chair as needed</li> <li>Facilitate the yearly Live-In draft process and maintain an active list of candidates</li> <li>Maintaining and developing documentation relating to live-in Internship</li> <li>Assist in course development in relation to the Live-In Internship Program</li> <li>Serve as a liaison with the Penobscot County Fire Chiefs’ Association and a program coordinator for the yearly Penobscot County Fire Academy.</li> <br><br></ul><strong><u>Minimum Qualifications<br></u></strong><ul> <li>Associates degree in Fire Science Technology</li> <li>Current fire department membership</li> <li>Effective communication skills</li> <li>Demonstrated experience as a direct supervisor in emergency services</li> <br><br></ul><strong><u>Preferred Qualification<br></u></strong><ul> <li>5 or more years of direct supervisor experience in emergency services</li> <li>Currently serving as a EMCC Live-In Internship host site coordinator</li> <br></ul>Application Procedure: Email cover letter, resume, transcripts, and contact information for three professional references to resumes@emcc.edu. Review of applicants will begin immediately and continue until the position is filled.<br><br>Institutional Summary: Eastern Maine Community College offers more than 30 traditional and technical programs. The college provides customized, short term, and specialized training courses for a wide variety of businesses, organizations, and the community. We award associates in applied science, associates in science, and associates in arts; certificates; diplomas; and awards of completion for customized, short-term programs, and trainings. The 72-acre campus is located in Bangor, just a short drive from Maine’s scenic coast and mountains.<br><br>EMCC is dedicated to providing all students with a balanced education focused on problem solving, decision making, communication, social understanding, computer applications, mathematics, and science. Our technology programs include concentrated studies in both technical theory and application in the area of specialization, and all of our programs require liberal arts courses to form the foundation for lifelong learning. Our programs and student support services are designed to develop leadership skills, personal responsibility, teamwork, and appreciation of global complexity.<br><br>Eastern Maine Community College is an equal opportunity/affirmative action institution and employer. For more information about this commitment, please call the Affirmative Action Officer at (207) 974-4633\n      "
    },
    {
        "position": "Engineering Mobile App Development Intern - 4 Month Fall Term",
        "company": "BlackBerry ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-05-29T18:24:21.841Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-mobile-app-development-intern-4-month-fall-term-at-blackberry-2607315538?refId=H0XCwolilElCKiXyg%2FOmuQ%3D%3D&trackingId=Pieh7e8WqWV8nciRSy%2FNDQ%3D%3D&position=8&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Worker Sub-Type<br><br></u></strong>Student (Fixed Term)<br><br><strong><u>Position Summary<br><br></u></strong><strong><strong><strong> Job Description: <br><br></strong></strong></strong>A global leader in mobile communications, BlackBerry®revolutionized the mobile industry. Today, BlackBerry aims to inspire the success of our millions of customers around the world by continuously pushing the boundaries of mobile experiences.<br><br>We are securing enterprise information and applications on today’s most popular mobile devices and platforms protecting both company and personal data. An exceptional user experience enhances productivity, whenever and wherever people want or need access. Mobile is on fire. So are we. Join us!<br><br>Are you passionate about Development or Quality and have a bias for speed? Do you believe in aggressive sprints, user stories, continuous integration, regression testing, and traceability matrixes? Do you have a natural curiosity for how things work or what it will take to break them? Do you dream about edge-cases? Do you intuitively understand the complexities of software product development and can you articulate how the process and pieces all come together? If you answered yes to all of these questions, then we think you are cool and probably want to hire you as an Intern. Read on.<br><br><strong>Term</strong>: Fall 2021<br><br><strong>Location</strong>: Mountain View, CA<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Experience with software configurations, e.g. (ability to read, write and interpret maintainable code (including process related scripts)</li><li>Tests, integrates, and documents code. Quickly works towards familiarity of components.</li><li>Ability to prioritize and manage multiple concurrent tasks, learns and contributes to the team and performs well defined tasks</li><li>Strong communication skills and self-motivated</li><li>Special Projects: Depending on your specific skills, talents and areas of interest, we also require that each of our Interns become a subject matter expert in an area aligned with the company’s strategic objectives and take on special projects to improve process, testing methods or cross-training and knowledge transfer.<br><br></li></ul><strong><u>Technical<br><br></u></strong><strong>SKILLS AND QUALIFICATIONS<br></strong><ul><li>Currently enrolled in Computer Science or related Engineering disciplines at the Intermediate level</li><li>Knowledge and experience with Java, Objective-c, c++ languages</li><li>Knowledge of revision control software (ex. Perforce, SVN, github etc) and development lifecycle a plus.</li><li>Experience with test automation tools &amp; frameworks (SeeTest, TestQuest, Selenium, QTP, etc.) a plus.</li><li>Experience with languages (JavaScript, SWIFT) a plus.</li><li>Experience with either Android or iOS mobile Operating systems</li><li>Experience, working in a multi-platform, multi-release, distributed development environment</li><li>Strong analytical &amp; technical writing skills; must be able to efficiently &amp; effectively write test cases</li><li>Strong knowledge of networking server technologies (TCP/IP, HTTP, SSL)</li><li>Experienced with the Agile methodology and continuous integration (i.e. nightly built and release)<br><br></li></ul><strong><u>Non-Technical<br></u></strong><ul><li>Relentlessly resourceful. You are a problem solver, not a problem mover.</li><li>Can do attitude. You don’t use the word “can’t” very much.</li><li>Must have a passion for Development or Quality and a bias towards speed. </li><li>Must be a motivated self-starter with a short learning curve.</li><li>Ability to work in a fast-paced, demanding, dynamic (and sometimes chaotic) environment. </li><li>Must be able to learn new technical areas quickly.</li><li>Excellent organization, attention to detail, and communication skills along with the ability to work well with others. </li><li>Excellent command of written and spoken English, especially when it comes to taking technical concepts, and translating these into written form that even non-technical individuals can understand.</li><li>Ability to communicate effectively with senior management a must.<br><br></li></ul><strong><u>Job Family Group Name<br><br></u></strong>Business Administration &amp; Operations<br><br><strong><u>Scheduled Weekly Hours<br><br></u></strong>40\n      "
    },
    {
        "position": "Student Anatomy Lab Technician",
        "company": "Oklahoma State University ",
        "location": {
            "city": " Oklahoma City",
            "state": "OK"
        },
        "posted": "2021-04-29T18:24:23.643Z",
        "url": "https://www.linkedin.com/jobs/view/student-anatomy-lab-technician-at-oklahoma-state-university-2529303837?refId=H0XCwolilElCKiXyg%2FOmuQ%3D%3D&trackingId=h9JQIiB%2B%2BO9k%2BUsvCkdo5A%3D%3D&position=9&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Job Function<br><br></u></strong>Provides technical support for the delivery and maintenance of cadaver anatomy labs for the science department under the direction of the Anatomy Lab Technician, Department Head, and Lead Instructor of Anatomy. Additional duties may include support of science activities and day-to-day functions.<br><br><strong> <br><br></strong><strong><u>Essential Job Functions<br></u></strong><ul> <li>Dissection and maintenance of human cadavers and the lab environment.<br></li> <li>Record work performed in anatomy labs including, but not limited to, activities performed on cadavers.<br></li> <li>Maintain a safe working environment in cadaver labs with appropriate collection and disposal of biological specimens. Any hazards are to be reported to the anatomy lab technician.<br></li> <li>Monitor anatomy students in open lab sessions.<br></li> <li>Maintain lab coats and other lab supplies for anatomy labs.<br></li> <li>Completes all mandatory training<br></li> <li>Other duties as assigned.</li> <br></ul><em>The duties listed in this job description are intended only as illustrations of the various types of work that may be performed. The omission of specific statements of duties does not exclude them from the position if the work is similar, related, or a logical assignment to the position. <br><br></em><strong>Special Instructions to Applicants<br><br></strong><strong><u>Resume And Cover Letter Required For Full Consideration<br><br></u></strong><strong>Position Qualification<br><br></strong><strong><u>Education<br><br></u></strong><strong><strong>Minimum Qualifications:<br><br></strong></strong><strong><u>Prerequisites Include<br></u></strong><ul> <li>Attaining a grade of “B” or better from either the OSU-OKC Human Anatomy course (BIOL2214) or BIOL1515 and BIOL1212.<br></li> <li>Recommendation from an OSU-OKC anatomy lab instructor.<br></li> <li> Must be currently enrolled in at least one class at OSU-OKC.<br> </li> <br><br></ul><strong><u>Knowledge, Skills, And Abilities<br></u></strong><ul> <li>Adapt and apply laboratory methods and procedures.</li> <li>Ability to follow general safety standards for laboratory environments.<br></li> <li>General computer skills and use of Microsoft Office applications.<br></li> <li>Acts with integrity and displays responsible behavior<br></li> <li>Work with minimal supervision.<br></li> <li>Passion for assisting customers and representing the OSU brand with positivity and professionalism<br></li> <li>Evidences a history of demonstrating ethical and professional behavior</li> <br><br></ul><strong><u>Preferred Qualifications<br><br></u></strong><strong> </strong><strong>Prerequisites include:<br></strong><ul> <li>Attaining a grade of “A” from either the OSU-OKC Human Anatomy course (BIOL2214) or BIOL1515 and BIOL1212.</li> <li>Declared major in relevant subject area.</li> <li>Recommendation from an OSU-OKC anatomy lab instructor.</li> <li>Must be currently enrolled in at least one class at OSU-OKC.</li> <br><br></ul><strong><u>Work Hours And Days<br><br></u></strong>Student Laboratory Technicians will work a variety of hours on the weeknights and weekends with 3-4 hours per shift and a maximum of 20 hours per week.<br><br><strong><u>Working Conditions<br></u></strong><ul> <li>Laboratory environment. Exposure to chemicals and repetitive activities common to science labs, such as cutting and pipetting.<br></li> <li>Position may require up to 30% of the work week be performed outside of regular hours.<br></li> <li>Must be able to work a flexible schedule to include some evenings and weekends in an often times busy and noisy environment.<br></li> <li> Work will be performed in a classroom and laboratory environment with a significant amount of public contact in person. </li> <br><br></ul><strong><u>Physical Requirements<br></u></strong><ul> <li>Must be able to perform physical activities such as, but not limited to, lifting up to 25 lbs. (If an object weights more than 45 lbs., OSU-Oklahoma City requires this to be a two-person lift) unassisted, bending, standing, repetitive motions, climbing ,walking and computer usage.<br></li> <li>Must be able to handle and safely dispose of chemicals, solutions, biohazardous material, and any other hazardous materials common to the science lab. </li> <br></ul><em>The work environment and physical demands described here are representative of those required by an employee to perform the essential functions of this job with or without reasonable accommodations.<br><br></em>#ZR\n      "
    },
    {
        "position": "Information Technology Internship (IT Intern 4)- 3270 with Security Clearance",
        "company": "ClearanceJobs ",
        "location": {
            "city": " Honolulu",
            "state": "HI"
        },
        "posted": "2021-06-07T18:24:41.055Z",
        "url": "https://www.linkedin.com/jobs/view/information-technology-internship-it-intern-4-3270-with-security-clearance-at-clearancejobs-2621540148?refId=H0XCwolilElCKiXyg%2FOmuQ%3D%3D&trackingId=hIP7ikd9zyGKJYD0udVCsA%3D%3D&position=20&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <ul><li>Who we are HII-Technical Solutions Division is currently seeking an Information Technology Intern to work out of our Honolulu, HI office. Huntington Ingalls Industries is seeking an Undergraduate Senior or Upcoming Senior to take part in our growing internship program. We are looking for a future IT professional, interested in breaking into the defense industry. As one of our interns, HII-TSD will offer you the opportunity to work alongside subject matter experts and assist in providing critical support to our clients. Our experts will provide on-the-job training, and ensure our interns complete our program with the confidence to accurately perform the skills learned throughout their careers. This opportunity not only provides you the opportunity to gain valuable work experience in a professional environment but also allows you a look at what HII-TSD can offer you as an employee. Internships are offered in 90 day increments. Students may be invited to remain in the internship program for another 90 days, following an evaluation after the term. What you will do * Support the IT team in maintaining hardware, software, and other systems in areas such as cybersecurity, programming, analytics, and data center management</li><li> Assist with troubleshooting issues and provide technical support</li><li> Perform on-site installation/ configuration/ repair/ recovery/ back-up and preventative maintenance on PCs and related peripherals</li><li> Assist IT personnel in ensuring that hardware and software systems are fully deployed, implemented, and functioning What we are looking for * High School Diploma or equivalent + Must be working towards a Bachelors degree with more than 60% of the required credits completed</li><li> Pursuing a Bachelors Degree in the field of computer science, information sciences, or a related field</li><li> Moderate understanding of general job aspects and some understanding of the detailed aspects of the job</li><li> Clearance- Ability to obtain and maintain a security clearance Bonus Points for... * Active Clearance: TS/SCI</li><li> Valid CompTIA Security + certification Physical Requirements Job performance will normally require only minor lifting and carrying of boxes of records or equipment. A division of Huntington Ingalls Industries This opportunity resides with Defense &amp; Federal Solutions, a business group within Huntington Ingalls Industries' Technical Solutions division, helps solve tough national security challenges for the Department of Defense, the intelligence community and federal civilian agencies. Our expert capabilities include intelligence, surveillance and reconnaissance (ISR), and cyber; secure enterprise IT engineering and operations; military training and simulation; logistics management and integrated product support; and fleet maintenance, modernization, repair and sustainment. Huntington Ingalls Industries is America's largest military shipbuilding company and a provider of professional services to partners in government and industry. For more than a century, HII's Newport News and Ingalls shipbuilding divisions in Virginia and Mississippi have built more ships in more ship classes than any other U.S. naval shipbuilder. HII's Technical Solutions division provides a wide range of professional services through its Fleet Support, Mission Driven Innovative Solutions, Nuclear &amp; Environmental, and Oil &amp; Gas groups. Headquartered in Newport News, Virginia, HII employs more than 42,000 people operating both domestically and internationally. Huntington Ingalls Industries is an Equal Opportunity/Vets and Disabled Employer. U.S. Citizenship may be required for certain positions.</li></ul>\n      "
    },
    {
        "position": "Intern - Enterprise Architecture",
        "company": "U.S. Renal Care ",
        "location": {
            "city": " Plano",
            "state": "TX"
        },
        "posted": "2021-05-29T18:24:56.900Z",
        "url": "https://www.linkedin.com/jobs/view/intern-enterprise-architecture-at-u-s-renal-care-2536755049?refId=jPCHD%2Ff41Rzmilk3ATV0Tw%3D%3D&trackingId=bo8jW8%2BpqTatML92Anomng%3D%3D&position=5&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        The Enterprise Architecture Intern will support the Enterprise Architect in the development of the IT architectural vision and roadmap to deliver against organizational objectives.<br><br><strong>Essential Duties and Responsibilities<br><br></strong>include the following. Other duties and tasks may be assigned.<br><ul><li>Support the development and implementation of tactical plans to implement cybersecurity capabilities designed to improve the security posture of the company. </li><li>Support the development of best practices and frameworks for architecture definition, sizing, solution options analysis, UI/UX design, etc.</li><li>Partner with the Enterprise Architect to establish domain-specific reference models for business and technology capabilities for use in strategic planning and analysis.</li><li>Participate in cross-functional discussions within the IT organization to develop an understanding of delivery and operational processes.</li><li>Actively promote GUEST customer service standards; develop effective relationships at all levels of the organization.</li><li>Participate in team concepts and promote a team effort; perform duties in accordance with company policies and procedures.</li><li>Regular and reliable attendance is required for the job.<br><br></li></ul><strong>Qualifications<br><br></strong>/Requirements<br><br>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.<br><br><strong>Requirements<br><br></strong>Include<br><ul><li>Currently enrolled in four (4) year accredited degree program and returning to the program upon completion of the internship. </li><li>Currently pursuing a degree in Computer Science, Computer Engineering, Informatics, or related discipline.</li><li>Proficient computer skills, including Microsoft Office (Outlook, PowerPoint and Excel). <br><br></li></ul><strong>U.S. Renal Care is an Equal Opportunity Employer/Disabled/Veteran.<br><br></strong>Additional Information\n      "
    },
    {
        "position": "Outreach Intern",
        "company": "Caltech ",
        "location": {
            "city": " Hanford",
            "state": "WA"
        },
        "posted": "2021-03-30T18:25:01.846Z",
        "url": "https://www.linkedin.com/jobs/view/outreach-intern-at-caltech-2477291201?refId=jPCHD%2Ff41Rzmilk3ATV0Tw%3D%3D&trackingId=yNn8epPRNF2FNL09jcN%2B4A%3D%3D&position=8&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Caltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.<br><br><strong>Job Summary<br><br></strong>LIGO Laboratory (the Laser Interferometer Gravitational-wave Observatory) seeks a highly motivated and skilled Outreach Intern to join its team. LIGO Laboratory is a National Science Foundation major facility dedicated to observing the newly discovered gravitational-wave universe. Jointly operated by the California Institute of Technology and Massachusetts Institute of Technology, the LIGO Laboratory operates world-leading observatories near Richland, WA and Baton Rouge, LA as well as R&amp;D centers on the Caltech and MIT campuses. The LIGO Laboratory’s mission spans a broad and vibrant array of activities related to gravitational-wave physics and astronomy, including detector operations, R&amp;D toward detector improvements, gravitational-wave astrophysics, observatory operations, and education and public outreach.<br><br><strong><u>For More Information, Please Visit The Laboratory Website At<br><br></u></strong>This position is located in Richland, WA.<br><br><strong>Life at LIGO Hanford Observatory as a Caltech Employee<br><br></strong>LIGO’s observatory in the shrub-steppe of Eastern Washington is an approximately 20-minute commute from Richland, WA., where it is located on the edge of the Department of Energy Hanford Site. Caltech employs a staff of 49 at the Hanford observatory. Caltech has an extraordinary science impact across many fields. Its small size creates a community where innovation and collaboration are the norm. Caltech manages the Jet Propulsion Laboratory (JPL) for NASA, the leading US center for the robotic exploration of the Solar System. Caltech also operates large-scale research facilities such as the Palomar and Keck Observatories.<br><br><strong><u>Caltech HR Diversity Page<br><br></u></strong>Caltech and LIGO Laboratory’s goal is to build a world-class, diverse workforce and support an inclusive environment that encourages professional development and offers top-notch benefits. Our talented staff, who work at the Caltech campus, or one of our Observatories, come from a variety of fields. Positions include scientists, engineers, information technology staff, outreach professionals, managers, writers, business professionals, and administrative staff. We are deeply committed to encouraging people of all backgrounds to apply for these opportunities. Our experience has demonstrated that the broader the styles, characteristics, backgrounds, and abilities of our staff—in other words, the more diverse our team is—the greater potential we have for success. Caltech is an equal opportunity employer.<br><br>LIGO Laboratory is committed to being a welcoming place for everyone regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, or veteran status.<br><br><strong>Job Duties<br><br></strong>LIGO seeks a highly motivated and skilled Outreach Intern to join its team. Interns will spend time both with outreach and scientific staff facilitating the growth of their communication, as well as technical, knowledge and skills. Outreach interns assist EPO staff in leading outreach activities such as field trips, STEM nights, and classroom activities. In addition to assisting with current outreach activities interns use their creativity and knowledge to design new lessons, activities, and programs. When not assisting with outreach activities interns have the opportunity to work on project with one of several groups on site such as the electrical engineering lab or the computer science group. Interns are expected to work approximately 10 hours a week during school and 40 hours per week during the summer. Schedules are flexible and will take into account other commitments interns may have. Occasional nights and weekends may be required. Due to COVID interns are currently working remotely, but when it is safe work will be on-site at the LIGO Hanford Observatory and at local schools.<br><br><strong><u>Basic Qualifications<br></u></strong><ul><li>Candidate should be currently pursuing an undergraduate degree for one of the following fields of study: education, engineering, computer science, or physics.<br></li></ul><strong>Preferred Qualifications<br></strong><ul><li>Previous experience working with K-12 students and/or the public.<br></li></ul><strong><u>Required Documents<br></u></strong><ul><li>Resume</li><li>Cover Letter<br></li></ul><strong> EEO Statement <br><br></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, or national origin, disability status, protected veteran status, or any other characteristic protected by law.<br><br>Caltech is a VEVRAA Federal Contractor.<br><br>To read more Equal Employment Opportunity (EEO) go to eeoc_self_print_poster.pdf.<br><br><strong> Disability Accommodations <br><br></strong>If you would like to request an accommodation in completing this application, interviewing, or otherwise participating in the employee selection process, please direct your inquiries to Caltech Recruiting at employment@caltech.edu<br><br>Share\n      "
    },
    {
        "position": "Testing Intern - BidShore",
        "company": "1871 ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-05-29T18:25:28.934Z",
        "url": "https://www.linkedin.com/jobs/view/testing-intern-bidshore-at-1871-2612842852?refId=jPCHD%2Ff41Rzmilk3ATV0Tw%3D%3D&trackingId=MH5kvaobxyWM61kL%2BpOO9A%3D%3D&position=25&pageNum=22&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>About Us<br><br></u></strong>BidShore is a Chicago-based startup that is evolving with its unique and innovative business model - providing on-demand discounts thru merchant bidding. (Reverse eBay). Initially, targeting the Restaurant market in the ChicagoLand area.<br><br>Candidates will first be providing manual testing support that will be transitioning to an automated environment. Successful candidates will be fast learners and show the ability to work in a collaborative group.<br><br>Duties and responsibilities<br><ul><li></li><li> Assist in the development of quality assurance measures and testing standards for new applications, products, and/or enhancements to existing applications throughout their development/product lifecycles. Independently create and execute test plans, test cases and test scripts that will determine optimal application performance according to specifications for median projects</li><ul><li></li><li> Responsible for tracking defects and fixes in product development, software application development, information systems, and operations systems. Ensure that testing activities allow the application to meet business requirements and systems goals, fulfill end-user requirements, and identify existing or potential issues</li><ul><li></li><li> Make recommendations to address existing and potential trouble areas in IT systems and projects across the organization</li><ul><li></li><li> Collaborate with software/systems personnel in application testing, such as system, unit, regression, load and acceptance testing methods</li><ul><li></li><li> Test new software to ensure integration into company systems that meet functional requirements, system compliance, and technical specifications</li><ul><li></li><li> Analyze formal test results in order to discover and report any defects, bugs, errors, configuration issues, and interoperability flaws. Drive the resolution of these defects and issues.</li><ul><li></li><li> Monitor, collect data, report, and recommend improvements to STLC processes, practices, and guidelines for maximum efficiencies</li><ul><li></li><li> Participate in developing, distributing, and coordinating in-depth end-user reviews for modified and new systems or applications</li><ul> <li></li><li> Create/update regression test cases and scripts to incorporate changes or additions to applications. Ability to use Automation Testing Frameworks and Tools to create flexible and accurate regression test suites.</li> <li></li><li> Assist in the preparation of an accurate and complete test environment for application testing</li> <br><br><strong><u>Requirements<br><br></u></strong><li> College diploma or university degree in software engineering, computer science, or business administration and/or 3 years equivalent QA work experience</li><li> Willingness to learn</li></ul></ul></ul></ul></ul></ul></ul></ul></ul>\n      "
    },
    {
        "position": "Media Engineer Intern",
        "company": "Tencent America ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-03-30T18:25:32.343Z",
        "url": "https://www.linkedin.com/jobs/view/media-engineer-intern-at-tencent-america-2493156968?refId=e6at%2B2SimaGhdtB5LiRNsw%3D%3D&trackingId=ZL8fGdNFYVeiXr6UN%2F3D%2Fw%3D%3D&position=2&pageNum=23&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Responsibilities: <br><br></strong><ul> <li>Implement and optimize novel algorithms/models that lead to improved video compression performance</li> <br></ul><strong>Minimum qualification:<br><br></strong><ul> <li>Bachelor degree in computer science, electrical engineering, math, statistics, or related fields</li> <li>Interest in video compression and video coding standards, and previous related experience is a plus</li> <li>Strong coding skills in C/C++</li> <li>Ability to communicate/collaborate with other researchers/engineers</li> <li>Ability to think out of box</li> <br></ul><strong>Preferred qualification:<br><br></strong><ul> <li>Multi-threading or SIMD programming experience</li> <li>Good understanding of state-of-the-art video compression algorithms</li> <li>Working experience on HEVC</li> <li>Good knowledge of computer architecture</li></ul>\n      "
    },
    {
        "position": "Engineering Intern (Spring / Summer 2022)",
        "company": "Second Order Effects, Inc ",
        "location": {
            "city": " El Segundo",
            "state": "CA"
        },
        "posted": "2021-03-30T18:25:34.142Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-intern-spring-summer-2022-at-second-order-effects-inc-2493186499?refId=e6at%2B2SimaGhdtB5LiRNsw%3D%3D&trackingId=QwajENIVuTgLAxttUUAhbQ%3D%3D&position=3&pageNum=23&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Engineering Intern (Spring / Summer 2022)<br><br></strong>We are looking for self-starting interns with a passion for learning and growth mindsets. Candidates must be highly motivated college students willing to intern with SOE during the Spring or Summer (2022). Interns will gain a range of hands-on electrical engineering experience going through a design cycle for engineering hardware.<br><br>SOE's interns have the opportunity to gain significant on the job learning and will directly apply engineering design fundamentals to produce impactful results.<br><br><strong>Responsibilities:<br><br></strong><ul> <li>Interns will report to a mentor who will be responsible for candidate feedback and learning— mentors will also assign tasks and projects to work closely with the teams</li> <li>Perform electrical prototyping, schematic capture, PCB layout, and general electrical engineering work</li> <li>Using electrical test equipment to make measurements and troubleshoot boards</li> <li>Gain exposure to electronic assembly, PCB soldering, and wire harness assembly</li> <li>Program microcontrollers or FPGAs and test software applications</li> <br></ul><strong>Basic Qualifications:<br><br></strong><ul> <li>Currently enrolled at an accredited four-year university or college for relevant degree programs (Electrical Engineering, Computer Science, Physics, Math, related field)</li> <li>Proficiency in at least one programming language (Python, C, C++, R, etc.)</li> <li>First or second year circuits classes and knowledge of electrical engineering fundamentals</li> <li>Curious and passionate about electrical engineering and technology with the ability to learn and take instruction</li> <br></ul><strong>Preferred Skills Experience:<br><br></strong><ul> <li>Experience in a team-based design and build project (e.g., Formula SAE, Solar Car, CubeSat, etc.)</li> <li>Experience with embedded software development, preferably with microcontrollers such as MSP430, STM32, or AVR</li> <li>Familiarity with machining tools including milling machines, lathes, and CNC equipment</li> <li>CAD software design experience for PCB and/or mechanical designs</li> <li>Experience with circuit simulation using LTspice, Pspice, or similar programs</li> <li>Experience in soldering and crimping for complex systems</li> <li>Experience with Linux operating systems</li> <br></ul><strong>Additional Requirements:<br><br></strong><ul> <li>Applicant must be willing to work 40 hours a week on-site in El Segundo, CA</li> <li>Applicant must be eligible to work on ITAR projects</li> <li>Job Type: Full-time (Paid, Seasonal)</li> <br></ul><strong>ITAR Requirements:<br><br></strong><ul> <li>To conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here.</li> <br></ul>Second Order Effects is an Equal Opportunity Employer; employment with SOE is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.\n      "
    },
    {
        "position": "PHP & Java Intern",
        "company": "Internet Brands ",
        "location": {
            "city": " Los Angeles",
            "state": "CA"
        },
        "posted": "2021-04-29T18:26:00.868Z",
        "url": "https://www.linkedin.com/jobs/view/php-java-intern-at-internet-brands-2534712261?refId=e6at%2B2SimaGhdtB5LiRNsw%3D%3D&trackingId=xQh2k0eXckFwDwqyxngM%2BA%3D%3D&position=20&pageNum=23&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Description<br><br></strong>Los Angeles based Internet Brands is currently seeking PHP and Java Interns to join our Web development team. We are looking for innovative PHP and Java Interns who love the Internet and social media.<br><br>Our PHP and Java Interns work directly with development teams on consumer facing websites.<br><br><strong>Responsibilities<br></strong><ul><li> Design and code new features and enhancements.</li><li> Assist with all aspects of the product lifecycle, from specifications through QA.</li><li> Collaborate on finding and fixing bugs.<br></li></ul><strong>Requirements<br></strong><ul><li> Completed or working towards a B.S. or M.S. in Computer Science or related field.</li><li> Strong programming skills (Java, .Net, PHP).</li><li> Strong CSS skills and some web design skill preferred.</li><li> Excellent problem solving skills.</li><li> Strong familiarity with Web 2.0 and social networking websites.<br></li></ul><strong><u>About Internet Brands<br><br></u></strong>Headquartered in El Segundo, Calif., Internet Brands® is a fully integrated online media and software services organization focused on four high-value vertical categories: Health, Automotive, Legal, and Home/Travel. The company's award-winning consumer websites lead their categories and serve more than 250 million monthly visitors, while a full range of web presence offerings has established deep, long-term relationships with SMB and enterprise clients. Internet Brands' powerful, proprietary operating platform provides the flexibility and scalability to fuel the company's continued growth. Internet Brands is a portfolio company of KKR and Temasek. For more information, please visit www.internetbrands.com.<br><br>Internet Brands and its wholly-owned affiliates are an equal opportunity employer.\n      "
    },
    {
        "position": "2021 PhD Research Intern (Recommendation System)",
        "company": "JD.COM ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-05-29T18:26:30.648Z",
        "url": "https://www.linkedin.com/jobs/view/2021-phd-research-intern-recommendation-system-at-jd-com-2608677521?refId=iVgPCMlm1QbpzZ5s%2F1lEQw%3D%3D&trackingId=dZkWFp4DvGnkU6QPEmJ7ow%3D%3D&position=14&pageNum=24&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        JD Business Growth Team is looking for PhD student interns to work on a wide variety of research areas in machine learning and recommendation system, including ads ranking, ctr prediction, deep learning, reinforcement learning, etc.<br><br><strong>Qualifications:<br></strong><ul> <li>Ph.D. or master's degree in computer science, machine learning related field.</li> <li>Ability to communicate/collaborate with other researchers/engineers including our team members in China (ability to speak Chinese is NOT required)</li> <li>Ability to implement experiments using scripting languages (Python, Perl, bash) and tools written in C/C++.</li> <li>Experience working with deep learning frameworks (Tensorflow, Pytorch, Torch, etc.) and related tools in each special field;</li> <li>Publication record in top conferences (ICML, ICLR, NIPS, KDD, IJCAI, AAAI, RecSys etc ) is a plus.</li> <br><br></ul><strong><u>About JD-Business Growth<br><br></u></strong>The Business Growth BU at JD.com was established in 2011. The engineering team is a group of dynamic geeks from world-class universities and industry-leading companies working in fields such as machine learning, analytics, statistics, NLP, information retrieval, system infrastructures, etc., based in Beijing and Mountain View, CA. We do battle every single day with some of the most significant, rewarding and fun problems in the technology industry, including but not limited to search/display, ads retrieval and recommendation, spam-traffic and click-farm detection, AI/machine learning infrastructure development, traffic and revenue prediction, ads pricing, audience expansion, etc., and we are looking to add great talent to our growing family!<br><br><em>JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.</em>\n      "
    },
    {
        "position": "Lk Chas Information Technology Co-op/Intern",
        "company": "CITGO ",
        "location": {
            "city": " Westlake",
            "state": "LA"
        },
        "posted": "2021-06-26T18:26:43.400Z",
        "url": "https://www.linkedin.com/jobs/view/lk-chas-information-technology-co-op-intern-at-citgo-2614865277?refId=iVgPCMlm1QbpzZ5s%2F1lEQw%3D%3D&trackingId=PVzJ1F6NZabz3S2ysUZbag%3D%3D&position=22&pageNum=24&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Relocation:<br>Relocation Benefits are available for this position.<br><br><strong><u>Note<br><br></u></strong>Employer will not sponsor visas for position<br><br><strong><u>Job Summary<br><br></u></strong>Headquartered inHouston,Texas, CITGO Petroleum Corporation is a recognized leader in the refining industry with a well-known brand. CITGO operates three refineries located inCorpus Christi, Texas;Lake Charles, La.; andLemont, Ill., and wholly and/or jointly owns 42 terminals, six pipelines and three lubricants blending and packaging plants. With approximately 3,400 employees and a combined crude capacity of approximately 769,000 barrels-per-day (bpd), CITGO is ranked as the sixth-largest, and one of the most complex independent refiners intheUnited States. CITGO transports and markets transportation fuels, lubricants, petrochemicals and other industrial products and supplies a network of approximately 4,600 locally owned and operated branded retail outlets, all located east of the Rocky Mountains. CITGO Petroleum Corporation is owned by CITGO Holding, Inc.The Information TechnologyCo-op/Intern will be introduced to the Refinery and the Information Technology Department. They will become familiar with IT policies, processes, and procedures, and will provide assistance to technical projects and services throughout their assignment. Job Responsibilities:Performs and assists with hardware/software evaluations and implementationsHardware/Software troubleshooting and user supportWorkstation lease replacementsTesting and execution of Windows 10, MS Office365, and MS OneDrive upgradesCustom application and database development, maintenance, and supportSharePoint team site development, support, and security analysisAdditional projects may be assigned, with regular status reports requiredEnd of term presentation expected<br><br><strong><u>Minimum Qualifications<br><br></u></strong>Minimum Requirements:Currently enrolled in an accredited degree program pursuing a bachelor's degree in Computer Science or closely related fieldOverall GPA of 3.0 or above (A=4.0) (Must provide proof of current GPA at time of hire to verify education requirements are met)Must have completed at least60 credit hours (JR or SR classification)Valid Driver's LicenseThe Maritime Transportation Security Act requires all persons who will need unescorted access to a regulated facility to have a valid Transportation Worker Identification Credential (TWIC), issued in accordance with the rules established by the United States Coast Guard and the Transportation Security Administration. Candidates selected for employment must meet eligibility criteria to obtain a TWIC card. To obtain more information on the Transportation Worker Identification Credential (TWIC), please visit the Transportation Security Administrations website https://www.tsa.gov/for-industry/twic.Preferred Skills:Windows 10MS OfficeSharePointApplication DevelopmentDatabase Management(Equal Opportunity Employer)\n      "
    },
    {
        "position": "Perception Research Engineer Internship- Fusion",
        "company": "TuSimple ",
        "location": {
            "city": " Columbus",
            "state": "OH"
        },
        "posted": "2021-06-25T18:26:45.236Z",
        "url": "https://www.linkedin.com/jobs/view/perception-research-engineer-internship-fusion-at-tusimple-2619451127?refId=iVgPCMlm1QbpzZ5s%2F1lEQw%3D%3D&trackingId=Xo5jGqBpD5HZjqlj8juuMA%3D%3D&position=23&pageNum=24&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><strong><u>Job Description<br><br></u></strong>The perception team develops cutting edge technologies to help our truck perceive the world. You will play an important role in creating novel algorithms for advanced perception and applying your algorithm on terabytes of data. You will also work closely with other talents in this field in building the next-generation of autonomous sensing algorithms.<br><br>Example projects that we are working on:<br><ul> <li>Temporal association of data from multiple sensors, including camera, LiDAR, RADAR and more</li> <li>Object tracking and state estimation in challenging real world scenarios</li> <li>Encoding perception uncertainty and collaborate with prediction team to make the system safe and robust</li> <br><br></ul><strong><u>Responsibilities<br></u></strong><ul> <li>Formulate, prototype and deploy robust and reliable solutions to cutting-edge perception problems, including sensor fusion, tracking, and state estimation.</li> <li>Investigate and develop computer vision algorithms and machine learning models for the perception system.</li> <li>Build benchmark with proper methodology and analyze large-scale data to characterize algorithms performance.</li> <li>Closely collaborate with other teams to conduct system design, integration and tests.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>M.S. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Hands-on experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Strong coding skills in C/C++ and Python</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Ph.D. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Extensive experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Publications in top-tier computer vision/machine learning conferences and/or journals.</li> <li>Knowledge and experience of GPU computation or CUDA acceleration.</li> <br></ul><strong>Perks<br></strong><ul> <li>Work with world class AI Engineers.</li> <li>Shape the landscape of autonomous driving.</li> <li>Daily breakfast, lunch, and dinner.</li> <li>Full Kitchen with unlimited snacks and fruits.</li> <br></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Research Internship (Fall 2021, HCI/UX)",
        "company": "Dataminr ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-14T18:26:52.199Z",
        "url": "https://www.linkedin.com/jobs/view/research-internship-fall-2021-hci-ux-at-dataminr-2546025815?refId=AMkIWRCnm2HE8nKtrl8L4w%3D%3D&trackingId=ToNr2Vv7n2GsDCWTFoa2Yw%3D%3D&position=2&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <ul><li>COVID-19 Hiring Update--<br></li></ul><strong>As the health and safety of our candidates and our employees come first, we're excited to provide virtual experiences for interviews and new hire on-boarding.<br><br></strong><strong>Who We Are<br><br></strong>Dataminr puts real-time AI and public data to work for our clients, generating relevant and actionable alerts for global corporations, public sector agencies, newsrooms, and NGOs. Our leading AI platform detects the earliest signals of high-impact events and emerging risks from vast amounts of publicly available information. Our real-time alerts enable tens of thousands of users at hundreds of public and private sector organizations to learn first of breaking events around the world, develop effective risk mitigation strategies, and respond with confidence as crises unfold.<br><br>Dataminr is making its mark for growth and innovation, recently earning recognition on the Deloitte Technology Fast 500, Forbes AI 50 and Forbes Cloud 100 lists. We also earned accolades for ‘Most Innovative Use of AI’ from the 2020 AI &amp; Machine Learning Awards.<br><br>Join our team and help the world manage risk in real time. You’ll work with 600+ talented people across seven offices, united by our passion to collaborate, make a difference, and have fun while doing it!<br><br><strong> Type: Internship<br><br></strong><strong>Experience<br><br></strong>Graduate Students<br><br><strong>Who You Are<br><br></strong>You’re an aspiring HCI/UX researcher who has conducted novel user research/design projects in applied research/product settings, preferably published in top tier conferences, and are passionate about having a positive impact on the world. You are enthusiastic about working on some of the most challenging problems at the intersection of AI and HCI , working in a highly collaborative environment and directly contributing to products while advancing the state of the art. You are very creative, can work independently, and are an excellent collaborator and communicator.<br><br><strong>Responsibilities<br></strong><ul><li> Perform research to advance the state of the art and solve specific problems at scale in one or more of the following areas: Human Computer Interaction (HCI), Human Factors, Computer Supported Cooperative Work (CSCW), Place-based/Digital Ethnography, Participatory Design (PD), Contextual User Interfaces, and/or Design of Information Systems (DIS). </li><li> Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship. </li><li> Excel in placing a human-centered focus on the work (context, end-user impact, etc), exploring solutions that work in practice and have significant impact. <br></li></ul><strong>Minimum Qualifications<br></strong><ul><li> Currently pursuing a Ph.D. degree in Human Computer Interaction (HCI), Human Factors, Information Science, Interaction Design, Experimental Psychology, Cognitive Psychology, Anthropology or related fields. </li><li> Relevant work/project experience in an applied research setting, including but not limited to integrating user research into product designs and design practices. </li><li> Preferably published in related fields of study ( CHI, CSCW, DIS, HFES or related HCI/design conferences or journals ). </li><li>Demonstrated ability to work independently, set up HCI/UX research projects and demonstrate progress through principled use of qualitative or quantitative metrics.<br></li></ul>Dataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.<br><br>\n      "
    },
    {
        "position": "BT-1989 Junior Safety Specialist (Internship)",
        "company": "Bastion Technologies, Inc. ",
        "location": {
            "city": " Huntsville",
            "state": "AL"
        },
        "posted": "2021-04-29T18:27:12.679Z",
        "url": "https://www.linkedin.com/jobs/view/bt-1989-junior-safety-specialist-internship-at-bastion-technologies-inc-2542276792?refId=AMkIWRCnm2HE8nKtrl8L4w%3D%3D&trackingId=ODiioMwFQaWOrXeMeIe2vQ%3D%3D&position=15&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong>Candidate will be working towards a degree or seeking experience in one of the fields listed below:<br>Engineering ( ME, EE, IE, CE or related Engineering degree)<br>Supply Chain Management (Supply Chain Management or related business degree)<br>Business Administration (Business or Finance Degree)<br>Management Information Systems (MIS or Computer Science degree)<br>Quality Assurance (AS degree or Quality Assurance knowledge)<br>The duration of this task is approximately 10 12 weeks(to coincide with typical university calendars for Spring, Summer, and Fall semesters). Longer durations are negotiable. This internship will expose the candidate to as many NASA Safety &amp; Mission Assurance (SMA) processes as practical.<br><br><strong><u>Required Skills<br></u></strong><ul><li> HS or equivalent GED Education required</li><li> 0-3 Years of Experience</li><li> Must be a US citizen</li><li> Must be able to pass a national agency check</li><li> Must be able to pass pre-employment and periodic random drug and alcohol screenings.</li><li> Knowledge of Microsoft Office<br></li></ul><strong><u>Other Desired Skills<br><br></u></strong>Position requires a competent communicator (verbal and written) with ability to work harmoniously and effective with co-workers, Bastion Management and all levels of customer personnel. NASA or NASA related expierence is a plus. MSFC experience is a big plus. Required to be regular in attendance (per agreed to work hours schedule), consistently punctual and be relied upon to successfully complete all assignments.<br>Bastion participates in the e-Verify and EEO\n      "
    },
    {
        "position": "Video Networking Intern",
        "company": "Tencent America ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-05-29T18:27:20.746Z",
        "url": "https://www.linkedin.com/jobs/view/video-networking-intern-at-tencent-america-2608681430?refId=AMkIWRCnm2HE8nKtrl8L4w%3D%3D&trackingId=hYKEmM%2FlnZLKlXLilDuOeQ%3D%3D&position=20&pageNum=25&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong><u>Description<br></u></strong><ul> <li>Improve user experience for millions of users of social media, computer gaming, and virtual reality/augmented reality </li> <br><br></ul><strong><u>Responsibilities<br></u></strong><ul> <li>Work with world-class video compression designers and network protocol designers</li> <li>Identify interactions between multimedia encoding schemes and Internet protocol performance</li> <li>Identify opportunities for improvements in these interactions</li> <li>Pursue high-impact publication and patent filings </li> <br><br></ul><strong><u>Minimum Qualifications<br></u></strong><ul> <li>Ph.D. candidate in Electrical Engineering or Computer Science, preferably in the area of signal processing and/or AI</li> <li>Knowledge of Neural Networks and AI</li> <li>Strong coding skills in C and C++ </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Knowledge of media encoding and transcoding, packaging, and familiarity with media streaming protocols</li> <li>Knowledge of RESTful API design and JSON</li> <li>Experience with FFMPEG and/or other encoding/packaging open source tools</li> <li>Experience with one or more public cloud platforms</li> <li>Experience with one or more cloud AI systems</li> <li>Coding skills in Python and Javascript</li></ul>\n      "
    },
    {
        "position": "Product Management Intern",
        "company": "Vee ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-04-29T18:27:39.651Z",
        "url": "https://www.linkedin.com/jobs/view/product-management-intern-at-vee-2493164399?refId=XoMNRZTA8BhWHvVrmRUbBA%3D%3D&trackingId=YPEYAzNgrH3wqfLGXhsU%2BQ%3D%3D&position=7&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>Position:</strong> Product Management Intern (REMOTE)<br><br><strong>Reports to: </strong>CTO<br><br><strong>Location:</strong> Remote<br><br><strong>Are you passionate about exploring where, how, and why data can drive business decisions? Interested in how organizations use analytics and data to innovate, grow and transform? Driven to help establish, define, and evangelize how product management can help drive a strategy? <br><br></strong><strong><u>Company Overview<br><br></u></strong>Vee inspires people to align on <em>Purpose</em> so they can unlock their individual and collective human potential. We are an early stage startup poised for dramatic growth. We specialize in developing ways to drive greater strategic alignment to unlock enterprise innovation and growth. After spending considerable time exploring the need for better alignment models across diverse organizations, we have developed a framework and methodology based on insights from extensive research. We are building products to assess gaps and are offering our consulting services to help 21st century leaders develop and implement their organizational and people strategies, along with the capabilities required to operationalize their <em>Purpose</em> as they transform.<br><br><strong><u>Position Overview<br><br></u></strong>Join our fast-growing team! You will help own strategy, development, and enhancement of Vee products. We are driving intelligent, insightful, and predictive business results in the realms of people, purpose, and performance.<br><br><strong><u>General Responsibilities<br></u></strong><ul> <li>Use empathy to understand and meet user needs.</li> <li>Help define and manage product roadmap and features</li> <li>Define and prioritize user stories</li> <li>Run Agile planning and backlogs</li> <li>Work closely with the senior management to drive towards near-term business value and long-term product innovation</li> <li>Help own and manage the technology backlog, defining acceptance criteria and prioritizing user stories, while partnering with the Chief Product Officer to set sprint goals and reviews.</li> <li>Establish requirements based on market trends, analytics and researched customer needs.</li> <li>Collaborate with Data Science, Cloud Engineering, People Science, UX Design and Strategy</li> <li>Communicate results and ideas to key stakeholders at Vee</li> <br><br></ul><strong><u>Core Experience &amp; Requirements<br></u></strong><ul> <li>Masters degree in Business (MBA), Business Data Analytics, Integrated Design, Industrial Engineering, Ethnography, Computer Science, Product Design, or a related field</li> <li>Knowledge of data visualization tools (e.g. Power BI, Tableau)</li> <li>Strong collaboration skills - you partner well with others to solve problems and actively incorporate input from various sources</li> <li>Excellent oral and written communication skills</li> <li>Working with key stakeholders to drive business results</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Data-driven human-centric toolkit</li> <li>Experience with user research, documenting requirements, and product roadmaps.</li> <li>Agile methodology experience.</li> <li>Experience using a project management tool, especially Teamwork</li> <br><br></ul><strong>Profile<br><br></strong>Purpose is what drives you. Your passion for your work has led you here. You are ready to combine your experience with ours to help our client companies gain competitive advantage. You bring strong creative thinking skills in addition to superior communication skills, allowing you to develop creative solutions for any challenge that comes your way.<br><br>You:<br><ul> <li>Love what you do, love to be busy, and love to produce by being organized and methodical</li> <li>Work with a sense of urgency and have a strong drive for results</li> <li>Have the resilience and agility to adapt quickly in a fast-paced environment</li> <li>Work independently as well as collaboratively to stretch thinking into creative solutions</li> <li>Have strong verbal and written communication skills</li> <li>Are excited about and suited for a startup, where you'll be wearing a few hats</li> <li>Are smart and fun with an empathetic nature, which will add to our culture</li> <br><br></ul><strong><u>About Vee<br><br></u></strong>Our founders and team have deep expertise in branding, innovation, design, I/O psychology, organization design, digital &amp; data product development, enterprise software and application development complemented by experience with clients ranging from emerging Silicon Valley unicorns to established leaders in government and the public and private sectors including American Express, Bank of America, BMW, Box, HP, Lowe's, Mastercard, Microsoft, Nissan, Pepsico, Procter &amp; Gamble, SAP and The Clorox Company, among others. For more information, check out our website in transition at https://www.letsvee.com/.\n      "
    },
    {
        "position": "Fire Alarm Intern",
        "company": "Johnson Controls ",
        "location": {
            "city": " Sacramento",
            "state": "CA"
        },
        "posted": "2021-05-29T18:27:44.670Z",
        "url": "https://www.linkedin.com/jobs/view/fire-alarm-intern-at-johnson-controls-2610203211?refId=XoMNRZTA8BhWHvVrmRUbBA%3D%3D&trackingId=LypSGsRPArpyp7VAzkDl1A%3D%3D&position=10&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>What You Will Do<br><br></strong>Johnson Controls invites you to apply for an internship located in Sacramento, CA. This internship is designed to provide you with a positive work/training experience and challenging objectives. Specific identified internship responsibilities are outlined below.<br><br>Responsible for working in a team to complete the installation, of fire protection systems including: low voltage wiring and device installation for fire alarm, access control, security and suppression systems. Also responsible for properly securing all Johnson Controls tools and equipment at the end of each work period so as to prevent damage or loss.<br><br><strong><u>How You Will Do It<br></u></strong><ul><li>Applies judgment based on practice and precedence.</li><li>Must be willing and able to follow directions when given.</li><li>Must be able to think ahead and keep the momentum of the task moving forward without direction.</li><li>Must maintain proper documentation for all work performed.</li><li>May review project drawings to obtain all facts necessary to perform installation activities according to specifications.</li><li>Must adhere to all company safety policies and procedures.</li><li>Must be comfortable working from heights.<br></li></ul><strong>Required<br><br></strong><strong>What we look for<br></strong><ul><li>Currently enrolled as a full-time student at an accredited U.S. college or university</li><li>Pursuing a degree in a related field of study (computer science/information systems, mechanical or electrical/electronics engineering or technology)</li><li>U.S. citizen or legal right to work in the U.S.</li><li>Follow verbal and written instructions.</li><li>Capable of performing physical labor to include carrying and moving equipment and tools weighing up to 70 lbs.</li><li>Able to work in unusual and sometimes difficult positions such as climbing ladders, scaffolding and high lift equipment up to 60 feet, working within ducts, crawl spaces, above ceilings, etc.</li><li>Ability to adhere to, implement, and follow safety guidelines and procedures at all times.</li><li>Excellent communication skills, using tact and diplomacy when dealing with customers and team members.</li><li>Positive attitude, and an ability to learn quickly.</li><li>Possess a valid driver’s license and driving record that meets company requirements.</li><li>Able to pass a pre-employment background and drug test.<br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Demonstrates an ability to learn quickly and independently.</li><li>Strong communication skills (verbal and written).</li><li>Demonstrated problem solving skills.<br></li></ul><strong><u>About JCI’s Internship/Co-Op Program<br><br></u></strong>During your assignment with JCI, you may have a variety of developmental opportunities in addition to your work assignments, such as, roundtable discussions with senior leaders to skill-building workshops, networking events, and community activities. No matter what your assignment, you will be presented with exceptional opportunities that help you explore diverse career paths! For more information on our company, a list of other intern/co-op opportunities, or to create a profile you can visit us at www.johnsoncontrols.com/careers<br><br><strong>Job<br><br></strong>Administration<br><br><strong>Primary Location<br><br></strong>US-CA-Sacramento<br><br><strong>Organization<br><br></strong>Bldg Technologies &amp; Solutions\n      "
    },
    {
        "position": "FinTech QA Automation Engineer Intern (US Only)",
        "company": "Token Metrics ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-06-23T18:27:54.288Z",
        "url": "https://www.linkedin.com/jobs/view/fintech-qa-automation-engineer-intern-us-only-at-token-metrics-2616022080?refId=XoMNRZTA8BhWHvVrmRUbBA%3D%3D&trackingId=CzLcySxgZ16YX2ojtjXMKg%3D%3D&position=16&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Token Metrics is looking for an experienced QA Automation Engineer intern to assist our Quality Assurance team. You will be required to oversee all aspects of software and product testing within the company. This may include developing test strategies, drawing up test documents, identifying faults, and reviewing QA reports. A QA Automation Engineer intern should have experience in analytics, problem-solving skills, and project management skills. A top-notch QA Automation Engineer intern ensures the smooth running of the QA department and ultimately customer satisfaction.<br><br>The duration of the Token Metrics internship program is two months. It is an evaluative unpaid internship with the possibility of return offers, depending on the company's needs.<br><br><strong>Responsibilities<br></strong><ul><li>Meeting with the software/product designers to determine quality assurance parameters.</li><li>Assisting the QA team in designing QA test procedures and frameworks.</li><li>Overseeing the drafting of testing documents.</li><li>Implementing testing procedures and overseeing the QA process.</li><li>Troubleshooting quality issues and modifying test procedures.</li><li>Conducting analysis checks on product specifications.</li><li>Reviewing Quality Assurance reports and highlighting problem areas.</li><li>Ensuring the successful deployment of products into the market.</li><li>Responding to requests from the design team and management.</li></ul>Requirements<br><ul><li>Bachelor’s degree in Computer Science, Software Engineering or relevant field.</li><li>Advanced programming skills including automation systems and databases.</li><li>Detailed knowledge of application functions, bug fixing, and testing protocols.</li><li>Good written and verbal communication skills.</li><li>Excellent analytical skills.</li><li>Critical thinker and detail-oriented.</li></ul>About Token Metrics<br><br>Token Metrics helps crypto investors build profitable portfolios using artificial intelligence-based crypto indices, rankings, and price predictions.<br><br>Token Metrics has a diverse set of customers, from retail investors and traders to crypto fund managers, in more than 50 countries.\n      "
    },
    {
        "position": "Growth Designer 2021 Fall Internship",
        "company": "InfluxData ",
        "location": {
            "city": " Seattle",
            "state": "WA"
        },
        "posted": "2021-05-31T18:27:56.147Z",
        "url": "https://www.linkedin.com/jobs/view/growth-designer-2021-fall-internship-at-influxdata-2577906257?refId=XoMNRZTA8BhWHvVrmRUbBA%3D%3D&trackingId=xr1UPPxxMFVGNR2GnYRLYQ%3D%3D&position=17&pageNum=26&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        Are you a budding product designer who puts the user first? Do you desire to see your work have a measurable business impact? We're looking for product design interns to join our Growth &amp; Analytics Team who want to break into the burgeoning field of Growth Design. This role is equal parts design and research, with a good measure of front-end development.<br><br><strong>What You'll Be Doing:<br><br></strong><ul> <li>Collaborating with the Growth &amp; Analytics Team to discover lightweight, high-impact UX &amp; UI enhancements to advance key growth metrics.</li> <li>Analyzing user experience flows and participating in user research to reveal pain points and find areas for improvement.</li> <li>Writing research plans with evidence and hypotheses and designing measurable experiments to test possible solutions.</li> <li>Building A/B &amp; Multivariate experiments in the InfluxDB Cloud application that are powered by Google Optimize.</li> <li>Measuring the impact of experiments and presenting the results to stakeholders in a way that proves the ROI on user experience enhancements. </li> <br></ul><strong>What You'll Bring To The Table:<br><br></strong><ul> <li>Be pursuing a master's-level degree relevant to the field of design, computer science, or social science research</li> <li>A strong visual aesthetic—you have an eye for what beautiful UI looks like</li> <li>Product design knowledge and experience demonstrated in a design portfolio</li> <li>Knowledge of user testing methods and tools and ethical research principles</li> <li>Front-End development skills in HTML, CSS, &amp; JavaScript</li> <li>A passion for rapid testing and data-driven decision making</li> <li>Familiarity with trends in the SaaS industry</li> <br></ul><strong>Bonus Points:<br><br></strong><ul> <li>Experience with Typescript, React, &amp; SASS</li> <li>Experience with using UI libraries</li> <li>Google Optimize, Google Tag Manager, and Google Analytics experience</li> <li>Desire to build skills in design, engineering, and research</li> <br></ul>It's not expected that you'll have deep expertise in every dimension above, but you should be interested in learning any of the areas that are less familiar.<br><br><em><li>We are unable to sponsor visas at this time (new or transfers) in any location*<br><br>We are 100% a remote-first company, supporting remote work throughout the United States (AZ, CA, CO, CT, FL, GA, HI, ID, IL, IN, MA, MD, MN, NC, NJ, NY, OK, OH, OR, TX, UT, VA, WA), Canada, the UK, Germany, and Italy. If you are in a state we don't yet support, we are happy to look into registering in the US state.<br><br><em><strong>Interview Process</strong></em> All our interviews are done remotely. Often the first interview is by phone or video and all subsequent interviews via video on Zoom. In order to ensure each candidate we interview is able to participate, please let us know if you do not have the ability to use a phone and/or laptop.<br><br>InfluxData is the creator of InfluxDB, the leading open source time series database. We are a Series D-funded startup, backed by Sapphire Ventures, Norwest Venture Partners, Mayfield Fund, Trinity Ventures, and Battery Ventures, and a Y Combinator success story.<br><br>InfluxData's workforce is distributed throughout the U.S. and across Europe. The company was recently named one of the 50 Best Workplaces for Innovators by Fast Company.<br><br>Our technology is purpose-built to handle the massive volumes of time-stamped data produced by IoT devices, applications, networks, containers and computers. We are on a mission to help developers and organizations, such as Cisco, IBM, PayPal, and Tesla, store and analyze real-time data, empowering them to build transformative monitoring, analytics, and IoT applications quicker and to scale.<br><br><strong>Our Core Values<br><br></strong>Our employees are the heart of the company and only by having a core set of beliefs and values will we be successful. We hire and live by these core values:<br><br><ul> <li>We value each other</li> <li>We get stuff done</li> <li>We believe humility drives learning</li> <li>We embrace failure</li> <li>We are committed to open source</li> <br></ul><em>Visit our</em><em> careers page</em><em> to learn more about working at InfluxData.<br><br></em>InfluxData is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.<br><br>InfluxData does not accept unsolicited resumes from headhunters and recruitment agencies through our website, job board or directly to employees. InfluxData will not pay fees to any third-party agency, headhunter or company that does not have a signed agreement for this position in place.</li></em>\n      "
    },
    {
        "position": "Quantitative Development Internship, Summer 2022",
        "company": "Akuna Capital ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-05-31T18:28:29.117Z",
        "url": "https://www.linkedin.com/jobs/view/quantitative-development-internship-summer-2022-at-akuna-capital-2576978800?refId=41rZ%2Be5QUXBBYggaRZlkmg%3D%3D&trackingId=KUu4aLRBoREU2%2FxhhSq%2Bgg%3D%3D&position=13&pageNum=27&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <strong>About Akuna:<br><br></strong>Akuna Capital is an innovative trading firm with a strong focus on collaboration, cutting-edge technology, data driven solutions and automation. We specialize in providing liquidity as an options market maker – meaning we are committed to providing competitive quotes that we are willing to both buy and sell. To do this successfully we design and implement our own low latency technologies, trading strategies and mathematical models.<br><br>Our Founding Partners, including Akuna's CEO Andrew Killion, first conceptualized Akuna in their hometown of Sydney. They opened the firm's first office in 2011 in the heart of the derivatives industry and the options capital of the world – Chicago. Today, Akuna is proud to operate from additional offices in Sydney, Shanghai, and Boston.<br><br><strong>What you'll do as a Quantitative Development Intern on the Quant Trading &amp; Research team at Akuna:<br><br></strong>Akuna's Quantitative Trading and Research team creates trading strategies scientifically by combining its quantitative expertise with sophisticated understanding of derivatives and financial markets. The team is looking to add Quantitative Development Interns to our team for our 10-week internship Akunacademy who will make a direct and measurable impact on our trading decisions and performance.<br><br>The successful candidate will have a strong programming background, familiarity with mathematical techniques and the fluency to leverage both skills to produce trading solutions and high-performance production code. In this role you will:<br><br><ul> <li>Design and develop production code of trading strategies: pricing models, execution logic and performance optimization along with researchers, traders and system engineers</li> <li>Analyze and incorporate market signals in our trading systems</li> <li>Advance existing codebase and propose new solutions and improvements</li> <br></ul><strong>Requirements for this role:<br><br></strong><ul> <li>Pursuing a BS/MS/PhD in a technical field – Engineering, Computer Science, Math, Physics (or related subject)</li> <li>Strong Python or C++ programming background</li> <li>Experience in object-oriented programming</li> <li>Exposure to linear algebra and introductory statistics</li> <li>Desire and ability to learn the intricacies of financial markets</li> <li>Legal authorization to work in the U.S. is required on the first day of employment including F-1 students using CPT, OPT or STEM</li> <li>Must graduate by August 2023</li> <br></ul><strong>Qualities that make great candidates:<br><br></strong><ul> <li>Experience with generic and/or parallel programming</li> <li>Deeper understanding of any of the following fields: Linear Algebra, Numerical Methods, Statistics, Optimization, Signal Processing, Computer Architecture, Machine Learning, Heterogeneous/High Performance computing</li> <li>Exposure to financial markets and trading</li></ul>\n      "
    },
    {
        "position": "Perception Research Engineer Internship- Fusion",
        "company": "TuSimple ",
        "location": {
            "city": " Austin",
            "state": "TX"
        },
        "posted": "2021-06-25T18:29:00.515Z",
        "url": "https://www.linkedin.com/jobs/view/perception-research-engineer-internship-fusion-at-tusimple-2619447858?refId=FFxYxsXOIEABf1hPfwdTCQ%3D%3D&trackingId=P6Xxm%2BQMMwKEFYihwoQDSA%3D%3D&position=8&pageNum=28&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><strong><u>Job Description<br><br></u></strong>The perception team develops cutting edge technologies to help our truck perceive the world. You will play an important role in creating novel algorithms for advanced perception and applying your algorithm on terabytes of data. You will also work closely with other talents in this field in building the next-generation of autonomous sensing algorithms.<br><br>Example projects that we are working on:<br><ul> <li>Temporal association of data from multiple sensors, including camera, LiDAR, RADAR and more</li> <li>Object tracking and state estimation in challenging real world scenarios</li> <li>Encoding perception uncertainty and collaborate with prediction team to make the system safe and robust</li> <br><br></ul><strong><u>Responsibilities<br></u></strong><ul> <li>Formulate, prototype and deploy robust and reliable solutions to cutting-edge perception problems, including sensor fusion, tracking, and state estimation.</li> <li>Investigate and develop computer vision algorithms and machine learning models for the perception system.</li> <li>Build benchmark with proper methodology and analyze large-scale data to characterize algorithms performance.</li> <li>Closely collaborate with other teams to conduct system design, integration and tests.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>M.S. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Hands-on experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Strong coding skills in C/C++ and Python</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Ph.D. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Extensive experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Publications in top-tier computer vision/machine learning conferences and/or journals.</li> <li>Knowledge and experience of GPU computation or CUDA acceleration.</li> <br></ul><strong>Perks<br></strong><ul> <li>Work with world class AI Engineers.</li> <li>Shape the landscape of autonomous driving.</li> <li>Daily breakfast, lunch, and dinner.</li> <li>Full Kitchen with unlimited snacks and fruits.</li> <br></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Perception Research Engineer Internship- Fusion",
        "company": "TuSimple ",
        "location": {
            "city": " San Diego",
            "state": "CA"
        },
        "posted": "2021-06-25T18:29:05.509Z",
        "url": "https://www.linkedin.com/jobs/view/perception-research-engineer-internship-fusion-at-tusimple-2619449605?refId=FFxYxsXOIEABf1hPfwdTCQ%3D%3D&trackingId=H06nt9EEsD077Kayffry%2Bw%3D%3D&position=11&pageNum=28&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><strong><u>Job Description<br><br></u></strong>The perception team develops cutting edge technologies to help our truck perceive the world. You will play an important role in creating novel algorithms for advanced perception and applying your algorithm on terabytes of data. You will also work closely with other talents in this field in building the next-generation of autonomous sensing algorithms.<br><br>Example projects that we are working on:<br><ul> <li>Temporal association of data from multiple sensors, including camera, LiDAR, RADAR and more</li> <li>Object tracking and state estimation in challenging real world scenarios</li> <li>Encoding perception uncertainty and collaborate with prediction team to make the system safe and robust</li> <br><br></ul><strong><u>Responsibilities<br></u></strong><ul> <li>Formulate, prototype and deploy robust and reliable solutions to cutting-edge perception problems, including sensor fusion, tracking, and state estimation.</li> <li>Investigate and develop computer vision algorithms and machine learning models for the perception system.</li> <li>Build benchmark with proper methodology and analyze large-scale data to characterize algorithms performance.</li> <li>Closely collaborate with other teams to conduct system design, integration and tests.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>M.S. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Hands-on experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Strong coding skills in C/C++ and Python</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Ph.D. in Computer Science, Electrical Engineering, Robotics or other related fields.</li> <li>Extensive experience in computer vision, machine learning for perception, robotics, autonomous system, object tracking, sensor fusion, localization and mapping etc.</li> <li>Publications in top-tier computer vision/machine learning conferences and/or journals.</li> <li>Knowledge and experience of GPU computation or CUDA acceleration.</li> <br></ul><strong>Perks<br></strong><ul> <li>Work with world class AI Engineers.</li> <li>Shape the landscape of autonomous driving.</li> <li>Daily breakfast, lunch, and dinner.</li> <li>Full Kitchen with unlimited snacks and fruits.</li> <br></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__fusion_0e8346bc2us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Software - QA Engineering Internship (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2020-12-30T18:29:07.441Z",
        "url": "https://www.linkedin.com/jobs/view/software-qa-engineering-internship-fall-2021-at-tesla-2369697414?refId=FFxYxsXOIEABf1hPfwdTCQ%3D%3D&trackingId=%2B754UAztB%2BHCrbOByrLb4g%3D%3D&position=12&pageNum=28&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Programs at Tesla<br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Palo Alto, CA</li><li>Remote<br><br></li></ul><strong><u>About The Team<br><br></u></strong>As an intern with the Software QA Engineering team, you will help to ensure great quality of Tesla’s UI and/or Autopilot software for current and next generation vehicle programs. You will work within the Infotainment and Autopilot SQA teams to manually test new and legacy UI features, help automate testing, implement new tests, and create innovative automated test systems.<br><br><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Software Engineering, Computer Engineering, Electrical Engineering or Computer Science.</li><li>Familiarity in a major programming language such as C/C++ or Java, and strong scripting skills in at least one common language (Python, Perl, Ruby, Bash, etc.).</li><li>Demonstrate good understanding of software fundamentals including software design, algorithm development, data structures, code modularity, and maintainability.</li><li>Demonstrate strong understanding of testing concepts including white box and black box testing, regression testing, performance testing, etc.</li><li>Strong attention to detail.</li><li>Experience with Linux and/or Qtr. a plus.</li></ul>\n      "
    },
    {
        "position": "Perception Research Engineer Internship - Deep Learning",
        "company": "TuSimple ",
        "location": {
            "city": " Cambridge",
            "state": "MA"
        },
        "posted": "2021-06-25T18:29:14.001Z",
        "url": "https://www.linkedin.com/jobs/view/perception-research-engineer-internship-deep-learning-at-tusimple-2619451222?refId=FFxYxsXOIEABf1hPfwdTCQ%3D%3D&trackingId=A92C%2F3pA35Y4%2Bl%2BnojBJkw%3D%3D&position=16&pageNum=28&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-06-28T18:10:48.433Z",
        "description": "\n        <em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__deep_learning_a94953492us@ivy.greenhouse.io<br><br><strong><u>Job Description<br><br></u></strong>Our deep learning team helps autonomous trucks sense and perceive the world. You will play an important role in creating novel algorithms for advanced perception and applying your algorithm on terabytes of data. You will also work closely with other talents in this field in building the next-generation of autonomous sensing algorithms.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Research and prototype development using deep learning algorithms with a special focus on the perception modules including Camera, LiDAR, Radar, and Sensor Fusion.</li> <li>Deliver high-quality and reliable code and integrate with the perception system on the L4 autonomous driving trucks.</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Master in Computer Science, Electrical Engineering, or other related field.</li> <li>3+ years of research or practical experience in applying deep learning algorithms on large scale and real world data.</li> <li>Strong knowledge in deep learning related topics including but not limited to detection, segmentation, 3D perception (image, point cloud), and spatial-temporal analysis.</li> <li>Strong coding skills in Python and C++.</li> <li>Familiar with Linux and deep learning frameworks such as MXNET (preferred)/PyTorch/TensorFlow.</li> <br><br></ul><strong><u>Preferred<br></u></strong><ul> <li>Ph.D. in Computer Science, Electrical Engineering, or other related field.</li> <li>Prior academic or industrial experience for solving perception problems in autonomous driving.</li> <li>Track record of publishing in top-tier computer vision or machine learning conferences or/and journals.</li> <br></ul><strong>Perks<br></strong><ul> <li>Work with world class AI Engineers</li> <li>Shape the landscape of autonomous driving</li> <li>Daily breakfast, lunch, and dinner</li> <li>Full Kitchen with unlimited snacks and fruits</li> <br></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19 <br><br></em>You can apply to the job with this email address:<br><br>algo__2022___perception_internship__deep_learning_a94953492us@ivy.greenhouse.io<br><br><strong>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control</strong>\n      "
    }
]