[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-02-06T05:58:48.357Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=xPIfq8APAWZv%2FRiqWGxLtg%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:48.357Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Teampay",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-02-04T05:58:48.810Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-teampay-2411662001?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=77BzdS3QqpxtQAmFQ%2BzLRw%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:48.810Z",
        "description": "<strong><u>About Teampay<br><br></u></strong>Teampay is an entirely new way to manage spend, giving you proactive controls and real-time visibility - without slowing down your employees. With Teampay's distributed spend management platform, you can manage all types of purchasing, made by anyone, from end-to-end. Employees love the effortless experience, and Finance teams can breathe easy knowing that all spending is pre-coded &amp; pre-approved.<br><br><strong><u>About The Role<br><br></u></strong>As a Software Engineer Intern at Teampay, you'll take on projects with a sense of independence and autonomy. Your desire to learn new things will make you an avid participant on our team as you learn from our more senior developers. Previous internship experience working on web development or projects that demonstrate technical capability will contribute to your success in this role.<br><br>Common candidate qualifications include:<br><ul> <li>Full-stack Python experience </li> <li>Experience with Django frameworks preferred</li> <li>Students currently pursuing a Bachelors, Masters, or Ph.D in Computer Science, Design or Computer Engineering (or similar) degrees</li> <li>The desire to work and thrive in a small team environment</li> <br></ul>Even though you may not fit the requirements perfectly, if you are interested we encourage you to apply!<br><br><strong>You'll love working at Teampay if...<br><br></strong>You're a builder. You work towards a \"growth mindset\" including experience in the controlled chaos of a startup. You're passionate about crafting things that matter. You're curious and agile in thought and action. You value authenticity and possess a strong work ethic. You're empathetic and look forward to learning from people unlike yourself. You want to make an impact with a strong team. You look for challenges that force you to grow. You rarely miss a detail and always learn from your mistakes. You have diverse interests outside of work, but are ready to pitch in and be responsive when the pressure is on.<br><br><strong>Interested?<br><br></strong>You can learn more about the product at www.teampay.co.<br><br><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Miso Robotics",
        "location": {
            "city": "Pasadena",
            "state": "CA"
        },
        "posted": "2021-02-06T05:58:49.542Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-miso-robotics-2400286776?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=8peQUUOqIF3pGJ48rsBD6w%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:49.542Z",
        "description": "Software Engineer Intern<br><br>Internship Period<br><br>Summer 2021<br><br>Area<br><br>Why don't we see robots in every restaurant today? That's what we asked ourselves when we founded Miso Robotics. We realized we could make this come true if we commercialize the latest in robotics and artificial intelligence research and bring this arsenal to bear on the cooking problem. Our thesis is that our platform using robotic arms with artificial intelligence is flexible enough to adapt to a variety of kitchens and work alongside cooks in existing kitchens while providing great economic benefits to restaurants. Advances in robotics and machine learning along with plummeting hardware costs are gathering to form the perfect storm for a market disruption.<br><br>The challenge of bringing robotics into commercials kitchens together many disciplines within engineering and design. The compositions of teams at Miso Robotics reflect this multidisciplinary nature of work. We've built a strong team so far and we're looking for more exceptional people to join us. If you believe, like we do, that the future of the kitchen involves robotics and artificial intelligence (HINT: It definitely does) and if you want count yourself among the handful of lucky people who've found themselves with the opportunity to solve this problem, then Miso Robotics might be the right place for you!<br><br>Role<br><br>As a Software Engineer Intern, you will follow software engineering best practices to design, prototype, and commercialize dashboards that will be crucial for our business. These systems will control a variety of hardware including robotic arms and cameras. The software engineering will be specialized to the field of robotics and will involve path planning, computer vision, and controls.<br><br>In your internship, you will work in Research &amp; Development where you will join a multidisciplinary product team. You'll develop novel technology using the latest robotics research. You'll learn to be effective with planning, prioritization, time management, collaboration, and communication. If you plan to go into industry, these skills that you learn will give you a huge head start on your career.<br><br><strong><u>Responsibilities<br><br></u></strong>On a day to day basis, you will:<br><ul><li>Develop software in Python, HTML and CSS</li><li>Build and test interactive Dashboards</li><li>Share your results in internal demos</li><li>Participate in design sessions with your team to build a shared understanding of the product</li><li>Attend daily stand ups with your team where you strategize on the work for the day</li><li>Maintain documentation on the software you create<br><br></li></ul><strong><u>Qualifications<br><br></u></strong>Minimum qualifications:<br><ul><li>Enrolled in Bachelor's degree in Computer Science or related Engineering with strong programming skills</li><li>Experience in either Python or HTML</li><li>Strong analytical skills and ability to learn at hyperspeed</li><li>Strong attention to detail</li><li>Understanding of algorithms and data structures</li><li>Effective oral and written communication skills</li><li>Ability to collaborate effectively with a team</li><li>Self-motivated and able to solve problems independently<br></li></ul>Preferred qualifications:<br><ul><li>Expertise in CSS and javascript</li><li>Experience with multithreading and concurrency</li><li>Knowledge of design patterns, template metaprogramming</li><li>Experience building complex software systems</li><li>Experience with practices for a full software development cycle, including agile development, coding standards, code reviews, and testing<br></li></ul>Powered by JazzHR<br><br>hVVZGkWneE"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Lob",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2021-02-08T05:58:49.954Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-lob-2394744126?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=KoDeuoaRKNu0RSoSsQGx%2BQ%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:49.954Z",
        "description": "Lob builds APIs that increase the connectivity between the offline and online worlds. We started with our Print and Mail API which helps developers programmatically send, route, and track physical mail at scale. The second API we launched was Address Verification as addresses are the gateway to the offline world. This API helps people make sure the things they’re sending actually get there.<br><br>Customers and developers love our products! We’re growing fast to meet their needs. We offer remote working opportunities in California, Texas, Michigan, Pennsylvania, New York, Illinois, Washington, Colorado, Utah and Oregon. Once safety allows, you can also work onsite at our San Francisco headquarters. Lob builds APIs that increase the connectivity between the offline and online worlds.<br><br>As an intern on our software engineering team, you’ll have a rare chance to make a direct impact on our products. You will work on a modern technical infrastructure and you will receive extensive training from experienced team members. We want to foster your personal and professional growth in a challenging but rewarding work environment.<br><br><strong><u>As An Intern At Lob, You Will<br></u></strong><ul> <li>Build new features on our API product offerings.</li> <li>Improve our existing API offerings to provide the best possible service and experience to our customers.</li> <li>Develop systems that are scalable, maintainable, and secure.</li> <li>Take on challenging problems in distributed systems, cloud computing, API design, frontend UI engineering, and more.</li> <br><br></ul><strong><u>For This Role We’re Looking For<br></u></strong><ul> <li>Independent experience on at least one project that involves the following web technologies (or similar):</li></ul><ul> <li>Relational databases, SQL</li> <li>Programming languages like: JavaScript, Python, Ruby</li> <li>Front-end frameworks like React or Vue</li> </ul> <li><strong>Completion of your junior year of BS/BA (or first year of MS) in Computer Science or a related field by the end of Spring 2021 OR the completion of a coding bootcamp or equivalent experience. </strong></li> <li>Strong communication, problem solving, collaboration, and analytical skills.</li> <li>Someone able to work full-time for the duration of the 12 week internship.</li> <br>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."
    },
    {
        "position": "Software Engineering Intern",
        "company": "Surescripts",
        "location": {
            "city": "Raleigh",
            "state": "NC"
        },
        "posted": "2021-01-25T05:58:50.453Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-surescripts-2391456398?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=0OynaLxeEfo4ZHQv%2FVBkPg%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:50.453Z",
        "description": "<strong>Software Engineering Intern<br><br></strong>Raleigh, North Carolina<br>Our purpose is to serve the nation with the single most trusted and capable health information network, built to increase patient safety, lower costs and ensure quality care.<br><strong><strong>What You’re Like<br></strong></strong>You have a relentless desire to get stuff done. A true champion of the collective objective, you’re energized by applying your expertise with a group of talented people to achieve something important, together. You’re curious and passionate about new technologies and cutting-edge innovation, and you enjoy pulling together complex pieces of a puzzle to deliver a powerful and meaningful end-product. You’re a translator between people and teams that don’t use the same lingo. You don’t settle for short-term gratification—you’re into long-haul, incremental efforts that require endurance, patience and next-level collaboration.<br><br><strong><strong>What We’re Like<br><br></strong></strong>Surescripts Network Technology and Operations (NT&amp;O) is comprised of smart people who love to work towards a common goal, often delivering an innovative, industry-leading solution to the healthcare marketplace. We pride ourselves on quality work that’s grounded in complete transparency and accountability. When a project goes off the rails—and they do from time to time—we rally around each other to fix it and move on. While our gratification is often the result of a months-long effort, we never tire of delivering a huge result that has an exponentially positive impact on the healthcare system—whether it’s quality, cost or patient safety.<br><strong><strong>OK, But Here’s What It’s Really Like<br></strong></strong>Working at Surescripts NT&amp;O, your thinking cap will always be on. You’ll be challenged to make sure that disparate, cross-functional pieces come together to create a desired result. You might swarm around some work if you think a milestone is about to be missed. You’ll work to quickly understand diverse technologies, and establish and maintain relationships with groups who see and talk about things differently.<br><br><strong><u>Job Summary<br><br></u></strong>This is a tremendous opportunity to work on the Surescripts Software Engineering team! We are looking for two interns to join us full-time during the summer of 2021. Each Software Engineering Intern will be given the opportunity to work on an Agile Team with other Interns and be mentored by the Surescripts’ Software Engineering team to develop a new application which will help enhance the capabilities of the nation’s leading healthcare network. During the 10-week internship, we will form a small autonomous Agile Team which will focus on creating an application and deploying it to production. The application with be designed, built and tested entirely by the Agile Team. This is a great opportunity to experience full-stack software development, in a mature, agile and fun software engineering environment. Learn how real teams produce reliable, high-quality software. Learn modern frameworks and patterns for web applications and web services. Test and improve the performance, reliability or supportability of your own code. Make an impact in Healthcare Information Technology and contribute to the Surescripts purpose of serving the nation with the single most trusted and capable health information network, built to increase patient safety, lower costs and ensure quality care.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Develop a brand new application to help enhance the capabilities of the nation’s leading healthcare network</li> <li>Full stack development of a web application and supporting backend services</li> <li>Work on every aspect of the software development lifecycle including analysis, design, development, testing, and launch</li> <li>Present accomplishments to senior leadership</li> </ul> <strong><strong>Qualifications</strong></strong> <strong><strong>Basic Requirements:<br></strong></strong><ul> <li>Must be able to participate entire timeframe of internship (June 1st – August 6th, 2021)</li> <li>Must be able to work 40 hours per week</li> <li>Working towards a bachelor’s degree in computer science or similar discipline (preferable with an expected graduation date of December 2021 or June 2022)</li> <li>Proficient understanding of at least one of the following: Java, C#, C++, C, GoLang, Ruby, Python, JavaScript, Scala, Clojure or similar</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Experience writing complex applications using a modern programming language</li> <li>Experience building web applications and web services</li> <li>Familiarity with web frameworks such as Angular, React, or Vue</li> <li>Attention to detail and ability to finish tasks quickly but accurately</li> <li>Make a substantial contribution as a member of a small team</li> <li>Experience working with relational databases</li> <li>Experience with unit testing and automated integration testing</li> <br><br></ul><strong><u>Physical And Mental Requirements<br><br></u></strong>While performing duties of this job, an employee may be required to perform any, or all of the following: attend meetings in and out of the office, travel (sometimes extensively), communicate effectively (both orally and in writing), and be able to effectively use computers and other electronic and standard office equipment with, or without, a reasonable accommodation. Additionally, this job requires certain mental demands, including the ability to use judgement, withstand moderate amounts of stress and maintain attention to detail with, or without, a reasonable accommodation.<br><br>Surescripts is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate on the basis of race, color, religion, age, national origin, ancestry, disability, medical condition, marital status, pregnancy, genetic information, gender, sexual orientation, parental status, gender identity, gender expression, veteran status, or any other status protected under federal, state, or local law.<br><br>Surescripts participates in E-Verify.<br><br>Posted 16 Days Ago Full time REQ1277<br><br>Surescripts was founded in 2001 when the pharmacy industry and other collaborators set out to replace paper prescriptions with electronic. Today, we’re the nation’s largest health information network, connecting pharmacies, care providers, benefit managers and technology partners to get the right information to the right place at the right time. We offer industry-leading solutions that digitize manual workflows and use our unparalleled breadth of data to vastly improve healthcare connectivity, patient safety and provider efficiency.<br><br><u>EEO is the Law</u> | EEO is the Law Supplement | <u>Pay</u> <u>Transparency</u> Nondiscrimination<br><br>Surescripts participates in E-Verify. Details in English and Spanish .<br><br>Right to Work Statement in <u>English</u> and <u>Spanish</u> ."
    },
    {
        "position": "Software Engineer Intern",
        "company": "Lucid Circuit, Inc.",
        "location": {
            "city": "Santa Monica",
            "state": "CA"
        },
        "posted": "2021-02-02T05:58:51.156Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-lucid-circuit-inc-2395895141?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=dTTgKWayt%2BsgIkeTicPc4w%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:51.156Z",
        "description": "<p>Join Lucid Circuit and help develop aerospace-focused, cognitive edge-resilient processors and tools. You will be responsible for assisting in establishing an automated build process. Applicants should have a computer science, computer engineering, or electrical engineering background with the appropriate skill set.</p><p><br></p><p>This is an opportunity to work with subject matter experts in custom tooling for novel architectures, compilers, statistical learning, microelectronics, semiconductors and radiation physics. A broad technical background is central to this unique opportunity to solve challenging optimization problems at Lucid Circuit.</p><p><br></p><p><strong><em>*This is an <u>immediate</u> opening for an on-site internship (no remote work available), so only local candidates will be considered. </em></strong></p><p><br></p><p><strong>Required Experience</strong>:</p><ul><li>Linux systems configuration and management</li><li>Git source control management</li><li>Proficiency in C/C++, scripting (Python preferred), virtual machines, and makefiles</li></ul><p><br></p><p><strong>Preferred Experience</strong>:</p><ul><li>Continuous integration &amp; continuous deployment and related tools such as Jenkins, shell scripting, CMake, and unit testing</li></ul><p><br></p><p><strong>Benefits and Perks&nbsp;</strong></p><ul><li>Competitive compensation commensurate with experience.</li><li>Premier office location in Santa Monica.</li><li>A team that will challenge you intellectually and creatively.</li></ul>"
    },
    {
        "position": "Software Developer Intern",
        "company": "Synopsys Inc",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-25T05:58:51.601Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-synopsys-inc-2401934121?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=gPlWJohh17eHuwooWait3g%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:51.601Z",
        "description": "<strong>At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you. <br><br></strong>Synopsys Software Integrity Group helps organizations build secure, high-quality software, minimizing risks while maximizing speed and productivity. Synopsys, a recognized leader in application security, provides static analysis, software composition analysis, and dynamic analysis solutions that enable teams to quickly find and fix vulnerabilities and defects in proprietary code, open source components, and application behavior. With a combination of industry-leading tools, services, and expertise, only Synopsys helps organizations maximize security and quality in DevSecOps and throughout the software development life cycle. For more information, go to www.synopsys.com/software .<br><br>You will work with the Coverity Connect team. They are looking for a full-stack Software Developer intern (for 6 months) to help develop and maintain our Coverity Connect product, including its backend and front-end layers for defect browsing, general navigation, system configuration and the Policy Manager. Coverity Connect is the Integrity Manager Platform for Coverity Static Analysis, and we are changing the way quality software is delivered. You will be responsible for improving and extending the user interface experience of a product used by thousands of developers around the world.<br><br><strong><u>The Ideal Candidate Is Someone Who<br><br></u></strong><u><strong> Skill Requirements: </strong> <br></u><ul><li> has outstanding analytical skills and strong problem-solving abilities </li><li> enjoys working on research projects on specific areas of interest </li><li> strives to produce quality code that isn't finished until it is tested </li><li> enjoys delivering a great user experience that solves real-world problems </li><li> thrives in a fast-paced team environment <br><br></li></ul><strong><u>Must Have<br></u></strong><ul><li> Excellent problem-solving skills and enjoy challenging work </li><li> Experience with Java development </li><li> Experience with front-end development <br><br></li></ul><strong><u>Bonus Experience<br></u></strong><ul><li> Containerized applications </li><li> Cloud deployments </li><li> Experience with unit testing </li><li> Experience with Mac/Windows/Linux platforms <br><br></li></ul><strong><u>Personal Qualities<br></u></strong><ul><li> Strong English communicator (written and verbal) </li><li> Willing to pitch in wherever necessary </li><li> Strong interest in learning and growing </li><li> You care (about others, about doing a good job, about details) </li><li> Motivated by quality, excellence, and results <br><br></li></ul><strong><u>Education Requirements<br></u></strong><ul><li> Must be currently enrolled in a Bachelors Program with 3 years completed pursuing Computer Science of Computer Engineering. <br></li></ul>Synopsys Canada ULC values the diversity of our workforce. We are committed to provide access &amp; opportunity to individuals with disabilities and will provide reasonable accommodation to individuals throughout the recruitment and employment process. Should you require an accommodation, please contact hr-help-canada@synopsys.com.<br><br><strong> Inclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.</strong>"
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Domo, Inc.",
        "location": {
            "city": "American Fork",
            "state": "UT"
        },
        "posted": "2021-02-05T05:58:52.052Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-domo-inc-2392067807?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=crLmr%2FOfrOUYqW55rELXcQ%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:52.052Z",
        "description": "We are Domosapiens- uniquely skilled, passionate data lovers anchored in a culture of connectivity. We are transforming the way business is managed by putting real-time data into the hands of every decision-maker across organizations. Diversity is valued here because homogenized teams create echo chambers; and nobody benefits from that. The insight garnered from diverse backgrounds, perspectives, and lived experiences results in pioneering innovations across the organization and better experiences for our customers. The more diverse our talent, the more impactful the Domosphere becomes.<br><br><strong><u>Position Summary<br><br></u></strong>Our engineering team is rapidly growing and we are looking for Software Engineer Interns to be a part of our fast-paced, high-energy team. Our engineering interns are serious about the success of the company and are given the tools and environment they need to succeed. If you are looking for an internship with a passion for learning cutting edge web technology, solving interesting business problems, and you believe that planning, hard work, teamwork, and creating high quality experiences is what it takes to succeed, then this is the job for you.<br><br><strong><u>Key Responsibilities<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in development areas such as algorithms, databases, and distributed systems;</li> <li>Help with the design and development of Domo's data analysis platform;</li> <li>Work with other engineering teams to optimize the usage and efficiency of Domo's data analysis platform;</li> <li>Help develop methods and tools to monitor the performance and reliability of Domo's data analysis platform.</li> <br><br></ul><strong><u>Job Requirements<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in web technologies such as HTML/CSS, Java, and Spring;</li> <li>Demonstrated aptitude for learning new technologies;</li> <li>Ability to communicate and interface with technical and non-technical members of the organization;</li> <li>Working on a College degree in Computer Science, Information Systems, or related field and/or equivalent combination of experience and education.</li> <br></ul><strong>Domo is an equal opportunity employer.</strong>"
    },
    {
        "position": "Software Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Riviera Beach",
            "state": "FL"
        },
        "posted": "2021-02-05T05:58:52.428Z",
        "url": "https://www.linkedin.com/jobs/view/software-intern-at-lockheed-martin-2406796627?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=rwbI7s7O032YWIQFSNktlw%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:52.428Z",
        "description": "<strong>Description:</strong>Software Development though complete life cycle for Underwater Vehicles. This includes embedded software, lab simulations, onsite lab admin and underwater vehicle dockside and offshore software testing.<br><br><strong><u>Basic Qualifications<br><br></u></strong>Seeking BS in Computer Science, Computer Programmer or Computer Engineer Degree with experience in C++/C, Python Scripting, Jenkins, Linux/Windows, Embedded Systems, Visual Studio, Git/GitLab and experience with Admin of Window Server, Window Desktop and Linux.<br><br>The position will start in March 2021 and candidate must have capability to be onsite in LM Palm Beach for testing during the school year.<br><br><strong><u>Desired Skills<br><br></u></strong>JIRA, Sikuli or other OCR testing, Experience with underwater vehicles, robotics. Unix and window scripts. Experience with continuous integration process and development. Linux (RedHat, Ubuntu), Unity<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern"
    },
    {
        "position": "Software Internship",
        "company": "Verizon Media Platform",
        "location": {
            "city": "Dulles",
            "state": "VA"
        },
        "posted": "2021-02-04T05:58:52.776Z",
        "url": "https://www.linkedin.com/jobs/view/software-internship-at-verizon-media-platform-2399225504?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=DZwSddLKLvGcvavjCi5z3A%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:52.776Z",
        "description": "<strong><u>A Little About Us<br><br></u></strong>We are the content platform, recommendation and personalization team for the Verizon Media brands. Our system powers properties such as Yahoo.com, Yahoo Sports, Yahoo Finance, AOL.com, HuffPost, and Engadget on the web as well as the mobile experience. We own and operate platforms that power various services that enabled acquiring content, storage, personalization, and serving personalized content stream to user experience on different properties.<br><br><strong><u>Responsibilities<br><br></u></strong>For your internship on the Core content platform team you will be given a very specific project when you start. We will probably discuss a few optional projects with you during your first week so we can all chose the one that fits you the best. Then we will discuss the goals and milesto<br><br><strong><u>Your Day-to-day Responsibilities Will Include The Following<br><br></u></strong>nes you will need to achieve in order to succeed in your project. Then you’ll get started working on it.<br><ul><li> Work on projects of diverse scope and complexity to design, build, implement, modify, test, debug and deploy software systems, large-scale infrastructure platforms and network services that are the foundation of multiple Verizon Media properties and applications</li> <li> Responsible for performance, reliability, availability, scalability and security. Services are delivered to applications through standard and proprietary protocols and behavior may be customized via complete APIs (Application Programming Interfaces) and/or web services<br></li> <li> Come up with design specifications for the features and conduct formal and informal design reviews with the team<br></li> <li> Implement and test design across grid, low latency and stand alone technologies<br></li> <li> Launch changes for A/B testing for a small percentage and evaluate the impact of the feature on user engagement. Deploy for general availability when A/B test shows positive impact<br></li> <li> Coordinate with various partner teams to achieve a common goal by discussing and planning the technical solutions<br><br></li></ul><strong><u>Minimum Qualifications<br></u></strong><ul><li> Good understanding of core computer science concepts that demonstrate that you have absorbed much of what you are learning in school</li> <li> Ability to write pseudo code that correctly solves a variety of fundamental CS problems<br></li> <li> Fundamental understanding of multithreading concepts like race conditions, deadlock, semaphores, locking, etc.<br></li> <li> Fundamental understanding of various data structure concepts like hashmaps, lists, arrays, etc.<br></li> <li> Good skills in Java, Unix, Big data technologies<br><br></li></ul>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Particle Health",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-02-06T05:58:53.137Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-particle-health-2410460571?refId=fefdfa0d-5a57-4c93-98de-8b6fda5e6692&trackingId=aghK1FTrnRfSkmh44m9Dtg%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-02-08T05:58:53.137Z",
        "description": "Particle Health is looking for software engineer interns to help us revolutionize access to and sharing of medical data! Similar to how Plaid powers apps like Venmo, Mint and Robinhood we are developing a powerful, simple to use API ecosystem to break down the roadblocks between patients and their medical records. As a member of the engineering intern program at Particle, you will get to work on projects relating to integrating our systems into national health networks, creating data pipelines, and building data sharing tools via our API.<br><br>The ideal candidate for this position will be a Computer Science undergraduate or graduate student who is eager to learn about software engineering and help build software systems.<br><br><strong> Responsibilities <br></strong><ul><li>As an engineering intern at Particle Health, you will receive mentoring to empower you to learn while also having high autonomy &amp; flexibility to complete the important projects that interest you. The responsibilities of the role include:</li><li>Plan, build, test, and launch various engineering projects of your choice</li><li>Participate in code reviews on Github</li><li>Learn about software development and how projects are completed at startups</li></ul>Qualifications<br><ul><li>Applicants must be currently authorized to work in the United States</li><li>Currently enrolled as a graduate or undergraduate student in Computer Science or a similar program</li><li>A deep desire for learning</li><li>Passion for software and computers</li><li>Familiarity with version control, such as git</li><li>You may have the option to work in our New York City office - State and Particle regulations permitting</li><li>Ability to work under conditions of ambiguity in a fast-growth, sometimes uncertain and complex environment</li><li>Strong written and verbal communication skills, including presentation skills</li></ul>"
    }
]