[
    {
        "position": "Computer Science Intern",
        "company": "PassiveLogic ",
        "location": {
            "city": " Holladay",
            "state": "UT"
        },
        "posted": "2021-07-15T19:39:47.846Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-at-passivelogic-2644858152?refId=TOF%2BxKjq0c5m07XHCp%2BMIA%3D%3D&trackingId=hOog2YQcppygD3O2WFPqaw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-15T19:39:46.323Z",
        "description": "\n        Tired of web companies masquerading as tech startups? Looking for real development, with real impact<br><br>We are a pioneering autonomous building systems startup company. We are building a groundbreaking autonomous control platform for high-performance buildings and the future of smart cities.<br><br>We have a position for a computer science intern that offers the opportunity to be a meaningful part of a team, develop production code, build test infrastructure, construct IT solutions, and solve real-world engineering problems.<br><br>This is an internship position (or entry-level), with the potential of a full-time position for the right candidate. Opportunity for involvement is limited only by your enthusiasm.<br><br><strong><u>What You Will Be Doing<br><br></u></strong>Developing a client-side application software<br><br>Building test infrastructure<br><br>Database development for cloud and test support<br><br>Building machine learning back-end<br><br>Developing data visualization interfaces<br><br>IT infrastructure management<br><br><strong><u>You Must Have<br><br></u></strong>Strong research and problem solving skills<br><br>Experience with MacOS<br><br>Networking and system administration knowledge and experience<br><br>Strong programming skills (e.g. Javascript, Swift, Typescript, etc)<br><br>Must be able to both work in a team and have the ability to self manage on your own<br><br><strong><u>You Should Have<br><br></u></strong>Experience with relational databases, PostgreSQL<br><br>Experience with repositories, and content management<br><br>Experience with HTML and CSS<br><br>Experience with MVC design patterns<br><br><strong><u>It's Helpful To Have<br><br></u></strong>Fundamentals of human-computer interaction design<br><br>Experience with application development<br><br>Experience with AI and ML<br><br>Experience with Xcode<br><br><strong><u>Compensation<br><br></u></strong>Competitive compensation; Hourly wage, based on experience Medical, dental, vision (full time<br><br>Free drinks, snacks, and catered lunches<br><br>We can support academic credits for studentsMust be diligent and get work done, but we do respect powder days<br><br><strong><u>To Apply For This Position<br><br></u></strong>You must have or near completing a B.S. or better. Unless you have significant experience, a coding bootcamp isn't sufficient computer science background for this position. With your introduction and resume, include a description of a project (of any type) you personally created, devised, built, managed, organized, or designed that was of your own self-initiative. Also include any portfolio work, links to your code repo, personal website, etc.<br><br><strong><u>About PassiveLogic<br><br></u></strong>PassiveLogic builds the world's first autonomous platform for buildings. We make an infinitely configurable platform that enables users to design their own custom autonomous systems. We've reinvented the fundamental principals of automation to replace todays antiquated control logic.Our focus is democratizing automation for the average person, have an unmatched impact of energy savings, while ensuring buildings and smart cities are accessible, self-optimizing and human-centric.\n      "
    },
    {
        "position": "Software Developer Intern",
        "company": "Bastian Solutions ",
        "location": {
            "city": " Louisville",
            "state": "KY"
        },
        "posted": "2021-07-08T19:40:12.787Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-bastian-solutions-2638628053?refId=TOF%2BxKjq0c5m07XHCp%2BMIA%3D%3D&trackingId=0DuMu6E6%2Bb0VLwmjhBXJig%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-07-15T19:39:46.323Z",
        "description": "\n        Seeking creative, talented up and coming developers who are eager to learn, enjoy challenges, and looking to jump start their career in development. Bastian Software Solutions is the software division in Bastian Solutions, of one of the fastest growing material handling companies in the world. We develop state of the art Warehouse Management Software. We are seeking future Software Developers with a background in Computer Science, Computer Engineering or IT to come join us for their co-op or internship in order to gain real world experience.<br><br>Exacta is our proprietary software created in house at Bastian Software. Our internships and Co-op begin in the QA department doing manual integrated testing for existing, modified, or custom software to be implemented for our clients. Testing the software will give an introduction to our software and learn its functionality and purpose. You will have exposure to technical tools including MS Visual Studio/Team Foundation Server, MS Office, Hyper-V or VMware, Windows Server, and Oracle. As you grow and grasp the Exacta Software you will transition to the Development team.<br><br><strong><u>Requirements<br></u></strong><ul><li>In pursuit of their Bachelors or Master’s degree. </li></ul><ul><li>Eager to learn in Visual Studio, C#, Visual C++, SQL Server and/or Oracle</li></ul><ul><li>Strong quality control and computer skills including ability to learn how to manually deploy and test software</li></ul><ul><li>Strong troubleshooting skills. </li></ul><ul><li>Ability and willingness to learn</li></ul><ul><li>Must be eligible to work in the USA long term without sponsorship.<br><br></li></ul><strong><u>About Bastian<br><br></u></strong>Bastian Solutions, a Toyota Advanced Logistics company, is an independent material handling and robotics system integrator providing automated solutions for distribution, manufacturing, and order fulfillment centers around the world. Our team specializes in consulting, system design, project management, maintenance, and installation, while sourcing the best equipment and automation technology. We take great pride in providing exceptional service and flexibility to our customers.<br><br>In addition to exciting work at a growing company, we offer the following benefits:<br><ul> <li>Health, Dental, and Vision Insurance</li> <li>401(k) Retirement Plan with a company match</li> <li>Vacation/Holiday Pay</li> <li>Tuition Reimbursement</li> <li>Flexible Work Schedules</li> <li>Volunteer Work</li> <li>Professional Associations, Conferences and Subscriptions</li> <li>Company Meetings &amp; Events</li> <br><br></ul>Bastian Solutions does not work outside recruiting agencies. No solicitation phone calls please.\n      "
    }
]