[
    {
        "position": "Software Intern - Tesla Bot",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-31T18:35:43.963Z",
        "url": "https://www.linkedin.com/jobs/view/software-intern-tesla-bot-at-tesla-2698177044?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=PKXmIIh9j1ITrXNIKil9kw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: These positions are expected to start around late-September 2021 and last through at least December 2021 or are expected to start around January or February 2022 and continue through the entire Spring term (i.e. through April/May) or into Summer 2022 We ask for a minimum of 12 weeks, </em><strong><em>full-time</em></strong><em>. Please consider before submitting an application. <br><br></em><em>International Students: If your work authorization is through CPT, please consult your school </em><strong><em>before</em></strong><em> applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong><u>About The Team<br><br></u></strong>Tesla’s Mobile Robotics team designs and builds humanoid bi-pedal robots (Tesla Bot) to automate repetitive tasks and wheeled robots for manufacturing and autonomous logistics. The team joins mechanical, electrical, controls, software, and manufacturing engineering disciplines in a highly collaborative team<br><br>The Mobile Robotics team is seeking highly motivated software engineering interns who thrive in a fast-paced environment and want to apply engineering concepts to real world projects. As a software engineering intern within the Mobile Robotics group, you’ll have the opportunity to work with incredibly talented engineers who are responsible for many of Tesla’s innovations.<br><br><strong>Location: <br></strong><ul><li>Palo Alto, CA <br></li></ul><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Controls Engineering: The controls challenge in designing a fully autonomous robot includes robust dynamic and kinematic modeling, stabilization control architecture, optimal reference trajectory generation and tracking, disturbance avoidance, implementation in embedded systems and more. The ideal candidate will have an interest in modeling and control of multi DOF robots for use in real world applications. </li><li>Server/Robotic Interaction Software Engineering: We are looking for an engineering intern that will help build the server-side/robotic interaction software stack for Tesla Bot. Your contributions will automate end-to-end registration, movement, action management, job assignment, as well as the remote operation of these bots. The team builds a suite of applications that include: fleet management, mobile apps, video streaming, in addition to AR/VR apps that will help the team control, train, and orchestrate these bots. </li><li>Autonomy Engineering: Core to the Tesla Bot and wheeled vehicle’s full autonomy, the perception stack presents a unique opportunity to work on state-of-the-art algorithms for state estimation and motion planning, culminating in their deployment to real world production applications. The perception software engineer intern will help develop this stack from inception to deployment. The ideal candidate will have an interest in developing humanoid bi-pedal robot perception solutions for commercial applications. </li><li>Firmware Engineering: As a member of the hardware / embedded controls team, you will help design, layout and implement hardware interfaces and control loops to new Tesla products, using in-house hardware and proprietary bus systems. <br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Computer Science, Computer Engineering, Mechanical or Electrical Engineering </li><li>Experience in one or more of the following developer skills: C++, Python, MATLAB/Simulink or other common industry languages </li><li>Eagerness to collaborate cross-functionally with other engineering teams while able to work independently; detail-oriented and execution focused </li><li>Genuine curiosity and willingness to understand how our products are designed, built and how they operate</li></ul>\n      "
    },
    {
        "position": "Computer Science/Software Developer Internship",
        "company": "Siemens Healthineers ",
        "location": {
            "city": " Hoffman Estates",
            "state": "IL"
        },
        "posted": "2021-09-03T18:35:46.278Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-software-developer-internship-at-siemens-healthineers-2702405970?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=tOLOOVhbx8Uxk8A63PsWqw%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Now’s our time to inspire the future of healthcare together.<br><br></strong>At Siemens Healthineers, we are passionate about enabling healthcare professionals to deliver high quality patient care, and to do so affordably. A leading global healthcare company, Siemens Healthineers continues to strengthen our portfolio of medical imaging and laboratory diagnostics, while adding new offerings such as managed services, consulting, and healthcare IT services – as well as further technologies in the growing market for therapeutic and molecular diagnostics.<br><br>Siemens Healthineers develops innovations that support better patient outcomes with greater efficiencies, giving providers the confidence, they need to meet the clinical, operational and financial challenges of a changing healthcare landscape. Join our team now at Siemens Healthineers as a <strong>Computer Science/Software Developer Intern.<br><br></strong><strong>This is a role well suited to an ambitious professional, looking for the next step in their career. As a </strong><strong>Computer Science/Software Developer Intern</strong><strong>, you will be responsible for</strong>:<br><br><ul><li>You will design, develop, and implement tools for mining software test and build data.</li><li>You will design, develop, and implement generic methods to extend inhouse test framework</li><li>You extend our continuous integration infrastructure utilizing technologies such as Microsoft’s Azure Cloud</li><li>You will author technical specifications and user documentation</li><li>You will automate, automate, and then automate some more manual processes to help make workflows and infrastructure more efficient<br><br></li></ul><strong>This position may suit you best if you are familiar with </strong><strong>what is below, and would like to do develop your career with Healthineers<br><br></strong><ul><li>You have a passion for software and healthcare</li><li>You want apply foundations learned in the academic environment and put them to use in the business world </li><li>You want to learn about Molecular Imaging and how it applies to the healthcare industry and how it helps to enhance patient care</li><li>You want to get to know real world problems that we run into, level of due diligence required and likely solutions</li><li>Learn the communication skills, writing skills, review and approval processes in a formal setup</li><li>You have very good presentation skills in the customer environment, and you show team orientation, communication skills and customer orientation<br><br></li></ul><strong>Required skills to have for the success of this role<br><br></strong><ul><li>You must have a minimum GPA of 3.2 or higher </li><li>You must be comfortable working in a fully virtual environment if necessary and following company mandated COVID-19 protocol if you are able to go on site</li><li>This position can be for a student needing to complete a full-time co-op or for someone who is able to work on a part-time basis during the academic year</li><li>Rising Junior/Senior or Master student studying Computer Science, Software Development, Computer Engineering or a related major is required</li><li>Experience with object-oriented languages such as C# and/or Java and scripting languages such as PowerShell or Python is a must</li><li>Experience with databases is a plus</li><li>Experience with web technologies is a plus<br><br></li></ul><strong>Start date: January 2022; 12-month duration.<br><br></strong>At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose: To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.<br><br><strong>If you want to join us in transforming the way healthcare is delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<br><br>If you wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.<br><br><strong>Organization:</strong> Siemens Healthineers<br><br><strong>Company:</strong> Siemens Medical Solutions USA, Inc.<br><br><strong>Experience Level:</strong> Student (Not Yet Graduated)<br><br><strong>Job Type:</strong> Full-Time temporary<br><br><strong>Equal Employment Opportunity Statement<br><br></strong>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><strong>EEO is the Law<br><br></strong>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><strong>Pay Transparency Non-Discrimination Provision<br><br></strong>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><strong>California Privacy Notice<br><br></strong>California residents have the right to receive additional notices about their personal information. To learn more, click here.\n      "
    },
    {
        "position": "Applied Research Data Science Intern",
        "company": "LinkedIn ",
        "location": {
            "city": " Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-09-01T18:35:48.735Z",
        "url": "https://www.linkedin.com/jobs/view/applied-research-data-science-intern-at-linkedin-2705885309?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=7yvACF7PriQLItKGg9j7WQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Applied Research Data Science Intern - Summer 2022<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>LinkedIn’s Data Science team leverages big data to empower business decisions and deliver data-driven insights, metrics, and tools in order to drive member engagement, business growth, and monetization efforts. With over 500 million members around the world, a focus on great user experience, and a mix of B2B and B2C programs, a career at LinkedIn offers countless ways for an ambitious data scientist to have an impact.<br><br>We are now looking for talented and driven individuals to accelerate our efforts and be a major part of our data-centric culture. It is expected that this person understands scientific methodologies, has strong problem solving skills, and is comfortable with implementing algorithms. Ideally this individual will understand the fundamentals of experimentation, analytic thinking and have experience with modeling data in an area such as machine learning, optimization or time series analysis. Successful candidates will exhibit technical acumen on inference and algorithms, and the business savvy to use these technical skills to drive better business decision-making.<br><br>Responsibilities<br>Work with a team of high-performing analytics, data science professionals, and cross-functional teams to identify business opportunities, and develop algorithms and methodologies to address them.<br>Analyze large-scale structured, and unstructured data.<br>Develop methodologies to enhance LinkedIn’s product, and platform capabilities.<br>Conduct in depth and rigorous research focused on solving business problems relevant to LinkedIn.<br>Develop and implement methodologies and algorithms in areas such as machine learning and causal inference to drive member value and customer success.<br><br>Promote and enable adoption of technical advances in Data Science; elevate the art of Data Science practiced at LinkedIn.<br>Initiate and drive projects to completion with minimal guidance.<br>Communicate findings to senior leaders and evangelize data-driven business decisions.<br>This is a full-time internship role based in Sunnyvale, CA, or San Francisco, CA<br>This internship will take place between May - September 2022<br><br><br>Basic Qualifications<br><br>Currently pursuing a Masters or PhD degree in a quantitative discipline: statistics, operations research, computer science, informatics, engineering, applied mathematics, economics, etc. and returning to the program after the completion of the internship<br>Working knowledge in at least one programming language (e.g., R, Python, Java, Ruby, or Perl)<br>Experience in applied statistics and statistical modeling in at least one statistical software package, preferably R/Python.<br><br><br>Preferred Qualifications<br><br>Expected to complete degree by December 2023 or earlier\t<br>Experience with manipulating massive-scale structured and unstructured data.<br>Experience with Hadoop or other MapReduce paradigms, and associated languages such as Pig, Hive, Spark, Scala etc.<br>Working knowledge of Unix and Unix-like systems, git and code review.<br>Strong communication skills, with the ability to synthesize, simplify and explain complex problems to different types of audience, including executives<br>Research experience related to one of the following domains: Experimentation and causal inference, Machine Learning, Operations Research, Time Series Analysis, Computational Social Science or related area.<br><br><br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful. <br> <br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation. <br> <br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to: <br> <br>-Documents in alternate formats or read aloud to you <br>-Having interviews in an accessible location<br>-Being accompanied by a service dog<br>-Having a sign language interpreter present for the interview<br> <br>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice\n      "
    },
    {
        "position": "Software Engineer Internship – Autopilot (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-27T18:35:50.833Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-%E2%80%93-autopilot-fall-2021-at-tesla-2692485368?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=9XeOob4f1NgAPYZu7z1scg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Role<br><br>As a software engineering intern within the Autopilot group, you will have the opportunity to apply your technical skills to a variety of system components &amp; foundational code targeting higher performance of Autopilot. The nature of the role means that the code you write, debug, and maintain will almost always connect with a variety of other components. You will be building robust code foundations for the autonomy teams to write their applications on top of and evangelize best software practices for the better of Autopilot.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Write, debug, and maintain robust code for the entire Autopilot software stack</li><li>Optimize hardware resources usage, leverage custom hardware components where appropriate<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Experience programming in C, C++, or Python</li><li>Previous experience developing software for embedded targets</li><li>Entering or in final year at University, majoring in Computer Science or an equivalent field</li></ul>\n      "
    },
    {
        "position": "Software Engineer, Intern",
        "company": "Nuro ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-08-04T18:35:52.943Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-nuro-2678656154?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=KZTvoGek9xTzpEvQi%2B68bw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Who We Are<br><br></u></strong>Nuro exists to better everyday life through robotics. We have an elite team of entrepreneurs and engineers, designers, and scientists. We believe AI and robotics are at the cusp of transforming daily life and we are dedicated to building meaningful products with this technology. Join us and play a critical role in our mission.<br><br>Join us in our mission, as you'll play a significant role in our development and impact on everyday lives.<br><br><strong><u>About The Role<br><br></u></strong>Our software team is growing, and we are looking for talented engineers to join us and be instrumental to one of the following areas: product engineering, infrastructure, embedded systems, machine learning, mapping &amp; localization, perception, prediction, or planning &amp; controls.<br><br><strong><u>About The Work<br><br></u></strong>As a software engineering intern, you will work closely with leading experts in the field of machine learning, robotics, and software. Depending on your skill sets and areas of interest, you will work on some or all of the following: <ul><li>Product Engineering: Building a robust and automated service for our clients, partners and customers including back-end, front-end and full-stack software.</li><li>Infrastructure: Building foundational software to support Product Engineering, Autonomy, Hardware and Operations including but not limited to storage systems, processing pipelines, security, bot connectivity, simulation, data collection and machine learning infrastructure.</li><li>Site Reliability Engineering: Providing a solid foundation of infrastructure through metrics, monitoring, operational support, and collaboration with infrastructure teams; this team is where everything comes together.</li><li>Security: Architects and builds our security infrastructure and processes. </li><li>Embedded Systems: Design the brain stem software of Nuro's robots - the critical code that makes the robot sense and move in the world.</li><li>Autonomy:</li><ul><li>Machine Learning: Work across the software organization to research and develop novel machine learning methods and algorithms. Mapping &amp; Localization: Research, develop and deploy algorithms to resolve large-scale mapping and real-time localization problems for our fleet of self-driving delivery robots. Perception: Research, develop and deploy algorithms to understand the scene around the robot from sensor data. Resolve real-world perception problems like object detection, tracking and classification using computer vision, machine learning, sensor fusion and state estimation. Prediction: Develop novel algorithms that process large amounts of real-world data to train and tune behavior models for a variety of agents around our autonomous vehicles. Planning &amp; Control: Work on manipulating and controlling our self-driving vehicles including path planning, navigation, optimization and control.<br></li></ul></ul><strong><u>About You<br></u></strong><ul><li>You are a current BS or MS candidate in Computer Science, Electrical Engineering, Robotics, or a related field graduating December 2022 or later</li><li>You have experience in one or more of the following areas: backend API design, applications development, large-scale distributed systems; data storage and processing systems; advanced algorithms using C++ and Python; machine learning, multithreading; x86 architecture; and software performance tuning and optimization, robotics software frameworks, different compute modalities (CPU, GPU, FPGA) etc.</li><li>You have strong problem solving and programming skills.<br></li></ul><em>At Nuro, we celebrate differences and are committed to a diverse workplace that fosters inclusion and psychological safety for all employees. Nuro is proud to be an equal opportunity employer and expressly prohibits any form of workplace discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, veteran status, or any other legally protected characteristics.<br><br></em><em>You must be fully vaccinated against COVID-19 by your hire date to be eligible to start the role. Proof of vaccination will be required by your start date. Nuro will consider and review reasonable accommodation requests based on medical or religious grounds for qualified candidates.</em>\n      "
    },
    {
        "position": "Software - Applications Engineering Internship (Fall 2021)",
        "company": "Tesla ",
        "location": {
            "city": " Fremont",
            "state": "CA"
        },
        "posted": "2021-08-04T18:35:55.538Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-fall-2021-at-tesla-2689155016?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=c4B0c4kAA2yIGvSo5Qgt4w%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br></u></strong><ul><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br></li></ul><strong><u>Responsibilities<br></u></strong><ul><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li></ul>\n      "
    },
    {
        "position": "Software Engineer Internship – Autopilot (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-27T18:36:02.406Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-%E2%80%93-autopilot-spring-2022-at-tesla-2692490115?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=AwqI%2BYRPGI%2B95y74Y4zPLQ%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Role<br><br>As a software engineering intern within the Autopilot group, you will have the opportunity to apply your technical skills to a variety of system components &amp; foundational code targeting higher performance of Autopilot. The nature of the role means that the code you write, debug, and maintain will almost always connect with a variety of other components. You will be building robust code foundations for the autonomy teams to write their applications on top of and evangelize best software practices for the better of Autopilot.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Write, debug, and maintain robust code for the entire Autopilot software stack</li><li>Optimize hardware resources usage, leverage custom hardware components where appropriate<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Experience programming in C, C++, or Python</li><li>Previous experience developing software for embedded targets</li><li>Entering or in final year at University, majoring in Computer Science or an equivalent field</li></ul>\n      "
    },
    {
        "position": "Programmer Intern",
        "company": "RR Donnelley ",
        "location": {
            "city": " Logan",
            "state": "UT"
        },
        "posted": "2021-09-03T18:36:04.577Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-intern-at-rr-donnelley-2707522290?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=4SdYvT28J37ELJ7sMfivfQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Information Technology<br><br>Logan, UT<br><br>ID: 52561<br><br>Full-Time/Regular<br><br><strong><u>Position Summary<br><br></u></strong>Work with customers, business analysts, and team members to understand business requirements that drive the analysis and design of quality technical solutions that are aligned with business and IT strategies and comply with the organization’s architectural standards. Involved in all phases of the full systems life cycle.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Coding: Develops codes, tests, debugs, maintains, modifies, and installs routing to moderately complex programs. Apply structured programming techniques and adhere to coding standards.</li><li>Testing: Under general supervision, develops unit test and test scripts; performs unit, regression, conversion and parallel tests; develops system test data and performs system tests. Assists quality assurance testing teams.</li><li>Analysis/Design: Analyze business requirements for projects of small to medium scope and complexity. Analyze and document test results to ensure that programs are meeting the technical requirements</li><li>Technical Support: Research and resolve routine programming issues with immediate, short-term solutions.</li><li>Documentation: Assist in preparing good internal program documentation on program development and revisions.</li><li>Communication: Conveys problems, solutions, updates and project status to peers and potentially customers.</li><li>Planning: Begins to prepare time estimates for assigned tasks with assistance. Attends post-implementation reviews.</li><li>Performs other related duties and participates in special projects as assigned.<br></li></ul><strong><u>Required Skills<br></u></strong><ul><li>Enrolled and working toward a Bachelor degree in Computer Science, Information Systems, or Computer Engineering.</li><li>Must be able to demonstrate a good understanding of the information technology environment/infrastructure utilized for the job.</li><li>Demonstrate good knowledge of the assigned information technology platform.</li><li>Must have a good understanding of the assigned technology and issues of connectivity. Able to learn and apply concepts to work in the RRD specified tool set. Good knowledge and ability to set up test scenarios.</li><li>Requires very good ability to effectively analyze and solve moderately difficult work related problems on a variety of operating platforms. Must be able to appropriately define a problem and apply knowledge gained from previous issues and solutions to resolving a current challenge.</li><li>Requires good communication skills, both verbal and written. Able to understand general business concepts and apply them when communicating with diverse groups of people when completing work assignments.<br></li></ul><strong>RRD is an EEO/AA including Vets and Disabled Employer</strong>\n      "
    },
    {
        "position": "Software Engineering Internship (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-13T18:36:07.321Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-spring-2022-at-tesla-2681341334?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=KzEmTHgU4d74CGA7IS%2BlrQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around January or February 2022 and continue through the entire Spring term (i.e. through April/May) or into early Summer 2022 if available. We ask for a minimum of 12 weeks, <strong>full-time</strong>, for most internships. Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing.<br><br></em><strong>Internship Programs at Tesla<br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Bellevue, WA</li><li>Fremont, CA</li><li>Palo Alto, CA</li><li>Sparks, NV</li><li>Remote<br></li></ul><strong><u>About The Team<br><br></u></strong>Tesla is seeking highly motivated software engineering students who thrive in a fast-paced environment and want to apply CS concepts to real world projects. Our software engineers are incredibly talented and responsible for many of Tesla’s innovations including Autopilot, Tesla Superchargers and Tesla Maps! Interns in this organization will be part of a collaborative team of engineers who push the boundaries of Tesla products and services.<br><br><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Applications Engineering: The Applications Engineering team builds the platforms and applications that are the backbone of Tesla’s day-to-day operations. From the software that automates our factories, to the platform that processes your payment transactions and everything in-between, these teams build applications in-house from scratch so that we have total control as a company. Our platforms and applications allow Tesla to scale and provide the best end-to-end experience for our employees and customers. </li><li>Energy Software: The Energy Software team works on IoT platforms that support Powerwall, Powerpack, Megapack, Tesla Solar, Solar Roof, Powerhub, Supercharger, Autobidder, Model S/3/X, and the Tesla App. We have multiple software engineering internship positions open for UI and frontend development, cloud and distributed systems, and embedded firmware. </li><li>Factory Software: The Factory Engineering team is responsible for building infrastructure solutions that allow the company to redefine manufacturing and production. We focus on implementing effective software advances, distributed fault-tolerant computing, and modern user- experience to manufacturing systems throughout Tesla. </li><li>Infrastructure Engineering: The Infrastructure Engineering team designs and implements a diverse set of services and tools that power our internal software and processes. The projects you support will have a significant impact on the business and will allow us to grow at exceptional speeds. A strong candidate will either be an excellent software generalist, or someone who has an exceptionally strong backend and infrastructure background. </li><li>Service Engineering: The Service Engineering team develops tools, processes, and informational content that multiplies the efforts of the field support team. They bridge the gap between what happens with our products in the field and how they’re designed in engineering. Interns on this team will work on areas such as creating software tools for diagnostics and technical content editing. </li><li>Supply Chain &amp; Ops Automation: The Supply Chain &amp; Ops Automation team owns several internal tools that make Tesla much more efficient, such as real time tracking of materials, AI and patter recognition, and automated vision systems in warehouses and production lines. As an intern, you’ll have the opportunity to work on and learn from these cutting-edge and hugely impactful Software projects.</li><li>Vehicle Software: The Vehicle Software team lies at the forefront of innovation, constantly pushing the boundaries of performance and in-car experiences. From Tesla maps and UI, to over-the-air updates, interns will work side by side expert engineers to create services and features that set our vehicles apart from the competition. <br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Computer Science, Computer Engineering, or Electrical Engineering</li><li>Proficiency in one or more of the following developer skills: Python, Go, Java, C/C++, Ruby, SQL or other common industry languages</li><li>Experience with frontend development is a plus: JavaScript, Angular, React, CSS </li><li>Familiarity with database concepts such as MySQL, MS SQL, Oracle </li><li>Excellent grasp of fundamental computer science concepts and ability to write well-organized code </li><li>Eagerness to collaborate cross-functionally with other engineering teams while able to work independently; detail-oriented and execution focused</li><li>Genuine curiosity and willingness to understand how our products are designed, built and how they operate</li></ul>\n      "
    },
    {
        "position": "Computer Vision Intern",
        "company": "Bayer ",
        "location": {
            "city": " Chesterfield",
            "state": "MO"
        },
        "posted": "2021-08-04T18:36:14.864Z",
        "url": "https://www.linkedin.com/jobs/view/computer-vision-intern-at-bayer-2679942998?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=sYnT8xPPW5byrHcFZ%2BeI2w%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Bayer is a global enterprise with core competencies in the Life Science fields of health care and agriculture. Its products and services are designed to benefit people and improve their quality of life. At Bayer you have the opportunity to be part of a culture where we value the passion of our employees to innovate and give them the power to change.<br><br></strong><strong>Computer Vision Intern<br><br></strong><strong><u>Your Tasks And Responsibilities<br><br></u></strong>The primary responsibilities of this role, Computer Vision Intern, are to:<br><ul><li> Provide technical contributions in a fast-paced team environment to accelerate our efforts on building an analytics-driven product pipeline; </li><li> Assess needs and recommends experiments, data, and projects, suggests new algorithmic development, drive tactical decisions about approaches and needed data; </li><li> Use deep learning and machine learning algorithms, and advanced mathematical models to deliver insight, recommendations and solutions; </li><li> Develop sustainable, consumable, accurate, and impactful reporting on model inputs, model outputs, observed outputs and Key Performance Indicators (KPIs); </li><li> Present compelling, validated stories to team members and stakeholders throughout and at the completion of the internship. <br></li></ul><strong><u>Who You Are<br><br></u></strong>Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:<br><br>Required Qualifications:<br><ul><li> Currently enrolled in a Master’s degree or Ph.D. in Computer Science, Statistics, Data Science, Mathematics, Computational Biology or related STEM field; </li><li> Demonstrated proficiency in deep learning and machine learning algorithms and concepts, working with computer vision/machine learning libraries such as OPENCV, SCIKIT-LEARN, NUMPY and PANDAS; </li><li> Experience in developing, training and evaluating deep learning and machine learning models, including CNN, FCN, RESNET, GAN and/or RNN/LSTM, using PYTORCH, TENSORFLOW, KERAS and related public deep learning frameworks; </li><li> Experience in implementing deep learning architectures for image classification, object detection and object segmentation, including YOLO, R-CNN, RETINANET, FPN, and U-NET. <br></li></ul><strong> YOUR APPLICATION <br><br></strong>Bayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and you have the \"Passion to Innovate\" and the \"Power to Change\", we encourage you to apply now. To all recruitment agencies: Bayer does not accept unsolicited third party resumes.<br><br>Bayer is an Equal Opportunity Employer/Disabled/Veterans<br><br>Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.<br><br><strong>Location:</strong> United States : Missouri : Chesterfield<br><br><strong>Division:</strong> Crop Science<br><br><strong>Reference Code:</strong> 439121<br><br><strong>Contact Us<br><br></strong><strong>Email:</strong> hrop_usa@bayer.com\n      "
    },
    {
        "position": "Programmer Internships",
        "company": "Saturn Systems Software Engineering ",
        "location": {
            "city": " Duluth",
            "state": "MN"
        },
        "posted": "2021-08-27T18:36:17.324Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-internships-at-saturn-systems-software-engineering-2693728777?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=QPbsyLO2JoV%2Ba0bwiGM%2Bow%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <p>We are now accepting applications for 8-9 month full-time programmer internships onsite in Duluth, Minnesota. We develop applications using C# ASP.NET, Java, JavaScript, Python and SQL, plus other environments.</p><p><br></p><p>The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code. You will use your leadership and communication skills to work effectively with clients and teammates in an agile environment.</p><p><br></p><p>This is an excellent opportunity for you to start your software engineering career. Our corporate offices are in Duluth, Minnesota, on the shores of Lake Superior, one of the best places to live in this country.</p><p><br></p><p><strong>Skills, Requirements and Experience Considered</strong></p><ul><li>Matriculating in bachelor's degree or equivalent in Computer Science or related field</li><li>Familiarity with C# ASP.NET, Java or Python, or comparable software development toolset</li><li>Familiarity with web technologies such as HTML, CSS, JavaScript, AJAX, JSON, XML and jQuery Web services (SOAP and REST)</li><li>MVC design pattern</li></ul><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Develop quality software and web applications</li><li>Analyze and maintain existing software applications</li><li>Design highly scalable, testable code</li><li>Discover and fix programming bugs</li></ul>\n      "
    },
    {
        "position": "Cell Data Internship (Summer 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-09-03T18:36:19.522Z",
        "url": "https://www.linkedin.com/jobs/view/cell-data-internship-summer-2022-at-tesla-2701392016?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=6VtBJsKwIQuv6NFT98z6xA%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around January 2022 and continue through the entire Spring term (i.e. through April/May) or into early Summer 2022 if available. We ask for a minimum of 12 weeks, full-time, for most internships. Please consider before submitting an application. <br><br></em><em>International Students: If your work authorization is through CPT, please consult your school before applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing. <br><br></em>Internship Program at Tesla<br><br>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Location<br></strong><ul><li>Palo Alto, CA<br></li></ul><strong><u>Role Description<br><br></u></strong>The cell engineering team at Tesla is looking for a highly motivated intern to contribute to fundamental improvements our knowledge of how cells work. Tesla is a demanding and fast-paced environment where you will work with a world-class team on developing Tesla’s battery technology.<br><br>This role is focused on analysis and interpretation of battery test data. Your work may include designing battery tests, developing software to improve workflows, analyzing large datasets generated from our test labs, creating data visualizations, and analyzing performance of the vehicle fleet. The ideal candidate will combine strong knowledge of engineering fundamentals with software programming. Teamwork, analytical ability, organizational skills, and attention to detail are all highly valued skills. Individuals at every level carry a tremendous amount of responsibility and should look forward to learning an incredible amount on the job.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Analyzing cell degradation behavior to set appropriate firmware parameters</li><li>Designing tests and analyzing data to explore fundamental battery degradation modes</li><li>Exploring large datasets to evaluate, benchmark, and understand cell lifetime and degradation</li><li>Creating tools for rapid analysis of datasets and characterization techniques</li><li>Analyzing fleet data to understand battery usage and lifetime<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or PhD in chemical engineering, mechanical engineering, materials science, electrical engineering, computer science, or equivalent</li><li>Significant, demonstrated technical contributions towards past projects</li><li>Programming experience with Python (preferred), MATLAB, and/or JavaScript</li><li>Ability to work independently on multiple projects with complex requirements</li><li>Excellent communication skills, both verbal and written</li></ul>\n      "
    },
    {
        "position": "Computer Science Intern",
        "company": "Johnson Service Group, Inc. ",
        "location": {
            "city": " San Jose",
            "state": "CA"
        },
        "posted": "2021-07-05T18:36:23.423Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-at-johnson-service-group-inc-2682045826?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=h8GpaW3S3AjXMK3MlxVewA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Job Description<br><br></u></strong>JobID: 384004<br><br>Johnson Service Group is looking for a Computer Science Undergrad or Grad Student Intern. This is a long-term assignment, working part time during school and full-time during breaks. Will assist in the development and implementation of several computer applications designed to optimize workflow within an active engineering unit.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Will be involved in transitioning from a legacy data storage system to an updated relational system.</li><li>This internship will involve the acquisition of highly evolved training skills via an explanation of software utilization with technical and administrative staff.</li><li>The intern will gain considerable exposure to fundamentals of Engineering Project Management coupled with Relational Database Principles and fundamentals of computer programming necessary for Automation of Business Rules and Business Practices<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Relational Data Analysis skills, enabling the candidate to assist staff in standardizing the structure and naming conventions of computer folders and files.</li><li>Rudimentary understanding of computer programming languages such as Visual Basic, Python, etc.</li><li>Prior usage of database applications such as Microsoft Access to generate reports.</li><li>Experience with training others to use sophisticated software packages such as MATLAB, AutoCAD, etc.,</li><li>Comfortable dealing with complex concepts and can clearly explain these principles to technical and administrative staff members.</li><li>Currently enrolled as a continuing student in an accredited college or university and carrying at least 9 units per school term for an Undergrad or 6 units for a Grad student, or a recent college graduate.</li><li>The candidate should be working towards a mechanical engineering degree.</li></ul>\n      "
    },
    {
        "position": "Software Engineer Intern",
        "company": "MIM Software Inc. ",
        "location": {
            "city": " Beachwood",
            "state": "OH"
        },
        "posted": "2021-08-31T18:36:27.310Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-mim-software-inc-2703680262?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=xFqn989%2BMBuw4JpBZ%2F6sWg%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Summer 2022 College Internship<br><br>Developers at MIM Software work alongside industry experts and leading clinicians across the world. We solve complicated problems in innovative teams and gain a solid clinical perspective on medical imaging and the departments that use it while on-the-job. We’re looking for passionate interns with great communication skills who can excel in our flexible, highly team-centered work environment.<br><br>AREAS OF FOCUS<br><br>MIM - Our flagship software platform, based around a Java core, uses techniques such as image deformation, image segmentation, and statistical analysis to solve the problems faced by today’s medical professionals. If you’re interested in creating elegant software solutions to difficult, real-world problems at lightning speed, MIM is for you — no prior medical knowledge required.<br><br>MIMcloud - Medical images need to get from Point A to Point B. That’s where MIMcloud comes in. MIMcloud engineers apply web technologies like Google App Engine, GWT, Bootstrap, HTML, CSS, and JavaScript to break down the borders between institutions, doctors, and patients, all while maintaining security, privacy, and usability.<br><br>MIMsoftware.com - More than just marketing, our front-facing website is our primary method of customer engagement for support and training. Built on the Play! Framework and utilizing Java, Scala, and Twirl with a PostgreSQL backend, MIMsoftware.com is the virtual window into the world of MIM.<br><br>CORE - MIM Software moves too fast to settle for hiring consultants and purchasing ERP systems. Our business runs on CORE, our in-house system to manage our sales, support, product development, and regulatory-compliant testing. Running on MariaDB, Ruby on Rails, and great ideas from all over the company, CORE development is fast, flexible, and fun.<br><br>Web Clinical Data Solutions - Our next-gen suite of tools to unite clinical data for uses beyond image processing, such as analytics, peer review, and decision support. These tools are web deployed using the Play! Framework for Java, Scala Twirl templates, a PostgreSQL database, and Docker containers as the hosting environment, with a rich UI built using Bootstrap, React.js, and Typescript.<br><br>Algorithms Research - Medical image processing takes research and development. By working alongside the scientists on our Algorithms Research Team, software engineers on the team research new technologies, implement prototypes, and build tools and infrastructure for large-scale data analysis.<br><br><strong> What You'll Do <br></strong><ul><li>Develop complex algorithms for image analysis and business logic Improve user experience </li><li>Work within specifications to meet project objectives in a timely manner </li><li>Communicate with peers and customers </li><li>Work with project team members under an agile development process </li><li>Adhere to quality and design control procedures specific to the medical device market</li></ul>WHAT YOU'LL NEED:<br><ul><li>Pursuing a bachelor’s or master’s degree in one of the following majors: computer science, computer engineering, mathematics, biomedical engineering, electrical engineering, or physics </li><li>Required skills include general problem-solving, strong analytical thinking, and an aptitude for math and science</li><li>Experience with technologies we use preferred but not required</li></ul>TECHNOLOGIES WE USE<br><br>Ruby on Rails®<br><ul><li> MariaDB®</li><li> JavaScript</li><li> Java™</li><li> Google Web Toolkit™</li><li> Google App Engine™</li><li> MongoDB</li><li> Apple® iOS</li><li> OpenCL</li><li> Python™</li><li> Tensorflow</li><li> Docker</li><li> MATLAB</li><li> CUDA</li></ul>\n      "
    },
    {
        "position": "Computer Science Internship",
        "company": "MyTGroup ",
        "location": {
            "city": " Dallas",
            "state": "TX"
        },
        "posted": "2021-08-13T18:36:29.601Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-internship-at-mytgroup-2679652324?refId=ysgD1gqD%2BY%2BRAGmbZN4Ogw%3D%3D&trackingId=Cpi1sfTNUiATLOLvpJcdpg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Job DescriptionComputer Science Internship Routine configuration and support of network equipment such as switches, routers, firewalls, computers, voice over IP phones, security cameras or backup ISP appliances is also part of the work performed. Knowledge in network device configuration is a must. Must be able to set IP addresses on devices, update the firmware on virtually anything and much more. Research and development on several new software’s we are working on is a priority. Also supporting our clients when needed. Work with technicians, admins and developers to unify knowledge and direction of a new product.RequirementsExperienceMust be able configure an array of devices ranging across multiple manufactures for example Cisco, Avaya, Extreme, Ubiquiti.Help desk / RMM knowledge or past experience is a plus.We will teach most advanced skills but need interns that have the basics of networking down.<br><br>EducationThis is an internship for students about to graduate, in search of internship credits.Having completed college and still being in the last semester or two is an absolute requirement.Certifications in some of the listed areas above are a plusBenefitsReal life on the job training at a very functional information and technology companyLearn security systems, phone systems, and managing large deployments of devices here…We provide additional resources, training and tools of the industry to each intern.Work with technicians in the field deploying business tech every day.Flexible hours and daysWeekly $250 salary for 2-3 days of your timeRequirementsExperience Must be able configure an array of devices ranging across multiple manufactures for example Cisco, Avaya, Extreme, Ubiquiti. Help desk / RMM knowledge or past experience is a plus. We will teach most advanced skills but need interns that have the basics of networking down. Education This is an internship for students about to graduate, in search of internship credits. Having completed college and still being in the last semester or two is an absolute requirement. Certifications in some of the listed areas above are a plus\n      "
    },
    {
        "position": "Software - Firmware Engineering Internship (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-20T18:36:38.494Z",
        "url": "https://www.linkedin.com/jobs/view/software-firmware-engineering-internship-spring-2022-at-tesla-2682377463?refId=QDKKZtCqThd65jBaS9YOtg%3D%3D&trackingId=d002xY72ePRR15nLAib8yg%3D%3D&position=4&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around January or February 2022 and continue through the entire Spring term (i.e. through April/May) or into early Summer 2022 if available. We ask for a minimum of 12 weeks, <strong>full-time</strong>, for most internships. Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing.<br><br></em><strong>Internship Programs at Tesla<br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Palo Alto, CA<br></li></ul><strong><u>About The Team<br><br></u></strong>The Firmware Team is seeking a Firmware Integration Engineering Intern to develop software tools for vehicle diagnostics, testing and validation<br><br><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Firmware Build: Tesla’s continued success depends on engineers being able to develop, debug, and deploy software quickly. Our web services, tools, and build infrastructure directly impact over 1000 vehicle software engineers. As an intern you'll be joining a small team located at the center of the firmware organization. This unique position exposes you to a wide array of interesting technical challenges and enables us to be the defenders of best practices such as code hygiene, reuse, and maintainability. </li><li>Firmware Development: As a firmware developer intern in test on the body controls and thermal firmware team, you will be responsible for ensuring the accurate testing and coverage reporting of embedded code running on Tesla vehicle products. In addition, the role includes designing and maintaining embedded hardware and software test environments that simulate real world system interactions and report automated results on a regular basis. Come join a team of deeply knowledgeable engineers that strive to build the most robust and reliable embedded systems using cutting edge software development tools and practices. </li><li>Firmware Platform: Firmware Platform Interns will design, develop, and validate complete firmware platforms and development tools upon which all real-time firmware applications are built. You will be a major contributor to future hardware architecture analysis and decisions. Our team develops reusable shared firmware libraries to promote reuse and expedite robust, validated, firmware development. We consolidate expertise in real-time operating systems, drivers, communication protocols, and development tools/infrastructure. <br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Pursuing a Bachelor’s Degree or equivalent in Electrical/Computer Engineering, Mechanical Engineering, Computer Science or related field with evidence of exceptional ability </li><li>Strong skills in at least one of the following: Python, C/C++</li><li>Strong experience collaborating with colleagues and communicating complex technical concepts to others of varied technical background </li><li>Must be detail-oriented with an ability to think creatively and produce “outside of the box” solutions </li><li>Exceptional ability to keep multiple projects moving forward</li></ul>\n      "
    },
    {
        "position": "Data Scientist Intern",
        "company": "Bayer ",
        "location": {
            "city": " Champaign",
            "state": "IL"
        },
        "posted": "2021-09-02T18:36:40.639Z",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-intern-at-bayer-2703565476?refId=QDKKZtCqThd65jBaS9YOtg%3D%3D&trackingId=H1K%2Fa6RInt5r05X5aEU92w%3D%3D&position=5&pageNum=1&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>At Bayer we’re visionaries, driven to solve the world’s toughest challenges and striving for a world where ,Health for all, Hunger for none’ is no longer a dream, but a real possibility. We’re doing it with energy, curiosity and sheer dedication, always learning from unique perspectives of those around us, expanding our thinking, growing our capabilities and redefining ‘impossible’. There are so many reasons to join us. If you’re hungry to build a varied and meaningful career in a community of brilliant and diverse minds to make a real difference, there’s only one choice. <br><br></strong><strong> Data Scientist Intern <br><br></strong><strong><u>Your Tasks And Responsibilities<br><br></u></strong>The primary responsibilities of this role, Data Scientist Intern, are to:<br><ul><li> Build and validate predictive models incorporating key breeding data, soil, weather, and environmental data; </li><li> Demonstrate the application of the models and deploy them to stakeholders; </li><li> Contribute to positive team culture and work ethos based on Bayer LIFE values; </li><li> Support the Health, Safety, and Environment, Compliance, Business Conduct and Human Rights policies and culture. <br></li></ul><strong><u>Who You Are<br><br></u></strong>Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:<br><br>Required Qualifications:<br><ul><li> Currently enrolled at the University of Illinois-Champaign Urbana pursuing an advanced degree Master of Science/Ph.D. student in Computer Science, Statistics, Data Science, Mathematics, or Computational Biology; </li><li> Strong programming skills in R, Python, SQL, Java or Linux; </li><li> Problem solving ability and experience in analyzing and presenting complex data; </li><li> Organizational, interpersonal, and written communication skills; </li><li> Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts; </li><li> Ability to communicate complex ideas in a clear, precise and actionable manner; </li><li> Detail and results oriented with the ability to work independently; </li><li> Ability to actively engage with internal partners and external collaborators to align strategies and success measures in analytics; </li><li> Able to work 10-20 hours per week if interning during the semester; </li><li> Able to work 40 hours per week if interning during the summer; </li><li> Be registered and currently enrolled at the University of Illinois Urbana-Champaign. <br></li></ul>Preferred Qualifications:<br><ul><li> Willingness to extend own data science and statistical interests to agriculture and/or experience working with agricultural/biological scientific data; </li><li> Proficiency in Machine Learning and Statistics algorithms and concepts (Mixed Models, Random Forest, Deep Learning, SVM, etc.); </li><li> Experience with cloud computing such as Hadoop and Spark. <br></li></ul><strong> YOUR APPLICATION <br><br></strong>Bayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and want to impact our mission Science for a better life, we encourage you to apply now. Be part of something bigger. Be you. Be Bayer.<br><br>To all recruitment agencies: Bayer does not accept unsolicited third party resumes.<br><br>Bayer is an Equal Opportunity Employer/Disabled/Veterans<br><br>Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.<br><br><strong>Location:</strong> United States : Illinois : Champaign<br><br><strong>Division:</strong> Crop Science<br><br><strong>Reference Code:</strong> 469041<br><br><strong>Contact Us<br><br></strong><strong>Email:</strong> hrop_usa@bayer.com\n      "
    },
    {
        "position": "Software Engineering Intern - Fall 2021",
        "company": "OPSWAT ",
        "location": {
            "city": " Tampa",
            "state": "FL"
        },
        "posted": "2021-08-27T18:37:34.537Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-fall-2021-at-opswat-2697036913?refId=VLDdVtnCs92ibSr081hYaA%3D%3D&trackingId=yz2e1RY0ZVYO0QRr0RInxw%3D%3D&position=13&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Fall 2021 Software Engineering Internship<br><br></strong><strong><u>The Position<br><br></u></strong>We are looking for current Computer Science or Computer Engineering students to join one of our software development teams in Tampa, Florida for Fall 2021 internships. If you are a current student or a student taking a gap year due to COVID and are interested in designing and building unique security software that no one else is building, then this exciting opportunity is for you. As part of a larger team, you will be given project-oriented work helping develop professional cybersecurity solutions used to protect critical infrastructure around the world. You will get exposure to every stage of the software development lifecycle, planning, design, coding, testing, and deployment amongst other stages.<br><br><strong><u>What You Will Be Doing<br></u></strong><ul><li>Project oriented hands on coding assignments and professional development activities.</li><li>Using latest cloud technology stacks.</li><li>Contributing to the documentation of the solutions you work on.</li><li>Contributing to the manual/automated load-testing, unit-testing of the solutions to elevate test driven development.</li><li>Starting your career as a software engineer under the mentorship of experienced team members.<br></li></ul><strong><u>What We Need From You<br></u></strong><ul><li>A passion for Cyber security and learning.</li><li>Progress toward a Bachelor's Degree or higher in Computer Science, or a related major.</li><li>Examples of extracurricular programing projects (e.g. on Github).</li><li>Strong collaboration and communication skills.<br></li></ul><strong><u>About OPSWAT<br><br></u></strong>OPSWAT is a global leader in critical infrastructure cybersecurity that helps protect the world's mission-critical organizations from malware and zero-day attacks. To minimize the risk of compromise, OPSWAT Critical Infrastructure Protection (CIP) solutions enable both public and private organizations to implement processes that ensure the secure transfer of files and devices to and from critical networks. In total, 98% of U.S. nuclear power facilities and more than 1,000 organizations worldwide spanning Financial Services, Defense, Manufacturing, Energy, Aerospace, Transportation Systems trust OPSWAT to secure their files and devices; ensure compliance with industry and government-driven policies and regulations, and to protect their reputations, finances, employees, and relationships from cyber-driven disruption. For more information, visit www.opswat.com.<br><br>To apply for this position, please send your resume and cover letter to us via JobScore. Special consideration will be given to those candidates whose cover letter indicates that they have viewed our website. Please, no drop-ins, calls, or faxes.<br><br>OPSWAT is an equal opportunity employer. We celebrate diversity and are committed to providing an environment where equal employment opportunities are extended to all employees and applicants, free of discrimination and harassment of any type. All employment decisions are based on individual qualifications, job requirements, and business needs without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other category protected by federal, state, or local laws.\n      "
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Lockheed Martin ",
        "location": {
            "city": " Orlando",
            "state": "FL"
        },
        "posted": "2021-08-04T18:37:51.499Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-lockheed-martin-2675434206?refId=VLDdVtnCs92ibSr081hYaA%3D%3D&trackingId=6udQbgx7RHhl0ZaNE2jk9Q%3D%3D&position=23&pageNum=2&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Description:</strong>Define and develop. Code and test. Integrate and sustain. Whatever it is you like most about the software life cycle, we are working on it every day. We are seeking talented software engineer interns to join our team to help develop many best-in-class products and solutions in at our Missiles and Fire Control Business Area in Orlando, FL. Click here to learn more about MFC.<br><ul><li> As a Software Engineering Intern at Lockheed Martin, you will join one of the largest networks of software professionals, implementing cutting edge technologies on both existing and new development products.</li><li> You will be helping us solve the world’s most difficult challenges, developing industry leading technology and products in the areas such as: EO/IR Targeting and Surveillance Systems, Advanced Threat Warning Systems, Combat and Defense Missile development.</li><li> You will be involved in all phases of the Software Development Life Cycle; design, code, test, integration, verification and field integration support, facilitated by an Agile software development work flow.</li><li> You will have the opportunity to utilize your skills in many different technical areas including: object oriented software development, real-time embedded development for multi-core and multi-processor systems, development for multiple operating systems (VxWorks, Linux, Windows). As well as defensive cyber security/product protections, image/signal processing, image/inertial tracking, servo/mechanism controls, machine learning, image/data fusion, mission planning &amp; field maintenance application development, and other GUI development to support test and verification.<br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li> Currently enrolled in an accredited degree program pursing a Bachelors or Masters degree in Computer Engineering, Software Engineering, Computer Science, Math, or related major.</li><li> Software development experience in C/C++</li><li> Ability to obtain DoD Secret Clearance<br></li></ul><strong><u>Desired Skills<br></u></strong><ul><li> Familiarity and understanding of differences between relevant C++ standards (ie. C++98; C++11; C++17, etc)</li><li> Excellent written and verbal communication skills.</li><li> Experience with Software integration and debugging techniques. Experience with Object Oriented design and associated documentation.</li><li> Detailed understanding of Operating System concepts/features/differences (Linux, VxWorks, Windows). Experience with Software Continuous Integration (CI) toolchains/pipelines (configuration management, automated unit testing, static analysis, etc). Experience with GUI development utilizing C++/Qt framework or C#<br></li></ul><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br><br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern\n      "
    },
    {
        "position": "Software Engineering Intern (Fall 2021)",
        "company": "Cambly Inc. ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-08-06T18:38:02.016Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-fall-2021-at-cambly-inc-2707703270?refId=0teOdyjXLrjY6%2FsurQk8Zw%3D%3D&trackingId=KmE3Fo9Vw03sLHvyq8n%2FTw%3D%3D&position=4&pageNum=3&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        We're looking for aspiring software engineers who are passionate about changing the way people learn languages. As a Cambly engineering intern, you'll be part of a small and fast-moving engineering team where you'll have a large impact on all parts of the Cambly platform. We've been growing rapidly among language learners around the world, so you'll get to learn what it's like to join a fast growing startup that's creating opportunities for our students and tutors alike.<br><ul><li>This is a full-time internship (30+ hours/week) working alongside our SF-based engineering team.</li><li>This posting is for the Fall 2021 internship. If you would like to apply for Spring 2022, please use that posting!<br><br></li></ul><strong> Requirements <br></strong><ul><li>A product-minded approach to engineering. You should be excited about working directly with our students and tutors to make sure they have an amazing experience.</li><li>Experience writing software in Java, Python, Swift, Objective C, or react.js either in school, side projects, or professionally.</li><li>A passion for learning. You fearlessly dive into new and unfamiliar technologies.</li><li>A global perspective. You should be excited about building an app in 10+ languages that integrates with the social networks and payment methods used by our students.</li><li>Currently enrolled in a Computer Science degree program with at least 3 years of study completed.</li><li>Able to work 30+ hours/week alongside our SF-based engineering team.</li></ul>On a small and nimble team, every engineer should be able to learn new technologies quickly and jump in anywhere in our stack. You should have experience using or be excited about learning all the parts of Cambly: iOS, Android, React, JS, Python, Mongo\n      "
    },
    {
        "position": "Software Engineer Internship - C++",
        "company": "TuSimple ",
        "location": {
            "city": " Austin",
            "state": "TX"
        },
        "posted": "2021-09-01T18:39:13.281Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-c%2B%2B-at-tusimple-2705321282?refId=n4BwVxFpOsTLGyj%2FJvuxQw%3D%3D&trackingId=dLgZSYBRsu5plV%2BVbjGS1g%3D%3D&position=23&pageNum=4&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a C++ Software Engineering Intern at TuSimple, you will have the opportunity to work on accelerating the development of our driverless autonomous vehicle systems. Join our rapidly growing team of expert engineers and help us architect and bring to life best-in-class Distributed Systems, Machine Learning (ML) Platforms, and Data Pipelines.<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Design, develop, test, debug, and deploy software modules in Autonomous Driving System, and/or in related platform and tools software.</li><li>Collaborate with other team members.<br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a MS/PhD program in Computer Science or other related fields.</li><li>3+ years of experience developing production-quality software in C++ or Python in Autonomous Driving, Robotics, Internet, Telecommunication, and other technology industries.</li><li>Solid understanding of operating systems and embedded systems.</li><li>Solid understanding of object-oriented programming.</li><li>Solid understanding of data structure and basic algorithms.</li><li>Solid understanding of performance profiling, analysis, and optimization.</li><li>Good debugging and root cause analysis skills.</li><li>Good understanding and experience of Python programming.</li><li>Good communication skills and team collaboration.<br></li></ul><strong><u>Preferred Skills &amp; Experience<br></u></strong><ul><li>Good understanding and experience in Computer Vision, Image Processing, Deep Learning, or other Algorithms.</li><li>Development experience in RTOS and Linux kernel.</li><li>Development experience in ROS.</li><li>Development experience on ARM platforms.</li><li>Good understanding and use of Docker.<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em><strong>For immediate consideration, please email your resume to:<br><br>ec___software_engineer_internship___c___d1f618ac2us@ivy.greenhouse.io<br><br></strong></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Software - Embedded Systems Engineering Internship (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-08-20T18:39:41.315Z",
        "url": "https://www.linkedin.com/jobs/view/software-embedded-systems-engineering-internship-spring-2022-at-tesla-2683516301?refId=l7kMMtfHYgT1SMbi%2FxL7eg%3D%3D&trackingId=wOkrgvBreJmwqQInaNDefg%3D%3D&position=15&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around January or February 2022 and continue through the entire Spring term (i.e. through April/May) or into early Summer 2022 if available. We ask for a minimum of 12 weeks, <strong>full-time</strong>, for most internships. Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing.<br><br></em><strong>Internship Programs at Tesla<br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year-round program places the best students in positions where they will grow both technically and personally through their experience working closely with their manager, mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by giving them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA</li><li>Palo Alto, CA</li><li>Remote<br></li></ul><strong><u>About The Team<br><br></u></strong>Tesla is seeking talented embedded software engineering students who thrive in a fast-paced environment and want to apply CS concepts to real world projects. Interns are expected to be strong in C and have some experience with scripting languages. Your work will have a critical impact on Tesla products, including our fleet and energy storage solutions.<br><br><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Embedded Systems: As an Embedded Engineering intern, you will be responsible for delivering high quality embedded code running on the processors at the heart of Tesla powertrains, vehicles and energy storage systems. Come join a team of deeply knowledgeable engineers that strive to build the most robust and reliable embedded systems using cutting edge software development tools and practices. You will solve some of the most ambiguous and challenging problems in the embedded software space and change the way the world produces electric vehicles and delivers energy! </li><li>Gateway Engineering: The Gateway team is seeking a Software Engineering Intern to help design frameworks and infrastructure to test the current and next generation of Tesla products. The Gateway team supports a core component in the vehicle that provides over the air updates amongst other things.<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Software Engineering, Computer Engineering, Electrical Engineering or Computer Science</li><li>Experience in embedded development in robotics, real-time controls, or system software</li><li>Proficiency in C; familiarity with MISRA C a plus</li><li>Experience scripting in Python, SQL, MATLAB</li><li>Fluent in software fundamentals including software design and maintainability</li><li>Experience with the embedded microprocessor tools </li><li>Controls software and algorithm development </li><li>Test driven development and familiarity with developer driven automated testing </li><li>Ability to collaborate and communicate complex technical concepts </li><li>Understanding of physics and basic principles is highly preferred </li><li>Experience with TI DSPs or NXP microcontrollers a plus</li></ul>\n      "
    },
    {
        "position": "Software Engineer Internship - General",
        "company": "TuSimple ",
        "location": {
            "city": " Philadelphia",
            "state": "PA"
        },
        "posted": "2021-09-01T18:39:48.665Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-general-at-tusimple-2705316647?refId=l7kMMtfHYgT1SMbi%2FxL7eg%3D%3D&trackingId=N1iDUtNWtOblUgVcT22lUQ%3D%3D&position=19&pageNum=5&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a General Software Engineering Intern at TuSimple, you will have the opportunity to work on various backend projects. You will be developing and maintaining modules such as vehicle systems, embedded systems, simulation systems, and map. Your work ensures our algorithm scientists' research can be successfully transformed into virtual driver software, and then easily deployed on the truck. You will also collaborate with engineers from different teams to optimize the backend systems to make sure they are efficient, robust and scalable.<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Design, develop, test, debug, and deploy software modules in autonomous driving systems, and/or in related platform and tools software.</li><li>Responsible for integrating multiple modules and systems into one platform</li><li>Developing and maintaining key integrating tools and monitoring performance <br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a MS//PhD program in Computer Science or related fields</li><li>Strong background in developing production-quality software in C/C++ in Autonomous Driving, Robotics, Internet, Telecommunication, and other technology industries</li><li>Proficiency in writing modern C++ (11 or above)</li><li>Solid knowledge of operating system, distributed system, and networking<br></li></ul><strong><u>Preferred Skills &amp; Experience<br></u></strong><ul><li>Have experiences/courses in Autonomous Driving and/or Robotics</li><li>Familiar with Linux environment and multi-threaded/multi-process programming</li><li>Attended programming contests such as OI and ACM</li><li>Development experiences in robotics middleware such as ROS</li><li>Hands-on experiences in performance profiling, analysis, and optimization</li><li>Knowledge of computer vision and/or machine learning<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em>For immediate consideration email your resume to:<br><br></em><em>ec__software_engineering_internship___general_3d5b01b62us@ivy.greenhouse.io<br><br></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Software Engineer Intern (Summer 2022 – Austin)",
        "company": "Optiver ",
        "location": {
            "city": " Austin",
            "state": "TX"
        },
        "posted": "2021-08-27T18:40:24.737Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-summer-2022-%E2%80%93-austin-at-optiver-2666318374?refId=0JXWNOwSWo23xBw6mYFFVg%3D%3D&trackingId=jXl2U9RMxAoFWmLg4FCCcw%3D%3D&position=16&pageNum=6&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        It’s called an internship. But that doesn’t quite do it justice. Our software engineering interns build and release software just like our full-time engineers. After a two-week training program covering the fundamentals of our trading systems and engineering principles, you’ll join a team of senior engineers tasked with finding elegant solutions to complex problems. You won’t just have a chance to contribute, you’ll be expected to. After all, the best way to learn is to do.<br><br><strong><u>Technology At Optiver<br><br></u></strong>As an engineer, you are a maker at heart. And at Optiver you will have the opportunity to take ownership of complex problems and craft solutions—to make stuff—from day one. Every day will bring fresh challenges that demand even fresher thinking. And the proprietary trading systems you build will directly impact financial markets that—either directly or indirectly—touch the lives of millions of people.<br><br><strong><u>What You’ll Need<br></u></strong><ul><li>Working towards a BS or MS in Computer Science, or related technical field</li><li>Junior standing</li><li>Knowledge of algorithms, data structures, concurrency, and systems programming concepts</li><li>Experience coding in C++, C#, C, or Java</li><li>Ability to communicate and collaborate with developers, traders, and business operations on a daily basis</li><li>Excitement to learn options trading and apply this knowledge toward well-crafted solutions </li><li>Legal authorization to work in the U.S. is required; we will not sponsor individuals for employment authorization for this job opening<br></li></ul><strong><u>Who We Are<br><br></u></strong>Optiver is a proprietary trading firm and leading global market maker. As one of the oldest market making institutions, we are a trusted partner of 50+ exchanges across the globe. Our mission is to constantly improve the market by injecting liquidity, providing accurate pricing, increasing transparency and acting as a stabilizing force no matter the market conditions. With a focus on continuous improvement, we participate in the safeguarding of healthy and efficient markets for everyone who participates.<br><ul><li>We accept one application per role per year. If you have previously applied to the Software Engineer Intern position during this season and have been unsuccessful, you can reapply once the next recruitment season begins in 2022.</li></ul>\n      "
    },
    {
        "position": "Software Engineer Internship - General",
        "company": "TuSimple ",
        "location": {
            "city": " West Lafayette",
            "state": "IN"
        },
        "posted": "2021-09-01T18:40:32.084Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-general-at-tusimple-2705321241?refId=0JXWNOwSWo23xBw6mYFFVg%3D%3D&trackingId=2DT0aNDyQNm1GdHAk5T9iw%3D%3D&position=20&pageNum=6&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a General Software Engineering Intern at TuSimple, you will have the opportunity to work on various backend projects. You will be developing and maintaining modules such as vehicle systems, embedded systems, simulation systems, and map. Your work ensures our algorithm scientists' research can be successfully transformed into virtual driver software, and then easily deployed on the truck. You will also collaborate with engineers from different teams to optimize the backend systems to make sure they are efficient, robust and scalable.<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Design, develop, test, debug, and deploy software modules in autonomous driving systems, and/or in related platform and tools software.</li><li>Responsible for integrating multiple modules and systems into one platform</li><li>Developing and maintaining key integrating tools and monitoring performance <br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a MS//PhD program in Computer Science or related fields</li><li>Strong background in developing production-quality software in C/C++ in Autonomous Driving, Robotics, Internet, Telecommunication, and other technology industries</li><li>Proficiency in writing modern C++ (11 or above)</li><li>Solid knowledge of operating system, distributed system, and networking<br></li></ul><strong><u>Preferred Skills &amp; Experience<br></u></strong><ul><li>Have experiences/courses in Autonomous Driving and/or Robotics</li><li>Familiar with Linux environment and multi-threaded/multi-process programming</li><li>Attended programming contests such as OI and ACM</li><li>Development experiences in robotics middleware such as ROS</li><li>Hands-on experiences in performance profiling, analysis, and optimization</li><li>Knowledge of computer vision and/or machine learning<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em>For immediate consideration email your resume to:<br><br></em><em>ec__software_engineering_internship___general_3d5b01b62us@ivy.greenhouse.io<br><br></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Software Engineering Intern",
        "company": "Samsara ",
        "location": {
            "city": " Atlanta",
            "state": "GA"
        },
        "posted": "2021-08-27T18:40:59.804Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-samsara-2668879027?refId=qmjKzqa5w09wBSDjOi9JXA%3D%3D&trackingId=1DC0S7lMwWnaDCPHtiCmOg%3D%3D&position=12&pageNum=7&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Who We Are<br><br></u></strong>Samsara is the pioneer of the Connected Operations Cloud, which allows businesses that depend on physical operations to harness IoT (Internet of Things) data to develop actionable business insights and improve their operations. Samsara operates in North America and Europe and serves more than 20,000 customers across a wide range of industries including transportation, wholesale and retail trade, construction, field services, logistics, utilities and energy, government, healthcare and education, manufacturing and food and beverage.<br><br>Our team has raised $930M from Andreessen Horowitz, General Catalyst, Tiger Global, Dragoneer, AllianceBernstein Holding LP, Franklin Templeton, General Atlantic, Sands Capital Management and Warburg Pincus LLC.<br><br><strong><u>About The Role<br><br></u></strong>We are looking for talented engineers to join our backend infrastructure and full-stack teams! These Summer 2022 roles will be based in our San Francisco and Atlanta offices.<br><br><strong>Backend infrastructure</strong> engineers design and develop the infrastructure that powers Samsara’s IoT platform. You will work on scaling our data ingestion and storage systems to support more and more connected devices, and work with engineers throughout the company to make new types of data analysis possible.<br><br><strong>Full-stack engineers</strong> design and develop features across a broad surface area with tangible impact on active and future customers. The features you build will provide actionable insights for our customers' operations. The engineering challenges you will tackle may include architecting data structures for mass data collection or presenting data analytics in intuitive and performant ways on web and mobile<br><br>We use Golang for our firmware and backend, Typescript and React for our web client, GraphQL to fetch data from our backend, and React Native for our mobile app. Direct experience with these technologies is not required.<br><br><strong>An ideal candidate would:<br></strong><ul><li> Complete a Bachelor’s or Master’s degree in Computer Science or a related technical field between Fall/Winter 2022 - Summer 2023 </li><li> Have built or worked on production applications </li><li> Enjoy understanding our users and what would make their day to day processes easier to manage </li><li> Love shipping features that are immediately used by our customers </li><li> Seek to iterate on new products based on customer feedback </li><li> Be available for 10-13 weeks in San Francisco or Atlanta starting in May/ June <br></li></ul>At Samsara, we welcome all. All sizes, colors, cultures, sexes, beliefs, religions, ages, people. We depend on the unique approaches of our team members to help us solve complex problems. We are committed to increasing diversity across our team and ensuring that Samsara is a place where people from all backgrounds can make an impact.<br><br><strong><u>Benefits<br><br></u></strong>Working at Samsara has its perks: for all full-time global employees, we provide private medical and dental insurance plus growth and development opportunities, as well as regular virtual team and company events. In the US we offer flexible vacation time, EMEA employees receive 25 vacation days plus national bank holidays. Post-COVID we’ll be back in our global offices with numerous in-office perks.<br><br><strong>Accommodations<br><br></strong>Samsara is an inclusive work environment, and we are committed to ensuring equal opportunity in employment for qualified persons with disabilities. Please let us know if you require any reasonable accommodations for your interview (e.g., sign language interpreters, reading assistance, facility access, device or equipment modification, etc.)<br><br><strong>Regarding COVID-19<br><br></strong>Samsara's offices are beginning to reopen for voluntary return. Reopening timelines will be communicated by region based on region-specific guidelines. Phase 3 ('New Normal') will begin no earlier than January 2022. Our primary concern is for the health and well-being of our employees as well as candidates. We have transitioned all interviews and onboarding to be conducted virtually via Zoom video conferencing. Employees are able to work from countries and states where Samsara is a registered entity through December 2021. All employees are expected to return to our offices when they reopen with the exception of field-based and fully remote roles.\n      "
    },
    {
        "position": "Electrical Test Engineering Internship (Spring 2022)",
        "company": "Tesla ",
        "location": {
            "city": " Fremont",
            "state": "CA"
        },
        "posted": "2021-08-27T18:41:51.309Z",
        "url": "https://www.linkedin.com/jobs/view/electrical-test-engineering-internship-spring-2022-at-tesla-2693794456?refId=gOvtltvjagV3ug0qlLnQtA%3D%3D&trackingId=D9X0t%2Bf9KKc9D%2BXVeKQpsg%3D%3D&position=19&pageNum=8&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>Disclaimer: This position is expected to start around January or February 2022 and continue through the entire Spring term (i.e. through April/May) or into Summer 2022 if available. We ask for a minimum of 12 weeks, <strong>full-time</strong>, for most internships. Please consider before applying.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla<br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA</li><li>Palo Alto, CA</li><li>other locations around the San Francisco Bay area<br></li></ul><strong><u>About The Team<br><br></u></strong>We are a diverse, enthusiastic, and growing team of multi-disciplined engineers that further Tesla's mission of accelerating the world's transition to sustainable energy by demonstrating the functionality, performance, and durability of new hardware designs.  As a test engineering intern, you will learn how to leverage hardware, firmware, and software solutions to validate Tesla products to rigorous internal and industry standards. We are interested in diverse candidates with all levels of experience, but we will prioritize curious and driven engineers with strong problem solving, communication, and collaboration skills.<br><br><strong><u>What To Expect<br><br></u></strong>Qualified applicants may be reviewed by one or more of the following teams:<br><ul><li>Low Voltage Component Validation</li><li>High Voltage Component Validation</li><li>Advanced Driver-Assistance Systems (ADAS) Test Engineering</li><li>Capability Development</li><li>Design for Reliability</li><li>Firmware Testing</li><li>Power Electronics Manufacturing Test Engineering<br></li></ul><strong><u>Responsibilities May Include<br></u></strong><ul><li>Design and build custom test equipment such as test PCBAs, harnesses, and overall system design to make validation efficient, modular, and repeatable.</li><li>Manage projects from initial concept through design, assembly, and final commissioning.</li><li>Write and maintain test software to automate test execution, data collection and analysis.</li><li>Develop and maintain validation schedules to coordinate test resources and communicate status to program managers <br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li>Currently working towards a BS, MS, or advanced degree in Electrical Engineering, Mechatronics, Computer Science, or other relevant degrees.</li><li>Proven technical experience through extracurricular activities, academic projects, passion projects, or equivalent experiences.</li><li>Excellent grasp of engineering fundamentals with experience using power supplies, multimeters, oscilloscopes, probing PCBAs, and reading schematics. </li><li>Eagerness to collaborate cross-functionally with other engineering teams while able to work independently to drive large projects forward and overcome blockers; detail-oriented and execution focused. </li><li>Genuine curiosity to figure out why something doesn't work; troubleshooting the root-cause of an issue comes second nature to you.</li><li>Love to be hands-on, understand how to interact with a system and automate repeatable tasks. You thrive on efficiency and hate to see someone waste time on something a script, fixture, or robotic system could do automatically.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Coding experience, preferably Python, for test automation and data post-processing. </li><li>Design experience with CAD software such as CATIA, SOLIDWORKS, Altium, or Eagle.</li><li>Knowledge of different sensors, what they do, and how to interact with them.</li><li>Proven interest in electric vehicles and/or sustainable energy, through extracurricular activities, academic projects, passion projects, or equivalent experiences.</li></ul>\n      "
    },
    {
        "position": "Software Engineer Internship - Full Stack",
        "company": "TuSimple ",
        "location": {
            "city": " Dallas",
            "state": "TX"
        },
        "posted": "2021-09-01T18:42:00.088Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-full-stack-at-tusimple-2705320371?refId=gOvtltvjagV3ug0qlLnQtA%3D%3D&trackingId=eodcB6pY5lo2X7Yn1bKMYw%3D%3D&position=24&pageNum=8&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a Full Stack engineer at TuSimple, you will work on both the back-end infrastructure and front-end Web UIs of various projects, from our offboard infrastructure services to the onboard system, to bring automation and visualization to the company. Your work will greatly improve the efficiency of the research of our algorithm scientists, and expedite the development of engineering infrastructure projects.<br><br>Example projects we are working on include:<br><ul><li>Building pipeline scheduling and execution platform, as well as the corresponding frontend to manage and interact with the platform, to do analysis of our simulations and datasets;</li><li>Developing on-premises cluster projects as well as utilizing public cloud computing infrastructure services;</li><li>Building front-end Web Interface for engineers and testops to control and monitor the onboard system, that visualize in real time, the perceived surroundings and decided routes of our autonomous driving system;</li><li>Building web-based tools to optimize the labelling of our datasets to greatly increase the efficiency and correctness; <br></li></ul><strong><u>Role Responsibilities<br></u></strong><ul><li>Discover and optimize performance bottlenecks in existing backend systems, such as database queries, storage solutions, to increase the responsiveness of user queries;</li><li>Architect, implement and maintain performant and scalable data processing backend systems that can handle tremendous amount of data generated daily;</li><li>Work with various teams globally, such as prediction, simulation and onboard runtime, to build web-based tools to facilitate their development lifecycle;</li><li>Work with SRE team to identify issues to increase the stability and performance of our private computing service<br></li></ul><strong>Experience &amp; Skills Required:<br></strong><ul><li>Enrolled in a MS/PhD program in Computer Science or related majors, or BS program with relevant internship experience </li><li>Experience with Python or C++ development</li><li>Experience with modern standard of Javascript development, with frameworks such as Node.js/npm, Vue.js, react.js, etc </li><li>Passionate about discovering drawbacks of existing systems and working with users to improve the experiences<br></li></ul><strong>Preferred Skills and Experience:<br></strong><ul><li>Experience with 3D Graphics (WebGL, OpenGL, three.js)</li><li>Experience with web frameworks such as Flask, Django</li><li>Experience with cloud services, such as AWS</li><li>Good understanding of containers, build systems, and infrastructure automation<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em><strong>For immediate consideration, please send your resume to: <br><br></strong>ec__software_engineer_internship___full_stack_4bb598ed2us@ivy.greenhouse.io<br><br></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Data Scientist Quantitative Genetics Biology Intern",
        "company": "Bayer ",
        "location": {
            "city": " Champaign",
            "state": "IL"
        },
        "posted": "2021-09-02T18:42:35.468Z",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-quantitative-genetics-biology-intern-at-bayer-2703565479?refId=2%2BTLl14EHbR8SJRLDRs8VA%3D%3D&trackingId=4ALn%2FS1WKkeuBme2OBzWqw%3D%3D&position=21&pageNum=9&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>At Bayer we’re visionaries, driven to solve the world’s toughest challenges and striving for a world where ,Health for all, Hunger for none’ is no longer a dream, but a real possibility. We’re doing it with energy, curiosity and sheer dedication, always learning from unique perspectives of those around us, expanding our thinking, growing our capabilities and redefining ‘impossible’. There are so many reasons to join us. If you’re hungry to build a varied and meaningful career in a community of brilliant and diverse minds to make a real difference, there’s only one choice. <br><br></strong><strong> Data Scientist Quantitative Genetics Biology Intern <br><br></strong><strong><u>Your Tasks And Responsibilities<br><br></u></strong>The primary responsibilities of this role, Data Scientist Quantitative Genetics Biology Intern, are to:<br><ul><li> Build and validate predictive models incorporating key breeding data, soil, weather, and environmental data; </li><li> Demonstrate the application of the models and deploy them to stakeholders; </li><li> Contribute to positive team culture and work ethos based on Bayer LIFE values; </li><li> Support the Health, Safety, and Environment, Compliance, Business Conduct, and Human Rights policies and culture. <br></li></ul><strong><u>Who You Are<br><br></u></strong>Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:<br><br>Required Qualifications:<br><ul><li> Currently enrolled at the University of Illinois-Champaign Urbana pursuing an advanced degree Master of Science or Ph.D. student in Computational Biology, Genetics, Bioinformatics or similar field with focus in Computer Science, Statistics, Data Science, Mathematics or similar field; </li><li> Strong programming skills in R, Python, SQL, Java or Linux; </li><li> Data-driven methods for target identification and biomarker discovery; </li><li> Problem solving ability and experience in analyzing and presenting complex data; </li><li> Utilizing public datasets on bulk and single-cell RNA-seq for target and biomarker discovery; </li><li> Implementing computational tools for variant impact prediction; </li><li> Using bioinformatics techniques for mutation assessment and target prioritization; </li><li> Organizational, interpersonal, and written communication skills; </li><li> Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts; </li><li> Ability to communicate complex ideas in a clear, precise and actionable manner; </li><li> Detail and results oriented with the ability to work independently; </li><li> Ability to actively engage with internal partners and external collaborators to align strategies and success measures in analytics; </li><li> Able to work 10-20 hours per week if interning during the semester; </li><li> Able to work 40 hours per week if interning during the summer. <br></li></ul>Preferred Qualifications:<br><ul><li> Experience with cloud computing such as Hadoop and Spark; </li><li> Performing machine-learning/deep-learning with focus on multi-omics data integration. <br></li></ul><strong> YOUR APPLICATION <br><br></strong>Bayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and want to impact our mission Science for a better life, we encourage you to apply now. Be part of something bigger. Be you. Be Bayer.<br><br>To all recruitment agencies: Bayer does not accept unsolicited third party resumes.<br><br>Bayer is an Equal Opportunity Employer/Disabled/Veterans<br><br>Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.<br><br><strong>Location:</strong> United States : Illinois : Champaign<br><br><strong>Division:</strong> Crop Science<br><br><strong>Reference Code:</strong> 469061<br><br><strong>Contact Us<br><br></strong><strong>Email:</strong> hrop_usa@bayer.com\n      "
    },
    {
        "position": "IT Summer College Intern - Data Science (FPL Solutions)",
        "company": "Florida Power & Light Company ",
        "location": {
            "city": " Juno Beach",
            "state": "FL"
        },
        "posted": "2021-08-30T18:43:09.310Z",
        "url": "https://www.linkedin.com/jobs/view/it-summer-college-intern-data-science-fpl-solutions-at-florida-power-light-company-2698718933?refId=%2BagD3gihMh%2F3i%2FXFzWnjiQ%3D%3D&trackingId=GuIa%2B215dq8%2BukdTgi7Vmg%3D%3D&position=17&pageNum=10&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Requisition ID:</strong> 56248<br><br>Our reliability is one of the best in the nation, and we’re working to make it even better. We live here too. That’s why we’re committed to making Florida a better place. Join our team today <u> Learn more <br><br></u><strong><u>Position Specific Description<br><br></u></strong>Responsible for working with the customer service data science team in helping collect, analyze and visualize large amounts of data as well as helping the data scientists in selecting the right datasets for each business case. You will also be responsible for coding and testing several machine learning approaches. You will provide technical help to work teams in the design and evaluation of machine learning models. Maintains and/or enhances existing or new systems and creates documentation that is reliable and efficient.<br><br>Required Qualifications: High School Graduate/ College or University student working toward bachelor's degree in: Computer Science, Information Technology, Engineering or Mathematics<br><br>Preferred Qualifications: Analytical Problem Solving, Big Data structures, Machine learning algorithms, Report Development, Good Listening Skills, Team Player, Effective Written Communications, Effective Verbal Communications, Analysis, Strategic Planning, SQL, Familiarity with Microsoft Office Suite (especially excel), Database Structure, Web Technologies, Information Coding Standards, Programming using any or all of the following: C#, C++, Python, Scala, shell scripting. Must have completed course work in database design/ structure, machine learning and be passionate about state of the art data visualization, artificial intelligence and machine learning algorithms.<br><br>Qualifications that are a Plus: Knowledge of Agile Methodologies, hands on experience with AWS cloud data services, Machine learning work course, Data Modeling, Microsoft Business Intelligence Suite of products.<br><br><strong><u>Job Overview<br><br></u></strong>To be considered for an internship, you must be actively enrolled at a college or university as a full-time student seeking a bachelor’s degree or higher. You must also have a current cumulative GPA of 3.00 or higher (on a 0.00 to 4.00 scale).<br><br><strong><u>Job Duties &amp; Responsibilities<br></u></strong><ul><li> Assists department with assigned projects </li><li> Completes challenging projects and assignments </li><li> Presents final project to senior leadership at the end of the internship </li><li> Assumes responsibility for own travel, lodging, and transportation necessary to be available for the program </li><li> Performs other job-related duties as assigned <br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li> High school grad / GED </li><li> Maintain active enrollment in a Bachelor or higher degree program </li><li> Maintain cumulative GPA of 3.0 or higher <br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> None <br></li></ul><strong>Employee Group:</strong> Non Exempt<br><br><strong>Employee Type:</strong> Intern<br><br><strong>Job Category:</strong> Intern<br><br><strong>Organization:</strong> Florida Power &amp; Light Company<br><br><strong>Location:</strong> Juno Beach, Florida<br><br><strong>Other Work Locations: </strong>Florida<br><br><strong>Relocation Provided:</strong> No<br><br>NextEra Energy is an Equal Opportunity Employer. Qualified applicants are considered for employment without regard to race, color, age, national origin, religion, marital status, sex, sexual orientation, gender identity, gender expression, genetics, disability, protected veteran status or any other basis prohibited by law. We are committed to a diverse and inclusive workplace.<br><br>If you require special support or accommodation while seeking employment with NextEra Energy, please send an e-mail to <u> recruiting-coordinator.sharedmailbox@nexteraenergy.com </u> , providing your name, telephone number and the best time for us to reach you. Alternatively, you may call 1-844-694-4748. Please do not use this line to inquire about your application status.<br><br>NextEra Energy will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.<br><br>NextEra Energy <strong>does not</strong> accept any unsolicited resumes or referrals from <strong>any third-party recruiting firms or agencies</strong>. Please see our <u> policy </u> for more information.\n      "
    },
    {
        "position": "Deutsche Bank Analyst Internship Programme – Technology, Data and Innovation - New York – 2022",
        "company": "Deutsche Bank ",
        "location": {
            "city": " Buffalo-Niagara Falls Area",
            "state": "United States"
        },
        "posted": "2021-09-03T18:43:27.292Z",
        "url": "https://www.linkedin.com/jobs/view/deutsche-bank-analyst-internship-programme-%E2%80%93-technology-data-and-innovation-new-york-%E2%80%93-2022-at-deutsche-bank-2678133744?refId=p%2Belavd1hoWBx%2BJoORyM9g%3D%3D&trackingId=NSQdFP5vPzfZGrlIe%2Ff6NQ%3D%3D&position=3&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <ul><li>About Deutsche Bank:<br></li></ul><strong><u>The Deutsche Bank TDI Intern Programme<br><br></u></strong>At Deutsche Bank, we’re designing the digital bank of the future and we’re looking for creative thinkers and curious minds to help shape it. Our technology teams are built to deliver innovation and progress that pushes the boundaries of what’s possible. They do that by bringing together talented people with diverse perspectives and backgrounds in a culture where everyone can thrive. On our Technology Intern Programme, you’ll work alongside the brightest minds in the business as you develop new skills and understand where you can apply them to make the most impact on our industry and across the world. Join us and see your ideas turned into positive impact.<br><br><strong><u>About The Business Division<br><br></u></strong>Technology underpins Deutsche Bank’s entire business and is changing and shaping the way we engage, interact and transact with our stakeholders, internally and externally. Our Technology, Data and Innovation (TDI) strategy is strengthening our engineering expertise, introducing an agile delivery model, and is modernising the bank's IT infrastructure with long-term investments and taking advantage of cloud computing. We are building a team of visionary technology talent that will ensure that we thrive in this period of unprecedented change for the industry. That means hiring the right people and giving them the training, freedom and opportunity they need to do pioneering work.<br><br><strong><u>Division Specifics<br><br></u></strong>Our technology teams deliver and manage engineering solutions to support the bank’s global customers. They develop and deliver solutions to help modernise technology solutions, to reduce complexity and risk, and to drive business growth.<br><br>Our Technology Intern Programme offers you a wide variety of opportunities within technology, and we’re looking for bright minds like yours to help us make pioneering strides in today’s fast-moving digital world. Through job placements, training courses, seminars, and a variety of networking events you will gain a wide range of practical experience and interpersonal skills with a bank that’s truly driving change in the financial and digital world.<br><br>By becoming part of our bank, you’ll become part of a diverse and inclusive network that will continue to support you for the rest of your career. Successful interns will be invited to join the Deutsche Bank Graduate Programme in Summer 2023.<br><br><strong><u>What We Look For<br><br></u></strong>We recruit highly intelligent graduates with Computer Science degree who are ambitious and adaptable. You should have excellent coding skills and even though good levels of numeracy are important for some roles, you won’t necessarily need a formal mathematical or financial background. We have very comprehensive training programmes that will give you all the technical knowledge you’ll need to build a career with us. Above all, we’re looking for entrepreneurial people who thrive best in a diverse culture where innovation and agile thinking abound.<br><br>You should not only be passionate about the world of finance, but also show a keen interest in your chosen field. You already have a record of outstanding academic achievement and you’re eager to go on learning at the same intensive rate. So you’ll thrive on working in a highly collaborative environment with some of the best minds in banking.<br><br><strong><u>For Candidates Applying For Positions In The US<br><br></u></strong>Our values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.<br><br>We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.<br><br>Click here to find out more about diversity and inclusion at Deutsche Bank.<br><br>Deutsche Bank is an Equal Opportunity Employer – Veterans/Disabled and other protected categories. Click these links to view the following notices: EEO is the Law poster and supplement ; Employee Rights and Responsibilities under the Family and Medical Leave Act ; Employee Polygraph Protection Act and Pay Transparency Nondiscrimination Provision .\n      "
    },
    {
        "position": "Software Engineering Intern - 2022",
        "company": "Ampere ",
        "location": {
            "city": " Durham",
            "state": "NC"
        },
        "posted": "2021-09-01T18:43:47.189Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-2022-at-ampere-2699813768?refId=p%2Belavd1hoWBx%2BJoORyM9g%3D%3D&trackingId=vMx18AbLE6%2FdmcaeKewXCg%3D%3D&position=15&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Description<br><br></u></strong>Description<br><br>As a member of the 2022 class of Ampere Interns (Intern Ampers), you will apply your programming experience and curiosities in the field of server-class microprocessor-based CPU/core design targeting cloud based software applications. You will be surrounded by industry experts passionate about what they do and ready to impart their knowledge onto you. There are opportunities across at all levels of the stack. Help make sure software is amazing on Ampere hardware. You will help create the Software that runs the world.<br><br><strong><u>What The Team Wants You To Know<br><br></u></strong>The Ampere Internship program focuses on you to build your networks, support your efforts in making an impact, and giving you exposure to what Ampere does and how Ampere operates across the company. We want you to leave with the feeling that what you've worked on made a difference, a new level of confidence of what you're capable of, technical expertise, and a new network of contacts.<br><br><strong><u>What You Bring<br></u></strong><ul><li>Coursework or experience in programming in C, C++ and scripting languages such as Perl or Python.</li><li>Experience in writing sustainable/maintainable quality code.</li><li>Ability to debug, root cause, and resolve issues spanning multiple subsystems. Proven ability to own problems and drive them to a resolution.</li><li>Good English communications skills, both verbal and writing</li><li>Innovative mindset focused on solving problems.</li><ul><li>Basic understanding in Computer Architecture/microarchitecture concepts<br></li></ul></ul><strong><u>Qualifications<br></u></strong><ul><li>Internship is for 2022 starts, typically May- August. Internship locations include Portland, OR, Santa Clara, CA, and Raleigh, NC.</li><li>Candidate must be in their Junior or Senior year pursuing a degree in Software Engineering, Computer Science, Computer Engineering, or related field. Expected graduation December 2022 or May 2023.<br></li></ul>Perks in Santa Clara<br><ul><li>Office has panoramic views of Silicon Valley</li><li>Garage parking, including charging stations and bike parking</li><li>Gym and café on campus</li><li>Healthy snacks, espresso, and drinks </li><li>Standing desks</li><li>Game room, including ping-pong </li><li>Unlimited Flextime and 10+ paid holidays<br></li></ul>Perks in Portland<br><ul><li>Walking distance of breweries, landscaped parks, art galleries, restaurants and shops</li><li>Garage parking </li><li>On-site bike parking and repair station</li><li>Gym </li><li>On-site café, bar and market </li><li>Roof top terrace with Willamette River views</li><li>Healthy snacks, espresso and drinks </li><li>Standing/Ergo friendly desk set up</li><li>Game room</li><li>Unlimited Flextime and 10+ paid holidays<br></li></ul>Perks in Raleigh<br><ul><li>Centrally located between Raleigh, Durham, and Chapel Hill in the Research Triangle</li><li>The Raleigh-Durham area sits at #11 in the U.S. News &amp; World Reports' 2020-2021 \"Best Places to Live\" list</li><li>Modern and open office setting</li><li>Four miles of jogging and pedestrian trails</li><li>Walking distance to various restaurants and shopping</li><li>Healthy snacks, espresso, and drinks</li><li>Standing/Ergo-friendly desk setup<br></li></ul>Our Company<br><br>Ampere is designing the future of hyperscale cloud and edge computing with the world’s first cloud native processor. Built for the cloud with a modern 64-bit Arm server-based architecture, Ampere gives customers the freedom to accelerate the delivery of all cloud computing applications. With industry-leading cloud performance, power efficiency and scalability, Ampere processors are tailored for the continued growth of cloud and edge computing.<br><br>Our Story<br><br>Like the scientist behind its name, Ampere employees are innovators. We understand the needs of cloud computing and different software requirements. We are inventing what comes next and looking at everything from the structure of memory and how efficient the system is, to considerations on speed, cost of electricity and ability to cool. Power, size, weight and cost are driving the technology requirements and the innovation to come.<br><br>Our world class team of engineers, with depth and expertise in the cloud and semiconductor industries, is not only focused on the development of new semiconductor designs but also building out the first software ecosystem for Arm®-based server processors. Through the Ampere approach to the cloud and edge, we give our customers the freedom to challenge the status quo and accelerate next-generation data centers for the most memory-intensive applications. Given the challenge we have outlined, we are building a culture of entrepreneurs that ensure customers come first, proactively approaching industry challenges in the areas of security, power and performance, delivering results that matter most.<br><br>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.<br><br>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n      "
    },
    {
        "position": "Software Engineer CO-OP",
        "company": "Commonwealth Care Alliance ",
        "location": {
            "city": " Boston",
            "state": "MA"
        },
        "posted": "2021-08-20T18:43:59.215Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-co-op-at-commonwealth-care-alliance-2688302120?refId=p%2Belavd1hoWBx%2BJoORyM9g%3D%3D&trackingId=lM8JKNfxSaKu9T6CC2rMuA%3D%3D&position=22&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <br><br><strong>Why This Role is Important to Us<br><br></strong>The CCA Co-Op team will be a part of the CCA IT team to deliver projects in a fast-paced manner in Enterprise Data Management, and Enterprise Product Engineering and Application Development. The software engineering Co-Op program is aimed at accelerating the delivery of software delivery lifecycle in the following areas that are critical to technology modernization and digital transformation impacting our members and providers.<br><br><br><br><strong><u>What You'll Be Doing<br><br></u></strong>Our goal is to move projects quickly from concept to pilot, and pilot to production, to realize the value of our investments. The Software Engineering Co-Op program is a specialized program for those that are looking for hands-on experience in engineering software solutions. It is targeting students that are eager to actively participate through the design, development, testing, and implementation of software solutions. Projects will be selected to represent key problems, worth solving, which have direct applicability to improving business results and experience of members and providers.<br><br>Attitude: Can-Do and Positive attitude and drive to self-learn and solve complex problems.<br><br><br><br><strong><u>What We're Looking For<br></u></strong><ul><li>Currently registered as a senior year university student or graduate\\masters student in a Computer Science, Computer Engineering, Data Management or a related program</li><li>Some experience with developing applications for university assignments or extra-curricular projects</li><li>Comfortable with at least one scripting language, such as Python or JavaScript</li><li>Comfortable with C#.Net, Java, or other object-oriented development environment</li><li>A collaborative team player with strong ideas and good listening skills</li><li>Ability to work in the United States.</li></ul> <br><br><strong>Actual Work Location<br><br></strong>2 Avenue de Lafayette, Boston, Massachusetts 02111-1750 <br><br><strong>All Locations<br><br></strong>Lafayette City Center\n      "
    },
    {
        "position": "Software Developer Intern",
        "company": "iSenpai, LLC ",
        "location": {
            "city": " Northern",
            "state": "VA"
        },
        "posted": "2021-08-04T18:44:01.414Z",
        "url": "https://www.linkedin.com/jobs/view/software-developer-intern-at-isenpai-llc-2698826467?refId=p%2Belavd1hoWBx%2BJoORyM9g%3D%3D&trackingId=8%2BDgpLV9m5SmlUuitU%2Bs%2FA%3D%3D&position=23&pageNum=11&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        iSenpai is a Woman Owned Small Business (WOSB) that provides enterprise IT and cyber security services, cloud technology, and data analytics solutions for US Government and commercial customers. We specialize in cloud-based solutions with cyber security integrated into the design, delivered using efficient Agile DevSecOps. Engaging across industry and academia to develop innovative approaches, we support our customers’ changing mission needs and data. Our iSenpai designs are industry proven to handle enormous data streams from open source, Internet of Things (IOT), cyber tools, and social media. We bring expertise with National Institute of Standards and Technology (NIST) Special Publication (SP) 800-53 and the Risk Management Framework (RMF) to maintain secure, scalable, and highly available systems to meet the mission. Our goal is to provide expert services to our clients while cultivating knowledge among all employees for the advancement of our services. We offer a comprehensive package of 100% employer paid benefits, including medical, dental, vision, HSA Contribution, 401K match, and more.<br><br><strong>iSenpai offers an extremely competitive benefits package for full time employees to include:<br></strong><ul><li> Extremely Competitive Salary </li><li> Health, Dental, Vision Insurance Premiums are 100% provided by iSenpai for employees and eligible dependents </li><li> Personal Accident Insurance provided by iSenpai </li><li> Life Insurance provided by iSenpai </li><li> Short and Long Term Disability Insurance provided by iSenpai </li><li> 401K Contribution Matching - 5% dollar for dollar </li><li> 401K Profit Sharing based on company performance </li><li> Paid time off (PTO) starting at 4 weeks a year (20 days) </li><li> PTO buy back program </li><li> 10 paid Federal Holidays </li><li> Reimbursement for any wellness programs and/or work life balance programs </li><li> Reimbursement for cell phone plans </li><li> Reimbursement for home internet </li><li> Reimbursement every 2 years for a cell phone upgrade </li><li> Thousands of discounts on everything from your cell phone bill, to NFL tickets, Movie Tickets, Live Performances, etc </li><li> Rewards for obtaining new IT certifications </li><li> Computer-based training (CBT) library on IT and information security topics and certifications </li><li> Remote access to a virtual lab for testing/learning opportunities </li><li> Flexible / Alternative Work Schedules (based on customer requirements) <br></li></ul><strong><em>iSenpai is an equal opportunity / affirmative action employer. We give equal consideration to all qualified candidates without regard to race, color, gender, nationality, disability or protected veteran status.<br><br></em></strong><u><strong>Software Developer Intern<br><br></strong></u><strong> Minimum Education: Currently in process of Bachelors Degree <br><br></strong><strong> Minimum Experience: 0 years <br></strong><ul><li>Provides a wide range of administrative and technical support to the development teams, including technology research, report/artifact preparation, and prototyping of distinct features/capabilities and other duties as assigned</li><li>Requires understanding of basic software development concepts and good communication skills</li><li>Works individually and also actively participates on integrated teams</li><li>Requires guidance and mentorship from senior level technicians, specialists, and/or managers</li><li>Must be enrolled in a Calculus based degree program in Computer Science, Engineering or Mathematics .</li></ul>\n      "
    },
    {
        "position": "FinTech Full-Stack Developer Intern (US Only-Remote)",
        "company": "Token Metrics ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-08-04T18:44:08.672Z",
        "url": "https://www.linkedin.com/jobs/view/fintech-full-stack-developer-intern-us-only-remote-at-token-metrics-2688689701?refId=qLqhjEkHHKr0i8JjfsFsxg%3D%3D&trackingId=XBDXx6%2BljwEQSC5Jgbq2Iw%3D%3D&position=2&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Token Metrics is looking for a highly skilled computer programmer who is comfortable with both front and back end programming. Full stack developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications, and working alongside graphic designers for web design features, among other duties.<br><br>Full stack developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.<br><br>The duration of the Token Metrics internship program is 3 months. It is an evaluative unpaid internship with the possibility of return offers, depending on the company's needs.<br><br><strong> Responsibilities <br></strong><ul><li>Developing front end website architecture.</li><li>Designing user interactions on web pages.</li><li>Developing back-end website applications.</li><li>Creating servers and databases for functionality.</li><li>Ensuring cross-platform optimization for mobile phones.</li><li>Ensuring responsiveness of applications.</li><li>Working alongside graphic designers for web design features.</li><li>Seeing through a project from conception to finished product.</li><li>Designing and developing APIs.</li><li>Meeting both technical and consumer needs.</li><li>Staying abreast of developments in web applications and programming languages.</li></ul>Requirements<br><ul><li>Degree in computer science.</li><li>Strong organizational and project management skills.</li><li>Proficiency with fundamental front-end languages such as HTML, CSS, and JavaScript.</li><li>Familiarity with JavaScript frameworks such as Angular JS, React, and Amber.</li><li>Proficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net.</li><li>Familiarity with database technology such as MySQL, Oracle, and MongoDB.</li><li>Excellent verbal communication skills.</li><li>Good problem-solving skills.</li><li>Attention to detail.</li></ul>About Token Metrics<br><br>Token Metrics helps crypto investors build profitable portfolios using artificial intelligence based crypto indices, rankings, and price predictions.<br><br>Token Metrics has a diverse set of customers, from retail investors and traders to crypto fund managers, in more than 50 countries.\n      "
    },
    {
        "position": "Software Engineer Internship - General",
        "company": "TuSimple ",
        "location": {
            "city": " Pasadena",
            "state": "CA"
        },
        "posted": "2021-09-01T18:44:23.895Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-general-at-tusimple-2705316646?refId=qLqhjEkHHKr0i8JjfsFsxg%3D%3D&trackingId=UhkzprIo4IpdTkR8BEqj2Q%3D%3D&position=11&pageNum=12&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a General Software Engineering Intern at TuSimple, you will have the opportunity to work on various backend projects. You will be developing and maintaining modules such as vehicle systems, embedded systems, simulation systems, and map. Your work ensures our algorithm scientists' research can be successfully transformed into virtual driver software, and then easily deployed on the truck. You will also collaborate with engineers from different teams to optimize the backend systems to make sure they are efficient, robust and scalable.<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Design, develop, test, debug, and deploy software modules in autonomous driving systems, and/or in related platform and tools software.</li><li>Responsible for integrating multiple modules and systems into one platform</li><li>Developing and maintaining key integrating tools and monitoring performance <br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a MS//PhD program in Computer Science or related fields</li><li>Strong background in developing production-quality software in C/C++ in Autonomous Driving, Robotics, Internet, Telecommunication, and other technology industries</li><li>Proficiency in writing modern C++ (11 or above)</li><li>Solid knowledge of operating system, distributed system, and networking<br></li></ul><strong><u>Preferred Skills &amp; Experience<br></u></strong><ul><li>Have experiences/courses in Autonomous Driving and/or Robotics</li><li>Familiar with Linux environment and multi-threaded/multi-process programming</li><li>Attended programming contests such as OI and ACM</li><li>Development experiences in robotics middleware such as ROS</li><li>Hands-on experiences in performance profiling, analysis, and optimization</li><li>Knowledge of computer vision and/or machine learning<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em>For immediate consideration email your resume to:<br><br></em><em>ec__software_engineering_internship___general_3d5b01b62us@ivy.greenhouse.io<br><br></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Backend - Systems and Infrastructure Engineer Intern - Winter 2022 (Remote - US based)",
        "company": "LinkedIn ",
        "location": {
            "city": " Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-09-01T18:44:50.420Z",
        "url": "https://www.linkedin.com/jobs/view/backend-systems-and-infrastructure-engineer-intern-winter-2022-remote-us-based-at-linkedin-2705875440?refId=ryiJQzOZPaY5ktGxbKVgig%3D%3D&trackingId=rHwXqSfWEbGrDP1Oj9yFcA%3D%3D&position=2&pageNum=13&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Backend - Systems and Infrastructure Engineer Internship - Winter 2022 (Remote - US based)<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities, and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Are you interested in Backend Development? We're building the next-generation data infrastructure, including storage, streams, media and analytics platforms. Help us scale LinkedIn infrastructure to handle massive data growth across the LinkedIn ecosystem as we experience dramatic growth in membership and products. You will utilize distributed systems and algorithms and perfect your strong systems orientation skills (multi-threading, concurrency, scalability, performance). You will understand frameworks for caching, queuing, and distributed data storage, and be excited to work on cutting edge open-source systems.<br><br>Responsibilities: <br>-This position will be remote based out of the United States and applicants must have appropriate work authorization.<br>-This internship will take place during winter 2022 (January - April 2022)<br><br>The ideal intern candidate will help scale LinkedIn’s infrastructure to handle massive growth in membership, traffic, and data as we continue to experience dramatic growth in the usage of our products with focus in one or more of the areas below:<br><br>Data Infrastructure: Build and support large scale systems (e.g. Apache Kafka, Apache Samza, Hadoop, Pinot, Espresso, Ambry, Helix etc.) and tools that enable the generation of insights and data products on all of LinkedIn’s internal and external data via self-serve computing, reporting solutions, and interactive querying<br><br>Search, Networks and Analytics: Build and operate the platform that powers all of search at LinkedIn—which responds to thousands of queries per second with target latencies in tens of milliseconds. The platform runs in 24/7 production environment and enables search quality engineers to rapidly innovate, experiment and improve relevance—while at the same time remaining constantly available and performant to our users<br><br>Service: Provide the technical platform for all of LinkedIn Engineering to build services, which are the essential unit of development and deployment<br><br>Content and Community: Deliver the systems and algorithms that generate and serve feeds of professionally relevant activities and content<br><br>Basic Requirements:<br>- Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field and returning to the program after the completion of the internship <br>- Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby <br><br>Preferred Qualifications:<br>- Expected to complete degree by December 2023 or earlier<br>- Thorough knowledge of Java<br>- Experience building distributed, Internet-scale systems<br>- Experience building and applying frameworks for one or more of the following: caching, queuing, RPC, parallelism, and/or distributed knowledge<br>- Thorough knowledge of multi-threading, concurrency, parallel processing and distributed computing technologies<br>- Experience with industry, open-source projects and/or academic research in large-data, parallel and distributed systems<br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement <br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information. <br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful. <br> <br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation. <br> <br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to: <br> <br>-Documents in alternate formats or read aloud to you <br>-Having interviews in an accessible location<br>-Being accompanied by a service dog<br>-Having a sign language interpreter present for the interview<br> <br>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement <br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice\n      "
    },
    {
        "position": "Jr. Data Analyst Intern",
        "company": "ParkHub ",
        "location": {
            "city": " Texas",
            "state": "United States"
        },
        "posted": "2021-07-05T18:45:38.917Z",
        "url": "https://www.linkedin.com/jobs/view/jr-data-analyst-intern-at-parkhub-2625976027?refId=xhGt5w0%2FykRhIJ94yRRkww%3D%3D&trackingId=VfJTyVXRi%2Be6wRowIl1kSw%3D%3D&position=7&pageNum=14&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Job Description:ParkHub is looking for a Jr. Data Analyst to be part of a fun, fast-paced, and growing parking technology company in Dallas. The Jr. Data Analyst will act to support the organization by developing dashboards, reporting systems, and ad-hoc reports which are used by both management and employees to make informed decisions. The JDA will utilize their knowledge of parking &amp; entertainment industries to identify trends and correlations within the data.The JDA will also have the opportunity to demonstrate their intellectual agility by leading data collection and data analysis activities to produce key performance insights. Who we are looking for:An ideal candidate would be someone who can sort through our data and requests to understand the bigger picture and assist with telling the story through the data. Our team members are true problem solvers who do not slow down. Prepare visual presentations of data and analysis. Prepare reports and presentations for senior leadership based on research plans, activities, findings and recommendations. Develop formulas using MS Excel Use of tools such as Pivot Tables and VLOOKUP function in MS Excel Handle tasks and complete assignments in a timely manner Keep detailed notes and adhere to process guidelines Provide departmental support and complete administrative tasks as needed Ability to analyze and interpret data based on established criteriaAbility to work independently, meet deadlines, ensure accuracy, and use good judgementDaily, weekly, monthly and ad-hoc reporting using SQL and ExcelReview and analysis of daily transaction, statistical reports and other documentsCompilation of reports from various data sources for additional analysisValidate data on import / exportTroubleshoot issues with data processingMaintain dashboards while ensuring their accuracy<br><br>Skills we’re looking for: Bachelor’s Degree, preferably in Computer Science, Economics, Business, or a closely – related fieldExperience with Google Analytics, Grow, Power BI or other BI PlatformsAbility to write SQL queries, experience with python a plusFamiliarity with relational databases (Postgresql), basic statistics and algebraKnowledge of parking &amp; entertainment industriesExcellent organizational and administrative skills and attention to detailCommunication and interpersonal skills. Able to communicate and provide feedback effectively to othersMust be able to communicate data analysis/results with all levels of managementAct in a high confidential capacity with keeping sensitive information secureStrong analytical skills, strong problem-solving abilities and project management skillsCreative and enthusiastic attitude towards learning new skillsExcellent written and verbal communication skillsMust be authorized to work in the United States Benefits and Perks:Competitive salary plus benefits and incentives packageFlexible vacation policyPlenty of coffee, Red Bull, Topo Chico, and snacks!Stocked kitchen and catered mealsOpen office environmentWe're dog friendly!Planned team outingsPartner perks (game tickets, pre-sale access, swag) Powered by JazzHR\n      "
    },
    {
        "position": "Software Engineering Intern",
        "company": "Bayer ",
        "location": {
            "city": " Chesterfield",
            "state": "MO"
        },
        "posted": "2021-08-04T18:45:46.246Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-bayer-2679946464?refId=xhGt5w0%2FykRhIJ94yRRkww%3D%3D&trackingId=7a%2BTPET06XzNy7qgVJn1vw%3D%3D&position=11&pageNum=14&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Bayer is a global enterprise with core competencies in the Life Science fields of health care and agriculture. Its products and services are designed to benefit people and improve their quality of life. At Bayer you have the opportunity to be part of a culture where we value the passion of our employees to innovate and give them the power to change.<br><br></strong><strong>Software Engineering Intern<br><br></strong><strong><u>Your Tasks And Responsibilities<br><br></u></strong>The primary responsibilities of this role, Software Engineering Intern, are to:<br><ul><li> Work with stakeholders from various business units to identify high-value opportunities where virtual or augmented reality can make an appreciable difference to the business; </li><li> Develop custom applications to address business needs and solve challenges, this includes environment creation, object design and creation, texturing, substance design, UX, coding and scripting; </li><li> Be an advocate for these technologies and always focus on showing business value; </li><li> Maintain software development best practices including testing, version control, secure coding practices, etc.; </li><li> Partner with other teams developing VR/AR projects to guide their efforts and bring cohesion to Bayer Crop Science’s overall VR/AR strategy. <br></li></ul><strong><u>Who You Are<br><br></u></strong>Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:<br><br>Required Qualifications:<br><ul><li> Currently enrolled in a Bachelor’s degree in Computer Science or related field with emphasis on virtual technologies with experience building 3D environments, games and/or experiences with Unity and Unreal Engine; </li><li> Experience with 3D modeling using tools such as Blender, 3ds Max and MODO; </li><li> C# experience; </li><li> Experience designing core game mechanics/interactions; </li><li> Experience with Visual Studio and GitHub; <br></li></ul>Preferred Qualifications:<br><ul><li> At least two years of experience in materials rendering and substance tools; </li><li> Experience within the agriculture field; </li><li> Experience with UI/UX best practices. <br></li></ul><strong> YOUR APPLICATION <br><br></strong>Bayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and you have the \"Passion to Innovate\" and the \"Power to Change\", we encourage you to apply now. To all recruitment agencies: Bayer does not accept unsolicited third party resumes.<br><br>Bayer is an Equal Opportunity Employer/Disabled/Veterans<br><br>Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.<br><br><strong>Location:</strong> United States : Missouri : Chesterfield<br><br><strong>Division:</strong> Crop Science<br><br><strong>Reference Code:</strong> 436550<br><br><strong>Contact Us<br><br></strong><strong>Email:</strong> hrop_usa@bayer.com\n      "
    },
    {
        "position": "Advanced Analytics Intern",
        "company": "Kalderos ",
        "location": {
            "city": " Chicago",
            "state": "IL"
        },
        "posted": "2021-08-06T18:45:53.256Z",
        "url": "https://www.linkedin.com/jobs/view/advanced-analytics-intern-at-kalderos-2676834903?refId=xhGt5w0%2FykRhIJ94yRRkww%3D%3D&trackingId=wJQO9Ks7Hm7VHFO8CUBpOw%3D%3D&position=15&pageNum=14&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>About Our Organization<br><br></u></strong>At Kalderos, we are building unifying technologies that bring transparency, trust, and equity to the entire healthcare community with a focus on pharmaceutical pricing. Our success is measured when we can empower all of healthcare to focus more on improving the health of people.<br><br>That success is driven by Kalderos' greatest asset, our people. Our team thrives on the problems that we solve, is driven to innovate, and thrives on the feedback of their peers. Our team is passionate about what they do and we are looking for people to join our company and our mission.<br><br>That's where you come in!<br><br>Who We're Looking For<br><br>The Advanced Analytics team's mission at Kalderos is to use data to drive decision making and build the trust of our platform users, and internal teams. This starts with having trust in each other as a team, then expanding it to do this work in three primary ways: building differentiated datasets, measuring what matters, and optimizing the right process. Below are some possible day to day tasks for a <strong>business intelligence intern </strong>at Kalderos.<br><br>We're a team of people striving for the best, so naturally, we want to hire the best! We know that job postings can be intimidating, and don't expect any candidate to check off every box we have listed (though if you can, AWESOME!). We encourage you to apply if your experience matches about 70% of this posting.<br><ul><li>Build and present data visualizations, dashboards, and presentations for use across the business. </li><li>Chasing down issues in data reports that just don't look right, either because it was raised by someone else or you noticed it, and tracking down the source of error. You'll address this head-on if you can solve the problem on your own, or move it to the product team's backlog if extra support is needed. Sometimes it takes a long time to fix, so you will flag that as an issue for the team's awareness </li><li>Expanding the team's knowledge across the company on how to use tools like DBT, Fivetran, and Tableau to empower them to answer their own data driven questions </li><li>Working with our sales and customer success teams to provide ad-hoc data requests as needed, with an eye towards making it repeatable if it's a recurring ask </li><li>Learning a new tool, framework, SQL trick, or visualization that is exciting, then sharing it with the team and putting it into practice <br></li></ul>General Experience Guidelines<br><br>We know your experience extends beyond what you have on paper. The following is a guideline of general experience we're looking for in this role:<br><ul><li>Currently pursuing or recently finished a Bachelor or Master's degree in Computer Science, Information Systems, or related field </li><li>Experience using SQL, business intelligence tools, and building dashboards </li><li>A keen eye towards interpreting data and understanding if a number \"looks right\". Can contextualize data and able to translate complicated business questions into structured data answers </li><ul><li>Some ways you may demonstrate this are: </li><ul><li>Describing a time you caught a non-obvious data error of consequence </li><li>Excelling in our interview when asked to interpret data </li><li>Example(s) of how you helped defined new metrics or enhanced existing KPIs <br></li></ul></ul></ul>Set Yourself Apart<br><ul><li>Experience in healthcare or pharmaceuticals </li><li>Experience using Fivetran or Stitch </li><li>Experience using modern data warehouses like Snowflake </li><li>Experience managing RBAC policies </li><li>Experience with DBT </li><li>Experience using git/GitHub <br></li></ul>____________________________________________________________________________________________<br><br><strong><u>Highlighted Company Perks And Benefits<br></u></strong><ul><li>Continuous growth and development: Annual continuing education stipend supporting all employees on their ongoing knowledge journey. </li><li>Celebrating employee milestones: bi-annual stipend for all full-time employees to help you celebrate your exciting accomplishments throughout the year. </li><li>Work From Home Reimbursement: quarterly funds provided through the pandemic to help ensure all employees have what they need to be productive and effective while working from home. </li><li>A fair PTO system that allows for a healthy work-life balance. There's no maximum, but there is a minimum; we want you to take breaks for yourself </li><li>401K plan with a company match </li><li>Choose your own Technology: We'll pay for your work computer <br></li></ul>What It's Like Working Here<br><ul><li>We thrive on collaboration, because we believe that all voices matter and we can only put our best work into the world when we work together to solve problems. </li><li>We empower each other: from our DEI Council, to affinity groups for underrepresented populations we believe in ensuring all voices are heard. </li><li>We know the importance of feedback in individual and organizational growth and development, which is why we've embedded it into our practice and culture. </li><li>We're curious and go deep. Our slack channel is filled throughout the day with insightful articles, discussions around our industry, healthcare, and our book club is always bursting with questions. <br></li></ul>Kalderos is an equal opportunity workplace. We are committed to equal opportunity regardless of race, color, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or veteran status.<br><br><strong><em>Due to the circumstances of the COVID-19 pandemic, Kalderos has decided to protect our current and future employees by shifting to an entirely remote workforce. We will continue to operate, interview, onboard, and work remotely. Please be aware that some of our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities and the CDC</em></strong>\n      "
    },
    {
        "position": "VxWorks Intern",
        "company": "Wind River ",
        "location": {
            "city": " Alameda",
            "state": "CA"
        },
        "posted": "2021-08-13T18:46:46.186Z",
        "url": "https://www.linkedin.com/jobs/view/vxworks-intern-at-wind-river-2678756454?refId=PnDi%2BB7%2BEbCPu8mpISVcuw%3D%3D&trackingId=divzbakAwl5CL4RX14Dwdw%3D%3D&position=23&pageNum=15&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Description<br><br></u></strong><em>Position at Wind River<br><br></em><strong>Position Title: VxWorks Engineering Intern<br><br></strong><strong>Preferred Location: </strong>Alameda, CA<br><br>In a world increasingly driven by software innovation, Wind River is pioneering the technologies to accelerate the digital transformation of our customers with a new generation of Mission Critical AI Systems in an AI-first world with the most exacting standards for safety, security, performance, and reliability.<br><br>Imagine being part of a global team that is building the technology foundation for self-driving cars. Life-saving medical breakthroughs. Environmentally sustainable energy. 5G networks. Or safe and smooth landings on Mars. When someone asks, “What did you do today?” you’ll have an awesome answer.<br><br><strong><u>About The Opportunity<br><br></u></strong>Wind River has a great opportunity available for Fall Intern (approximately September - December) to join the Core OS development team of Wind River's flagship VxWorks Operating System. Candidate will focus on Wind River Studio a cloud-based environment for build and validation pipelines used for kernel related features. They may also contribute to VxWorks kernel features. This is a 40- hour per week paid internship. Qualified candidate must be an enrolled student or recent college graduate looking to gain work experience.<br><br><strong><u>Responsibilities<br><br></u></strong>The main responsibilities of this position will be to contribute to the development, maintenance, enhancement of features and tests related to the kernel technologies and Wind River Cloud solutions. The position will work with a variety of target platforms (PowerPC, Intel, ARM) on physical targets and simulators. You will be working closely with a talented group of OS, kernel, and architecture experts.<br><br><strong><u>Qualifications<br></u></strong><ul><li>GPA of 3.0 or higher majoring in Computer Engineering, Computer Science or equivalent</li><li>Completing 3 years of study as of May 2021 or higher</li><li>Knowledge of Operating Systems or taken courses in Operating Systems is a plus</li><li>Cloud development using Docker / Jenkins / Kubernetes</li><li>Practical experience with at least the C language</li><li>Good debugging and problem-solving skills</li><li>Good written and oral communication skills</li><li>Assembly language is a plus.</li><li>Knowledge of scripting languages such as Python, shell scripts etc. is also a plus.</li></ul>\n      "
    },
    {
        "position": "Sensor Software Engineer Internship",
        "company": "TuSimple ",
        "location": {
            "city": " Tucson",
            "state": "AZ"
        },
        "posted": "2021-08-13T18:46:59.726Z",
        "url": "https://www.linkedin.com/jobs/view/sensor-software-engineer-internship-at-tusimple-2686821569?refId=7%2BH7JS7IkWHxlqKxCOow6g%3D%3D&trackingId=JeWgU4D5ssGveFrg60PbmQ%3D%3D&position=6&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <em>This opportunity is located in Tucson, AZ or San Diego, CA. <br><br></em><strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong><u>Opportunity Overview<br><br></u></strong>As a Sensor Software Engineer Intern, you will work closely with our R&amp;D team to develop sensor system solutions for autonomous vehicles.<br><ul><li>Design and develop software systems and internal tools for autonomous driving vehicles </li><li>Develop sensors drivers &amp; APIs &amp; SDKs, evaluate sensors performance, integrate sensors to the vehicles, build sensors calibration solution, support algorithm development and calibration activities for vehicles </li><li>Integrate vehicle system including sensing modules, perception modules, monitoring modules etc. <br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a M.S. or Ph.D. program in Computer Engineering, Computer Science, Robotics or a related field </li><li>Proficiency with Python and/or C++/C </li><li>System software design and programming - including parallel processing, threading, synchronization etc. to realize complex middleware and applications </li><li>Excellent problem solving and troubleshooting skills, including a systematic approach to determining root cause, implementing solutions, and documenting results <br></li></ul><strong><u>Preferred Skills And Experience<br></u></strong><ul><li>2+ years of experience in one of the following areas: unmanned autonomous platforms, software system engineering, vehicle integration, sensors systems etc. <br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em>This opportunity is located in Tucson, AZ or San Diego, CA. <br><br></em>You can apply to the job with this email address: hdwe__sensor_software_engineer_internship_c20760182us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Engineering Intern",
        "company": "Snorkel AI ",
        "location": {
            "city": " Palo Alto",
            "state": "CA"
        },
        "posted": "2021-07-05T18:47:01.921Z",
        "url": "https://www.linkedin.com/jobs/view/engineering-intern-at-snorkel-ai-2653527637?refId=7%2BH7JS7IkWHxlqKxCOow6g%3D%3D&trackingId=uq41zZqNJKxEPl%2BwzUoL3A%3D%3D&position=7&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        At Snorkel AI, we’re redefining how people and organizations build AI applications. Snorkel started as a research project in the Stanford AI Lab in 2016, creating a higher-level interface to machine learning through programmatically labeled and managed training data. From deploying in some of the world’s largest and most sophisticated tech organizations, to empowering scientists, doctors, and journalists — we’ve seen firsthand how this approach democratizes and accelerates AI. Now, we’re building Snorkel Flow to bring our technology to everyone!<br><br>Building Snorkel Flow requires outstanding engineers and technologies across the stack, including scalable data pipelines, elegant and intuitive interfaces (both visual and programmatic), state-of-the-art ML modeling techniques, and best practices for seamless deployment. Modern AI approaches require large labeled training datasets to learn from. While traditional approaches typically rely on armies of human annotators to label by hand, Snorkel Flow empowers users to programmatically label and build training data sets to drive a radically faster, more flexible, and higher quality end-to-end AI development process. Snorkel Flow is an end-to-end development platform, complete with a GUI and powerful programmatic interfaces for driving the development process for full AI application workflows: from preprocessing, to programmatic training data creation, to ML model training, to analysis, and deployment. It's the data-first platform for enterprise AI.<br><br>Excited to help us redefine how AI applications are built? Apply to be the newest Snorkeler!<br><br>As an Engineering Intern, you’ll work on a project motivated by Snorkel's ongoing engagements with customers, with opportunities for both end-to-end ownership and mentorship. In our fast-moving startup environment, we look for engineers who are versatile, proactive, and excited to dive into solving real-world problems. Expect to be treated as a full member of the team, with regular opportunities for giving and receiving feedback and observing up close the workings of a high-growth startup.<br><br>Main Responsibilities<br><ul><li>Work with a mentor and engineering team to develop customer solutions and platform improvements</li><li>Analyze objectives and evaluate results to choose the best solution to effectively solve problems</li><li>Design new features, make product recommendations, and generally help make Snorkel Flow a platform AI practitioners love to use</li></ul>Preferred Qualifications<br><ul><li>Pursuing a BS/MS/PhD in Computer Science or a related field</li><li>Available to work full time for a minimum of 12 weeks and return to a degree program after completion of the internship</li><li>Skilled in Software Development and coding in Python and/or JavaScript</li><li>Experience working on large, collaborative coding projects </li><li>Ability to work in a fast-paced environment and strong technical communication skills</li></ul>If you applied to a position at Snorkel AI over 9 months ago, feel free to re-apply and let us know what you’ve been up to!<br><br>If you applied to a position at Snorkel AI over 9 months ago, feel free to re-apply and let us know what you've been up to!<br><br>Be Your Best At Snorkel<br><br>Snorkel AI is on a mission to make machine learning practical for everyone, and it starts with building a team that welcomes, represents and gives opportunity to all. We work at the frontier of AI and software engineering, and believe that underrepresented communities need to play a part in shaping the future of these fields. At Snorkel AI, we actively work to create an environment that values end-to-end ownership, diverse forms of impact, and opportunities for personal growth.<br><br>Snorkelers are supported by an amazing team and an amazing set of benefits. We offer comprehensive medical, dental, and vision plans for Snorkelers and their families, plus a yearly wellness stipend. Our 401k program lets Snorkelers plan for their future with a 100% match up to 5% of annual salary. And our parental leave program lets new parents take up to 20 weeks of paid time off. Learn more about these benefits and more — like our workstation setup allowance — on our Careers page.<br><br>Snorkel AI is proud to be an Equal Employment Opportunity employer and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. Snorkel AI embraces diversity and provides equal employment opportunities to all employees and applicants for employment. Snorkel AI prohibits discrimination and harassment of any type on the basis of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local law. All employment is decided on the basis of qualifications, performance, merit, and business need.<br><br>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n      "
    },
    {
        "position": "Technology Intern-Fall",
        "company": "Great American Insurance Group ",
        "location": {
            "city": " Cincinnati",
            "state": "OH"
        },
        "posted": "2021-08-13T18:47:09.195Z",
        "url": "https://www.linkedin.com/jobs/view/technology-intern-fall-at-great-american-insurance-group-2684038109?refId=7%2BH7JS7IkWHxlqKxCOow6g%3D%3D&trackingId=anvqO2I90oZ51WvDyPkuuQ%3D%3D&position=11&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Be Here. Be Great.</strong> Working for a leader in the insurance industry means opportunity for you. Great American Insurance Group’s member companies are subsidiaries of American Financial Group, a Fortune 500 company. We combine a \"small company\" culture where your ideas will be heard with \"big company\" expertise to help you succeed. With over 30 specialty property and casualty operations, there are always opportunities here to learn and grow.<br><br>At Great American, we value the unique perspective each of our employees bring to the workplace. We know that when people with different cultures, backgrounds and experiences work collaboratively, we can exceed our business objectives. We are dedicated to attracting, developing and retaining a diverse workforce that fosters creativity and enables our ongoing success.<br><br>The intern program provides students the opportunity to learn about technology in the insurance industry, as well as experience Great American’s corporate culture that values integrity, leadership, customer focus and accountability.<br><br><strong><u>Reasons To Join Our Team<br></u></strong><ul><li>Work in a team environment, where your ideas can be shared and you can impact the company</li><li>Gain real work experience that you can apply in the classroom</li><li>Opportunities to network with other interns, employees, and executives</li></ul><strong>Responsibilities:<br></strong><ul><li>Development and Implementation:</li><li>Assists in the formulation and definition of system scope and objectives through research and fact-finding to develop or modify moderately complex information systems</li><li>Designs, codes, tests, debugs, documents and maintains application programs</li><li>Contributes to the development of project plans and timelines</li><li>Provides estimates for planned work</li><li>Establish an open relationship with customers, teammates, and other members of the IT organization</li><li>Complete assigned tasks as directed in a timely manner using good object oriented coding practices and standards</li><li>Unit test code for proper functionality</li><li>Follow the established standards, patterns, and processes</li><li>Participate in team planning activities</li></ul><strong>Technical Skills:<br></strong><ul><li>Java and/or C# experience</li><li>Object-oriented development</li><li>SQL</li><li>Data Modeling</li><li>PL/SQL</li><li>Hadoop</li><li>Python</li><li>R</li><li>Spark</li><li>Web Services and integration</li></ul><strong>Qualifications:<br></strong><ul><li>Working towards a BS or MS in Information Technology, Computer Science or related field</li><li>Self-motivated team player who excels in a collaborative environment</li><li>Previous Internship experience is a plus</li><li>Strong sense of personal accountability</li><li>Excellent problem solving skills</li><li>Must be available to work full-time throughout the summer<br></li></ul><strong><u>Business Unit<br><br></u></strong>Property &amp; Casualty IT Services\n      "
    },
    {
        "position": "Software Engineer Internship - C++",
        "company": "TuSimple ",
        "location": {
            "city": " Ann Arbor",
            "state": "MI"
        },
        "posted": "2021-09-01T18:47:16.543Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-c%2B%2B-at-tusimple-2705319465?refId=7%2BH7JS7IkWHxlqKxCOow6g%3D%3D&trackingId=ihRvs1MaU3Om25aL9suq3w%3D%3D&position=15&pageNum=16&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a C++ Software Engineering Intern at TuSimple, you will have the opportunity to work on accelerating the development of our driverless autonomous vehicle systems. Join our rapidly growing team of expert engineers and help us architect and bring to life best-in-class Distributed Systems, Machine Learning (ML) Platforms, and Data Pipelines.<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Design, develop, test, debug, and deploy software modules in Autonomous Driving System, and/or in related platform and tools software.</li><li>Collaborate with other team members.<br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a MS/PhD program in Computer Science or other related fields.</li><li>3+ years of experience developing production-quality software in C++ or Python in Autonomous Driving, Robotics, Internet, Telecommunication, and other technology industries.</li><li>Solid understanding of operating systems and embedded systems.</li><li>Solid understanding of object-oriented programming.</li><li>Solid understanding of data structure and basic algorithms.</li><li>Solid understanding of performance profiling, analysis, and optimization.</li><li>Good debugging and root cause analysis skills.</li><li>Good understanding and experience of Python programming.</li><li>Good communication skills and team collaboration.<br></li></ul><strong><u>Preferred Skills &amp; Experience<br></u></strong><ul><li>Good understanding and experience in Computer Vision, Image Processing, Deep Learning, or other Algorithms.</li><li>Development experience in RTOS and Linux kernel.</li><li>Development experience in ROS.</li><li>Development experience on ARM platforms.</li><li>Good understanding and use of Docker.<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.<br><br><em><strong>For immediate consideration, please email your resume to:<br><br>ec___software_engineer_internship___c___d1f618ac2us@ivy.greenhouse.io<br><br></strong></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Student Intern (compiler)",
        "company": "Latent AI, Inc. ",
        "location": {
            "city": " Princeton",
            "state": "NJ"
        },
        "posted": "2021-08-04T18:47:34.926Z",
        "url": "https://www.linkedin.com/jobs/view/student-intern-compiler-at-latent-ai-inc-2663950945?refId=I8mZHTvkUNQ3RMFStHs11w%3D%3D&trackingId=CjRO8QSj5VsP9xpj9tZxyw%3D%3D&position=1&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Student Intern (Compiler) - Job Description<br><br></u></strong>Latent AI, founded in 2019, is a technology spinout from SRI International, based on years of DARPA research. Latent AI takes the hard work out of embedding complex AI models into hardware so developers can speed the time to market. With our Adaptive AI™ technology, which is framework, OS, architecture, and hardware agnostic, we transform the way developers train AI for the edge enabling rapid AI deployment to lean edge devices at scale.<br><br>This internship position will involve research and development of algorithms and software systems. You will help develop algorithms and software for a compiler framework. We are looking for continuing college or university students in good standing at an accredited institution pursuing a graduate degree in computer architecture, compiler design, system software or a related field.<br><br>Students will have the opportunity to work with engineers, AI scientists, and technical staff members to provide technical and/or research support to projects in the areas of compiler engineering, AI engineering, or other related fields.<br><br><strong><u>Qualifications<br></u></strong><ul><li>Bachelor's Degree in Computer Science or Engineering. Masters / PhD preferred</li><li>Proven experience in compiler design, machine learning, or related areas<br></li></ul><strong><u>Desired Skills<br></u></strong><ul><li>Proven ability to work on collaborative software development</li><li>Experience with LLVM</li><li>Experience with MLIR, Glow or TVM is preferable but not required</li><li>Experience using machine learning frameworks (Tensorflow, PyTorch, Keras) is preferable but not required<br></li></ul>Latent AI provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n      "
    },
    {
        "position": "ML Platform - Machine Learning Engineer Internship",
        "company": "TuSimple ",
        "location": {
            "city": " Los Angeles",
            "state": "CA"
        },
        "posted": "2021-09-01T18:48:12.318Z",
        "url": "https://www.linkedin.com/jobs/view/ml-platform-machine-learning-engineer-internship-at-tusimple-2705320375?refId=I8mZHTvkUNQ3RMFStHs11w%3D%3D&trackingId=BjsAo5hAvEueToTAmqb%2F6w%3D%3D&position=24&pageNum=17&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19.<br><br></em></strong><strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong><u>Role Responsibilities<br></u></strong><ul><li>Work with massive datasets on data association, clustering, segmentation, filtering, and estimation</li><li>Analyze and improve existing data sources and metrics</li><li>Develop novel approaches to measuring and improving self-driving system</li><li>Closely collaborate with other teams to conduct system design, integration and testing<br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a M.S./Ph.D. program in Computer Science, Mathematics, Statistics or other related fields</li><li>Solid knowledge and proven practical experience in one or more of the following fields: data mining, anomaly detection, supervised learning, clustering, causal inference</li><li>Strong coding skills in Python<br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Publications in related conferences and/or journals</li><li>1-2 years academic or industrial experience in Data mining<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br>For immediate consideration email your resume to:<br><br>ml__ml_platform___internship_0895bf5c2us@ivy.greenhouse.io<br><br>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control\n      "
    },
    {
        "position": "Search - Research Intern",
        "company": "JD.COM ",
        "location": {
            "city": " Mountain View",
            "state": "CA"
        },
        "posted": "2021-08-04T18:48:38.490Z",
        "url": "https://www.linkedin.com/jobs/view/search-research-intern-at-jd-com-2688691495?refId=QAavKlCX9p1JWEkJi5lmcw%3D%3D&trackingId=HXecr3T5TGmFcwCz4OdunQ%3D%3D&position=15&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>Job Location: </strong>Mountain View, CA<br><br><strong>Job Type: </strong>Intern<br><br><strong>Department: </strong>Search<br><br><strong>Responsibilities:<br></strong><ul><li>Include but not limited the following three main directions:</li><li>Apply machine learning/Deep Learning models to improve search relevance</li><li>Collect training data from user logs and generate different kinds of data for model training </li><li>Work closely with engineering teams to implement algorithms into search system <br></li></ul><strong>Qualifications:<br></strong><ul><li>PhD in Computer science or a related major</li><li>Strong publication record on top conferences</li><li>Research experience in Machine learning, Information retrieval, or Data mining</li><li>Strong experience in C++/Java and Object-Oriented programming (OOP)</li><li>Familiar with at least one of scripting languages such as Python/Perl/Shell</li><li>Solid knowledge of Big Data concepts (Hadoop, Pig, Hive, etc.)</li><li>Excellent debugging and testing skills and problem solving skills</li><li>Excellent communication and presentation skills<br></li></ul><strong><u>About JD Search Team<br><br></u></strong>JD's search team is responsible for research and development of the search algorithms for all JD's search products. Search is the main entrance to JD's online retail business - the core business of JD.COM, and smart device business. The quality of search results plays a very important role to the online shopping experience of our customers, thus adding significant values to the success of the JD's online retail business. With the hundreds of millions of customers and items JD has, even a small improvement on the search algorithm may have great impact on the business and people's everyday life. By leveraging the state of the art machine learning/deep learning algorithms, we strive to understand the intent and behavior of our customers and to present the most relevant and personalized search results, allowing customers to make an informed purchase decision. We are recruiting talented experts to join our team to create the next generation of innovative and intelligent search products for JD.COM<br><br><em>JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.</em>\n      "
    },
    {
        "position": "ML Platform - Machine Learning Engineer Internship",
        "company": "TuSimple ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-09-01T18:48:48.915Z",
        "url": "https://www.linkedin.com/jobs/view/ml-platform-machine-learning-engineer-internship-at-tusimple-2705318519?refId=QAavKlCX9p1JWEkJi5lmcw%3D%3D&trackingId=aJS2aVAWr8rMTLI6Hm%2FKZA%3D%3D&position=21&pageNum=18&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><em>This opportunity is located in San Diego, CA. Remote friendly during COVID-19.<br><br></em></strong><strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong><u>Role Responsibilities<br></u></strong><ul><li>Work with massive datasets on data association, clustering, segmentation, filtering, and estimation</li><li>Analyze and improve existing data sources and metrics</li><li>Develop novel approaches to measuring and improving self-driving system</li><li>Closely collaborate with other teams to conduct system design, integration and testing<br></li></ul><strong><u>Experience &amp; Skills Required<br></u></strong><ul><li>Enrolled in a M.S./Ph.D. program in Computer Science, Mathematics, Statistics or other related fields</li><li>Solid knowledge and proven practical experience in one or more of the following fields: data mining, anomaly detection, supervised learning, clustering, causal inference</li><li>Strong coding skills in Python<br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Publications in related conferences and/or journals</li><li>1-2 years academic or industrial experience in Data mining<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br>For immediate consideration email your resume to:<br><br>ml__ml_platform___internship_0895bf5c2us@ivy.greenhouse.io<br><br>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control\n      "
    },
    {
        "position": "FinTech QA Tester Intern (US Only-Remote)",
        "company": "Token Metrics ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-07-05T18:49:32.665Z",
        "url": "https://www.linkedin.com/jobs/view/fintech-qa-tester-intern-us-only-remote-at-token-metrics-2660972393?refId=ckT89ESybjQ8WnWb3X%2BWaQ%3D%3D&trackingId=py2ngejKPeCWQTSN5nsNOg%3D%3D&position=23&pageNum=19&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        Token Metrics provides AI-based cryptocurrency ratings and price predictions. Our customers leverage our professional analysts, analytics, and artificial intelligence to become smarter crypto investors.<br><br>We are looking for a dedicated QA Tester intern to be responsible for designing and implementing test plans to improve the usability of our products. The QA Tester works with the development team to debug code, correct errors, and troubleshoot any issues with software code.<br><br>A successful QA Tester intern should be hard-working, have a strong working knowledge of software code and testing methodologies, and be a team player.<br><br>The duration of the Token Metrics internship program is 3 months. It is an evaluative unpaid internship with the possibility of return offers, depending on the company's needs.<br><br><strong> Responsibilities <br></strong><ul><li>Designing test plans, scenarios, scripts, and procedures.</li><li>Executing tests on source code.</li><li>Analyzing test results and reporting to the development team.</li><li>Working with the development team to correct bugs and errors.</li></ul>Requirements<br><ul><li>Pursuing a degree in Computer Science, Engineering, or related field.</li><li>A good working knowledge of test management software, programming languages, and QA methodologies.</li><li>Interest in QA testing.</li><li>Good team working and critical thinking skills.</li></ul>About Token Metrics<br><br>Token Metrics helps crypto investors build profitable portfolios using artificial intelligence based crypto indices, rankings, and price predictions.<br><br>Token Metrics has a diverse set of customers, from retail investors and traders to crypto fund managers, in more than 50 countries.\n      "
    },
    {
        "position": "Software Development Intern",
        "company": "Getman Corporation ",
        "location": {
            "city": " Bangor",
            "state": "MI"
        },
        "posted": "2021-08-20T18:49:44.672Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-intern-at-getman-corporation-2696028963?refId=v4pj7us0PTsW0fHjLeVBLA%3D%3D&trackingId=f7rM6T%2FUuChfUIX2eWtwrA%3D%3D&position=5&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong>POSITION: </strong>Software Development Intern<br><br><strong>LOCATION: </strong>Bangor and Kalamazoo, MI (split time between both locations)<br><br><strong><u>Job Summary<br><br></u></strong>This role will assist the IT team with various projects related to the creation of an Intranet.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Assist in the creation and implementation of a Getman Intranet CMS. </li><li>Assist with any other IT related tasks from time to time including user desktop support, software and hardware troubleshooting, documentation/document creation.</li><li>Maintain a positive working relationship with Getman Corporation employees to ensure a cooperative and productive working environment.</li><li>Drive to completion of project.</li><li>Performs other duties as assigned.<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Working towards a four-year bachelor’s degree from a university or college with an emphasis in IT, Computer Science, Software Engineering, etc. </li><li>Website design and development.</li><li>Knowledge of popular CMS preferred. </li><li>Knowledge of Php, Net Core and new technologies preferred. </li><li>Experienced with Microsoft Office. </li><li>Work independently or in a team setting.</li><li>Strong verbal and written communication skills.</li><li>Highly organized, ability to prioritize with high attention to detail.<br></li></ul><em>By submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message &amp; data rates may apply. Please refer to our privacy policy for more information.</em>\n      "
    },
    {
        "position": "Software Engineer Internship - Full Stack",
        "company": "TuSimple ",
        "location": {
            "city": " San Francisco",
            "state": "CA"
        },
        "posted": "2021-09-01T18:50:17.020Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-full-stack-at-tusimple-2705322236?refId=v4pj7us0PTsW0fHjLeVBLA%3D%3D&trackingId=5P2Fv%2BSXjPuTjtNyzbiThQ%3D%3D&position=25&pageNum=20&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a Full Stack engineer at TuSimple, you will work on both the back-end infrastructure and front-end Web UIs of various projects, from our offboard infrastructure services to the onboard system, to bring automation and visualization to the company. Your work will greatly improve the efficiency of the research of our algorithm scientists, and expedite the development of engineering infrastructure projects.<br><br>Example projects we are working on include:<br><ul><li>Building pipeline scheduling and execution platform, as well as the corresponding frontend to manage and interact with the platform, to do analysis of our simulations and datasets;</li><li>Developing on-premises cluster projects as well as utilizing public cloud computing infrastructure services;</li><li>Building front-end Web Interface for engineers and testops to control and monitor the onboard system, that visualize in real time, the perceived surroundings and decided routes of our autonomous driving system;</li><li>Building web-based tools to optimize the labelling of our datasets to greatly increase the efficiency and correctness; <br></li></ul><strong><u>Role Responsibilities<br></u></strong><ul><li>Discover and optimize performance bottlenecks in existing backend systems, such as database queries, storage solutions, to increase the responsiveness of user queries;</li><li>Architect, implement and maintain performant and scalable data processing backend systems that can handle tremendous amount of data generated daily;</li><li>Work with various teams globally, such as prediction, simulation and onboard runtime, to build web-based tools to facilitate their development lifecycle;</li><li>Work with SRE team to identify issues to increase the stability and performance of our private computing service<br></li></ul><strong>Experience &amp; Skills Required:<br></strong><ul><li>Enrolled in a MS/PhD program in Computer Science or related majors, or BS program with relevant internship experience </li><li>Experience with Python or C++ development</li><li>Experience with modern standard of Javascript development, with frameworks such as Node.js/npm, Vue.js, react.js, etc </li><li>Passionate about discovering drawbacks of existing systems and working with users to improve the experiences<br></li></ul><strong>Preferred Skills and Experience:<br></strong><ul><li>Experience with 3D Graphics (WebGL, OpenGL, three.js)</li><li>Experience with web frameworks such as Flask, Django</li><li>Experience with cloud services, such as AWS</li><li>Good understanding of containers, build systems, and infrastructure automation<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><strong><em>For immediate consideration, please send your resume to: <br><br></em></strong>ec__software_engineer_internship___full_stack_4bb598ed2us@ivy.greenhouse.io<br><br><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "Perception Engineer Intern",
        "company": "ISEE AI ",
        "location": {
            "city": " Cambridge",
            "state": "MA"
        },
        "posted": "2021-08-04T18:50:19.507Z",
        "url": "https://www.linkedin.com/jobs/view/perception-engineer-intern-at-isee-ai-2688692186?refId=3mdxj5%2FSg5t62g357lZRgw%3D%3D&trackingId=azQl3J%2B2Clw1audvnVw7cA%3D%3D&position=1&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        ISEE is seeking a Perception Engineer Intern to join our team.<br><br><strong> Role Responsibilities Include <br></strong><ul><li> Working on the intersection of sensing and perception algorithms.</li><li> Performing multimodal sensor calibration including but not limited to LiDARs, Cameras &amp; RaDARs.</li><li> Prototyping and deploying robust computer vision algorithms on ISEE’s vehicle fleet in areas of: Sensor calibration, localization and mapping, fusion, tracking and pattern recognition.</li><li> Hands-on experience with developing, training and deploying deep learning models in multimodal (sensors space and temporal) real world data.</li><li> Benchmarking and maintaining developed modules.</li><li> Work independently to deliver high-quality code in a timely fashion.</li><li> Collaborate with team for testing, evaluation and review of code.<br><br></li></ul><strong> Required Qualifications <br></strong><ul><li> Degree in Computer Science, Electrical Engineering, Robotics or related field.</li><li> Strong knowledge and experience in: signal processing, image processing, geometric computer vision, sensor fusion and deep learning.</li><li> Experience in deploying deep learning models at scale on real-world data in at least one of these deep learning frameworks: PyTorch, Tensorflow, CaffeStrong C++ and/or Python skills</li><li> Passionate about self-driving vehicles and real-world robotic solutions.</li><li> Strong presentation and communication skills.<br><br></li></ul><strong> Preferred <br></strong><ul><li> Publication record in top-tier computer vision or machine learning conferences.</li><li> 3+ yrs industrial experience in developing Computer Vision/Deep learning algorithms in real-world scenarios.</li><li> Robotics/autonomous experience is a plus.</li></ul>\n      "
    },
    {
        "position": "Software Engineer Internship - Full Stack",
        "company": "TuSimple ",
        "location": {
            "city": " Berkeley",
            "state": "CA"
        },
        "posted": "2021-09-01T18:50:25.214Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-full-stack-at-tusimple-2705316674?refId=3mdxj5%2FSg5t62g357lZRgw%3D%3D&trackingId=qS54YmPCXTA855TGdB0fiw%3D%3D&position=4&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong><em>Come join a higher calling and find a deeper purpose! <br><br></em>As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.<br><br>While inventing the framework of Autonomous Driving, our current fleet of autonomous trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.<br><br>TuSimple was founded in 2015 with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable <strong>Autonomous Freight Network.<br><br></strong><strong>Opportunity Overview:<br><br></strong>Artificial intelligence enabled automation is one of the biggest opportunities of our generation. Here at TuSimple, it is more than just an opportunity, it is our mission. Led by a group of elite researchers and engineers, we are working tirelessly to bring safe and reliable autonomous trucking to reality. This transformative endeavor can reduce energy consumptions in the trucking industry, make goods and services more affordable and efficient, and eventually, profoundly improve the quality of life of everyone, including you and I.<br><br>As a Full Stack engineer at TuSimple, you will work on both the back-end infrastructure and front-end Web UIs of various projects, from our offboard infrastructure services to the onboard system, to bring automation and visualization to the company. Your work will greatly improve the efficiency of the research of our algorithm scientists, and expedite the development of engineering infrastructure projects.<br><br>Example projects we are working on include:<br><ul><li>Building pipeline scheduling and execution platform, as well as the corresponding frontend to manage and interact with the platform, to do analysis of our simulations and datasets;</li><li>Developing on-premises cluster projects as well as utilizing public cloud computing infrastructure services;</li><li>Building front-end Web Interface for engineers and testops to control and monitor the onboard system, that visualize in real time, the perceived surroundings and decided routes of our autonomous driving system;</li><li>Building web-based tools to optimize the labelling of our datasets to greatly increase the efficiency and correctness; <br></li></ul><strong><u>Role Responsibilities<br></u></strong><ul><li>Discover and optimize performance bottlenecks in existing backend systems, such as database queries, storage solutions, to increase the responsiveness of user queries;</li><li>Architect, implement and maintain performant and scalable data processing backend systems that can handle tremendous amount of data generated daily;</li><li>Work with various teams globally, such as prediction, simulation and onboard runtime, to build web-based tools to facilitate their development lifecycle;</li><li>Work with SRE team to identify issues to increase the stability and performance of our private computing service<br></li></ul><strong>Experience &amp; Skills Required:<br></strong><ul><li>Enrolled in a MS/PhD program in Computer Science or related majors, or BS program with relevant internship experience </li><li>Experience with Python or C++ development</li><li>Experience with modern standard of Javascript development, with frameworks such as Node.js/npm, Vue.js, react.js, etc </li><li>Passionate about discovering drawbacks of existing systems and working with users to improve the experiences<br></li></ul><strong>Preferred Skills and Experience:<br></strong><ul><li>Experience with 3D Graphics (WebGL, OpenGL, three.js)</li><li>Experience with web frameworks such as Flask, Django</li><li>Experience with cloud services, such as AWS</li><li>Good understanding of containers, build systems, and infrastructure automation<br></li></ul><strong>Intern Perks</strong> <ul><li>Work with world class AI Engineers</li><li>Shape the landscape of autonomous driving</li><li>Work on significantly important and mission critical projects</li><li>Extensive individual support through TuSimple's Mentorship Program</li><li>Competitive salary</li><li>High full-time employment return rates after completion of Internship Program </li><li>Gym membership reimbursement</li><li>Monthly team building budget</li><li>Onsite Perks (These perks will only be applicable if the internship is onsite)</li><ul><li>Breakfast, lunch, and dinner served every day</li><li>Full kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and more<br></li></ul></ul>TuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.<br><br><em><strong>For immediate consideration, please send your resume to: <br><br></strong>ec__software_engineer_internship___full_stack_4bb598ed2us@ivy.greenhouse.io<br><br></em><em>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,</em>\n      "
    },
    {
        "position": "2022 IT Intern",
        "company": "Global Atlantic Financial Group ",
        "location": {
            "city": " New York",
            "state": "NY"
        },
        "posted": "2021-07-05T18:50:49.744Z",
        "url": "https://www.linkedin.com/jobs/view/2022-it-intern-at-global-atlantic-financial-group-2665605939?refId=3mdxj5%2FSg5t62g357lZRgw%3D%3D&trackingId=eQhFY9WC4SfeuDwhR9xGCw%3D%3D&position=19&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Company Overview<br><br></u></strong>Global Atlantic Financial Group is a leader in the U.S. life insurance and annuity industry, serving the needs of individuals and institutions. With differentiated investment and risk management capabilities, deep client relationships, and a strong financial foundation, the company has established a track record of delivering proven, value-added solutions and long-term growth. Global Atlantic is a majority-owned subsidiary of KKR, a leading global investment firm that offers asset management and capital markets solutions across multiple strategies.<br><br>Global Atlantic is looking for a diverse team of talented individuals who reinforce our culture of collaboration and innovation. We are dedicated to the career development of our people because we know they are critical to our long-term success. Join our team and come grow with us.<br><br><strong>GLOBAL ATLANTIC'S INTERNSHIP PROGRAM<br><br></strong>The Global Atlantic offers an immersive 10 week summer internship program that allows students to learn critical skills in a business setting. Our program runs from June 6, 2022 to August 12, 2022. We offer Executive Business Overviews, Networking Challenges, Social Events, interaction with senior leaders, meaningful work and so much more. We pride ourselves on offering a diverse and inclusive environment for all to succeed. We are thrilled that you have considered Global Atlantic in your Internship search.<br><br><strong><u>Position Overview<br><br></u></strong>The Risk and Investments IT Business Systems Developer Intern will perform business analysis, development and testing to deliver software applications, services, interfaces, ELT processes, reporting and other workflow and management initiatives. The role will work closing with business and IT teams to help define, design and build business enhancing software. The role will gain exposure to the modern SDLC principles, test driven development and source code reviews and change control standards in order to maintain compliance with policies. This role requires a highly motivated individual with strong will to enhance their technical ability, excellent communication and collaboration skills including the ability to develop and troubleshoot a diverse range of problems.<br><br><strong><u>Requirements<br></u></strong><ul><li>Pursuing a bachelor's degree in Computer Science or an Engineering discipline, or equivalent combination of education and experience; May 2023 graduates preferred</li><li>Organization, prioritization, attention to detail and the ability to work under pressure</li><li>Demonstrated ability to work effectively with customers, vendors, and co-workers</li><li>Enthusiasm for using various technologies as a tool to provide business solutions</li><li>A desire to learn about Investment and Risk Functions and spot opportunities for improvements through Technology</li><li>Self-motivated, resourceful, with independent working habits <br></li></ul><strong>Required Technical Qualifications and Experience:<br></strong><ul><li>Knowledge and exposure to Python and SQL</li><li>Some understanding of Investments front office and Risk</li><li>Some knowledge of investments with bonds, derivatives<br></li></ul><strong>Desired Technical Qualifications and Experience in order of importance:<br></strong><ul><li>Python</li><li>SQL</li><li>Unix</li><li>Knowledge of Cloud technologies would be a benefit<br></li></ul>Global Atlantic's total rewards package is reflective of our corporate values, particularly diversity, excellence and innovation, with a focus on inclusion, pay equity, and flexibility. We are proud to support your personal and professional growth and well-being through programs such as educational assistance, virtual physical therapy, remote/onsite fitness reimbursement, a medical second opinion program, pet insurance, military leave, parental leave, adoption assistance, fertility and family planning coverage. We strive to foster a culture of total well-being through community outreach and charitable giving programs.<br><br>Global Atlantic is committed to creating an inclusive environment where everyone feels like they can meaningfully contribute to our success. We are proud to be an equal opportunity employer and we do not discriminate in employment on any basis that is prohibited by federal, state or local laws. We encourage qualified applicants from all demographics to apply. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, or veteran status.<br><br><strong>This position is not eligible for visa sponsorship now or in the future.<br><br></strong>Global Atlantic Financial Company Employee Candidate Privacy Notice\n      "
    },
    {
        "position": "2022 Internship - Software Engineer, TRU Simulation + Training",
        "company": "Textron Aviation ",
        "location": {
            "city": " Tampa",
            "state": "FL"
        },
        "posted": "2021-08-20T18:50:52.258Z",
        "url": "https://www.linkedin.com/jobs/view/2022-internship-software-engineer-tru-simulation-%2B-training-at-textron-aviation-2688452463?refId=3mdxj5%2FSg5t62g357lZRgw%3D%3D&trackingId=PimpcpZblLZ6EugQPkn5ug%3D%3D&position=20&pageNum=21&trk=public_jobs_jserp-result_search-card",
        "lastScraped": "2021-09-03T18:35:42.363Z",
        "description": "\n        <strong><u>Job Summary<br><br></u></strong>Gain a technical foundation, acquire leadership skills, project management experience, and cross-functional process knowledge. The Software Engineer Internship will assist with the development, auditing, and documentation of key processes and workflows<br><br><strong><u>Job Responsibilities<br></u></strong><ul><li>Design, develop, integrate, test, and document flight simulator software</li><li>Work closely with engineers of varying disciplines to meet project requirements </li><li>Participate in engineering design reviews</li><li>Perform hardware/software integration &amp; testing on flight simulator training devices</li><li>Provide engineering staff with recommendations for software/hardware enhancements</li><li>Work on projects that have a measurable impact on our business </li><li>Research and analyze data, such as customer design proposal, specifications, and manuals to determine feasibility of design or application<br></li></ul><strong><u>Education<br></u></strong><ul><li>Pursuing a bachelor’s degree in Aerospace Engineering, Physics, Computer Engineering, Computer Science, or related field.<br></li></ul><strong><u>Experience/Qualifications<br></u></strong><ul><li>Excellent verbal and written communication skills</li><li>Professional and diplomatic demeanor</li><li>Strong sense of accountability and integrity</li><li>Strong problem-solving skills</li><li>Ability to deal with change and work in a dynamic environment<br></li></ul><strong><em>The above statements are intended to describe the general nature and level of work being performed by employees assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. <br><br></em></strong><strong>EEO Statement<br><br></strong>Textron is committed to providing Equal Opportunity in Employment, to all applicants and employees regardless of, race, color, religion, gender, age, national origin, military status, veteran status, handicap, physical or mental disability, sexual orientation, gender identity, genetic information or any other characteristic protected by law.<br><br><strong>Pay Transparency Policy Statement<br><br></strong>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise, have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.<br><br>Applicants selected will be subject to a government security investigation and must meet eligibility requirements, including US Citizenship, for access to classified information.<br><br><strong>Job Field<br><br></strong>Business Development<br><br><strong>Primary Location<br><br></strong>US-Florida-Tampa<br><br><strong><u>Recruiting Company<br><br></u></strong>Textron Aviation<br><br><strong>Schedule<br><br></strong>Full-time<br><br><strong>Job Level<br><br></strong>Individual Contributor<br><br><strong>Shift<br><br></strong>First Shift<br><br><strong>Job Posting<br><br></strong>08/23/2021, 4:05:02 PM<br><br>Textron (and its subsidiaries) participates in E-Verify. We will provide the U.S. Social Security Administration (SSA) and, if necessary, the U.S. Department of Homeland Security (DHS) with information from each new employer’s Form I-9 to confirm work authorization.\n      "
    }
]