[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-01-01T05:32:20.332Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=nQeD2L7Ba8z2Gdwxb3JepQ%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:20.332Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"
    },
    {
        "position": "Software - Applications Engineering Internship (Fall 2021)",
        "company": "Tesla",
        "location": {
            "city": "Fremont",
            "state": "CA"
        },
        "posted": "2021-01-08T05:32:20.904Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-fall-2021-at-tesla-2348468331?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=ck2Ku%2BzgXSBAXr1ohVOnNA%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:20.904Z",
        "description": "<em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br><br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br><br></u></strong><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li>"
    },
    {
        "position": "Internship Summer 2021 (Software Engineering / Data Science)",
        "company": "Amobee",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2021-01-08T05:32:21.502Z",
        "url": "https://www.linkedin.com/jobs/view/internship-summer-2021-software-engineering-data-science-at-amobee-2321946500?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=I0uXpuQQlalJoUwCjd3hHw%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:21.502Z",
        "description": "The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing, and has been named a Leader in Gartner’s Magic Quadrant. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation. Explore all of our notable Amobee Awards . We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee .<br><br><strong><u>Position Summary<br><br></u></strong>Amobee’s ACE (Amobee Career Exploration) Internship Program offers Technical Interns hands-on exposure to different areas of our business, specifically in the fields of Software Development, Data Science, DevOps Engineering, Technical Solutions Engineering, or Data Systems Engineering. We are currently seeking Technical Interns at our Redwood City location. As an ACE Intern you will be paired with an Advocate within the Engineering team who will oversee your professional development and project delivery. The Amobee ACE Internship will provide you with real-world, applied experience with a technology product company, tackling unique challenges that will position you well for your career ahead.<br><br><strong><u>Requirements<br></u></strong><ul><ul><li>Current student pursuing a Bachelor's, Master’s, or PhD degree in Computer Science, Data Science, Mathematics, Engineering or related field.</li><li>Minimum 3.0 GPA</li><li>Ability to work well in teams</li><li>Excellent understanding of Computer Science fundamentals</li><li>Core knowledge of at least one programming language (Java or Python preferred)Passionate about web-based applications</li><li>Excited by working in a fast-paced, collaborative environment<br><br></li></ul></ul><strong><u>Benefits Of Our Program<br></u></strong><ul><ul><li>Ability to observe and work with other team members, including leadership</li><li>Direct mentorship from an assigned Advocate</li><li>Endless opportunities to learn</li><li>Challenging work assignments</li><li>Potential Career opportunities upon graduation</li><li>Formal Training Programs, Social Events, and Community Outreach Programs<br><br></li></ul></ul><strong><u>About Amobee<br><br></u></strong>The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation, see all Amobee Awards. We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee<br><br>In addition to our great environment, we offer a competitive base salary, employee development programs and other comprehensive benefits. Please send a cover letter along with your resume when applying to the position of interest located at Amobee.com . We are an Equal Opportunity Employer. No phone calls and no recruiting agencies, please.<br><br>"
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "California ISO",
        "location": {
            "city": "Folsom",
            "state": "CA"
        },
        "posted": "2021-01-08T05:32:22.699Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-summer-2021-at-california-iso-2372891813?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=YgjsxpUGekF3ItEpQuzFZw%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:22.699Z",
        "description": "<strong><u>Job Description<br><br></u></strong><strong>What's In it for You<br><br></strong>Our purpose is to lead the way to tomorrow's energy network. Your work as an intern can impact millions of people who depend on electricity for their everyday lives.<br><ul><li>You will get \"real world\" experience to begin or further your career pursuits in the energy industry. This is a paid intern position for 10 -12 weeks during summer 2021.</li><li>You get to work on interesting and challenging assignments that will help grow your skill set.</li><li>You will work in an extremely collaborative environment inside our LEED certified Folsom, California campus.</li><li>Opportunities to interact with the CEO and the Executive team of the ISO</li><li>Invitations to seminars on the latest energy industry topics such as renewables, electric cars and micro grids.</li><li>Potential field trips.</li><li>Social activities with other interns such as barbecues and movie nights.</li><li>You get to work on our \"green\" LEED certified Folsom, California campus with some of the brightest people in the industry.<br><br></li></ul><strong><u>What You Will Be Doing<br><br></u></strong><em>Past Assignments have included work such as:<br></em><ul><li>Building new software tools in support of the reliable operation of the Grid and the energy markets we facilitate. You will learn more about smart grid technology, renewable resources, forecasting and the latest developments in energy industry. You will see ow the work you do this summer contributes directly to the success of the California Grid</li><li>Data validation and user acceptance testing (UAT), schedule and monitor processes necessary for calculation and publication of energy market settlement statements and invoices.</li><li>Development of enterprise-wide systems integration mapping, with database that links to interface specification. Interface with IT Architects, UML Modelers, and QA Leads to understand how to best depict these system-to-system interfaces to meet specific use cases.</li><li>Provide technical content and sample code for the ISO's developer.caiso.com website.</li><li>Document archiving solutions for new technologies as well as development of automation solutions.</li><li>Oracle Database/Storage task queue maintenance, documentation, create automation scripts for Oracle database admin tasks/storage procurement and document, create automated reports of daily DBA/Storage procedures, create standard monitoring scripts, generate capacity reports.</li><li>Projects to develop work products that will reduce processing time, enhance transparency or enhance capabilities in departments across the organization.<br><br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Level of Education and Discipline<br></strong><ul><li>Currently in a Bachelor's degree (BS) or Masters degree (MS) program in Computer Science, MIS or related field.</li><li>Graduating December of 2021 or later.<br><br></li></ul><strong><u>Amount Of Experience<br></u></strong><ul><li>Previous internships, research or work experience using economic analysis is desired.</li><li>Research and or studies in energy industry highly desired.<br><br></li></ul><strong><u>Type Of Experience<br></u></strong><ul><li>Proficient in Microsoft office suite.</li><li>Good presentation, oral and written communication skills highly desirable. </li><li>Must be able to work effectively in a team environment. </li><li>Excellent analytical and problems solving skills required. <br><br></li></ul><strong><u>Additional Skills And Abilities<br></u></strong><ul><li>Strong quantitative skills.</li><li>Competence in software such as R, Python, SQL, and Java desired but not required.<br><br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."
    },
    {
        "position": "Data Science Intern (Summer 2021)",
        "company": "Credit Karma",
        "location": {
            "city": "Charlotte",
            "state": "NC"
        },
        "posted": "2021-01-20T05:32:23.298Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-summer-2021-at-credit-karma-2388920987?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=iQtDhVjFQ68wUxrSEDcEuQ%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:23.298Z",
        "description": "Credit Karma is a mission-driven company, focused on championing financial progress for our more than 100 million members in the U.S., Canada and U.K. While we're best known for pioneering free credit scores, our members turn to us for tips as they work on their financial goals, including helping them monitor their credit, identity monitoring, searching for credit cards, shopping for loans (car, home and personal), and growing their savings* -- all for free. Credit Karma has grown significantly through the years: we've added more than 70 million members in the last five years alone and now have more than 1,100 employees across our offices in Oakland, Charlotte, Los Angeles and London.<br><br><li>Banking services provided by MVB Bank, Inc., Member FDIC<br><br></li>The Credit Karma Data Science Intern Program is a 12 week paid internship program located in Charlotte, NC. During your internship, you will be placed into a team where you will work on various projects to help Credit Karma fulfill its mission to make financial progress possible for everyone. Interns will have the opportunity to participate in weekly cohort meetings, team outings, events, and engage in discussions with Credit Karma leadership. If you want to be in a true learning environment and are eager to make an impact in your next internship, this is the place to be! We will equip you with the tools and relationship building techniques you need to be successful wherever life may take you.<br><br><em>Please note - our internship program will be located in Charlotte, NC. Should the internship need to be remote, we can only accommodate candidates working in </em><strong><em>California, North Carolina, Texas, Washington, Oregon, Nevada, Missouri, South Carolina, New York, Georgia, Colorado, Utah, Arkansas, and Washington D.C</em></strong><em>. <br><br></em><strong><u>What You'll Do<br></u></strong><ul> <li>Partner with colleagues throughout the organization to identify high-impact opportunities to leverage our extensive data to better serve our users in Personal Finance.</li> <li>Be responsible for accelerating revenue advancement through disruptive and continuous improvements in various data science models (targeting, approval odds, marketing campaigns, etc.), feature engineering including user profiles and behavior, personalization, etc.</li> <li>Participate in research efforts with other team members to explore the frontiers of Deep Learning, Recommender systems, Financial Assistant, and other areas, as they apply to Personal Finance.</li> <br><br></ul><strong><u>What's Great About The Role<br></u></strong><ul> <li>You will work with large scale Machine Learning Models to optimize for Personal Finance Products.</li> <li>You will work in a highly impactful team, who are working on large scale projects that directly impact the business and members.</li> <li>You will experience both personal and professional growth as you learn throughout the team.</li> <br><br></ul><strong><u>Minimum Basic Requirement<br></u></strong><ul> <li>Pursuing an Undergrad, Masters, or PhD Degree </li> <li>Majors: Statistics, Mathematics, or Computer Science</li> <li>General knowledge of Machine Learning</li> <li>Programming knowledge in Python, SQL</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Ambitious, results oriented, hardworking and creative thinker.</li> <li>Passionate about ML and big data</li> <li>Good knowledge of Python, R and SQL, as well as ML systems such as TensorFlow, Torch, etc.</li> <br><br></ul><strong>Equal Employment Opportunity<br><br></strong>Credit Karma is committed to a diverse and inclusive work environment. We believe that such an environment advances long-term professional growth, creates a robust business, and supports our mission of championing financial progress for everyone. We offer generous benefits and perks with a single eye to nourishing an inclusive environment that recognizes the contributions of all and fosters diversity by supporting our internal Employee Resource Groups. We’ve worked hard to build an intensely collaborative and creative environment, a diverse and inclusive employee culture, and the opportunity for professional growth. As part of the Credit Karma team, your voice will be heard, your contributions will matter, and your unique background and experiences will be celebrated.<br><br>Credit Karma is also proud to be an Equal Opportunity Employer. We welcome all candidates without regard to race, color, religion, age, marital status, sex (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity or gender expression, national origin, veteran or military status, disability (physical or mental), genetic information, or any other protected characteristic. We prohibit discrimination of any kind and operate in compliance with the San Francisco Fair Chance Ordinance.<br><br><strong>COVID-19 update: </strong>Protecting the health of our employees and the candidates interested in a career at Credit Karma is our top priority. We appreciate your understanding and being open and flexible with any changes related to our interviewing process.<br><br>Credit Karma is strongly committed to protecting personal data. Please take a look below to review our privacy policies:<br><ul> <li><strong>GDPR Privacy Policy</strong></li> <li><strong>California Consumer Privacy Act (CCPA)</strong></li></ul>"
    },
    {
        "position": "Software Engineer - Intern (Summer 2021)",
        "company": "C3 AI",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2021-01-21T05:32:23.812Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-summer-2021-at-c3-ai-2361762014?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=HWMpTO2aLMvx0u4QTyARpg%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:23.812Z",
        "description": "C3.ai is a leading enterprise AI software provider for accelerating digital transformation. The comprehensive and proven C3 AI Suite uses a model-driven abstraction layer to enable organizations to develop, deploy, and operate enterprise scale AI applications 40x to 100x faster than alternative approaches. www.c3.ai<br><br>We are looking for Software Engineers to join us during our <strong>Summer 2021 internship program</strong>. As a Software Engineer Intern, you will design and develop AI applications using the C3 AI Suite. AI Software Engineers may be assigned to work on our applications, platform, or forward deployed engineering teams. You will collaborate to do meaningful work while also growing your expertise.<br><br><strong><u>Your Responsibilities<br></u></strong><ul> <li>Design, develop, and maintain performant and scalable applications.</li> <li>Build and improve tools for internal C3 teams to understand and analyze large-scale data.</li> <li>Work closely with and incorporate feedback from Products and Engineering teams.</li> <li>Define and lead end-to-end development of applications.</li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li>Pursuing a Bachelor of Science or Master of Science in Computer Science, Computer Engineering, or related fields.</li> <li>Experience with JavaScript, Java, or other object-oriented programming language.</li> <li>Strong hands-on experience and understanding of object-oriented programming, data structures, algorithms, profiling &amp; optimization.</li> <li>Real passion for developing team-oriented solutions to complex engineering problems.</li> <li>Thrive in an autonomous, empowering and exciting environment.</li> <li>Great verbal and written communication skills to collaborate multi-functionally and improve scalability.</li> <li>Interest in committing to a fun, friendly, expansive, and intellectually stimulating environment.</li> <br></ul>C3.ai provides interns a competitive compensation package. At the office, we offer a fully stocked kitchen with catered breakfast and lunch, table tennis and pool table, free membership at our on-site gym, Friday evening social hours with food, drink and music and a fun team of great people.<br><br>C3.ai is proud to be an Equal Opportunity and Affirmative Action Employer. We do not discriminate on the basis of any legally protected characteristics, including disabled and veteran status."
    },
    {
        "position": "Software Development Engineer Intern - 2021",
        "company": "Apptio",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "posted": "2021-01-08T05:32:24.515Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-engineer-intern-2021-at-apptio-2372859162?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=UUNRBE98n1atM1WXamwa1w%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:24.515Z",
        "description": "<strong>You</strong>: You’re a student who wants to truly make an impact on an organization with your computer science background. You love to learn hands on and thrive in fast-paced environments that provide the opportunity for ongoing collaboration. <br><br><strong>Us</strong>: We are a high performance, customer-obsessed engineering team with a passion for innovation. We love to solve problems and find ways to advance the technology within our products every single day. Here at Apptio, we love to teach, develop our talent, and find ways to improve as a collective team.<br><br><strong><u>What We Want You To Do<br></u></strong><ul> <li>Participate in a 12-week long internship program beginning in May or June. </li> <li>Help to solve real business problems alongside our products &amp; engineering teams. </li> </ul><ul> <li>Partner with experienced software developers to complete and present a project. </li> <li>Foster professional development through mentorships, training activities, and opportunities to engage with company leadership. </li> <br><br></ul><strong><u>Basic Qualifications<br></u></strong><ul> <li>Pursuing or achieved BS or MS in Computer Science (or related technical discipline). </li> <li>Experience with object-oriented design and coding skills (Java and/or C/C++). </li> </ul><ul> <li>Experience in systems software or algorithms. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Experience with UI design and web-dev technologies. </li> <li>Experience working in a collaborative and fast paced environment. </li> <li>Desire and ability to pick up new technologies quickly and innovate. </li> </ul><ul> <li>Local to WA state candidate preferred.</li></ul>"
    },
    {
        "position": "Data Engineer Intern",
        "company": "Mercedes-Benz Research & Development North America, Inc.",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-01-08T05:32:24.933Z",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-intern-at-mercedes-benz-research-development-north-america-inc-2372442911?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=O%2BDiP6w6imIq%2FsvCd8G9dQ%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:24.933Z",
        "description": "Embedded in a worldwide network Mercedes-Benz Research &amp; Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.<br><br>You will be integrated in a multi-functional team with data engineers and data scientists to test, validate and monitor data platforms and the data flowing through them. This position supports a Mercedes-Benz Research &amp; Development North America (MBRDNA) team based in Silicon Valley. The team focuses on building comprehensive solutions to enable the collection and pipelining of both vehicle data and offboard data to generate business intelligence and data productization.<br><br><strong><u>Key Tasks &amp; Responsibilities<br></u></strong><ul><ul><li>Design, implement, and maintain scalable and robust frameworks, monitor infrastructure</li><li>Provide feedback and reporting on status of monitored services and inform partnering teams of issues or progress</li><li>Design and scale data infrastructure to allow for optimal data extraction, preparation and loading from multiple sources such as SQL and Azure</li><li>Build data and analytics tools that offer deeper insight into pipelines, allowing for critical discoveries surrounding key performance indicators and associated customer activity</li><li>The candidate will join the Connected &amp; Autonomous department which covers Research and Development in UX, Data, AI, and Autonomous Driving<br><br></li></ul></ul><strong><u>Required Qualifications<br></u></strong><ul><ul><li>Minimum level of education required and required field of study: Currently enrollment / recent completion of BS/MS program in Computer Science, related technical field of study</li><li>Knowledge in object-oriented programming (Python, Scala, or Java) Knowledge in SQL/NoSQL Able to learn quickly and willing to share knowledge Problem solving and communication skills with both technical and non-technical audiences</li><li>Will accept equivalent work experience in lieu of formal education<br><br></li></ul></ul><strong><u>Preferred Qualifications<br></u></strong><ul><ul><li>Data visualization (Tableau, Power BI, etc.)</li><li>Knowledge of Microsoft Azure</li><li>Knowledge of mining large data sets</li><li>Understand software development lifecycle and agile methodologies</li><li>Masters student / recent graduate in technical field<br><br></li></ul></ul><strong>Why should you apply?<br><br></strong>Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.<br><br>MBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.<br><br>MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.<br><br><em>Thank you for your interest in Mercedes-Benz Research &amp; Development North America. Please be aware the impact of COVID-19 could increase the amount of time it takes our HR and Hiring Team to process your application. We apologize for any inconvenience this may cause. We are dedicated to the health and safety of our employees and candidates. We appreciate your patience during this time.<br><br></em>Mercedes-Benz Research and Development North America, Inc.<br><br><strong>PRIVACY AGREEMENT FOR JOB APPLICANTS (Lever)<br><br></strong><u>Information on the processing and use of your data in the context of <br><br></u><u>submitting an application for employment.<br><br></u>This Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.<br><br>The Daimler Company and its affiliates that have advertised the vacancy <u>is responsible</u> for data processing. You will find the details in the job advertisement.<br><br>The <u>categories of data</u> that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for <u>special categories of personal data</u> (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.<br><br>We process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the <u>purpose</u> of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).<br><br>The <u>recipients</u> of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software.<br><br><strong><u>As An Applicant, You Have The Right<br><br></u></strong>To request information from the company your personal data it has stored.<br><br>To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.<br><br>To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.<br><br>To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.<br><br>To complain to the company if you believe that the processing of your personal data violates the law.<br><br><strong><u>Therefore, We Regularly Delete Your Personal Data As Follows<br><br></u></strong>The company limits the <u>storage</u> of your data to the period of time required by applicable law.<br><br>The application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months [MB1] .<br><br>You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.<br><br>Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.<br><br>The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.<br><br>A cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.<br><br>A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.<br><br>We collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.<br><br>We do not respond to browser \"do not track\" signals at this time.<br><br>If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship.<br><br><u><strong>PRIVACY NOTICE FOR CALIFORNIA RESIDENTS<br><br></strong></u><strong><u>Category Of Personal Information<br><br></u></strong>When you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:<br><br>identifiers<br><br><strong><u>Source(s)<br><br></u></strong>Directly from you<br><br><strong><u>Purpose(s)<br><br></u></strong>Determining eligibility for employment<br><br>Contacting you about future job opportunities<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Personal information categories listed in the California Customer Records statute (Cal. Civ. Code <li>1798.80(e))<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Geolocation data<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Professional or employment-related information<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong>Access</strong> : You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to <strong>‘Privacy Agreement for Job Applicants (Lever)’</strong> in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions.<br><br><u><strong>Changes to our Privacy Agreement<br><br></strong></u>Our business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.<br><br>This Privacy Agreement is effective on January 1, 2020.</li>"
    },
    {
        "position": "Computer Science/Computer Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "OH"
        },
        "posted": "2021-01-22T05:32:25.476Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-computer-engineering-intern-at-applied-optimization-2387909934?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=uxtTYe6cuWwSGiTjWJ9q9Q%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:25.476Z",
        "description": "<strong><u>Applied Optimization (AO) Job Description<br><br></u></strong>Job Title: Computer Science/Computer Engineering Intern<br>Reports to: Principal Scientist<br>FLSA Status: Part-Time (Non-Exempt)<br><br><strong><u>Position Objective<br><br></u></strong>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms in the areas of mechanical engineering or space science<br><br><strong><u>Essential Functions<br><br></u></strong>Aid in designing, building, testing, and implementing software applications for space science applications<br>Provide technical support for object modeling and algorithm development for new generation science applications<br>Perform verification, documentation, and quality assurance for new and existing software<br>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work<br>Other related duties as assigned<br><br><strong><u>Required Qualifications<br><br></u></strong>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record<br>General understanding of software development and knowledge of various coding languages<br>Attention to detail and effective time and schedule management skills<br>Effective organizing, planning, debugging, and problem-solving skills<br>Ability to adapt within a small team to support evolving customer requirements<br>Ability to execute instructions and communication in written, oral, and diagram form<br>Demonstrated strong writing, fact-gathering, and analytical skills<br>Basic computer and software skills including, but not necessarily limited to, Microsoft Office products (e.g., Outlook, Word, Excel, and Power Point)<br><br><strong><u>Preferred Qualifications<br><br></u></strong>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher<br>Minor or dual degree in mathematics, engineering, or physics/astronomy<br>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages<br>Knowledge or experience in CSS, Django, D3-data visualization, and Linux<br>Knowledge of computer operating systems<br>Ability to occasionally work 2nd shift<br><br><strong><u>Citizenship/Security Clearance Requirements<br><br></u></strong>U.S. Citizen or Green Card Holder<br>May be required to obtain and maintain U.S. Government Security Clearance<br><br><strong><u>About Our Internships<br><br></u></strong>Hours: The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the student’s class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.<br>About Us: Applied Optimization is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.<br><br><strong><u>Please Contact<br><br></u></strong>This job description is subject to change.<br><br>hr@appliedo.com"
    },
    {
        "position": "Data Science Intern",
        "company": "Capax Global, A Hitachi Group Company",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2021-01-15T05:32:25.910Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-capax-global-a-hitachi-group-company-2388788326?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=VHzfPCQDfPKOX5DRDBCx1g%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:25.910Z",
        "description": "Capax-Hitachi has a significant data analytics and management presence across many industries. Our Data Science Internship program is a 2.5month intensive data science and machine learning team-based intensive. You will be working on a streaming data solution that captures, stores, transforms, and models incoming data using cloud analytic tools. Our internship takes place in our downtown Chicago office in the historic Wrigley building, with some ability to work remote.Location: Chicago IL | RemoteTravel: None Timeframe: June - AugustResponsibilitiesDevelop and code models by applying algorithms to large structured. Develop visualizations to share analysis across a group of business users.Design strategies and propose algorithms to analyze and leverage data from the telemetry stream.Participate on a project team of specialists, data scientists, and business subject-matter experts to complete project deliverables and present a final showcase to senior leadership within Capax-Hitachi.QualificationsMust be seeking Bachelor’s or Master’s degree from an accredited college/university in Computer Science, Computational Linguistics, Statistics, Mathematics, Engineering, Bioinformatics, Physics, Operations Research or related technical fields.Knowledge of various modeling algorithms e.g. Classification, Regression, tree-based models, neural networks, clustering, PCA, and time series models.Some proficiency in R (e.g. ggplot2, cluster, dplyr, caret), Python (e.g. pandas, scikit-learn, bokeh, nltk), Spark – MLlib, H20; or other statistical tools.Knowledge of databases, data modeling.*** Strong curiosity and desire to learn*** Collaborative team player*** Communication skills"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Owego",
            "state": "NY"
        },
        "posted": "2021-01-08T05:32:26.326Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-lockheed-martin-2375175292?refId=b8fc1195-9a82-423d-912d-0a1ee595677c&trackingId=luwB%2BZSc%2B%2FcV3Ci3NImfdg%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-22T05:32:26.326Z",
        "description": "<strong>Description:</strong>Candidates pursuing bachelors or master’s degrees in computer science or software, computer or electrical engineering or related disciplines should explore the opportunities available in the Owego Software Engineering organization.<br><br>An intern in this position will work closely with a team of engineers on a formal government fixed or rotary wing aircraft contract or internal investment efforts in one or more of the following areas: military aircraft avionics, mission systems, sensor subsystems or mail handling systems, mission planning, simulation or automation.<br><br>Software Engineering tasks include: requirements analysis, design, code, software unit test, documentation review and update, testing of recent engineering releases, analysis &amp; documentation of problem trouble reports found during testing, providing written and verbal status of testing progress to the concurrent engineering team and providing suggestions for problem trouble report resolution.<br><br>Must be able to obtain an interim secret clearance prior to start, and must be able to obtain and maintain a security clearance.<br><br>2.5 GPA or higher preferred, but not required (Cumulative or Major GPA).<br><br><strong><u>Basic Qualifications<br><br></u></strong>Currently pursuing a BS or MS degree in Computer Science or Software, computer or electrical Engineering or related discipline<br><br>Must be able to obtain an interim secret clearance prior to start, and must be able to obtain and maintain a security clearance.<br><br>2.5 GPA or higher preferred, but not required (Cumulative or Major GPA).<br><br><strong><u>Desired Skills<br><br></u></strong>C/C++/C#, Java, Ada, LabView/LabWindows and/or Teststand.<br><br>Experience with embedded or Linux operating systems desired. Familiarity with object-oriented analysis/design and agile development is beneficial.<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern"
    }
]