[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2020-11-08T01:14:24.705Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=bCHvWVWjzm9VcwqwYn5bWA%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:24.705Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"
    },
    {
        "position": "Software - Applications Engineering Internship (Summer 2021)",
        "company": "Tesla",
        "location": {
            "city": "Fremont",
            "state": "CA"
        },
        "posted": "2020-12-03T01:14:25.155Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-summer-2021-at-tesla-2314382412?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=AIObgFFzbLwI3vIzmydHoA%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:25.155Z",
        "description": "<em>Disclaimer: This position is expected to start around May or June 2021 and continue through the entire Summer term (i.e. through </em><em>August or September)</em><em> or into early Fall 2021 if </em><em>available. We ask for a minimum of 12 weeks, </em><em>full-time, for most internships.<br><br></em><em>Please consider availability before submitting an application.<br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br><br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br><br></u></strong><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li>"
    },
    {
        "position": "Data Science Internship",
        "company": "Blizzard Entertainment",
        "location": {
            "city": "Irvine",
            "state": "CA"
        },
        "posted": "2020-12-05T01:14:25.561Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-internship-at-blizzard-entertainment-2314550022?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=7CbjF7x0m4X%2BNCT5PSfG5A%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:25.561Z",
        "description": "<strong><u>Job Title<br><br></u></strong>Data Science Internship<br><br><strong><u>Requisition ID<br><br></u></strong>R003193<br><br><strong><u>Job Description<br><br></u></strong><strong>DATA SCIENCE INTERN - GAME FRANCHISE ANALYTICS<br><br></strong>Greetings, students! We’re geared up here to offer another round of epic internship experiences in summer 2021. The internship program offers the opportunity to pause your studies for one summer and work side-by-side with Blizzard Entertainment employees in your area of interest, doing real work that oftentimes ends up in production. As such, we hold you to the same high standards as anybody else in the company.<br><br>Just like our gameplay experiences, Blizzard internships are a fully immersive experience. We want interns who are enthusiastic about what they want to do for a living and excited to come in every day to learn and contribute in this hyper-creative atmosphere. Being fully engaged with our team also means communicating effectively and maintaining an open mind - one that is receptive to feedback and able to adapt and grow. Your hobbies and interests can also play in your favor. Passion for technology, gaming, game development, and an in-depth knowledge of Blizzard games, products, and services will always be a plus with us, regardless of the position you’re applying for. Be passionate about who you are, be into our industry, and be willing to go all-in and embrace this opportunity to the fullest!<br><br><strong>QUEST OBJECTIVES<br><br></strong>We’re seeking post-graduate students to help us analyze and build data-powered products and services for Blizzard. Interns will follow the full end-to-end project model used by data scientists at Blizzard and have the opportunity to share their results with game and product teams. Intern projects are tailored to candidate strengths and fit to ongoing opportunities across game teams and Blizzard-wide services.<br><br>What’s life like as a data scientist and what can you expect? Whether working with game teams (e.g., Hearthstone, Overwatch, or WoW) or support teams (e.g., Battle.net or marketing) we regularly meet stakeholders to define and refine our project goals. From these goals we build and iterate on analytical models: pulling data, analyzing and testing assumptions, building models, and vetting the model conclusions. As we refine these models, services, or products we present the results to stakeholders, ultimately augmenting stakeholder decision-making (e.g., segmenting our player base) or delivering automated models (e.g., a matchmaking algorithm).<br><br>This position is a unique opportunity to work closely with game and product teams (designers, engineers, and analysts) to take your data science knowledge and turn it into analyses, products, or services impacting the games you love!<br><br><strong><u>Quest Requirements<br></u></strong><ul><li> Currently enrolled in a college or university</li><li> Returning for at least one more semester or quarter following the Summer 2021 internship</li><li> Able to work fulltime hours for 11 – 12 weeks at the Blizzard office indicated in this job posting between May 2021 – August 2021 or June 2021 – September 2021 (group dates depend on when you get out of school)</li><li> Authorized to work in the US<br></li></ul><strong><u>Level Requirements<br></u></strong><ul><li> Pursuing a Masters or PhD in computer science, statistics, math, or related quantitative fields (e.g., economics, physics, psychology)</li><li> Experience building and evaluating machine learning or statistical models</li><li> Passion for gaming!</li><li> Proficient in R, Python, or related programming languages</li><li> Strong written and spoken communication skills<br></li></ul><strong>RECOMMENDED TALENTS<br></strong><ul><li> Database querying (e.g., SQL, HiveQL)</li><li> Data visualization (e.g., R plotting, matplotlib, Tableau)</li><li> Accomplished in Blizzard games (e.g., 12 wins in Hearthstone arena, Diamond rank in Overwatch, or max-level in WoW)<br></li></ul><strong>QUEST ITEMS<br></strong><ul><li> Resume</li><li> Cover Letter<br></li></ul><strong>WARNING! Applications that do not include all of the required materials will not be considered. We’re serious about this – due to the volume of applications we receive, we only have time to consider complete submittals.<br><br></strong>Blizzard Entertainment is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veteran status, or any other basis protected by applicable law, and will not be discriminated against on the basis of disability.<br><br>Blizzard Entertainment is a global company committed to growing our employees along with the business. We offer generous benefits and perks with an eye on providing true work / life balance. We’ve worked hard to foster a deeply collaborative and creative environment, a diverse and inclusive employee culture, and training and opportunity for professional growth. Our people are everything. Our core values are real, and our mission has never changed. We are dedicated to creating the most epic entertainment experiences…ever. Join us!"
    },
    {
        "position": "Programmer - Intern",
        "company": "Cognizant",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-06T01:14:25.960Z",
        "url": "https://www.linkedin.com/jobs/view/programmer-intern-at-cognizant-2316135014?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=ao9N%2Fad9faHnolyCuynUnw%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:25.960Z",
        "description": "Cognizant Softvision seeks an intern with experience in software design, coding and debugging. The intern will gain exciting real-world software engineering experience at a thriving company.<br><br>We frequently work in small teams to solve problems, explore new technologies, and learn from one another. The ideal intern for this environment will be enthusiastic and collaborative.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Document and test new software applications</li><li> Assess new application ideas</li><li> Develop applications (coding, programming)</li><li> Test and release applications<br></li></ul><strong><u>Requirements<br></u></strong><ul><li> Computer Science/Network Engineering, Engineering, or Mathematics major</li><li> Excellent analytical and mathematics skills</li><li> Ability to work in teams</li><li> Experience programming in Javascript, HTML, CSS, React.js<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Practical experience with a wide variety of software engineering tasks</li><li> Collaborating hand-in-hand with skilled teams of software engineers</li><li> Shadowing, mentoring, and training opportunities with seasoned professionals</li><li> Opportunity to participate in networking events and company meetings</li><li> Flexible schedule for students</li><li> Compensation available<br></li></ul>Employee Status : Full Time Employee<br><br>Shift : Day Job<br><br>Job Posting : Dec 05 2020<br><br><strong><u>About Cognizant<br><br></u></strong>Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.<br><br>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.<br><br>Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br><br>If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information."
    },
    {
        "position": "Software Engineer in Test (Intern)",
        "company": "ASML",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2020-12-01T01:14:26.375Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-in-test-intern-at-asml-2316169867?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=rJr260M5wdQFMoAZzZVneg%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:26.375Z",
        "description": "<strong>Introduction<br></strong>ASML US brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Chandler Arizona, San Jose and San Diego California, Wilton Connecticut, and Hillsboro Oregon.<br><strong>Job Mission<br></strong>We are looking for a highly talented individual to join our software quality assurance team.<br><br><strong><u>Job Description<br><br></u></strong>In this position, you will be participating the project involving test design, test execution and test report and learn the test methodologies and test automation for the ASML world-class products. You will have the opportunity to work with software developers, hardware engineers and the application engineering organization on a regular basis.<br><br><strong>Education<br></strong>Student pursuing advanced degree in Computer Science, Electrical Engineering, Mathematics, Applied Mathematics, Physics, Applied Physics, or any related engineering or equivalent experiences.<br><br><strong><u>Experience<br></u></strong><ul><li>Knowledge of operating system, relational database, concurrent computing,<br></li></ul>client/server architecture, network protocols, and file system management.<br><ul><li>Knowledge of software lifecycle and quality engineering methodology</li><li>Good numerical analysis and logic thinking skills</li><li>Familiar with programming languages Python, C/C++,Java, Perl or shell scripting<br></li></ul><strong><u>Personal Skills<br></u></strong><ul><li>Excellent problem solving and trouble shooting skills</li><li>Ability to excel in cross functional, team environment<br></li></ul><strong>Context of the position<br></strong>This position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings. The physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described.<br><br><strong><u>Other Information<br><br></u></strong>EOE AA M/F/Veteran/Disability<br><br>"
    },
    {
        "position": "Software Engineering Internship, Summer 2021",
        "company": "Rubrik, Inc.",
        "location": {
            "city": "Palo Alto",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:26.789Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-internship-summer-2021-at-rubrik-inc-2311495411?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=ruGfGQ6SrecbzTtZ%2BxQIHw%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:26.789Z",
        "description": "Interested in our Remote Software Engineering Internship?<br><br>Work on the next-generation of technology that will change how businesses around the world manage and unlock value from their data. Rubrik is the leader in the cloud data management space. We're revolutionizing how businesses protect, search, secure, and analyze all of their data with simple and scalable solutions. As cloud infrastructure continues to grow at an astounding rate, we’ll be solving some of it’s most interesting challenges while building a product unlike anything seen before. This is an exciting challenge with opportunities in search, analytics, scalable systems and much more! We’re just getting started so there is a lot of opportunity for personal growth and contribution.<br><br>Rubrik partners with universities around the world to offer the next class of interns an opportunity to make an impact from day one! This is a full-time (40-hrs per week) internship during the summer of 2021 running approximately 12 weeks from early June thru early September. You will work on real projects and be mentored by our senior team members to support your career development and experience.<br><br>We're looking for interns who are curious, who want to be entrusted with real responsibility and <strong>embrace the opportunity to write code that will ship</strong>. You'll be a full member of the engineering team and learn from our incredible engineers while making a measurable impact. Our Engineering teams are building and maintaining multiple products at Rubrik. These teams have clear ownership over features &amp; products ensuring they have all the context to make impactful decisions. Some product teams are full stack, while others are specialized either in back-end, or front-end. Teams are utilizing code reviews, pair programming and tech talks for ensuring engineering growth, collaboration and mentoring. Check out our engineering blog to learn more about what our engineers are working on and to see where you could fit in.<br><br><strong><u>Desired Requirements<br></u></strong><ul> <li>Currently pursuing a BS, MS, or PhD in Computer Science or a related field</li> <li>Strong understanding of computer science fundamentals, algorithms, best practices, and logical skills</li> <li>Strong coding capability</li> <li>Good team player and exceptional communicator</li> <li>Ability to thrive in a fast-paced environment</li> <li>Ability to research, learn and become proficient in new technologies</li> <br><br></ul><strong><u>What You Will Do<br></u></strong><ul> <li>Experience first hand working at a market leading cloud data management company</li> <li>Work closely with a mentor on a specific project important to Rubrik’s overall goals</li> <li>Be part of a team of engineers that share and learn from each other</li> <li>Show off your work with a presentation on your project at the end of your internship</li> <li>Have a great time and make relationships with people that will last your entire career!</li> <br><br></ul><strong><u>About Rubrik<br><br></u></strong>Rubrik is one of the fastest growing companies in Silicon Valley, revolutionizing data protection and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup.<br><br><em>Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em>"
    },
    {
        "position": "Software Development Engineer Intern - 2021",
        "company": "Apptio",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "posted": "2020-12-03T01:14:27.434Z",
        "url": "https://www.linkedin.com/jobs/view/software-development-engineer-intern-2021-at-apptio-2316124917?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=7094ca548Y%2BzOjlWV3TbZQ%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:27.434Z",
        "description": "<strong>You</strong>: You’re a student who wants to truly make an impact on an organization with your computer science background. You love to learn hands on and thrive in fast-paced environments that provide the opportunity for ongoing collaboration. <br><br><strong>Us</strong>: We are a high performance, customer-obsessed engineering team with a passion for innovation. We love to solve problems and find ways to advance the technology within our products every single day. Here at Apptio, we love to teach, develop our talent, and find ways to improve as a collective team.<br><br><strong><u>What We Want You To Do<br></u></strong><ul> <li>Participate in a 12-week long internship program beginning in May or June. </li> <li>Help to solve real business problems alongside our products &amp; engineering teams. </li> </ul><ul> <li>Partner with experienced software developers to complete and present a project. </li> <li>Foster professional development through mentorships, training activities, and opportunities to engage with company leadership. </li> <br><br></ul><strong><u>Basic Qualifications<br></u></strong><ul> <li>Pursuing or achieved BS or MS in Computer Science (or related technical discipline). </li> <li>Experience with object-oriented design and coding skills (Java and/or C/C++). </li> </ul><ul> <li>Experience in systems software or algorithms. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Experience with UI design and web-dev technologies. </li> <li>Experience working in a collaborative and fast paced environment. </li> <li>Desire and ability to pick up new technologies quickly and innovate. </li> </ul><ul> <li>Local to WA state candidate preferred.</li></ul>"
    },
    {
        "position": "Data Science Intern",
        "company": "Unity Technologies",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:27.855Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-unity-technologies-2298618106?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=ke%2FuK%2Bwesr8dQH%2F5TteJ%2Fg%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:27.855Z",
        "description": "We are looking for a Data Science Intern to join our data science team for the summer! Data is the foundation of our business in Monetization@Unity, and we harness it to solve business problems for multiple teams and products. We analyze large volumes of data, applying statistical techniques to extract insights and to inform decisions. We develop and implement machine learning models into production and intuitively make decisions around what approaches to take in solving hard problems.<br><br>Among some of the problems we solve are fraud prevention and detection, increasing Unity advertiser retention, improving supply quality, and working with our partners to quickly respond to rapidly evolving threats!<br><br><strong><u>Responsibilities<br><br></u></strong><ul> <li>Develop machine learning models to solve important business problems</li> <li>Work with Data Scientists and Engineers to deploy models to a production environment</li> <li>Think creatively and to be able to test out and iterate new ideas rapidly</li> <li>Effectively communicate technical concepts and analyses to stakeholders</li> <br><br></ul><strong><u>Requirements<br><br></u></strong><ul> <li>Working towards a degree in Data Science, Analytics, Statistics, Computer Science or other quantitative discipline</li> <li>Python, SQL, and scikit learn </li> <li>Understanding of machine learning concepts and applying them</li> <br></ul><strong>Bonus points<br></strong><ul> <li>Experience with Tensorflow or Pytorch</li> <li>Experience with big data (Spark)</li> <br><br></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>"
    },
    {
        "position": "Intern Bachelors Software Engineer",
        "company": "Honeywell",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2020-11-22T01:14:28.225Z",
        "url": "https://www.linkedin.com/jobs/view/intern-bachelors-software-engineer-at-honeywell-2330594230?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=KMtc17fIqLja%2BxV%2FcV0w5A%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:28.225Z",
        "description": "Design solutions to drive safe living and quality of life<br><br>The future is what you make it.<br><br>When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all our employees enjoy access to dynamic career opportunities across different fields and industries.<br><br>Are you ready to help us make the future?<br><br>Join a team that designs, develops and integrates highly complex software applications within Honeywell. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.<br><br>Use your skill set to provide value added software features to our products for our customers.<br>Accelerate innovation and growth, teaming with the world's most talented engineers.<br><br>We invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for!<br><br><strong>YOU MUST HAVE<br><br></strong><li> Currently pursuing a Bachelor’s or Master’s degree from an accredited college or university in Software Engineering or Computer Science</li><li> Must graduate after December 2021</li><li> Must continue enrollment in degree program upon completion of the internship<br><br></li><strong>WE VALUE<br><br></strong><li> Understanding various software development lifecycle</li><li> Demonstrate the ability to develop efficient and high-quality software</li><li> Knowledge of software configuration management and change management practices</li><li> Diverse and global teaming and collaboration</li><li> Excellent oral and written communication skills</li><li> Effective communicator</li><li> Can quickly analyze, incorporate and apply new information and concepts</li><li> Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness</li><li> Validated academic excellence (3.0 GPA and higher)<br><br></li>Additional Information<br><br><ul><li><strong>JOB ID: </strong>req241710</li><li><strong>Category: </strong>Engineering</li><li><strong>Location: </strong>715 Peachtree Street, N.E.,Atlanta,Georgia,30308,United States</li><li>Nonexempt<br></li></ul>Engineering (GLOBAL)<br><br>Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."
    },
    {
        "position": "Intern, SW Engineering",
        "company": "Mercedes-Benz Research & Development North America, Inc.",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2020-12-02T01:14:28.583Z",
        "url": "https://www.linkedin.com/jobs/view/intern-sw-engineering-at-mercedes-benz-research-development-north-america-inc-2320477829?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=YaW8ZE%2FhnuMtjVkl8NXiTg%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:28.583Z",
        "description": "Embedded in a worldwide network Mercedes-Benz Research &amp; Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.<br><br>During your internship you will be supporting engineering projects for voice applications in Daimler ecosystems and vehicles. You will be responsible for prototype software and contribute to feature and functional specifications.<br><br><strong><u>Key Tasks &amp; Responsibilities<br></u></strong><ul><ul><li>Software Development and testing of progressive and regressive features for the Digital Voice Assistants (Amazon Alexa, Google Assistant Mercedes me integration)</li><li>Conceptualize, develop and write software architectures and implementations for IoT technologies</li><li>Document technical software solutions or specifications</li><li>Coordinate and participate testing, validation, debugging of software and system architecture</li><li>Collaborate with other engineers, designers and user experience experts to find solutions software implementation and integration tasks</li><li>Develop new software prototypes and mass production frameworks</li><li>Integrate and test software in prototyping cars or demonstration hardware</li><li>Actively demonstrate cross-functional collaboration with other engineers, designers, user experience experts and researchers<br><br></li></ul></ul><strong>Minimum level of education required and required field of study:<br></strong><ul><ul><li>Enrolled in a Bachelor’s degree in Software/Computer Engineering or Engineering and Natural Science with additional Computer Science knowledge (or equivalent)<br><br></li></ul></ul><strong><u>Minimum Skills Required<br></u></strong><ul><ul><li>Strong understanding of operating systems and computer architecture fundamentals. Java or JavaScript / NodeJS, RESTful API, MySQL, NoSQL. </li><li>Experience in iOS or Android apps development. </li><li>Experience integrating 3rd party API/SDK in iOS/Android Apps. </li><li>Ability to analyze complex problems, recognizes and explains connections between cause-and-effect understandably and develops concrete, viable solutions taking risks and obstacles into account. </li><li>Ability to work in inter-cultural, inter-disciplinary teams across multiple time zones. </li><li>Able to learn quickly and willing to share knowledge. </li><li>Attention to detail, Strong Team player. </li><li>Open to international travel, for approximately 10% of the time.</li><li>Will accept equivalent work experience in lieu of formal education: No</li><li>Minimum years of experience required (Non-exempt positions only): 0 years</li><li>Combination of Degree and Years of experience acceptable (minimum) : Associates</li><li>Other licenses or certifications required : Valid US Driver License<br><br></li></ul></ul><strong><u>Preferred Qualifications<br></u></strong><ul><ul><li>Good Knowledge about Digital Voice Assistants (Google Assistant, Amazon Alexa, Apple Siri and others)</li><li>Understanding of design patterns and software architecture</li><li>Multiple apps published in Apple and Google app stores</li><li>Java, C/C++, JavaScript, Python, Swift, Objective-C</li><li>Experience with location based services</li><li>Knowledge in Backend and embedded car system technologies<br><br></li></ul></ul><strong>Why should you apply?<br><br></strong>Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.<br><br>MBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.<br><br>MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.<br><br><em>Thank you for your interest in Mercedes-Benz Research &amp; Development North America. Please be aware the impact of COVID-19 could increase the amount of time it takes our HR and Hiring Team to process your application. We apologize for any inconvenience this may cause. We are dedicated to the health and safety of our employees and candidates. We appreciate your patience during this time.<br><br></em>Mercedes-Benz Research and Development North America, Inc.<br><br><strong>PRIVACY AGREEMENT FOR JOB APPLICANTS (Lever)<br><br></strong><u>Information on the processing and use of your data in the context of <br><br></u><u>submitting an application for employment.<br><br></u>This Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.<br><br>The Daimler Company and its affiliates that have advertised the vacancy <u>is responsible</u> for data processing. You will find the details in the job advertisement.<br><br>The <u>categories of data</u> that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for <u>special categories of personal data</u> (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.<br><br>We process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the <u>purpose</u> of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).<br><br>The <u>recipients</u> of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software.<br><br><strong><u>As An Applicant, You Have The Right<br><br></u></strong>To request information from the company your personal data it has stored.<br><br>To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.<br><br>To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.<br><br>To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.<br><br>To complain to the company if you believe that the processing of your personal data violates the law.<br><br><strong><u>Therefore, We Regularly Delete Your Personal Data As Follows<br><br></u></strong>The company limits the <u>storage</u> of your data to the period of time required by applicable law.<br><br>The application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months [MB1] .<br><br>You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.<br><br>Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.<br><br>The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.<br><br>A cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.<br><br>A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.<br><br>We collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.<br><br>We do not respond to browser \"do not track\" signals at this time.<br><br>If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship.<br><br><u><strong>PRIVACY NOTICE FOR CALIFORNIA RESIDENTS<br><br></strong></u><strong><u>Category Of Personal Information<br><br></u></strong>When you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:<br><br>identifiers<br><br><strong><u>Source(s)<br><br></u></strong>Directly from you<br><br><strong><u>Purpose(s)<br><br></u></strong>Determining eligibility for employment<br><br>Contacting you about future job opportunities<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Personal information categories listed in the California Customer Records statute (Cal. Civ. Code <li>1798.80(e))<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Geolocation data<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong><u>Category Of Personal Information<br><br></u></strong>Professional or employment-related information<br><br><strong><u>Categories Of Third Parties With Whom We Share<br><br></u></strong>Third party service providers who help us perform administrative employment services, such as background check providers.<br><br>Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders.<br><br><strong>Access</strong> : You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to <strong>‘Privacy Agreement for Job Applicants (Lever)’</strong> in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions.<br><br><u><strong>Changes to our Privacy Agreement<br><br></strong></u>Our business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.<br><br>This Privacy Agreement is effective on January 1, 2020.</li>"
    },
    {
        "position": "2020 Technology Internship (Computer Science)",
        "company": "T Mobile Club",
        "location": {
            "city": "Bellevue",
            "state": "WA"
        },
        "posted": "2020-12-02T01:14:28.924Z",
        "url": "https://www.linkedin.com/jobs/view/2020-technology-internship-computer-science-at-t-mobile-club-2324715947?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=%2FGzM5kon1%2BZdNk8LFVtDcA%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:28.924Z",
        "description": "Are you ready for a challenge that could launch your career? T-Mobile is revolutionizing the wireless industry for millions of customers nationwide. Working here means rolling up your sleeves and disrupting the status quo with a team that has your back every step of the way.<br><br>You're invited to be an Intern with our Technology Team.<br><br>This is a 12-week paid learning experience with our army of project managers, web developers, and engineers, all working like a well-oiled machine to keep our network running and our customers connected.<br><br>The amazing technology that powers everything we do. The code that makes it all run smoothly. Mobile changes by the minute, and as the leaders in our industry, we're setting the pace. This is teamwork at its best with technical warriors bravely pushing the edges of the wireless frontier. If the cutting edge of technology sounds like the place for you, then you're in the right place.<br><br>And all of this awesome work doesn't just take place just at our headquarters campus in Bellevue, WA and surrounding cities of Bothell and Snoqualmie. Our tech teams are also located nationwide in cities such as Atlanta, GA, Dallas, TX, Concord, CA, Parsippany, NJ and many more field locations.<br><br><strong><u>Responsibilities<br><br></u></strong>Working as an Intern on our Technology Team means everything from reporting, data and process analysis, partnering with the market engineering site development team in building/upgrading wireless sites, real time subscriber services and integrating services onto T-Mobile's IP network to engineering design, device performance testing, radio access network evolution, security infrastructure and network support (just to name a few).<br><br>You'll contribute your creativity and great ideas, working alongside innovative colleagues and mentors who will push you to be your very best. We'll give you hands-on projects and the chance to make an immediate impact. Here are some of the roles you could have as a Computer Science focused Intern with our Technology Team...<br><ul> <li>Project/Program Management</li> <li>Software Development</li> <li>Software Testing</li> <li>Systems Design</li> <li>Systems Architecture</li> <li>Software Engineer</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>You're currently enrolled in college and pursuing a Bachelor's, Master's, or MBA degree with a Business, Computer Science, Electrical Engineering, Information Security, Information Technology, Mathematics, Project Management, Statistics or Telecommunications focus.</li> <li>You're a self-starter with a passion for learning who is not afraid to ask questions.</li> <li>Things change and move pretty fast on this team and your ability to quickly adapt, change direction and think on your feet without missing a beat is essential.</li> <li>You share our Un-carrier® spirit. This is about breaking rules, paving our own path and making things better for our customers - and each other.</li> <br></ul><strong>Being an Intern<br><br></strong>Our Internship Program takes place over the summer running 12 weeks from May/June to August/September. As an Intern, you'll receive competitive pay, relocation benefits (if eligible), a world class learning experience, and the support of a team that believes in your potential. You'll also have plenty of opportunities to meet and network with other interns, fellow team members, and top leaders from all business functions across the company as you make connections that will last your career.<br><br>A big part of our culture is about embracing our Magenta spirit. And we'll ask you to do the same. Check out #BeMagenta and #UofMagenta to see how we work together to take care of our customers and each other every day.<br><br><strong>Recruiting Timeline<br><br></strong>Recruiting for the 2020 internship program takes place from September 2019 through March 2020. We'll be visiting campuses across the country and attending national recruiting conferences in September through November. We'll be connecting with candidates and begin screening in January. If we think you're a good fit for one of our roles, we'll contact you directly to discuss next steps. Interviews will start to take place in late January and all internships will be filled by the end of March.<br><br><strong>Application Process<br><br></strong>Select the job posting that best matches your interests, education and experience and click apply. We'll then review your application. If we think you're a good fit for one of our roles, we'll contact you directly to discuss next steps.<br><br><strong><u>Minimum Qualifications<br></u></strong><ul> <li>At least 18 years of age.</li> <li>Legally authorized to work in the United States.</li> <li>High School Diploma or GED.</li> <li>Pre-employment background screen.</li> <br><br></ul><strong><u>Company Profile<br><br></u></strong>As America's Un-carrier, T-Mobile USA, Inc. (NASDAQ: \"TMUS\") is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The company's advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile USA. Inc. provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com<br><br><strong>EOE Statement<br><br></strong>We Take Equal Opportunity Seriously - By Choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law."
    },
    {
        "position": "2021 Summer Internship - IT and Computer Science",
        "company": "Barrick Gold Corporation",
        "location": {
            "city": "Elko",
            "state": "NV"
        },
        "posted": "2020-12-01T01:14:29.291Z",
        "url": "https://www.linkedin.com/jobs/view/2021-summer-internship-it-and-computer-science-at-barrick-gold-corporation-2329190608?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=F6rzPN5WLq278qjhGqtYRw%3D%3D&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:29.291Z",
        "description": "<strong><u>Position Description<br><br></u></strong>At Nevada Gold Mines, our vision is to be the world’s most valued gold mining business by finding, developing and operating the best assets with the best people. At Nevada Gold Mines we are committed to a safe work environment sending every person home safe and healthy every day and leaving a sustainable legacy on our host communities. We will be notifying candidates of our selections starting Jan 2021<br><br><strong><u>Responsibilities<br><br></u></strong>Our interns will have an opportunity to complete challenging and rewarding projects in their field of study, working side by side with our professionals in the field. By applying for an internship opportunity, you may be considered for an internship at any one of our Nevada Gold Mines locations.<br><br><strong><u>Qualifications<br></u></strong><ul> <li>Must be able to complete an internship lasting a minimum of ten (10) weeks between May 1 and September 1, 2021.</li> <li>Must be enrolled in school for the Fall 2021 semester (proof of enrollment required).</li> <li>Must have a cumulative GPA of 3.0 or higher (transcripts required).</li> <li>Must be able to pass Nevada Gold Mines’ pre-employment physical, which includes drug and alcohol testing as well as metals testing (where applicable).</li> <br><br></ul><strong><u>What We Can Offer You<br></u></strong><ul> <li>Ability to make a difference and lasting impact</li> <li>Work in a dynamic, collaborative, progressive, and high-performing team</li> <li>An Opportunity to transform Traditional Mining into the future of Digital Mining</li> <li>Opportunities to grow and learn with the industry colleagues are endless</li> <li>Access to a variety of career opportunities across Nevada Gold Mine locations</li> <li>Nevada Gold Mines is committed to creating a diverse environment and is proud to be an equal opportunity employer</li> <br><br></ul><strong><u>About Nevada Gold Mines<br><br></u></strong>Nevada Gold Mines is a joint venture between Barrick Gold Corporation (61.5%) and Newmont Goldcorp Corporation (38.5%), combining their significant assets across Nevada to create the single largest gold-producing complex in the world and realize the full potential of these mines through synergies and best-in-class operational improvements.<br><br>The massive mining operation comprises 8 mines along with their associated infrastructure and processing facilities that produced an estimated 4 million ounces of gold in 2018. Three of these assets are Tier One gold mines: Barrick’s Cortez; the combination of Barrick’s Goldstrike and Newmont Goldcorp’s Carlin; and the combination of Barrick’s Turquoise Ridge and Newmont Goldcorp’s Twin Creeks. In addition, Barrick’s Goldrush-Fourmile project has the potential to become the fourth Tier One asset in this portfolio. The new JV is expected to generate around $5 billion in cost savings over the next five years. Nevada Gold Mines is operated by Barrick.<br><br><em>Thank you for your application, however, only those selected for an interview will be contacted.</em>"
    },
    {
        "position": "Software Analytics Intern",
        "company": "Altair",
        "location": {
            "city": "Troy",
            "state": "MI"
        },
        "posted": "2020-11-08T01:14:29.628Z",
        "url": "https://www.linkedin.com/jobs/view/software-analytics-intern-at-altair-2329347497?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=38hm17gfhQfrSVweUKCQUQ%3D%3D&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:29.628Z",
        "description": "<strong>Transforming the Future with the Convergence of Simulation and Data <br><br></strong><strong><u>Software Analytics Intern<br><br></u></strong>Do you like a challenge, are you a complex thinker who likes to solve problems? If so, then you might be the new Altairian we are searching for. At Altair, your curiosity matters. We pride ourselves on a business culture that enables open, creative thinking, and we deeply value our employees and their contributions towards our clients' success, as well as our own.<br><br><strong><u>Job Summary<br><br></u></strong>At Altair’s Enterprise Solutions Group, we work with our clients to increase organizational efficiency by combining industry leading software solutions with tailored services to provide system integration, process automation, specialized analytics applications and data management solutions. We democratize our solutions through scripted automated workflows, capturing best practices and thus increasing the productivity of our customers.<br>The Software Analytics Intern will work with our global and cross functional teams to analyze best coding practices to improve the user experience during workflow customization cross applications and research how to read and analyze scripts of multiple programming languages to get their inputs and outputs without running them. You will identify candidate features and build the ML model which can be used to score tasks in various engineering applications, such as Altair Pulse, Hyperworks, SimLab, Compose.<br><br><strong><u>What You Will Do<br></u></strong><ul> <li> Explore and develop concepts to analyze scripts without execution based on research. </li> <li> Collaborate with software, customization and engineering teams to verify requirements and best practices </li> <li> Develop an initial list of feature candidates and ML module </li> <li> Present concept and progress to a larger audience for reviews. </li> <li> Strong emphasis on end user research. </li> <br><br></ul><strong><u>Basics<br><br></u></strong><strong> What You Will Need: <br></strong><ul> <li> Attention to details </li> <li> Passionate to solve problems </li> <li> Strong desire to improve user experience with Engineering applications </li> <li> Progress towards a Bachelor’s degree in Computer Science, Analytics or related field. </li> <li> Ability to research by yourself </li> <li> Experience with a scripted programming language like Python, Tcl, OML, Lua, etc. </li> <li> Strong verbal and written communication skills </li> <li> Appreciation to work within a team </li> <li> Strong problem-solving skills. </li> <li> Ability to work in a cross functional and multidisciplinary team. </li> <br><br></ul><strong><u>How You Will Be Successful<br></u></strong><ul> <li> <strong> Envision the Future </strong> </li> <li> <strong> Communicate Honestly and Broadly </strong> </li> <li> <strong> Seek Technology and Business “Firsts” </strong> </li> <li> <strong> Embrace Diversity and Take Risks </strong> </li> <br><br></ul><strong><u>What We Offer<br></u></strong><ul> <li> Competitive salary </li> <li> Training &amp; Development - free training on Altair products </li> <br><br></ul><strong><u>Why Work With Us<br><br></u></strong>Altair is a global technology company that provides software and cloud solutions in the areas of data analytics, product development, and high-performance computing (HPC). Altair enables organizations in nearly every industry to compete more effectively in a connected world, while creating a more sustainable future. With more than 3,000 engineers, scientists and creative thinkers in 25 countries, we help solve our customer’s toughest challenges and deliver unparalleled service, helping the innovators innovate, drive better decisions, and turn today’s problems into tomorrow’s opportunities.<br><br><strong> Our vision is to transform customer decision making with data analytics, simulation, and high-performance computing. <br><br></strong>For more than 30 years, we have been helping our customers integrate electronics and controls with mechanical design to expand product value, develop AI, simulation and data-driven digital twins to drive better decisions, and deliver advanced HPC and cloud solutions to support unlimited idea exploration. To learn more, please visit altair.com .<br><br><strong> Ready to go? #ONLYFORWARD <br><br></strong>At our core we are explorers; adventurers; pioneers. We are the brains behind some of the world’s most revolutionary innovations and are not only comfortable in new and uncharted waters, we dive in headfirst. We are the original trailblazers that make the impossible possible; discovering new solutions to our customer’s toughest challenges.<br><br>Altair is an equal opportunity employer. Our backgrounds are diverse, and every member of our global team is critical to our success. Altair's history demonstrates a belief that empowering each individual authentic voice reinforces a culture that thrives because of the uniqueness among our team."
    },
    {
        "position": "Software Engineer Intern (Tulsa, OK - Summer 2021)",
        "company": "Garmin",
        "location": {
            "city": "Tulsa",
            "state": "OK"
        },
        "posted": "2020-11-22T01:14:29.969Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-tulsa-ok-summer-2021-at-garmin-2328858848?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=gK6Ejc%2FbwXdAwv7eLLu5wg%3D%3D&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:29.969Z",
        "description": "We are looking for a full time Software Engineer Intern to develop embedded or application software for products at our Tulsa, Oklahoma office. They will test software, perform software releases, quality assurance activities and performance maintenance activities on real Garmin products.<br><br><strong><u>Essential Functions And Responsibilities In This Role Include<br></u></strong><ul><li>New product design and development</li><li>Troubleshooting basic issue reports &amp; implementing software solutions</li><li>Communicating status of work &amp; providing visibility to supervisor</li><li>Learning how to use &amp; apply various engineering tools as needed for the role</li><li>Planning technical work to meet team objectives</li><li>Applying design standards and procedures to implement basic designs</li><li>Thoroughly documenting work in an organized manner</li><li>Working collaboratively in a team environment to achieve individual &amp; team goals<br></li></ul>Qualified candidates for this role will have completed coursework in Computer Science, Electrical Engineering, Computer Engineering, or a field relevant to perform the essential functions of this job description with a minimum cumulative GPA greater than or equal to 3.0.<br><br><strong><u>Other Requirements Include<br></u></strong><ul><li>Demonstrated strong and effective verbal, written, and interpersonal communication skills</li><li>Must demonstrate relevant experience and/or training in a low, mid, or high-level language such as C, C++, C#, Java, or other selected languages</li><li>Must possess relevant experience and/or training in data structures or object-oriented design methodology relevant to Garmin’s business need</li><li>A cumulative GPA greater than or equal to 3.0 and previous experience working in a team environment is highly preferred!<br><br></li></ul><strong><u>Garmin Intern Perks<br></u></strong><ul><li>Social activities and service opportunities planned for interns</li><li>Paid time off</li><li>Paid holidays</li><li>Test cutting-edge Garmin products before they are released</li><li>No formal dress code</li><li>Assigned mentor to answer your questions and help you grow in your technical skillsets</li><li>Associate discount on consumer products</li><li>Paid, coordinated housing or stipend option for interns whose permanent address is located more than 50 miles from Garmin HQ</li><li>Housing stipend option for those at field locations (non-Olathe) whose permanent address is located more than 50 miles from the field location</li><li>If you join us full-time, your time as an intern counts towards becoming fully vested with your 401K</li><li>Waived registration fees for Garmin-approved races<br></li></ul>As part of our ongoing commitment to helping associates maintain a healthy balance between work and life, we sponsor company-wide and individual wellness initiatives, as well as world-class sporting events—and even some of the participating athletes. In each of the communities in which we do business, Garmin has a strong philanthropic and civic presence.<br><ul><li>Applicants will be considered for all U.S. locations; this excludes Salem, Oregon.</li><li>Applicants will also be considered for all SWE internship positions open at Garmin, excluding Salem, Oregon. </li><li>Applicants will be considered for all Garmin business segments (i.e., Aviation, Fitness, Marine, Outdoor, Auto OEM, Consumer Automotive, etc.).<br></li></ul><em>Garmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.</em>"
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Platform9 Systems",
        "location": {
            "city": "Mountain View",
            "state": "CA"
        },
        "posted": "2020-11-08T01:14:30.293Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-platform9-systems-2331828928?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=IJizTJO76dGSVaoh%2FPaKUA%3D%3D&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:30.293Z",
        "description": "We need hackers who are versatile, breathe technology and capable of taking on challenging problems across the stack.<br>Are you passionate about scalable distributed systems? Want to solve challenges in security and networking? How about delivering an amazing user experience through a modern Web UI? Or just hack up great tools and frameworks under the mentorship of some the industry's greatest talent? Then Platform9 has interesting internship opportunities for you. As a key member of our engineering team, you have the opportunity to experience and contribute to a real world private cloud product.<br><br><strong><u>Requirements<br><br></u></strong>Currently pursuing BS, MS or PhD in computer science, engineering, math or related field. Prefer 8-12 months to graduation. PhD candidates can be in any year. Preferred Qualifications:<br><ul><li> Coursework in one or more areas: operating systems, distributed systems, networks, security or user interface design</li><li> Knowledge of Linux/Unix Systems</li><li> Programming proficiency in any one language: python, javascript, C/C++, java, golang</li><li> GPA 3.5 and above<br></li></ul><strong><u>Benefits<br></u></strong><ul><li> Startup culture with the freedom to innovate and take initiative</li><li> Rapidly growing company</li><li> Periodic company paid lunches, massages and happy hours<br></li></ul>"
    },
    {
        "position": "Software Engineering Intern (multiple openings)",
        "company": "MicroStrategy",
        "location": {
            "city": "Tysons Corner",
            "state": "VA"
        },
        "posted": "2020-12-03T01:14:30.945Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-multiple-openings-at-microstrategy-2313472104?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=qCeLBpvOaxC515LefvH9jQ%3D%3D&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:30.945Z",
        "description": "<strong><u>Company Description<br><br></u></strong>MicroStrategy transforms organizations into intelligent enterprises through data-driven innovation. We match smart people to dynamic projects and technologies that truly challenge their talents. Curious and creative in outlook, our success is built on the talent and energy of smart and driven people. MicroStrategy (Nasdaq: MSTR) is a worldwide leader in enterprise analytics and mobility software. A pioneer in the BI and analytics space, MicroStrategy delivers innovative software that empowers people to make better decisions and transform the way they do business. We provide our enterprise customers with world-class software and expert services so they can deploy unique intelligence applications.<br><br><strong><u>Job Description<br><br></u></strong>As a Software Engineer Intern at MicroStrategy, you’ll be part of an agile software development team, providing our customers with the most powerful, scalable, and user-friendly platforms for analytics, mobility, and security. You’ll play a key role in enabling MicroStrategy products to be best-in-breed and optimized for leading organizations to analyze Big Data and distribute actionable business insight across their enterprise.<br><br>Our 12-week paid summer internship offers mentorship, networking events, and professional development within our Technology team.<br><br><strong><u>You’ll have the opportunity to join one of the exciting teams below</u>:<br><br></strong><strong>Clients<br><br></strong>The Clients team is delivering rich, modern, intuitive interfaces that serve content subsecond and enable instant insight and actions for business users through the tools they use every day.<br><br><strong>Tools<br><br></strong>The Tools team is building the next generation of analytics authoring, environment management, and system monitoring tools to empower all MicroStrategy users. Users will leverage best-in-class tools to configure, monitor, and automate enterprise BI and Security applications.<br><br><strong>Platforms<br><br></strong>The Platforms team enables customers to quickly realize value from their MicroStrategy investment by providing a comprehensive Platform of Analytics, Mobility, and Security services that rapidly deploy on Windows, Red Hat Linux, and Amazon Linux in the Cloud and On-Premise.<br><br><strong>Server<br><br></strong>The Server team is the heart and brain of the MicroStrategy Platform by enabling the next generation of Analytic and Mobile applications leveraging every available Enterprise Asset, by providing a rich set of powerful, easy to use, metadata-driven Services, which can be deployed On-Premise or in the Cloud.<br><br><strong><u>Technologies You Could Use<br><br></u></strong>Java, C++, C#, JavaScript, Swift, Objective C, Shell scripting (ksh, bash), Python, HTML5, CSS, Windows Server, Linux, Mac, iOS, Android, Cocoa, J2EE, Angular, Spring, MapReduce, Play, React, Node.js, Eclipse IDE, Visual Studio, Git, Maven, Junit<strong>, </strong>SQL server, Oracle, DB 2, MySQL, , Redshift, Hive, Impala, Teradata, Presto, Spark, MongoDB<strong>, </strong>REST, JDBC, ODBC, ORM, Redis, Kafka, Zookeeper<br><br><strong><u>Qualifications<br><br></u></strong><strong><u>You should bring the following skills and experience:<br></u></strong><ul><li>Currently pursing Bachelors in Computer Science or related field (targeting December 2021 or May 2022 graduates)</li><li>Strong verbal and written communication skills</li><li>Creative analytical and problem solving skills</li><li>Process oriented and ability to pay close attention to detail</li><li>Team oriented individual<br><br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."
    },
    {
        "position": "Data Analytics Intern (Summer 2021)",
        "company": "Poshmark",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2020-12-06T01:14:31.680Z",
        "url": "https://www.linkedin.com/jobs/view/data-analytics-intern-summer-2021-at-poshmark-2316153245?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=Xjcdz23jFBkGuUnI5m2kTA%3D%3D&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:31.680Z",
        "description": "Poshmark is seeking <strong>Data Analytics Interns for Summer 2021</strong>. We are a rapidly growing multi-platform social fashion marketplace and working on interesting data science problems to improve user experiences. The role will be dynamic and varied, requiring a versatile self-starter willing to dive in to multiple initiatives. Over the next 10 weeks the intern can expect to become deeply involved in exploring and implementing analytics solutions that may run in production.<br><br>Our goal is to give the intern exposure to a range of data analysis/data science techniques and current big data technologies, through the experience of applying them to the multi-platform social marketplace dynamics. This role will provide an excellent opportunity to implement solutions that may run in production, at scale.<br><br><strong><u>What You’ll Potentially Be Working On<br></u></strong><ul> <li>Focus on data analytics and modeling problems aimed to grow &amp; optimize performance in one of these areas: Growth, Marketplace Operations, Product, Community Service etc. </li> <li>Sample problems:</li></ul><ul> <li>Product engagement &amp; conversion optimization, customer lifetime value modeling, spend &amp; campaign optimization</li> <li>Marketplace demand &amp; supply analysis </li> <li>New business opportunity &amp; feasibility analysis</li> <li>Applying a range of analytic approaches including clustering, segmentation and regression</li> </ul> <br><br><strong><u>What To Expect<br></u></strong><ul> <li>Exposure: Being a rapidly growing social fashion marketplace gives employees the opportunity to work in a Start-Up environment and focus on deeply interesting work that you wouldn’t get to do anywhere else. Prepare to make a large scale impact in a short amount of time.</li> <li>Professional Development: Participate in weekly team meetings, an opportunity to find a good balance of working independently and in teams formed across multiple business units, develop knowledge of multiple areas of social marketplace, interact with leadership team;</li> <li>Mentorship: Look forward to one-on-one time with dedicated managers and mentors to facilitate your growth throughout the summer internship experience.</li> <li>Have fun: Virtual team events </li> <br><br></ul><strong><u>What We’re Looking For<br></u></strong><ul> <li>Currently enrolled in an MS or PhD program in Computer Science, Software Engineering, Math, Statistics or a related field</li> <li>Intermediate to advanced SQL coding skills. Working level skills in Python and/or R. Need to be able to pull your own big volume data, process it and create visualizations and reports. </li> <li>Sound understanding of applied math topics such as probability and statistics, linear algebra, hypotheses testing and basic optimization techniques. </li> <li>Working knowledge of algorithms, machine learning, data mining, statistics, applied mathematics or similar field. </li> <li>Strong communication and collaboration skills; Being a team player is a must</li> <li>Passion for consumer experience, a desire to go into uncharted territory with bold new ideas, and a willingness to go the last mile on execution</li></ul>"
    },
    {
        "position": "Summer Engineering Internship",
        "company": "edX",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2020-11-22T01:14:32.041Z",
        "url": "https://www.linkedin.com/jobs/view/summer-engineering-internship-at-edx-2325344931?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=ALJV8kZaO6VWwUuuE0aObg%3D%3D&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:32.041Z",
        "description": "<br><br><strong>Software Engineering Internship - Summer 2021<br><br></strong><strong>Your Impact <br><br></strong>This is an amazing opportunity to participate in an internship with a transformative, educational, e-commerce, start-up whose mission is to reinvent the way people learn. As an intern for edX, you will work with an amazing group of innovators who are focused on the mission of offering interactive online courses and Massive Open Online Courses (MOOCs) from the world's best universities and corporations.<br><br><strong>Your Team<br><br></strong>Interns will join edX as a member of a \"squad\" dedicated to one of edX's key business initiatives, whether its product or platform-based. These squads complete work that's crucial to edX's product roadmap and success! There will be opportunities to collaborate with folks within your own team, with other interns, and with key stakeholders across the organization.<br><br><strong>You Will<br><br></strong><ul> <li>Work up to 40-hours a week gaining real, full lifecycle software development skills on one of our engineering teams.</li> <li>Learn about and use technologies such as: Python, Django, React, Javascript, HTML and CSS.</li> <li>Projects will be based on the work that the engineering teams are currently working on.</li> <li>Develop code, test your code, build software features, participate in software design, work on live tickets, and more!</li> <li>Work closely with a mentor who will offer guidance and support for anything -- this could be for help with coding projects or small tips like how to add an emoji in Slack </li> <br><br></ul><strong>You are:<br><br></strong><ul> <li><strong>An undergraduate rising senior</strong> working towards a Bachelor's degree in Computer Science, Engineering, Mathematics, or related field of study.</li> <li>Organized, reliable, collaborative, intellectually curious, and deadline oriented.</li> <li>A great communicator, with strong written and verbal communication skills.</li> <li>Experienced in software design, coding, and debugging. It is great if you have worked on programming projects outside of the classroom, whether during a hackathon, with a CS club, or in your own spare time.</li> <li>Familiarity with our stack: Python/Django, MySQL, and/or AWS</li> <li>Comfortable working in a remote setting, with excellent organizational skills. </li> <br><br></ul>We understand that applying for a job can be intimidating. Applicants rarely meet every single job requirement, and we know there are many skills and backgrounds that will contribute to success in this role.<br><br><strong>That's why we provide new employees with:<br><br></strong><ul> <li>Employee onboarding and training sessions</li> <li>Personalized 30/60/90+ day plans</li> <br><br></ul>And much more to support you in your personal journey at edX! That said, if this role looks like a great next step for you, please apply… even if you can't \"check every box.\" We'd love to hear from you!<br><br><strong>edX </strong>is the education movement for restless learners. Together with our founding partners Harvard and MIT, we've brought together over 30 million learners, the majority of top-ranked universities in the world, and industry-leading companies onto one online learning platform that supports learners at every stage. And we're not stopping there—as a global nonprofit, we're relentlessly pursuing our vision of a world where every learner can access education to unlock their potential, without the barriers of cost or location."
    },
    {
        "position": "Software Engineer - Intern (Summer 2021)",
        "company": "C3.ai",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2020-11-15T01:14:32.452Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-summer-2021-at-c3-ai-2002408814?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=smC%2FAnrIWwGJbRmGNEAa3w%3D%3D&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:32.452Z",
        "description": "C3.ai is a leading enterprise AI software provider for accelerating digital transformation. The comprehensive and proven C3 AI Suite uses a model-driven abstraction layer to enable organizations to develop, deploy, and operate enterprise scale AI applications 40x to 100x faster than alternative approaches. www.c3.ai<br><br>We are looking for Software Engineers to join us during our <strong>Summer 2021 internship program</strong>. As a Software Engineer Intern, you will design and develop AI applications using the C3 AI Suite. AI Software Engineers may be assigned to work on our applications, platform, or forward deployed engineering teams. You will collaborate to do meaningful work while also growing your expertise.<br><br><strong><u>Your Responsibilities<br></u></strong><ul> <li>Design, develop, and maintain performant and scalable applications.</li> <li>Build and improve tools for internal C3 teams to understand and analyze large-scale data.</li> <li>Work closely with and incorporate feedback from Products and Engineering teams.</li> <li>Define and lead end-to-end development of applications.</li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li>Pursuing a Bachelor of Science or Master of Science in Computer Science, Computer Engineering, or related fields.</li> <li>Experience with JavaScript, Java, or other object-oriented programming language.</li> <li>Strong hands-on experience and understanding of object-oriented programming, data structures, algorithms, profiling &amp; optimization.</li> <li>Real passion for developing team-oriented solutions to complex engineering problems.</li> <li>Thrive in an autonomous, empowering and exciting environment.</li> <li>Great verbal and written communication skills to collaborate multi-functionally and improve scalability.</li> <li>Interest in committing to a fun, friendly, expansive, and intellectually stimulating environment.</li> <br></ul>C3.ai provides interns a competitive compensation package. At the office, we offer a fully stocked kitchen with catered breakfast and lunch, table tennis and pool table, free membership at our on-site gym, Friday evening social hours with food, drink and music and a fun team of great people.<br><br>C3.ai is proud to be an Equal Opportunity and Affirmative Action Employer. We do not discriminate on the basis of any legally protected characteristics, including disabled and veteran status."
    },
    {
        "position": "Software Engineer, Summer 2021 Intern",
        "company": "Convoy Inc",
        "location": {
            "city": "Seattle",
            "state": "WA"
        },
        "posted": "2020-12-04T01:14:32.869Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-2021-intern-at-convoy-inc-2314560585?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=QClz233tLY46YKa7dp3t%2Fw%3D%3D&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:32.869Z",
        "description": "Convoy is transforming the $800 billion trucking industry. Our mission is to transport the world with endless capacity and zero waste. The industry is huge and so is the opportunity to change the way freight moves.<br><br>The next time you’re out driving and see an 18-wheeler on the road, that truck is empty <em>35% of the time.</em> When big trucks drive empty, they throw unnecessary CO2 into the atmosphere. In fact, empty trucks generate more than 76 million metric tons of wasted carbon emissions every year. At Convoy, our digital freight network helps reduce those empty miles and cut carbon waste by nearly half.<br><br>This is your opportunity to collaborate with an incredible group of people and help transform the freight industry. Join Convoy and help move the world forward.<br><br><strong><u>About You<br><br></u></strong>Convoy is building a team of diverse, talented, and creative engineers to automate the logistics industry. We’re developing cutting-edge software that makes trucking more efficient and sustainable, all while providing a world-class shipper and carrier experience. We’re looking for people who pride themselves on their ability to create innovative products, balancing urgency with intentionality. You approach every problem, process, and system with a collaborative, open mind and are eager to continue growing your skillset.<br><br><strong><u>You Will<br></u></strong><ul><ul><li>Immediately be paired with a vertically focused team and be indoctrinated into the product they support.</li><li>Ship code your first week- we expect our interns to contribute in meaningful ways right off the bat. </li><li>Have excellent mentorship. Each intern will be paired with an engineering mentor to help guide them through the summer.</li><li>Get the chance to own large, complex projects and see them through to the finish.</li><li>Earn competitive pay and perks.<br><br></li></ul></ul><strong><u>We're Looking For Someone Who Has<br></u></strong><ul><ul><li>A degree in Computer Science I<strong>N PROGRESS</strong> with a graduation date in 2022.</li><li>Experience with an object oriented language like Java, C++, Ruby, Python, etc.</li><li>Working knowledge of data structures and algorithms.</li><li>Strong communication skills and ability to fluently express ideas to business stakeholders.<br><br></li></ul></ul><strong><u>Nice To Haves<br></u></strong><ul><ul><li>Previous internship experience is strongly preferred.<br><br></li></ul></ul>Convoy is an equal-opportunity employer and we welcome applicants from all backgrounds. If you’re a passionate team player who wants to have an outsized impact on a diverse and dynamic team, we’d love to hear from you!"
    },
    {
        "position": "Jr. Web Analyst Intern",
        "company": "Experian",
        "location": {
            "city": "Costa Mesa",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:33.265Z",
        "url": "https://www.linkedin.com/jobs/view/jr-web-analyst-intern-at-experian-2333181616?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=oZJ6x1UgVFO%2FZFFSWz%2B%2BvQ%3D%3D&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:33.265Z",
        "description": "Our internship program is an excellent way for you to gain experience, work with amazing people and complement your studies as you set the course for your future. The program lasts for 6 months beginning January and ending in June/July. The Engineering team under Shared Marketing and Innovation is a fast-paced and flexible team. The team culture isn’t just about one kind of person. So many individuals make up who we are, making us that much more unique. It’s what sets us apart, the dynamic, diverse and collaborative environment.<br><br><strong><u>About Us, But We’ll Be Brief<br><br></u></strong>Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that <strong>FORTUNE has named Experian one of the 100 Best Companies to work for</strong>. In addition, for the last five years we’ve been named in the <strong>100 “World’s Most Innovative Companies” by Forbes Magazine</strong>.<br><br><strong><u>What You’ll Be Doing<br><br></u></strong>The Engineering team is seeking a motivated software-oriented intern who is ready to apply their love of software development to the release and communication management. We are looking for a motivated individual who can learn the craft of release management, which is a transferable skill to many professions. We are a mighty team embedded within the Marketing, Creative and Infrastructure teams. You will enjoy learning about the process of software development end to end.<br><br>We will pair you with seasoned managers, marketing owners and engineers who are practitioners of the Scaled Agile Framework and who work closely with software developers. You will support the program and release management duties of multiple development areas. You will have a chance to see the execution of releases into market, and get experience planning for the next release. You will work with many roles across the development lifecycle (such as product owner, software engineer, tester, scrum master)<br><br><strong><u>What Your Background Looks Like<br></u></strong><ul> <li>Must be enrolled in a BS/MS degree program in Business Administration, Economics, Marketing, Computer Science or related field</li> <li>Minimum 3.0 GPA</li> <li>Experience with Microsoft Office Suite Excellent critical thinking and problem-solving skills </li> <li>Good written and verbal communication skills </li> <li>Positive attitude and willingness to learn </li> <li>Detail-oriented with strong organizational skills</li> <br></ul><strong>Perks<br></strong><ul> <li>During this pandemic, all Experian employees are working remotely. Once it’s safe to do so, we’ll slowly return to our offices however we are in no rush to do this. The safety of our employees is of utmost importance</li> <li>Flexible work schedule and relaxed dress code </li> <br></ul><em>EOE including Disability/Veteran</em>"
    },
    {
        "position": "Backend Software Engineering Intern",
        "company": "Confluent",
        "location": {
            "city": "Mountain View",
            "state": "CA"
        },
        "posted": "2020-12-05T01:14:33.705Z",
        "url": "https://www.linkedin.com/jobs/view/backend-software-engineering-intern-at-confluent-2200187600?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=WwtZehEeDiS5Xu5nDy4MSg%3D%3D&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:33.705Z",
        "description": "Dubbed an \"open-source unicorn\" by Forbes, Confluent is the fastest-growing enterprise subscription company our investors have ever seen. And how are we growing so fast? By pioneering a new technology category with an event streaming platform, which enables companies to leverage their data as a continually updating stream of events, not as static snapshots. This innovation has led Coatue Management, Altimeter Capital and Franklin Templeton to join earlier investors Sequoia Capital, Benchmark, and Index Ventures in the recent Series E financing of a combined $250 million at a $4.5B valuation. Our product has been adopted by Fortune 100 customers across all industries, and we’re being led by the best in the space—our founders were the original creators of Apache Kafka®. We’re looking for talented and amazing team players who want to accelerate our growth, while doing some of the best work of their careers. Join us as we build the next transformative technology platform!<br><br><strong><u>About The Role<br><br></u></strong>As a Backend Software Engineering Intern, you will work on our suite of cloud and on-premise software running on Apache Kafka, which powers hundreds of trillions of events per day day at top companies like Netflix, LinkedIn, and Uber. If you love building cutting edge systems and software that are mission critical to how enterprises work with data, or are passionate about open source, then you will fit right in.<br><br><strong><u>What We're Looking For<br></u></strong><ul><ul><li>Strong CS fundamentals gained through current pursuit of Bachelors, Master's or PhD in computer science, math, or related field </li><li>Strong Data Structures or Algorithms knowledge</li><li>Experience with Java, C/ C++, Go, Python<br><br></li></ul></ul><strong>Come As You Are<br><br></strong>At Confluent, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. The more diverse we are, the richer our community and the broader our impact.<br><br>Click here to review our <em>California Candidate Privacy Notice</em> , which describes how and when Confluent, Inc., and its group companies, collects, uses, and shares certain personal information of California job applicants and prospective employees."
    },
    {
        "position": "Software Engineer Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "King of Prussia",
            "state": "PA"
        },
        "posted": "2020-11-22T01:14:34.039Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-lockheed-martin-2306185142?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=a8Mwhnf3nJoBS7U%2B5%2BUVMQ%3D%3D&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:34.039Z",
        "description": "<strong>Description:</strong>A summer intern is a regular, casual, non-exempt hire who is currently pursuing a degree at an accredited college or university and will be given work related to that degree area. Acceptable degree programs will include only information technology related programs such as Mathematics, Computer Science, Systems Engineering, Electrical Engineering, Computer Engineering and Information, Sciences and Technology.<br><br>Basic skill requirements will include knowledge, experience, and a desire to learn software development and systems engineering (requirements, interface development, risk and opportunity management), and software testing.<br><br>This internship requires a candidate with strong problem solving skills focused on software development for the Weapons Platform Integration or Advanced Programs organizations. Tasking will include implementation of multiple tiered architecture solutions. Other specific responsibilities may include rapid prototyping. Candidate may also be developing discrepancy report work-offs for an operational application and supporting test automation tasks. Candidate must be able to work within a team environment under supervision from senior software engineers. Work location will be in Valley Forge, PA.<br><br>Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information.<br><br><strong><u>Basic Qualifications<br><br></u></strong>Pursuing a Bachelor's degree in Computer Science, Software Engineering, or Computer Engineering (or related degree) from an accredited college.<br><br>Ability to obtain security clearance<br><br><strong><u>Desired Skills<br></u></strong><ul><li> Java</li><li> Python</li><li> C++</li><li> Javascript Frameworks</li><li> Docker</li><li> Mean Stack (Mongo, Express, Angular, Node)</li><li> Analyze user requirements to derive software design and performance requirements</li><li> Design and code new software or modify existing software to add new features</li><li> Debug existing software and correct defects</li><li> Integrate existing software into new or modified systems or operating environments</li><li> Develop simple data queries for existing or proposed databases or data repositories</li><li> Provide recommendations for improving documentation and software development process standards<br></li></ul>General skills consistent with computer technology, software, scripting, database<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern"
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Datadog",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-11-22T01:14:34.398Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-datadog-2330925214?refId=5401a770-708e-427d-a43f-9793e1ca1117&trackingId=drvpHjeKTp%2BDs1y3WJhuOQ%3D%3D&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:34.398Z",
        "description": "<strong><u>About Datadog<br><br></u></strong>At Datadog, we're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.<br><br>We are looking for students to join us for an internship to help us collect, aggregate, visualize, and analyze extremely high-scale metrics, logs, and application data.<br><br><strong><u>The Opportunity<br><br></u></strong>We're looking for talented developers to join our teams and start making an impact from day one. You'll join one of Datadog's software teams and work alongside other engineers to help solve challenging problems. Whether you are writing a new integration, building data pipelines, or working with the open source community, our interns are key contributors to our product. This intern position is based in our <strong>New York City or Boston</strong> offices. We ideally intend for you to be in the New York or Boston. However, our top priority is your health and safety, so all current and future Datadog employees will be working remotely until then.<br><br><strong><u>Your Skills And Qualifications<br></u></strong><ul> <li>You are in the process of receiving a degree in computer science, software engineering, or a related discipline</li> <li>You are comfortable coding in one or more languages</li> <li>You value code simplicity and performance</li> <li>You have worked as a software engineering intern or have related industry/academic experience</li> <li>You want to work in a fast, high-growth environment that values its employees and customers</li> <li>You are a self-starter who enjoys collaborating with other engineers and solving difficult problems</li> <br><br></ul><strong><u>Bonus Points<br></u></strong><ul> <li>You have experience in Python, Go, or Javascript</li> <li>You have some specialized skills like data visualization, distributed systems, or production engineering</li> <li>You’ve used Datadog or have written your own monitoring tools before</li> <br><br></ul><strong><u>Eligibility<br></u></strong><ul> <li>We are currently only offering co-op/internship in the Fall. Note: You must be available for 4 - 6 months.<br><ul> <li>Fall: Available to start in July-Sept 2021<br></li> </ul> </li> <br><br></ul><strong><u>Equal Opportunity At Datadog<br><br></u></strong>Datadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br><br><strong><u>Your Privacy<br><br></u></strong>For more information on how we maintain the privacy of the information you submit as part of your application, please refer to our Applicant and Candidate Privacy Notice."
    },
    {
        "position": "Data Science Intern",
        "company": "Dewberry",
        "location": {
            "city": "Fairfax",
            "state": "VA"
        },
        "posted": "2020-12-04T01:14:34.791Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-dewberry-2304635255?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=YmfP%2BA5GSe%2F%2BT%2BYnySVLJA%3D%3D&position=1&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:34.791Z",
        "description": "<strong><u>Job Description<br><br></u></strong>Dewberry is a leading, market-facing professional services firm with more than 50 locations and 2,000 professionals nationwide. What sets us apart from our competitors are our people. At Dewberry, we seek out exceptional talent and strive to deliver the highest quality of services to our clients. Whether you’re an experienced professional or a new graduate, you’ll have the chance to collaborate with the best and brightest and work on innovative and complex projects at the forefront of the industry. Our commitment to excellence stems from our personal integrity and from other defining attributes, which we call “Dewberry at Work,” that have inspired our employees to be successful for more than a half-century.<br><br>Dewberry is currently seeking a <strong>Data Science Intern</strong> to join our Information Technology Group in our <strong>Fairfax, VA office</strong> to provide support for our digital transformation. This is an excellent career opportunity for an enthusiastic and talented individual to join and support a team of other outstanding professionals, and will report to the Business Intelligence Manager.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Build and execute tools to monitor and report on data quality </li><li> Demonstrate ability to explore and quickly grasp new technologies to progress varied initiatives </li><li> Work collaboratively with appropriate Technical and Business teams to execute data access priorities and ensure proper controls are established </li><li> Experience or demonstrated passion for working with data </li><li> Design and develop dashboards and reports to visualize analysis results using BI tools for internal governance team use <br><br></li></ul><strong><u>Required Skills &amp; Required Experience<br></u></strong><ul><li> Pursuing a degree in Computer Science, Information Systems or related area </li><li> Previous internship experience preferred </li><li> Solid oral and written communication skills </li><li> Demonstrated analytical and problem-solving skills </li><li> Hands-on expertise with SQL for use in data access, discovery and analysis </li><li> Ability to adapt to fast changing environment </li><li> Availability to work approximately 20 hours per week </li></ul><li>At this time, Dewberry will not sponsor new applicants for work authorization.</li><li>Dewberry is an Equal Opportunity/ Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.</li><li>All recipients of an offer of employment from Dewberry, will be required to submit to a background screening which may include, but is not limited to, employment verification, educational and other credential verification, driving record check, criminal background check, and an investigative consumer report. These screenings will be conducted by Dewberry’s background vendor of choice and will be conducted in compliance with all applicable federal, state, and local law.<br><br></li><strong>Options<br><br></strong>Apply for this job online Apply<br><br>Share<br><br>Refer this job to a friend Refer<br><br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br><br>Share on your newsfeed<br><br><strong> Need help finding the right job? <br><br></strong>We can recommend jobs specifically for you! Click here to get started."
    },
    {
        "position": "Summer 2021 Internship Program",
        "company": "Hitachi ABB Power Grids",
        "location": {
            "city": "Raleigh",
            "state": "NC"
        },
        "posted": "2020-12-03T01:14:35.222Z",
        "url": "https://www.linkedin.com/jobs/view/summer-2021-internship-program-at-hitachi-abb-power-grids-2316877073?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=GdLY7sJtcYcnZIONdDncNw%3D%3D&position=2&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:35.222Z",
        "description": "Hitachi ABB Power Grids is a pioneering technology leader that is helping to increase access to affordable, reliable, sustainable and modern energy for all. We help keep your lights on, the factories running, our hospitals and schools open. Come as you are and prepare to get better as you learn from others. Bring your passion, bring your energy, and plug into a team that appreciates a simple truth: Diversity + Collaboration = Innovation<br><br>Hitachi ABB Power Grids is seeking interns for our Summer 2021 Internship Program in our various locations across the USA. Bring your passion and skills to an organization that works with purpose at massive scale. We’re proud to build solutions that transfer the power of the world’s largest wind farms, bring energy to mass transportation systems, and protect our biggest cities from blackouts. Impacting 75% of the world’s population with the technology we deliver means we need students with different views to bring their big ideas to our organization. If you have a passion for sustainability and are always looking for new ways to solve problems, we have an internship for you. Our summer internships are full-time and 12 weeks in length. Our internship program philosophy is simple – come as you are and prepare to get better, as you embark on a learning journey where your big ideas impact the organization. Join us and power your future while powering good for sustainable energy. Some of our major locations for internships include Atlanta, GA; Broomfield, CO; Houston, TX; Jefferson City, MO; Crystal Spring, MS; Raleigh, NC; South Boston, VA; Bland, VA; Alamo, TN; Mount Pleasant, PA<br><br><strong>Your Responsibilities<br></strong><ul><li>Work with purpose - We keep the lights on, the factories running, our hospitals and schools open. Your work will contribute to our mission to deliver a stronger, smarter, and greener grid.</li> <li>Think big - We solve seemingly impossible engineering problems; pushing boundaries, breaking records and never giving up. You will think outside the box and create solutions that will have a direct impact.</li> <li>Power your career - We operate on global teams that support and encourage career growth. You will work on projects that broaden your skillset and participate in professional development activities.</li> <li>Collaborate - We believe in a simple truth: Diversity + Collaboration = Innovation. You will work in a collaborative environment that encourages all voices to share their unique perspectives and fuel innovation.<br><br></li></ul><strong>Your background<br></strong><ul><li>Currently enrolled in an accredited university program in the USA</li> <li>Candidate must already have a work authorization that would permit them to work for Hitachi ABB Power Grids in the United States</li> <li>All majors encouraged to apply with a strong focus on engineering and computer science disciplines: electrical engineering, mechanical engineering, industrial engineering, computer engineering, computer science</li> <li>Interest in the energy and/or manufacturing sector(s)</li> <li>Self-starter that seeks knowledge outside of the classroom<br><br></li></ul><strong>More About Us<br><br></strong>Hitachi ABB Power Grids is a global technology leader with a combined heritage of almost 250 years, employing around 36,000 people in 90 countries. Headquartered in Switzerland, the business serves utility, industry and infrastructure customers across the value chain, and emerging areas like sustainable mobility, smart cities, energy storage and data centres. With a proven track record, global footprint and unparalleled installed base, Hitachi ABB Power Grids balances social, environmental and economic values, and is committed to powering good for a sustainable energy future, with pioneering and digital technologies, as the partner of choice for enabling a stronger, smarter and greener grid. www.hitachiabb-powergrids.com Hitachi ABB Power Grids is an Equal Employment Opportunity (EEO) and Affirmative Action Employer encouraging diversity in the workplace. We welcome you to apply and want you to know that all qualified applicants will receive consideration for employment without regard to race, creed, color, ancestry, religion, sex, national origin, citizen status, age, sexual orientation, gender identity, disability, marital status, family medical leave status, protected veterans status or any other legally protected characteristic. For more information regarding your EEO rights as an applicant, please visit the following websites: https://www.dol.go v/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/eeopost.pdf and https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/ posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf. Protected veterans and qualified individuals with a disability may request a reasonable accommodation if you are unable or limited in your ability to use or access Hitachi ABB Power Grids career site as a result of your disability. You may request reasonable accommodations by calling a Hitachi ABB Power Grids HR Representative at 1-888-504-2007 or by sending an email to: us-pg-askhr@abb.com. Resumes and applications will not be accepted in this manner.<br><li><br></li>"
    },
    {
        "position": "Data Science Intern",
        "company": "Mailchimp",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2020-11-22T01:14:35.603Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-mailchimp-2197006360?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=KzRENf9DM%2FDdEj3PKkRjVQ%3D%3D&position=3&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:35.603Z",
        "description": "Mailchimp is a leading marketing platform for small business. We empower millions of customers around the world to build their brands and grow their companies with a suite of marketing automation, multichannel campaign, CRM, and analytics tools.<br><br>The Mailchimp internship program started in 2013. In the past 7 years, we’ve had the privilege of bringing in some of the brightest, most talented college students from around the country to spend time with our teams. Our 12 week internship program was designed so that interns can grow their skill set, thrive in the Mailchimp community, and do meaningful work. They also have a lot of fun along the way!<br><br><strong>Start Date: May 17th or June 7th<br><br></strong>The Data Science team builds applications that make sense of the data created by Mailchimp’s millions of users. By using predictive analytics and big data technologies we help Mailchimp users grow through our smart marketing tools and data-driven insights . We work closely with Mailchimp’s Development and Operations teams to make analytical insights actionable within our infrastructure.<br><br>Mailchimp is looking for a Data Science intern to help our team’s research efforts. You’ll work alongside data scientists and software engineers by trialing analyses and training predictive models on our data that will eventually become customer facing and/or internal services, and you'll touch hundreds of terabytes of data.<br><br>The ideal candidate is a curious and resourceful data scientist who believes in demonstrating how data can be used to help our customers. You love new challenges, but you're skeptical of the new hotness. You’ve run analyses using various tools, but you're partial to Python. Communication, critical thinking, and cross-validation are tools you use every day.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li> Work alongside other data scientists to develop analytical techniques for our predictive models </li> <li> Come up with interesting data-driven product ideas to solve problems for our users </li> <li> Perform statistical analyses and communicate findings </li> <li> Work to improve data integrity and mitigate bias in Mailchimp data systems </li> <li> Embrace and demonstrate our values: humility, creativity, and independence </li> <br><br></ul><strong><u>We’d Love To Hear From You If<br></u></strong><ul> <li> Pursuing a degree in Statistics, Operations Research, Mathematics, Computer Science, Quantitative Social Science, or equivalent experience </li> <li> Understanding of statistical analysis and machine learning techniques </li> <li> Have experience in natural language processing </li> <li> Have experience programming in Python </li> <li> Experience in database systems (SQL or MySQL) </li> <li> Experience with Cloud platforms (Google Cloud, AWS...) </li> <li> Ability to communicate methods and results of analyses </li> <br></ul>Mailchimp is a founder-owned and highly profitable company headquartered in the heart of Atlanta in the historic Ponce City Market , right on the Beltline . Our purpose is to empower the underdog, and our mission is to democratize cutting edge marketing technology for small business. We offer our employees an exceptional workplace , extremely competitive compensation, fully paid benefits (for employees and their families), and generous profit sharing . We hire humble , collaborative, and ambitious people, and give them endless opportunities to grow and succeed. If you'd like to be considered for this position, please apply below. We look forward to meeting you!<br><br>Mailchimp is an equal opportunity employer, and we value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."
    },
    {
        "position": "Summer IT & Data Science Internships",
        "company": "Tapestry",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-12-03T01:14:35.975Z",
        "url": "https://www.linkedin.com/jobs/view/summer-it-data-science-internships-at-tapestry-2304647360?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=%2F7IgFIt3Yn65X7EYbOuhbw%3D%3D&position=4&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:35.975Z",
        "description": "Explore the possibilities across our global house of brands.<br><br>Defined by inclusivity rather than exclusivity, Tapestry embraces the exploration of individuality and invests in helping you grow personally and professionally. Every individual in our global house has the opportunity to make an impact, learn and be part of our growing and unique story.<br><br>At Tapestry, we have the freedom to express ourselves and run with our best ideas across Coach, Kate Spade New York, and Stuart Weitzman. We share a profound belief in both our individual and collective potential, and know that with hard work and dedication, anything is possible.<br><br><strong>Tapestry will be offering internship opportunities which will provide interns the opportunity to develop critical skillsets and gain hands-on experience at our house of modern luxury lifestyle brands.<br><br></strong><strong>The 2021 program will run from June 1st - August 6th. Paid internship opportunities will be available at each of our brands (Coach, kate spade, Stuart Weitzman) and within Tapestry functional groups. <br><br></strong><strong>Here’s what you can expect from our internship recruitment process:<br><br></strong><ul><li><u>Application Deadline</u> - January 11th. </li><li><u>Video Submissions</u> - Should your application be selected for further consideration, you will receive an email prompt for the video submission portion of the application in mid to late-January.</li><li><u>Final Interviews</u> - Our teams will be selecting final candidates for phone or video interviews in early to mid-February depending on candidate availability.</li><li><u>Internship Offers</u> - Delivered in early March. <br><br></li></ul><strong>Job Title: </strong>Summer IT &amp; Data Science Internships<br><br><strong>Primary Purpose:</strong> The successful individual will leverage their proficiency in IT, Data Science and/or Analytics to work within the Tapestry corporate team.*<br><br><li>Our Internship recruiting team will be selecting candidates based on relevant skillsets that could be applicable to internship opportunities within the following departments: Information Security, eCommerce Solutions, Commerce Solutions, Tech Services, Data Labs/Analytics.<br><br></li><strong>The accomplished individual may possess... <br><br></strong><ul><li>Excellent written and oral communication skills</li><li>The path to a BA/BS degree with a focus in Computer Science, Cyber Security, or related field. </li><li>The path to a BA/BS degree in Media Science, Economics, Statistics, Engineering, Math or other quantitative field (or equivalent practical experience).</li><li>Familiarity with analytics (media industry, social, digital marketing).</li><li>In-depth knowledge of Windows, Mac and Linux operating systems </li><li>Strong proficiency in LAN/WAN and WiFi/mobile technology </li><li>Understanding of networking hierarchy and protocols </li><li>Basic concepts of computer triage and forensics <br><br></li></ul><strong>An outstanding professional may have... <br><br></strong><ul><li>Experience with HTML/CSS, Javascript/JQuery, Git/Github</li><li>Routing, Switching, Firewalling knowledge </li><li>Knowledge of WiFi networks, security measures, threat countermeasures</li><li>In-depth understanding of how the Internet works (DNS, TCP/IP, etc.)</li><li>In-depth understanding of secure Internet communication (IPSEC, VPN, encryption, etc.)</li><li>Strong understanding of transport technologies (T1, T3, MPLS, Fiber, Ethernet, DSL, 4G, etc.)<br></li></ul><strong>Our Competencies for All Employees<br><br></strong><ul><li><strong>Drive for Results:</strong> Can be counted on to exceed goals successfully; is constantly and consistently one of the top performers; very bottom-line oriented; steadfastly pushes self and others for results.</li><li><strong>Customer Focus:</strong> Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</li><li><strong>Creativity</strong>: Comes up with a lot of new and unique ideas; easily makes connections among previously unrelated notions; tends to be seen as original and value-added in brainstorming settings.</li><li><strong>Interpersonal Savvy</strong>: Relates well to all kinds of people, up, down, and sideways, inside and outside the organization; builds appropriate rapport; builds constructive and effective relationships; uses diplomacy and tact; can diffuse even high-tension situations comfortably.</li><li><strong>Learning on the Fly:</strong> Learns quickly when facing new problems; a relentless and versatile learner; open to change; analyzes both successes and failures for clues to improvement; experiments and will try anything to find solutions; enjoys the challenge of unfamiliar tasks; quickly grasps the essence and the underlying structure of anything.</li><li><strong>Perseverance</strong>: Pursues everything with energy, drive, and a need to finish; seldom gives up before finishing, especially in the face of resistance or setbacks.</li><li><strong>Dealing with Ambiguity</strong>: Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; isn’t upset when things are up in the air; doesn’t have to finish things before moving on; can comfortably handle risk and uncertainty.<br></li></ul><strong>Our Competencies for All People Managers<br><br></strong><ul><li><strong>Strategic Agility</strong>: Sees ahead clearly; can anticipate future consequences and trends accurately; has broad knowledge and perspective; is future oriented; can articulately paint credible pictures and visions of possibilities and likelihoods; can create competitive and breakthrough strategies and plans.</li><li><strong>Building Effective Teams</strong>: Blends people into teams when needed; creates strong morale and spirit in their team; shares wins and successes; fosters open dialogue; lets people finish and be responsible for their work; defines success in terms of the whole team; creates a feeling of belonging in the team.</li><li><strong>Managerial Courage</strong>: Doesn’t hold back anything that needs to be said; provides current, direct, complete, and “actionable” positive and corrective feedback to others; lets people know where they stand; faces up to people problems on any person or situation (not including direct reports) quickly and directly; is not afraid to take negative action when necessary.<br><br></li></ul>Tapestry, Inc. is an equal opportunity and affirmative action employer and we pride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring, promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’s qualifications as they relate to the requirements of the position under consideration. These decisions are made without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. Visit Tapestry, Inc. at http://www.tapestry.com/<br><br>"
    },
    {
        "position": "Software Engineering, Research and Development Intern",
        "company": "Niantic, Inc.",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-11-15T01:14:36.380Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-research-and-development-intern-at-niantic-inc-2315526941?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=A5iObamHVdosKt%2FHLW133g%3D%3D&position=5&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:36.380Z",
        "description": "Niantic's Research and Development team is seeking PhD-students, who are passionate about inventing new algorithms, to join us for a 3-month research internship to work on computer vision and learning, alongside our growing team of researchers in central London. We work on projects that fit under the broad umbrella of artificial intelligence for augmented reality, including deep or shallow machine learning models, tracking, 3D reconstruction, localization, and graphics for mixed reality. We're excited for you to explore the best problems in vision with us.<br><br>Priority application date: 3rd December<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Dig deep into a fun computer vision and machine learning topic, becoming a specialist, and breaking new ground.</li> <li>You will discover ways to automatically understand imagery and/or telemetry from the real world, to track, reconstruct, localize, synthesize, or recognize more accurately or more efficiently.</li> <li>You will work alongside our other researchers, accepting help and aiding others, to make discoveries that will eventually help the Niantic Real World Platform, as it gets deployed for Niantic and outside developers alike.</li> </ul> <strong>Qualifications<br></strong><ul> <li>You are enrolled in a PhD program in computer science or a related field, with a focus on computer vision, robotics, AR, or machine learning.</li> <li>Experience building your own software systems in Python or C++, wrangling 2D and/or 3D data, training models, and running experiments.</li> <li>You are proficient at finding, reading, and efficiently critiquing and experimentally assessing published research papers.</li> <li>Experience writing technical papers in English for a scientific audience.</li> </ul> <strong>Plus If…<br></strong><ul> <li>You have had 1+ papers accepted to ICCV / NeurIPS / IROS / ISMAR / SIGGRAPH type conferences.</li> <li>Experience building fast or efficient computer vision systems.</li> <li>You're able to design your own architectures within a deep learning framework (e.g. PyTorch, Tensorflow, or similar).</li> <li>You have experience collecting or organizing data to validate your research.</li> </ul> <strong><strong>Join the Niantic team!<br></strong></strong>Niantic is the world’s leading AR technology company, sparking creative and engaging journeys in the real world. Our products inspire outdoor exploration, exercise, and meaningful social interaction.<br><br>Originally formed at Google in 2011, we became an independent company in 2015 with a strong group of investors including Nintendo, The Pokémon Company, and Alsop Louie Partners. Our current titles include pioneering global-control game Ingress, record-breaking AR game Pokémon GO, and recently released third title, Harry Potter: Wizards Unite.<br><br>Niantic is an Equal Opportunity employer. We believe that cultivating a workplace where our people are supported and included is essential to creating great products our community will love. Our mission emphasizes seeking and hiring diverse voices, including those who are traditionally underrepresented in the technology industry, and we consider this to be one of the most important values we hold close.<br><br>We're a hard-working, fun, and exciting group who value intellectual curiosity and a passion for problem-solving! We have growing offices located in San Francisco, Sunnyvale, Bellevue, Los Angeles, London, Tokyo, Hamburg, and Zurich."
    },
    {
        "position": "Software Engineering Intern",
        "company": "HashiCorp",
        "location": {
            "city": "Oakland",
            "state": "CA"
        },
        "posted": "2020-12-03T01:14:36.861Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-hashicorp-2232889276?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=8a%2Bihb1O6GXXsJsHhBcRIA%3D%3D&position=6&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:36.861Z",
        "description": "<strong>Software Engineer Intern<br><br></strong><strong><u>About HashiCorp<br><br></u></strong>HashiCorp is a fast-growing startup that solves development, operations, and security challenges in infrastructure so organizations can focus on business-critical tasks. We build products to give organizations a consistent way to manage their move to cloud-based IT infrastructures for running their applications. Our products enable companies large and small to mix and match AWS, Microsoft Azure, Google Cloud, and other clouds as well as on-premises environments, easing their ability to deliver new applications for their business.<br><br><strong><u>About The Role<br><br></u></strong>At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.<br><br>Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.<br><br>This role is for a Software Engineering Intern on one of the Vault, Terraform, or Cloud teams at HashiCorp. Each of these teams works on both open source and enterprise versions of each tool, programming primarily in Go with a focus on stability, reliability, performance, and security. Our infrastructure tools are used in critical environments and operated by a range of organizations and individuals to solve infrastructure management problems.<br><br>This role provides an opportunity to help design, prototype, and implement core features while ensuring the stability of the product across a range of use-cases. Our teams work can be viewed on GitHub in the products (for Vault, Terraform, or Consul) or in libraries our teams depend on, like raft, memberlist, and go-plugin.<br><br><strong>In this role, you can expect to learn how to...<br></strong><ul> <li>Contribute to the HashiCorp community by providing code review, and support to HashiCorp employees, community members, and partners</li> <li>Advocate and support improvements to product APIs and core to improve development and integration of tools and plugins</li> <li>Build and architect systems for managing extremely large-scale global fleets of resources</li> <li>Work on issues and improvements critical to the success of HashiCorp customers and the broader community</li> <li>Own the full lifecycle of feature development from design through testing and release</li> <li>Program in Golang, learning from and contributing to a team committed to continually improving their skills</li> <br></ul><strong>You may be a good fit for our team if you...<br></strong><ul> <li>Are currently pursuing a bachelor's degree in Engineering, Computer Science or equivalent training in the United States</li> <li>Have academic or some professional experience working in a professional environment is preferred</li> <li>Have some proficiency in Go, Python, Java, or C++</li> <li>Have fundamental knowledge in security, distributed systems, service oriented architectures or schedulers</li> <li>Have excellent analytical and problem-solving skills</li> <li>Have the ability to work in a fast paced, team-based environment</li> <li>Exhibit ownership in your work, including research and understanding of the problem space, collaborating with the team to come up with solutions, proactively communicating your progress to the team, and shipping the feature over the finish line</li> <li>Have strong written and verbal communication skills</li> <li>Are well-organized, excellent work ethic, attention to detail, self-starting, and an ability to learn</li> <li>Are creative thinkers who also understand real-world products </li> <li>Have the constant desire to grow, learn, and explore new things</li> <li>Emulate the HashiCorp principles</li> <br></ul>Please submit a cover letter that demonstrates your writing skills and tells us about your interest in being part of the HashiCorp story.<br><br>At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you meet our requirements, please apply anyway! If you are interested in working on a specific tool or product, please note it in your cover letter. Candidates participate with hiring managers in team selection to ensure the right fit."
    },
    {
        "position": "Computer Science Engineering Internship",
        "company": "Musco Lighting",
        "location": {
            "city": "Oskaloosa",
            "state": "IA"
        },
        "posted": "2020-11-15T01:14:37.186Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-engineering-internship-at-musco-lighting-2325965402?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=yNam5SiuvUBgepYqCTjPrg%3D%3D&position=7&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:37.186Z",
        "description": "Musco Lighting, the leader in the sports lighting industry, has internship opportunities for people who want to work with a team that is large enough to provide world-class opportunities, small enough for each intern to make a difference. Our company is seeking an energetic, responsible Computer Science student to join our growing internship program. In this position, you will be working with our Research &amp; Development teams in Oskaloosa, Iowa. This position is for the summer of 2020.<br><br><strong><u>Database Development<br><br></u></strong><strong>Intern Duties and Responsibilities:<br></strong><ul> <li>Develop SQL applications, query development, implementation of SQL server triggers</li> <br><br></ul><strong><u>Test Data Analysis<br></u></strong><ul> <li>Develop custom code to automate the data analysis process utilizing specialized controls in the software developers kit (SDK) provided by the manufacturer.</li> <br><br></ul><strong><u>Intern Requirements And Qualifications<br></u></strong><ul> <li>High school degree or equivalent; must be enrolled in an accredited university/college program</li> <li>Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel)</li> <li>Must be 18 years of age</li> <li>Excellent written and verbal communication skills</li> <li>Self-directed and able to work without supervision</li> <li>Energetic and eager to tackle new projects and ideas </li> <br></ul><strong>Behaviors<br><br></strong><strong><u>Preferred<br></u></strong><ul> <li>Innovative: Consistently introduces new ideas and demonstrates original thinking</li> <li>Enthusiastic: Shows intense and eager enjoyment and interest</li> <li>Detail Oriented: Capable of carrying out a given task with all details necessary to get the task done well</li> <br></ul><strong>Motivations<br><br></strong><strong><u>Preferred<br></u></strong><ul> <li>Self-Starter: Inspired to perform without outside help</li> <li>Goal Completion: Inspired to perform well by the completion of tasks</li> <br></ul>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br><br>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)"
    },
    {
        "position": "Summer IT Computer Science Internship - Buffalo, NY",
        "company": "Moog Inc.",
        "location": {
            "city": "East Aurora",
            "state": "NY"
        },
        "posted": "2020-11-15T01:14:37.575Z",
        "url": "https://www.linkedin.com/jobs/view/summer-it-computer-science-internship-buffalo-ny-at-moog-inc-2315727920?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=cM0Cz%2BiP%2BpypA0ORJg%2BxoQ%3D%3D&position=8&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:37.575Z",
        "description": "<strong><em>This is not work experience, this is an opportunity to experience work.<br><br></em></strong>An Intern is an investment in Moog’s future. The intern relationship provides a three-way benefit between the student, university, and Moog. It is an opportunity for the student to incorporate classroom learning into professional, real world situations. The student brings new ideas to Moog on how to tackle projects and challenges, while Moog benefits from fresh perspectives from the brightest students in their respective fields of study. By having the students work on actual programs, we also work towards solving our customers’ most difficult technical challenges<em>.<br><br></em><strong>Moog’s Corporate Group, in the Buffalo, NY area, is seeking IT and Computer Science students for Summer Internships &amp; Co-Ops!<br><br></strong>As part of the Moog U.S. Internship Program, this position provides strategic and tactical support to programmers, analysts, project leaders, and end-users on application development. Information Technology (IT) work is carried out in support of Moog's engineering, manufacturing, business, and e-business activities.<br><br>The student will contribute to their respective departments with the application of standard techniques, procedures, and criteria in carrying out a variety of tasks.<br><br>The student will work on discipline-focused projects and tasks to enhance their collegiate learning experience, while providing meaningful contributions to the Moog IT Team(s).<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Contribute to the preparation and execution of key IT projects at Moog.</li> <li>Provide input on project processes, strategies, and execution.</li> <li>Operate as a multidisciplinary member of the team of creative, independent individuals.</li> <li>Represent Moog in a manner consistent with its technical and professional reputation.</li> <li>Work experience may include (but is not limited to) database administration, network administration, configuration management, SharePoint Administration, and operations.</li> <li>Application development activities could include research, requirements definition, analysis, design, coding, testing and documentation. </li> <li>The student may also be given opportunities to explore newer technologies or apply course training at Moog.</li> <br><br></ul><strong><u>Basic Requirements<br></u></strong><ul> <li>Enrollment in Bachelor's or Master's curriculum in Information Technology, or Computer Science, from an accredited university</li> <li>GPA of <u>at least</u> 3.0</li> <li>This position requires access to U.S. export-controlled information.</li> <li>Due to the current and changing COVID-19 restrictions, relocation may not be possible for certain assignments.</li> <br><br></ul><strong>Students within the Moog U.S. Internship Program are expected to have a professional disposition, with effective communication skills, a strong desire to learn, a positive attitude, and the ability to work in a team environment.<br><br></strong><li>Please note this requisition is for sourcing purposes and will be used to fill individual openings as they become available.<br><br></li>EOE/AA Minority/Female/Disability/Veteran/Sexual Orientation/Gender Identity"
    },
    {
        "position": "Data Science Intern",
        "company": "The Goodyear Tire & Rubber Company",
        "location": {
            "city": "Akron",
            "state": "OH"
        },
        "posted": "2020-11-22T01:14:38.024Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-the-goodyear-tire-rubber-company-2202274247?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=hi4CQhizCk6wx0YmrsyZ1A%3D%3D&position=9&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:38.024Z",
        "description": "<strong>Goodyear. More Driven.<br><br></strong><strong><u>Global Technology (Data Science and Analytics) Co-op / Intern<br><br></u></strong><strong><u>Company Information<br><br></u></strong>Goodyear is one of the world’s largest tire companies. It employs about 63,000 people and manufactures its products in 46 facilities in 21 countries around the world. Its two Innovation Centers in Akron, Ohio and Colmar-Berg, Luxembourg strive to develop state-of-the-art products and services that set the technology and performance standard for the industry. At Goodyear, we embrace the diversity of our workforce and value the contribution of our associates. We strive to provide associates with a safe work environment, the resources they need to do their jobs, and ample opportunities for growth. These objectives, coupled with competitive compensation and benefits, allow us to foster an environment where associates can work to achieve their full potential and contribute to the company's success. For more information, go to www.goodyear.com/corporate.<br><br><strong><u>Program Description<br><br></u></strong>The Goodyear Tire &amp; Rubber Company, headquartered in Akron, Ohio, is looking for talented leaders to significantly strengthen its global leadership depth and play an integral role in the current and future success of the organization. The Global Technology Co-op/Intern Program provides students with practical work experience in one of many diverse areas of Global Technology<strong>.</strong> The program allows the organization to build a pipeline of candidates for future permanent openings, and the students gain a better understanding of the various job opportunities available throughout Goodyear.<br><br>Ideally, many of the Global Technology co-ops and interns become permanent Goodyear associates after graduation.<br><br>In addition to challenging, engaging and interesting work assignments, students have the opportunity to meet and interact with students from other universities at work and outside of work. Tours of Goodyear facilities are arranged to help students learn more about the business. Goodyear leaders make presentations to help students begin to think about significant business issues and career options. Students even have the opportunity to speak with the Goodyear Senior Leadership Team.<br><br><strong><u>Requirements<br><br></u></strong>Currently pursuing a Master’s Degree or PhD in one of the following areas: Computer Science, Data Science, Statistics, or any other relevant field<br><ul><li>Minimum 3.0 overall GPA required</li><li>Must have completed one year of classes prior to internship</li><li>Must have experience coding with R, Python or SQL </li><li>Prior data science related co-op/internship experience preferred</li><li>Demonstrated leadership and strong communication skills <br></li></ul><strong><u>To Apply<br><br></u></strong>It is required that you go to <strong>campus.goodyear.com</strong> to create your candidate profile in order to be eligible for this position. Applicants must be legally authorized to work in the U.S. Goodyear is an Affirmative Action and Equal Opportunity Employer.<br><br>Goodyear is one of the world’s largest tire companies. It employs about 63,000 people and manufactures its products in 46 facilities in 21 countries around the world. Its two Innovation Centers in Akron, Ohio and Colmar-Berg, Luxembourg strive to develop state-of-the-art products and services that set the technology and performance standard for the industry. For more information about Goodyear and its products, go to www.goodyear.com/corporate."
    },
    {
        "position": "Intern - Data Science - Summer 2021",
        "company": "Xylem Inc.",
        "location": {
            "city": "Morrisville",
            "state": "NC"
        },
        "posted": "2020-12-06T01:14:38.384Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-summer-2021-at-xylem-inc-2329915477?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=fzp9UDo2socXGEhzIyWhdA%3D%3D&position=10&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:38.384Z",
        "description": "<strong><u>Description<br><br></u></strong>Xylem |ˈzīləm|<br><br><li> The tissue in plants that brings water upward from the roots;</li><li> a leading global water technology company.<br><br></li>Xylem, a leading global water technology company dedicated to solving the world’s most challenging water issues, is the leading global provider of efficient, innovative and sustainable water technologies improving the way water is used, managed, conserved and re-used. Our international team is unified in a common purpose: creating advanced technology and other trusted solutions to solve the world’s water challenges. We are committed to creating an organization of inclusion and diversity, where everyone feels involved, respected, valued and connected, and where everyone is free to bring their authentic selves and ideas.<br><br>If you are excited and passionate about helping us #letssolvewater, we want to hear from you! For more information, please visit us at www.xylem.com .<br><br><strong>We Offer You More Than Just “A Job”<br></strong><ul><li>Professional Development – To advance the capabilities of our people, we offer a wide variety of experiences to support our employees’ professional growth and continuous learning.</li><li>Total Rewards – We offer comprehensive programs for compensation, benefits, recognition, learning and development, work-life integration and corporate citizenship.</li><li>Watermark – Watermark is our corporate social responsibility program working to provide education and access to safe water to ensure healthy lives, gender equality, and resilient communities. Employees have the opportunity to learn and volunteer on various water-related projects.</li><li>Employee Networks – Our Employee Networks provide a professional, supportive network for employees from diverse backgrounds, including Women’s, LGBT+ and Allies, Veteran’s, People of Color and Allies, Emerging Leaders, and Working Parents Networks.<br></li></ul><strong>The Role: </strong>Xylem is seeking Intern Candidates with a Software Engineering or Data Science background to join our Data Lake/Data Science team of Cloud Engineers/Data Scientists. As a member of our Team, the incumbent will design, develop and test software applications or machine learning algorithms running in our Amazon Web Services Cloud environment. The successful candidate will have demonstrated the ability to succeed in a fast paced, fluid environment, while ensuring that project initiatives are met. If you are excited and passionate to work on state-of-the art technology trends such as Cloud Web Services, Machine Learning/AI, we want to hear from you!<br><br><strong><u>Essential Duties/Principal Responsibilities<br></u></strong><ul><li>Wants to build game-changing software applications and analytics tools</li><li>Takes great personal pride in building robust software</li><li>Has strong sense of ownership and drive</li><li>Is passionate about applications, analytics, storage and distributed systems</li><li>Enjoys working in a fast-paced agile environment using Scrum</li><li>Has excellent written and verbal communication skills</li><li>Has strong customer focus<br></li></ul><strong>Minimum Qualifications: Education, Experience, Skills, Abilities, License/Certification:<br></strong><ul><li>Attending an accredited University studying toward a Bachelor’s of Science degree in Computer Science or equivalent.</li><li>Minimum rising junior in standing</li><li>Minimum GPA of 3.0</li><li>Exposure to object-oriented design and coding languages such as Java, and/or C++, preferably on a Linux platform developing Systems software</li><li>Exposure to data structures and algorithms if the candidate prefers to do cloud software engineering work. OR Exposure to Machine Learning algorithms/techniques/libraries if the candidate prefers to do data science work.</li><li>Ability to work collaboratively within a team environment of engineers to meet aggressive goals and high-quality standards</li><li>Demonstrated experience working with cross functional teams<br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Have knowledge of basic security considerations when developing enterprise software</li><li>Have experience with online distributed systems and platform infrastructure design and implementation</li><li>Have experience using SQL against data sets with record counts in the millions and billions of records</li><li>Have experience with Amazon Web Services<br><br></li></ul><strong><u>Physical Demands<br><br></u></strong>(The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)<br><ul><li>Regularly required to sit or stand, reach, bend and move about the facility<br><br></li></ul><strong><u>Work Environment<br><br></u></strong>(The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)<br><ul><li>Office: Standard office equipment; work usually performed in an office setting free from any disagreeable elements.</li><li>Standard weekly job hours: 40 hours<br></li></ul><em>Xylem is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.</em>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Centauri",
        "location": {
            "city": "Chantilly",
            "state": "VA"
        },
        "posted": "2020-11-22T01:14:38.806Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-centauri-2311443612?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=eZYE0u1z%2FEY5por1bdA3yw%3D%3D&position=11&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:38.806Z",
        "description": "Centauri is a software and system engineering company headquartered in Chantilly, Virginia with offices Nationwide. Centauri has been selected as one of the best companies to work for in America by The Great Place to Work Institute and as one of the top employers in the DC Metro area by the Washingtonian Magazine. We are always looking for bright, innovative and talented people to join our team of highly skilled professionals. Centauri offers challenging work, competitive salaries, an incentive bonus program and top notch health and welfare benefits for you and your family.<br><br>This position is for that of an Intern level Software Engineer contributing to a application-server style project in support of a local pharmaceutical company. A successful candidate will step into a fully operational Agile software team, participating in every facet: from planning, to execution, to retrospectives. The engineer will interact with our customers to help derive requirements and develop features that satisfy those requirements. This position also involves building testing suites that automate testing of our software and ensure that those tests accurately cover the design requirements of our customers.<br><br><strong><u>Qualifications<br></u></strong><ul> <li> Bachelor’s Degree (in the works) in Computer Science, Software Engineering, Computer Engineering, or any other scientific/engineering/technical degree with appropriate experience. </li> <li> Experience with Python, Javascript/jQuery, HTML,CSS, Django, Bootstrap, and Datatables is preferable. </li> <br></ul><strong>Security Requirements:</strong> Must be eligible for a government security clearance"
    },
    {
        "position": "Software Engineer Summer Intern",
        "company": "GoHealth",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2020-11-08T01:14:39.220Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-summer-intern-at-gohealth-2286353865?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=b6gMwvSG05LHa1%2FyUPXq8g%3D%3D&position=12&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:39.220Z",
        "description": "GoHealth is looking for Software Engineer interns to join us in the summer of 2021. You will receive projects and daily work providing both challenging and fulfilling experiences in helping shape your skill development. At GoHealth, you’ll solve problems to create an impact for consumers across the country. We promote a comprehensive learning environment fostered by senior engineers who will encourage you to think outside the box and share new ideas every day. You’ll be given the opportunity to work with modern technologies and experience first-hand what a career with us looks like!<br><br><strong>Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. GoHealth encourages you to break that statistic and to apply. No one ever meets 100% of the qualifications. We look forward to your application.<br><br></strong><strong><u>Responsibilities<br></u></strong><ul> <li>Partner with software engineers to assist developing web-based software solutions</li> <li>Work with partners to design complex solutions from creation to production</li> <li>Develop solutions using the latest technologies to meet needs</li> <li>Learn coding best practices and participate in coding reviews</li> <li>Help debug common components within several GoHealth platforms</li> <li>Participate in technical discussions related to engineering/product work</li> <li>Compile accurate documentation and reports</li> <li>Work with departments outside of software engineering on several projects </li> <br><br></ul><strong><u>Skills And Experience<br></u></strong><ul> <li>Junior or Master’s student pursuing a degree in computer science, computer engineering or related field</li> <li>Desire to enhance programming skills in TypeScript, React.js, Java, Go, and Python</li> <li>A passion for solving complex technical problems</li> <li>Advanced knowledge on computer science fundamentals</li> <li>Ability to communicate effectively in a collaborative, fast-paced technical environment</li> <li>Excellent verbal and written communication skills</li> <li>Academic performance (minimum GPA = 3.5/4.0)</li> <br><br></ul><strong><u>Benefits And Perks<br></u></strong><ul> <li>10-week paid internship <em>(starting June 2021)</em> in the trendy River North Neighborhood in downtown Chicago<em>. </em>Subject to change remotely pending status of COVID-19</li> <li>Casual work environment - we’re a friendly group, we have fun with each other and have a respectful workplace</li> <li>Rotational days to shadow other areas of the business</li> <li>Interactive Lunch &amp; Learns with C-Suite</li> <li>Continued training opportunities through GoHealth E-Learning series</li> <li>Casual dress-code</li> <li>GoHealth is an Equal Opportunity Employer</li> <br></ul><strong><em>GoHealth will conduct all interviews for our internships remotely. While we intend to have the internship program (beginning June 2021) at our Chicago Headquarters, we are prepared to move this program virtual following the guidance of local health authorities’ and the CDC.</em></strong>"
    },
    {
        "position": "Pinterest Labs Research Intern",
        "company": "Pinterest",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-12-06T01:14:39.605Z",
        "url": "https://ca.linkedin.com/jobs/view/pinterest-labs-research-intern-at-pinterest-2193870375?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=MUghhaR5lLa%2BJwNzSRxqAQ%3D%3D&position=13&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:39.605Z",
        "description": "<strong>PLEASE ONLY APPLY FOR THIS POSITION ONCE. Location preferences are specified within the application. Multiple applications may delay our recruitment process.<br><br></strong><strong><u>About Pinterest<br><br></u></strong>Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. As a Pinterest employee, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping users make their lives better in the positive corner of the internet.<br><br>As a research intern at Pinterest Labs, you'll work on tackling new challenges in machine learning and artificial intelligence. You'll conduct research that can be applied across Pinterest engineering teams and engage in external collaborations and mentoring, while also performing research in any of the following areas: image recognition, user modeling, recommender systems, natural language processing, and big data analytics. We offer a 12-week summer internship program in our San Francisco, Palo Alto, Seattle and Toronto offices.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li>Participate in cutting-edge research in machine learning and artificial intelligence</li> <li>Contribute research that can be applied to Pinterest problems</li> <li>Collect, analyze, and synthesize findings from data and build intelligent data-driven model</li> <li>Write clean, efficient, and sustainable code</li> <li>Use machine learning, natural language processing, and graph analysis to solve modeling and ranking problems across discovery, ads and search</li> <br><br></ul><strong><u>What We’re Looking For<br></u></strong><ul> <li>Working towards a PhD in Computer Science, ML, NLP, Statistics, Information Sciences or related field</li> <li>Mastery of at least one systems languages (Java, C++, Python) or one ML framework (Tensorflow, Pytorch, MLFlow)</li> <li>Experience in research and in solving analytical problems</li> <li>Strong communicator and team player. Being able to find solutions for open-ended problems</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Publications in machine learning, AI, data science, data analytics, statistics, or related technical fields</li> <li>Strong passion for research and for answering hard questions with research</li> <li>Passion for applied ML and the Pinterest product</li></ul>"
    },
    {
        "position": "Embedded Software Engineering Intern",
        "company": "Danfoss",
        "location": {
            "city": "Loves Park",
            "state": "IL"
        },
        "posted": "2020-11-22T01:14:39.983Z",
        "url": "https://www.linkedin.com/jobs/view/embedded-software-engineering-intern-at-danfoss-2316886758?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=UNSsJjTFDXm5vTSw%2F7SuHg%3D%3D&position=14&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:39.983Z",
        "description": "<strong><u>Job Description<br><br></u></strong>Danfoss in Loves Park, IL seeks <strong>Embedded Software Engineering Interns</strong> to support new product development for Summer 2021. The preferred candidates will be at junior standing or above studying Software or Computer Engineering, or Computer Science.<br><br><strong><u>Job Responsibilities<br><br></u></strong>Responsibilities for this position include, but are not limited to, the following.<br><ul> <li>Contribute to new product development as part of a Scrum team.</li> <li>Know and follow software engineering best practices.</li> <li>Design, develop, debug, test, maintain, and deliver software features.</li> <li>Work with: C++, Simulink, Azure DevOps, Git, Python, and PLC application development.</li> <li>Other duties as required. </li> <br><br></ul><strong><u>Background &amp; Skills<br></u></strong><ul> <li>Must be pursuing a bachelor’s degree or master’s degree in Software Engineering, Computer Science, Electrical Engineering, or Computer Engineering.</li> <li>Strong communication skills.</li> <li>Will be a junior or a senior during the fall semester. </li> <li>Experience with C++ is preferred.</li> <li>Knowledge of Matlab / Simulink, Python, and DevOps is desired.</li> <li>Interested in learning about embedded software engineering/technologies that are used to develop embedded code for industrial products.</li> <br><br></ul><strong>Danfoss – Engineering Tomorrow<br><br></strong>At Danfoss, we are engineering solutions that allow the world to use resources in smarter ways – driving the sustainable transformation of tomorrow. No transformation has ever been started without a group of passionate, dedicated and empowered people. We believe that innovation and great results are driven by the right mix of people with diverse backgrounds, personalities, skills, and perspectives, reflecting the world in which we do business. To make sure the mix of people works, we strive to create an inclusive work environment where people of all backgrounds are treated equally, respected, and valued for who they are. It is a strong priority within Danfoss to improve the health, working environment and safety of our employees.<br><br>Following our founder’s mindset ‘action speaks louder than words’, we set ourselves ambitious targets to protect the environment by embarking on a plan to become CO2 neutral latest by 2030.<br><br>Danfoss is an EO employer and VEVRAA Federal Contractor. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, veteran status, or other protected category."
    },
    {
        "position": "Software Engineer Intern, Manufacturing",
        "company": "Wing",
        "location": {
            "city": "Palo Alto",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:40.602Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-manufacturing-at-wing-2315385831?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=EQWVA8fQp7EYxfyVVs3Elg%3D%3D&position=15&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:40.602Z",
        "description": "<strong>About Wing: <br><br></strong>Wing is reshaping the future of delivery. We are an on-demand drone delivery service that can deliver food, medicine or other items within minutes. We've also developed an unmanned traffic management platform to safely route drones through the sky. Our service is faster, safer and produces far less pollution than traditional delivery. Originally created in 2012 within X, the Moonshot Factory, Wing is now an Alphabet company.<br><br><strong>About the Program: <br><br></strong>Wing's Summer 2021 internship will take place virtually in the United States. This 12 week program is for students in their graduating year of school. We will review applications and interview candidates on a rolling basis until March 2021.<br><br>Students from all schools, and students who identify with a group that is historically underrepresented in the technology industry are encouraged to apply. This includes but is not limited to: Black/African American, Latinx/Hispanic, Native American, students with disabilities, veterans, and non-binary people.<br><br><strong>About the Role: <br><br></strong>Wing is looking for an intern to join the Manufacturing team! This candidate will develop infrastructure and test automation systems for aircraft manufacturing and activation. Team members work in a highly cross-functional and dynamic environment with internal teams and external vendors.<br><br><strong>What You'll Need: <br><br></strong><ul> <li>Proficiency in object oriented languages such as Python</li> <li>Experience with linux, embedded systems, testing and design, systems software and/or hardware</li> <li>Excellent communication skills and the ability to work in a collaborative team </li> <li>Currently pursuing a Bachelor's, Masters or PhD degree in Computer Science, Electrical Engineering or related field, with an anticipated graduation date after December 2021</li> <li>Strong examples of hands-on engineering experience from university programs, internships, or student organizations</li> <br></ul><strong>Bonus: <br><br></strong><ul> <li>Passion for aviation, drones, or related technologies</li> <li>Experience developing your own side projects with ideas you're passionate about</li> <li>Knowledge in the one or more of following technologies: GPS, Wifi, Cellular, Depth Sensing, Camera Systems, Linux Systems</li> <li>Experience working with hardware interfaces such as USB, UART, SSH, SCPI, or CAN</li> <br></ul><strong>Note: <br><br></strong>Participation in the internship program requires that you are located in the United States for the duration of the internship program. Individuals applying for this position will not be eligible for immigration sponsorship."
    },
    {
        "position": "Backend Engineer - Intern (Summer 2021)",
        "company": "Wealthfront",
        "location": {
            "city": "Palo Alto",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:41.006Z",
        "url": "https://www.linkedin.com/jobs/view/backend-engineer-intern-summer-2021-at-wealthfront-2176665924?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=p2fMJzCfyNJnx2Ck9Aa8lQ%3D%3D&position=16&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:41.006Z",
        "description": "Wealthfront is building a financial system that favors people not institutions. Our employees enable our clients to achieve their financial goals by developing sophisticated algorithms and investment strategies, intuitive user experiences, and scalable infrastructure to continuously deploy mission-critical code. Join us as we help clients create their roadmap to financial freedom!<br><br><strong><u>Responsibilities<br></u></strong><ul><ul><li>Design, implement, test and maintain logic and components anywhere in the stack</li><li>Design and build systems with automated instrumentation and monitoring</li><li>Live and breathe resiliency and uptime</li><li>Consistently improve maintainability and stability of the codebase<br><br></li></ul></ul><strong><u>Requirements<br></u></strong><ul><ul><li>Must graduate in June 2022 or Fall 2021</li><li>Expertise in Java or similar language (such as C++ or C#)</li><li>Experience with online data stores (preferably MySQL / MariaDB)</li><li>Experience with at least one scripting language</li><li>Passion for agile, test-driven development</li><li>Solid understanding of distributed systems and functional programming paradigms</li><li>Pursuing BS, MS, or PhD in computer science or related field<br><br></li></ul></ul>Everyone across the financial spectrum deserves to live secure and rewarding lives. In order to successfully serve clients across the United States, the Wealthfront team is focused on hiring team members with a diverse range of backgrounds, experiences and perspectives. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong><u>About Wealthfront<br><br></u></strong>Wealthfront is a nextgen banking service. We help you manage your money for both your short-term and long-term goals by providing a cash account with a top-of-market APY, best-in-class automated investment management, and free financial advice, anytime you want it.<br><br>Our ultimate vision is to optimize and automate all of our clients’ finances and build what we call Self-Driving Money™️. We want clients to be able to automatically deposit their paycheck into their Wealthfront account, and let us take care of the rest — paying their bills, topping off their emergency fund or 401(k), and investing the rest based on their specific goals and lifestyle. To get there, we’ll be focusing the bulk of our 2020 efforts on creating a better alternative to what the banking industry provides. Join us so you can help us turn this industry on its head and build a service that our clients don't just like, they love."
    },
    {
        "position": "URBN: Summer 2021 IT Internships: Software Engineering",
        "company": "URBN (Urban Outfitters, Anthropologie Group, Free People & Nuuly)",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2020-11-15T01:14:41.382Z",
        "url": "https://www.linkedin.com/jobs/view/urbn-summer-2021-it-internships-software-engineering-at-urbn-urban-outfitters-anthropologie-group-free-people-nuuly-2318301182?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=fWZA4w0cxJQXndRAslaK7w%3D%3D&position=17&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:41.382Z",
        "description": "At URBN, we pride ourselves on more than just our unique products and successful portfolio of brands. We source the best of the best talent to drive our business forward, and our Interns are a crucial part of that equation. Our Interns have the unique opportunity to gain valuable hands-on experience across a range of departments and brands with exposure to company leaders, engaging workshops/excursions and our creative &amp; entrepreneurial culture.<br><br>URBN is a portfolio of global consumer brands comprised of Urban Outfitters, Anthropologie, Free People, BHLDN, Terrain, Nuuly and URBN Food &amp; Beverage. We create unique retail experiences with an eye toward creativity and a singular focus on pleasing our customer.<br><br>The 2021 Program dates are to be determined. Our Summer Internships typically run from June to August.<br><br><strong>Title<br><br></strong><strong>Software Engineer Intern<br><br></strong><strong><u>Overview<br><br></u></strong>The Software Engineer Intern will be an integral part of each phase of the software development lifecycle including design, development, deployment, testing and maintenance. The primary focus will be on enhancing our Ecommerce platforms supporting the online shopping experience for our brands including Anthropologie.com, UrbanOutfitters.com, FreePeople.com.<br><br><strong><u>What To Expect<br></u></strong><ul> <li>Develop new product features and advance the design of existing code for the Ecommerce applications</li> <li>Opportunity to use programming languages like python, Golang, Javascript, HTML &amp; CSS</li> <li>Opportunity to use databases like MongoDB &amp; Oracle</li> <li>Participate in full software development lifecycle</li> <li>Work on a scrum team with other software engineers, QA and Business Analysts</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Understanding of OO principles and design patterns</li> <li>Enjoys working in a collaborative team setting</li> <li>Self-starter, ready to learn new concepts and technologies. Willing to take on responsibility for new features and develop them from inception to completion</li> <li>Currently pursuing a Bachelor’s Degree in Computer Science or a related field</li> <br><br></ul><strong>Location<br><br></strong>Philadelphia, PA<br><br><strong><u>Application Process<br><br></u></strong><li>Submit a completed application via our careers website<strong>. </strong></li> <li><strong>Complete HireVue: Within 2 weeks of submitting applications, candidates will receive an email with a link to complete a HireVue Video Interview. Candidates will have 2 days to complete this portion of the application once the email is received.</strong></li>"
    },
    {
        "position": "Intern - Computer Science or MIS Intern - Technology Consulting",
        "company": "1898 & Co.",
        "location": {
            "city": "Portland",
            "state": "ME"
        },
        "posted": "2020-11-22T01:14:41.771Z",
        "url": "https://www.linkedin.com/jobs/view/intern-computer-science-or-mis-intern-technology-consulting-at-1898-co-2321378031?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=3a4hrG7feyXPWuSnZfm5jg%3D%3D&position=18&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:41.771Z",
        "description": "<strong><u>Description<br><br></u></strong>An Intern will work collaboratively with our teams to support a Burns &amp; McDonnell Department, Global Practice or Regional Office. This position will provide support and assistance with requests in support of the business strategy.<br><ul> <li>Perform services to include the setup of applications, initial conversion data verification, training on the applications, and go-live assistance.</li> <li>Support colleagues and managers to implement and proactively manage a superior technology solution for our clients.</li> <li>Develop clients' business processes and configure applications based on business needs and accepted best practices.</li> <li>Provide support to clients by leading customers through the implementation process, communicating with those involved to ensure that implementation is completed and any issues are resolved so client can be successfully utilizing the product.</li> <li>Responsible for system set up, administration and maintenance.</li> <li>Document client satisfaction and successful go-live of technology solution.</li> <li>Compile and report solution gaps working closely with senior technical resources to provide impact to future features and functionality of our solutions.</li> <li>Perform quality check and analyze data conversions.</li> <li>Implement, train and make improvements to facilitate the best possible customer experience.</li> <li>Provide ongoing training to clients on an as needed basis both remotely and in-person.</li> <li>Develop user documentation when required.</li> <li>Provide training summaries specific to the client following the training to assist other staff in providing quality customer care.</li> <li>Assist with ad hoc projects as assigned by managers.</li> <li>All other duties as assigned..</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Pursuit of Bachelor's or Master's in Computer Science, MIS, or related degree from an accredited program.</li> <li>Currently enrolled, and in good standing, in a post-secondary education program in a field related to the work done in the department.</li> <li>Minimum of a 3.0 GPA strongly preferred.</li> <li>Prior internship and/or related consulting experience preferred.</li> <li>Actively involved in campus, community or other volunteer activities or organizations.</li> <li>Excellent verbal and written communication skills.</li> <li>Strong problem solving and analytical skills.</li> <li>Basic knowledge and experience in Microsoft Office programs, including, Word, Excel, PowerPoint and Outlook.</li> <li>Demonstrated leadership skills.</li> <li>Self-motivated and eager learner, aptitude to grow and develop within the field.</li> <li>Candidates must be legally authorized to work, without restrictions or without need for work sponsorship, in the country where this position is located, for the duration of the internship.</li> <br></ul>EEO/Minorities/Females/Disabled/Veterans<br><br><strong>Job</strong> Intern<br><br><strong>Primary Location</strong> US-CT-Wallingford<br><br><strong>Other Locations</strong> US-NY-Manhattan, US-ME-Portland<br><br><strong>Travel:</strong> Yes, 5 % of the Time<br><br><strong><u>About 1898 &amp; Co.<br><br></u></strong>1898 &amp; Co. is a business, technology and security solutions consultancy where experience and foresight come together to unlock lasting advancements. We innovate today to fuel our clients’ future growth, catalyzing insights that drive smarter decisions, improve performance and maximize value. As part of Burns &amp; McDonnell, we draw on more than 120 years of deep and broad experience in complex industries as we envision and enable the future for our clients.<br><br><strong>Burns &amp; McDonnell is an Equal Opportunity Employer Minorities/Females/Disabled/Veterans<br><br></strong><strong>Req ID:</strong> 201992<br><br>#E98<br><br>"
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "CACI International Inc",
        "location": {
            "city": "Dulles",
            "state": "VA"
        },
        "posted": "2020-11-22T01:14:42.159Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-summer-2021-at-caci-international-inc-2323130081?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=VKRR3ndPrO0ritgaymoLqg%3D%3D&position=19&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:42.159Z",
        "description": "<strong><u>Job Description<br><br></u></strong>We are seeking candidates for our National &amp; Cyber Solutions (NCS) Summer Internship Program on various software and hardware development teams. CACI's National and Cyber Solutions (NCS) business group is comprised of over 1,300 engineering, data science, cyber security and signals intelligence experts. We are contributors to every step of the intelligence lifecycle and leverage an agile development methodology that provides rapid prototyping, quick reaction, operational support and solutions to a diverse customer base.<br><br><strong><u>What You’ll Get To Do<br></u></strong><ul><li>You will work on a team responsible for design and development of cutting edge space-based precision timing system and user interface features that provide real time indications and warnings to the warfighter for a complex and rapidly evolving mission. </li><li>You will get to be part of a team of fun and energized engineers working within a product family to field tactical SIGINT collection systems to the DoD.</li><li>You will support some of our nation's most pressing mission objectives through:</li><li>Innovative design, development, and deployment of technical solutions and services to support the Intelligence, Homeland Security, and Defense community.</li><li>Command, Control, Communications, Computers, Intelligence Surveillance and Reconnaissance (C4ISR).</li><li>Cyber technology including emerging Cyber/RF spectrum operations, active defense solutions, and platform resilience against cyber attacks.</li><li>Mission tool development, including enterprise situational awareness, intelligence analysis, and advanced visualization applications.</li><li>Rapid Research and Development (R&amp;D), prototyping, integration, and testing.<br><br></li></ul><strong><u>You’ll Bring These Qualifications<br></u></strong><ul><li>Strong communication skills</li><li>Microsoft Office Proficiency</li><li>Ability to grasp basic engineering fundamentals</li><li>Basic understanding of software fundamentals</li><li>Must currently be enrolled in High School OR a full-time Undergraduate, Graduate, or</li><li>Doctorate student</li><li>Must be able to obtain and maintain security clearance (if applicable to position)<br><br></li></ul><strong><u>These Qualifications Would Be Nice To Have<br></u></strong><ul><li>Basic understanding of Java.</li><li>If Undergraduate or Graduate, pursing a degree in computer science or related field is preferred, not required.</li><li>Minimum GPA of 3.0 or higher is preferred, not required.</li><li>Previous internship/co-op or other work experience, leadership and teamwork capabilities, interpersonal communication skills, and activities(professional/community/extracurricular)<br><br></li></ul><strong><u>What We Can Offer You<br></u></strong><ul><li>We’ve been named a Best Place to Work by the Washington Post.</li><li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li><li>We offer competitive benefits and learning and development opportunities.</li><li>We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.</li><li>For over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success.<br></li></ul>INRN2<br><br><strong>Job Location<br><br></strong>US-Dulles-VA-VIRGINIA SUBURBAN<br><br>CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."
    },
    {
        "position": "Backend Software Engineer Intern - Summer 2021",
        "company": "Sumo Logic",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2020-11-08T01:14:42.553Z",
        "url": "https://www.linkedin.com/jobs/view/backend-software-engineer-intern-summer-2021-at-sumo-logic-2291670063?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=fO1SIvEjH%2F6ll0p2XCKyZg%3D%3D&position=20&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:42.553Z",
        "description": "<strong>Backend Software Engineering Intern<br><br></strong>The proliferation of machine data has the potential to give organizations unprecedented real-time visibility into their infrastructure and operations. With this opportunity comes tremendous technical challenges around ingesting, managing, and understanding high-volume streams of heterogeneous data.<br><br>As an Intern on our Backend Engineering team, you’ll be responsible for designing and developing a piece of our complex event based processing platform and data infrastructure for our enterprise service. You will be working on a highly distributed, fault tolerant, multi-tenant framework that includes leading edge components related to storage, messaging, search, and analytics.<br><br>You should be a quick learner and a strong coder in Java or Scala.<br><br><strong><li>Our Ideal Candidate Will be entering their senior year of B.S or M.S!<br><br><strong><u>Responsibilities<br></u></strong><ul> <li> Design and develop components of the multi-tenant event-based processing platform </li> <li> Design and develop data pipeline and systems for management and manipulation of very large data sets </li> <li> Design and implement extremely high-volume, fault-tolerant, scalable backend systems </li> <li> Analyze and improve efficiency, scalability, and reliability of data processing components. </li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li> Pursuing a BS, MS, or PhD in Computer Science </li> <li> Object-oriented programming using Java or Scala </li> <li> Experience building backend systems in distributed computing environments </li> <li> Algorithms and performance characteristics of large distributed software systems </li> <li> Minimum 2 previous internships with relevant experience. </li> <br></ul><strong>Desired<br></strong><ul> <li> Experience with real-time streaming workflow over large amounts of data </li> <li> Multi-threaded programming; </li> <br></ul>____________________________________________<br><br><strong>About Us: https://app.box.com/v/SLGeneralDossier <br><br></strong><strong></strong></li><li><strong> What we do:<br>We are a cloud-native SaaS machine data analytics platform, solving complex monitoring problems for DevOps, SecOps and ITOps teams. Customers love our product because it allows them to easily monitor and optimize their mission critical, large scale applications.<br><br><strong></strong></strong></li><li><strong><strong> Massive Scale:<br>Our microservices architecture in AWS ingests hundreds of terabytes daily across many geographic regions. Millions of queries a day analyze hundreds of petabytes of data.<br><br><strong></strong></strong></strong></li><li><strong><strong><strong> Mission:<br>Democratize machine data analytics through the Sumo Logic platform, bringing real-time data insights securely through the cloud.</strong></strong></strong></li></strong>"
    },
    {
        "position": "Programming Intern",
        "company": "Fried Frank",
        "location": {
            "city": "New York City Metropolitan Area",
            "state": "United States"
        },
        "posted": "2020-11-08T01:14:43.136Z",
        "url": "https://www.linkedin.com/jobs/view/programming-intern-at-fried-frank-2315081917?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=yus5hZzb9A6LfGaEd0UjBw%3D%3D&position=21&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:43.136Z",
        "description": "<p><strong><u>Position Summary</u>:</strong>&nbsp;</p><p>As an intern of the PG (Programming Group), he/she will provide assistance in application development work, specifically custom in-house development.&nbsp;The intern will work closely with primarily the PG team (other programmers, SQL database administrator) and secondarily with the Applications Support team, Networking team, and Operations team.</p><p><br></p><p><strong><u>Duties &amp; Responsibilities</u>:&nbsp;</strong></p><ul><li>Assist the members of the PG in the performance of their duties and responsibilities, specifically in custom in-house development.</li><li>Assist in the implementation of solutions in a timely manner, adhering to deadlines and communicating impediments to meeting them. </li><li>Assist in testing solutions.</li><li>Assist in creating documentation and in updating the team wiki. </li><li>Assist to investigate and learn new tools and systems which might facilitate the efficient creation of necessary programs.</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p><strong>  Education: </strong>College student taking Computer Science or related field.</p><p><strong>  Experience:&nbsp;</strong>Some experience with needs analysis, client/server and web programming is a plus.</p><p><br></p><p><strong>  Job Specific/Technological Skills:</strong></p><ol><li>Experience to program advanced web applications using Visual Basic .NET</li><li>Knowledge of MS SQL</li><li>Basic understanding of Active Directory</li><li>Knowledge of Power BI is a plus</li></ol><p><br></p><p><strong>  Skills and Abilities:</strong></p><ol><li>Must have design and programming skills</li><li>Must have an understanding of client/server programming and relational database design</li><li>Must possess good communication skills, both oral and written</li></ol>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Braze",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2020-11-22T01:14:43.534Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-braze-2188758428?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=Wy5bLeIhs7ywYMdq5%2BwMbA%3D%3D&position=22&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:43.534Z",
        "description": "<strong><u>Who We Are<br><br></u></strong>Braze delivers customer experiences across email, mobile, SMS, and web. Customers, including Seamless, HBO, Disney, Urban Outfitters, and Venmo, use the Braze platform to facilitate real-time experiences between brands and consumers in a more authentic and human way. And we do it at scale – each month, tens of billions of messages are sent to a network of over 2 billion active users through Braze.<br><br>Need more proof? Braze was named a Leader in the Gartner Magic Quadrant for Mobile Marketing Platforms in 2019. The company has also been named on the Forbes Cloud 100, Inc. Magazine’s 2019 Best Places to Work, and Crain's 2019 Best Places to Work in NYC lists.<br><br><strong><u>What You'll Do<br><br></u></strong>You'll work with a team of skilled engineers and a dedicated mentor on real-world product features (maybe even sold to customers while you're here!) on a wide range of sophisticated problems in everything from API and web design to systems engineering and data infrastructure. Summer 2021 internship.<br><br><strong><u>Who You Are<br></u></strong><ul> <li>Pursuing a degree in Computer Science, or equivalent</li> <li>Intellectually curious, passionate, and inventive</li> <br><br></ul><strong><u>What We Offer<br></u></strong><ul> <li>Competitive compensation </li> <li>Free daily lunch in the office, including snacks and beverages </li> <li>Collaborative, transparent, and fun loving office culture</li> <br></ul><em>If you are a California resident subject to the California Consumer Privacy Act, click here to understand how Braze processes your personal information and how you can exercise your rights.<br><br></em><strong><u>What We Offer<br></u></strong><ul> <li>Competitive compensation </li> <li>Free daily lunch in the office, including snacks and beverages </li> <li>Collaborative, transparent, and fun loving office culture</li> <br></ul><em>If you are a California resident subject to the California Consumer Privacy Act, click here to understand how Braze processes your personal information and how you can exercise your rights.</em>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Blend",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:44.013Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-blend-2149558194?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=qPLRFxaVBO52vxLq6DOVPw%3D%3D&position=23&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:44.013Z",
        "description": "Blend helps lenders maximize their digital agility. Our digital lending platform is used by Wells Fargo, U.S. Bank, and other leading financial institutions to increase customer acquisition, improve productivity, and accelerate the delivery of any banking product across every channel. We process more than $3.5 billion in mortgages and consumer loans daily, helping millions of consumers get into homes and gain access to the capital they need to lead better lives.<br><br>As an intern, you will work within our core engineering team on one or more projects that contribute both to our product and to your learning goals.<br><br>We’re looking for talented software engineering interns to join our diverse and fast-growing engineering team. As a software engineering intern, you’ll work throughout the stack, from large-scale data processing to web UI. Specifically, you will be responsible for building new features and functionality enabling our company to deliver mission-critical software to major mortgage lenders. If you have a strong understanding of CS fundamentals, and are excited by a fast-paced, collaborative work environment, we want to hear from you!<br><br><strong><u>Who You Are<br></u></strong><ul><ul><li>Excellent coding, problem solving, and debugging skills</li><li>Proven understanding of computer science fundamentals </li><li>Excellent communication skills</li><li>Expected graduation date by June 2022<br><br></li></ul></ul>Blend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable law, including the San Francisco Fair Chance Ordinance.<br><br>Notice at Collection for California Applicants"
    },
    {
        "position": "Data Science Intern - Spring 2021",
        "company": "QMSC",
        "location": {
            "city": "Houston",
            "state": "TX"
        },
        "posted": "2020-11-29T01:14:44.566Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-spring-2021-at-qmsc-2281550211?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=HOgBP6o35cKDVc4Ip5vcdw%3D%3D&position=24&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:44.566Z",
        "description": "<p><strong>Full Stack Data Scientist</strong></p><p><strong>Intern Role Description</strong></p><p><br></p><p><strong>Who We Are:</strong></p><p>Want to be part of shaping the future? &nbsp;QMSC has developed an Industry Solution for end-to-end Enterprise and Supply Chain Quality Planning &amp; Execution. Our B2B SaaS tech stack is a breakthrough in operational intelligence delivering visibility to supplier and organizational problems for our customers.</p><p>&nbsp;</p><p>The Full Stack Data Scientist Intern position is a great opportunity for a motivated student to work with an early growth technology company and a young engineering team to evolve our existing products and architecture and implement new features and functionality. In addition, you will work closely with internal and external clients to understand their business needs and then work closely with their data environments to find the necessary pieces for solutioning needs. Our candidate will develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right tools &amp; frameworks for developing solutions that help companies make data driven informed decisions.</p><p><br></p><p><strong>What You’re Responsible For:</strong></p><p>Build robust and scalable software and Al/ML models; design and implement new functionality for QMSC platform</p><p>Collaborate with Engineering and Product team to design new programs</p><p>Dive into difficult technical problems and successfully deliver results on schedule</p><p>Document the development process, architecture, and standard components</p><p>Effectively communicate task progress, evaluations, suggestions, schedules along with technical and process issues</p><p>Engage in all aspects of release cycles including requirements review, work estimation, design, implementation, testing and review</p><p>Identify gaps in requirements or designs and present options to address them</p><p>Utilize backend data services and contribute to increase existing data services API</p><p>Work with the product team to understand end-users requirements, formulate use cases, and translate them into pragmatic and effective technical solutions</p><p>&nbsp;</p><p><strong>You've Got What It Takes If:</strong></p><p>&nbsp;</p><p>A track record of successfully completing projects on time and delivering on schedules and commitments</p><p>Excellent communication and presentation skills</p><p>1 year or more of previous PHP</p><p>BS in Computer Science</p><p>Pursuing Masters in Computer Science, Computer Engineering or related field;</p><p>Required: Data Science experience</p><p>Ability to work independently and within a team</p><p>Experience in modelling analytics solutions for complex use-cases</p><p>Experience with data visualization frameworks</p><p>Experience with modern front-end design and Javascript frameworks</p><p>Familiarity with limitations of PHP as a platform and its workarounds</p><p>Proficiency in R, MySQL and Python</p><p>Experience with in modern Machine Learning libraries (and preferred: Sage Maker)</p><p>Strong understanding of Al and ML (BN, KNN, NN, NLP, etc.)</p><p>Proven ability to learn quickly and adapt under pressure</p><p>Self-started individual who can drive through ambiguity and thrives in a fast-paced, dynamic early growth start-up environment</p><p>Strong understanding of fundamental statistics and an ability to translate business requirements into analytical models</p><p>&nbsp;</p><p>Work Authorization</p><p>QMSC will not be providing visa sponsorship for this position. To be considered for this role, you must have the ability to work without a need for current or future visa sponsorship.</p><p>&nbsp;</p><p><strong>What We Offer:</strong></p><p>Innovative culture and entrepreneurial approach</p><p>Mentorship by tech veterans and successful entrepreneurs</p><p>Office in Houston Downtown high-end skyrise</p><p>We're a growing company with a solid future and an impressive reputation. With us, you'll have plenty of opportunities for career development.</p><p>Location: Houston, TX&nbsp;</p>"
    },
    {
        "position": "Data Science Intern - Summer 2021",
        "company": "NAPA AUTO PARTS",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2020-11-22T01:14:44.913Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-summer-2021-at-napa-auto-parts-2324882283?refId=bbb0b9da-6b2e-4399-9edc-00c9190f8126&trackingId=1Us5X1frLRCWTgRBHCtn%2Bg%3D%3D&position=25&pageNum=1&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:44.913Z",
        "description": "Are you ready to spend your summer as a part of something special? Imagine being with a company whose reputation for excellence paves the way for endless success. At Genuine Parts Company (GPC), people build long-lasting, highly satisfying careers and make a real difference in the community.<br><br>GPC has been driving success for over 90 years due to a family of 50,000+ dedicated, intelligent, and innovative employees. But this is the best part - all our businesses throughout the world emphasize the growth and development of our team members by providing opportunities for mentorship and advancement.<br><br><strong><u>The Role<br><br></u></strong>This is the ideal role for a student who is searching for challenging and exciting projects, professional growth, and fun networking opportunities with a Fortune 200 company. As a Data Science Intern at GPC, you’ll have the opportunity to code and document the Access database including SQL data queries for data warehouses in the Pricing department while learning about a global distribution organization.<br><br><strong><u>This Is The Right Opportunity For You If You<br></u></strong><ul><li>Enjoy using coding knowledge to analyze and close gaps in current processes</li><li>Thrive on challenging deadlines and managing competing priorities</li><li>Want to learn how a global leader in the distribution of automotive and industrial parts operates day-to-day<br><br></li></ul><strong><u>A Day In The Life<br></u></strong><ul><li>Use SQL scripting, data mining, and computer coding to document Access database and improce current processes within the GPC Pricing department<br><br></li></ul><strong><u>What’s In It For You<br></u></strong><ul><li>Participate in biweekly Lunch and Learn events with company leaders</li><li>Attend a Braves game and volunteer time with fellow interns</li><li>Explore the history of the company through a multi-day orientation, complete with a tour of the Atlanta Distribution Center</li><li>Present your summer project to fellow interns and GPC executives<br></li></ul><strong><em>COVID-19 Accommodations at GPC: </em></strong><em>Your safety is our top priority - although we are planning for an in-person program, we will continually monitor COVID-19 health safety recommendations and adjust all internship activities as needed. <br><br></em><strong><u>What You’ll Need<br></u></strong><ul><li>Currently enrolled in an undergraduate program, seeking degree in Computer Science or related field</li><li>Excellent verbal and written communication skills<br><br></li></ul><strong><u>And If You Have This, Even Better<br></u></strong><ul><li>Familiarity with Access, VBA, SQL, Alteryx, Qlik</li><li>Experience with Microsoft Office and querying datasets</li><li>Knowledge of user interface design<br></li></ul><strong>Why GPC may just be the right place for you:<br></strong><ul><li>Stable Fortune 200 company with a “family” culture</li><li>Environment that works hard, yet takes care of employees</li><li>Opportunity for accessing multiple career paths</li><li>Ongoing training and development, with support from leaders and your team<br><br></li></ul><strong><u>Additional Information For You<br><br></u></strong>GPC has great careers for people with all backgrounds and interests. So, if after reading this, you don’t think this is the perfect fit for you, check out the list of other opportunities we have at jobs.genpt.com."
    },
    {
        "position": "Technology Internship Program - Software Engineering Summit - Summer 2021",
        "company": "Capital One",
        "location": {
            "city": "McLean",
            "state": "VA"
        },
        "posted": "2020-11-15T01:14:45.288Z",
        "url": "https://www.linkedin.com/jobs/view/technology-internship-program-software-engineering-summit-summer-2021-at-capital-one-2315082223?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=F9qMOjEiVt%2BwJ%2FzP5PjbLA%3D%3D&position=1&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:45.288Z",
        "description": "McLean 1 (19050), United States of America, McLean, Virginia<br><br>Technology Internship Program - Software Engineering Summit - Summer 2021<br><br>At Capital One, we consider ourselves the bank a technology company would build. We’re delivering best-in-class innovation so that our 65 million customers - and counting - can manage their finances with ease. Our reality and vision empower our engineers to use artificial intelligence and machine learning to transform real-time data, software, and algorithms into financial clarity. That’s what sets us apart - and we want you to join our journey.<br><br>We’re all-in on the cloud and are a leader in the adoption of open source, RESTful APIs, microservices, and containers. We build our own products and release them with a speed and agility that allows us to get new customer experiences to market quickly. We’re going boldly where no bank has gone before. And, as a founder-led company, we’re inspired to make, break, do, and do good.<u>So, let’s do something great together.</u> . Want to learn more? Check out the low-down on our high-tech -<u>https://www.capitalone.com/tech<br><br></u>As a Software Engineer in the Technology Internship Program, you may work on everything from customer-facing web and mobile applications using cutting-edge open source frameworks, to highly-available RESTful services, to back-end Java based systems using the hottest techniques in Big Data. Our engineers work in a you \"You Build, You Own\" full stack environment supporting an exciting and innovative tech stack composed of: Java, React, Angular, Vue JS, C#, REST APIs, NoSQL database, Kubernetes, Terraform, Jenkins, Docker, AWS cloud, Scala, Clojure, Java, Haskell, C++, golang, Scheme, Common Lisp, and more! The Technology Internship Program provides you the framework to develop world-class technical skills and gain a comprehensive understanding of technology.<br><br><strong><strong>Here is what to expect during your 10 week internship:<br></strong></strong><ul><li>A challenging role where you’ll collaborate with a diverse and passionate team of talented engineers</li><li>Engaging executive speakers and opportunities to interact closely with senior leadership</li><li>Training &amp; development sessions to build out your skillset on topics such iOS and Android, Web Development, AWS, Open Source Big Data tools, Security, Voice Driven Applications, and more</li><li>Fun social, networking, and volunteer events with other college interns<br><br></li></ul><strong><strong>Continuous Learning<br><br></strong></strong>We’re here to help you gain knowledge both on the job and in the classroom. Our engineers have access to continuous learning through our very own Tech College, a world-class learning hub that offers both online and in-person classes across 13 disciplines—Cloud Computing, Cyber Security, Mobile Development, Machine Learning &amp; AI, to name a few.<br><br>This is a paid internship.<br><br><strong><u>Basic Qualifications<br></u></strong><ul><li>Attended a Capital One Software Engineering Summit</li><li>Bachelor’s degree or higher obtained between December 2021 and August 2024<br><br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Bachelor’s degree or higher obtained between December 2021 and August 2022 in a technical or quantitative discipline, including computer science, computer engineering, information systems, information technology, and mathematics</li><li>Strong analytical, quantitative, problem solving and conceptual skills</li><li>Strong interpersonal, leadership and communication skills</li><li>Intermediate to advanced programming skills or experience in one or more of the following areas: Java, .net, asp.net, PHP, Python, Objective C, C#, C/C++, Perl, XML, JSON, UML, JavaScript, Visual Basic, Swift, Go, Kotlin, HTML, SQL, PL/SQL, Shell scripts<br><br></li></ul><strong><strong>At this time, Capital One will not sponsor a new applicant for employment authorization for this position.<br><br></strong></strong>Job Category - Technology, Technology Operations, Information Technology, Engineering, Technology Explorers"
    },
    {
        "position": "Full Stack Developer Intern",
        "company": "First Republic Bank",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2020-11-29T01:14:45.705Z",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-intern-at-first-republic-bank-2328706294?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=cFpOWiZ5eNZwM0UTiGAzUg%3D%3D&position=2&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:45.705Z",
        "description": "<strong><u>Description<br><br></u></strong>At First Republic, we care about our people. Founded in 1985, we offer extraordinary client service in private banking, private business banking and private wealth management. We believe that personal connections are everything and our success is driven by the relationships we form with our colleagues and clients. You'll always feel empowered and valued here.<br><br>Incredible teams doing exceptional work, every day<br>As an intern, you will gain hands-on experience at a high-growth company that values its people. You'll earn a competitive starting wage while absorbing a culture that emphasizes collaboration, entrepreneurial thinking and quick decision-making. Start doing the best work of your life here.<br><br><strong><u>Responsibilities<br><br></u></strong>Lending Technologies, Information Services<br><br>As part of the Information Services, the Lending Technology Team drives the vision to create an industry leading, client-centric lending technology experience. The team is looking for forward thinking, action-oriented individuals to help drive the implementation and development of innovative, cutting-edge solutions to support the roadmap.<br><br><strong><u>What You'll Do As a Full Stack Developer<br></u></strong><ul><li> Design and develop software programs, APIs and Micro Services, that collect information from multiple computer systems, organize and present the information into easy-to-use modern web pages and mobile phone apps.</li><li> Expertise in web, MEAN stack technologies, with an emphasis on Node.js, Angular, React; working with modern and legacy data sources; and integration with front-end technologies.</li><li> Experience translating designer mock-ups, wire frames and data flows into POCs using UI tools such as HTML5, CSS and Angular.</li><li> Working knowledge on AWS, Azure cloud solutions.</li><li> Expertise in writing unit test using Mocha, Chai and other frameworks.</li><li> Ability to create build / package scripts for deploying applications using GitHub, Jenkins, Artifactory, and Ansible.</li><li> Write secure, efficient, reusable and testable code.</li><li> Familiar with SDLC and with production support experience.</li><li> Prepare complex technical documentation for use by support engineers and to be used as evidence of compliance with regulatory controls.<br></li></ul><strong><u>Qualifications<br><br></u></strong>You could be a great fit if you have:<br><ul><li> Strong technical skills, ability to quickly learn and adapt to use new technologies</li><li> Analytical and problem-solving skillsÍ¾ analyzing business problems and identifying solutions</li><li> Excellent Verbal and Written Communication skillsÍ¾ including meeting facilitation, experience communicating and presenting solutions for problems to stakeholders</li><li> Outstanding organization and prioritization skills</li><li> Experience with multitasking and to function efficiently in a high volume, high risk and fast paced deadline-oriented environment</li><li> Self-starter requiring minimal oversight to achieve defined goals</li><li> Major in Computer Science, Engineering or equivalent<br></li></ul><strong><u>Job Demands<br></u></strong><ul><li> Must be able to review and analyze data reports and manuals; must be computer proficient.</li><li> Must be able to communicate effectively via telephone, email and in person.<br></li></ul>Own your work and your career - apply now<br>Are you willing to take initiative and make decisions? Are you willing to go the extra mile because you love what you do and how you can contribute as a team? Do you want the freedom to grow and the opportunity to take charge of your own career? If so, then come join us.<br><br>We want hard working team players. You'll have the independence to learn, lead and drive change. A culture of extraordinary service, empowerment and stability - that's the First Republic way. Come join us!<br><br>This job description is not intended to be all-inclusive. Employee may perform other related duties as assigned to meet the ongoing needs of the organization. The Company is an equal opportunity employer. In this regard, the Company makes reasonable accommodations for qualified applicants and employees with disabilities in order to enable them to perform all essential job functions, unless doing so creates an undue hardship.<br><br>First Republic is subject to federal laws that restrict the employment of individuals with certain types of criminal histories, including FDIA Section 19 and FINRA. To the extent not inconsistent with our obligations under those federal laws and regulations, First Republic will consider qualified candidates with criminal histories in a manner consistent with the Los Angeles and San Francisco ban-the-box laws."
    },
    {
        "position": "Software Engineer Intern",
        "company": "AppFolio, Inc.",
        "location": {
            "city": "Santa Barbara",
            "state": "CA"
        },
        "posted": "2020-11-22T01:14:46.093Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-appfolio-inc-2317675833?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=c6aWnMk%2FCdFqu0wuQdoi0A%3D%3D&position=3&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:46.093Z",
        "description": "<strong>Hi, We’re AppFolio.<br><br></strong>We’re innovators, changemakers, and collaborators. We’re more than just a software company — we’re a cloud-based powerhouse that creates products to make our customers’ lives easier. We’re revolutionizing the way people do business, and we want your ideas, your enthusiasm, and your passion to help us keep on innovating.<br><br><strong>We love where we work, and you can, too.<br><br></strong>To find out more about what AppFolio has to offer, check out <strong>appfolioinc.com/careers</strong>.<br><br>We are hiring a Full Stack Software Engineering Intern for Spring or Summer of 2020 to contribute to our rapid product development pace. We work collaboratively to set the technical direction for our SaaS products, developing easy-to-use solutions for our customers. Our engineers find a deep satisfaction in building things that customers actually need. We focus on delivering value to customers and understand that this often means delivering code that isn't perfect, but meets customer needs.<br><br>This is an ideal opportunity for someone who has a passion for building leading edge software and is driven to help build a successful SaaS product used by thousands of happy businesses. We foster an environment that empowers small teams to collaboratively set the technical direction of our solutions.<br><br>This opening is on our <strong>AppFolio Property Manager </strong>product development team.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Develop scalable, robust, and simple web-based solutions to solve complex business problems</li><li>Formulate, implement, and evaluate algorithms and database queries to support SaaS scalability and stability.</li><li>Implement new features and optimize existing ones to drive maximum performance</li><li>Use test-driven development, code reviews and continuous integration to deliver high quality software, and rapidly fix bugs as they come up.</li><li>Work closely with, and incorporate feedback from other engineering team members, QA, and product owners, and our APM customers</li><li>Leveraging agile practices, encourage collaboration, prioritization, and urgency to develop at a rapid pace</li><li>Research, share, and recommend new technologies and trends<br></li></ul><strong>You know you’re the right fit if…<br></strong><ul><li>You’ve heard of Ruby and Rails, and have some experience working with a language like Ruby, Java, or Python. You may even know enough about Javascript to have opinions about how frequently \"the new hot thing\" changes.</li><li>You love learning about new technologies, but understand the value of continuing to use something old if it still does everything you need it to do.</li><li>You care about the long-term maintainability of the codebase and will learn to advocate for refactoring and clean-ups where appropriate.</li><li>You care about work life balance and want your company to care about it to; you'll put in the extra hour when needed but won't let it become a habit.<br><br></li></ul><strong><u>Additional Skills And Knowledge<br></u></strong><ul><li>Currently pursuing BS, MS, or Ph.D in Computer Science or related technical discipline</li><li>Hands-on work/internship experience developing web-based applications, preferably in a SaaS environment</li><li>Creativity, ability to solve complex problems without a roadmap<br><br></li></ul><strong><u>Nice To Have<br></u></strong><ul><li>Experience working across all levels of the development stack</li><li>Experience with some areas of our tech like Ruby on Rails, React, Redux, AWS, SOA</li><li>Familiarity with Agile software development processes: Scrum or Kanban</li><li>Familiarity with Test-Driven-Development<br></li></ul>If you are interested in creating exceptional SaaS products, and contributing to a successful company, apply today!<br><br><em>We gladly accept applicants who meet only a few of these requirements. If AppFolio sounds like a place you'd fit, we’d love to hear from you. Talented engineers come from varied experience backgrounds!<br><br></em><strong>Our Story<br><br></strong>AppFolio (NASDAQ: APPF) was founded in 2006 with the mission to revolutionize vertical industry businesses by providing great software and service. Our easy-to-use, cloud-based software helps our customers more effectively market, manage, and grow their businesses. Today our software solutions exist in two verticals including the real estate (AppFolio Property Manager, AppFolio Property Manager PLUS, and AppFolio Investment Manager) and legal (MyCase) industries.<br><br>To find out more about what AppFolio has to offer, check out <strong>appfolioinc.com/careers</strong>."
    },
    {
        "position": "Software Engineering Summer Intern",
        "company": "Gecko Robotics, Inc.",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "posted": "2020-11-22T01:14:46.519Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-summer-intern-at-gecko-robotics-inc-2303393992?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=glHaL5m541JYZwcoWgk9%2FA%3D%3D&position=4&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:46.519Z",
        "description": "<strong>Job At A Glance <br><br></strong>As a member of the technical staff, the software engineer intern is responsible for the design of new software products up to functional releases to customers. This includes specification reviews, development program timelines and reports, design reviews, documentation packages, and transfers to production. This engineer will also be responsible for technical support of some software products and tools currently released to customers. We will be accepting applications for Summer 2021 internships until January 15, 2021.<br><br><strong><u>What You Will Do<br></u></strong><ul> <li>Designs and develops software including: data analysis, graphical user interfaces, and motion control software for our products.</li> <li>Conducts tests to verify the implementation of new features and the proper operation of products.</li> <li>Uses critical thinking skills to debug problems and develop solutions to these problems.</li> <li>Interacts with other engineers in a team environment.</li> <li>Provides and reviews technical documentation.</li> <li>Operates robots at customer locations to test and improve designs.</li> <br><br></ul><strong><u>What Gecko Is Looking For<br></u></strong><ul> <li>Working towards B.S., M.S, or M.S.E. in Computer Science, Software Engineering, Electrical or Computer Engineering, or related technical field.</li> <li>Thorough knowledge of at least one object-oriented language.</li> <li>Experience in at least one of the following categories: signal and image processing, motion control, real-time software, machine learning, or UI design.</li> <li>Thorough knowledge of Python programming.</li> <li>Robotics experience.</li> <li>Detail-oriented personality with solid documentation and reporting skills.</li> <li>Experience in rapid prototyping.</li> <li>Strong references/recommendations are required.</li> <br><br></ul><strong><u>Who We Are<br><br></u></strong><strong> Gecko Robotics (Gecko) is focused on protecting and maintaining civilizations' most critical infrastructure, with machines and platforms. <br><br></strong><strong> Traditional manual maintenance is dangerous, slow and reactive. Gecko’s solutions improve safety and speed (10x) while gathering more data (1000x) to predict infrastructure failures before they happen. <br><br></strong><strong> Gecko services customers across the USA and internationally primarily in the Oil &amp; Gas, Power Generation and Pulp &amp; Paper markets.</strong>"
    },
    {
        "position": "Computer Science: Data Analyst Intern (Summer 2021)",
        "company": "SPX Corporation",
        "location": {
            "city": "East Stroudsburg",
            "state": "PA"
        },
        "posted": "2020-12-03T01:14:46.856Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-data-analyst-intern-summer-2021-at-spx-corporation-2247968702?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=hZZ2WxsjH37Ia9szy8RNqA%3D%3D&position=5&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:46.856Z",
        "description": "<strong><u>Job Summary<br><br></u></strong>Assist the Engineering department in successfully achieving manufacturing goals and contribute to continuous improvement efforts. This position offers a variety of opportunities including basic engineering tasks related to design, analysis, test, integration and systems engineering. Opportunities can vary from performing analysis on existing hardware, assisting in the design and development of future hardware, performing analysis for both completed and future equipment, test, systems engineering, quality assurance, system safety, and production operations.<br><br><strong><u>Essential Duties And Responsibilities<br></u></strong><ul> <li> Improve material handling methods. </li> <li> Develop quoting tools that allows the calculation of pricing based on a set of input dimensions as specified by an end user. </li> <li> Perform work station/cell analyses to improve productivity and quality. </li> <li> Provide input for manufacturing fixtures and tooling. </li> <li> Assist with plant layout and work station design. </li> <li> Develop computer programs to help manipulate data for use. </li> <li> Learn and use ERP manufacturing software. </li> <li> Create documentation for new product launches. </li> <li> All other duties or projects as assigned. </li> <br></ul>Interns will typically support one or more experienced engineers in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of engineering.<br><br><strong><u>Basic Qualifications<br></u></strong><ul> <li> Student working towards a Bachelor’s degree in Computer Science, Manufacturing, Industrial, and Mechanical, or other related Engineering field. </li> <li> Candidates must have completed their second year of engineering studies. </li> <li> Cumulative GPA of 3.0 or above. </li> <li> Must be a US Citizen or have legal US working status. </li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li> Working knowledge or exposure to 3D software (CREO Preferred) </li> <li> Working knowledge or exposure to ERP systems </li> <li> Experience in Visual Studio and .Net </li> <li> Exposure to Lean and 5S concepts. </li> <li> Background in manipulating data </li> <li> Experience in C++ </li> <li> Experience in Visual Basic </li> <li> Experience with Data Analytics </li> <li> Experience in SQL </li> <br></ul>For more than 140 years, Patterson-Kelley has proudly served the commercial heating industry with the most respected heating solutions in the field. Our commercial boilers and hot water heaters are designed and built in the USA and distributed throughout North America. Even more, our products are backed by the highest level of technical and application support. Each piece of equipment we build is the direct result of knowledge cultivated from generations of experience, expertise, and customer input.<br><br>SPX is an equal opportunity employer and makes employment decisions without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, genetic information, disability, protected veteran status, or any other reason prohibited by applicable law.<br><br>Thank you for your interest in our company."
    },
    {
        "position": "Intern Data Science /Analytics",
        "company": "FedEx Services",
        "location": {
            "city": "Memphis",
            "state": "TN"
        },
        "posted": "2020-11-15T01:14:47.224Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-analytics-at-fedex-services-2204986583?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=82MwHAGq1LHTy61w4Yew8Q%3D%3D&position=6&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:47.224Z",
        "description": "<strong>Company:</strong> FedEx Services<br><strong>Job Title:</strong> Intern Data Science /Analytics<br><strong>Job Requisition Number:</strong> RC286540<br><strong>Category:</strong> Intern<br><strong>Pay Type:</strong> Non-exempt<br><strong>Locations:<br></strong>Memphis, Tennessee 38116<br>United States<br><br>This is a 10-week assignment for students pursuing a college degree. Assignments are directly related to intern's academic degree. Under direct supervision, performs duties as assigned. Student participates in a number of organized events providing visibility into the overall operations of FedEx.<br><br>Full-time internship opportunity available in multiple locations across the US from June 2021 to August 2021.<br><br><strong><u>The Intern May Assist With<br><br></u></strong>Under close supervision, the successful candidate may assist with project management, process mapping, data analysis, workflow documentation, and report automation. The project may relate to developing customer profiles based on data attributes, or analyzing package data attributes to optimize customer satisfaction.<br><ul><li>Conducting data analytics, customer profiles, report development, and/or research.</li><li>Interacting with business partners and/or staff to gather, interpret, and document customer and operational behavior for data analysis. </li><li>Documenting systems functions and business process flows.<br>The ideal candidate will possess the following skills and experience:</li></ul><ul><li>Strong analytical/quantitative, project/program management, organizational, leadership, presentation, and verbal and written communication skills.</li><li>Ability to manage multiple tasks, set priorities and monitor ongoing results.</li><li>Ability to synthesize big data (quantitative and qualitative); Report design/development.</li><li>Knowledge or experience with one or more of the following: data analytics, forecasting/modeling, strategy planning, engineering planning, operations, economics, process mapping, database query creation, web development, and project management.</li><li>Basic knowledge of one or more of the following: the software development process, systems applications and architecture, Query Languages, “R,” MATLAB, Python, C++, objective-C, and SQL.</li><li>Experience with Big Data technologies like Hadoop, Spark, Hive, Kafka, Hbase, etc.</li><li>Use of one or more analytic software tools or languages such as. Scala, R, Python, SAS</li><li>Demonstrated expertise in developing data pipelines with industrial datasets to enable descriptive, applied, and predictive analytics</li><li>Information technology data collection, organization, integration, data cleansing, data quality assessment, and using analytics for data assessment</li><li>Knowledge of PowerPoint, Keynote or Prezi and the Microsoft Office suite.<br><br></li></ul><strong><u>The Following Are Considered a Plus<br></u></strong><ul><li>Enrollment as undergraduate at junior year or above or graduate student in Engineering, Industrial Engineering, Operations Engineering, Software Engineering, Computer Engineering, Computer Science, Information Systems, Process Analysis, Systems Analysis and Design, Decision Science, Data Science, Statistics, Applied Statistics, Quality Improvement Analytics, Informatics, Mathematics, Business, Management, Finance, Accounting, Economics, Industrial Psychology, or other related major.</li></ul><ul><li>Ideally, plans to graduate within 12 months of completing the internship and begin full-time employment.<br><br></li></ul><strong><u>Resume Should Include The Following Information<br></u></strong><ul><li>College address and permanent home address.</li><li>Email address.</li><li>Telephone number.</li><li>The following regarding the degree you are currently pursuing:<br><ul><li>Name of college/university.</li><li>Degree (For example, bachelor’s degree, master’s degree, or doctorate).</li><li>Major and/or minor.</li><li>Overall GPA.</li><li>Major GPA.</li><li>Date of intended graduation (Month and year).</li></ul></li></ul><u>Domicile Location</u><u>:<br></u>Multiple locations across the US.<br>Relocation assistance not available.<br><br>FedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.<br><br>FedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com."
    },
    {
        "position": "Internship: Computational Robotics",
        "company": "Mitsubishi Electric Research Laboratories",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2020-11-22T01:14:47.910Z",
        "url": "https://www.linkedin.com/jobs/view/internship-computational-robotics-at-mitsubishi-electric-research-laboratories-2315371666?refId=4b1ee28a-73b4-42e8-b539-a8853f8bb311&trackingId=9nmxFtjU5NHQXRmYXKMfxg%3D%3D&position=7&pageNum=2&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2020-12-06T01:14:47.910Z",
        "description": "MERL is looking for a highly motivated and qualified candidate to work on contact models in physics engines. The ideal candidate should have very good coding skills in C++ and Python. Prior knowledge of contact models in physics engines like PyBullet and MuJoCo are welcome, but not completely necessary. The project requires development of a software package to investigate and improve the computational model in these physics engines for complex robotic manipulation tasks. Interested candidates should apply with a CV with details of previous software projects. Students pursuing an MS or PhD degree in Computer Science and Electrical Engineering are encouraged to apply. The duration of the internship is about 3-4 months from January 2021 to April 2021.<br><br>Research Areas Optimization, Robotics<br><br>Contact Devesh Jha<br><br>Mitsubishi Electric Research Labs, Inc. \"MERL\" provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, MERL complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br><br>MERL expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of MERL’s employees to perform their job duties may result in discipline up to and including discharge."
    }
]