[
    {
        "position": "Software Engineer Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2020-12-28T09:37:59.797Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-linkedin-2184303072?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=PEixalw2uVFHTdUWSYciAw%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:37:59.797Z",
        "description": "Software Engineer Internship - Summer 2021<br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>Searching for your dream job? At LinkedIn, we strive to help our employees find passion and purpose. Join us in changing the way the world works.<br><br>Want to work on advanced information-retrieval algorithms, massive scalability infrastructure and storage solutions, and large-scale applications for users on web and mobile devices? Apply now. LinkedIn is looking for a variety of interns who want to learn, grow and work with some of the brightest technical talent in the world. We have a top-notch intern program for where you would work on real-life projects very important to the company. Come check us out! <br><br>We are hiring in the following technology areas:<br>• Applications: Build user-centric online applications, scaling performance and 24x7 reliability<br>• Mobile Engineering: Build native and HTML5 applications for Android, iPhone, and iPad<br>• Tools Engineering: Develop internal command line and web based tools to automate development, deployment, management and monitoring of our 24x7 online site<br><br>Responsibilities:<br>• Scale distributed applications, make architectural tradeoffs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.<br>• Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.<br>• Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.<br>• This is a full-time fall internship role based in Sunnyvale, CA, San Francisco, CA or New York, NY<br>• This internship will take place during Summer 2021<br><br>Basic Qualifications:<br>• Currently pursuing a B.A./B.S. Degree or higher in Computer Science, or related technical field· and returning to the program after the completion of the internship<br>• Programming experience in one or more of the following languages: Java, C/C++, C#, Python, or Ruby<br><br>Preferred Qualifications:<br>• Expected to complete degree by December 2022 or earlier<br>• Experience working in a short-cycle, agile, iterative development team<br>• Knowledge of computer science, with strong competencies in data structures, algorithms, software design, and object oriented skills <br><br>As part of the application process for this role, after an initial qualifications review, candidates are required to successfully complete the HackerRank online code challenge. Instructions for completion of the code challenge will be sent to you if your application is selected to move forward in the process.<br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. <br><br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. <br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"
    },
    {
        "position": "Software - Applications Engineering Internship (Fall 2021)",
        "company": "Tesla",
        "location": {
            "city": "Fremont",
            "state": "CA"
        },
        "posted": "2021-01-11T09:38:00.279Z",
        "url": "https://www.linkedin.com/jobs/view/software-applications-engineering-internship-fall-2021-at-tesla-2348468331?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=rCSYLe%2FU05orDZKjbx4ZlQ%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:00.279Z",
        "description": "<em>Disclaimer: This position is expected to start around August or September 2021 and continue through the entire Fall term (i.e. through </em><em>December/January)</em><em> or into early Spring 2022 if </em><em>available. We ask for a minimum of 12 weeks, </em><em><strong>full-time</strong>, for most internships. </em><em>Please consider before submitting an application.<br><br></em><em>International Students: If your work authorization is through CPT, please consult your school <strong>before </strong>applying. You must be able to work 40 hours per week</em><em>. Many students will be limited to part-time depending on their academic standing. <br><br></em><strong>Internship Program at Tesla <br><br></strong>The Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.<br><br>Instead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.<br><br><strong>Locations<br></strong><ul><li>Fremont, CA </li><li>Reno, NV</li><li>Bellevue, WA</li><li>Remote<br><br></li></ul><strong><u>About The Teams<br><br></u></strong>Tesla is looking for talented, highly motivated university students for our various applications engineering teams to continue to be at the forefront of building a consistent and trustworthy experience across all touch points from digital, sales &amp; service, infrastructure engineering, factory software, to internal application touch points and much more! Our software engineers are building the next generation of products and supporting infrastructure which allows our customers and our internal teams to understand, interact with various products and services that Tesla offers.<br><br><strong><u>As You Continue To Discover Your Passion And Strengths In Navigating Your Career Path, You Can Be Part Of One Of Our Internship Programs Within The Following Software Engineering Teams<br><br></u></strong><li> Data Engineer – Responsible for enterprise data processing and analytics</li><li> Digital Experience - Focus on customer experience interaction from tesla.com to the Tesla App</li><li> Factory Software – Focus on supporting General Assembly in all automotive and energy lines at the Tesla Factories</li><li> Financial Platforms – Focusing on Tesla payments and financial platforms from global online payments to scalable and automated reconciliation</li><li> Enterprise Resource Planning – Focus on system software development from Purchasing to Sales, Logistics and Delivery to Inventory &amp; Costing and much more</li><li> Service and Customer support – Focus on the interaction and experience of the end user from phone/road assistance, to service centers, to body repair shops to name a few<br><br></li><strong><u>Responsibilities<br><br></u></strong><li> Partner alongside software engineers and various cross functional team members to build, manage, perform and support various aspects of real time projects.</li><li> Develop applications to support various functions across teams</li><li> Promote Software Engineering best practices</li><li> Independent and driven to react quickly to changing business strategy</li><li> Leverage your existing skills while learning and implementing new technologies</li><li> Work with Product Managers, Quality Engineers, and DevOps to own your solution from inception to production rollout &amp; operations</li><li> Identify additional areas of opportunity and means for knowledge sharing practices across teams<br><br></li><strong><u>Requirements<br><br></u></strong><li> Currently has, or is in the process of obtaining a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Systems or equivalent degree</li><li> Experience in Python, SQL, MySQL, Web Development</li><li> Experience and knowledge as full stack developer</li><li> Experience and knowledge with front-end technologies: JavaScript (React.js), CSS, HTML</li><li> Experience and knowledge with back-end technologies: C#, Go/Golang, Java, PHP</li><li> Previous software engineering internship and/or relevant project experience is a plus</li>"
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "California ISO",
        "location": {
            "city": "Folsom",
            "state": "CA"
        },
        "posted": "2021-01-23T09:38:01.308Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-intern-summer-2021-at-california-iso-2372891813?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=xiEKLyu3UKH9gmk6TIanNQ%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:01.308Z",
        "description": "<strong><u>Job Description<br><br></u></strong><strong>What's In it for You<br><br></strong>Our purpose is to lead the way to tomorrow's energy network. Your work as an intern can impact millions of people who depend on electricity for their everyday lives.<br><ul><li>You will get \"real world\" experience to begin or further your career pursuits in the energy industry. This is a paid intern position for 10 -12 weeks during summer 2021.</li><li>You get to work on interesting and challenging assignments that will help grow your skill set.</li><li>You will work in an extremely collaborative environment inside our LEED certified Folsom, California campus.</li><li>Opportunities to interact with the CEO and the Executive team of the ISO</li><li>Invitations to seminars on the latest energy industry topics such as renewables, electric cars and micro grids.</li><li>Potential field trips.</li><li>Social activities with other interns such as barbecues and movie nights.</li><li>You get to work on our \"green\" LEED certified Folsom, California campus with some of the brightest people in the industry.<br><br></li></ul><strong><u>What You Will Be Doing<br><br></u></strong><em>Past Assignments have included work such as:<br></em><ul><li>Building new software tools in support of the reliable operation of the Grid and the energy markets we facilitate. You will learn more about smart grid technology, renewable resources, forecasting and the latest developments in energy industry. You will see ow the work you do this summer contributes directly to the success of the California Grid</li><li>Data validation and user acceptance testing (UAT), schedule and monitor processes necessary for calculation and publication of energy market settlement statements and invoices.</li><li>Development of enterprise-wide systems integration mapping, with database that links to interface specification. Interface with IT Architects, UML Modelers, and QA Leads to understand how to best depict these system-to-system interfaces to meet specific use cases.</li><li>Provide technical content and sample code for the ISO's developer.caiso.com website.</li><li>Document archiving solutions for new technologies as well as development of automation solutions.</li><li>Oracle Database/Storage task queue maintenance, documentation, create automation scripts for Oracle database admin tasks/storage procurement and document, create automated reports of daily DBA/Storage procedures, create standard monitoring scripts, generate capacity reports.</li><li>Projects to develop work products that will reduce processing time, enhance transparency or enhance capabilities in departments across the organization.<br><br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Level of Education and Discipline<br></strong><ul><li>Currently in a Bachelor's degree (BS) or Masters degree (MS) program in Computer Science, MIS or related field.</li><li>Graduating December of 2021 or later.<br><br></li></ul><strong><u>Amount Of Experience<br></u></strong><ul><li>Previous internships, research or work experience using economic analysis is desired.</li><li>Research and or studies in energy industry highly desired.<br><br></li></ul><strong><u>Type Of Experience<br></u></strong><ul><li>Proficient in Microsoft office suite.</li><li>Good presentation, oral and written communication skills highly desirable. </li><li>Must be able to work effectively in a team environment. </li><li>Excellent analytical and problems solving skills required. <br><br></li></ul><strong><u>Additional Skills And Abilities<br></u></strong><ul><li>Strong quantitative skills.</li><li>Competence in software such as R, Python, SQL, and Java desired but not required.<br><br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."
    },
    {
        "position": "Internship Summer 2021 (Software Engineering / Data Science)",
        "company": "Amobee",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2021-01-23T09:38:01.746Z",
        "url": "https://www.linkedin.com/jobs/view/internship-summer-2021-software-engineering-data-science-at-amobee-2321946500?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=qXgA0y2onpffu7AojqdI1Q%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:01.746Z",
        "description": "The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing, and has been named a Leader in Gartner’s Magic Quadrant. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation. Explore all of our notable Amobee Awards . We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee .<br><br><strong><u>Position Summary<br><br></u></strong>Amobee’s ACE (Amobee Career Exploration) Internship Program offers Technical Interns hands-on exposure to different areas of our business, specifically in the fields of Software Development, Data Science, DevOps Engineering, Technical Solutions Engineering, or Data Systems Engineering. We are currently seeking Technical Interns at our Redwood City location. As an ACE Intern you will be paired with an Advocate within the Engineering team who will oversee your professional development and project delivery. The Amobee ACE Internship will provide you with real-world, applied experience with a technology product company, tackling unique challenges that will position you well for your career ahead.<br><br><strong><u>Requirements<br></u></strong><ul><ul><li>Current student pursuing a Bachelor's, Master’s, or PhD degree in Computer Science, Data Science, Mathematics, Engineering or related field.</li><li>Minimum 3.0 GPA</li><li>Ability to work well in teams</li><li>Excellent understanding of Computer Science fundamentals</li><li>Core knowledge of at least one programming language (Java or Python preferred)Passionate about web-based applications</li><li>Excited by working in a fast-paced, collaborative environment<br><br></li></ul></ul><strong><u>Benefits Of Our Program<br></u></strong><ul><ul><li>Ability to observe and work with other team members, including leadership</li><li>Direct mentorship from an assigned Advocate</li><li>Endless opportunities to learn</li><li>Challenging work assignments</li><li>Potential Career opportunities upon graduation</li><li>Formal Training Programs, Social Events, and Community Outreach Programs<br><br></li></ul></ul><strong><u>About Amobee<br><br></u></strong>The world’s leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices. We provide marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data. Our platform and technology, provides the most advanced advertising solutions for the convergence of digital and advanced TV— including linear TV, over the top, connected TV, and premium digital video. Enabling advertisers to plan and activate across more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter.<br><br>Amobee has been named to Fortune’s Top 10 Best Workplaces in Advertising and Marketing. Amobee’s platforms have been widely recognized amongst our industry winning numerous awards in technology innovation, see all Amobee Awards. We are a wholly owned subsidiary of Singtel, one of the largest telco companies in the world, reaching over 700 million mobile subscribers in 21 countries. Amobee operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee<br><br>In addition to our great environment, we offer a competitive base salary, employee development programs and other comprehensive benefits. Please send a cover letter along with your resume when applying to the position of interest located at Amobee.com . We are an Equal Opportunity Employer. No phone calls and no recruiting agencies, please.<br><br>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Finix",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-23T09:38:02.121Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-finix-2377891172?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=04Ov%2FCSKsRa9RCCqlHIUyQ%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:02.121Z",
        "description": "<strong><u>About Us<br><br></u></strong>Finix builds payments tools for vertical SaaS and fintech companies. With Finix, businesses can create a custom payments experience for their customers without developing an in-house system or relying on third-party payments providers.<br><br>We are a fast-growing fintech startup recently named to both the Forbes Fintech 50 and CB Insights Fintech 250. We closed our Series B funding in February 2020 and announced an extension in August of 2020, bringing our total funding to $96 million.<br><br>While we work hard each day to solve complex payments challenges, our primary focus is our team. A shared personality trait of every Finix team member is a desire to be challenged. As we continue to grow and scale, we are actively looking for passionate payments people of all kinds to join our team.<br><br>We have offices in Cincinnati and San Francisco.<br><br>Our Backend Engineering Team is responsible for delivering high-grade fintech software for payments processing, merchant payouts, fees, and custom billing.<br><br>As a software engineering intern, you will be working as part of our Financial Systems Team to develop a text/email reminder service that will be used by our customers. Throughout the internship, you will be working on system design, data modeling, algorithms, UI design, and testing for the service.<br><br>Finix is looking for someone who has a passion for solving complex problems, thrives in a face paced work environment, and is eager to learn and evolve.<br><br><strong><u>You Will<br></u></strong><ul><ul><li>Develop software that will meaningfully impact Finix and its customers</li><li>Give and receive technical feedback through code reviews or design discussions</li><li>Collaborate cross functionally to proactively seek and incorporate feedback</li><li>Learn quickly by asking great questions, finding how to work with your mentor and teammates effectively, and communicate the status of your work clearly<br><br></li></ul></ul><strong><u>You Are<br></u></strong><ul><ul><li>Passionate about solving complex computer science and business problems</li><li>Someone who thrives in a fast paced work environment</li><li>Someone who is eager to learn and evolve<br><br></li></ul></ul><strong><u>You Have<br></u></strong><ul><ul><li>A strong fundamental understanding of Computer Science through pursuit of a Bachelor's, Master's, or PhD degree in Computer Science, math, or a related discipline</li><li>Some programming experience and familiarity, either through side projects or classwork. We work mostly in Java. We believe new programming languages can be learned if you have computer science fundamentals.</li><li>Experience from previous internships or other multi-person projects, including open source contributions, that demonstrate evaluating and receiving feedback from mentors, peers, and stakeholders</li><li>The ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts</li><li>Strong written and communication skills, being able to effectively convey ideas and teach other team members about your work<br><br></li></ul></ul><strong><u>What We Offer<br><br></u></strong><em>Applicable to full time employees only<br><br></em>Finix offers a comprehensive benefits package. Benefits are effective on the 1st of the month after your start date.<br><br><strong>Health</strong> - We offer a variety of health insurance plans with two major carriers (UHC for national coverage and Kaiser as an additional option for CA). Finix pays 90% of the employee premium and 50% of the dependent premium for whichever plan you choose. The remainder of the premium will be deducted from your paycheck pre-tax.<br><br><strong>Dental - </strong>PPO dental plan through Beam Dental, one of the best new dental carriers with national coverage. Finix covers 90% of the employee premium and 50% of the dependent premium.<br><br><strong>Vision </strong>- Vision plan through VSP. Finix covers 90% of the employee premium and 50% of the dependent premium.<br><br><strong>Life / AD&amp;D - </strong>Company-paid Life/AD&amp;D insurance with coverage for 1x your annual salary.<br><br><strong>Short-term / Long-term Disability </strong>- Company-paid short-term and long-term disability insurance.<br><br><strong>Medical and Dependent Care FSAs </strong>- Pre-tax Flexible Spending Accounts for out-of-pocket medical or dependent care expenses.<br><br><strong>Commuter Benefits </strong>Pre-tax account for parking or transit expenses.<br><br><strong>401k </strong>- 401k account through Guideline.<br><br><strong>Paid Time Off </strong>- In addition to federal holidays, we offer accrued time off of up to 15 days per calendar year with a 40-hour carry-over. Sick time is accrued separately at up to 9 days per calendar year.<br><br><em>Finix is an equal opportunity employer and values diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br></em><em>Applicants Only - External Recruiting Agency resume submissions will not be accepted.</em>"
    },
    {
        "position": "Data Science Intern",
        "company": "Rapid7",
        "location": {
            "city": "Boston",
            "state": "MA"
        },
        "posted": "2021-01-11T09:38:02.558Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-rapid7-2334187648?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=ZDbf1HTF8Efxi%2FMscBBxPw%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:02.558Z",
        "description": "<strong><li>THIS ROLE IS FOR AN IMMEDIATE START. WE ARE LOOKING FOR SOMEONE TO WORK PART-TIME DURING THE 2021 SPRING SEMESTER***<br><br><strong>We are looking for a highly motivated data science intern to drive insight for key business stakeholders, across our internal functional areas. This role will be integral in building our data science toolset. Working in tandem with our BI Analysts &amp; Operations teams, this position will work to build scalable tooling that provides proactive impact analysis and adds automation to our data science stack.<br><br></strong><strong>The ideal candidate is a self-starter with a strong interest in business and an affinity for how organizational goals and data come together to support a growing company. Bring your data science skills and come help us solve some of our most challenging and important business problems. <br><br></strong><strong><u>Essential Responsibilities<br></u></strong><ul><li><strong>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business decisions &amp; business process optimization. </strong></li><li><strong>Act as a key contributor in providing advanced analytics (predictive and prescriptive) and recommendations to our business stakeholders, with a core focus on improving our ability to systematically determine key drivers of a complex business.</strong></li><li><strong>Use predictive modeling to increase and optimize customer experiences, revenue generation, marketing spend and other business outcomes.</strong></li><li><strong>Develop processes and tools to monitor and analyze model performance and data accuracy.</strong></li><li><strong>Provide clear visualizations and present analyses to management and executive-level stakeholders, using Business Intelligence tools and predictive analytics to drive key decisions</strong></li><li><strong>Provide recommendations to Business Intelligence leadership on best practices and the continual improvement in advanced analytics at Rapid7<br><br></strong></li></ul><strong><strong>Job Requirements<br></strong></strong><ul><li><strong>In pursuit of a Bachelor's or Master's degree candidate in Computer Science, Business Analytics, Data Science or related technical field (min. GPA of 3.0) with prior technical internship or data science experience.</strong></li><li><strong>Experience using R, Python, and SQL to manipulate data and draw insights from large, diverse data sets.</strong></li><li><strong>Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.</strong></li><li><strong>Experience visualizing/presenting data using: matplotlib, ggplot, rShiny, Tableau, etc.</strong></li><li><strong>Must be a fast learner with high attention to detail and possess a passion for data, data quality &amp; business analytics</strong></li><li><strong>Must have excellent communication &amp; interpersonal skills, utilizing data to tell a story</strong></li><li><strong>Self-motivated and accountable; able to take direction and manage prioritization of work</strong></li><li><strong>Results-oriented and collaborative; able to work independently as well as part of a team</strong></li></ul></li></strong>"
    },
    {
        "position": "Summer 2021 Intern - Computer Science",
        "company": "GLOBALFOUNDRIES",
        "location": {
            "city": "Essex Junction",
            "state": "VT"
        },
        "posted": "2021-01-23T09:38:03.056Z",
        "url": "https://www.linkedin.com/jobs/view/summer-2021-intern-computer-science-at-globalfoundries-2378834310?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=UQTHe8yl9cP4MJcip7ZeVg%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:03.056Z",
        "description": "<strong><u>Summary Of Role<br><br></u></strong>The Information Technology Team is seeking a talented and motivated intern to join the team. The intern will be working with the Information Technology division and take on projects as assigned.<br><br><strong><u>Essential Responsibilities<br><br></u></strong>Take inventory of tools and signals and enter into a different format that is more accessible across teams<br><br><strong><u>Required Qualifications<br></u></strong><ul> <li>Education/Experience -<br><ul> <li>Enrolled in a Bachelor's degree program, Computer Science major</li> <li>Fluency in English Language - written &amp; verbal </li> <li>Perform all activities in a safe and responsible manner and support all Environmental, Health, Safety &amp; Security requirements and programs.<br></li></ul> </li> </ul><ul> <li>Preferred Qualifications:<br><ul> <li>Manufacturing or Semiconductor Experience</li> </ul> </li> <br></ul>If you need a reasonable accommodation for any part of the employment process, please contact us by email at usaccommodations@globalfoundries.com and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.<br><br>An offer of employment with GLOBALFOUNDRIES is conditioned upon the successful completion of a background check and drug screen, as applicable and subject to applicable laws and regulations.<br><br>GLOBALFOUNDRIES is fully committed to equal opportunity in the workplace and believes that cultural diversity within the company enhances its business potential. GLOBALFOUNDRIES goal of excellence in business necessitates the attraction and retention of highly qualified people. Artificial barriers and stereotypic biases detract from this objective and may be illegally discriminatory.<br><br>All policies and processes which pertain to employees including recruitment, selection, training, utilization, promotion, compensation, benefits, extracurricular programs, and termination are created and implemented without regard to age, ethnicity, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, sexual orientation, gender identity or expression, veteran status, or any other characteristic or category specified by local, state or federal law."
    },
    {
        "position": "Software Engineer - Intern (Summer 2021)",
        "company": "C3 AI",
        "location": {
            "city": "Redwood City",
            "state": "CA"
        },
        "posted": "2021-01-11T09:38:03.512Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-summer-2021-at-c3-ai-2361762014?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=BYMkdTno0hIyvCLgugHE5g%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:03.512Z",
        "description": "C3.ai is a leading enterprise AI software provider for accelerating digital transformation. The comprehensive and proven C3 AI Suite uses a model-driven abstraction layer to enable organizations to develop, deploy, and operate enterprise scale AI applications 40x to 100x faster than alternative approaches. www.c3.ai<br><br>We are looking for Software Engineers to join us during our <strong>Summer 2021 internship program</strong>. As a Software Engineer Intern, you will design and develop AI applications using the C3 AI Suite. AI Software Engineers may be assigned to work on our applications, platform, or forward deployed engineering teams. You will collaborate to do meaningful work while also growing your expertise.<br><br><strong><u>Your Responsibilities<br></u></strong><ul> <li>Design, develop, and maintain performant and scalable applications.</li> <li>Build and improve tools for internal C3 teams to understand and analyze large-scale data.</li> <li>Work closely with and incorporate feedback from Products and Engineering teams.</li> <li>Define and lead end-to-end development of applications.</li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li>Pursuing a Bachelor of Science or Master of Science in Computer Science, Computer Engineering, or related fields.</li> <li>Experience with JavaScript, Java, or other object-oriented programming language.</li> <li>Strong hands-on experience and understanding of object-oriented programming, data structures, algorithms, profiling &amp; optimization.</li> <li>Real passion for developing team-oriented solutions to complex engineering problems.</li> <li>Thrive in an autonomous, empowering and exciting environment.</li> <li>Great verbal and written communication skills to collaborate multi-functionally and improve scalability.</li> <li>Interest in committing to a fun, friendly, expansive, and intellectually stimulating environment.</li> <br></ul>C3.ai provides interns a competitive compensation package. At the office, we offer a fully stocked kitchen with catered breakfast and lunch, table tennis and pool table, free membership at our on-site gym, Friday evening social hours with food, drink and music and a fun team of great people.<br><br>C3.ai is proud to be an Equal Opportunity and Affirmative Action Employer. We do not discriminate on the basis of any legally protected characteristics, including disabled and veteran status."
    },
    {
        "position": "Software Engineer - Intern",
        "company": "Domo, Inc.",
        "location": {
            "city": "American Fork",
            "state": "UT"
        },
        "posted": "2021-01-20T09:38:03.909Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-domo-inc-2392067807?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=9e4rlB5E98pjjfbzpv%2F%2B4A%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:03.909Z",
        "description": "We are Domosapiens- uniquely skilled, passionate data lovers anchored in a culture of connectivity. We are transforming the way business is managed by putting real-time data into the hands of every decision-maker across organizations. Diversity is valued here because homogenized teams create echo chambers; and nobody benefits from that. The insight garnered from diverse backgrounds, perspectives, and lived experiences results in pioneering innovations across the organization and better experiences for our customers. The more diverse our talent, the more impactful the Domosphere becomes.<br><br><strong><u>Position Summary<br><br></u></strong>Our engineering team is rapidly growing and we are looking for Software Engineer Interns to be a part of our fast-paced, high-energy team. Our engineering interns are serious about the success of the company and are given the tools and environment they need to succeed. If you are looking for an internship with a passion for learning cutting edge web technology, solving interesting business problems, and you believe that planning, hard work, teamwork, and creating high quality experiences is what it takes to succeed, then this is the job for you.<br><br><strong><u>Key Responsibilities<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in development areas such as algorithms, databases, and distributed systems;</li> <li>Help with the design and development of Domo's data analysis platform;</li> <li>Work with other engineering teams to optimize the usage and efficiency of Domo's data analysis platform;</li> <li>Help develop methods and tools to monitor the performance and reliability of Domo's data analysis platform.</li> <br><br></ul><strong><u>Job Requirements<br></u></strong><ul> <li>Software development experience (internship experience ok) and coursework in web technologies such as HTML/CSS, Java, and Spring;</li> <li>Demonstrated aptitude for learning new technologies;</li> <li>Ability to communicate and interface with technical and non-technical members of the organization;</li> <li>Working on a College degree in Computer Science, Information Systems, or related field and/or equivalent combination of experience and education.</li> <br></ul><strong>Domo is an equal opportunity employer.</strong>"
    },
    {
        "position": "Data Science Intern",
        "company": "Agari",
        "location": {
            "city": "San Mateo",
            "state": "CA"
        },
        "posted": "2021-01-11T09:38:04.444Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-agari-2374147168?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=Uf5IRB3SjqhCNBDENkgygg%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:04.444Z",
        "description": "<strong><u>About Agari<br><br></u></strong>Agari is the Trusted Email Identity Company™, protecting brands and people from devastating phishing and socially-engineered attacks. Using applied data science and a diverse set of signals, Agari protects the workforce from inbound business email compromise, supply chain fraud, spear phishing, and account takeover-based attacks, reducing business risk and restoring trust to the inbox. Agari also prevents spoofing of outbound email from the enterprise to customers, increasing deliverability and preserving brand integrity.<br><br><strong>Agari Product Development<br><br></strong>We believe strongly in autonomy for our engineering team; in collaboration with the product owners and engineering colleagues, our engineers are empowered to make decisions about every aspect of our architecture and development process. We value learning through pairing on unfamiliar areas of the stack with someone knowledgeable and by attending conferences and classes. Learn more about our Engineering team here: https://medium.com/job-portraits/scaling-products-scaling-teams-whats-next-for-engineering-at-agari-ad8f4f90e862<br><br>Your Future Role<br><br>We are looking for a Data Science Intern candidate eager to participate in hands-on machine learning projects directly supporting security software. Candidate should have a high-level of interest in the Data Scientist career path and be ready and willing to learn from an experienced team in a fast-paced environment.<br><br>Responsibilities:<br><ul> <li>Shadowing and supporting Data Scientists in their assigned projects</li> <li>Building automation to support existing product support process</li> <li>Data Engineering tasks directly supporting model development</li> <li>Model performance evaluation</li> <li>Additional tasks related to system process upkeep</li> <br></ul>Qualifications:<br><ul> <li>Bachelor's degree in Computer Science, Mathematics, Computer Engineering, related fields, or equivalent work experience</li> <li>Python development experience with a focus in data analytics, data visualization, web scraping, or machine learning in at least some of the following:<br><ul> <li>NumPy</li> <li>SciPy</li> <li>Pandas</li> <li>Matplotlib</li> <li>Seaborn</li> <li>TensorFlow</li> <li>Keras</li> <li>Scikit Learn</li> <li>Statsmodels</li> <li>Plotly</li> <li>NLTK</li> <li>PySpark</li> </ul> </li> <li>General development/other software proficiency in at least some of the following:<br><ul> <li>Git</li> <li>Jupyter Notebooks</li> <li>SQL</li> <li>Microsoft Excel</li> <li>JIRA / Confluence</li></ul></li></ul>"
    },
    {
        "position": "Software Engineering Intern (Fall 2021)",
        "company": "Credit Karma",
        "location": {
            "city": "Charlotte",
            "state": "NC"
        },
        "posted": "2021-01-11T09:38:04.979Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-fall-2021-at-credit-karma-2373068300?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=qDMsSVY8TbbkB5jgkNmQTw%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:04.979Z",
        "description": "Credit Karma is a mission-driven company, focused on championing financial progress for our more than 100 million members in the U.S., Canada and U.K. While we're best known for pioneering free credit scores, our members turn to us for tips as they work on their financial goals, including helping them monitor their credit, identity monitoring, searching for credit cards, shopping for loans (car, home and personal), and growing their savings* -- all for free. Credit Karma has grown significantly through the years: we've added more than 70 million members in the last five years alone and now have more than 1,100 employees across our offices in Oakland, Charlotte, Los Angeles and London.<br><br><li>Banking services provided by MVB Bank, Inc., Member FDIC<br><br></li>The Credit Karma Software Engineering Intern Program is a 10-12 week paid internship program located in Charlotte, NC. During your internship, you will be placed into a team where you will work on various projects to help Credit Karma fulfill its mission to make financial progress possible for everyone. Interns will have the opportunity to participate in weekly cohort meetings, team outings, events, and engage in discussions with Credit Karma leadership. If you want to be in a true learning environment and are eager to make an impact in your next internship, this is the place to be! We will equip you with the tools and relationship building techniques you need to be successful wherever life may take you.<br><br>We’re in search of hardworking university students who want to get hands-on experience in a multifaceted environment like ours! We have openings across all Engineering teams (including various product verticals, security, QA, and mobile teams) from application development, mobile development and web development. As a Credit Karma Software Engineering Intern, you'll be a part of the entire product development life-cycle. Being able to work side by side with our full-time engineers to make our product even more user-friendly and robust for our millions of users.<br><br><em>Please note - our internship program will be located in Charlotte, NC. Should the internship need to be remote, we can only accommodate candidates working in </em><strong><em>California, North Carolina, Texas, Washington, Oregon, Nevada, Missouri, South Carolina, New York, Georgia, Colorado, Utah, Arkansas, and Washington D.C</em></strong><em>. <br><br></em><strong><u>What You’ll Do<br></u></strong><ul> <li>Gain hands on experience working on a high impact engineering team</li> <li>Complete a project from start to finish within 10-12 weeks</li> <li>Work cross-functionally with various teams within Credit Karma</li> <br><br></ul><strong><u>Minimum Requirements<br></u></strong><ul> <li>Currently pursuing a Bachelor's Degree or Master’s Degree in Computer Science or similar discipline</li> <li>Experience in at least one multifaceted server-side language: PHP, Python, Perl, Java, Ruby, Scala, or similar</li> <li>Ability to work in a fast-paced, ever evolving environment</li> <br><br></ul><strong>Equal Employment Opportunity<br><br></strong>Credit Karma is committed to a diverse and inclusive work environment. We believe that such an environment advances long-term professional growth, creates a robust business, and supports our mission of championing financial progress for everyone. We offer generous benefits and perks with a single eye to nourishing an inclusive environment that recognizes the contributions of all and fosters diversity by supporting our internal Employee Resource Groups. We’ve worked hard to build an intensely collaborative and creative environment, a diverse and inclusive employee culture, and the opportunity for professional growth. As part of the Credit Karma team, your voice will be heard, your contributions will matter, and your unique background and experiences will be celebrated.<br><br>Credit Karma is also proud to be an Equal Opportunity Employer. We welcome all candidates without regard to race, color, religion, age, marital status, sex (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity or gender expression, national origin, veteran or military status, disability (physical or mental), genetic information, or any other protected characteristic. We prohibit discrimination of any kind and operate in compliance with the San Francisco Fair Chance Ordinance.<br><br><strong>COVID-19 update: </strong>Protecting the health of our employees and the candidates interested in a career at Credit Karma is our top priority. We appreciate your understanding and being open and flexible with any changes related to our interviewing process.<br><br>Credit Karma is strongly committed to protecting personal data. Please take a look below to review our privacy policies:<br><ul> <li><strong>GDPR Privacy Policy</strong></li> <li><strong>California Consumer Privacy Act (CCPA)</strong></li></ul>"
    },
    {
        "position": "Computer Science/Computer Engineering Intern",
        "company": "Applied Optimization",
        "location": {
            "city": "Fairborn",
            "state": "OH"
        },
        "posted": "2021-01-11T09:38:05.344Z",
        "url": "https://www.linkedin.com/jobs/view/computer-science-computer-engineering-intern-at-applied-optimization-2387909934?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=yBQIq4m723EAWn5FNlgZTw%3D%3D&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:05.344Z",
        "description": "<strong><u>Applied Optimization (AO) Job Description<br><br></u></strong>Job Title: Computer Science/Computer Engineering Intern<br>Reports to: Principal Scientist<br>FLSA Status: Part-Time (Non-Exempt)<br><br><strong><u>Position Objective<br><br></u></strong>To support an interdisciplinary research and development team that collects data to analyze and implement new generation scientific algorithms in the areas of mechanical engineering or space science<br><br><strong><u>Essential Functions<br><br></u></strong>Aid in designing, building, testing, and implementing software applications for space science applications<br>Provide technical support for object modeling and algorithm development for new generation science applications<br>Perform verification, documentation, and quality assurance for new and existing software<br>Ensure accuracy and follow documentation procedures for all work; maintain notebook of daily activities and provide weekly report of work<br>Other related duties as assigned<br><br><strong><u>Required Qualifications<br><br></u></strong>Undergraduate or graduate student enrolled in a program related to the field of computer science or computer engineering with a superior academic record<br>General understanding of software development and knowledge of various coding languages<br>Attention to detail and effective time and schedule management skills<br>Effective organizing, planning, debugging, and problem-solving skills<br>Ability to adapt within a small team to support evolving customer requirements<br>Ability to execute instructions and communication in written, oral, and diagram form<br>Demonstrated strong writing, fact-gathering, and analytical skills<br>Basic computer and software skills including, but not necessarily limited to, Microsoft Office products (e.g., Outlook, Word, Excel, and Power Point)<br><br><strong><u>Preferred Qualifications<br><br></u></strong>College sophomore or junior with a cumulative GPA (Grade Point Average) of 3.5 or higher<br>Minor or dual degree in mathematics, engineering, or physics/astronomy<br>Knowledge or experience in C++ object modeling/software development, Python, HTML, Java, C#, MATLAB, and/or other coding languages<br>Knowledge or experience in CSS, Django, D3-data visualization, and Linux<br>Knowledge of computer operating systems<br>Ability to occasionally work 2nd shift<br><br><strong><u>Citizenship/Security Clearance Requirements<br><br></u></strong>U.S. Citizen or Green Card Holder<br>May be required to obtain and maintain U.S. Government Security Clearance<br><br><strong><u>About Our Internships<br><br></u></strong>Hours: The internship is a part-time, year-round position that requires a minimum of sixteen hours per week of work. The hours are flexible and they can change from one semester to another based on the student’s class schedule. The weekly hours can be adjusted to balance for the examinations, tests and project submissions.<br>About Us: Applied Optimization is a growing organization located in Fairborn, OH. We are an equal opportunity employer offering a competitive salary that is commensurate with qualifications and a comprehensive benefits package. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by applicable law. Find out more about us at www.appliedo.com.<br><br><strong><u>Please Contact<br><br></u></strong>This job description is subject to change.<br><br>hr@appliedo.com"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Lockheed Martin",
        "location": {
            "city": "Owego",
            "state": "NY"
        },
        "posted": "2021-01-04T09:38:05.710Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-lockheed-martin-2375175292?refId=9b3681e7-b69b-4d90-a056-def4e480677d&trackingId=TcCRc7tIPSaaTPSIfHZ7ZA%3D%3D&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-25T09:38:05.710Z",
        "description": "<strong>Description:</strong>Candidates pursuing bachelors or master’s degrees in computer science or software, computer or electrical engineering or related disciplines should explore the opportunities available in the Owego Software Engineering organization.<br><br>An intern in this position will work closely with a team of engineers on a formal government fixed or rotary wing aircraft contract or internal investment efforts in one or more of the following areas: military aircraft avionics, mission systems, sensor subsystems or mail handling systems, mission planning, simulation or automation.<br><br>Software Engineering tasks include: requirements analysis, design, code, software unit test, documentation review and update, testing of recent engineering releases, analysis &amp; documentation of problem trouble reports found during testing, providing written and verbal status of testing progress to the concurrent engineering team and providing suggestions for problem trouble report resolution.<br><br>Must be able to obtain an interim secret clearance prior to start, and must be able to obtain and maintain a security clearance.<br><br>2.5 GPA or higher preferred, but not required (Cumulative or Major GPA).<br><br><strong><u>Basic Qualifications<br><br></u></strong>Currently pursuing a BS or MS degree in Computer Science or Software, computer or electrical Engineering or related discipline<br><br>Must be able to obtain an interim secret clearance prior to start, and must be able to obtain and maintain a security clearance.<br><br>2.5 GPA or higher preferred, but not required (Cumulative or Major GPA).<br><br><strong><u>Desired Skills<br><br></u></strong>C/C++/C#, Java, Ada, LabView/LabWindows and/or Teststand.<br><br>Experience with embedded or Linux operating systems desired. Familiarity with object-oriented analysis/design and agile development is beneficial.<br><br><strong><u>Job.Qualifications<br><br></u></strong><strong>BASIC QUALIFICATIONS:<br><br></strong><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br><br>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br><br><strong><u>Experience Level<br><br></u></strong>Co-op/Summer Intern"
    }
]