[
    {
        "position": "Data Science Intern",
        "company": "Mailchimp",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2021-01-29T07:55:12.450Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-mailchimp-2385561332?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=Z8p46ZevogjHG13XQT819Q%3D%3D&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:12.450Z",
        "description": "Mailchimp is a leading marketing platform for small business. We empower millions of customers around the world to build their brands and grow their companies with a suite of marketing automation, multichannel campaign, CRM, and analytics tools.<br><br>The Mailchimp internship program started in 2013. In the past 7 years, we’ve had the privilege of bringing in some of the brightest, most talented college students from around the country to spend time with our teams. Our 12 week internship program was designed so that interns can grow their skill set, thrive in the Mailchimp community, and do meaningful work. They also have a lot of fun along the way!<br><br><strong>Start Date: May 17th or June 7th<br><br></strong>The Data Science team builds applications that make sense of the data created by Mailchimp’s millions of users. By using predictive analytics and big data technologies we help Mailchimp users grow through our smart marketing tools and data-driven insights . We work closely with Mailchimp’s Development and Operations teams to make analytical insights actionable within our infrastructure.<br><br>Mailchimp is looking for a Data Science intern to help our team’s research efforts. You’ll work alongside data scientists and software engineers by trialing analyses and training predictive models on our data that will eventually become customer facing and/or internal services, and you'll touch hundreds of terabytes of data.<br><br>The ideal candidate is a curious and resourceful data scientist who believes in demonstrating how data can be used to help our customers. You love new challenges, but you're skeptical of the new hotness. You’ve run analyses using various tools, but you're partial to Python. Communication, critical thinking, and cross-validation are tools you use every day.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li> Work alongside other data scientists to develop analytical techniques for our predictive models </li> <li> Come up with interesting data-driven product ideas to solve problems for our users </li> <li> Perform statistical analyses and communicate findings </li> <li> Work to improve data integrity and mitigate bias in Mailchimp data systems </li> <li> Embrace and demonstrate our values: humility, creativity, and independence </li> <br><br></ul><strong><u>We’d Love To Hear From You If<br></u></strong><ul> <li> Pursuing a degree in Statistics, Operations Research, Mathematics, Computer Science, Quantitative Social Science, or equivalent experience </li> <li> Understanding of statistical analysis and machine learning techniques </li> <li> Have experience in natural language processing </li> <li> Have experience programming in Python </li> <li> Experience in database systems (SQL or MySQL) </li> <li> Experience with Cloud platforms (Google Cloud, AWS...) </li> <li> Ability to communicate methods and results of analyses </li> <br></ul>Mailchimp is a founder-owned and highly profitable company headquartered in the heart of Atlanta in the historic Ponce City Market , right on the Beltline . Our purpose is to empower the underdog, and our mission is to democratize cutting edge marketing technology for small business. We offer our employees an exceptional workplace , extremely competitive compensation, fully paid benefits (for employees and their families), and generous profit sharing . We hire humble , collaborative, and ambitious people, and give them endless opportunities to grow and succeed. If you'd like to be considered for this position, please apply below. We look forward to meeting you!<br><br>Mailchimp is an equal opportunity employer, and we value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."
    },
    {
        "position": "Applied Research Data Science Intern",
        "company": "LinkedIn",
        "location": {
            "city": "Sunnyvale",
            "state": "CA"
        },
        "posted": "2021-01-10T07:55:13.443Z",
        "url": "https://www.linkedin.com/jobs/view/applied-research-data-science-intern-at-linkedin-2343349591?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=mM0puARkcE6epen7Os9roA%3D%3D&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:13.443Z",
        "description": "Applied Research Data Science Intern - Summer 2021 <br><br>LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume – we transform lives through innovative products and technology.<br><br>LinkedIn’s Data Science team leverages big data to empower business decisions and deliver data-driven insights, metrics, and tools in order to drive member engagement, business growth, and monetization efforts. With over 500 million members around the world, a focus on great user experience, and a mix of B2B and B2C programs, a career at LinkedIn offers countless ways for an ambitious data scientist to have an impact.<br><br>We are now looking for talented and driven individuals to accelerate our efforts and be a major part of our data-centric culture. It is expected that this person understands scientific methodologies, has strong problem solving skills, and is comfortable with implementing algorithms. Ideally this individual will understand the fundamentals of experimentation, analytic thinking and have experience with modeling data in an area such as machine learning, optimization or time series analysis. Successful candidates will exhibit technical acumen on inference and algorithms, and the business savvy to use these technical skills to drive better business decision-making.<br><br>Responsibilities<br>Work with a team of high-performing analytics, data science professionals, and cross-functional teams to identify business opportunities, and develop algorithms and methodologies to address them.<br>Analyze large-scale structured, and unstructured data.<br>Develop methodologies to enhance LinkedIn’s product, and platform capabilities.<br>Conduct in depth and rigorous research focused on solving business problems relevant to LinkedIn.<br>Develop and implement methodologies and algorithms in areas such as machine learning and causal inference to drive member value and customer success.<br><br>Promote and enable adoption of technical advances in Data Science; elevate the art of Data Science practiced at LinkedIn.<br>Initiate and drive projects to completion with minimal guidance.<br>Communicate findings to senior leaders and evangelize data-driven business decisions.<br>This is a full-time internship role based in Sunnyvale, CA, or San Francisco, CA<br>This internship will take place between May - September 2021<br><br><br>Basic Qualifications<br><br>Currently pursuing a Masters or PhD degree in a quantitative discipline: statistics, operations research, computer science, informatics, engineering, applied mathematics, economics, etc. and returning to the program after the completion of the internship<br>Working knowledge in at least one programming language (e.g., R, Python, Java, Ruby, or Perl)<br>Experience in applied statistics and statistical modeling in at least one statistical software package, preferably R/Python.<br><br><br>Preferred Qualifications<br><br>Experience with manipulating massive-scale structured and unstructured data.<br>Experience with Hadoop or other MapReduce paradigms, and associated languages such as Pig, Hive, Spark, Scala etc.<br>Working knowledge of Unix and Unix-like systems, git and code review.<br>Strong communication skills, with the ability to synthesize, simplify and explain complex problems to different types of audience, including executives<br>Research experience related to one of the following domains: Experimentation and causal inference, Machine Learning, Operations Research, Time Series Analysis, Computational Social Science or related area.<br>\t<br><br><br><br><br>Equal Opportunity Statement<br>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful. <br> <br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation. <br> <br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to: <br> <br>-Documents in alternate formats or read aloud to you <br>-Having interviews in an accessible location<br>-Being accompanied by a service dog<br>-Having a sign language interpreter present for the interview<br> <br>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br>Pay Transparency Policy Statement<br>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br>Global Data Privacy Notice for Job Candidates<br>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"
    },
    {
        "position": "Data Science Discovery, Intern",
        "company": "Ancestry",
        "location": {
            "city": "Lehi",
            "state": "UT"
        },
        "posted": "2021-01-24T07:55:14.171Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-discovery-intern-at-ancestry-2379449231?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=v0GzSCZ4w%2BJwN3bifRmtOw%3D%3D&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:14.171Z",
        "description": "<strong>About Ancestry:<br><br></strong>When you join Ancestry, you join a human-centered company where every persons story is important. We believe that by discovering the struggles and triumphs of our past, we can foster deeper bonds and more meaningful connections among families and communities. Our talented team of scientists, engineers, genealogists, historians, and storytellers is dedicated to empowering customers around the world from all backgrounds on their journeys of personal discovery.<br><br>With more than 24 billion digitized global historical records, 100 million family trees, and 16+ million people in our growing AncestryDNA database, Ancestry helps customers discover their family story and gain actionable insights about their health and wellness. Passionate about dedicating your work to enriching peoples lives? You belong at Ancestry.<br><br>We are looking for an Intern to join our Data Science Discovery team. The Data Science Discovery team works on a variety of problems in search, recommender systems, content and probabilistic record linking. We work closely with our partners in business analytics, data science engineering, and professional genealogy to build machine learning models that improve the customer experience at Ancestry. As a Data Science Discovery Intern, you will create these backend models and tools. You will have the opportunity to work alongside a high functioning group tackling Ancestrys toughest and most exciting data science challenges while working with unique text data spanning decades across a variety of media channels.<br><br><strong>What You'll Do:</strong><li>Leverage AI and ML solutions in solving problems in ranking, recommendation and probabilistic record linking for areas in family history, health and DNA products </li><li>Champion a data-driven culture and support the long-term business value creation through development of best-in-class data science capabilities in the area of probabilistic record linking</li><li>Engage in technical discussions and brainstorm with the team in translating business problems into technical solutions and finding the best technical solutions to the challenges at hand <br><br></li><strong>Who You Are:</strong><li>Must be enrolled in a program majoring in Computer Science, math, or related fields</li><li>Must be enrolled in a University in the US and graduating after summer 2021 </li><li>Must be proficient in Python and SQL </li><li>Must have experience with applied Machine Learning </li><li>Must have demonstrable experience working on a data science project <br><br></li><strong>Nice to Have:</strong><li>Enrollment in a Masters or PhD program</li><li>Proficiency in Java (or Scala) </li><li>Knowledge about probabilistic record linking</li><li>Experience working on a cloud computing platform <br><br></li>It takes customer obsession to pioneer and focus on what matters most, to tackle challenges, break through boundaries to create change, to stay on the cutting edge, and pioneer relentlessly. We are looking for the next generation of talent to drive the business, grow our people, and put the customer before all else. Our culture empowers journeys of personal discovery, giving you the freedom to participate in impactful projects and explore the intersections of our businesses: technology, data science, Health, DNA science, product, design, marketing, legal, and more. Were looking for innovative minds, diverse ideas, and for students interested in connecting personal discoveries and technology. Our Interns enjoy mentorship and experience challenging work while receiving fantastic pay, fully-paid temporary housing, and having a fun captivating experiencewe have it all. Oh, and did we mention the possibility of full-time employment once you graduate?<br><br>IND2<br><br><strong>Additional Information:<br><br></strong>Ancestry is an Equal Opportunity Employer that makes employment decisions without regard to race, color, religious creed, national origin, ancestry, sex, pregnancy, sexual orientation, gender, gender identity, gender expression, age, mental or physical disability, medical condition, military or veteran status, citizenship, marital status, genetic information, or any other characteristic protected by applicable law. In addition, Ancestry will provide reasonable accommodations for qualified individuals with disabilities.<br><br>All job offers are contingent on a background check screen that complies with applicable law. For San Francisco office candidates, pursuant to the San Francisco Fair Chance Ordinance, Ancestry will consider for employment qualified applicants with arrest and conviction records.<br><br>Ancestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means<br><br>"
    },
    {
        "position": "Intern Data Science /Analytics",
        "company": "FedEx Services",
        "location": {
            "city": "Memphis",
            "state": "TN"
        },
        "posted": "2021-01-29T07:55:14.902Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-analytics-at-fedex-services-2204986583?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=BnDmAuJFb%2BAt%2B6otv%2Bp59g%3D%3D&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:14.902Z",
        "description": "<strong>Company:</strong> FedEx Services<br><strong>Job Title:</strong> Intern Data Science /Analytics<br><strong>Job Requisition Number:</strong> RC286540<br><strong>Category:</strong> Intern<br><strong>Pay Type:</strong> Non-exempt<br><strong>Locations:<br></strong>Memphis, Tennessee 38116<br>United States<br><br>This is a 10-week assignment for students pursuing a college degree. Assignments are directly related to intern's academic degree. Under direct supervision, performs duties as assigned. Student participates in a number of organized events providing visibility into the overall operations of FedEx.<br><br>Full-time internship opportunity available in multiple locations across the US from June 2021 to August 2021.<br><br><strong><u>The Intern May Assist With<br><br></u></strong>Under close supervision, the successful candidate may assist with project management, process mapping, data analysis, workflow documentation, and report automation. The project may relate to developing customer profiles based on data attributes, or analyzing package data attributes to optimize customer satisfaction.<br><ul><li>Conducting data analytics, customer profiles, report development, and/or research.</li><li>Interacting with business partners and/or staff to gather, interpret, and document customer and operational behavior for data analysis. </li><li>Documenting systems functions and business process flows.<br>The ideal candidate will possess the following skills and experience:</li></ul><ul><li>Strong analytical/quantitative, project/program management, organizational, leadership, presentation, and verbal and written communication skills.</li><li>Ability to manage multiple tasks, set priorities and monitor ongoing results.</li><li>Ability to synthesize big data (quantitative and qualitative); Report design/development.</li><li>Knowledge or experience with one or more of the following: data analytics, forecasting/modeling, strategy planning, engineering planning, operations, economics, process mapping, database query creation, web development, and project management.</li><li>Basic knowledge of one or more of the following: the software development process, systems applications and architecture, Query Languages, “R,” MATLAB, Python, C++, objective-C, and SQL.</li><li>Experience with Big Data technologies like Hadoop, Spark, Hive, Kafka, Hbase, etc.</li><li>Use of one or more analytic software tools or languages such as. Scala, R, Python, SAS</li><li>Demonstrated expertise in developing data pipelines with industrial datasets to enable descriptive, applied, and predictive analytics</li><li>Information technology data collection, organization, integration, data cleansing, data quality assessment, and using analytics for data assessment</li><li>Knowledge of PowerPoint, Keynote or Prezi and the Microsoft Office suite.<br><br></li></ul><strong><u>The Following Are Considered a Plus<br></u></strong><ul><li>Enrollment as undergraduate at junior year or above or graduate student in Engineering, Industrial Engineering, Operations Engineering, Software Engineering, Computer Engineering, Computer Science, Information Systems, Process Analysis, Systems Analysis and Design, Decision Science, Data Science, Statistics, Applied Statistics, Quality Improvement Analytics, Informatics, Mathematics, Business, Management, Finance, Accounting, Economics, Industrial Psychology, or other related major.</li></ul><ul><li>Ideally, plans to graduate within 12 months of completing the internship and begin full-time employment.<br><br></li></ul><strong><u>Resume Should Include The Following Information<br></u></strong><ul><li>College address and permanent home address.</li><li>Email address.</li><li>Telephone number.</li><li>The following regarding the degree you are currently pursuing:<br><ul><li>Name of college/university.</li><li>Degree (For example, bachelor’s degree, master’s degree, or doctorate).</li><li>Major and/or minor.</li><li>Overall GPA.</li><li>Major GPA.</li><li>Date of intended graduation (Month and year).</li></ul></li></ul><u>Domicile Location</u><u>:<br></u>Multiple locations across the US.<br>Relocation assistance not available.<br><br>FedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.<br><br>FedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com."
    },
    {
        "position": "Data Science Intern",
        "company": "M Science",
        "location": {
            "city": "United States",
            "state": "United States"
        },
        "posted": "2021-01-30T07:55:16.006Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-m-science-2386735892?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=bgJAo%2B%2FVxBONSx2LPN63cw%3D%3D&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:16.006Z",
        "description": "<p><strong>Title: Data Science Intern</strong></p><p><br></p><p><strong>Location:&nbsp;Remote</strong>&nbsp;</p><p><br></p><p><strong>Dates: June – August 2021</strong>&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>About M Science:</strong>&nbsp;</p><p>&nbsp;</p><p>M Science is a data-driven research and analytics firm, uncovering new insights for leading financial institutions and corporations. M Science is revolutionizing research, discovering new data sets and pioneering methodologies to provide actionable intelligence. Our research teams have decades of experience working with massive amounts of unstructured data in near real-time to discern critical insights that help clients make smarter, more informed decisions. We combine the best of finance, data and technology to create a truly unique value proposition for both financial services firms and major corporations.&nbsp;</p><p>&nbsp;</p><p>M Science was founded&nbsp;as Majestic Research in 2002 and in 2016 was spun out to form M Science, a portfolio company of Leucadia National Corporation,&nbsp;a division of Jefferies Financial Group Inc. (NYSE:JEF).&nbsp;</p><p>&nbsp;</p><p><strong>Description/ Responsibilities:</strong>&nbsp;</p><p>&nbsp;</p><p>Our&nbsp;Data Products&nbsp;Team is seeking a Summer Intern. The ideal candidate will have an entrepreneurial spirit, an interest in financial markets, and be inherently curious.&nbsp;The candidate should also be a self-starter with an ability to think creatively and solve problems effectively.&nbsp;&nbsp;&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Qualifications/Required Skills:</strong>&nbsp;</p><ul><li>Strong quantitative and technical skills with some experience using database (e.g.&nbsp;SQL) and/or statistical computing software packages (i.e.&nbsp;R, Matlab, Python)&nbsp;</li><li>Effective communication and writing&nbsp;skills&nbsp;</li><li>Ability and interest to work with large-scale data&nbsp;sets&nbsp;</li><li>Solid understanding of financial statements and finance concepts&nbsp;</li><li>Interest in equity markets&nbsp;</li></ul><p><strong>Education/Experience Requirements:</strong>&nbsp;</p><ul><li>Pursuing a&nbsp;Bachelor’s&nbsp;or Master’s degree and graduating in December 2020 or May 2021.&nbsp;&nbsp;</li><li>Specialization in&nbsp;math,&nbsp;statistics, finance, economics, computer science, or engineering&nbsp;preferred&nbsp;</li></ul><p></p>"
    },
    {
        "position": "Applied Research Scientist Intern — AI and Data Science",
        "company": "Domo, Inc.",
        "location": {
            "city": "American Fork",
            "state": "UT"
        },
        "posted": "2021-01-10T07:55:16.398Z",
        "url": "https://www.linkedin.com/jobs/view/applied-research-scientist-intern-%E2%80%94-ai-and-data-science-at-domo-inc-2400239409?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=fzTf9%2BazBlZl8m2bXEU6rw%3D%3D&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:16.398Z",
        "description": "We are Domosapiens- uniquely skilled, passionate data lovers anchored in a culture of connectivity. We are transforming the way business is managed by putting real-time data into the hands of every decision-maker across organizations. Diversity is valued here because homogenized teams create echo chambers; and nobody benefits from that. The insight garnered from diverse backgrounds, perspectives, and lived experiences results in pioneering innovations across the organization and better experiences for our customers. The more diverse our talent, the more impactful the Domosphere becomes.<br><br><strong>What is Domo?<br><br></strong>Domo brings together all your people, data, and systems into one cloud-based software as a service system to accelerate the productivity of your organization. Domo is a platform that enables every user, whether they are a(n) executive, front line employee, or data scientist, to be more productive in leveraging their data to answer key questions and improve decision making.<br><br><strong>Why Domo?<br><br></strong>Domo is the data platform for everyone and this in role, in Domo's product organization, is focused on making this platform the best in the world. That means that at Domo you will have the opportunity to explore and/or specialize in the data and problems from almost any industry or organization. Whether you are interested in developing sophisticated machine learning models to improve our users productivity with out product, designing experiments to uncover causal factors of business processes or software changes, or even working on analysis for a sales process that could benefit our business or be sold as a solution to our customers, you are only limited by your curiosity and drive to solve interesting problems.<br><br><strong>Problems that make you excited to come to work<br><br></strong>At Domo you will have the opportunity to collaborate with internal and external teams to see your ideas have real world impact in the 5 focus areas of our team.<br><br><strong>Automation<br><br></strong>At Domo we leverage machine learning methods to enhance our users experience with our product (i.e. recommendation systems, semantic classifiers of data, etc), improve our users productivity (i.e. automated analysis), and domain specific machine learning methods (by industry of business unit).<br><br><strong>Data Science Platform Development<br><br></strong>Domo lets you get business leverage at cloud scale in record time by using all of your organizations data. We work closely with our software engineering teams to develop the best of breed tools and capabilities to allow our customers to use data science to understand causality or automate their decisions.<br><br><strong>Experimentation<br><br></strong>Our experimentation initiatives utilize the scientific method to determine causality to inform our decision making. At Domo you will be able to leverage your scientific expertise to design and perform experiments that have tangible impact on our business and our product.<br><br><strong>Decision Science<br><br></strong>We leverage statistical inference to help us to generate hypotheses about our product and our business. At Domo you will have the opportunity to flex your statistical muscles to identify reliable trends in data and candidates that would be prime for experimentation.<br><br><strong>Research<br><br></strong>At Domo we are passionate about research and recognize the value of being involved in the scientific community to collaborate and develop novel solutions to Domo's biggest problems. We encourage our team members to forge academic partnerships and to submit papers to conferences for publication.<br><br><strong><u>Key Responsibilities<br></u></strong><ul> <li>Independence — in this role you will need to be able to independently design and deliver impactful results with little oversight;</li> <li>Identify new opportunities — while collaborating with other internal and external teams, we expect you to leverage your scientific perspective and knowledge of the art of the possible to uncover novel applications that could benefit from scientific, statistical, or machine learning approaches;</li> <li>Meaningful impact — you will be expected to identify and solve problems with your scientific skills that will move the needle for the Domo product and the business at large.</li> <br><br></ul><strong><u>Job Requirements<br></u></strong><ul> <li>3+ years of research experience producing rigorous scientific findings in academia or industry;</li> <li>3+ years working with real world datasets; strong ETL skills (SQL, map reduce, etc.);</li> <li>Scientific mentality—you have applied the scientific method to multiple projects;</li> <li>Strong knowledge of and experience implementing machine learning methods in theoretical and applied settings;</li> <li>Strong understanding of math and statistical methods;</li> <li>4+ years programming experience including compiled and interpreted languages;</li> <li>Strong critical thinking skills at efficiently solving real world problems;</li> <li>Strong communication skills: verbally, in writing, data visualization;</li> <li>Currently enrolled in a PhD or MS in Computer Science, Mathematics, Statistics, Natural Sciences, or other scientific discipline.</li> <br></ul><strong>Nice to Have<br></strong><ul> <li>Ideally planning graduating in 2021 or 2022;</li> <li>Strong first author publication record high impact journals and conferences(KDD, NeurIPS, ICML, AAAI, Science Journals, Nature Journals, IEEE, JASA etc.); </li> <li>Design and implementation of novel deep learning approaches;</li> <li>Recommendation system experience;</li> <li>NLP and information retrieval experience;</li> <li>Experience with the semantic web, ontologies, and crowdsourcing;</li> <li>Deployed machine learning models to production systems.</li> <br></ul><strong>Domo is an equal opportunity employer.</strong>"
    },
    {
        "position": "Machine Learning Summer 2021 Internship",
        "company": "Ibotta, Inc.",
        "location": {
            "city": "Denver",
            "state": "CO"
        },
        "posted": "2021-01-31T07:55:17.007Z",
        "url": "https://www.linkedin.com/jobs/view/machine-learning-summer-2021-internship-at-ibotta-inc-2401710559?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=Wjv2qdGjZtdb8WfL7asknQ%3D%3D&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:17.007Z",
        "description": "Are you looking for an exciting <strong>Summer 2021 internship</strong> working on recommender systems and multi-armed bandit models? Ibotta is seeking an ML intern to join our ML team and this opportunity will provide just that. The ML team is providing recommendations and ranking of items across our App, web-browser extension, and customer email notifications creating millions in revenue for ibotta.<br><br>As an ML intern you will be responsible for using the latest developments in machine learning, deep learning, multi-armed bandits, and reinforcement learning to understand our models in depth and build novel state-of-the-art models to improve our ML models.<br><br><strong>You will be paired with a mentor to work on:<br></strong><ul> <li>Embrace and uphold Ibotta’s Core Values: Integrity, Boldness, Ownership, Teamwork, Transparency &amp; Advocate for Savers</li> <li>Work with the mentor on understanding our models, users and clients.</li> <li>Build, train, and validate deep learning, recommender, and multi-armed bandit models </li> <li>Run statistical analysis and create predictive models based on past user purchases and behavior</li> <li>Develop recommender systems and machine learning algorithms for user targeting and personalization</li> <li>Report and understand system performance in detail, and identify ideas for improvement</li> <br><br></ul><strong><u>What We Are Looking For<br></u></strong><ul> <li>Graduate Student studying MSc or PhD in computer science, mathematics, statistics, data science, engineering or equivalent experience preferred</li> <li>Good understanding of the key concepts of Recommender Systems, Machine Learning and multi-armed bandits</li> <li>Proven expertise with data handling, processing, statistical and analytical skills</li> <li>Ability to think creatively and provide thoughtful, agile insights</li> <li>Experience using modern data analysis tools (such as Python, PyTorch) and familiarity with Spark is required</li> <li>Ability to develop and maintain ML models</li> <li>Ability to visualize, analyze, and communicate results</li> <li>Experience with SQL required</li> <li>Good understanding of A/B testing and control group concepts</li> <li>Ability to work collaboratively to drive towards common goals</li> <br><br></ul><strong><u>To Apply<br></u></strong><ul> <li>Submit a resume</li> <li>Submit a cover letter which specifies your goals and what you hope to gain out of an internship with Ibotta</li> <li>We are looking for students entering their last graduate year (or final semester) of the program in Fall 2021</li> <li><strong>Application Deadline: 2/15/2021 (EOD) </strong></li> <br><br></ul><strong><u>About Us<br><br></u></strong>Built in Denver, CO, Ibotta (\"I bought a...\") is a free mobile shopping app that gives users cash back on groceries and more. Through our partnerships with brands and retailers like Procter &amp; Gamble, Kraft Heinz, Kellogg, Amazon, Walmart, Target and Uber, we’ve delivered over $750 million in cumulative cash rewards to our Savers. Guided by our values and our mission to make every purchase rewarding, we come to work energized by the business problems we get to solve, the technology we get to build, and the people we get to innovate (and have fun) with. Ibotta made Inc.’s 2020 list of the 5000 fastest-growing private companies in the U.S. for the third consecutive year. In 2019, we became the first mobile consumer technology company in Colorado to achieve $1B in valuation.<br><br><strong><u> Additional Details<br></u></strong><ul> <li>This position is remote and includes competitive pay, Ibotta is an Equal Opportunity Employer. Ibotta’s employment decisions are made without regard with race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation, or any other legally protected status</li> <li>Applicants must be currently authorized to work in the United States on a full-time basis. </li> <li>For the security of our employees and the business, all employees are responsible for the secure handling of data in accordance with our security policies, identifying and reporting phishing attempts, as well as reporting security incidents to the proper channels.</li></ul>"
    },
    {
        "position": "Data Science Intern",
        "company": "Guidepoint",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-01-31T07:55:17.916Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-guidepoint-2355678337?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=T3G1mABJyuwj%2B5PBRQOHdw%3D%3D&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:17.916Z",
        "description": "Guidepoint Qsight identifies, gathers, acquires and delivers high-value data that offers clients unparalleled quantitative insight into company and sector performance. With over a decade of experience in collecting and analyzing primary data on hard-to-access markets, Guidepoint Qsight offers clients some of the most differentiated and powerful data available.<br><br>The Quantitative Data Intern will help with the development of Guidepoint’s Qsight offerings including building new products from proprietary data and purchased data.<br><br><strong>Responsibilities: <br><br></strong><ul> <li>Work with raw and complex data to find statistically significant signals</li> <li>Apply various modeling and analysis techniques to build top-line, company specific metric predictions that will consistently beat analyst consensus</li> <li>Research various sector and company controversies to help qualitatively inform and interpret models</li> <li>Analyze and understand the disparate sources of industry data</li> <li>Utilize a diverse array of technologies and tools as needed, to deliver insights, such as R, SAS, Python, MetLab, SQL</li> <li>Conduct quantitative analytics and modeling projects in addition to developing new models, analytic processes and systems approaches</li> <br></ul><strong>Qualifications:<br><br></strong><ul> <li>Pursuing a degree in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields, graduating by May 2020.</li> <li>Relevant experience and strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/ or information retrieval.</li> <li>A hunger for solving complex, difficult big data problems with a sense of urgency</li> <li>Ability to work with team to assess needs, provide assistance, and resolve problems, using excellent verbal/written communication to non-technical audiences</li> <li>Experience with industry standard risk analytics and stress testing methods</li> <li>Excellent problem solver willing to work independently</li> <li>Strong focus on quality and on addressing client needs</li></ul>"
    },
    {
        "position": "Software Intern",
        "company": "Cerner Corporation",
        "location": {
            "city": "Kansas City",
            "state": "KS"
        },
        "posted": "2021-01-27T07:55:18.416Z",
        "url": "https://www.linkedin.com/jobs/view/software-intern-at-cerner-corporation-2402456806?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=DTo7icb5nUqaYcEyFlm6qA%3D%3D&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:18.416Z",
        "description": "When hired into the Software Intern Program, you reap big benefits. During your internship, you will gain insights into Cerner’s engineering methodology and will begin real project work immediately. You’ll work alongside the experts to gain knowledge and skills that will prepare you for a long-term, meaningful career.<br><br>Cerner Software Engineers create industry-leading technology that impacts patient care and/or Cerner business around the globe. As a Software Engineer Intern, you will work with your team as they understand user needs, provide input to design, develop applications, write automated tests, and troubleshoot issues across Cerner's technology solutions.<br><br>The work is dynamic. Your team may be developing tools that reduce medical errors, better manage disease, save lives and reduce wasteful spending. Or, they may be working alongside Cerner business teams to develop ways to improve efficiency and productivity. You’ll be a part of the team from day one and may learn or work with a variety of languages and platforms. <strong>Qualifications<br><br></strong><strong>Basic Qualifications :<br><br></strong><ul><li> Actively pursuing a Technical Bachelor's degree in Computer Science, Computer Engineering, Software Engineering, or related field </li></ul> <br><strong>Preferred Qualifications :<br><br></strong><ul><li> Proficiency through work experience or academic coursework in developing software using one or more preferred programming languages, including Java, C++, C#, JavaScript, Ruby, Python, etc. <br></li></ul><strong> Expectations :<br> <br></strong><ul><li> U.S. work authorization required </li><li> Relocation to the Kansas City metropolitan area for the duration of the internship (temporary housing available) </li><li> Ability to work 40 hours per week </li><li> Active participation in Cerner’s Summer Internship Program</li></ul>"
    },
    {
        "position": "Software Engineer, Intern",
        "company": "Domino Data Lab",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-30T07:55:18.910Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-domino-data-lab-2402635894?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=PdW4AqKWb5D%2FcercnRZhXw%3D%3D&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:18.910Z",
        "description": "Who We Are<br>At Domino Data Lab, we have an ambitious vision for data science. Our platform helps data science teams accelerate research, increase collaboration, and rapidly deploy predictive models. Our customers are the most sophisticated analytical organizations in the world, including companies like Bristol Myers Squibb, Allstate, Bayer, and Red Hat. Backed by Sequoia Capital, Coatue Management, Bloomberg Beta, and Zetta Venture Partners, we are at the epicenter of the data science revolution, helping companies develop the next breakthrough in medicine, build better cars, or recommend the best song play next.<br>Why Intern At Domino Data Lab?<br><li> Growth - Startups like Domino provide massive opportunities to stretch. You'll be challenged to grow rapidly, taking broader responsibility than you'd get at a large tech company</li><li> Revolution - The next era of computing is based in Data Science, Machine Learning, and AI - Domino is at the forefront of making that transition a reality</li><li> Mentorship - Our engineering team provides great mentorship and learning for junior hires while allowing individuals to learn at their own pace</li><li> Learning - Domino's full stack software engineering role means you'll learn a diverse skillset including Scala, Kubernetes, React, AWS, and Docker - all highly-sought-after, modern technologies that will help build your skillset and resume</li><li> Culture - We're not your typical startup focused on lifestyle and perks - we're a professional team focused on high standards, low ego, great communication, and a growth mindset</li><li> Challenges - Our software isn't a simple CRUD app, we deal with challenges like job distribution, cluster management, cybersecurity defense, cloud computing, full stack app development, and complex integration of a plethora of data science tools and libraries<br></li>What Your Impact Will Be<br><li> As part of our Infrastructure Engineering team you will</li><li> Improve our visibility into Domino installations around the world by aggregating debugging information in a centralized location</li><li> Create integrations with other internal systems to provide Domino staff a single pane of glass to view customer information</li><li> Build new workflows to allow engineers, support, and sales staff more flexibility in creating representative and custom Domino installs</li><li> Extend our internal cloud governance capabilities to create self-serve tooling for engineers that keep our costs down<br></li>What We Offer<br><li> A 3-6 month internship with flexible start date</li><li> Competitive intern salary</li><li> Real work - no intern projects from the dustbin of forgotten projects, work alongside our full time engineers on real projects<br></li>What We Look For in This Role<br><li> Individuals working toward a degree in computer science or related study, as well as recent boot camp or college graduates</li><li> Excitement and passion for shaping the field of Data Science and Machine Learning</li><li> Excited to learn more about working in an enterprise tech startup<br></li>What We Value<br><li> We value a growth mindset. High-performing creative individuals who dig into problems and see the opportunities for success</li><li> We believe in individuals who seek truth and speak the truth and can be their whole selves at work</li><li> We value all of you that believe improving is always possible At Domino Everything is a work in progress - we can do better at everything</li><li> We emphasize an environment of teaching and learning to equip employees with the tools needed to be successful in their function and the company</li><li> We strongly believe in the value of growing a diverse team and encourage people of all backgrounds, genders, ethnicities, abilities, and sexual orientations to apply</li>"
    },
    {
        "position": "Intern - Data Science (Remote)",
        "company": "Progressive Leasing",
        "location": {
            "city": "Draper",
            "state": "UT"
        },
        "posted": "2021-01-28T07:55:19.417Z",
        "url": "https://www.linkedin.com/jobs/view/intern-data-science-remote-at-progressive-leasing-2397556486?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=8AtMcFuV44ZD%2BQq8EJqFDw%3D%3D&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:55:19.417Z",
        "description": "At Progressive Leasing, we pride ourselves in building Data Science and Machine Learning solutions that transform the way retailers and consumers do business. We’re looking for an <strong>Intern - Data Science</strong> to continue strengthening that transformation.<br><br><em>This role can be performed remotely anywhere in the US.<br><br></em><strong>THE DETAILS <br><br></strong>As an Intern - Data Science, you will draw business insights from data through complex analysis, mining, and visualization. You will learn to understand the nuances of Progressive’s business and ensure that we capture, mine, and act on data related to our customers, our stores, and our operational and financial performance to drive business impact. You will leverage strong technical skills and creative thinking to solve problems and make quantitative decisions. Most importantly, you’ll allow us to get unique and valuable insights that go beyond the obvious and help us achieve extraordinary results.<br><br><strong>Essential Functions<br></strong><ul><li>Create interactive data visualizations/analysis that allow the business leaders to react quickly to performance and market trends and make data-driven decisions</li><li>Build and run models to determine optimal resource allocation</li><li>Analyze transaction patterns to prevent fraud</li><li>Extract usable information from unstructured data using advanced data mining techniques<br><br></li></ul><strong>Required Qualifications<br></strong><ul><li>Actively pursuing a bachelor’s or master's degree in a technical field (Math, Statistics, Physics, Computer Science, Engineering, etc.)</li><li>Strong quantitative analytical abilities<br><br></li></ul><strong>Preferred Skills &amp; Expertise<br></strong><ul><li>Experience with data mining and visualization tools such as R, Python, Tableau, and Power BI</li><li>Experience with querying languages such as SQL<br><br></li></ul><strong>What We Offer<br></strong><ul><li>Competitive Compensation</li><li>Job Required Equipment &amp; Services Will Be Provided<br><br></li></ul><strong>Who We Are<br><br></strong>Progressive Leasing (NYSE PRG) is the largest and longest-tenured virtual lease-to-own provider in the United States. The Company’s mission is to provide simple and affordable purchase options for credit challenged consumers. Over the last 20+ years, Progressive Leasing’s alternative lease-purchase options have helped millions of customers with less than perfect credit acquire needed items with ease. Progressive partners with 30,000 retail stores, helping to drive increased revenue and improve customer satisfaction. Learn more at ProgLeasing.com.<br><br><em>Progressive Leasing welcomes and encourages diversity in the workplace. We do not discriminate in any aspect of employment on the basis of race, color, religion, national origin, ancestry, gender, sexual orientation, gender identity and/or expression, age, veteran status, disability, or any other characteristic protected by federal, state, or local employment discrimination laws where Progressive Leasing does business.</em>"
    },
    {
        "position": "Data Science Intern (Summer 2021)",
        "company": "Credit Karma",
        "location": {
            "city": "Charlotte",
            "state": "NC"
        },
        "posted": "2021-01-29T07:56:20.315Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-summer-2021-at-credit-karma-2388920987?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=dwQuiNRNJAFe2I2PSk1J%2Fw%3D%3D&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:20.315Z",
        "description": "Credit Karma is a mission-driven company, focused on championing financial progress for our more than 100 million members in the U.S., Canada and U.K. While we're best known for pioneering free credit scores, our members turn to us for tips as they work on their financial goals, including helping them monitor their credit, identity monitoring, searching for credit cards, shopping for loans (car, home and personal), and growing their savings* -- all for free. Credit Karma has grown significantly through the years: we've added more than 70 million members in the last five years alone and now have more than 1,100 employees across our offices in Oakland, Charlotte, Los Angeles and London.<br><br><li>Banking services provided by MVB Bank, Inc., Member FDIC<br><br></li>The Credit Karma Data Science Intern Program is a 12 week paid internship program located in Charlotte, NC. During your internship, you will be placed into a team where you will work on various projects to help Credit Karma fulfill its mission to make financial progress possible for everyone. Interns will have the opportunity to participate in weekly cohort meetings, team outings, events, and engage in discussions with Credit Karma leadership. If you want to be in a true learning environment and are eager to make an impact in your next internship, this is the place to be! We will equip you with the tools and relationship building techniques you need to be successful wherever life may take you.<br><br><em>Please note - our internship program will be located in Charlotte, NC. Should the internship need to be remote, we can only accommodate candidates working in </em><strong><em>California, North Carolina, Texas, Washington, Oregon, Nevada, Missouri, South Carolina, New York, Georgia, Colorado, Utah, Arkansas, and Washington D.C</em></strong><em>. <br><br></em><strong><u>What You'll Do<br></u></strong><ul> <li>Partner with colleagues throughout the organization to identify high-impact opportunities to leverage our extensive data to better serve our users in Personal Finance.</li> <li>Be responsible for accelerating revenue advancement through disruptive and continuous improvements in various data science models (targeting, approval odds, marketing campaigns, etc.), feature engineering including user profiles and behavior, personalization, etc.</li> <li>Participate in research efforts with other team members to explore the frontiers of Deep Learning, Recommender systems, Financial Assistant, and other areas, as they apply to Personal Finance.</li> <br><br></ul><strong><u>What's Great About The Role<br></u></strong><ul> <li>You will work with large scale Machine Learning Models to optimize for Personal Finance Products.</li> <li>You will work in a highly impactful team, who are working on large scale projects that directly impact the business and members.</li> <li>You will experience both personal and professional growth as you learn throughout the team.</li> <br><br></ul><strong><u>Minimum Basic Requirement<br></u></strong><ul> <li>Pursuing an Undergrad, Masters, or PhD Degree </li> <li>Majors: Statistics, Mathematics, or Computer Science</li> <li>General knowledge of Machine Learning</li> <li>Programming knowledge in Python, SQL</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Ambitious, results oriented, hardworking and creative thinker.</li> <li>Passionate about ML and big data</li> <li>Good knowledge of Python, R and SQL, as well as ML systems such as TensorFlow, Torch, etc.</li> <br><br></ul><strong>Equal Employment Opportunity<br><br></strong>Credit Karma is committed to a diverse and inclusive work environment. We believe that such an environment advances long-term professional growth, creates a robust business, and supports our mission of championing financial progress for everyone. We offer generous benefits and perks with a single eye to nourishing an inclusive environment that recognizes the contributions of all and fosters diversity by supporting our internal Employee Resource Groups. We’ve worked hard to build an intensely collaborative and creative environment, a diverse and inclusive employee culture, and the opportunity for professional growth. As part of the Credit Karma team, your voice will be heard, your contributions will matter, and your unique background and experiences will be celebrated.<br><br>Credit Karma is also proud to be an Equal Opportunity Employer. We welcome all candidates without regard to race, color, religion, age, marital status, sex (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity or gender expression, national origin, veteran or military status, disability (physical or mental), genetic information, or any other protected characteristic. We prohibit discrimination of any kind and operate in compliance with the San Francisco Fair Chance Ordinance.<br><br><strong>COVID-19 update: </strong>Protecting the health of our employees and the candidates interested in a career at Credit Karma is our top priority. We appreciate your understanding and being open and flexible with any changes related to our interviewing process.<br><br>Credit Karma is strongly committed to protecting personal data. Please take a look below to review our privacy policies:<br><ul> <li><strong>GDPR Privacy Policy</strong></li> <li><strong>California Consumer Privacy Act (CCPA)</strong></li></ul>"
    },
    {
        "position": "Data Scientist Intern (Remote)",
        "company": "Vee",
        "location": {
            "city": "United States",
            "state": "United States"
        },
        "posted": "2021-01-17T07:56:20.998Z",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-intern-remote-at-vee-2379523191?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=T1GeZ54ZfXstTtiCBA9q0Q%3D%3D&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:20.998Z",
        "description": "<p><strong>Position:</strong> Data Scientist Intern (REMOTE)</p><p><strong>Reports to: </strong>CTO</p><p><strong>Location:</strong> Remote</p><p><br></p><p><strong>Are you passionate about exploring where, how, and why data can drive business decisions?&nbsp;Interested in how organizations use analytics and data to innovate, grow and transform? Driven to help establish, define, and evangelize how data science can help drive a strategy?&nbsp;</strong></p><p><br></p><p><strong>Company Overview</strong></p><p>Vee inspires people to align on <em>Purpose</em> so they can unlock their individual and collective human potential. We are an early stage startup poised for dramatic growth. We specialize in developing ways to drive greater strategic alignment to unlock enterprise innovation and growth. After spending considerable time exploring the need for better alignment models across diverse organizations, we have developed a framework and methodology based on insights from extensive research. We are building products to assess gaps and are offering our consulting services to help 21st century leaders develop and implement their organizational and people strategies, along with the capabilities required to operationalize their <em>Purpose</em> as they transform.</p><p>&nbsp;</p><p><strong>Position Overview</strong></p><p>Join our fast-growing team!&nbsp;You will help drive intelligent, insightful, and predictive business results to help Vee and Vee’s clients drive value in the realms of people, purpose, and performance. You will help build Vee’s data capability and data strategy.</p><p>&nbsp;</p><p><strong>General Responsibilities</strong></p><ul><li>Research and develop statistical learning models for data analysis</li><li>Collaborate with Data Engineering, People Science, business partners, and Chief Technology Officer to devise innovative and forward-thinking solutions for our clients’ needs</li><li>Keep up-to-date with the latest technology trends</li><li>Communicate results and ideas to key stakeholders at Vee</li><li>Implement new statistical or other mathematical methodologies as needed for specific models or analysis</li><li>Optimize joint efforts between Data Engineering, business partners, UX, and People Science teams at Vee to drive business results</li></ul><p><strong>Core Experience &amp; Requirements</strong></p><ul><li>Masters degree in Computer Science, Applied Statistics, Applied math, Data Science, or a related field</li><li>Practical experience with multiple statistical languages (SAS, R, Pandas), data processing, database programming, and data analytics</li><li>Solid background in data mining and statistical analysis</li><li>Experience with programming languages such as Python and R</li><li>Knowledge of data visualization tools (e.g. Tableau)</li><li>Strong collaboration skills -&nbsp;you partner well with others to solve problems and actively incorporate input from various sources</li><li>Excellent oral and written communication skills</li><li>Working with key stakeholders to drive business results</li></ul><p><br></p><p><strong>Profile</strong></p><p>Purpose is what drives you. Your passion for your work has led you here. You are ready to combine your experience with ours to help our client companies gain competitive advantage. You bring strong creative thinking skills in addition to superior communication skills, allowing you to develop creative solutions for any challenge that comes your way.</p><p>&nbsp;You:</p><ul><li>Love what you do, love to be busy, and love to produce by being organized and methodical</li><li>Work with a sense of urgency and have a strong drive for results</li><li>Have the resilience and agility to adapt quickly in a fast-paced environment</li><li>Work independently as well as collaboratively to stretch thinking into creative solutions</li><li>Have strong verbal and written communication skills</li><li>Are excited about and suited for a startup, where you’ll be wearing a few hats</li><li>Are smart and fun with an empathetic nature, which will add to our culture</li></ul><p><strong>&nbsp;</strong></p><p><strong>About Vee</strong></p><p>Our founders and team have deep expertise in branding, innovation, design, I/O psychology, organization design, digital &amp; data product development, enterprise software and application development complemented by experience with clients ranging from emerging Silicon Valley unicorns to established leaders in government and the public and private sectors including American Express, Bank of America, BMW, Box, HP, Lowe’s, Mastercard, Microsoft, Nissan, Pepsico, Procter &amp; Gamble, SAP and The Clorox Company, among others. For more information, check out our website in transition at https://www.letsvee.com/.</p>"
    },
    {
        "position": "Data Science Intern",
        "company": "LMI",
        "location": {
            "city": "Tysons Corner",
            "state": "VA"
        },
        "posted": "2021-01-31T07:56:21.609Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-intern-at-lmi-2379451834?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=sYH7vj7rYwOW2AO9ACVCXQ%3D%3D&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:21.609Z",
        "description": "<strong><u>Overview<br><br></u></strong>LMI is a consultancy dedicated to improving the business of government, drawing from deep expertise in advanced analytics, digital services, logistics, and management advisory services. Established as a private, not-for-profit organization in 1961, LMI is a trusted third party to federal civilian and defense agencies, free of commercial and political bias. We believe government can make a difference, and we seek talented, hardworking people who share that conviction.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Analyzing complex processes from an enterprise perspective. </li><li>Assessing operations, identifying opportunities for enhancement, and developing solutions.</li><li>Evaluating alternative concepts using mathematical models, simulation tools, and supply chain theory.</li><li>Documenting functional capability requirements for subsequent use as the basis for software development.</li><li>Conducting and documenting results from functional software tests.</li><li>Performing studies and analyses and generating technical documentation of the results.</li><li>Creating and presenting briefings to communicate findings and recommendations<br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Current enrollment in a graduate program</li><li>Availability to work full-time for at least 8 weeks</li><li>Pursuing a major in Engineering, Modeling &amp; Simulation, Computer Science, Industrial Engineering, Math, Operations Research, Business Administration, or related fields.</li><li>Basic proficiency with a variety of data analysis tools, spreadsheets, and database programs.</li><li>Strong written and verbal communication skills, including the ability to compose and write a variety of internal and external documents, reports, and presentations.</li><li>Strong interpersonal and listening skills required, with ability to develop and maintain professional relationships within LMI and with its clients.</li><li>Ability to contribute to a professional work environment by demonstrating integrity, promoting teamwork, and fostering positive communication.</li><li>Strong problem solving, time-management, and organizational skills.</li><li>Strong planning skills and the ability to coordinate and prioritize assignments with minimum supervision. Must be self-directed and detail oriented in completing assigned tasks and projects.</li><li>Applicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information. For this position, LMI will only consider applicants who are eligible for security clearances. Only US Citizens are eligible for a security clearance.<br><br></li></ul><strong><u>Desired Qualifications/Skills<br></u></strong><ul><li>Experience working with Microsoft Excel and Access.</li></ul><ul><li>Experience with Visual Basic for Applications and Java is highly desirable. </li></ul><ul><li>Programming experience—ability to program and learn new programming languages quickly.<br><br></li></ul><strong>Options<br><br></strong>Apply for this job online Apply<br><br>Share<br><br>Email this job to a friend Refer<br><br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br><br>Share on your newsfeed<br><br><strong><br>LMI is an Equal Opportunity Employer. LMI is committed to the fair treatment of all and to our policy of providing applicants and employees with equal employment opportunities. LMI recruits, hires, trains, and promotes people without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity, age, national origin, disability, veteran status, or any other factors protected by applicable law.<br><br><strong>Need help finding the right job?<br><br><br></strong></strong>We can recommend jobs specifically for you! Click here to get started.<br><br>LMI is an Equal Opportunity Employer-all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."
    },
    {
        "position": "BI Analyst Intern",
        "company": "Unity Technologies",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-25T07:56:22.153Z",
        "url": "https://www.linkedin.com/jobs/view/bi-analyst-intern-at-unity-technologies-2386715095?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=qqEqoZBppIw5NjrG4DgUUg%3D%3D&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:22.153Z",
        "description": "The Monetization Business Intelligence team at Unity is central to enabling data-driven decision-making, identifying new revenue growth opportunities, and executing on strategic initiatives. We are looking for an analytical, communicative, and intellectually curious Business Intelligence Analyst Intern to join the Monetization team. Your day-to-day will involve dataset development, constructing dashboards, A/B analysis, and working cross-functionally across Product, Engineering and Data Science to drive forward new product initiatives.<br><br><strong><u>Responsibilities<br><br></u></strong><ul> <li>Own and maintain the reporting data pipeline for specific products and custom dashboards</li> <li>Perform continuous A/B Testing Analysis</li> <li>Support data initiatives for new products in the Demand Monetization</li> <li>Be the Business Intelligence source material expert on all aspects Demand related and be the bridge between Product, Data Sci, Engineering and Sales</li> <li>Aid in the product life-cycle development and strategy for emerging Demand side objectives</li> <li>Build dashboards to monitor product performance and ensure success on a technical and business level</li> <br><br></ul><strong><u>Requirements<br><br></u></strong><ul> <li>Current student pursuing a degree in Computer Science, Economics, Business, or equivalent and returning to the degree program after the completion of the internship  for at least one semester.</li> <li>A passion for data, analysis, and problem solving</li> <li>Excellent communication and interpersonal skills</li> <li>Self-starter who can operate independently and drive work to completion in a timely fashion</li> <li>Skilled with SQL (required) and Excel (required)</li> <li>Willingness to work with multiple time zones (SF / Monreal)</li> <br></ul><strong>Bonus Points<br><br></strong><ul> <li>Knowledge of existing BI development / dashboarding tools</li> <li>Familiarity with ETL practices and tools</li> <li>A love of gaming</li> <br><br></ul><strong><u>About Unity Technologies<br><br><br></u></strong>Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.<br><br>The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms. Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices. For more information, please visit www.unity.com.<br><br><em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.<br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br></em><em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>"
    },
    {
        "position": "Data Science Internships - Summer 2021, Remote",
        "company": "Universal Studios",
        "location": {
            "city": "Remote",
            "state": "OR"
        },
        "posted": "2021-01-30T07:56:22.689Z",
        "url": "https://www.linkedin.com/jobs/view/data-science-internships-summer-2021-remote-at-universal-studios-2394051955?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=bWT6lv33U6JCazKt8khN3A%3D%3D&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:22.689Z",
        "description": "<strong><u>Responsibilities<br><br></u></strong>Our Data Science program is designed to provide interns with real-world experience working on projects on a typical Data Science environment, using state of the art tools and technologies, while gaining broad exposure to the media industry. Interns will acquire specific responsibilities, goals, and timelines aligned with the teams they are embedded in. Join the world-class team of smart, hungry and fearless professionals who are working at the cutting edge of technology and science at the epicenter of content, technology and culture.<br><br>Daily responsibilities and projects may include (but are not limited to):<br><br>Assisting with research &amp; development to inform new methodologies<br><br>Implementing predictive and inferential statistical and/or machine learning models<br><br>Contributing to the development of tools and data pipelines<br><br>Building advanced recommender engines, active learning platforms, and personalized solutions for marketing and advertisement<br><br><strong> Application Deadline: Summer Internship postings are live for a limited time only, apply today!<br><br></strong><strong><u>Qualifications/Requirements<br><br></u></strong>Current Master's or PhD student at an Accredited Institution in Data Science, Computer Science, Operations Research, Statistics, Mathematics, Economics, or other relevant quantitative fields. Must be able to provide documentation to confirm your degree progress<br><br>Working knowledge of at least two of the following programming languages: R, Python, Julia, Java, Scala or similar<br><br>Prior experience with Machine Learning and/or statistical modeling<br><br>Advanced working knowledge of statistics and its applications for inferential data analysis<br><br>Familiarity with Spark, Hive and/or Hadoop<br><br>Familiarity with relational databases and SQL<br><br>Experience with data visualization techniques and concepts<br><br>Cumulative GPA of 3.0 or above<br><br>Must be 18 years of age or older<br><br>Must be authorized to work in the United States without visa sponsorship by NBCUniversal<br><br>Desired Characteristics<br><br>Strong interest in the media industry<br><br>Commitment to building an inclusive work environment<br><br>Strong interpersonal skills; must be able to work effectively as part of a project team and foster team cooperation<br><br>Excellent verbal and written communication<br><br>Previous internship experience and on-campus involvement"
    },
    {
        "position": "Undergrad Summer Internship - Software Engineering",
        "company": "Gap Inc.",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-03T07:56:23.184Z",
        "url": "https://www.linkedin.com/jobs/view/undergrad-summer-internship-software-engineering-at-gap-inc-2389237641?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=ZX6dmlZHBgHwRUGKjQLuvw%3D%3D&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:23.184Z",
        "description": "<strong><u>About Gap Inc.<br><br></u></strong>Our brands bridge the gaps we see in the world. Old Navy democratizes style to ensure everyone has access to quality fashion at every price point. Athleta unleashes the potential of every woman, regardless of body size, age or ethnicity. Banana Republic believes in sustainable luxury for all. And Gap inspires the world to bring individuality to modern, responsibly made essentials.    <br><br>This simple idea—that we all deserve to belong, and on our own terms—is core to who we are as a company and how we make decisions. Our team is made up of thousands of people across the globe who take risks, think big, and do good for our customers, communities, and the planet. Ready to  learn fast, create with audacity and lead boldly? Join our team.<br><br><strong><u>About The Role<br><br></u></strong>Gap Inc.Technology is looking for exceptional talent with fresh ideas, cutting-edge skills, and a passion for retail and technology. In your 10 weeks with Gap Inc, you’ll have a voice in the room, be pushed to take risks, and play a critical role in innovative projects that are transforming retail technology. Ready to get started?<br><br>What you'll do<br><ul> <li>Work directly with our Data Platform Software Engineering team</li> <li>Learn each facet of the Software Development LifeCycle using Agile Methodology/ Delivery and play an integral part on the team</li> <li>Participate in an Agile work environment, pair with Senior Developers and QA Engineers to produce and deliver code and/or test cases using Agile practices</li> <li>Join in bi-weekly showcases, daily standup meetings, and bi-weekly retrospectives</li> <li>Use TDD (test driven development) practices with other Engineers, and Product Managers</li> <li>Learn hands-on use of development tools<br></li></ul>Who you are<br><ul> <li>Computer Science, Computer Engineering or related undergraduate degree in progress - accepting students that graduate in December 2021 and Spring 2022</li> <li>Strong ability to identify and execute priorities with a sense of urgency</li> <li>Handle multiple tasks and manage time effectively to satisfactorily meet deadlines in a fast paced environment</li> <li>Strong communication and presentations skills- even to those without a technical background</li> <li>A desire to evolve excellent problem solving skills; meticulous &amp; methodical</li> <li>DATA PLATFORM Team requirments - D3, Python, SQL<br></li></ul>Benefits at Gap Inc.<br><ul> <li>Merchandise discount for our brands: 50% off regular-priced merchandise at Old Navy, Gap, Banana Republic and Athleta, and 30% off at Outlet for all employees.</li> <li>One of the most competitive Paid Time Off plans in the industry.*</li> <li>Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.*</li> <li>Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.*</li> <li>Employee stock purchase plan.*</li> <li>Medical, dental, vision and life insurance.*</li> <li>See more of the benefits we offer.</li> <br></ul><em><li>For eligible employees<br><br>Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. We have received numerous awards for our long-held commitment to equality and will continue to foster a diverse and inclusive environment of belonging. This year, we’ve been named as one of the Best Places to Work by the Humans Rights Campaign for the fourteenth consecutive year and have been included in the 2019 Bloomberg Gender-Equality Index for the second year in a row.</li></em>"
    },
    {
        "position": "Intern Masters Data Science",
        "company": "Honeywell",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2021-01-31T07:56:23.883Z",
        "url": "https://www.linkedin.com/jobs/view/intern-masters-data-science-at-honeywell-2395625476?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=E9sllfL%2FHWHW4uaMjrK4Ew%3D%3D&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:23.883Z",
        "description": "Join a team recognized for leadership, innovation and diversity<br><br>The future is what you make it. When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future.<br><br>That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all of our employees enjoy access to dynamic career opportunities across different fields and industries. Are you ready to help us make the future?<br><br>At Honeywell, we are blending physical products with software solutions to link people and businesses to the information they need to be more efficient, more productive, and more connected. We have a real passion for the place where<br><br><strong><u>Skills<br><br></u></strong>It is here where sensor data from connected devices meet our domain expertise and your Data Science skills to enable solutions like<br><br>physical meets digital. In this emerging Internet of Things era, the world is moving from simple digital transactions to complex digital-to-physical interfaces.<br><br><li> Technologies for connected buildings improving comfort and energy efficiency</li><li> The world's most advanced cockpits, jet engines, auxiliary power units,<br></li>turbochargers, along with their efficient maintenance<br><li> Refining and petrochemicals process technologies and controls</li><li> Voice-automated systems</li><li> Personal protective equipment for connected workers<br><br></li>Your time with Honeywell could be spent in any of the following ways:<br><li> Extracting, transforming, and loading data in preparation for analysis</li><li> Engineering features incorporating domain expertise and statistical aggregations</li><li> Developing and evaluating statistical inference models based on those features, solving a costumer’s problem.</li><li> Deploying analytic solutions to production platforms, ready to be used in one of Honeywell’s products or services.<br><br></li>Our teams live by the ‘teach and learn’ mantra. We value our more seasoned data scientists because they bring additional value to our company by using their years of experience to guide the next generation. We also value you, our young talent. We'll assign you a mentor on day one, so you can take advantage of this amazing learning opportunity. We want you to finish your internship with a much better understanding of the data science field and Honeywell. We know you'll be a better data scientist by the time this internship ends!<br><br><strong>Must Have<br><br></strong><li> Currently pursuing a Master’s degree in Engineering, Computer Science or related discipline at an accredited college or university.</li><li> Have completed at least your first year of a college or university and will graduate December 2021 or later.<br><br></li><strong>We value<br><br></strong><li> Minimum 85% course average (3.7 GPA)</li><li> Be familiar with one or more of the following programming languages: Python, R, MatLab, Java, or C++.</li><li> Some frameworks we use are: Jupyter, RStudio, Flask, OpenShift.</li><li> Some of the tools we use include Git, Docker, Bamboo, and more.</li><li> Some of the databases we use are: Hive, SQL, Dremio, and Druid to name a few</li><li> Insatiable appetite for learning new technologies.</li><li> Committed pursuit of innovative solutions.<br><br></li>Additional Information<br><ul><li><strong>JOB ID: </strong>req259570</li><li><strong>Category: </strong>Engineering</li><li><strong>Location: </strong>715 Peachtree Street, N.E.,Atlanta,Georgia,30308,United States</li><li>Nonexempt<br></li></ul>Engineering (GLOBAL)<br><br>Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."
    },
    {
        "position": "UHG R&D Grad Intern - Minnetonka, MN",
        "company": "UnitedHealth Group",
        "location": {
            "city": "Minnetonka",
            "state": "MN"
        },
        "posted": "2021-01-24T07:56:24.522Z",
        "url": "https://www.linkedin.com/jobs/view/uhg-r-d-grad-intern-minnetonka-mn-at-unitedhealth-group-2387840333?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=CtUpg%2B8th%2B27bbC%2FiMwQ9w%3D%3D&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:24.522Z",
        "description": "<strong>Internships at UnitedHealth Group.</strong> If you want an intern experience that will dramatically shape your career, consider a company that’s dramatically shaping our entire health care system. UnitedHealth Group internship opportunities will provide a hands-on view of a rapidly evolving, incredibly challenging marketplace of ideas, products and services. You’ll work side by side with some of the smartest people in the business on assignments that matter. So here we are. You have a lot to learn. We have a lot to do. It’s the perfect storm. And even better? Join us and you may end up staying for a career in which you can do<strong> your life’s best work.(sm)<br><br></strong>At UHG R&amp;D, we leverage personal health data (including medical claims, health record information, and sensor data) and machine learning algorithms to build new tools that are reshaping the delivery of healthcare. We are seeking a full-stack Data Science Intern for Summer 2021 to contribute to the development of our digital health data intelligence platform. The ideal candidate will collaborate closely with data scientists, problem domain experts, and platform software engineers to research, build, implement, and evaluate data science algorithms into production-level patient- and provider-facing software. In this role, the candidate will have the autonomy to develop and deliver these tools end-to-end through our technology stack.<br><br><strong><u>Primary Responsibilities<br></u></strong><ul> <li>Collaborate with a diverse group of domain scientists, business leaders, and customers to identify new implementations of machine learning algorithms for healthcare </li> <li>Develop software in Python, Airflow, Git, R, and Google Cloud tools </li> <li>Design, build, and test efficient, production-level code for addressing the biggest modern challenges in care delivery</li> <li>Conduct research to evaluate the performance of developed tools and iterate on their design</li> <br></ul>You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.<br><br><strong><u>Required Qualifications<br></u></strong><ul> <li>Currently enrolled in a PhD program in relevant quantitative discipline such as Mathematics, Statistics, Computer Science, Engineering, Biomedical Informatics, Physics, Operations Research, or related field. Must be actively enrolled in an accredited college / university during the duration of the internship</li> <li>Solid coding skills in Python and familiarity with other languages such as SQL or R</li> <li>Completed course or project work demonstrating knowledge of statistical machine learning techniques including but not limited to bandit algorithms, optimization, and/or experimental design</li> <li>You will be asked to perform this role in an office setting, however, may be required to work from home temporarily due to space limitations</li> <li>Employees are required to screen for symptoms using the ProtectWell mobile app, Interactive Voice Response (i.e., entering your symptoms via phone system) or a similar UnitedHealth Group-approved symptom screener prior to entering the work site each day, in order to keep our work sites safe. Employees must comply with any state and local masking orders. In addition, when in a UnitedHealth Group building, employees are expected to wear a mask in areas where physical distancing cannot be attained</li> <br><br></ul><strong><u>Preferred Qualifications<br></u></strong><ul> <li>Solid communication skills with both technical and non-technical collaborators</li> <li>Currently 18 months from anticipated degree completion </li> <li>Interest in practical implementation of data science algorithms in real-world digital health systems </li> <li>Willingness to challenge assumptions and use data to develop new hypotheses and drive decision-making </li> <li>Familiarity with or willingness to learn data processing and software tools such as Apache Airflow, Google Dataflow, Google Pub/Sub, and Apache Beam</li> <li>Curiosity, a passion for experimenting, and drive to ensure that algorithms improve the patient experience </li> <br><br></ul><strong>Careers at UnitedHealth Group.</strong> We have modest goals: Improve the lives of others. Change the landscape of health care forever. Leave the world a better place than we found it. Such aspirations tend to attract a certain type of person. Crazy talented. Compassionate. Driven. To these select few, we offer the global reach, resources and can-do culture of a Fortune 7 company. We provide an environment where you're empowered to be your best. We encourage you to take risks. And we offer a world of rewards and benefits for performance. We believe the most important is the opportunity to do <strong>your life's best work.(sm)<br><br></strong><em>Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. <br><br></em><em>UnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment. <br><br></em>Job Keywords: UHG R&amp;D Grad Intern, Minnetonka, MN, Minnesota"
    },
    {
        "position": "URBN: Summer 2021 IT Internships",
        "company": "URBN (Urban Outfitters, Anthropologie Group, Free People & Nuuly)",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2021-01-31T07:56:25.089Z",
        "url": "https://www.linkedin.com/jobs/view/urbn-summer-2021-it-internships-at-urbn-urban-outfitters-anthropologie-group-free-people-nuuly-2315764498?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=q%2Fh083Cxxcizw0LMLf5qyg%3D%3D&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:25.089Z",
        "description": "<u><strong>IT Internships<br><br></strong></u>Roles such as software engineering, information security, and Data Science.<br><br>At URBN, we pride ourselves on more than just our unique products and successful portfolio of brands. We source the best of the best talent to drive our business forward, and our Interns are a crucial part of that equation. Our Interns have the unique opportunity to gain valuable hands-on experience across a range of departments and brands with exposure to company leaders, engaging workshops/excursions and our creative &amp; entrepreneurial culture.<br><br>URBN is a portfolio of global consumer brands comprised of Urban Outfitters, Anthropologie, Free People, BHLDN, Terrain, Nuuly and URBN Food &amp; Beverage. We create unique retail experiences with an eye toward creativity and a singular focus on pleasing our customer.<br><br>The 2021 Program dates are to be determined. Our Summer Internships typically run from June to August.<br><br><u><strong>Software Engineering Expectations<br></strong></u><ul> <li>Ability to assist in coding and development in Java, JavaScript, HTML, CSS.</li> <li>Ability to assist in Mobile Development</li> <li>Assist in different types of testing for our quality assurance team</li> <li>Currently pursuing a degree in: Computer Science, Mathematics, or similar fields.</li> <li>Experience with statistical practices</li> <br></ul><u><strong>Information Security Expectations<br></strong></u><ul> <li>Performs information security functions around prevention, detection, response, recovery, and cyber crisis or incident response activities</li> <li>Identifies trends and extracts indicators from large data sources using network tools</li> <li>Completes ad hoc tasks and other responsibilities as deemed necessary</li> <li>Cuurently pursuing a degree in: Computer Science, Mathemativs, Business, or similar fields. </li> <li>Knowledge of Windows, Linux and Mac operations systems</li> <li>Basic understanding of cyber threat landscape and actors</li> <br></ul><u><strong>Data Science Expectations<br></strong></u><ul> <li>Support data science projects in data acquisition, cleaning, processing</li> <li>Reseach predictive algorithms uring large amounts of structured and unstructured data</li> <li>Perform deep dive analysis to understand and optimize the customer experience</li> <li>Apply statistics, modeling, and ML to improve the efficiency of systems and relevance of proactive communication</li> <li>Demonstrate a strong interest in Data Science as a future career</li> <li>Excellent knowledge of a language for statistical and scientific computing (Python or R)</li> <li>Proficiency in SQL and understanding of relational databases</li> <li>Prior exposure to machine learning techniques such as dimension reduction, regression, clustering, and classification to solve real-world problems</li> <br><br></ul><strong><u>Application Process<br><br></u></strong><li> Submit a completed application via our careers website. </li> <li> Complete HireVue: Candidates will receive an email with a link to complete a HireVue Video Interview. Candidates will have 2 days to complete this portion of the application once the email is received. </li> <li> If you are selected for an interview, you will be notified at a later date. <br></li><strong><li>Please note you are only allowed to apply to ONE Summer Internship posting so choose the role you are the MOST excited about! Our team will assess if you are better suited for another area and let you know.*<br><br>Please check out urbn.com/internships and @urbn_internships on Instagram to learn more about our program! Should you have any questions regarding the application process, please email homeofficeinternships@urbn.com.<br><br>Urban Outfitters, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.</li></strong>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Intuit",
        "location": {
            "city": "Plano",
            "state": "TX"
        },
        "posted": "2021-01-17T07:56:25.547Z",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-intuit-2389220387?refId=a0f36be5-19a1-4bb9-ac58-3ccc49cbd651&trackingId=PcKRM1m2iLNdfjWvtdvHkA%3D%3D&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "lastScraped": "2021-01-31T07:56:25.547Z",
        "description": "<strong><u>Overview<br><br></u></strong>**This position is intended for students in a degree-seeking program, to which they will return at the end of the summer internship in 2021. If you do not meet this minimum criteria, please revisit our careers site for other opportunities.**<br><br>At Intuit, we want to invest in the next generation of tech entrepreneurs by bringing them into our organization early and encouraging them to bring their talents back to Intuit after they graduate. Our internship program is focused on identifying these high-potential university students and equipping them with the tools they need to succeed in the tech industry.<br><br>Hear more about the experience previous summer interns had at Intuit:<br><br>https://www.youtube.com/watch?v=sRVteY6_VFs<br><br><strong><u>What You'll Bring<br><br></u></strong>Through our summer internship program, university students gain the confidence to make meaningful work contributions that enable business growth with our products, customers, and internal processes.<br><ul><li>Must be currently enrolled in a degree seeking program</li><li>BS or MS in Computer Science (or related degree)</li><li>Strong software engineering skills </li><li>Solid understanding of object oriented design and programming languages</li><li>Experience with at least one of the following: Java, C#, C++</li><li>Front-end web development skills preferred (D/HTML, JavaScript, XML, Flex, CSS)</li><li>Familiarity or the ability to learn current trends and best practices in front-end architecture, including performance, accessibility and usability<br><br></li></ul><strong><u>Selection Criteria<br></u></strong><ul><li>Coding Challenge </li><li>Technical Assessment</li><li>Values Fit</li><li>Research and summer work experience</li><li>Leadership positions in group activities<br><br></li></ul><strong><u>How You Will Lead<br><br></u></strong>During Intuit's summer internship program, interns will interact with our senior leaders, learn directly from our business partners, and leverage our unique business practices all while taking on rigorous assignments. Our interns have opportunities to work in one of the following areas:<br><ul><li>Software Engineer: Full Stack/Front-End/Back-End/Security/DevOps/Mobile</li></ul>"
    }
]