[
    {
        "position": "Cybersecurity Consultant Intern: 2021 (Security - Expert Labs)",
        "company": "IBM",
        "location": {
            "city": "Raleigh",
            "state": "NC",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=223929480",
        "posted": "2021-01-28T07:58:56.478Z",
        "lastScraped": "2021-01-31T07:58:56.478Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\"><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Introduction</span><span class=\"show-job-descr\"></span><br>As an IBM Security Consultant, you will lead to secure the world by translating security requirements into the design and deployment of IBM Security Solutions in an agile world.  The success of IBM and our customers is in your hands as you transform vital security needs into policies and drive innovation.  Your work will power IBM and its customers to securely operate in a hostile world.  You will have access to the latest education, tools and technology, and a limitless career path with the world's leading security experts.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Your Role and Responsibilities</span><span class=\"show-job-descr\"></span><br><span style=\"font-size:12.0pt\"><span style=\"line-height:107%\"><span calibri=\"\" style=\"font-family:\">The IBM Security Expert Labs team is seeking a Security Consultant summer intern with a passion for technology and security.  As a Security Consultant Intern, you will learn and apply technical and security skills, helping to design, build, test, and support security solutions to meet project requirements and goals.  Intern responsibilities might include: Infrastructure management, product deployment and configuration, automation development and evaluation, and component integration in support of security projects.  Ideal candidates will be self motivated, success driven, and looking to make a difference in the world.  They will posses skills in the Computer Science, Engineering, Computer Information Systems, and I.T. disciplines.</span></span></span><br><br><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"font-family:Calibri,sans-serif\"><b><span style=\"font-size:12.0pt\">Your Responsibilities may include</span></b><span style=\"font-size:12.0pt\">:</span></span></span></span><ul><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Develop Security Proof of Concepts (POCs)</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Test Proof of Concepts</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Write scripts for automation of deployments and testing</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Collaborate with the technical team, understand and execute deployment and integration tasks</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Document and create artifacts to add up to a knowledge base</span></span></span></span></span></li></ul><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Interns will have real responsibilities as a junior member of the team; innovating and deploying security solutions, and making a difference to IBM's business, while at the same time growing personally and professionally.</span><br><b><span style=\"font-size:12.0pt\">The ideal candidate should exhibit the following traits:</span></b></span></span></span><ul><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Problem-solving skills</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Ability to multitask</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Strong written and verbal communication skills</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Ability to work in a dynamic and team-oriented environment</span></span></span></span></span></li></ul><br><br><br><br> <br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Required Technical and Professional Expertise</span><span class=\"show-job-descr\"></span><br><ul><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Degree Program with a focus on Computer Science, Cybersecurity, or related IT field;</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Basic Knowledge - completed course work related to programming languages and methodologies (Ex.  Python, Java, JavaScript, NodeJS, RestAPIs, Source Control, and Containerization)</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Basic Knowledge - Operating Systems, Virtualization, Containerization, and networking</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Experience with Microsoft Office Suite</span></span></span></span></span></li></ul><br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Preferred Technical and Professional Expertise</span><span class=\"show-job-descr\"></span><br><div style=\"margin-bottom:11px\"> </div><ul><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">Work or internship experience related to security or IT solution integration</span></span></span></span></span></li><li style=\"margin-bottom:11px\"><span style=\"font-size:11pt\"><span style=\"line-height:normal\"><span style=\"tab-stops:list .5in\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:12.0pt\">RedHat Operating and Container solutions</span></span></span></span></span></li></ul><br> <br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">About Business Unit</span><span class=\"show-job-descr\"></span><br>IBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Your Life @ IBM</span><span class=\"show-job-descr\"></span><br>What matters to you when you’re looking for your next career challenge?<br><br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these?  If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br><br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">About IBM</span><span class=\"show-job-descr\"></span><br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Location Statement</span><span class=\"show-job-descr\"></span><br>IBM will not be providing visa sponsorship for this position now or in the future.&nbsp; Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.  <br><br>We consider qualified applicants with criminal histories, consistent with applicable law.<br><br>IBM intends this job to be performed entirely outside of Colorado.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Being You @ IBM</span><span class=\"show-job-descr\"></span><br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br><br><img src=\"https://www.applytracking.com/tp/rj6_Rvu2P_I-K\" alt=\"\"><font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;</span>"
    },
    {
        "position": "Computer Science Intern - Summer 2021",
        "company": "Leading Internet / Online Media Company",
        "location": {
            "city": "Folsom",
            "state": "CA",
            "zip": "95762"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=32f52900-eea8-40bd-ae64-8eba3b0c6b2f",
        "posted": "2021-01-29T07:58:57.199Z",
        "lastScraped": "2021-01-31T07:58:57.199Z",
        "description": "<p>Responsibilities</p><p>Job Description</p><p>WHATS IN IT FOR YOU</p><p>Our purpose is to lead the way to tomorrows energy network. Your work as an intern can impact millions of people who depend on electricity for their everyday lives.</p><p>You will get \"real world\" experience to begin or further your career pursuits in the energy industry. This is a paid intern position for 10 -12 weeks during summer 2021.<br>You get to work on interesting and challenging assignments that will help grow your skill set.<br>You will work in an extremely collaborative environment inside our LEED certified Folsom, California campus.<br>Opportunities to interact with the CEO and the Executive team of the ISO<br>Invitations to seminars on the latest energy industry topics such as renewables, electric cars and micro grids.<br>Potential field trips.<br>Social activities with other interns such as barbecues and movie nights.<br>You get to work on our \"green\" LEED certified Folsom, California campus with some of the brightest people in the industry.</p><p>WHAT YOU WILL BE DOING</p><p>Past Assignments have included work such as:</p><p>Building new software tools in support of the reliable operation of the Grid and the energy markets we facilitate. You will learn more about smart grid technology, renewable resources, forecasting and the latest developments in energy industry. You will see ow the work you do this summer contributes directly to the success of the California Grid<br>Data validation and user acceptance testing (UAT), schedule and monitor processes necessary for calculation and publication of energy market settlement statements and invoices.<br>Development of enterprise-wide systems integration mapping, with database that links to interface specification. Interface with IT Architects, UML Modelers, and QA Leads to understand how to best depict these system-to-system interfaces to meet specific use cases.<br>Provide technical content and sample code for the ISOs developer.caiso.com website.<br>Document archiving solutions for new technologies as well as development of automation solutions.<br>Oracle Database/Storage task queue maintenance, documentation, create automation scripts for Oracle database admin tasks/storage procurement and document, create automated reports of daily DBA/Storage procedures, create standard monitoring scripts, generate capacity reports.<br>Projects to develop work products that will reduce processing time, enhance transparency or enhance capabilities in departments across the organization.</p><p>Qualifications</p><p>Qualifications</p><p>LEVEL OF EDUCATION AND DISCIPLINE</p><p>Currently in a Bachelors degree (BS) or Masters degree (MS) program in Computer Science, MIS or related field.<br>Graduating December of 2021 or later.</p><p>AMOUNT OF EXPERIENCE</p><p>Previous internships, research or work experience using economic analysis is desired.<br>Research and or studies in energy industry highly desired.</p><p>TYPE OF EXPERIENCE</p><p>Proficient in Microsoft office suite.<br>Good presentation, oral and written communication skills highly desirable.<br>Must be able to work effectively in a team environment.<br>Excellent analytical and problems solving skills required.</p><p>ADDITIONAL SKILLS AND ABILITIES</p><p>Strong quantitative skills.<br>Competence in software such as R, Python, SQL, and Java desired but not required.</p><p>Additional Information</p><p>All your information will be kept confidential according to EEO guidelines.</p>"
    },
    {
        "position": "2021 Autonomous Vehicles Data Scientist Intern",
        "company": "Ford Motor Company",
        "location": {
            "city": "Dearborn",
            "state": "MI",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=223448940",
        "posted": "2021-01-12T07:58:58.099Z",
        "lastScraped": "2021-01-31T07:58:58.099Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\"><b>Job Description &amp; Qualifications</b><b><o></o></b><br>At Ford Motor Company, we believe freedom of movement drives human progress. We also believe in providing you with the freedom of upward mobility as you strive to realize your professional dreams. We've got incredible plans for our future - and your future, too!We're working on some pretty amazing things, including autonomous and electric vehicles, data centers, micro services, and cloud computing. Get ready to play an important role supporting our incredible advancements!<br><br><b>What you'll be able to do:</b><br>Looking for a great answer to the question - what did you do this summer? This is it! Through our Summer Internship, you'll gain the experience, knowledge and skills to take your career to another level. Throughout this 12-week program, you'll enjoy hands-on involvement in some of the ground-breaking initiatives we've got going on. In addition to developing technically and professionally, you'll be able to build a network of friends and contacts while discovering what it's like to live, work and play in Detroit, Michigan. <o><br><o><br>The AV team is a large and growing team committed to enabling Ford's leadership in leveraging the most advanced analytics solutions in the industry. We enable evidence-based decision making by providing timely and actionable insights to our internal business partners. We are part of cross-functional team developing software solutions with analytics at its core. Together our team works to understand our changing world, identify new opportunities, and take action to design and innovate for the future of mobility and the socio-technological symbiosis of our customers with Ford vehicles to the benefit of society.<br><br><b>Responsibilities:</b><o><br><ul><li>Strategic Thinking: Able to influence the strategic direction of the company by identifying opportunities in large, rich data sets and creating and implementing data driven strategies that fuel growth including cost savings, revenue and profit<o></o></li><li>Data Analysis: Develop data flows and work with structure/unstructured data. Manipulate high-volume, high-dimensionality data from varying sources to expose and highlight patterns, anomalies, relationships and trends<o></o></li><li>Modeling: Experience with creating ETL processes to source and link data, design and select features, develop and implement statistical / predictive models using edge algorithms on diverse sources of data and testing and validation of models.<o></o></li><li>Analytics: Utilize analytical applications like Python, R and Alteryx,to identify trends and relationships between different pieces of data, draw appropriate conclusions and translate analytical findings into business strategies.<o></o></li><li>Visualization: Create visualizations to connect disparate data, find patterns and tell engaging stories. This includes both scientific and geospatial visualizations using applications such as QuickSight, Tableau, Qlik and ArcGIS.<o></o></li><li>Solution Development and Deployment: Be able to deploy statistical/machine learning models into a platform or application. Work as part of a Product Team to deliver analytically driven software<o></o></li><li>Communications: Capable of turning dry analysis into an exciting story that influences the direction of the business and communicating with diverse teams to take a project from start to finish. Collaborate with product teams to develop and support our internal data platform and to support ongoing analyses.<o></o></li></ul><o><br><b>Minimum Requirements</b><br><o><br><ul><li>Juniors pursuing a Bachelor's with a concentration in a quantitative field such as Math, Statistics, Economics, Computer Science, Operations Research, Engineering or Physics<o></o></li><li>A GPA of at least 3.0 on a 4.0 Scale (or equivalent) <o></o></li><li>Ability to complete a 3+ month assignment<o></o></li><li>Experienced in R, Python, SQL or MATLAB<o></o></li><li>Familiarity with data blending and visualization, predictive modeling or machine learning algorithms <o></o></li></ul><br><b>Preferred Requirements</b><br><o><br><ul><li>PhD or Master's candidates with a concentration in a quantitative field such as Math, Statistics, Economics, Computer Science, Operations Research, Engineering or Physics and a GPA of at least 3.0 on a 4.0 Scale (or equivalent)<o></o></li><li>Demonstrated skills in large scale data manipulation, machine learning and mining / pattern recognition<o></o></li><li>Critical thinking skills that demonstrate the ability to use existing and discoverable data to solve business problems<o></o></li><li>Strong oral and written communication skills<o></o></li><li>Experienced with topics such as maximum likelihood estimation, linear and non-linear modeling, causal inference, density estimation, optimization, scheduling, time series forecasting, stochastic processes, survival analysis, data blending and data visualization, multivariate techniques such as PCA, factor analysis and cluster analysis.<o></o></li><li>Ability to translate complex quantitative methods into easily understood results for all levels of business customers<o></o></li><li>Experience with tools such as AWS RDS, Alteryx, QuickSight, Tableau, Apache, Spark, Caffe, Sagemaker or other deep-learning libraries<o></o></li></ul><o><br><b>What you'll receive in return:</b><br>As part of this exciting program, you'll enjoy a high level of involvement with an exceptional team of industry innovators and visionaries. You'll contribute in a meaningful way to our important, breakthrough work. And you'll develop the skills that will give you a significant edge in your future career pursuits. If you have what it takes to help us redefine the future of mobility, we'd love to have you join us.<br><br>Candidates for positions with Ford Motor Company must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.<br><br>By choice, we are an Equal Opportunity Employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<o><br></o></o></o></o></o></o></o></o></span>"
    },
    {
        "position": "Software Development Intern",
        "company": "Kratos Defense & Security Solutions",
        "location": {
            "city": "Lanham",
            "state": "MD",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=65275976-960d-41bd-87e7-640b671e5420",
        "posted": "2021-01-30T07:58:58.942Z",
        "lastScraped": "2021-01-31T07:58:58.942Z",
        "description": "<div><div><h2>Job Description</h2><p>Kratos is seeking a Software Development Intern to join an exciting team of software engineers within the Federal Software Engineering team. The successful candidate will make valuable contributions to dynamic and agile projects; implementing a SecDevOps approach across all phases of the software development lifecycle, to include, design, development, test, and operational support / user feedback.</p><p>Qualities we are passionate about in a candidate:</p><ul><li>Loves to automate using scripts;</li><li>Desires to be a valuable contributor within a team environment;</li><li>Embraces change and is an independent motivator toward one’s improvement;</li><li>Must be self-motivated, be a self-learner, and able to work within a dynamic schedule;</li><li>Must be able to work independently as well as within a team setting on the design, implementation, and maintenance/troubleshooting of new and existing software solutions; primarily within the satellite command and control (c2) domain space; and&nbsp;</li><li>Must be able to organize &amp; report status of tasks being worked and effectively communicate with various team members.</li></ul></div></div><div><div><h2>Experience and Skills</h2><ul><li>Must be enrolled in a college / university majoring in a technical field, such as Computer Science, Computer Engineering, Electrical Engineering, or related<strong>.</strong></li><li>Shows interest in technology and software development</li><li>Has personal drive toward technology</li><li>Relevant projects at work or at home</li><li>Aspires to learn and apply new technologies and use them to solve real problems</li></ul></div></div>"
    },
    {
        "position": "ummer 2021 - Customer Technology; Energy Cloud Intern",
        "company": "PSEG",
        "location": {
            "city": "Newark",
            "state": "NJ",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=223900251",
        "posted": "2021-01-28T07:58:59.735Z",
        "lastScraped": "2021-01-31T07:58:59.735Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\">Requisition ID:&nbsp; 65329&nbsp; <br><br>Job Function/Category:&nbsp; University Recruiting&nbsp; <br><br>Employment Type:&nbsp; Non-Exempt Part Time&nbsp; <br><br><strong> This is an exciting time to be joining PSEG. Our commitments, which include safety, integrity, customer focus, and diversity &amp; inclusion, are the fabric of our culture and help drive the success of our business. We are fortunate to have an outstanding workforce of diverse and highly skilled talent who move us forward in our operational excellence journey.&nbsp; PSEG has more than 12,000 employees who are dedicated to the communities we serve and embody our vision: People providing Safe, Reliable, Economic and Greener Energy. </strong> PSEG is seeking a Customer Technology Intern. The Customer Technology team implements system enhancements to customer-facing technologies such as web self-service, mobile web, My Alerts, Storm Center mobile app, and CRM. Work will vary based on the status of projects that are in motion during that time. Possible assignments include assisting team members with testing system enhancements or changes, researching and benchmarking other companies' use of similar technologies, writing user stories, and conducting web usability studies. Interns may be asked to run reports and communicate the results. <br><br>Candidates need to be able to meet deadlines, work collaboratively across the business, juggle competing priorities, operate independently while knowing when to ask for help or guidance, and view all work from a customer's perspective. Candidates should have an interest in, and comfort with, website design, e-commerce, and mobile technology. Being technically savvy is an advantage. Strong communication skills are critical, particularly written communication, and candidates with direct customer service experience are desired. Candidates should have proficiency in Microsoft Office products such as Excel, Word, and PowerPoint. <br><br>Required Education/Skills: The successful candidate (s) must be actively pursuing a Bachelor's Degree from an accredited institution in Business, Communications, CIS or related major and an anticipated graduation date between December 2021 and May 2022. PSEG recognizes institutions of higher education, which are accredited by the Council for Higher Education Accreditation or equivalent. <br><br>All PSEG internship roles are paid at an hourly rate, however there are no benefits associated with these positions We are targeting: Currently enrolled students staying in the NJ/NY/PA metro area for the duration of the internship and able to commute to the assigned work location. Housing, transportation, immigration support will not be provided in association with these positions. As an employee of PSE&amp;G or PSEG Long Island, you should be aware that during storm restoration efforts, you may be required to perform functions outside of your routine duties and on a schedule that may be different from normal operations. <br><br>This site (  <a href=\"http://www.pseg.com\" target=\"_blank\">http://www.pseg.com</a>  ) is strictly for candidates who are not currently PSEG employees. PSEG employees must apply for jobs internally through empower which can be accessed through the mypseg homepage by clicking on the employee center tab, then under the empower header, choose careers. <br><br>Business needs may cause PSEG to cancel or delay filling position at any time during the selection process. <br><br>Certain positions at the Company may require you to have access to Part 810-Controlled Information.&nbsp; Under the law, the Company is limited in who it can share this information with and in certain circumstances it is necessary to obtain specific authorization before the Company can share this information.&nbsp; Accordingly, if the position does require access to this information, you must complete a 10 CFR Part 810 Export Control Compliance Nationality Request Form, a copy of which will be provided to you by Talent Acquisition if an offer is made.&nbsp; If there is a need for specific authorization, due to the time it takes to obtain authorization from the government, we will likely not be able to further proceed with an offer. <br><br>Public Service Enterprise Group (PSEG) is an equal opportunity employer, dedicated to a policy of non-discrimination in employment, including the hiring process, based on any legal protected characteristic. Legally protected characteristics included, race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, or veteran status or any other characteristic protected by federal, state, or local law in locations where PSEG employs individuals. <br><br>Need to request an accommodation? <br><br>If you have a disability and need assistance submitting your resume, applying for a position or registering for a test, please call 973-430-3845. Any information provided regarding a disability will be kept strictly confidential and will not be shared with anyone involved in making a hiring decision. <br><br><strong>Nearest Major Market: </strong>Newark <br><strong>Nearest Secondary Market: </strong>New York City <br><strong>Job Segment: </strong> Cloud, Intern, Compliance, CRM, Energy, Technology, Entry Level, Legal</span>"
    },
    {
        "position": "Software Developer Internship - Paid",
        "company": "ULINE",
        "location": {
            "city": "Pleasant Prairie",
            "state": "WI",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=8&jobid=895127c8-7d79-44fc-94f0-bec923131b95",
        "posted": "2021-01-26T07:59:00.539Z",
        "lastScraped": "2021-01-31T07:59:00.539Z",
        "description": "<div><div style=\"text-align%3A+center%3B\"><div style=\"text-align%3A+left%3B\"><div style=\"text-align%3A+center%3B\"><strong>Software Developer Internship</strong><br><strong>Paid Internship - Summer 2021</strong><br><strong>Corporate Headquarters</strong><br><strong>12575 Uline Drive, Pleasant Prairie, WI 53158</strong></div><br>Uline's 200+ person IT Department is working on some of the largest and most challenging custom development projects in the Chicago and Milwaukee areas. Uncover your full potential in a collaborative environment where you'll design, develop and deliver custom solutions to big challenges as we tackle an impressive modernization initiative to replace our legacy systems.<br><br><strong>Better together than apart.</strong> This position is on-site, and we are looking for good people who share our passion.<br><br>Uline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment drug screen.<br><br><strong>Position Responsibilities</strong><ul><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Participate in Full Stack application design and development using agile framework.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Collaborate using GIT to track source code changes.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Troubleshoot and resolve software related issues.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Maintain code quality through unit testing.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Document code appropriately for maintainability.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Work with business analysts to gather requirements.</li></ul><br><strong>Minimum Requirements</strong><ul><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">This internship is open to Sophomores and Juniors majoring in Information Technology / Computer Science or related field.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Technologies include Java, Angular, C#, .NET, JPA, Hibernate, REST and SQL.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Two semesters of programming <strong>a must.</strong></li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Solid communication skills and willingness to work in a team environment <strong>a must.</strong></li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Detail-oriented, hardworking and enthusiastic.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Able to work independently when requested.</li></ul><br><strong>Benefits of a Uline Internship</strong><ul><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Gain professional work experience in an area related to your degree.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Work in a positive, well-balanced environment.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Learn about the industry from all levels of Uline management.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Potential opportunity, upon graduation, for full-time employment with a successful, fast-growing company!</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Housing available for those who live more than 50 miles away.</li></ul><br><strong>Intern Perks</strong><ul><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">On-site café with meals and dinner-to-go options prepared by executive chefs.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">First-class fitness center with sauna and complimentary personal trainers.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Over four miles of beautifully maintained walking trails.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Outings throughout the summer with interns across all departments.</li><li style=\"color%3A%23121212%3Bline-height%3Anormal%3Bbackground%3Awhite%3B\">Intern specific Lunch and Learns.</li></ul><br><strong>About Uline</strong><br><br>Uline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800+ page catalog of over 37,500 quality products and same-day shipping of our huge in-stock inventory. With over 7,000 employees across 12 locations, it's time you joined Uline.<br><br>Uline provides the essential supplies needed to keep organizations operational and productive. To protect the health and safety of our employees, we have modified our normal operating policies in response to COVID-19.<br><br>Each resume submitted gets individually reviewed by our team and retained for 24 months in case a great opportunity opens for you to join our Uline family.<br><br>Apply online today to join us in 2021!<br><br>EEO/AA Employer/Vet/Disabled</div></div><br>#LI-POST<br>#CORP</div>"
    }
]