[
    {
        "position": "Computer Science Intern",
        "company": "Leading Internet / Online Media Company",
        "location": {
            "city": "McLean",
            "state": "VA",
            "zip": "22108"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=c80a91af-36a0-42d1-b698-29be252c1ed5",
        "posted": "2020-12-18T09:04:11.629Z",
        "lastScraped": "2020-12-19T09:04:11.629Z",
        "description": "<p>Responsibilities</p><p>Want to create technology that matters while building your future and your professional network? If you’re getting your degree in Computer Science or a related technology area and looking to get hands-on, skill-building experience with a leader in the financial technology industry, Freddie Mac’s Computer Science Summer Internship program is for you!</p><p>Through this internship, you’ll build on the knowledge and skills you’ve acquired in your undergraduate education – while getting real-world technology and innovation experience and making lifelong connections. Upon successful completion of the internship and your undergrad degree, you may be extended an opportunity to join our Technology Analyst Program – a 12-month cohort experience that springboards you into a full time technology career with the industry leader in the housing/finance industry.</p><p>Our Impact:</p><p>The Information Technology (IT) Division helps enable and transform Freddie Macs business and the mortgage industry! We provide systems and technology that benefit the enterprise, customers, employees and our business partners. Our technology enhances the services we offer to our customers and improves efficiency and performance for employees, making work easier.</p><p>Your Impact:</p><p>You’ll be part of a team crafting and coding the future technologies and applications that support Freddie Mac’s mission of making home possible.</p><p>What you’ll be doing:</p><p>As an intern, you will support exciting, short-term projects through the following activities:</p><p>Software Development</p><p>Participate on project teams to develop innovative, high-quality software solutions in an Agile development environment<br>Help define business and user needs and processes; determine solutions, work with project team/sponsors in identifying solutions<br>Participate in requirements analysis; help design applications based on system requirements<br>Help build improvements within existing applications<br>Support implementation of software application changes</p><p>Professional Development</p><p>Expand your leadership, business and analytical skills<br>Develop your personal brand, expand your resume and grow your professional network<br>Get support and mentorship from dedicated managers and experienced analysts<br>Deepen your technological knowledge while learning about Freddie Mac’s key role in the mortgage market<br>Participate in community service and other team events to complement your professional development with personal growth</p><p>AWS Cloud Development/Learning</p><p>Several interns in the program will be offered the opportunity to take coursework toward their AWS Cloud Practitioner certification. Upon completion of that coursework, Freddie Mac will sponsor those interns in taking their AWS Cloud Practitioner Certification test.</p><p>Qualifications</p><p>Skills and Experience Required:</p><p>Seeking undergraduate degree in Computer Science, Computer Engineering or related area<br>Cumulative GPA of 3.0 or greater<br>Rising seniors preferred; rising juniors considered<br>College-level experience with coding practices and languages (such as Java, C/C++, Python, Angular/Springboot or others)<br>Knowledge of Agile software development project methodologies preferred<br>Experience with popular business tools (Windows, Office Professional, Visio, SharePoint, etc.)<br>Demonstrated analytical ability and problem-solving skills<br>Excellent verbal and written communication<br>Organized with ability to meet deadlines and contribute to team success</p><p>Desired skills</p><p>Keys to Success in this Role</p><p>Ability to work effectively and efficiently in a team or independently<br>Technology-first mentality, outstanding analytical skills and commit to innovation<br>Willingness to try new things, fail fast and learn fast</p>"
    },
    {
        "position": "Chemical Engineer - Intern",
        "company": "TS Tech",
        "location": {
            "city": "Lincoln",
            "state": "NE",
            "zip": "68524"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=222530907",
        "posted": "2020-12-04T09:04:12.403Z",
        "lastScraped": "2020-12-19T09:04:12.403Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\"><p><strong>Summary</strong>: Develop, evaluate, maintain, and improve chemical formulation and processes for the manufacturing of recreational vehicles seats in the engineering, foam, injection molding, and other departments.</p><p><strong>Essential Duties and Responsibilities:</strong> include the following. Other duties may be assigned.</p><ul><li><strong>Essential Job Functions</strong><strong>:</strong><ul><li>Control process parameters including conveyor speed, process temperatures and pressures, pour patterns, spray patterns, cure time, and mold &amp; oven temperatures</li><li>Troubleshoot problems with chemical manufacturing processes in foam, injection molding, and foam in place departments</li><li>Conduct research to develop new and improved chemical manufacturing processes.</li><li>Perform tests and monitor performance of processes throughout stages of production to determine degree of control over variables such as temperature, density, and pressure.</li><li>Design measurement and control systems for chemical processes based on data collected in laboratory experiments and controlled tests.</li><li>Evaluate chemical equipment and processes to identify ways to optimize performance and to ensure compliance with safety or environmental regulations</li><li>Assist process engineer with plan and design layout of equipment</li><li>Prepare estimates of production costs and production progress reports for management</li><li>Complete PFMEA, FMEA, DFM, PQCT, and SPC for current processes and new model trials</li><li>Set chemical programs for chemical production process for new models</li><li>Participate and lead a Kiazen, TC Circles or 3 P activity</li><li>Required to comply with all environmental and safety programs associated with job including but not limited to wearing proper PPE, hazardous communication, lockout/tagout, electrical safety etc.</li><li>Trial, test, and report assigned DOE for experimental, new, and alternative chemical processes.</li><li>&nbsp;</li></ul></li><li><strong>Education and experience</strong><ul><li>Pursuing degree in Chemical, Plastics, Material, or Polymer Engineering or similar with 0 to 2 years of industrial experience.</li><li>Knowledge of or experience with flexible polyurethane foam technology</li><li>Knowledge of or experience with plastics and adhesives technology</li><li>Knowledge of and or experience programming and operating computer controlled machinery.</li><li>Knowledge of and or experience with Robotics</li><li>Knowledge of using design software such as AutoCAD, CATIA, or other engineering software.</li><li>Knowledge of raw materials, production processes, quality control, costs, and other techniques in automotive seat manufacturing industry</li><li>Knowledge of design techniques, blueprints, drawings and models</li></ul></li><li><strong>Communication Skills:</strong><ul><li>Must be able to make oral and written presentations to all levels of the organization</li></ul></li><li><strong>Analytical Skills</strong><ul><li>Must be able to use scientific rules and other documented methods to solve problems</li><li>Must be able to identify complex problems and review information to develop and evaluate options and implement solutions</li></ul></li><li><strong>Computer Skills</strong></li><li>Proficient use of Microsoft Office</li><li><strong>Work environment</strong><ul><li>Must be able to work with minimum supervision to meet deadlines</li></ul></li></ul></span>"
    },
    {
        "position": "Intern - Software Engineering",
        "company": "Aerojet Rocketdyne",
        "location": {
            "city": "Huntsville",
            "state": "AL",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=ee71dd87-f36e-45e9-94ad-f6b885973998",
        "posted": "2020-12-14T09:04:13.156Z",
        "lastScraped": "2020-12-19T09:04:13.156Z",
        "description": "<h4>Overview</h4><p>At <strong>Aerojet Rocketdyne</strong>, our people further the exploration of space and help keep America safe! We are seeking a<strong> Software Development Engineering Intern </strong>to join our team in<strong> Huntsville, AL </strong>for the Summer of 2021.The intern will contribute to the development of embedded real-time control system software and/or application software by performing software requirements analysis, design, implementation, unit test and integration tasks under the guidance and direction of a software development team lead. The ideal candidate would have had exposure to embedded and real-time software concepts and the C/C++ programing language. This position will report to the Manager, Software Engineering, Huntsville.</p><h4>Essential Job Functions (Including % of Time for Each)</h4><p>90% - As a contributor to a software development team, perform requirements analysis, design, implementation, unit test and integration of embedded real-time control system software and/or application software. Participate in the development of software development documentation. Support internal and customer reviews of software development work products.</p><p>10% - Support software development process improvement by assessing software process metrics, identifying process gaps, creating and evaluating process improvement options, reviewing and improving metric definition and collection methods, evaluating industry tools and other resources to promote the continued growth and maturity of the software organization at Aerojet Rocketdyne.</p><h4>Requirements</h4><p>Current enrollment in a Bachelor’s or Master's degree program in Computer Science (CS) or Computer Engineering (preferred), and have completed Sophomore year of study. Will also consider Math with CS emphasis.</p><p>Requires U.S. Citizenship, U.S. Permanent Residency or other status as a U.S. Person. Must be able to satisfy federal government requirements for access to government information and having dual citizenship may preclude you from being able to meet this requirement.</p><p>Additional Requirements:</p><ul> <li>Solid academic track record.</li> <li>Demonstrated team work experience.</li> <li>Solid verbal and written communication skills.</li></ul><p>Preferred Qualifications:</p><ul> <li>Experience in software development, especially developing C/C++ code.</li> <li>Exposure to and/or understanding of CMMI Level 3 and greater software processes.</li></ul><p><strong>Work Environment and Physical Requirements:</strong></p><p>Employees in these positions must possess mobility to work in a standard office setting and to use standard office equipment, including a computer; stamina to sit and to maintain attention to detail despite interruptions; may occasionally lift/carry/push/pull up to 15 pounds; may require minimal walking, climbing, stooping, crouching, and/or bending; and vision to read printed materials and a computer screen, and hearing and speech to communicate in person and over the telephone. May require the ability to travel by air or auto. May require the use of personal protective equipment such as safety glasses, safety shoes, and shop coat. These positions may be expected to work varying shifts and hours to ensure successful operation of activities in the organization.</p>"
    },
    {
        "position": "Software Engineering Intern (KFED)",
        "company": "Kratos Defense & Security Solutions",
        "location": {
            "city": "Colorado Springs",
            "state": "CO",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=6f55f6da-d723-4797-8ce5-c205f312a200",
        "posted": "2020-12-14T09:04:13.947Z",
        "lastScraped": "2020-12-19T09:04:13.947Z",
        "description": "<div><div><h2>Job Description</h2><div><table><tbody><tr><td><p>Kratos is looking for Computer Science students who would like to work on challenging technical problems for our Internship program as part of our Federal Solutions Software Engineering team in Colorado Springs, Colorado.</p><p>Kratos is a trusted global satellite ground systems, communications monitoring, RF interference detection and network management company. Kratos is in the process of evolving and growing our SATCOM enterprise service management product offerings to better serve our government customer base.</p><p>Interns will have the opportunity to work with experienced Software Engineers.&nbsp; Kratos Interns work on customer projects, creating solutions that will be used in real world applications.</p><p>You will also have the opportunity to perform software design, code development in C++, Java, and/or Python, as well as a variety of other challenging tasks. In addition, interns will be given the chance to demonstrate written and verbal communication skills.</p></td></tr></tbody></table></div></div></div><div><div><h2>Experience and Skills</h2><div><table><tbody><tr><td><p><strong>Required Experience:</strong></p><p>- Currently enrolled in a Computer Science program with a minimum 2 years of completed coursework toward a Bachelor or Master of Computer Science degree with a strong GPA.</p><p>- As part of coursework in college program, must have experience in Java or C++.</p><p>- U.S. Citizenship and the ability to obtain and maintain a U.S. Government Security Clearance is required.</p><p>Kratos offers challenging work, an excellent environment, &amp; great benefits! Kratos is an affirmative action / equal opportunity employer that recognizes the importance of diversity. We are committed to maintaining an inclusive environment and strongly encourage minorities, females, veterans and individuals with disabilities to apply.&nbsp; All qualified applicants will receive consideration for employment. Please, no phone calls, agencies or recruiters.</p></td></tr></tbody></table></div></div></div>"
    },
    {
        "position": "Application Engineer Intern",
        "company": "Cobham",
        "location": {
            "city": "Lansdale",
            "state": "PA",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=222709878",
        "posted": "2020-12-11T09:04:14.545Z",
        "lastScraped": "2020-12-19T09:04:14.545Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\"><b> Overview </b> <br><br>We are Cobham Advanced Electronic Solutions (CAES), a technologically advanced electronics company employing more than 3,600 talented makers, thinkers, innovators, and doers nationwide. We build things that solve challenging problems from deep space to the depths of the ocean. We serve customers in defense, aerospace, security, medical, and industrial markets. <br> <br> Are you searching for a career with a company that offers challenging, diverse projects and opportunities? Are you looking for a position with a company that is growing and able to offer long-term professional advancement? Searching for a company that values a friendly work environment and that values YOU? Consider CAES. #peoplefocusedmissiondriven #everymissionmatters <br> <br> A career with CAES is more than just a job, it is the pathway to a bright future. <br> <br><strong> Summary: </strong> <br> Cobham is seeking a highly motivated Application Engineering Intern that will be responsible for supporting Operations in a fast-paced work environment and providing engineering guidance on manufacturing solutions that will help meet our customer needs. <br> <br> Typical responsibilities include creating and maintaining process documentation, inspecting and assessing defective parts, designing production fixtures and tools, optimizing manufacturing flow to meet program deliverables, and supporting the production function on technical issues that arise. This position is located in Lansdale, PA. <br><br><b> Responsibilities </b> <br><br>•Establishes and maintains production routings and detailed assembly work instructions.<br>•Supports production by resolving technical issues with engineering.<br>•Support new product introductions thru engineering design reviews and production implementation.<br>•Assists in the monitoring of daily production activities and recommends/implements product and/or process improvements to enhance the efficiency of operations.<br>•Evaluates capacity requirements for assembly tooling, fixtures, and equipment to support manufacturing operations.<br>•Assists/Leads in equipment and production floor layout activities to promote an efficient flow of product and minimize production lead times through various assembly operations.<br>•Assists in capital equipment requirements forecasting, develops ROI analysis reports, prepares capital equipment requests, and documents/maintains equipment operating procedures.<br>•Practices continuous improvement methodologies including lean manufacturing, root cause problem solving, value stream mapping, etc. to improve production efficiencies and key performance metrics. <br><br><b> Qualifications </b> <br><br><strong>Minimum:</strong><br>•Working towards a Bachelor's Degree in Engineering (Mechanical, Industrial, Aerospace or Electrical Engineering)<br>•One+ years' experience in a manufacturing environment<br>•3+ Experience with MS Suite (Word, Excel, and Power Point), SolidWorks, and AutoCAD <br><br><strong>Preferred:</strong><br>•Excellent oral and written communication skills<br>•Focused on operations and manufacturing engineering<br>•Aerospace or Defense Experience <br>•Electro-Mechanical product experience<br>•Knowledge of Lean manufacturing techniques and principles <br><br><strong> Employment Transparency: </strong> <br> <br> Cobham is an Equal Opportunity/Affirmative Action Employer and embraces diversity in our employee population. It is the policy of Cobham to provide equal opportunity to all qualified applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or genetic information. Cobham will refrain from discharging, or otherwise discriminating against, employees or applicants who inquire about, discuss, or disclose their compensation or the compensation of other employees or applicants. <br> <br> The EEO is the Law poster is available here and the poster supplement is available here . <br> <br> The Pay Transparency Policy is available here . <br> <br> Cobham Advanced Electronic Solutions is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation due to a disability for any part of the employment process, please send an e-mail to <a><span data-mux=\"tooltip\" data-placement=\"top\" title=\"\" class=\"mux-tooltip\" mux1608368628296=\"620\" data-original-title=\"Apply to this job to send your resume to this employer\">CAEScareers@cobhamaes.com</span></a>   and let us know the nature of your request and your contact information.</span>"
    },
    {
        "position": "Summer 2021 - Customer Technology; Energy Cloud Intern",
        "company": "PSEG",
        "location": {
            "city": "Newark",
            "state": "NJ",
            "zip": "N/A"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=222350957",
        "posted": "2020-12-10T09:04:15.141Z",
        "lastScraped": "2020-12-19T09:04:15.141Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\">Requisition ID:&nbsp; 65329&nbsp; <br><br>Job Function/Category:&nbsp; University Recruiting&nbsp; <br><br>Employment Type:&nbsp; Non-Exempt Part Time&nbsp; <br><br><strong> This is an exciting time to be joining PSEG. Our commitments, which include safety, integrity, customer focus, and diversity &amp; inclusion, are the fabric of our culture and help drive the success of our business. We are fortunate to have an outstanding workforce of diverse and highly skilled talent who move us forward in our operational excellence journey.&nbsp; PSEG has more than 12,000 employees who are dedicated to the communities we serve and embody our vision: People providing Safe, Reliable, Economic and Greener Energy. </strong> PSEG is seeking a Customer Technology Intern. The Customer Technology team implements system enhancements to customer-facing technologies such as web self-service, mobile web, My Alerts, Storm Center mobile app, and CRM. Work will vary based on the status of projects that are in motion during that time. Possible assignments include assisting team members with testing system enhancements or changes, researching and benchmarking other companies' use of similar technologies, writing user stories, and conducting web usability studies. Interns may be asked to run reports and communicate the results. <br><br>Candidates need to be able to meet deadlines, work collaboratively across the business, juggle competing priorities, operate independently while knowing when to ask for help or guidance, and view all work from a customer's perspective. Candidates should have an interest in, and comfort with, website design, e-commerce, and mobile technology. Being technically savvy is an advantage. Strong communication skills are critical, particularly written communication, and candidates with direct customer service experience are desired. Candidates should have proficiency in Microsoft Office products such as Excel, Word, and PowerPoint. <br><br>Required Education/Skills: The successful candidate (s) must be actively pursuing a Bachelor's Degree from an accredited institution in Business, Communications, CIS or related major and an anticipated graduation date between December 2021 and May 2022. PSEG recognizes institutions of higher education, which are accredited by the Council for Higher Education Accreditation or equivalent. <br><br>All PSEG internship roles are paid at an hourly rate, however there are no benefits associated with these positions We are targeting: Currently enrolled students staying in the NJ/NY/PA metro area for the duration of the internship and able to commute to the assigned work location. Housing, transportation, immigration support will not be provided in association with these positions. As an employee of PSE&amp;G or PSEG Long Island, you should be aware that during storm restoration efforts, you may be required to perform functions outside of your routine duties and on a schedule that may be different from normal operations. <br><br>This site (  <a href=\"http://www.pseg.com\" target=\"_blank\">http://www.pseg.com</a>  ) is strictly for candidates who are not currently PSEG employees. PSEG employees must apply for jobs internally through empower which can be accessed through the mypseg homepage by clicking on the employee center tab, then under the empower header, choose careers. <br><br>Business needs may cause PSEG to cancel or delay filling position at any time during the selection process. <br><br>Certain positions at the Company may require you to have access to Part 810-Controlled Information.&nbsp; Under the law, the Company is limited in who it can share this information with and in certain circumstances it is necessary to obtain specific authorization before the Company can share this information.&nbsp; Accordingly, if the position does require access to this information, you must complete a 10 CFR Part 810 Export Control Compliance Nationality Request Form, a copy of which will be provided to you by Talent Acquisition if an offer is made.&nbsp; If there is a need for specific authorization, due to the time it takes to obtain authorization from the government, we will likely not be able to further proceed with an offer. <br><br>Public Service Enterprise Group (PSEG) is an equal opportunity employer, dedicated to a policy of non-discrimination in employment, including the hiring process, based on any legal protected characteristic. Legally protected characteristics included, race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, or veteran status or any other characteristic protected by federal, state, or local law in locations where PSEG employs individuals. <br><br>Need to request an accommodation? <br><br>If you have a disability and need assistance submitting your resume, applying for a position or registering for a test, please call 973-430-3845. Any information provided regarding a disability will be kept strictly confidential and will not be shared with anyone involved in making a hiring decision. <br><br><strong>Nearest Major Market: </strong>Newark <br><strong>Nearest Secondary Market: </strong>New York City <br><strong>Job Segment: </strong> Cloud, Intern, Compliance, Summer Internship, Technology, Energy, Entry Level, Legal</span>"
    },
    {
        "position": "Research Summer Intern 2021-Cloud Networking (Undergrad)",
        "company": "IBM",
        "location": {
            "city": "Yorktown",
            "state": "NY",
            "zip": "10598"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=222596356",
        "posted": "2020-12-07T09:04:15.767Z",
        "lastScraped": "2020-12-19T09:04:15.767Z",
        "description": "<span id=\"TrackingJobBody\" name=\"TrackingJobBody\"><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Introduction</span><span class=\"show-job-descr\"></span><br>At IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Your Role and Responsibilities</span><span class=\"show-job-descr\"></span><br>IBM Research has a Summer Internship position available in the Cloud Infrastructure Research group in Yorktown Heights, NY.<br><br>This group focuses on the next generation of cloud infrastructure that meets the needs of IBM Cloud customers. The research agenda of the group spans multiple technical areas in the context of hybrid cloud, including network architecture, security, control and management systems, high-speed networked-storage, accelerators.<br><br>Your responsibilities will focus on software-defined cloud networking and actively work on prototyping scalable, high performing, resilient and secure networking solutions.<br><br>Candidates pursuing a Bachelor's degree in Computer Science or Computer Engineering are preferred.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Required Technical and Professional Expertise</span><span class=\"show-job-descr\"></span><br><p style=\"text-indent:.5in;mso-layout-grid-align:none;text-autospace:none\" dir=\"ltr\"><span style=\"font-size:10.0pt;font-family:\" lucida=\"\" grande\",sans-serif;color:#0070c0\"=\"\">One or more of the following skills:</span></p><p style=\"text-indent:.5in;mso-layout-grid-align:none;text-autospace:none\" dir=\"ltr\"><span style=\"font-size:10.0pt;font-family:\" lucida=\"\" grande\",sans-serif;color:#0070c0\"=\"\">1) Java or Python coding-6 months<br>              </span><span style=\"font-size:10.0pt;font-family:\" lucida=\"\" grande\",sans-serif;color:#0070c0\"=\"\">2) Network architecture-6 months</span></p><br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Preferred Technical and Professional Expertise</span><span class=\"show-job-descr\"></span><br><span style=\"color:#0070C0;\"><font style=\"color:undefined;font-family:lucida grande,sans-serif;size:undefined;\"><font style=\"font-size:10.0pt;\">One or more of the following skills:</font></font></span><br><br><span style=\"color:#0070C0;\"><font style=\"color:undefined;font-family:lucida grande,sans-serif;size:undefined;\"><font style=\"font-size:10.0pt;\">1) Java coding, Python and bash scripting-1 year</font></font></span><br><span style=\"color:#0070C0;\"><font style=\"color:undefined;font-family:lucida grande,sans-serif;size:undefined;\"><font style=\"font-size:10.0pt;\">2) Cloud networking, data center networking, SDN experience-6 months</font></font></span><br><span style=\"color:#0070C0;\"><font style=\"color:undefined;font-family:lucida grande,sans-serif;size:undefined;\"><font style=\"font-size:10.0pt;\">3) Network routing protocols experience-6 months</font></font></span><br>​<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">About Business Unit</span><span class=\"show-job-descr\"></span><br>With more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Your Life @ IBM</span><span class=\"show-job-descr\"></span><br>What matters to you when you’re looking for your next career challenge?<br><br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these?  If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br><br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">About IBM</span><span class=\"show-job-descr\"></span><br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Location Statement</span><span class=\"show-job-descr\"></span><br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br><br><span class=\"show-job-descr\" style=\"font-weight: bold\"></span><br><span class=\"show-job-descr\" style=\"font-weight: bold\">Being You @ IBM</span><span class=\"show-job-descr\"></span><br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br><br><img src=\"https://www.applytracking.com/tp/rj6_yE7yf.I.K\"><font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;<font color=\"white\">6fac3445-56d8-4266-bac0-8ecc824adda0</font>&nbsp;</span>"
    },
    {
        "position": "Software Engineer Intern – Winter 2021",
        "company": "Quicken Loans, LLC",
        "location": {
            "city": "Detroit",
            "state": "MI",
            "zip": "48226"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=e96aafcb-95ff-4155-83c0-a8978fb568e8",
        "posted": "2020-12-18T09:04:16.425Z",
        "lastScraped": "2020-12-19T09:04:16.425Z",
        "description": "<div><div><p><b>Preferred Qualifications&nbsp;</b>&nbsp;</p></div><div><ul><li><p>Self-directed&nbsp;approach&nbsp;</p></li><li><p>Ability to communicate&nbsp;effectively&nbsp;</p></li><li><p>A desire to learn and grow in the software and systems engineering areas in a cloud environment</p></li><li><p>Experience with using version control and specifically Git</p></li></ul></div></div><div><p>&nbsp;</p></div><div><p><b>Job Summary</b>&nbsp;</p></div><div><p>Interns at&nbsp;the Rock&nbsp;Family of Companies gain priceless hands-on experience. Here, they learn how it feels to be in the workplace, participate in events&nbsp;and become a valuable member of our team.&nbsp;</p></div><div><p>&nbsp;</p></div><div><p><b>Responsibilities</b>&nbsp;</p></div><div><div><ul><li><p>Learn about our business by attending meetings, huddles&nbsp;and&nbsp;trainings&nbsp;</p></li><li><p>Share creative ideas that will help improve our business&nbsp;</p></li><li><p>Deliver&nbsp;reports,&nbsp;analyze metrics&nbsp;and summarize information&nbsp;to&nbsp;help drive our team forward&nbsp;&nbsp;</p></li><li><p>Assist in creating materials and/or presentations&nbsp;for&nbsp;meetings&nbsp;</p></li><li><p>Take notes&nbsp;during meetings&nbsp;and provide recaps&nbsp;</p></li></ul></div></div><div><p>&nbsp;</p></div><div><p></p><p><b>Who We Are</b></p><p>We're America's largest mortgage lender, closing loans in all 50 states. J.D. Power ranked Quicken Loans \"Highest in Customer Satisfaction in Primary Mortgage Origination\" for the past 10 consecutive years, 2010 - 2019. The company was also ranked highest in the nation for client satisfaction among mortgage servicers by J.D. Power for 7 consecutive years, 2014 through 2020, each year the company was eligible. There's a simple reason we've been so successful: We care about the people we work with.</p><p></p><p>If you're tired of stuffy, bureaucratic workplaces, then you'll be delighted to find something different here. We strive to make a creative, fun and collaborative environment you simply won't find anywhere else. Quicken Loans was once again named to FORTUNE magazine's \"100 Best Companies to Work For\" list in 2019 and has been included in the magazine's top one-third of companies named to the list for the past 16 consecutive years. In addition, Essence Magazine named Quicken Loans the \"#1 Place to Work in the Country for African Americans.\"</p><p></p><p><b>Disclaimer</b></p><p>This is an outline of the primary responsibilities of this position. As with everything in life, things change. The tasks and responsibilities can be changed, added to, removed, amended, deleted and modified at any time by the leadership group.</p></div><div><p>&nbsp;</p></div>"
    },
    {
        "position": "Artificial Intelligence/Machine Learning -- Internship",
        "company": "ASRC Federal Holding Company",
        "location": {
            "city": "Greenbelt",
            "state": "MD",
            "zip": "20771"
        },
        "url": "https://www.monster.com/jobs/search/?q=computer-science-intern&intcid=skr_navigation_nhpso_searchMain&tm=30&stpage=1&page=9&jobid=dad600f5-664c-4f8b-917f-e957b3c522bc",
        "posted": "2020-12-16T09:04:17.017Z",
        "lastScraped": "2020-12-19T09:04:17.017Z",
        "description": "<div><p></p><p>ASRC Federal (ASTS) provides Software Engineering Services throughout all aspects of the engineering process of the entire space systems arena. Our focused solutions offer efficiency, agility, and innovation. We resolve issues quickly and provide ideas and solutions to help our customers fix problems and overcome challenges. ASTS is looking for Interns to support its Software Engineering Services -- II contract at the NASA Godard Space Flight Center (GSFC) in Greenbelt, Maryland. This support will focus on our intern development program in support of the Software Engineering Division (SED - Code 580). The candidate(s) in this position will participate in intern development projects ranging from software development missions to associated business support functions.</p><p></p><p>Roles/Responsibilities:</p><p></p><p>ASRC is looking for an Artificial Intelligence/Machine Learning (AI/ML) Intern/Co-Op for our team at NASA's Goddard Spaceflight Center (GSFC). As an AI/ML Intern, you will work with the Goddard Technical Development Evaluation Team to streamline and automate the data analysis and reporting process to quickly identify trends and actionable items by using cutting edge techniques in machine learning and artificial intelligence.</p><p></p><p>In this role, you will develop user friendly python scripts to automate the survey analysis, create graphs to visualize the trend from participant feedback, analyze the comments, and export the data to a representable document. You will use cutting edge techniques in machine learning with the existing evaluation processes to reduce the time and resources required to identify trends and recommend actions.</p><p></p><p>Your technical skills will be both challenged and expanded in a great growth role.</p><p></p><p>&nbsp;</p><p></p><p><strong><em>ASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.</em></strong></p><p></p></div>"
    }
]