[
    {
        "position": "Consulting Internship (Summer 2021)",
        "company": "CapTech Consulting - 4.0",
        "location": {
            "city": "Richmond",
            "state": "VA"
        },
        "posted": "2021-01-31T07:59:50.450Z",
        "url": "https://www.simplyhired.com/job/VcldCPJwJRknyETf40s2Dv33jtU6C704pmtdAzM-gX7gyhWn2YIPhw?q=computer+science",
        "lastScraped": "2021-01-31T07:59:50.450Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nDo you want to work on real world problems with smart, collaborative peers and leaders who are invested in your success? CapTech is looking for undergraduate Juniors that are passionate about technology with a desire to solve complex business and technical problems to join our internship program, Elevate.\n<br><br>\nYou are more than just a number at CapTech. Build your career alongside top tech talent from across the country. We recruit the best and brightest people who know how to set industry trends and wow our clients and their consumers. We promote the work hard, play hard culture and strive to build a sense of camaraderie and belonging among our employees. Our people are our greatest assets, and we do everything we can to support their professional and personal growth.\n<br><br>\nJob Description\n<br><br>\nElevate, CapTech’s award winning summer internship program, provides meaningful immersion into the full life cycle of a typical IT consulting project. This unique 11-week program (takes place in Richmond and Reston, VA) simulates a client engagement where one can achieve a full understanding of the consulting experience while solving relevant client problems. Interns work in self-led teams and are paired with full-time consultants for guidance and mentorship. Additionally, interns enjoy weekly lunch-and-learns with our leadership team. CapTech interns are given the opportunity to build something that matters and create impactful value.\n<br><br>\nIn 2019, Vault.com ranked Elevate the 4th Best Consulting Internship nationwide.\n<br><br>\nQualifications\n<br><br>\nWe are seeking software engineers for this summer who will work on integrated teams to determine and implement a solution to a business problem over the course of the summer. Characteristics of a qualified candidate include:\n<br><br>\nCurrent undergraduates with expected graduation dates in December 2021 - May 2022\n<br>Interest in pursuing a career as an IT consultant in either the developer or analyst track\n<br>Top performing students that have demonstrated an ability to be self motivated contributors in a team environment\n<br>Computer Science and Engineering majors preferred but not required\n<br>Availability from May - August\n<br><br>\nAdditional Information\n<br><br>\nWe offer challenging and impactful jobs with professional career paths. All CapTechers can keep their hands-on technology no matter what position they hold. Our employees find their work exciting and rewarding in a culture filled with opportunities to have fun along the way.\n<br><br>\nCapTech is an equal opportunity employer committed to fostering a culture of equality, inclusion and fairness — each foundational to our core values. We strive to create a diverse environment where each employee is encouraged to bring their unique ideas, backgrounds and experiences to the workplace.\n<br><br>\nCandidates must be eligible to work in the U.S. for any employer directly (we are not open to contract or “corp to corp” agreements). At this time, CapTech cannot transfer nor sponsor a work visa for this position. Applicants must be authorized to work directly for any employer in the United States without visa sponsorship.\n<br><br>\nCapTech is a Drug-Free work place.\n<br>Candidates must have the ability to work at CapTech’s client locations.\n<br>All positions include the possibility of travel.\n<br>CapTech has not contracted/does not contract with any outside vendors in its recruitment process. If you are interested in this position, please apply to CapTech directly.</div><div></div>"
    },
    {
        "position": "Error",
        "company": "Teradata - 3.8",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2021-01-30T07:59:50.738Z",
        "url": "https://www.simplyhired.com/job/ZrPk_Lzdf_IOIP3d005Sxb5qB3Q2nZ0-EGLpbzc00ATaprhQ8vcOIA?q=computer+science",
        "lastScraped": "2021-01-31T07:59:50.738Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Our summer internship program is an excellent way for you to gain experience, work with amazing people, and complement your studies as you set the course for your future. The program lasts 10-12 weeks, beginning in May/June and ending in August/September. The Advanced Analytics Product team is a fast-paced, flexible, and fun group. The Teradata culture isn’t just about one kind of person. So many individuals make up who we are, making us that much more unique. It’s what sets apart the dynamic, diverse, and collaborative environment that is Teradata.\n<br><br>\nOur Team\n<br><br>\nThe Advanced Analytics team seeks motivated business and technically oriented individuals ready to apply their love of Machine Learning / Artificial Intelligence to creating breakthrough products that customers will love. We are looking for a motivated individual who can learn the craft of Product Management, a transferable skill to many professions. We are a mighty team embedded within the cloud Product Management group. We discover and develop new products that will help our customers transform their business. You will enjoy learning about the process of Product Development end to end.\n<br><br>\nYour Opportunity\n<br>We will pair you with seasoned Product Managers who are practitioners of enterprise scale product development in the Advanced Analytics space. You will support the product discovery and delivery activities of multiple product areas. You will have a chance to see the execution of releases into the market and get experience planning for the next release. You will work with many roles across the product development lifecycle (such as program manager, software engineer, tester, scrum master).\n<br><br>\nQualifications/Requirements\n<br>Must be enrolled in a BS/MS degree program in Computer Science, Data Science (or related technical field), or you have a technical degree and are working on an MBA in marketing, product development, or related areas. Minimum 3.3 GPA Must be graduating between December 2021 – June 2024 Strong background in Data Science R/Python coding experience Excellent critical thinking and problem-solving skills Good written and verbal communication skills Detail-oriented with strong organizational skills</div><div></div>"
    },
    {
        "position": "Computer Operator (Intern)",
        "company": "NVision Solutions, Inc. -",
        "location": {
            "city": "Stennis Space Center",
            "state": "MS"
        },
        "posted": "2021-01-28T07:59:51.109Z",
        "url": "https://www.simplyhired.com/job/SxtGZQx6J60Ul4XlKPgKpY8rEVWziJM6_5Ck6Cd0DEA6DUH3atS1Fg?q=computer+science",
        "lastScraped": "2021-01-31T07:59:51.109Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Computer Operator</p><p>Education: Someone currently working on a Computer Science/IT degree.</p><p>Part-time (<b>This is a year-round position. Will work around school schedule</b>.)</p><p>$15.28/hour</p><p>Entry-level computer technical assistance. Uses detailed written or oral guidance to resolve common operating problems. Support includes but is not limited to assistance in: IT helpdesk operations, internal IT user support, assistance in application systems maintenance, website operations, IT security monitoring, software development and testing. Maintains files and records, and generates reports.</p><p>Job Type: Internship</p><p>Job Types: Part-time, Internship</p><p>Pay: $15.28 per hour</p><p>Benefits:</p><ul><li>401(k)</li><li>401(k) matching</li></ul><p>Education:</p><ul><li>Associate (Preferred)</li></ul><p>Company's website:</p><ul><li>www.nvisionsolutions.com</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul></div><div></div>"
    },
    {
        "position": "Data Analyst",
        "company": "United Office Solutions, Inc -",
        "location": {
            "city": "Minnetonka",
            "state": "MN"
        },
        "posted": "2021-01-28T07:59:51.632Z",
        "url": "https://www.simplyhired.com/job/hLy9MHOiLDBV9RqqU5c3lRbK1T9x8OG0ZnfEgUIP6boZJS6A_JGsLQ?q=computer+science",
        "lastScraped": "2021-01-31T07:59:51.632Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>We are looking for a passionate certified Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. Data analyst responsibilities include conducting full lifecycle analysis to include requirements, activities and design. Data analysts will develop analysis and reporting capabilities. They will monitor performance and quality control plans to identify improvements.</p><p><b>Responsibilities</b></p><ul><li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li><li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li><li>Acquire data from primary or secondary data sources and maintain databases/data systems</li><li>Identify, analyze, and interpret trends or patterns in complex data sets</li><li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems</li><li>Work with management to prioritize business and information needs</li><li>Locate and define new process improvement opportunities</li></ul><p><b>Skills</b></p><ul><li>Proven working experience as a data analyst or business data analyst</li><li>Technical expertise regarding data models, database design development, data mining and segmentation techniques</li><li>Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)</li><li>Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Adept at queries, report writing and presenting findings</li><li>BS in Mathematics, Economics, Computer Science, Information Management or Statistics</li></ul><p><i>Related keywords: data analyst, analyst</i></p><p>Job Types: Full-time, Internship</p><p>Pay: $21.00 - $35.00 per hour</p><p>Benefits:</p><ul><li>401(k)</li><li>401(k) matching</li><li>Health insurance</li><li>Paid time off</li></ul><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>COVID-19 considerations:<br>Yes</p><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Microsoft Access: 3 years (Required)</li><li>Business Analysis: 2 years (Preferred)</li></ul><p>Company's website:</p><ul><li>www.itemsrus.com</li></ul><p>Benefit Conditions:</p><ul><li>Waiting period may apply</li><li>Only full-time employees eligible</li></ul><p>Work Remotely:</p><ul><li>No</li></ul></div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Pohlad Companies -",
        "location": {
            "city": "Saint Paul",
            "state": "MN"
        },
        "posted": "2021-01-31T07:59:52.172Z",
        "url": "https://www.simplyhired.com/job/bIYctdh50-7WCAV4RDmlVg7XQlxdRtITjzBBWrG6Iz95nGM-GvgNFw?q=computer+science",
        "lastScraped": "2021-01-31T07:59:52.172Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">An investment in knowledge pays the best interest. PaR Systems, a world leader in engineering intelligent solutions is ready to welcome summer Software Engineering Interns. Our focus on technology, quality, and new ideas extends beyond our products, as we look to add diverse, dynamic, and dedicated people to our company.\n<br><br>\nSupporting our one-of-a-kind projects, this role will tackle unique engineering challenges and help PaR deliver premier products/solutions that are unparalleled in our industry. From automation controls systems to robotic software solutions, the work you do will ensure the wellbeing of our clients and customers around the world.\n<br><br>\n<b>Success Criteria:</b><br>\nAs a continuous learner, you'll be tasked with getting up to speed on our existing projects and work closely with our Software Engineering Team, to build creative technical solutions that take on complex problems.\n<br><br>\nThis role requires the application of theoretical principles and creative/analytical techniques typically acquired in a recognized four-year or more academic course of study. Applying what you learned in school with the collaborative power of our team will also give you learning and development opportunities on the job.\n<br><br>\nOur customers expect quality, and so do we. Using your technical judgment for planning, organizing, performing and coordinating product development/engineering assignments will get you the career experience of a lifetime!\n<br><br>\n<b>Qualifications:</b><br>\nMust be enrolled in a Bachelor's Degree in Electrical Engineering, Mechanical Engineering, or Computer Science with a focus on Controls Software\n<br>0 GPA or higher\n<br>Relevant academic experience in your respective engineering field\n<br>APPLICANTS - Please only apply to ONE preferred role (we will consider you for other positions if your skills are an appropriate fit)\n<br><br>\n-\n<br><br>\nYou've learned about what you'll be doing, here's what you'll be getting when you join PaR Systems:\n<br><br>\nGlobal team united by their passion for inventing\n<br>First-of-a-kind product culture and project exposure\n<br>Training and development from industry-leading experts\n<br><br>\nPaR Systems is an equal opportunity employer and we value inclusion and diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. If selected for an interview, please advise our Human Resources department if you require accommodation during the interview or assessment process and we will support your accessibility needs.\n<br><br>\nReady for Exponential Career Opportunities? Apply now...</div><div></div>"
    },
    {
        "position": "Sensor Software Intern - Autonomous Vehicles",
        "company": "TuSimple -",
        "location": {
            "city": "Tucson",
            "state": "AZ"
        },
        "posted": "2021-01-31T07:59:52.451Z",
        "url": "https://www.simplyhired.com/job/_DN_9qod_TLtjrmVKnvdr5ETyMzcG2tWp8WIbB2-YxIqhDcsqZf4tA?q=computer+science",
        "lastScraped": "2021-01-31T07:59:52.451Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This opportunity is located in Tucson, AZ.\n<br><br>\n<b>You can apply to the job with this email address:</b> sensor_software_intern_05f76fa62us@ivy.greenhouse.io\n<br><br>\nCompany Overview\n<br><br>\nCome join a higher calling and find a deeper purpose!\n<br><br>\nAs a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.\n<br><br>\nWhile inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.\n<br><br>\nTuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network.\n<br><br>\nOpportunity Overview\n<br><br>\nYou'll be closely working with our R&amp;D team to develop sensor system solutions for autonomous vehicles.\n<br><br>\nDesign and develop software systems and internal tools for autonomous driving vehicles\n<br><br>\nDevelop sensors drivers &amp; APIs &amp; SDKs, evaluate sensors performance, integrate sensors to the vehicles, build sensors calibration solution, support algorithm development and calibration activities for vehicles\n<br><br>\nIntegrate vehicle system including sensing modules, perception modules, monitoring modules etc.\n<br><br>\nExperience &amp; Skills Required\n<br><br>\nM.S. or Ph.D. in Computer Engineering, Computer Science, Robotics or a related field\n<br><br>\nProficiency with Python and/or C++/C\n<br><br>\nSystem software design and programming - including parallel processing, threading, synchronization etc. to realize complex middleware and applications\n<br><br>\nExcellent problem solving and troubleshooting skills, including a systematic approach to determining root cause, implementing solutions, and documenting results\n<br><br>\nPreferred Skills and Experience\n<br><br>\n<b>2+ years of experience in one of the following areas:</b> unmanned autonomous platforms, software system engineering, vehicle integration, sensors systems etc.\n<br><br>\nPractical front-end software development experience\n<br><br>\nTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.\n<br><br>\nThis opportunity is located in Tucson, AZ.\n<br><br>\n<b>You can apply to the job with this email address:</b> sensor_software_intern_05f76fa62us@ivy.greenhouse.io\n<br>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois-Urbana-Champaign, University of Maryland-College Park, University of Massachusetts-Amherst, University of Michigan-Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin-Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control</div><div></div>"
    },
    {
        "position": "Sensor Software Intern - Autonomous Vehicles",
        "company": "TuSimple Internship Program -",
        "location": {
            "city": "Tucson",
            "state": "AZ"
        },
        "posted": "2021-01-31T07:59:52.873Z",
        "url": "https://www.simplyhired.com/job/tDTB_NUpm-UcDBU776XVztQy-aIsFucterGTD_1Z22RgBzRlGtnyOg?q=computer+science",
        "lastScraped": "2021-01-31T07:59:52.873Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">This opportunity is located in Tucson, AZ.\n<br><br>\n<b>You can apply to the job with this email address:</b> sensor_software_intern_05f76fa62us@ivy.greenhouse.io\n<br><br>\nCompany Overview\n<br><br>\nCome join a higher calling and find a deeper purpose!\n<br><br>\nAs a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.\n<br><br>\nWhile inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.\n<br><br>\nTuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network.\n<br><br>\nOpportunity Overview\n<br><br>\nYou'll be closely working with our R&amp;D team to develop sensor system solutions for autonomous vehicles.\n<br><br>\nDesign and develop software systems and internal tools for autonomous driving vehicles\n<br><br>\nDevelop sensors drivers &amp; APIs &amp; SDKs, evaluate sensors performance, integrate sensors to the vehicles, build sensors calibration solution, support algorithm development and calibration activities for vehicles\n<br><br>\nIntegrate vehicle system including sensing modules, perception modules, monitoring modules etc.\n<br><br>\nExperience &amp; Skills Required\n<br><br>\nM.S. or Ph.D. in Computer Engineering, Computer Science, Robotics or a related field\n<br><br>\nProficiency with Python and/or C++/C\n<br><br>\nSystem software design and programming - including parallel processing, threading, synchronization etc. to realize complex middleware and applications\n<br><br>\nExcellent problem solving and troubleshooting skills, including a systematic approach to determining root cause, implementing solutions, and documenting results\n<br><br>\nPreferred Skills and Experience\n<br><br>\n<b>2+ years of experience in one of the following areas:</b> unmanned autonomous platforms, software system engineering, vehicle integration, sensors systems etc.\n<br><br>\nPractical front-end software development experience\n<br><br>\nTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.\n<br><br>\nThis opportunity is located in Tucson, AZ.\n<br><br>\n<b>You can apply to the job with this email address:</b> sensor_software_intern_05f76fa62us@ivy.greenhouse.io\n<br>Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois-Urbana-Champaign, University of Maryland-College Park, University of Massachusetts-Amherst, University of Michigan-Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin-Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control</div><div></div>"
    },
    {
        "position": "Database Engineering Intern - Analytics",
        "company": "VirginPulse -",
        "location": {
            "city": "Providence",
            "state": "RI"
        },
        "posted": "2021-01-31T07:59:53.381Z",
        "url": "https://www.simplyhired.com/job/9XbNhK7yt4IOS278lh3OvVmahGP8rdpDzVuj7rzbFDUy680g2l8bQw?q=computer+science",
        "lastScraped": "2021-01-31T07:59:53.381Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Overview:</b><br>\nWho is Virgin Pulse?\n<br><br>\nVirgin Pulse, founded as part of Sir Richard Branson’s famed Virgin Group, helps organizations build employee health and wellbeing into the DNA of their corporate cultures. As the only company to deliver a powerful, mobile-first digital platform infused with live services, including coaching and biometric screenings, Virgin Pulse’s takes a high-tech-meets-high-touch-approach to engage employees in improving across all aspects of their health and wellbeing, every day – from prevention and building a healthy lifestyle to condition and disease management to condition reversal, all while engaging users daily in building and sustaining healthy habits and behaviors. A global leader in health and wellbeing, Virgin Pulse is committed to helping change lives and businesses around the world for good so that people and organizations can thrive, together. Today, more than 3100 organizations across the globe are using Virgin Pulse’s solutions to improve health, employee wellbeing and engagement, reduce costs and create strong workplace cultures.\n<br><br>\nWho are our employees?\n<br><br>\nAt Virgin Pulse we’re passionate about changing lives for good. We want to make a difference in the world by helping people be healthy so they can perform at their best, every day, at work and home. Our award-winning solutions support leading employers in improving and simplifying the employee health and wellbeing journey and engaging people in all aspects of their health. But our world-class products and programs are nothing without our people – the employees who design, build, promote, sell, test and perfect the latest innovations in workplace health and wellbeing. Our people are our top priority and we invest in their health and happiness. At Virgin Pulse, we have so much more than a strong, supportive company culture – have a shared vision for a healthier, happier world.\n<br><br>\nVirgin Pulse values and celebrates diversity and is committed to creating an inclusive environment for all employees. We believe in creating teams made up of individuals with various backgrounds, experiences, and perspectives, inspires innovation, collaboration, and challenges us to produce better solutions. As a global employer, we seek to recruit, develop, and retain the most talented people from a diverse candidate pool.\n<br><br>\nAs we are committed to diversifying our company, we strongly encourage candidates that are historically underrepresented in the tech industry to apply.\n<br><br>\nOur technology\n<br>Our next generation Data Pipeline is using an exciting mixture of large scale, highly available, public-facing systems built on serverless infrastructure. This Data Pipeline ensures scalable, secure, private, and high-performance access to any data from our application, operational tools, or any other data generated within the organization.\n<br><br>\nOur Data Pipeline feeds our Data Lake and Data Warehouse; both of which use Amazon Web Services extensively for stability and high availability. Our Data Lake provides authenticated, secure access to any available data in our organization. Our Data Warehouse provides additional structure and value to our data, which can be readily used for training machine learning algorithms, any internal or external reporting, and informing our company’s product roadmap.\n<br><br>\nWe practice Continuous Integration and Continuous Delivery using TeamCity; as a result we have continual smaller releases to our environments (Development, QA, Staging, Production), with integrated unit tests and code coverage analysis while eliminating the risk taken on with only a few large releases/product updates.\n<br><br>\n<b>Responsibilities:</b><br>\nWho you are\n<br><br>\nVirgin Pulse seeks a Database Engineer Intern to support the organization’s efforts to maintain an innovative leadership position in the employee engagement SaaS industry. The Database Engineer accesses datasets from various sources, extracts, transforms, and loads the data into a variety of databases. We are looking for someone who is self-directed and thrives working in a fast-paced, collaborative environment, in which expectations are high both for the quality and speed of work. As a KEY member of the Data Systems &amp; Reporting team, you will be part of dynamic team focused on investigations and research, consisting of innovative problem-solving sleuths. Our main goals are to ensure quality &amp; accuracy of all our reporting deliverables, which includes BI visualizations, data file extracts driven by SQL scripts, and world-class data visualizations available to all our customers.\n<br><br>\nIn this role you will wear many hats but your skills will be especially essential in the following:\n<br><br>\nWrite SQL and R programs to access, clean, and transform required data prior to analysis and reporting\n<br>Troubleshoot and perform data audits to ensure and improve data integrity; investigate and resolve data discrepancies\n<br>Work in MS SQL Server and Redshift databases in Amazon Web Services environments\n<br><br>\n<b>Qualifications:</b><br>\nWhat you bring to the team\n<br><br>\nWorking towards a degree in computer science or related field\n<br>Experience with R, SQL, Amazon Redshift, MS SQL server\n<br>You are self-motivated, creative, and detail oriented\n<br>Skills in scripting, data engineering or modeling, and business intelligence\n<br>Enjoy actively experimenting with new technologies\n<br>Excellent verbal and written communication skills\n<br><br>\nIn addition, you possess a number of desirable traits including:\n<br><br>\nYou have outstanding problem solving and analytical skills\n<br>You are a good communicator (written and verbal)\n<br>You are enthusiastic about working in a team, and have great people skills\n<br>A passion for learning technologies and applying them to the right projects will make you successful in this position.\n<br><br>\n<b>Security Competencies:</b><br>\nWork to maintain system and data security at a high standard, ensuring the confidentiality, integrity and availability of the Virgin Pulse application is not compromised. Adhere to industry best practice coding standards and verify all code developed at Virgin Pulse is free from bugs and security vulnerabilities such as those defined and published by OWASP.\n<br><br>\nWhy work here?\n<br><br>\nWe believe a career should provide competitive pay and benefits, a collaborative and supportive work environment, strong employee culture and cutting-edge technology and services — so many reasons to love it here.\n<br><br>\n<ul><li>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to any protected class status.</li></ul>\n</div><div></div>"
    },
    {
        "position": "Summer Risk Advisory Intern (Remote)",
        "company": "GRF CPAs & Advisors -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-31T07:59:53.847Z",
        "url": "https://www.simplyhired.com/job/3-HVJ34gz5hIITim4GcZZNYquRKjKliXfUoLv8-jMJcnkiE-3AGiRw?q=computer+science",
        "lastScraped": "2021-01-31T07:59:53.847Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Looking for a Risk &amp; Advisory Internship at an energetic &amp; passionate company? GRF CPAs &amp; Advisors, based in Bethesda, MD is in search of a Summer Risk &amp; Advisory Intern to join our team.\n<br><br>\n<b>Essential Functions:</b><br>\nAssist the marketing department with RAS marketing material development and other items related to growing the advisory practice.\n<br>Assist with enterprise-wide risk assessments and development of mitigation plans.\n<br>Research industry, business process, IT risks and internal control best practices.\n<br>Assist with preparing and executing internal audit programs.\n<br>Develop computer skills including data manipulation software (i.e. MindBridge AI).\n<br>Assist with drafting internal audit reports.\n<br>Other duties as assigned.\n<br><br>\nRequirements\n<br><br>\nA rising college junior or senior working to obtain a B. S. in Accounting, Accounting Information Systems, Finance or Computer Science with a grade point average of 3.0 or higher\n<br>Should have completed Accounting courses through Intermediate II. Advanced Accounting and Business Law are not mandatory but either or both would be helpful\n<br>Proficiency with MS Office applications that will include but are not limited to Excel, Word, and PowerPoint\n<br>Excellent writing, organizational and planning skills are necessary\n<br>Good interpersonal skills\n<br>Ability to work with a team, take direction from a supervisor/manager, and adhere to work schedules\n<br>Maintain strict confidentiality at all times and sign a Confidentiality Agreement\n<br><br>\nBenefits\n<br><br>\nThis is a paid remote internship. We look forward to hearing from you! GRF CPAs &amp; Advisors is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, protected veteran status or disability. At GRF CPAs and Advisors we cultivate an inclusive business environment where all employees are valued for their unique</div><div></div>"
    },
    {
        "position": "Error",
        "company": "RTX - 4.8",
        "location": {
            "city": "Grapevine",
            "state": "TX"
        },
        "posted": "2021-01-29T07:59:54.251Z",
        "url": "https://www.simplyhired.com/job/_AwCj1UiBUxV27F_MtPof1C9HFFiND37mHiTXajmxZ6wXIDlLdGhoA?q=computer+science",
        "lastScraped": "2021-01-31T07:59:54.251Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">***Great opportunity for current college students entering their Junior or Senior year by Fall 2021 or college graduate students (entering or currently enrolled) in a graduate program by Fall 2021. If you are not a current college or graduate student, please visit our website for other opportunities!***\n<br><br>\nThe Systems Engineering Center is seeking a skilled Secure Systems/Cybersecurity Engineering intern to join the Secure Systems Department. This position is in a technical growth area and we need team members who can apply their education, technical knowledge and experience to systems security/Cybersecurity engineering and program protection concerns within the key areas of Cybersecurity, Anti Tamper, software assurance, supply chain exploitation, and threat and design vulnerability analysis. The engineer will participate in the development of embedded systems security solutions, and will be responsible for developing and executing efforts for secure systems products.\n<br><br>\n<b>Key responsibilities for the qualified candidate include:</b><br>\nThe engineering intern must be able to work as a member of a team in coordination with engineers in development, integration, test and modeling. The engineering intern will exhibit a high degree of creativity and ingenuity, and will be responsible for supporting systems integrity, Cybersecurity, and information assurance. The engineering intern must be able to effectively communicate with both internal and external customers.\n<br><br>\n<b>These activities include:</b><br>\nParticipating in technical peer reviews throughout the design life cycle.\n<br>Interface with their team lead, team members, and other teams (SW and HW) on a daily basis\n<br>Candidate should be a team player and effectively work with team members and provide cost effective solutions for customer needs.\n<br><b>Related day-to-day duties include:</b> participating in peer reviews throughout the product life cycle of design, development, integration and test. This team member will interface with their team lead, team members, and other teams on a daily basis, conduct or participate in customer and/or program technical review presentations, and provide task progress status updates and work products to the team lead.\n<br><br>\n<b>For Multi-Level Intern Requisitions:</b><br>\nThis position can be a Salary Grade of G04, G05 or NUG based on the candidate's qualifications as they relate to the skills, experience and responsibility requirements for the position.\n<br>G04 (College Junior by Fall 2021) - must have completed 60 hours of college\n<br>G05 (College Senior by Fall 2021) - must have completed 90 hours of college\n<br>NUG (Post- Graduate-Masters-PhD by Fall 2021) - must have an undergraduate degree and currently enrolled or about to enroll in a graduate degree program\n<br><br>\n<b>Security Clearance &amp; Other Requirements:</b> Must be able to obtain a secret security clearance, not being able to secure the Secret Security Clearance needed for this position may result in an offer of employment being rescinded.\n<br><br>\n<b>Requirements:</b><br>\nMust be a college Junior, Senior or Graduate student by Fall 2021\n<br>Understanding of embedded Cybersecurity Solutions, Security Authorization requirements, vulnerability assessments, or threat mitigation\n<br>Systems, Cyber, Electrical, Software engineering or Computer Science course work\n<br>Familiar with designing, testing Cybersecurity-oriented solutions\n<br>Familiar with secure/Cybersecurity systems technologies, methodologies, policies and guidelines\n<br><br>\n<b>Desired Requirements:</b><br>\nMinimum 3.0 cumulative GPA (Please upload an unofficial transcript when applying)\n<br>Active secret clearance\n<br>Excellent written and verbal communication skills\n<br>IASE or IAT level I or greater cybersecurity certification per DoD 8570.01; such as: SSCP, CAP, GCIA, Security+, CySA+, etc.\n<br>Knowledge of operating systems security features and settings (e.g. Windows, UNIX and Linux)\n<br>Engineering projects or previous internship experience\n<br><br>\n<b>Required Education:</b><br>\nCurrently pursuing a BS degree from a four-year university and entering as a college Junior or Senior OR pursuing a MS / PhD by Fall 2021. Must be working towards a degree in Electrical Engineering, Computer Engineering, Systems Engineering, Computer Science, or related field. Must be appropriate grade level listed above.\n<br><br>\nThis position requires either a U.S. Person or a Non-U.S. Person who is eligible to obtain any required Export Authorization.174300\n<br><br>\nRaytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.</div><div></div>"
    },
    {
        "position": "UI Developer (JavaScript - Mandarin Speaking - Will Train)",
        "company": "United Software Corporation -",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2021-01-26T07:59:54.746Z",
        "url": "https://www.simplyhired.com/job/hfJob0me6jnRyEi9UhvzoenDmTzRPwpehuKb4bl9PL1tsRjR_x6NYw?q=computer+science",
        "lastScraped": "2021-01-31T07:59:54.746Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>About United Software Corporation: </b></p><p>United Software Corporation, a sister concern of Silicon Spectra, is one of the leading providers of Enterprise software solutions, comprehensive IT solutions, including Systems Integration, Consulting, Information Systems outsourcing, IT-enabled services, telecommunication, R&amp;D etc. We specialize in placement of UI Developers, ReactJS, AngularJS, Quality Assurance Analyst, Data Analyst, Software Developers, UX Engineers etc. in fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy and life science, oil and gas, travel and transportation, and local and state government for both permanent and contract C2C staffing arrangements. Our recent placements include Apple, Google, Facebook, JPMC, Wells Fargo and several other fortune 500 companies.</p><p>Website: https://usc.dev/</p><p><b>Knowledge and Skills: </b></p><ul><li>Exposed to and/or experienced with several technologies such as: React JS, SASS, JSON, AJAX and Bootstrap</li><li>Provided solid markup skills in utilizing HTML5, CSS3, JavaScript, and jQuery</li><li>Developed front-end skills and some basic understanding of how back-end development works</li><li>Knowledge of designing mark up, developing the UI of websites and/or web applications</li><li>Demonstrated understanding of UX and UI design with an emphasis on maximizing usability</li><li>Knowledge of using REST web services and working with interface design</li><li>Desired to work in a collaborative, innovative, flexible and agile JavaScript Development team-oriented environment</li><li>Fluent in Mandarin or Cantonese.</li></ul><p><b>Education and Qualities: </b></p><ul><li>Bachelors/ Master’s degree in Computer Science or related field</li><li>Strong written and oral communication skills in both English and Mandarin preferred</li><li>Detail oriented, ability to multitask with strong prioritization, planning and organization skills</li><li><b>Willing to relocate NATIONWIDE (MUST) and familiar with CCC business framework</b></li></ul><p><b>Benefits: </b></p><ul><li>Lucrative Annual Base Salary</li><li>Full Health Insurance Coverage</li><li><b>Immediate H1B, STEM Ext. or GC Sponsorship</b></li><li>Access to exclusive training &amp; mentorship by Senior Apple Tech Leads</li></ul><p><b>Helpful Info: </b></p><ul><li><b>Training Location: Austin, TX (15 mins from Apple &amp; Facebook Campus)</b></li><li>Starting Salary: $60,000</li><li>Placement: <b>Anywhere in US (MUST be willing to relocate)</b></li><li><b>Visa sponsorship is available for qualified employees</b></li><li>No experience required but better to have</li></ul><p>Job Types: Full-time, Internship</p><p>Pay: $60,000.00 - $75,000.00 per year</p><p>Experience:</p><ul><li>JavaScript: 1 year (Preferred)</li></ul><p>Language:</p><ul><li>Mandarin (Required)</li></ul><p>Work Location:</p><ul><li>Multiple locations</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>Yes: H-1B work authorization</li></ul><p>Company's website:</p><ul><li>https://usc.dev/</li></ul><p>Company's Facebook page:</p><ul><li>https://h1bdata.com/pin/united-software-corporation/</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul></div><div></div>"
    },
    {
        "position": "Learn Video Editing Internship at Sports AI Startup Spring '21",
        "company": "Sparrow - 4.2",
        "location": {
            "city": "United States",
            "state": "States"
        },
        "posted": "2021-01-27T07:59:55.238Z",
        "url": "https://www.simplyhired.com/job/GpAw1bO81geg6-IVFYBPaX47iUwE4nSYq_01pzvKDRxtBlJBi2xhig?q=computer+science",
        "lastScraped": "2021-01-31T07:59:55.238Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Want to learn video editing skills and create content that will be seen by hundreds of thousands of people?</p><p>Sparrow is an early-stage startup that uses artificial intelligence (AI) to help athletes improve. Our flagship product, currently in pre-release, analyzes a golfer’s swing and provides feedback in real-time.</p><p>We are offering a valuable Video Editing internship for a creative, bright, motivated, and resourceful college student or recent college graduate looking to learn how to create videos.</p><p>In this 7+ month internship, you’ll participate in online video editing classes funded by Sparrow while working closely with Sparrow’s founders and core team on effectively marketing our app.</p><p><b>THE AGENDA: </b></p><ul><li>Learn the process of making videos from creating storyboards to editing</li></ul><ul><li>Contribute to the core creative strategy for Sparrow's long-awaited App Store launch</li></ul><ul><li>Create/edit videos for influencer collaborations, marketing/ad campaigns and company materials</li></ul><ul><li>Daily content creation (still, gif, motion graphics) for multi-channel campaigns (paid ad, email marketing, social, website, PR)</li></ul><ul><li>Take the lead on building Sparrow’s social media identity (and creating custom content/layouts)</li></ul><ul><li>Proposing and producing new concepts for video campaigns to increase public relations</li></ul><ul><li>And much more!</li></ul><p><b>THE REQUIREMENTS: </b></p><ul><li>A student at a reputable 4-year college, with either a visual arts, marketing/communications or related degree and/or experience</li></ul><ul><li>Work an 8 hour work day (-40 hours per week) from February through the August 2021</li></ul><ul><li>Must be able to make a 7 month commitment</li></ul><ul><li>Be uber-productive, able to switch between different kinds of tasks, and comfortable taking on all jobs complex or mundane</li></ul><ul><li>Detail-oriented and thoughtful when executing a task or initiative</li></ul><ul><li>Expressed interest in video editing</li></ul><ul><li>Experience with (or wanting to learn) video-editing tools like Adobe Premiere, Final Cut Pro, Photoshop, Illustrator etc. (Video portfolio is a plus)</li></ul><ul><li>Comfortable using online tools like G Suite and social media outlets like Youtube, Instagram, and Twitter.</li></ul><p><b>THE PERKS: </b></p><ul><li>Lead creative on national campaigns, your work will be featured in major publications</li></ul><ul><li>Forbes, golf digest, etc</li></ul><ul><li>Learn the ins-and-outs of running a startup with tremendous potential</li></ul><ul><li>Create videos for email marketing campaigns sent to 500k+ people</li></ul><ul><li>Get real world experience that you can leverage on your resume!</li></ul><ul><li>See the engagement analytics and make data driven decisions</li></ul><ul><li>Receive a $50 weekly stipend, college credit, earn an equity bonus (stock options), and gain relationships in the tech, AI, and sports industry</li></ul><ul><li>Work closely with the company founders: successful serial entrepreneurs who have started numerous companies, raised over $20 million in venture capital, and have 2 successful exits. (check out our founders here: https://youtu.be/r82gufgzltg)</li></ul><p>To apply, please send your resume, sample work and reason(s) why you are a fit</p><p><b>Testimonials from Sparrow’s Intern Classes</b></p><p>* My time at Sparrow has been great! I’ve learned the ins and outs of what it takes to successfully run a business + gained valuable insight from the founders. -Gabriel R., Yale University (Men’s Varsity Golf, Econ)</p><p>*I definitely feel as though I’m honing important skills and experience for when I enter the job market. - Abby E., Pomona College in CA (Women’s Varsity Golf, Psych Major)</p><p>* I loved getting exposure into the fast paced start-up world - my internship with Sparrow was awesome!</p><p>- Rebecca R., Brown University (Women’s Varsity Soccer, Applied Math major)</p><p>** My internship with Sparrow was a valuable one. I worked closely with the co-founders &amp; gained valuable insight into the inner workings of a great startup. - Adam X., Harvard University (Men’s Varsity Golf)</p><p>* I worked with an expert machine learning advisor, got my name on a patent and had an all around amazing experience with Sparrow! Trevor J., University of Michigan (Computer Science Major)</p><p>Job Types: Full-time, Internship</p><p>Pay: $50.00 per week</p><p>Job Types: Full-time, Internship</p><p>Pay: $50.00 per week</p><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Internship Compensation:</p><ul><li>Pay</li><li>College Credit</li></ul><p>Company's website:</p><ul><li>https://www.sparrowup.com</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li></ul></div><div></div>"
    },
    {
        "position": "2021 Summer Software Engineering Internship",
        "company": "Houston Mechatronics Inc. -",
        "location": {
            "city": "Webster",
            "state": "TX"
        },
        "posted": "2021-01-31T07:59:55.801Z",
        "url": "https://www.simplyhired.com/job/IFZM03vxJzVYAhIBqsf_K-zLNI0N7eR8RlH8pAl8NV-Djp74ND3b4Q?q=computer+science",
        "lastScraped": "2021-01-31T07:59:55.801Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Houston Mechatronics, Inc seeking an enthusiastic engineering intern looking to gain some exciting real-world software engineering experience. We are looking for budding roboticists with some prior experience with hardware. For the interview, we expect that you can describe a prior automation or robotics project.\n<br><br>\n<b>FOR CONSIDERATION:</b><br>\nYou must demonstrate a true passion for engineering. Coursework alone is insufficient. The ideal candidate will demonstrate experience that goes beyond the classroom. This could be demonstrated via extracurricular engineering activities or experience on competitive engineering teams which may include organizations such as Formula SAE, Baja SAE, RoboSub, FIRST Robotics, etc.\n<br><br>\nQUALIFICATIONS\n<br><br>\nRequired\n<br><br>\nActively enrolled in a Computer Science, Aerospace Engineering, or other related degree program from an accredited college/university.\n<br>Robotics or hardware automation framework experience\n<br>Hands on experience with of Linux command line\n<br>Fluent in Python\n<br><br>\nPreferred\n<br><br>\nROS\n<br>C++\n<br>Git\n<br><br>\nOther Duties\n<br>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\n<br><br>\nPHYSICAL REQUIREMENTS\n<br><br>\nWhile performing the duties of this job, the employee is regularly required to sit, walk; use hands to finger, handle or feel; reach with hands and arms; and talk or hear.\n<br>The employee will also be frequently required to stand.\n<br>The employee must frequently lift, push, or pull equipment at a minimum of 15 pounds unassisted.\n<br>Specific vision abilities required by this job include close vision, distance vision, color vision and ability to adjust focus.\n<br>Must be able to climb ladders, maneuver in tight spaces, and stand for extended periods\n<br><br>\nWORK ENVIRONMENT\n<br><br>\nThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.\n<br><br>\nIn addition, while performing some duties of this job, the employee may be required to travel domestically and internationally. This role may also require exposure to a variety of construction and/or offshore platform, various bodies of water job sites. The noise level in the work environment and job sites can be loud.\n<br><br>\nThe performance of this position may occasionally require exposure to the manufacturing areas, which may require the use of personal protective equipment such as safety glasses with side shields and mandatory hearing protection.\n<br><br>\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nEEOC STATEMENT\n<br><br>\nHouston Mechatronics, Inc (HMI) is an Equal Opportunity/ Affirmative Action Employer. All qualified applicants will be considered for employment without regard to race, color, religion, age, sex, national origin, immigration status, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n<br><br>\nEXPORT CONTROL\n<br><br>\nIn addition, HMI is a federal contractor required to adhere to the Arms Export Control Act of 1976 which governs the International Traffic in Arms Regulations (ITAR). As a result, this position may include access to export-controlled information that is subject to US export control laws. Export control laws require employers to restrict access to export-controlled information or to obtain export licenses for non-U.S. person employees if their positions require access to information governed by ITAR. The ITAR defines a U.S. person means a person (as defined in §120.14 of this part) who is a lawful permanent resident as defined by 8 U.S.C. 1101(a)(20) or who is a protected individual as defined by 8 U.S.C. 1324b(a)(3) which includes certain temporary residents and refugees and asylees. HMI does not obtain export licenses for these positions.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Intuit - 4.2",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2021-01-31T07:59:56.092Z",
        "url": "https://www.simplyhired.com/job/_b_y0JGBcYIIlc26DiGck1GPDuPs0ILE5Qnk_0Pb0diTfoph1vnIgg?q=computer+science",
        "lastScraped": "2021-01-31T07:59:56.092Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Overview\n<br><br>\n**This position is intended for students in a degree-seeking program, to which they will return at the end of the summer internship in 2021. If you do not meet this minimum criteria, please revisit our careers site for other opportunities.**\n<br><br>\nAt Intuit, we want to invest in the next generation of tech entrepreneurs by bringing them into our organization early and encouraging them to bring their talents back to Intuit after they graduate. Our internship program is focused on identifying these high-potential university students and equipping them with the tools they need to succeed in the tech industry.\n<br><br>\nHear more about the experience previous summer interns had at Intuit:\n<br><br>\nhttps://www.youtube.com/watch?v=sRVteY6_VFs\n<br><br>\nWhat you'll bring\n<br><br>\nThrough our summer internship program, university students gain the confidence to make meaningful work contributions that enable business growth with our products, customers, and internal processes.\n<br><br>\nMust be currently enrolled in a degree seeking program\n<br>BS or MS in Computer Science (or related degree)\n<br>Strong software engineering skills\n<br>Solid understanding of object oriented design and programming languages\n<br><b>Experience with at least one of the following:</b> Java, C#, C++\n<br>Front-end web development skills preferred (D/HTML, JavaScript, XML, Flex, CSS)\n<br>Familiarity or the ability to learn current trends and best practices in front-end architecture, including performance, accessibility and usability\n<br><br>\n<b>Selection Criteria:</b><br>\nCoding Challenge\n<br>Technical Assessment\n<br>Values Fit\n<br>Research and summer work experience\n<br>Leadership positions in group activities\n<br>How you will lead\n<br><br>\nDuring Intuit's summer internship program, interns will interact with our senior leaders, learn directly from our business partners, and leverage our unique business practices all while taking on rigorous assignments. Our interns have opportunities to work in one of the following areas:\n<br><br>\n<b>Software Engineer:</b> Full Stack/Front-End/Back-End/Security/DevOps/Mobile</div><div></div>"
    },
    {
        "position": "Technical Support Intern",
        "company": "SLEEP NUMBER - 3.4",
        "location": {
            "city": "San Jose",
            "state": "CA"
        },
        "posted": "2021-01-31T07:59:56.611Z",
        "url": "https://www.simplyhired.com/job/TbXfPR8y3Y2aOlFc4OijjQCu72LmfJWwDM2oLsr598EnI9zD7lVZ7g?q=computer+science",
        "lastScraped": "2021-01-31T07:59:56.611Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At SN LABS we are improving lives every day by helping people sleep better every night. Learn more about a company that’s championing a health and wellness revolution with quality sleep at its core. The SN LABS Technical Support Intern will have the ability to think and work logically to help diagnose, resolve and/or escalate customer affecting issues.\n<br><br>\n<b>Responsibilities:</b><br>\nField emails and work tickets related to technical issues within the SN LABS Platform that impact Customers in Cloud and Embedded Software and related tools.\n<br>Execute and assist in designing processes designed to relieve/resolve account, order, component, and data-related issues.\n<br>Partner with cross-functional team members in pursuit of quick and highly accurate resolutions to Customer impacting issues.\n<br>Use hands-on experience with Python (preferred), shell and possibly other scripting/coding languages to help in creating solutions.\n<br>Develop software tools for aiding in software development and technical customer support.\n<br>Support the processes used in Sleep Number Labs to build, deploy, and configure both Cloud based application and Embedded Linux IoT devices.\n<br>Document business processes, logic, code, and scripts used in daily activities.\n<br><br>\n<b>Knowledge, Skills &amp; Abilities:</b><br>\nExcellent interpersonal and communications skills required\n<br><br>\nStrong organizational and time management ability required\n<br><br>\nExperience writing code is required\n<br><br>\nExperience with Linux is required\n<br><br>\nStrong analytical and problem-solving skills required\n<br><br>\nFamiliarity with software development processes required, Agile methodology desired\n<br><br>\nKnowledge of RTOS development exposure desired\n<br><br>\nExperience working with hardware, both in debugging and in development is desired\n<br><br>\nKnowledge of cloud computing desired, and preferably in AWS\n<br><br>\n<b>Experience, Education &amp; Certifications:</b><br>\nCurrently pursuing a bachelor's degree from an accredited College/University in Computer Science, Computer Engineering or similar technical field.\n<br>Two years of completed coursework by May 2020\n<br>The ideal candidate will able to learn new concepts, processes, and computer programming/scripting languages quickly\n<br><br>\nEEO Statement\n<br><br>\nSleep Number is an equal opportunity employer, committed to recruiting, hiring and promoting qualified people of all backgrounds, regardless of sex; race; color; creed; national origin; religion; age; marital status; pregnancy; physical, mental, communicative or sensory disability; sexual orientation; gender identity or any other basis protected by federal, state or local law.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "York Telecom Corporation - 2.9",
        "location": {
            "city": "Eatontown",
            "state": "NJ"
        },
        "posted": "2021-01-31T07:59:57.030Z",
        "url": "https://www.simplyhired.com/job/QE1wtApfMvVMI_AM8OOn6yR52fIJmIpMrJTWm-R1XKu5Fot0mM-eUA?q=computer+science",
        "lastScraped": "2021-01-31T07:59:57.030Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">For over 30 years, Yorktel has been the video managed services partner around the world for some of the largest business and government agencies. With over 10,000 video systems under management worldwide – more than any other video communications service provider – Yorktel has the proven expertise and global reach to deliver enterprise-quality visual communications.\n<br><br>\nYorktel is currently seeking a Software Development Intern who will assist Yorktel’s Software Quality Assurance (SQA) Team with automated testing tool development, Product Development, Product Testing, and other related activities. This position explore all the various methods of developing methods for automatic testing of Caregility products. In addition, this position will he will be helping on developing other Caregility products as directed by Product Owners.\n<br><br>\n<b>Roles and Responsibilities:</b><br>\nThis position regularly communicates to Product Owners and SQA Director to achieve a mutually desirable outcome. This position works closely with the Product Owners on Product Development, Product Testing, and related activities. This position is expected to protect all internal and external confidential information and must utilize discretion and judgment based on company policies and procedures.\n<br><br>\nEnumerate description of all possible methods of auto testing tools.\n<br>Analyze, design and develop on viability of automated testing tools.\n<br>Product Development for new and existing Caregility products\n<br>Product testing for new and existing Caregility products\n<br>Some software development for Caregility\n<br><br>\n<b>Skills and Abilities:</b><br>\nStrong Software coding development experience\n<br>Ability to work independently a must\n<br>Must also be able to participate and work well in a team environment·\n<br>Present a professional appearance at all times·\n<br>High levels of Professionalism and Integrity\n<br>Ability to cope with multiple projects\n<br>Good written and oral communications skills\n<br>High ability to work with peers\n<br>Exceptional customer service skills\n<br>Exceptional written, verbal and interpersonal skills.\n<br>Excellent problem solving skills\n<br>Extensive use of business computer systems including Microsoft Office applications such as MS Word, Excel, Outlook and MS Project.\n<br><br>\n<b>Education and Qualifications:</b><br>\nUS High School diploma completed\n<br>Current student or recent graduate studying Computer Science and Engineering\n<br><br>\n<b>Additional Requirements:</b><br>\nMay require occasional lifting (up to 50 lbs)\n<br>Requires extensive sitting, standing and walking\n<br>Domestic travel requiring multi-night stays within and at times outside the local work area\n<br>Valid passport; International travel possible\n<br>Valid U.S. driver’s license\n<br>Must be willing to complete background checks and drug tests as required by current or future contracts\n<br>Must be willing to apply for security clearances, SSA Suitability, and other related clearances to be able to work at certain customer locations.\n<br><br>\nWe conform to all the laws, statutes, and regulations concerning equal employment opportunities and affirmative action. We strongly encourage women, minorities, individuals with disabilities and veterans to apply to all of our job openings. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, Genetic information and testing, family and medical leave, sexual orientation and gender identity or expression, protected veteran status, or any other characteristics protected by law. We prohibit retaliation against individuals who bring forth any complaint, orally or in writing, to the employer or the government, or against any individuals who assist or participate in the investigation of any complaint or otherwise oppose discrimination.</div><div></div>"
    },
    {
        "position": "Systems Engineer (Intern)",
        "company": "General Dynamics Information Technology - 3.8",
        "location": {
            "city": "Baltimore",
            "state": "MD"
        },
        "posted": "2021-01-31T07:59:57.590Z",
        "url": "https://www.simplyhired.com/job/I-lb_ezITCCiD9WCYqCigQeHyJI0ALbDNXgvO4Z0B_MXLjg90V2MgA?q=computer+science",
        "lastScraped": "2021-01-31T07:59:57.590Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Travel Required:</b> None\n<br><b>Public Trust:</b> None\n<br><b>Requisition Type:</b> Regular\n<br>Assist in a variety of IT research, development, and operations tasks; collaborating with team members and contributing to a variety of deliverables.\n<br>Operate in cloud and on-premise hosting environments.\n<br>Apply programming, troubleshooting, and problems solving skills.\n<br>Participate in special projects as required.\n<br>Must be proficient in Microsoft Office (Word, Excel, PowerPoint).\n<br>Comfortable working in both Windows and Linux environments.\n<br>Must have basic proficiency in one or more programming languages (e.g., Python, Scala, Java).\n<br>Must be highly motivated, detail-oriented, and possess strong communications skills.\n<br>Must be currently enrolled in 4-year degree program in computer science, information technololgy, or a related discipline at an accredited college or university.\n<br>Must have at least 1 semester remaining in school after Aug. 2021.\n<br>We are GDIT. The people supporting some of the most complex government, defense, and intelligence projects across the country. We deliver. Bringing the expertise needed to understand and advance critical missions. We transform. Shifting the ways clients invest in, integrate, and innovate technology solutions. We ensure today is safe and tomorrow is smarter. We are there. On the ground, beside our clients, in the lab, and everywhere in between. Offering the technology transformations, strategy, and mission services needed to get the job done.\n<br><br>\nGDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.</div><div></div>"
    },
    {
        "position": "JAVA Developer (Mandarin MUST - Will Train - Relocation Nationwide)",
        "company": "Software.Enterprises -",
        "location": {
            "city": "Jersey City",
            "state": "NJ"
        },
        "posted": "2021-01-26T07:59:58.054Z",
        "url": "https://www.simplyhired.com/job/gdaYltnvgKdu2E1gYO3G54f4e3EcZHbvLLr0UpX-PQh15Rl3SnidWg?q=computer+science",
        "lastScraped": "2021-01-31T07:59:58.054Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>JAVA Developer (Mandarin Speaking MUST - Will Train - Relocation Nationwide)</b></p><p>Software.Enterprises, a subsidiary of Silicon Spectra, is one of the leading providers of Enterprise software solutions, comprehensive IT solutions, including Systems Integration, Consulting, Information Systems outsourcing, IT-enabled services, telecommunication, R&amp;D etc. We specialize in placement of UI Developers, ReactJS, AngularJS, Quality Assurance Analyst, Data Analyst, Software Developers, UX Engineers etc. in fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy and life science, oil and gas, travel and transportation, and local and state government for both permanent and contract C2C staffing arrangements. Our recent placements include Apple, Google, Facebook, JPMC, Wells Fargo and several other fortune 500 companies.</p><p><b>Knowledge and Skills: </b></p><ul><li>Experience with Java (J2SE), server-side Java (Java 8)</li><li>Experience with J2EE technologies for Web Tier and Business Logic Tier (Servlet, JSP, Persistence mechanisms)</li><li>Experience with JavaScript, jQuery or any JavaScript framework a plus</li><li>Experience developing in the Spring Framework; Spring MVC a plus</li><li>Comfortable working with databases such as MySQL or Oracle; NoSQL a plus</li><li>Experience with application server technologies such as JBoss and Tomcat</li><li>Understanding of relational database design and development</li><li>Very familiar with developing &amp; integrating RESTful or SOAP web service API</li><li>Experience developing and integrating Apache CloudStack a plus</li><li>Comfortable working with Enterprise Linux</li><li>Ability to design and run with the execution of a modification of existing code or new application.</li><li>Some experience as a Front End / UI Engineer with jQuery, JavaScript, React, Vue</li><li>Strong knowledge of Object-Oriented Programming with experience in Java</li><li>Knowledge of JSP, J2EE, and JDBC</li><li>Knowledge of Struts, Servlets, Spring, and Hibernate technologies</li><li>Desired to work in a collaborative, innovative, flexible and agile Java Development team-oriented environment</li><li><b>Fluent in Mandarin (Mainland)</b></li></ul><p><b>Education and Qualities: </b></p><ul><li>Bachelors/ Master’s degree in Computer Science or related field</li><li>Strong written and oral communication skills in both English and Mandarin preferred</li><li>Detail oriented, ability to multitask with strong prioritization, planning and organization skills</li><li><b>Willing to relocate and familiar with CCC business framework</b></li></ul><p><b>Benefits: </b></p><ul><li>Lucrative Annual Base Salary</li><li>Full Health Insurance Coverage</li><li><b>Immediate H1B, STEM Ext. or GC Sponsorship</b></li><li>Access to exclusive training &amp; mentorship by Senior Google and Apple engineers</li></ul><p><b>Helpful Info: </b></p><ul><li>Training Location: <b>Milpitas, CA (at the heart of Silicon Valley)</b></li><li>Starting Salary: $60,000</li><li>Placement: <b>Anywhere in US (Must be willing to relocate)</b></li><li>Visa sponsorship is available for qualified employees</li><li>No experience required but better to have</li></ul><p>Job Types: Full-time, Internship</p><p>Pay: $60,000.00 - $75,000.00 per year</p><p>Experience:</p><ul><li>Java: 2 years (Preferred)</li></ul><p>Language:</p><ul><li>Mandarin (Required)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>Yes: H-1B work authorization</li></ul><p>Company's website:</p><ul><li>https://siliconspectra.com/</li></ul><p>Company's Facebook page:</p><ul><li>https://h1bdata.com/pin/silicon-spectra/</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul></div><div></div>"
    },
    {
        "position": "Front-End / UI Developer (Mandarin MUST - Will Train - Nationwide)",
        "company": "Software.Enterprises -",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-01-26T07:59:58.810Z",
        "url": "https://www.simplyhired.com/job/JZIyS-fop1GuwOrFUHQnonFSKCqQGpyeLxapWypamntJt6WwdeqDIg?q=computer+science",
        "lastScraped": "2021-01-31T07:59:58.810Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>About Software.Enterprises: </b></p><p>Software.Enterprises, a subsidiary of Silicon Spectra, is one of the leading providers of Enterprise software solutions, comprehensive IT solutions, including Systems Integration, Consulting, Information Systems outsourcing, IT-enabled services, telecommunication, R&amp;D etc. We specialize in placement of UI Developers, ReactJS, AngularJS, Quality Assurance Analyst, Data Analyst, Software Developers, UX Engineers etc. in fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy and life science, oil and gas, travel and transportation, and local and state government for both permanent and contract C2C staffing arrangements. Our recent placements include Apple, Google, Facebook, JPMC, Wells Fargo and several other fortune 500 companies.</p><p><b>Knowledge and Skills: </b></p><ul><li>Exposed to and/or experienced with several technologies such as: React JS, SASS, JSON, AJAX and Bootstrap</li><li>Provided solid markup skills in utilizing HTML5, CSS3, JavaScript, and jQuery</li><li>Developed front-end skills and some basic understanding of how back-end development works</li><li>Knowledge of designing mark up, developing the UI of websites and/or web applications</li><li>Demonstrated understanding of UX and UI design with an emphasis on maximizing usability</li><li>Knowledge of using REST web services and working with interface design</li><li>Desired to work in a collaborative, innovative, flexible and agile JavaScript Development team-oriented environment</li><li><b>Fluent in Mandarin</b> (Mainland).</li></ul><p><b>Education and Qualities: </b></p><ul><li>Bachelors/ Master’s degree in Computer Science or related field</li><li>Strong written and oral communication skills in both English and Mandarin preferred</li><li>Detail oriented, ability to multitask with strong prioritization, planning and organization skills</li><li><b>Willing to relocate and familiar with CCC business framework</b></li></ul><p><b>Benefits: </b></p><ul><li>Lucrative Annual Base Salary</li><li>Full Health Insurance Coverage</li><li><b>Immediate H1B, STEM Ext. or GC Sponsorship</b></li><li>Access to exclusive training &amp; mentorship by Senior Google and Apple engineers</li></ul><p><b>Helpful Info: </b></p><ul><li>Training Location: <b>Milpitas, CA</b> (at the heart of Silicon Valley)</li><li>Starting Salary: $60,000</li><li>Placement: <b>Anywhere in US (Must be willing to relocate)</b></li><li>Visa sponsorship is available for qualified employees</li><li>No experience required but better to have</li></ul><p>Job Types: Full-time, Internship</p><p>Pay: $60,000.00 - $75,000.00 per year</p><p>Experience:</p><ul><li>JavaScript: 1 year (Preferred)</li></ul><p>Language:</p><ul><li>Mandarin (Required)</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>Yes: H-1B work authorization</li><li>Yes: Other non-immigrant work authorization (e.g. L-1, TN, E-3, O-1, etc.)</li><li>Yes: Immigrant visa sponsorship (e.g., green card sponsorship)</li></ul><p>Company's website:</p><ul><li>https://siliconspectra.com/</li></ul><p>Company's Facebook page:</p><ul><li>https://h1bdata.com/pin/silicon-spectra/</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Personal protective equipment provided or required</li><li>Temperature screenings</li><li>Social distancing guidelines in place</li><li>Virtual meetings</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>"
    },
    {
        "position": "Summer 2021 Intern, Electronics Software Development and Testing - Undergraduate or Masters",
        "company": "ANSYS - 3.7",
        "location": {
            "city": "Ohio",
            "state": "Ohio"
        },
        "posted": "2021-01-31T08:00:01.505Z",
        "url": "https://www.simplyhired.com/job/I0LYz89ypb-hLLz3HaRVuxphL1oLTgdthMpMs-Y07vYMfH94pcL2ng?q=computer+science",
        "lastScraped": "2021-01-31T08:00:01.505Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Ansys is the global leader in engineering simulation, helping the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, Ansys helps companies solve the most complex design challenges and engineer products limited only by imagination.\n<br><br>\nAs an Development Operations Intern, you will join a team responsible for the Design, Development and Improvement of SDLC in Ansys.\n<br><br>\nThis is a 40-hour per week paid position, starting May 2021 and concluding August 2021. This position is remote.\n<br><br>\nRESPONSIBILITIES\n<br><br>\nImprove Development Operations Workflow.\n<br>Implement Continuous Integration Flow using TFS\n<br>Thirdparty package management using Conan and TFS\n<br>Design and develop Python scripts for process improvements.\n<br><br>\nMINIMUM QUALIFICATIONS\n<br><br>\nPursuing BS or MS in electrical engineering, computer science, computational electromagnetics, numerical methods, circuit simulation, device modeling or related technical field.\n<br>Python programming skills is a must. Equivalent programming language such as Java or C++ is acceptable.\n<br>Currently enrolled in a full-time degree program and maintain a GPA of 3.0 or higher.\n<br>Sharp and tenacious problem-solving skills.\n<br>Experience with software development is a plus.\n<br>Excellent communication skills in written and spoken English.\n<br><br>\nCULTURE AND VALUES\n<br>Culture and values are incredibly important to Ansys. They inform us of who we are, of how we act. Values aren't posters hanging on a wall or about trite or glib slogans. They aren't about rules and regulations. They can't just be handed down the organization. They are shared beliefs - guideposts that we all follow when we're facing a challenge or a decision. Our values tell us how we live our lives; how we approach our jobs. Our values are crucial for fostering a culture of winning for our company:\n<br><br>\nCustomer focus\n<br>Results and Accountability\n<br>Innovation\n<br>Transparency and Integrity\n<br>Mastery\n<br>Inclusiveness\n<br>Sense of urgency\n<br>Collaboration and Teamwork\n<br><br>\nWORKING AT ANSYS\n<br>At Ansys, you will find yourself among the sharpest minds and most visionary of leaders, collectively aiming to change the world with innovative technology and remarkable solutions. With the prestigious reputation in servicing well-known, world-class companies, standards at Ansys are high, met by those willing to rise to the occasion and meet those challenges head-on. Because at Ansys, it's about the learning, the discovery and the collaboration. It's about the \"what's next\" as much as the \"mission accomplished\". It's about the melding of disciplined intellect with strategic direction and results that have, can and will impact real people in real ways, forged within a working environment built on respect, autonomy and ethics.\n<br><br>\nAt Ansys, you will find yourself among those eager to drive the world towards the next best thing with hands planted firmly on the wheel.\n<br>Our team is passionate about pushing the limits of world-class simulation technology so our customers can turn their design concepts into successful, innovative products faster and at lower cost. As a measure of our success in attaining these goals, Ansys has been recognized as one of the world's most innovative companies by prestigious publications such as Bloomberg Businessweek and FORTUNE magazines.\n<br><br>\nAnsys is an S&amp;P 500 company and a component of the NASDAQ-100.\n<br><br>\nFor more information, please visit us at www.ansys.com\n<br><br>\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n<br><br>\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.\n<br><br>\n<b>Nearest Major Market:</b> Columbus</div><div></div>"
    },
    {
        "position": "Error",
        "company": "Hunt, Guillot & Associates - 4.0",
        "location": {
            "city": "Ruston",
            "state": "LA"
        },
        "posted": "2021-01-26T08:00:01.762Z",
        "url": "https://www.simplyhired.com/job/WDaJNbQ7fKkNHHU8TpktDGkPx1Dfo_Db_vDhpGRwBYUYYPmYoPrWgA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:01.762Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The IT Support position is a internship position working for HGA at the headquarters office in Ruston, LA.\n<br><br>\nThe IT Support position will be responsible for IT Support, primarily help desk/desktop support.\n<br><br>\nExcellent phone and desk side customer service skills\n<br>A base understanding of TCP/IP networking\n<br>Familiarity with network printing and scanning\n<br>Provides wireless phone support\n<br>A good understanding of hardware and software troubleshooting\n<br>Assists with special projects\n<br><br>\n<b>Soft Skills:</b><br>\nCollaborative\n<br>Customer service oriented\n<br>Personable\n<br>Must be able to work as part of a team\n<br><br>\n<b>Technologies Supported:</b><br>\nHP desktops, custom desktops, HP laptops, Acronis, Lifesize video conferencing, Toshiba VOIP, Windows 7, Office 2010/2013, Xerox Copiers, Apple iPhone &amp; iPad, TCP/IP Networking, Active Directory, Microsoft Exchange\n<br><br>\n<b>IT Support Experience Requirements:</b><br>\nMust have solid customer service skills\n<br>Must feel comfortable working independently and part of a team\n<br>Candidates should be pursuing Cyber Engineering or Computer Science degree; CIS degree will be considered with GPA 3.0 or higher\n<br>Candidates must be located within daily commuting distance of Ruston, LA</div><div></div>"
    },
    {
        "position": "Full Time Front End Software Developer",
        "company": "UrgentCare2go -",
        "location": {
            "city": "Farmers Branch",
            "state": "TX"
        },
        "posted": "2021-01-27T08:00:02.178Z",
        "url": "https://www.simplyhired.com/job/mlAJIREETdE1w21XHHh9jQUjOGj75CKj-d2FnaOeS7vnVM7Lv9oTPw?q=computer+science",
        "lastScraped": "2021-01-31T08:00:02.178Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>We are looking for a qualified Front-end developer to join our IT team. You will be responsible for building the ‘client-side’ of our web applications. You should be able to translate our company and customer needs into functional and appealing interactive applications. If you’re interested in creating a user-friendly environment by writing code and moving forward in your career, then this job is for you. We expect you to be a tech-savvy professional, who is curious about new digital technologies and aspires to combine usability with visual design. Ultimately, you should be able to create a functional and attractive digital environment for our company, ensuring great user experience.</p><p>Looking for individuals with 2+ years experience. Must work onsite, this is not a remote position.</p><p>Internship positions available as well.</p><p><b>Responsibilities</b></p><ul><li>Use markup languages like HTML to create user-friendly web pages</li><li>Maintain and improve website</li><li>Optimize applications for maximum speed</li><li>Design mobile-based features</li><li>Collaborate with back-end developers and web designers to improve usability</li><li>Get feedback from, and build solutions for, users and customers</li><li>Write functional requirement documents and guides</li><li>Create quality mockups and prototypes</li><li>Help back-end developers with coding and troubleshooting</li><li>Ensure high quality graphic standards and brand consistency</li><li>Stay up-to-date on emerging technologies</li></ul><p><b>Skills</b></p><ul><li>Proven work experience as a Front-end developer</li><li>Hands on experience with markup languages</li><li>Experience with JavaScript, CSS and jQuery</li><li>Familiarity with browser testing and debugging</li><li>In-depth understanding of the entire web development process (design, development and deployment)</li><li>Understanding of layout aesthetics</li><li>Knowledge of SEO principles</li><li>Familiarity with software like Adobe Suite, Photoshop and content management systems</li><li>An ability to perform well in a fast-paced environment</li><li>Excellent analytical and multitasking skills</li><li>BSc degree in Computer Science or relevant field</li></ul><p>Job Types: Full-time, Internship, Contract</p><p>Pay: $40,000.00 - $60,000.00 per year</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Experience:</p><ul><li>Front-End Development: 2 years (Preferred)</li></ul><p>Education:</p><ul><li>Master's (Preferred)</li></ul><p>Work authorization:</p><ul><li>United States (Preferred)</li></ul><p>Full Time Opportunity:</p><ul><li>Yes</li></ul><p>Work Location:</p><ul><li>One location</li></ul><p>Company's website:</p><ul><li>UrgentCare2go.com</li></ul><p>Benefit Conditions:</p><ul><li>Only full-time employees eligible</li></ul><p>Work Remotely:</p><ul><li>No</li></ul></div><div></div>"
    },
    {
        "position": "Social Media Intern",
        "company": "Celeb Luxury, LLC -",
        "location": {
            "city": "Davie",
            "state": "FL"
        },
        "posted": "2021-01-30T08:00:02.614Z",
        "url": "https://www.simplyhired.com/job/6HuUESPs2MfxQZ1JOgHxvbdnkSA2vr5O51EE60M-mCC8lfV6yiEc9Q?q=computer+science",
        "lastScraped": "2021-01-31T08:00:02.614Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Celeb Luxury is one of the fastest growing luxury professional hair color care product companies with unique brands that are first-to-market and category leaders.</p><p><b>Social Media Intern Job Description </b></p><p>We are looking for a dynamic Social Media Intern to be responsible for designing original content and editing videos for our website, amazon and our social media platforms including but not limited to Facebook, Instagram, Youtube and TikTok. The responsibilities of the Social Media Intern include designing graphic material and editing videos with the goal of attracting consumers via social media.</p><p>To be successful as a Social Media Intern, you should be highly motivated, creative, flexible and possess solid knowledge of Adobe Suite. Ultimately, a top-notch Social Media Intern should be computer literate (Mac OS preferred), phone attentive, up to date on various editing apps &amp; highly organized. This is NOT a remote position and those seeking remote work need not apply. Must be located in the Greater Fort Lauderdale area.</p><p><b>Social Media Intern Responsibilities: </b></p><ul><li>Producing and scheduling content to be posted online.</li><li>Design &amp; create email marketing campaigns.</li><li>Assisting with creating posts to attract customers.</li></ul><p><b>Social Media Intern Requirements: </b></p><ul><li>Must have or be working towards a Degree in Graphic Design, Marketing, or Computer Sciences.</li><li>Good communication skills.</li><li>Creativity and Graphic Design skills.</li><li>Proficiency in Marketing disciplines.</li><li>Must be self-motivated.</li><li>Be able to produce original ideas.</li></ul><p>Job Types: Part-time, Internship</p><p>Pay: Up to $25,000.00 per year</p><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li><li>On call</li></ul><p>Experience:</p><ul><li>Google Analytics: 1 year (Preferred)</li><li>Google AdWords: 1 year (Preferred)</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>Company's website:</p><ul><li>www.celebluxury.com</li></ul><p>Work Remotely:</p><ul><li>No</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li></ul></div><div></div>"
    },
    {
        "position": "Summer 2021 Intern - Part Library Automation",
        "company": "ANSYS - 3.7",
        "location": {
            "city": "Beltsville",
            "state": "MD"
        },
        "posted": "2021-01-31T08:00:02.969Z",
        "url": "https://www.simplyhired.com/job/JRrAilRxEIsx_NEmfgMzRRVGUATRh3lZVjuoxunr6bv_qJN5nHCPrw?q=computer+science",
        "lastScraped": "2021-01-31T08:00:02.969Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Ansys is the global leader in engineering simulation, helping the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, Ansys helps companies solve the most complex design challenges and engineer products limited only by imagination.\n<br><br>\nAnsys Sherlock is an engineering simulation tool that allows designers of electronic products to assess and fine-tune product reliability under real-life operating conditions, well before any hardware is built or testing is conducted. One of the most used features of the Sherlock tool is the built-in part library, which defines detailed dimensional, electrical, and material characteristics for hundreds of thousands of electronic parts. This extensive library allows users Sherlock to rapidly model electronic assemblies and is a defining feature of the tool.\n<br><br>\nAnsys is seeking an intern to help extend previous work that applies image analysis, machine learning (ML), and artificial intelligence (AI) techniques to help automate the creation of parts in the part library. A proof of concept has demonstrated the promise of ML/AI techniques for this task but the work needs to be integrated into a complete workflow that can be used by our staff of part librarians to build and manage the part library more efficiently.\n<br><br>\nRESPONSIBILITES\n<br><br>\nWorking in conjunction with the Ansys ML/AI team, the intern will apply software engineering, image analysis, and ML/AI techniques to create a software tool for the Ansys part library team. This tool will be used to automatically collect and analyze data from part manufacturers, extract the part parameters of interest, and append the data within the Sherlock part library.\n<br><br>\nThis is a 40-hour per week paid position, starting May 2021 and concluding August 2021. This position is available for remote work from a US location.\n<br><br>\nMINIMUM QUALIFICATIONS\n<br><br>\nMust be a Junior or Senior in Computer Science or a related major, currently enrolled in a full-time degree program and maintaining a GPA of 3.0 or higher.\n<br>Significant experience coding in Java and Python, including the development of web crawlers, interfacing with APIs\n<br>Experience wih solution of novel software engineering problems\n<br>Excellent written and verbal communication\n<br>Team player, responsible, and motivated\n<br><br>\nPREFERRED QUALIFICATIONS\n<br><br>\nAdditional experience applying machine learning and artificial intelligence algorithms, TensorFlow, and Tesseract to the solution of data extraction problems is a plus.\n<br><br>\nCULTURE AND VALUES\n<br>Culture and values are incredibly important to Ansys. They inform us of who we are, of how we act. Values aren't posters hanging on a wall or about trite or glib slogans. They aren't about rules and regulations. They can't just be handed down the organization. They are shared beliefs - guideposts that we all follow when we're facing a challenge or a decision. Our values tell us how we live our lives; how we approach our jobs. Our values are crucial for fostering a culture of winning for our company:\n<br><br>\nCustomer focus\n<br>Results and Accountability\n<br>Innovation\n<br>Transparency and Integrity\n<br>Mastery\n<br>Inclusiveness\n<br>Sense of urgency\n<br>Collaboration and Teamwork\n<br><br>\nWORKING AT ANSYS\n<br>At Ansys, you will find yourself among the sharpest minds and most visionary of leaders, collectively aiming to change the world with innovative technology and remarkable solutions. With the prestigious reputation in servicing well-known, world-class companies, standards at Ansys are high, met by those willing to rise to the occasion and meet those challenges head-on. Because at Ansys, it's about the learning, the discovery and the collaboration. It's about the \"what's next\" as much as the \"mission accomplished\". It's about the melding of disciplined intellect with strategic direction and results that have, can and will impact real people in real ways, forged within a working environment built on respect, autonomy and ethics.\n<br><br>\nAt Ansys, you will find yourself among those eager to drive the world towards the next best thing with hands planted firmly on the wheel.\n<br>Our team is passionate about pushing the limits of world-class simulation technology so our customers can turn their design concepts into successful, innovative products faster and at lower cost. As a measure of our success in attaining these goals, Ansys has been recognized as one of the world's most innovative companies by prestigious publications such as Bloomberg Businessweek and FORTUNE magazines.\n<br><br>\nAnsys is an S&amp;P 500 company and a component of the NASDAQ-100.\n<br><br>\nFor more information, please visit us at www.ansys.com\n<br><br>\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n<br><br>\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.</div><div></div>"
    },
    {
        "position": "Coding and Gaming Tutor",
        "company": "Code Ninjas Newport Beach -",
        "location": {
            "city": "Costa Mesa",
            "state": "CA"
        },
        "posted": "2021-01-31T08:00:03.242Z",
        "url": "https://www.simplyhired.com/job/0SCm9pjpMf_JQgRs8bOCr_Ch9CE2rTn6zuHL3DQyRcrHrei-4DDxhQ?q=computer+science",
        "lastScraped": "2021-01-31T08:00:03.242Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Position: Coding &amp; Gaming Tutor</b></p><p>Part Time | Weekdays After-school | Saturdays/Weekday availability preferred</p><p><b>Who are we?</b></p><p>Code Ninjas is the nation’s fastest growing kids’ technology education franchise. In our center, kids ages 5-14 explore coding and technology in a fun, engaging and non-intimidating way – by playing, learning and building video games they love. They gain confidence and new skills including coding, math, logic, critical thinking and problem-solving, as they progress through our curriculum. Our core promise is: Kids have fun, parents see results. We believe in these words so much that it’s written on the walls in our center.</p><p><b>What are we looking for? </b></p><p>We are looking for an outgoing, creative, and dependable Code Sensei (<b>Coding &amp; Gaming Tutor)</b> to join our team of dynamic, energetic, forward-thinking minds, working toward our common goal: providing a fun and safe learning environment for children. Our senseis are the lifeblood of our Code Ninjas center. These individuals oversee the day-to-day coaching and student engagement.</p><ul><li>Are you experienced in working with children?</li><li>Do you enjoy teaching and building problem-solving skills?</li><li>Do you like technology, computer science, coding, and video games?</li><li>Have you mentored youth?</li><li>Do you want to be part of a quickly growing business?</li></ul><p>If you answered yes, this might be the job for you.</p><p><b>Responsibilities include (but not limited to): </b></p><ul><li>Training – go through the coding curriculum and learn it</li><li>Content development - we have a set curriculum but our senseis are awesome at growing it and supporting our ninjas!</li><li>Create a positive and safe environment in which students can grow</li><li>Work with children and provide feedback to parents</li><li>Support ninjas online through various virtual camps</li><li>Follow opening/closing duties daily</li><li>Clean dojo throughout the day to ensure cleanliness is kept up to corporate standards</li><li>Report daily/weekly to Center Director on activities and productivity in the dojo</li></ul><p><b>Qualifications: </b></p><ul><li>Available for afternoons on Monday - Friday</li><li>Ideal candidate: College students studying computer science or engineering with a strong background working with youth</li><li>Experience working, teaching, mentoring or child care with children ages 5 and up</li><li>Experience working with the general public</li><li>Works well with others; collaborates</li><li>Knowledgeable about coding and technology; or able to quickly pick up basic concepts</li><li>Must be fun to work with and like working in fast-paced environments where requirements can change frequently</li><li>Preferred: comfortable working remotely over zoom with kids</li><li>Preferred: familiar with Roblox Studios, Python, and/or Scratch</li></ul><p><b>Soft Skills</b></p><ul><li>Detailed-oriented -- quality and precision-focused</li><li>People-oriented -- supportive and fairness-focused</li><li>Team-oriented -- cooperative and collaborative</li></ul><p><b>Perks</b></p><ul><li>Build your resume for a career after graduation</li><li>Play with the latest tech toys</li><li>Surrounded by like-minded peers</li></ul><p><b>Check out Code Ninjas Newport Beach </b><i>http://www.codeninjas.com/ca-newport-beach</i></p><p><b>How to apply: </b></p><p>Application form: <i>http://bit.ly/Code-Ninjas-Sensei-Application</i></p><p>If you have your resume and cover letter, please send them via Indeed.com</p><p><b>Location: 1835 Newport Beach Blvd Suite D-252/254, Costa Mesa, CA 92627</b></p><p>Job Types: Part-time, Internship</p><p>Pay: $13.00 - $15.00 per hour</p><p>Benefits:</p><ul><li>Referral program</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li><li>Weekends</li></ul><p>COVID-19 considerations:<br>To keep our staff as safe as possible, we've installed four hospital-grade air filters and provided masks, face shields, gloves, and hand sanitizers. Staff also use a second monitor to provide support to students to ensure safe social distancing.</p><p>Work Location:</p><ul><li>One location</li></ul><p>Internship Compensation:</p><ul><li>Pay</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>People-oriented -- supportive and fairness-focused</li><li>Team-oriented -- cooperative and collaborative</li></ul><p>This Job Is:</p><ul><li>Open to applicants under 18 years old, provided it is legally allowed for the job and location</li><li>A “Fair Chance” job (you or the employer follow Fair Chance hiring practices when performing background checks)</li></ul><p>Company's website:</p><ul><li>https://www.codeninjas.com/ca-newport-beach</li></ul><p>Company's Facebook page:</p><ul><li>https://www.facebook.com/CodeNinjasNewportBeach</li></ul><p>Work Remotely:</p><ul><li>No</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Personal protective equipment provided or required</li><li>Temperature screenings</li><li>Social distancing guidelines in place</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>"
    },
    {
        "position": "Software Engineering Internship",
        "company": "LOCKHEED MARTIN CORPORATION - 4.0",
        "location": {
            "city": "Huntsville",
            "state": "AL"
        },
        "posted": "2021-01-30T08:00:03.614Z",
        "url": "https://www.simplyhired.com/job/JS1ocjSLGt-67vCJXRhbMmvdnYYq2ifRf-2zao8kpcuGw7Spa_JH1g?q=computer+science",
        "lastScraped": "2021-01-31T08:00:03.614Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Lockheed Martin Rotary and Mission Systems (RMS) is looking for an Energetic student pursuing an Computer Science, Software Engineering, Computer Engineering, or similar degree for a 2021 Summer Internship.\n<br>The selected candidate will be learning and working with Software and System Engineers supporting the MASC-F program for the Missile Defense Agency.\n<br>Some of the duties and responsibilities include\n<br><br>\n<b>but are not limited to:</b><br>\n<ul><li>Working with experienced software and</li></ul>\nhardware engineering professionals\n<br><ul><li>Collaborate to design, build, test, and</li></ul>\nintegrate software\n<br><ul><li>Learn about Agile Development implemented</li></ul>\nusing scrum\n<br><br>\n<b>Basic Qualifications:</b><br>\n<ul><li>Must Be Eligible to Obtain A Security Clearance at the Secret level</li><li>Pursuing degree in software related field (CS, SW Engineering, Computer Engineering), or engineering degree with minor in software related field</li><li>Some working knowledge of any</li></ul>\nProgramming language or tools such as\n<br>JAVA / C / C++\n<br><ul><li>Must be able to communicate a complex</li></ul>\nproblem\n<br><ul><li>Must be able to work in a telecommuting role for the summer (laptop would be provided, need internet connection, etc.)</li><li>Highly Motivated , able to perform team tasks with low direct supervision while utilizing virtual collaboration tools to interact with team</li></ul>\n<b>Desired Skills:</b><br>\n<ul><li>Able to work in a virtual team environment</li><li>Strong problem solving skills</li><li>Experience with Git</li><li>Java/C++/Go/NodeJs/ReactJS/Mongo</li><li>Tools - Gitlab/Bitbucket/Docker or interest in learning</li><li>Test Automation or interest</li><li>DevOps Interest</li><li>Cyber Interest</li></ul>\n<b>BASIC QUALIFICATIONS:</b><br>\njob.Qualifications\n<br><br>\nLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.\n<br><br>\nAs a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\n<b>EXPERIENCE LEVEL:</b><br>\nCo-op/Summer Intern</div><div></div>"
    },
    {
        "position": "Internship Opportunities - Software Engineer",
        "company": "Meltwater - 3.6",
        "location": {
            "city": "Indiana",
            "state": "Indiana"
        },
        "posted": "2021-01-30T08:00:04.040Z",
        "url": "https://www.simplyhired.com/job/TPmh_HcCJXfyXpHO3stU860kLFiokKuB-IErsH1T6dBFp6S7Pryc3g?q=computer+science",
        "lastScraped": "2021-01-31T08:00:04.040Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Meltwater is looking to hire self-starting, fast learning individuals who are passionate about software to join our teams that are mostly based in Manchester, NH. Opportunities exist for intern positions to work remotely within our software engineering organization. We offer experience across the full stack, from front-end JavaScript frameworks and knowledge of web browsers to ops-level monitoring and troubleshooting.\n<br><br>\nThe ideal candidate will have a strong desire to learn with no fear of experimenting and a willingness to be mentored. Your day to day will be jam-packed with opportunities to gain exciting real-world software engineering experience at a fast-paced, agile software development company.\n<br><br>\nHere is a subset of the technologies and disciplines we use every day.\n<br><br>\nNodeJS\n<br>NPM\n<br>Databases (Mongo, MySQL, DynamoDB)\n<br>Micro Processes / MQ (Rabbit, SQS)\n<br>Continuous Integration (CircleCI, Travis CI, Drone CI)\n<br>AWS / Docker / Serverless (Lambda, Elastic Beanstalk, Kubernetes)\n<br>Source control (GitHub)\n<br>Angular/React (cross-browser compatibility, material design, component-driven architecture, framework-agnostic design)\n<br>Agile Development processes\n<br><br>\nREQUIREMENTS\n<br><br>\nComputer Science or Engineering major preferred\n<br>Excellent analytical skills\n<br>Ability to work in teams\n<br>Experience programming in Javascript a plus\n<br><br>\nWHAT YOU CAN EXPECT FROM US\n<br><br>\nWe have an amazing culture and live our core values every day. You will have the opportunity to work alongside exceptional people who want to succeed together.\n<br>Challenging problems to solve in collaboration with other international teams\n<br>Access to the tools you need to solve those challenging problems\n<br>The opportunity to attend training allowing you to level up your skills\n<br>Engineering mentors to guide you along the way\n<br><br>\nMeltwater truly believes that people with different backgrounds and perspectives will make our environment better and raise the quality of our products. We’re actively working to build a diverse and inclusive workplace and encourage everyone to join us in our journey!\n<br><br>\nGREAT PLACE TO WORK\n<br><br>\nCompetitive Salary\n<br><br>\nFresh fruits &amp; free drinks\n<br><br>\nInternal hackathons\n<br><br>\nPersonal Branding Support\n<br><br>\nErgonomic desks and chairs\n<br><br>\nGreat hardware\n<br><br>\nOpportunities to travel in Europe and the U.S.\n<br><br>\nOpen Source Contributions\n<br><br>\nConferences and Tech Talks\n<br>I'm interested\n<br><br>\nMeltwater is looking to hire self-starting, fast learning individuals who are passionate about software to join our teams that are mostly based in Manchester, NH. Opportunities exist for intern positions to work remotely within our software engineering organization. We offer experience across the full stack, from front-end JavaScript frameworks and knowledge of web browsers to ops-level monitoring and troubleshooting.\n<br><br>\nThe ideal candidate will have a strong desire to learn with no fear of experimenting and a willingness to be mentored. Your day to day will be jam-packed with opportunities to gain exciting real-world software engineering experience at a fast-paced, agile software development company.\n<br><br>\nHere is a subset of the technologies and disciplines we use every day.\n<br><br>\nNodeJS\n<br>NPM\n<br>Databases (Mongo, MySQL, DynamoDB)\n<br>Micro Processes / MQ (Rabbit, SQS)\n<br>Continuous Integration (CircleCI, Travis CI, Drone CI)\n<br>AWS / Docker / Serverless (Lambda, Elastic Beanstalk, Kubernetes)\n<br>Source control (GitHub)\n<br>Angular/React (cross-browser compatibility, material design, component-driven architecture, framework-agnostic design)\n<br>Agile Development processes\n<br><br>\nREQUIREMENTS\n<br><br>\nComputer Science or Engineering major preferred\n<br>Excellent analytical skills\n<br>Ability to work in teams\n<br>Experience programming in Javascript a plus\n<br><br>\nWHAT YOU CAN EXPECT FROM US\n<br><br>\nWe have an amazing culture and live our core values every day. You will have the opportunity to work alongside exceptional people who want to succeed together.\n<br>Challenging problems to solve in collaboration with other international teams\n<br>Access to the tools you need to solve those challenging problems\n<br>The opportunity to attend training allowing you to level up your skills\n<br>Engineering mentors to guide you along the way\n<br><br>\nMeltwater truly believes that people with different backgrounds and perspectives will make our environment better and raise the quality of our products. We’re actively working to build a diverse and inclusive workplace and encourage everyone to join us in our journey!\n<br><br>\nGREAT PLACE TO WORK\n<br><br>\nCompetitive Salary\n<br><br>\nFresh fruits &amp; free drinks\n<br><br>\nInternal hackathons\n<br><br>\nPersonal Branding Support\n<br><br>\nErgonomic desks and chairs\n<br><br>\nGreat hardware\n<br><br>\nOpportunities to travel in Europe and the U.S.\n<br><br>\nOpen Source Contributions\n<br><br>\nConferences and Tech Talks\n<br><br>\nABOUT THE COMPANY\n<br><br>\nMeltwater, a pioneer of media intelligence and now Outside Insight, gives businesses the information advantage they need to stay ahead. More than 26,000 companies have used Meltwater’s media intelligence to stay on top of billions of online conversations and extract relevant insights to strategically manage their brands. Meltwater is dedicated to personal, global service built on the local expertise of 55 offices across six continents. Meltwater is also committed to fostering the data science ecosystem through MEST, a pan-African entrepreneurial program and incubator, and Shack15, a global data science community. Learn more at meltwater.com.\n<br><br>\nAll of our solutions are fully web-based, offered as a service, and based on a modern technology stack. This is your opportunity to be part of a small agile team within a big multinational organization!\n<br><br>\nWe are more than 1500 people across the globe, so there is a lot going on. We believe in diversity and inclusion, and building teams with a wide variety of backgrounds and perspectives. This approach not only raises the quality of our products for our customers, but makes collaboration along the way much more fun.\n<br><br>\nRead our underthehood blog to see which problems our engineers are solving. Also have a look at what life is like at Meltwater and visit our company profiles on LinkedIn, Xing, Facebook, and Twitter.\n<br><br>\nRuth Liew | Hiring Manager\n<br><br>\nSend e-mail\n<br>I'm interested\n<br>Meltwater Product &amp; Engineering\n<br><br>\nEST/CST timezone locations in the US\n<br>Visit website</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "ViaSat - 3.8",
        "location": {
            "city": "Carlsbad",
            "state": "CA"
        },
        "posted": "2021-01-30T08:00:04.320Z",
        "url": "https://www.simplyhired.com/job/gA4x2KvYC9NCF99o3uV8PYRuvxGgTFEPRugF_oVbDkSb-U0eeQitDg?q=computer+science",
        "lastScraped": "2021-01-31T08:00:04.320Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Bigger challenges. Bolder ideas. Global impact. At Viasat, we're on a mission to deliver connections with the capacity to change the world. We're the company behind the world's fastest satellite internet service, with technology that's helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide.\n<br><br>\nWe're looking for passionate, innovative professionals to join our team and connect the world to more. You'll work in a collaborative and inclusive environment that values diverse perspectives and continuous learning, and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world's first truly global Internet Service Provider. Interested in joining our mission? Take a look at career opportunities at Viasat today.\n<br><br>\nJob Responsibilities\n<br><br>\nOur team is working on solutions that help connect our employees to one another, and to the data and information that means the most to them. As a member of our Compass Team, you’ll build a breadth of knowledge including software development, cloud and container orchestration, along with monitoring and solutions to support an AI/ML driven web based solution our employees will use to connect to all areas of the business. You will design, develop, deploy, and support systems across multiple platform areas and disciplines, work with our data scientists to develop graph databases and to build algorithms that help refine our search capabilities, and identify key relationships between people and data that truly improve our employees productivity!\n<br><br>\nOur ideal candidate values curiosity, learning, and adaptability. They also love solving tough problems and challenges through creative development and automation. This team has a heavy focus in providing an amazing user experience through a customized front end. Having a customer centric view, and desire to provide a solution your customers will love is a large part to this team. In this position you will be a key member of the team providing platform services to the company, you will directly impact all of Viasat by exposing important relationships and data to its employees they didn’t know they needed. Your responsibilities will range from designing large scale services that handle lifecycle management of applications (orchestration, containers, functions, etc.), to creating services and APIs, integrating cloud services, and evaluating and improving open-source software and working with our ML based databases to bring value to the data we already have.\n<br><br>\nJob Responsibilities\n<br><br>\nFlexibility to work among different project teams dedicated to:\n<br><br>\nSystem infrastructure development; scripting, automation, data visualization &amp; dashboarding\n<br>Network function virtualization, orchestration\n<br>Virtualized networking and service chaining\n<br>Data analytics &amp; cloud application engineering\n<br>Distributed enterprise software applications\n<br>Cybersecurity software &amp; systems engineering\n<br>Web &amp; mobile application engineering\n<br>Requirements\n<br><br>\nCurrently pursuing a Bachelor's degree or higher in Computer Science, Computer Engineering, Math &amp; Computer Science, and/or a related field\n<br>Previous experience or exposure to Cloud Technology, Automation, Full Stack, Apps, and/or Front-end\n<br>Experience using Python, Java, Linux, and/or C/C++\n<br>Ability to commit to a 10-12 week summer internship\n<br><br>\nPreferences\n<br><br>\nPrevious internship experience in software development and/or test related areas\n<br>Courses or experience related to Machine Learning, Big Data, and Embedded\n<br><b>Knowledge/Experience with deployment tools like:</b> Amazon Web Services, Git, Artifactory, Jenkins, Puppet, CHEF, CF Engine, Ansible, Docker\n<br>Viasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic.</div><div></div>"
    },
    {
        "position": "Business Analyst (Software Solutions)",
        "company": "V Group Inc. -",
        "location": {
            "city": "Cranbury",
            "state": "NJ"
        },
        "posted": "2021-01-25T08:00:04.670Z",
        "url": "https://www.simplyhired.com/job/Zx0irNqANgwp74FiruoxGojN7THkud72PiE3H6ZdXtIBShdJYlqt-w?q=computer+science",
        "lastScraped": "2021-01-31T08:00:04.670Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>NOTE</b>: This job role is for fresh graduates and for individuals who are interested to gain more work experience in United States.</p><p><b>NOTE</b>: This job requirement is for an internal project not client assignment.</p><p><b>For international Applicants</b>: Based on the performance, there is a possibility for H1B Visa Status.</p><p>JOB ROLE:</p><p>We are hiring a Business Analyst to join our project team. You will work alongside other business analysts and report directly to the project manager. Your main tasks will include performing detailed requirements analysis, documenting processes, and performing some user acceptance testing. To succeed in this role you should have a natural analytical way of thinking and be able to explain difficult concepts to non-technical users.</p><p>RESPONSIBILITIES:</p><ul><li>Analyse, specify and validate the business needs of stakeholders, be they customers or end-users.</li><li>Collaborate with customers to determine project scope and vision.</li><li>Conduct interviews to gather customer requirements via workshops, questionnaires, surveys, site visits, workflow storyboards, use cases, scenarios, and other methods.</li><li>Identify and establish scope and parameters of requirements analysis on a project-by-project basis to define project impact, outcome criteria, and metrics.</li><li>Work with stakeholders and project team to prioritize collected requirements.</li><li>Research, review and analyze the effectiveness and efficiency of existing requirements-gathering processes and develop strategies for enhancing or further leveraging these processes.</li><li>Requirements analysis (different methodologies and notations usage - prototyping, surveys, brainstorming, existing documentation analysis and competitors);</li><li>Assist in conducting research to meet agreed-upon requirements and to support development efforts.</li><li>Participate in the QA of activities to ensure features and functions have been enabled and optimized.</li><li>Participate in the selection of any requirements documentation software solutions that the organization may opt to use.</li><li>Analyse and verify requirements for completeness, consistency, comprehensibility, feasibility, and conformity to standards.</li><li>Develop and utilize standard templates to accurately and concisely write requirements specifications.</li><li>Translate conceptual customer requirements into functional requirements in a clear manner that is comprehensible to developers/project team.</li><li>Create process models, specifications, diagrams, and charts to provide direction to developers and/or the project team.</li><li>Assist with the interpretation of customer requirements into feasible options, and communicating these back to the business stakeholders- use necessary tools</li><li>Manages and tracks the status of requirements throughout the project lifecycle; enforce and redefine as necessary.</li><li>Communicate changes, enhancements, and modifications of business requirements verbally or through written documentation to project managers, sponsors, and other stakeholders so that issues and solutions are understood.</li></ul><p>ADDITIONAL SKILLS:</p><ul><li>Able to exercise independent judgment and take action on it</li><li>Excellent analytical, mathematical, and creative problem-solving skills</li><li>Excellent listening, interpersonal, written, and oral communication skills</li><li>Logical and efficient, with keen attention to detail &amp; highly self-motivated and directed</li><li>Ability to effectively prioritize and execute tasks while under pressure</li><li>Strong customer service orientation</li><li>Experience working in a team-oriented, collaborative environment</li><li>Experienced in Strategic planning, Business Analysis, Market research, Gap Analysis and Wire-framing</li><li>Proficient in designing and reviewing various documents including BRD, FRD, SRS, SOW and Project Estimation Sheet.</li><li>Ability to use modelling tools such as Microsoft Visio, Balsamiq, for Business Process Modelling, Flow Charts, and Use Case Diagrams.</li><li>Expertise in Wire framing, Prototyping, ER Diagrams, UML Diagrams etc</li></ul><p>REQUIRED SKILLS, QUALIFICATION AND EXPERIENCE:</p><ul><li>A Bachelor's Degree in Computer Science or Information Technology, and an accredited qualification in Management Consultancy, or similar.</li><li>Extensive experience in technical business analysis in a related industry.</li><li>Good documentation capabilities to capture business requirements clearly and prepare techno functional solutions &amp; exposure to content writing.</li><li>Advanced knowledge of programming languages like SQL and system integration solutions.</li><li>Ability to facilitate internal end-user proficiency.</li><li>Ability to design and maintain efficient customer portal support and feedback channels.</li><li>Advanced knowledge of data security and encryption.</li><li>Ability to keep up with IT advancements.</li><li>Knowledge of relevant licensing and industry compliance regulations.</li><li>Should have strong understanding of QA/user acceptance testing (UAT) process within an Agile environment.</li></ul><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $38,000.00 - $45,000.00 per year</p><p>Benefits:</p><ul><li>Dental insurance</li><li>Flexible schedule</li><li>Health insurance</li><li>Paid time off</li><li>Professional development assistance</li><li>Referral program</li><li>Vision insurance</li></ul><p>Schedule:</p><ul><li>8 hour shift</li><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Typical start time:</p><ul><li>8AM</li></ul><p>Typical end time:</p><ul><li>9PM</li></ul><p>Company's website:</p><ul><li>www.vgroupinc.com</li></ul><p>Company's Facebook page:</p><ul><li>https://www.linkedin.com/company/v-group/</li></ul><p>Benefit Conditions:</p><ul><li>Only full-time employees eligible</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Virtual meetings</li></ul></div><div></div>"
    },
    {
        "position": "Error",
        "company": "Capital Management - 3.7",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2021-01-30T08:00:05.169Z",
        "url": "https://www.simplyhired.com/job/aj3dlsT7eHxywA8xLW6v0M-7TghcEUBbT69SuGc19POPkaQ9o0yaEA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:05.169Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">PEAK6 is a leading investment firm headquartered in Chicago. More than 20 years ago, we were one of the first firms to develop sophisticated proprietary technology in our trading business. We’ve taken our passion for technology and created a software development experience designed to introduce women to the FinTech industry. Our Tech Experience is meant to encourage smart, ambitious, tech-savvy women to break the mold. We’ve heard all the myths about FinTech—too cutthroat, too intense, too risky—but we know that’s not the case at PEAK6. We know women make outstanding developers and technologists, but there are not enough female developers in the FinTech field yet. We are changing that. For 2021, we will be hosting this program remotely.\n<br><br>\n<b>You can expect the Technology Experience to include:</b><br>\nWorking on an impactful project from concept to delivery and presenting your work to senior leadership\n<br>Developing innovative tools to integrate with our proprietary trading platform. Some examples from previous years include tooling for low-latency market data streams, a data dependency framework and visualization tool, and an analytics framework and visualization tool for application usage.\n<br>Working with a variety of languages/frameworks, such as Java, Python, Go, JavaScript, HTML/CSS, and React, and technologies such as MS SQL Server, PostgreSQL, Redis, MongoDB, Airflow, Kafka, Kubernetes, and Docker\n<br>One-on-one mentorship focused on your learning and growth while progressing on your project\n<br>Education sessions to learn about financial markets and the tech behind our trading platform\n<br>Rotations and project deep-dives with our development teams\n<br>Exposure to various other PEAK6 businesses and senior leadership\n<br>Multiple opportunities to hear and learn from women in the FinTech space, both within PEAK6 and from other organizations\n<br>Integration with our development teams – including stand-ups, team meetings, and project planning sessions\n<br>Close collaboration with business stakeholders and end users on projects\n<br>Dynamic, fast-paced work environment where the need to stay ahead of the curve means you’ll learn every day\n<br><br>\nYou’ll gain loads of experience in our Tech Experience but before you do, you should have:\n<br><br>\nA graduation date between December 2021 – June 2022 in a Bachelor’s or Master’s program in Computer Science, Electrical or Computer Engineering, or a related discipline\n<br>Software development skills in a modern, object-oriented programming language such as Java, Python, or Go, and the ability to learn new languages and technologies quickly\n<br>Exceptional problem-solving skills with high attention to detail\n<br>Curiosity to learn and a drive to improve\n<br>Ability to thrive in collaborative environments\n<br>Effective communication skills\n<br>Demonstrated leadership ability\n<br><br>\n<b>Bonus points if:</b><br>\nYou have a background or strong interest in financial markets\n<br>You’re familiar with service-oriented software architectures and distributed systems\n<br>You have experience with multithreading and concurrent programming\n<br><br>\nDue to the unprecedented situation of COVID-19, PEAK6 has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, onboarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities’ and the CDC.</div><div></div>"
    },
    {
        "position": "iOS Engineering Intern (Remote)",
        "company": "23andMe - 3.9",
        "location": {
            "city": "California",
            "state": "California"
        },
        "posted": "2021-01-30T08:00:05.556Z",
        "url": "https://www.simplyhired.com/job/I0r9gWtj6I9nftus7OL_S8E9lhuquvSv1VbQhG0IBvJe-S8xFkQ8qQ?q=computer+science",
        "lastScraped": "2021-01-31T08:00:05.556Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Overview\n<br><br>\nSoftware engineering students of all levels wanted for our consumer product iOS engineering intern opportunity! Come join us in our mission to be the world's trusted source of personal genetic information.\n<br><br>\nWho we are\n<br><br>\nSince 2006, 23andMe's mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of what's possible to help turn genetic insight into better health and personal understanding. You'll work within a small, fast-paced team that has a mix of veteran engineers and recent grads who are collaborative and team-oriented.\n<br><br>\nWho you are\n<br><br>\nYou're curious, excited by new technologies, and thrive in a fast-paced and high impact environment.\n<br>You are self-motivated to work and achieve, and you are also a great collaborator on teams.\n<br>You are crazy smart and love working with others you can learn from.\n<br>Your idea of fun is to be challenged by hard problems. You love to think outside the box and build things that make an impact on people around the world every day.\n<br>You care about usability and can't help but think about the user when building software.\n<br><br>\nWhat you'll do\n<br><br>\nHelp solve challenging engineering problems at the intersection of genetics and consumer application development.\n<br>Help design and implement delightful customer-facing features using Swift.\n<br>Actively participate in our product development process.\n<br>Write unit and functional tests.\n<br><br>\nWhat you'll bring / Requirements\n<br><br>\nFamiliarity with the Swift programming language and XCode IDE (integrated development environment).\n<br>Currently pursuing a Bachelor's or Master's degree, preferably in Computer Science or a related field.\n<br>Experience shipping native applications is a plus.</div><div></div>"
    },
    {
        "position": "Privacy Incident Investigation Engineer Intern",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-30T08:00:06.033Z",
        "url": "https://www.simplyhired.com/job/JXhx0VHj0ZKixiHxJsfe8A9E4MbeuZkJKql2ss_MZcPDgBUjBtSsOg?q=computer+science",
        "lastScraped": "2021-01-31T08:00:06.033Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n<br><br>\nFacebook's Privacy team is seeking Incident Investigation Engineer interns with a passion for protecting security and privacy through triaging, mitigating, remediating and learning from security privacy incidents and application-level weaknesses potentially found in our systems. Your skills will be the foundation of initiatives that protect the privacy of over two billion people. You will advance Facebook's mission to make privacy a priority in everything we do by identifying and remediating instances of inappropriate data use or access. Come and help us make life hard for the bad guys!\n<br><br>\nWork with teams across the company, investigating privacy issues in all of FB's family of products including Oculus, Instagram, Workplace, and more.\n<br>Triage and determine priority of several incidents at once and work cross functionally with analysts, legal, and product teams to determine privacy issue root causes\n<br>Suggest remediation, and determine full scope of impact of incident\n<br>Reproduce vulnerabilities or privacy issues with appropriate tooling and instrumentation for data analysis\n<br>Develop software tooling to automate repetitive investigative tasks or allow analysts to interact with specific datasets\n<br>This role can shift between data exploration, software development, triaging incidents, reviewing code for security/privacy flaws, or all of the above.\n<br><br>\nHas a passion for protecting people’s privacy, Incident Response, and/or Incident Investigation\n<br>Experience with Python, PHP, Java, C/C++ or an equivalent language\n<br>Familiarity with web application security and privacy vulnerabilities and exploits\n<br>Comfortable communicating with both technical and non-technical stakeholders\n<br>Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment\n<br>Must be in the process of obtaining a Bachelors or Masters degree in Computer Science, Cybersecurity, Cybersecurity Forensics, Electrical Engineering or a similar program\n<br>Must be returning to the degree program after the completion of the internship/co-op.</div><div></div>"
    },
    {
        "position": "Information Technology Intern",
        "company": "Lockton, Inc. - 3.9",
        "location": {
            "city": "Kansas City",
            "state": "MO"
        },
        "posted": "2021-01-30T08:00:06.383Z",
        "url": "https://www.simplyhired.com/job/bLQ8twAy4X27W0mRDxaDjXLClN7HGqt6fMHdc41CblTVD6aoVtu97A?q=computer+science",
        "lastScraped": "2021-01-31T08:00:06.383Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Lockton Management in Kansas City will offer Information Technology internships during summer 2021. The interns will be exposed to different functional areas of the business and IT. The program is very \"hands-on\" with interns assisting on production products and services, department meetings and other IT processes.\n<br><br>\nSuccessful candidates have shown balanced success in both academics and extracurricular activities. Leadership positions in these activities as an added plus. Strong to excellent communication skills are desired as well. Lockton looks for students entering their junior or senior year who are focused on a career in information technology, preferably in one of the following areas:\n<br><br>\nSoftware Development\n<br><br>\nIT Infrastructure/Networking\n<br><br>\nProject Management and Business Analysis\n<br><br>\n<b>Qualifications:</b><br>\nGPA requirement is a minimum of 3.3\n<br>Ability to work as part of a team and independently while contributing to the success of the team\n<br>Ability to work remotely\n<br>Highly motivated, organized, reliable, and detailed-oriented\n<br>Strong written and verbal communications skills\n<br>Quick learner and not afraid to work with new computer-based programs and databases\n<br>Self-starter that brings problem solving skills and out of the box thinking\n<br>Ability to be effective and contribute in a fast-paced corporate environment\n<br>Pursuing degree in Computer Science, Engineering, Information Technology, or related field\n<br>Ability to work outside of normal business hours as needed\n<br>Legally able to work in the United States</div><div></div>"
    },
    {
        "position": "Systems Engineer Intern, Virtualization",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-30T08:00:06.688Z",
        "url": "https://www.simplyhired.com/job/g53gmzs5yrkmDiUb1EM4yNuh2rd5Gcd5DLQErgHwErIk4tjfitqkOQ?q=computer+science",
        "lastScraped": "2021-01-31T08:00:06.688Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n<br><br>\nIn Enterprise Engineering, our customers are Facebook’s employees, and we support the critical systems they rely on to keep the business growing and information safe. We use a combination of open source and off-the-shelf technologies, plus many of the tools developed to run facebook.com. You will be responsible for growing the internal virtualization environment by solving configuration, automation, and infrastructure problems at scale.\n<br><br>\nBuild, scale, and secure Facebook’s corporate infrastructure, focusing specifically on the internal virtualization environment (VMware)\n<br>Combine open-source and commercial technologies to build services that will have an impact on the business\n<br>Work in a heterogeneous environment containing diverse operating systems and applications, and make them work well together\n<br>Apply modern engineering methodologies such as infrastructure as code, scripting, automation, and software-defined storage to scale Facebook's rapidly growing Enterprise infrastructure\n<br>Find ways to leverage the scale and complexity of the larger facebook.com infrastructure to solve problems for Enterprise customers\n<br>Produce systems that are scalable, automated, and well-documented, and train others to take on operations\n<br><br>\nIs currently in the process of obtaining, a BS or MS in Computer Science, Engineering, or a related technical discipline\n<br>Familiarity with working in a Linux environment\n<br><b>Experience with at least one of the following languages:</b> Python, PowerShell, Go, Ruby, Bash</div><div></div>"
    },
    {
        "position": "CAG Engineering Intern (Remote)",
        "company": "23andMe - 3.9",
        "location": {
            "city": "California",
            "state": "California"
        },
        "posted": "2021-01-30T08:00:09.225Z",
        "url": "https://www.simplyhired.com/job/jXxxmVfp9jgOGlJI3qd3DzqSkksYiBhoFOrWiAAon7i6I6Io6F_wig?q=computer+science",
        "lastScraped": "2021-01-31T08:00:09.225Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Overview\n<br><br>\nSoftware engineering students of all levels wanted for our consumer product software intern opportunity! Come join us in our mission to be the world's most trusted source of personal genetic insight.\n<br><br>\nWho we are\n<br><br>\nSince 2006, 23andMe's mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of what's possible to help turn genetic insight into better health and personal understanding. You'll work within a small, fast-paced team that has a mix of veteran engineers and recent grads.\n<br><br>\nWho you are\n<br><br>\nYou're curious, excited by new technologies, and thrive in a fast-paced and high impact environment. You're interested in or would like to learn more about the world of consumer genetics.\n<br>You are self-motivated to work and achieve, and you are also a great collaborator on teams.\n<br>You are a fast learner and love working with others who can broaden your knowledge and skills.\n<br>You enjoy being challenged and solving difficult problems. You love to think outside the box and build things that make an impact on people around the world every day.\n<br><br>\nWhat you'll do\n<br><br>\nHelp solve challenging engineering problems at the intersection of genetics and consumer application development.\n<br>Help design and implement new customer-facing features and frameworks used by millions of people; build and enhance the infrastructure that empowers engineers to quickly prototype and deploy these features.\n<br>Participate in our product development process; work alongside and learn from software engineers, as well as product managers, designers, researchers and scientists with a diverse set of skills and backgrounds.\n<br>Write unit and functional tests; learn software engineering fundamentals and best practices.\n<br>Solve the performance and scalability problems that face a novel technology company with a large, growing user base and an expanding set of usage patterns and needs.\n<br>Have fun!\n<br><br>\nWhat you'll bring / Requirements\n<br><br>\nFamiliarity with the Python programming language.\n<br>Currently pursuing a Bachelor's or Master's degree, preferably in Computer Science or a related field.\n<br>Experience with web application development is a plus.</div><div></div>"
    },
    {
        "position": "Error",
        "company": "Parsons - 4.0",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2021-01-30T08:00:09.554Z",
        "url": "https://www.simplyhired.com/job/VG4e208HLbsGuEY1cwubS5RBhnZws_nBXwxDw8pi-pd4veMZP0O52Q?q=computer+science",
        "lastScraped": "2021-01-31T08:00:09.554Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Minimum Clearance Required to Start:</b><br>\nNot Applicable/None\n<br><br>\n<b>Job Description:</b><br>\nYou always bring your \"A\" game\n<br><br>\nYou have a boundless commitment to accomplishing the task. You insist on always doing your best, and there’s no allowance for second best. You keep at it until you know that your best work has been done. Our organization also operates at that level and our culture is consistent with those standards. We will supply you with the tools you need, from people to resources, to get your job done.\n<br><br>\n<b>Let’s talk about what you will be doing:</b><br>\nParsons Corporation is seeking a Computer Science Intern to support design, engineering, and construction projects on the FAA T4 Program. Tasks include:\n<br><br>\nPerforming a variety of support assignments requiring a fundamental knowledge of standards, practices, and techniques.\n<br>Supporting research, analysis and problem solving using a variety of tools and techniques.\n<br>Assisting in data collection and analysis activities.\n<br>Handling, manipulating, and analyzing data and working with Machine Learning frameworks.\n<br><br>\nTo facilitate their education and the quality of their experience each intern is paired one-on-one with a mentor of the same discipline. Interns participate in Parsons Early Talent Program where they interact with interns of varying disciplines and senior management within the organization. Location: Atlanta, GA\n<br><br>\n<b>T4 Program Summary:</b> The Federal Aviation Administration (FAA) awarded the Technical Support Services Contract 4 (T4) to Parsons as the prime contractor. This $1.3 billion+ contract has a 4-year base period with two 3-year options. The statement of work includes a variety of activities that support the FAA’s Capital Investment Plan (CIP) modernization efforts: Site selection and engineering, construction, environmental and fire/life safety, equipment installation and testing, CAD, and other technical services as required. Work is performed across the nation in each of the FAA’s nine regions as well as the Aeronautical Center in Oklahoma City, Oklahoma, and the Technical Center in Atlantic City, New Jersey and in several U.S. territories. An average staff of 400-500 with a peak staff over 650 supports this contract, in addition to those subcontractors who perform construction work.\n<br><br>\n<b>Here’s what we’re looking for:</b><br>\nRequired Qualifications\n<br><br>\nUS citizenship is required to obtain an FAA clearance.\n<br>Pursuing a bachelor’s or master’s degree in Computer Science or Engineering\n<br>Major GPA greater than 3.0\n<br>Excellent writing, communication, and interpersonal skills\n<br><br>\nDesired Qualifications\n<br><br>\nKnowledge of common Machine Learning frameworks and tools\n<br>Programming skills in Java, C#, or Python\n<br><br>\nParsons is a leading technology firm driving the future of defense, intelligence, and critical infrastructure. By combining unique technologies with deep domain expertise across cybersecurity, missile defense, space, connected infrastructure, and smart cities, we're providing tomorrow's solutions today.\n<br><br>\nReady to become one of our interns?</div><div></div>"
    },
    {
        "position": "Intern - Technology",
        "company": "State Farm - 3.7",
        "location": {
            "city": "Richardson",
            "state": "TX"
        },
        "posted": "2021-01-30T08:00:10.160Z",
        "url": "https://www.simplyhired.com/job/MboX4CWhRAAHE9iu2J6mNFzq-sbET6cbEhgVKerD1gJttEKt3WbP3w?q=computer+science",
        "lastScraped": "2021-01-31T08:00:10.160Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Overview:</b><br>\nWe are not just offering a job but a meaningful career! Come join our passionate team!\n<br><br>\nAs a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.\n<br><br>\nWe offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!\n<br><br>\nVisit our Careers page for more information on our benefits, locations and the process of joining the State Farm team!\n<br><br>\n<b>Responsibilities:</b><br>\nState Farm is looking for passionate IT students to join our Summer Internship Program! The Enterprise Technology department is involved in exploring new and emerging technologies. This program will offer you hands-on work along with real-world research and development opportunities. State Farm continues to refine and expand the use of technology for employees, agents, and customers. You will have the opportunity to influence change and help us deliver on our mission to protect State Farm and its policyholders.\n<br><br>\n<b>What You Can Expect:</b><br>\nOur internship will occur between May 17, 2021 - July 30, 2021\n<br>Selected interns will work 38.75 hours/week\n<br>Competitive candidates will be invited to participate in an on demand interview. This is where the excitement begins!\n<br><br>\n<b>Qualifications:</b><br>\n<b>We Are Looking For The Following:</b><br>\nCurrent college students only and must be a college student during the internship\n<br>Majors - Information Systems/IT or equivalent majors including but not limited to Business, Statistics, Informatics Computer Science, &amp; Engineering\n<br>Seeking candidates with experience in Object oriented programming (Java, Python, C++, etc.), mobile development (iOS/Android), web development, data and/or database (SQL, MySQL, etc.), or AWS\n<br>Drive and initiative to lead and affect positive change\n<br>Ability to thrive in a team environment, both in-person and virtual\n<br>Effective communication skills, both oral and written\n<br>A can-do attitude, and someone who loves to have a bit of fun!\n<br><br>\n<b>(Assigned roles MAY include:</b> Software Developer, Infrastructure Analyst, Data Analyst, IT Governance Risk &amp; Compliance Analyst.)</div><div></div>"
    },
    {
        "position": "Cyber Security Engineering Intern (6 month minimum) - February 2021",
        "company": "ETAS - 3.9",
        "location": {
            "city": "Ann Arbor",
            "state": "MI"
        },
        "posted": "2021-01-30T08:00:10.683Z",
        "url": "https://www.simplyhired.com/job/0h82rzaarsB4_03PLICq8q88LS85fcqUT6La80onclWhrCjMhQgIiA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:10.683Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nESCRYPT is embedded security group in ETAS. ESCRYPT is an internationally operating and highly growth-oriented company in the area of embedded security; we support all industries that require a security solution in embedded systems. To strengthen our team in Ann Arbor MI, we are looking for a motivated student for security engineer position.\n<br><br>\nThe ETAS Group is a subsidiary of Robert Bosch GmbH. Our product range includes development and diagnostic tools covering the entire lifecycle of Electronic Control Units (ECU).The ETAS Group provides comprehensive and integrated tools and tool solutions for the development and service of automotive ECUs. The ETAS Group maintains offices in 14 locations around the globe. By choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled\n<br><br>\nJob Description\n<br><br>\n<b>Your responsibilities:</b><br>\n<b>Responsible to support Embedded Security related topics:</b><br>\nComplete assigned release testing for internal tools\n<br>Setup of CAN and Ethernet fuzz testing runs\n<br>Root cause software failures through analysis of logs using CAN data loggers and Wireshark\n<br>Execute testing of internal test tool software, including functional, as well as stress, usability and security testing.\n<br>Work with software developers and other parties for diagnosis and fix verification\n<br>Development of fuzz testing tools\n<br>Supporting sales activity, developing demos\n<br><br>\nQualifications\n<br><br>\nQualifications\n<br><br>\nEnrolled in an Accredited BS/MS University program in a computer or technical related field. (Information Security, Information Technology, Electrical/Computer Engineering, Automotive Engineering, or Computer Science)\n<br>Experience in software quality\n<br>Basic knowledge of fuzz testing\n<br>Experience in software development such as C, C++, Python, and Java.\n<br>Demonstrate a strong desire/interest to work in the Automotive Engineering field.\n<br>Must possess excellent problem solving, interpersonal, oral and written communication skills.\n<br>Must be currently enrolled in an accredited university\n<br>Pursuing a Bachelors or Masters degree with at least one semester completed\n<br>Minimum of overall GPA of at least 3.0\n<br>Must be a minimum of 18 years of age\n<br><br>\nAdditional Information\n<br><br>\nBy choice, we are committed to a diverse workforce and are an equal opportunity employer. ESCRYPT welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in the selection process.\n<br><br>\nBy choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.\n<br><br>\nBOSCH is a proud supporter of STEM (Science, Technology, Engineering &amp; Mathematics) Initiatives\n<br><br>\nFIRST Robotics (For Inspiration and Recognition of Science and Technology)\n<br>AWIM (A World In Motion)\n<br><br>\nIndefinite U.S. work authorized individuals only. Future sponsorship for work authorization unavailable.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Hamilton Company - 2.8",
        "location": {
            "city": "Reno",
            "state": "NV"
        },
        "posted": "2021-01-30T08:00:11.116Z",
        "url": "https://www.simplyhired.com/job/qMaaPFl1Iy5uoTh5nQRX3PlEMzrHVxg2x3DBdJ0hf-xaKFcpfp8xuA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:11.116Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Description\n<br><br>\nWe are currently looking for someone to work in the software department supporting the development staff.\n<br><br>\n<b>Responsibilities include:</b><br>\nSoftware development, testing, writing automated test procedures and documentation.\n<br>Collect requirements from a variety of sources.\n<br>Put together a help system and write test documentation.\n<br><br>\nBesides the opportunity to apply what you are learning in school this position can be a stepping stone to a possible career at Hamilton Company.\n<br><br>\nQualifications\n<br><br>\nStrong written and verbal communication skills.\n<br>C# programming experience and knowledge of object orientated design.\n<br>The ideal candidate would be able to work an average of 20 per week during the academic year (we can work with your academic schedule) with more hours during the breaks.\n<br>Position requires a candidate that is currently enrolled in Computer Science, Computer Engineering or related discipline.\n<br><br>\n<b>Learn more about us @:</b> www.hamiltoncompany.com\n<br><br>\nIt is the policy of this organization to provide equal employment opportunities to all qualified applicants without regard to race, creed, color, national origin, sex, age 40 and over, disability, marital status, sexual orientation, gender identity, genetic information, citizenship status, religious preference, or veteran status in all phases of the employment process and in compliance with applicable federal, state, and local laws and regulations.\n<br><br>\nHamilton Company is a global enterprise headquartered in Reno, Nevada with manufacturing facilities in Reno, Boston and Bonaduz, Switzerland. Branch sales offices are located in France, Germany, Canada, Latin America, Japan, Singapore and the United Kingdom.\n<br><br>\nWe are the worldwide leader in the design and manufacture of manual, semi-automated and robotic products for precision fluid measuring. For over 56 years, Hamilton has been satisfying customer needs by combining quality materials with skilled workmanship, ensuring the highest level of performance of every precision fluid measuring device we manufacture.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Forth -",
        "location": {
            "city": "San Francisco",
            "state": "CA"
        },
        "posted": "2021-01-30T08:00:11.485Z",
        "url": "https://www.simplyhired.com/job/3KBz1aVk971mkqqjvMX97mYZL40Ejc4ojqpQE1CT_nZ-LIUhzISIlg?q=computer+science",
        "lastScraped": "2021-01-31T08:00:11.485Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>About the role<br>We are building reliable applications, infrastructure, and interfaces that make interacting with the health care system easier for healthcare providers and patients.<br>You will collaborate with the whole engineering team to build a system that scale, architect extensible data schemas, create data assets (data warehouses, data lakes, etc.) based on complex structured/unstructured data sources, refine entities, relationships, and insights, and help define technical patterns to create reliable and automatic production processes.<br>Brainstorming new features with the rest of the product and business team, strategically \"trim the fat\" on specs so we can keep up our shipping speed.<br>Putting in your 2 cents on code reviews.</p><p>About you<br>Experience building enterprise-scale web applications<br>Experience building mobile applications<br>Experience in all aspects of the software product lifecycle, from concept to fast prototype, design, build, deployment, and support. Ability to translate business strategy into technical vision and strategy through prototype creation, refinement, and enterprise-scale implementation<br>Experience in translating needs of business partner/clients to application design<br>You've worked well in a small group of great engineers before<br>Laughing is one of your favorite things to do<br>A passion for working in high performing teams and helping people make better decisions around their healthcare<br>A BS, MS, or Ph.D. in computer science or a related field</p><p>Job Types: Full-time, Part-time, Internship</p><p>Pay: $0.00 per hour</p><p>Schedule:</p><ul><li>Monday to Friday</li><li>Weekends</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Hours per week:</p><ul><li>Less than 10</li><li>10-19</li></ul><p>Internship Compensation:</p><ul><li>College Credit</li></ul><p>Visa Sponsorship Potentially Available:</p><ul><li>No: Not providing sponsorship for this job</li></ul><p>This Job Is Ideal for Someone Who Is:</p><ul><li>Dependable -- more reliable than spontaneous</li><li>People-oriented -- enjoys interacting with people and working on group projects</li><li>Adaptable/flexible -- enjoys doing work that requires frequent shifts in direction</li><li>Detail-oriented -- would rather focus on the details of work than the bigger picture</li><li>Achievement-oriented -- enjoys taking on challenges, even if they might fail</li><li>Autonomous/Independent -- enjoys working with little direction</li><li>Innovative -- prefers working in unconventional ways or on tasks that require creativity</li></ul><p>Company's website:</p><ul><li>careforth.io</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Personal protective equipment provided or required</li><li>Plastic shield at work stations</li><li>Temperature screenings</li><li>Social distancing guidelines in place</li><li>Virtual meetings</li><li>Sanitizing, disinfecting, or cleaning procedures in place</li></ul></div><div></div>"
    },
    {
        "position": "Software Engineering Intern - Summer 2021",
        "company": "Bosch Group - 4.1",
        "location": {
            "city": "Plymouth",
            "state": "MI"
        },
        "posted": "2021-01-30T08:00:12.110Z",
        "url": "https://www.simplyhired.com/job/-sc17UEH942JjWGCoWSdrE1Mf5RehY1XM6oChZmWebnSxhyy_6aObA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:12.110Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\nAs one of the largest North American automotive suppliers, Bosch develops, manufactures and supplies precision components and systems - including body electronics, chassis and powertrain products - for vehicle manufacturers worldwide. Since its foundation 1886, the company accelerates the progress of Automotive Technology with continued innovations.\n<br><br>\nIn the field of passive safety Bosch puts time to the best use: With over 30 years of experience Bosch develops and manufactures advanced and reliable occupant and pedestrian protection electronics which precisely trigger passive safety systems such as airbags and seat-belt tensioners in the event of a crash or collision. We thus help vehicle manufacturers to provide better protection for both vehicle occupants and other road users.\n<br><br>\nJob Description\n<br><br>\nDevelop new tools to automate and facilitate SW development activities\n<br><br>\nQualifications\n<br><br>\nMicrosoft office knowledge especially excel including. Programing language C,C++... Scripting language is a plus.\n<br><br>\nElectrical, Computer Engineering or Computer Science majors\n<br><br>\nMust be currently enrolled in an accredited university\n<br>Pursuing a Bachelors or Masters degree with at least one semester completed\n<br>Minimum of overall GPA of at least 3.0\n<br>Must be a minimum of 18 years of age\n<br><br>\nAdditional Information\n<br><br>\nBy choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.\n<br><br>\nBOSCH is a proud supporter of STEM (Science, Technology, Engineering &amp; Mathematics) Initiatives\n<br><br>\n<ul><li>FIRST Robotics (For Inspiration and Recognition of Science and Technology)</li><li>AWIM (A World In Motion)</li></ul>\nIndefinite U.S. work authorized individuals only. Future sponsorship for work authorization unavailable.</div><div></div>"
    },
    {
        "position": "University Relations - IT Associate Developer Intern",
        "company": "Blue Cross Blue Shield of IL, MT, NM, OK & TX - 3.9",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2021-01-30T08:00:12.690Z",
        "url": "https://www.simplyhired.com/job/wP3blp_Q4s8Cg332As9qNgB2RuDQbUwg2mT1-P-fDDA55aFakjVlLA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:12.690Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Why Intern at Health Care Service Corporation?\n<br><br>\nHealth Care Service Corporation (HCSC), a Mutual Legal Reserve Company and an Independent Licensee of the Blue Cross and Blue Shield Association, is the largest customer-owned health insurer in the United States and fourth largest overall, operating through our Blue Cross and Blue Shield® Plans in Illinois, Montana, New Mexico, Oklahoma and Texas.\n<br><br>\nAs the health care industry continues to rapidly transform, our IT team conceives, develops and delivers impactful technology solutions to support access to quality, affordable health care for our members. We are driven by our collective company purpose: To do everything in our power to stand with our members in sickness and in health®. Our IT team unleashes the power of this purpose through technology. We come to work every day to make a difference, and we deliver the highest quality and best solutions to our members.\n<br><br>\nThis ten-week paid internship is located in Chicago, IL or Richardson, TX\n<br><br>\nWhat Are Your Responsibilities?\n<br><br>\nYou will have the opportunity to use languages such as Java and enable programming tools such as Jira and Jenkins, or Agile development approaches (i.e. Extreme Programming, Feature Driven Development, Dynamic Systems Development Method (DSDM), Scrum).\n<br>You may also develop and test program code in support of HCSC’s business goals, integrate tested program code into existing business application, and work closely with HCSC project managers and actively participate in project meetings\n<br><br>\nWhat Do You Need To Be Successful?\n<br><br>\nBackground in Java, JavaScript, SQL, HTML, MVC, CSS, and/or Data Analytics. Exposure to Hadoop. Pic, Talend, or similar tools.\n<br>Demonstrated interpersonal skills including verbal and written communication\n<br>Strong analytical skills\n<br>Practical, developed PC skills, especially Excel, Word and Access\n<br><br>\nWhat Are the Requirements You Must Meet?\n<br><br>\nPursuing a Bachelor’s Degree in Information Technology or a related field\n<br>Graduation date between December 2021 – June 2022\n<br>A minimum GPA of 3.0/4.0\n<br>Availability to work 10 weeks during the summer\n<br>Unrestricted authorization to work in the United States\n<br><br>\nWhat Does the Internship Program Entail?\n<br><br>\nFormal Intern Orientation to build business and industry acumen\n<br>Challenging real-world hands-on project\n<br>Weekly networking opportunities among interns and company leaders\n<br>Professional development workshops\n<br>Business Resource Group involvement\n<br>Volunteer activities\n<br><br>\nHCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.\n<br><br>\n<b>Requirements:</b><br>\nExpertise Information Technology\n<br>Job Type Intern\n<br>Location TX - Richardson, IL - Chicago\n<br><br>\nHCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants.\n<br><br>\nIf you are an individual with a disability or a disabled veteran and need an accommodation or assistance in either using the Careers website or completing the application process, you can call us at 1-866-977-7378 to request reasonable accommodations.\n<br><br>\nPlease note that only requests for accommodations in the application process will be returned. All applications, including resumes, must be submitted through HCSC's Career website on-line application process. If you have general questions regarding the status of an existing application, navigate to \"my account\" and click on \"View your job submissions\".</div><div></div>"
    },
    {
        "position": "Information Security Intern",
        "company": "Scientific Games - 3.5",
        "location": {
            "city": "Las Vegas",
            "state": "NV"
        },
        "posted": "2021-01-30T08:00:13.150Z",
        "url": "https://www.simplyhired.com/job/77Y6UeuA9-0jGgEAQ7Sw_2MxBfJyNQZpukElPEU_zKQZ-HlHMd7sVA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:13.150Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Corporate:</b><br>\nWhen you become a member of our Corporate team, you will work across the organization to provide the knowledge, resources and tools that help Scientific Games deliver outstanding service and support to our internal clients. Our Corporate Group includes Finance, Investor Relations, Legal, Compliance, Internal Audit, Facilities, Human Resources and Corporate Communications. We’re always looking for team players who are customer centric, who seek to challenge themselves and have the drive to move our business forward.\n<br><br>\nIf this sounds like you…Let’s make games!\n<br><br>\nPosition Summary\n<br><br>\nThe Cyber Security Intern is a member of the cyber security operations team and works closely with the other members of the cyber security team in support of a comprehensive cyber security program. This role is an entry level Intern that is responsible for reviewing various cyber security logs to identify events that require escalated analysis. The cyber security Intern reports to the Cyber Security Manager for Scientific Games.\n<br><br>\n<b>Essential Job Functions:</b><br>\nDuties typically include planning and implementing security measures to protect computer systems, networks and data. Information security interns are expected to stay up-to-date on the latest intelligence, including hackers’ methodologies, to anticipate security breaches. They also are responsible for preventing data loss and service interruptions by researching new technologies that will effectively protect a network.\n<br><br>\n<b>Education:</b><br>\nEnrolled in an accredited college or university studying one of the following disciplines: Computer Science, Cyber / Information Security, or Computer Information systems.\n<br><br>\n<b>Required Experience:</b><br>\nReview DLP, SIEM, Anti-Virus, Malware, and other Cyber Security logs.\n<br><br>\nProof of authorization/eligibility to work in the United States\n<br><br>\nBasic understanding of mainstream operating systems and a wide range of security technologies, such as network security appliances, anti-malware solutions, automated policy compliance tools, and desktop security tools is preferred.\n<br><br>\nFundamental knowledge of network traffic alerts to assess, prioritize and differentiate between potential intrusion attempts and false alarms.\n<br><br>\nBasic understanding of current cyber threats.\n<br><br>\nAbility to communicate effectively in a positive/upbeat fashion utilizing English, both in oral and written form\n<br><br>\nOther tasks assigned\n<br><br>\nMust be 21 years of age or older\n<br><br>\n<b>Physical Requirements:</b><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit, stand, walk, bend, use hands, operate a computer, and have specific vision abilities to include close and distance vision, and ability to adjust focus working with computer and business equipment.\n<br><br>\nWork Conditions\n<br><br>\nScientific Games Corporation and its affiliates (collectively, “SG”) are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due diligence/background investigation on you.\n<br><br>\nThis job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.\n<br><br>\nSG is an Equal Opportunity Employer and does not discriminate against applicants due to race, ethnicity, gender, sexual orientation, veteran status, or on the basis of disability or any other federal, state or local protected class. If you’d like more information, please click on this link: EEO Poster</div><div></div>"
    },
    {
        "position": "Error",
        "company": "COLSA - 3.9",
        "location": {
            "city": "Huntsville",
            "state": "AL"
        },
        "posted": "2021-01-30T08:00:13.411Z",
        "url": "https://www.simplyhired.com/job/6vWewoBVBlXmDZ2ObNs0695Q80PxXYphCP13l2c4qz6bJH8Ve5c_yQ?q=computer+science",
        "lastScraped": "2021-01-31T08:00:13.411Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Members of the COLSA Software Factory (CSF) believe in and strive to maintain an open, honest working environment that welcomes new ideas and alternative solutions. Using a collaborative decision-making approach helps us implement the most effective solution for our customers. Our processes are flexible and members are encouraged to propose improvements. We develop products cognizant of the impact it will have on everyone from the developer to the end-user. We are passionate about what we do and eagerly await others to join our team!\n<br><br>\nJob Description\n<br><br>\nWill perform routine tasks associated with the operations of the COLSA Software Factory, to include:\n<br><br>\nAssisting with development and testing of software in an agile team environment\n<br>Interfacing with UI/UX Designer\n<br>Reviewing software, unit tests, and functional tests\n<br>Using Jira, Confluence, Bitbucket and Crucible\n<br><br>\nThe summer hire, at a minimum, will be exposed to the following CSF skill/process areas:\n<br><br>\nFactory Agile Software Team (FAST℠) process\n<br>MVVM Architectural Pattern\n<br>Data Science and Visualization\n<br>Machine Learning\n<br>Software-based problem solving\n<br><br>\nAt COLSA, people are our most valuable resource and centered at our core value. We invite you to unite your talents with opportunity and be a part of our “Family of Professionals!” Learn about our employee-centric culture and benefits here.\n<br><br>\nRequired Skills\n<br><br>\nRequired Experience\n<br><br>\nCurrently enrolled in pursuit of undergraduate or graduate degree in a software engineering, computer engineering or computer science\n<br>Must be willing and able to relocate to Huntsville, AL at his/her own expense for duration of internship\n<br>U.S. Citizenship required\n<br>Experience with Python\n<br>Comfortable with basic Linear Algebra, Statistics, and some Calculus\n<br>Good written and verbal communication skills\n<br>Passion for technology\n<br>Enthusiasm and willingness to learn\n<br>Working knowledge of Microsoft Office applications\n<br><br>\nPreferred Qualifications\n<br><br>\nPrior experience or demonstrated experience on projects related to software engineering\n<br><br>\nApplicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. COLSA Corporation is an Equal Opportunity Employer, Minorities/Females/Veterans/Disabled. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.</div><div></div>"
    },
    {
        "position": "Intern, Systems Quality Assurance",
        "company": "Hologic - 3.7",
        "location": {
            "city": "Newark",
            "state": "DE"
        },
        "posted": "2021-01-30T08:00:13.881Z",
        "url": "https://www.simplyhired.com/job/woKRXHedNFWbsg0p1jUV7G1rDWYG7vmkyuycqTsgzlfJhTcXhta02Q?q=computer+science",
        "lastScraped": "2021-01-31T08:00:13.881Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>The Summer Internship Experience:</b> Make a Difference\n<br><br>\nAs a Hologic Intern, you are not just taking a summer job; you are taking your place on a global team of motivated, creative and amazing people! The summer internship experience gives you the opportunity to shine and share your knowledge, energy, and passion on meaningful projects that impact people all over the world. In addition to a project that will provide maximum experience and exposure in your desired field the Hologic College Relations team provides opportunities to learn more about the company, network with leadership, and develop the skills needed to succeed in a global organization.\n<br><br>\nThe Systems Quality Assurance (SQA) team works hand-in-hand with the rest of research and development to deliver best-in-class digital mammography systems. Specifically, SQA tests products before they move into production and out to clinical sites to ensure that the system is safe, effective, and will delight users and patients.\n<br><br>\nOne of the most important ways our products are tested is through automation of software tasks, using the system as the user would be expected to use it. The SQA intern will help expand test automation for our digital mammography systems to cover more functionality and to develop methods for verifying system performance via automation.\n<br><br>\nWe're looking for bright, inquisitive problem solvers who strive to make a difference. In order to be considered for this internship you must:\n<br><br>\nBe enrolled as a Rising Junior or Rising Senior\n<br><b>Majoring in:</b> Biomedical Engineering, Computer Engineering, Computer Science\n<br>Have a 3.2/4.0 GPA\n<br>Excellent written and oral communication skills\n<br>A background in programming, such as Python, Java, or C#\n<br>Knowledge of Microsoft Windows 10 operating system, networking, and general computer hardware\n<br>A strong attention to detail\n<br><br>\nHologic, Inc. is proud to be an Equal Opportunity Employer inclusive of disability and veterans.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Yorktel - 3.9",
        "location": {
            "city": "Eatontown",
            "state": "NJ"
        },
        "posted": "2021-01-30T08:00:16.536Z",
        "url": "https://www.simplyhired.com/job/wqTVZL78KffJWAXZ3phgLgr8UN72Ne3L6vdIElpyy3D3ksgimvf4zg?q=computer+science",
        "lastScraped": "2021-01-31T08:00:16.536Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">For over 30 years, Yorktel has been the video managed services partner around the world for some of the largest business and government agencies. With over 10,000 video systems under management worldwide – more than any other video communications service provider – Yorktel has the proven expertise and global reach to deliver enterprise-quality visual communications.\n<br><br>\nYorktel is currently seeking a Software Development Intern who will assist Yorktel’s Software Quality Assurance (SQA) Team with automated testing tool development, Product Development, Product Testing, and other related activities. This position explore all the various methods of developing methods for automatic testing of Caregility products. In addition, this position will he will be helping on developing other Caregility products as directed by Product Owners.\n<br><br>\n<b>Roles and Responsibilities:</b><br>\nThis position regularly communicates to Product Owners and SQA Director to achieve a mutually desirable outcome. This position works closely with the Product Owners on Product Development, Product Testing, and related activities. This position is expected to protect all internal and external confidential information and must utilize discretion and judgment based on company policies and procedures.\n<br><br>\nEnumerate description of all possible methods of auto testing tools.\n<br>Analyze, design and develop on viability of automated testing tools.\n<br>Product Development for new and existing Caregility products\n<br>Product testing for new and existing Caregility products\n<br>Some software development for Caregility\n<br><br>\n<b>Skills and Abilities:</b><br>\nStrong Software coding development experience\n<br>Ability to work independently a must\n<br>Must also be able to participate and work well in a team environment·\n<br>Present a professional appearance at all times·\n<br>High levels of Professionalism and Integrity\n<br>Ability to cope with multiple projects\n<br>Good written and oral communications skills\n<br>High ability to work with peers\n<br>Exceptional customer service skills\n<br>Exceptional written, verbal and interpersonal skills.\n<br>Excellent problem solving skills\n<br>Extensive use of business computer systems including Microsoft Office applications such as MS Word, Excel, Outlook and MS Project.\n<br><br>\n<b>Education and Qualifications:</b><br>\nUS High School diploma completed\n<br>Current student or recent graduate studying Computer Science and Engineering\n<br><br>\n<b>Additional Requirements:</b><br>\nMay require occasional lifting (up to 50 lbs)\n<br>Requires extensive sitting, standing and walking\n<br>Domestic travel requiring multi-night stays within and at times outside the local work area\n<br>Valid passport; International travel possible\n<br>Valid U.S. driver’s license\n<br>Must be willing to complete background checks and drug tests as required by current or future contracts\n<br>Must be willing to apply for security clearances, SSA Suitability, and other related clearances to be able to work at certain customer locations.\n<br><br>\nWe conform to all the laws, statutes, and regulations concerning equal employment opportunities and affirmative action. We strongly encourage women, minorities, individuals with disabilities and veterans to apply to all of our job openings. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, Genetic information and testing, family and medical leave, sexual orientation and gender identity or expression, protected veteran status, or any other characteristics protected by law. We prohibit retaliation against individuals who bring forth any complaint, orally or in writing, to the employer or the government, or against any individuals who assist or participate in the investigation of any complaint or otherwise oppose discrimination.</div><div></div>"
    },
    {
        "position": "Error",
        "company": "The Sher Agency -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-30T08:00:16.769Z",
        "url": "https://www.simplyhired.com/job/fF8m69wzXb2mN_I_XU99woARxvYahIC3rNjKcVIQmSvFF8wQVOmC9w?q=computer+science",
        "lastScraped": "2021-01-31T08:00:16.769Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Job Description</b></p><p>This internship is a training position. You'll be learning our design and development processes as you develop your skillsets by designing and developing WordPress websites alongside the project team. Specifically:</p><ul><li>UI / UX design in Adobe XD</li><li>Page building in WordPress using page building tools like Divi &amp; Oxygen Builder</li><li>HTML / CSS front end development inside of WordPress</li><li>Bug fixing &amp; optimization</li></ul><p>Initially, this job will require 20-30h weekly but will increase if you're a good match!</p><p><b>The Ideal Candidate</b></p><ul><li>Has some background in visual/graphic design.</li><li>Has some knowledge of HTML / CSS</li><li>Has some knowledge of WordPress</li><li>Has earned, or is in the process of earning, an undergraduate degree in a relevant area (marketing, business, computer science, etc.)</li></ul><p>Job Type: Internship</p><p>Pay: $13.00 - $15.00 per hour</p><p>Experience:</p><ul><li>WordPress: 3 years (Required)</li><li>Web Design: 3 years (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Stable -- traditional, stable, strong processes</li><li>People-oriented -- supportive and fairness-focused</li><li>Team-oriented -- cooperative and collaborative</li></ul><p>Company's website:</p><ul><li>sheragency.com</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li></ul></div><div></div>"
    },
    {
        "position": "Onshape Mobile Developer Intern",
        "company": "PTC - 3.7",
        "location": {
            "city": "Boston",
            "state": "MA"
        },
        "posted": "2021-01-30T08:00:17.200Z",
        "url": "https://www.simplyhired.com/job/qcKlHgh2bRxVj1BCa4WZIJbzKDiBM8m-59obytvqprnN0x7dbKzXAw?q=computer+science",
        "lastScraped": "2021-01-31T08:00:17.200Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Your Impact:</b><br>\nWe are looking for iOS &amp;Android Engineering Interns to join Onshape team this Summer! In this role, you will help to build a 3D CAD application that millions of engineers use to manufacture products we all use. You will help implement new features, improve performance, and build beautiful user interfaces. Above all, your work will impact the way the world design products.\n<br><br>\n<b>Your Team:</b><br>\nOnshape team is made up of passionate engineers who are building award winning mobile apps on iOS, Android and AR/VR platforms. We push the boundaries of what is possible on the mobile devices. Onshape mobile apps are first of its kind design apps where engineers can do full fledged parametric CAD modeling.\n<br><br>\n<b>Day to Day Responsibilities:</b><br>\nBuild cutting edge iOS features on our products\n<br>Collaborate closely with other engineers, designers and product managers to drive the direction of Spotify's iOS development\n<br>Write clear, maintainable code that will scale across a number of projects and distributed development teams Become a valued member of an autonomous, cross-functional team\n<br><br>\n<b>Basic Qualifications:</b><br>\nPursuing a Bachelor's or Master's degree in Computer Science or Computer Engineering or a related field of study Experience writing readable, idiomatic Objective-C and Swift, or Java code • You have experience with a few iOS / Android frameworks\n<br>Great Communication skills and initiative to connect all of the dots and work with your peers\n<br>Have built at least one app or have a project in the works that you can tell us about\n<br><br>\nPTC Company Description\n<br><br>\n<b>About PTC (NASDAQ:</b> PTC) PTC unleashes industrial innovation with award-winning, market-proven solutions that enable companies to differentiate their products and services, improve operational excellence, and increase workforce productivity. With PTC, and its partner ecosystem, manufacturers can capitalize on the promise of today’s new technology to drive digital transformation.\n<br><br>\nRegion\n<br><br>\nThe Americas\n<br><br>\nSubregion\n<br><br>\nNorthern Europe\n<br><br>\nPTC Org\n<br><br>\nONS - Onshape\n<br><br>\nJob Type\n<br><br>\nAcademic Coop / Intern</div><div></div>"
    },
    {
        "position": "Cyber Security I/T Summer 2021 Co-Op",
        "company": "Crown Equipment Corporation - 3.5",
        "location": {
            "city": "New Bremen",
            "state": "OH"
        },
        "posted": "2021-01-30T08:00:17.644Z",
        "url": "https://www.simplyhired.com/job/KdKbZ342fDyhDPwc3qj6FtvpTbsMQEVU0k0AUJw2x5c2WsUvziU9gg?q=computer+science",
        "lastScraped": "2021-01-31T08:00:17.644Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Company Description:</b><br>\nCrown Equipment Corporation is a leading innovator in world-class forklift and material handling equipment and technology. As one of the world’s largest lift truck manufacturers, we are committed to providing the customer with the safest, most efficient and ergonomic lift truck possible to lower their total cost of ownership.\n<br><br>\n<b>Job Responsibilities:</b><br>\nAssist to Ensure the confidentiality, integrity and availability of the Company’s IT infrastructure and intellectual property.\n<br>Assist with the documentation, implementation and execution of the Cyber Security program based upon Company needs and industry best practices.\n<br>Assist with the scheduled and random security inspections of the Company’s networks, servers, and end user accounts and devices to verify program compliance.\n<br>Analyze and resolve newly discovered security vulnerabilities and/or breaches.\n<br><br>\n<b>Job Qualifications:</b><br>\nCandidate should be enrolled in a 4 year degree progam studying Cyber Security, Computer Science or equivalent\n<br><br>\nExcellent written and oral communication, deductive reasoning, and analytical trouble shooting skills.\n<br><br>\nStrong Interpersonal skills\n<br><br>\n<b>Work Authorization:</b><br>\nCrown will only employ those who are legally authorized to work in the United States. This is not a position for which sponsorship will be provided. Individuals with temporary visas or who need sponsorship for work authorization now or in the future, are not eligible for hire.\n<br><br>\nNo agency calls please.\n<br><br>\nEO/AA Employer Minorities/Females/Protected Veterans/Disabled</div><div></div>"
    },
    {
        "position": "Technology/Developer Internships (VIRTUAL) - Publicis Health",
        "company": "Publicis Health - 3.9",
        "location": {
            "city": "New York",
            "state": "NY"
        },
        "posted": "2021-01-30T08:00:18.105Z",
        "url": "https://www.simplyhired.com/job/DmH_VpjkBiXRRunQOHv0tfCl86BPIcfF6cigDkIf95SB_oC1cv648g?q=computer+science",
        "lastScraped": "2021-01-31T08:00:18.105Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Company Description\n<br><br>\n<b>At Publicis Health, we are united around one purpose:</b> to create a world where people are equipped and motivated to take control of their health. We transform healthcare marketing and communications into healthcare engagement.\n<br><br>\nWe believe healthcare marketing is healthcare, fostering healthy conversations, healthy behaviors and healthy people. Publicis Health is a Dynamic Health Engagement Platform, an organizing principle that seamlessly connects data, content and technology; is driven by marketing and business transformation; and offers our clients fluid access to world-class talent and game-changing capabilities.\n<br><br>\nWith 40 offices and 11 brands across the globe, Publicis Health’s worldwide staff is comprised of more than 3,000 healthcare professionals who are experts in advertising and branding, data and analytics, strategic planning, service design, digital media and technology, science, and medicine. Publicis Health companies include Digitas Health, Heartbeat, insync, Langland, Payer Sciences, PlowShare Group, Publicis Health France, Publicis Health Media, Razorfish Health, Saatchi &amp; Saatchi Wellness, and Verilogue. For more information, visit us at www.publicishealth.com.\n<br><br>\nWe know the power of interning with purpose….from home. This Summer 2021, start your marketing career in healthcare and intern with purpose! Don’t miss the opportunity to gain relevant industry experience from the safety of your own home.\n<br><br>\nFor two consecutive years, Publicis Health’s award-winning internship program was recognized by WayUp as one of the top 100 internship programs in the United States. As part of our virtual internship program, our 60+ interns gain valuable hands-on healthcare marketing and communications experience from the comfort and safety of their homes. Interns participate in weekly virtual learning sessions and gain exposure to senior leaders across the Publicis Health network, as well as expand their network with other PH interns across the U.S. By the conclusion of our 9-week virtual program, our interns learn what it means to intern with purpose.\n<br><br>\nJob Description\n<br><br>\nTechnology – Software Engineer\n<br><br>\nPosition Overview\n<br><br>\nAs a software engineer intern, you will work with multiple technologies to address client problems – Including front-end technologies (HTML/Javascript), back-end technologies (Node.js, .NET) and native app development (Swift / Objective-C). You will gain exposure to the process used to understand client needs and applying creative technology to deliver unique value!\n<br><br>\nFor this role, you should have some basic knowledge of things like design patterns and software engineering principles, along with some experience in commons Dev Ops tool and things like HTML, Javascript, and CSS/SASS. We'd also love for you to have an understanding of JSON and Web Service APIs usage and development.\n<br><br>\nResponsibilities\n<br><br>\nCollaborates and communicates efficiently and effectively with other Technology team members.\n<br><br>\nWorks with a lead developer to implement technology solutions that address our clients’ business needs and challenges while demonstrating our standard methodologies and preferred technologies\n<br><br>\nDebugs or fixes simple issues in existing software applications\n<br><br>\nAids the team in performing detailed testing of developed software\n<br><br>\nQualifications\n<br><br>\nIntern Requirements\n<br><br>\nFull-time rising junior or rising senior, currently enrolled at an accredited 4-year College or University.\n<br><br>\nEnrolled in an undergraduate degree program which aligns with their area of interest (such as Computer Science)\n<br><br>\nLegally authorized to work in the US\n<br><br>\nAdditional Information\n<br><br>\nAll your information will be kept confidential according to EEO guidelines.</div><div></div>"
    },
    {
        "position": "Information Security Intern",
        "company": "Indium Corporation - 3.5",
        "location": {
            "city": "New Hartford",
            "state": "NY"
        },
        "posted": "2021-01-30T08:00:18.789Z",
        "url": "https://www.simplyhired.com/job/Il1oG49WQSbAExfk65JgP-JlvoBAibfOOEEqrpkqV24DuhGnL7Qhiw?q=computer+science",
        "lastScraped": "2021-01-31T08:00:18.789Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Posting\n<br>Information Security Intern\n<br><b>Reports to:</b> Security Administrator\n<br><br>\n<b>Shift:</b> M-F, 8:00am – 5:00pm\n<br><br>\n<b>Location:</b> New Hartford, NY\n<br><br>\n<b>Travel:</b> 0-20%\n<br><br>\n<b>Posting Date:</b> January 29, 2021 Response Date: Until Filled\n<br><br>\n<b>Position Summary:</b><br>\nThe Information Security Intern will assist the Information Systems (IS) team in undertaking\n<br><br>\nchallenging projects designed to blend strategic and operational work. This position will\n<br><br>\nassist in further developing professional skills in the field of Information Security by leading\n<br><br>\nthe implementation of an Information Security Management System (ISMS).\n<br><br>\n<b>Responsibilities:</b><br>\n<ul><li>Support the development of an Information Security Management System</li><li>Actively support critical security processes and disciplines such as endpoint protection,</li></ul>\nemail security systems, monitoring alerts and vulnerability scanning\n<br><br>\n<ul><li>Conduct internal audits to identify security deficiencies across the company</li><li>Assist in updating security policies and procedures documentation</li><li>Promote and maintain the Security Awareness Training program</li></ul>\n<b>Requirements:</b><br>\n<ul><li>Currently pursuing B.S. or M.S, in Information Security, Cybersecurity, Computer</li></ul>\nScience, or Management of Information Systems\n<br><br>\n<ul><li>Understanding of security control frameworks</li><li>Excellent verbal, written and interpersonal communication skills</li><li>Ability to exercise sound judgment in complex situations.</li><li>Knowledge of information security and risk management principles and practices</li></ul>\nIndium Corporation is an Equal Opportunity/Affirmative Action and Minority/Female/Disability/\n<br><br>\nProtected Veteran Employer. We provide a drug-free work environment and a full benefits\n<br><br>\npackage. Interested candidates are encouraged to apply. Submit resume and cover letter\n<br><br>\nat www.indium.com/jobs. This position is eligible for the Employee Referral Program.</div><div></div>"
    },
    {
        "position": "IT Intern",
        "company": "Arthrex - 3.8",
        "location": {
            "city": "Naples",
            "state": "FL"
        },
        "posted": "2021-01-30T08:00:19.197Z",
        "url": "https://www.simplyhired.com/job/OSMUjpmO4wRvp68edLVo-BrdiIzEqle8ymJ8UdWchM3TtRYN2UQz8g?q=computer+science",
        "lastScraped": "2021-01-31T08:00:19.197Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Please note, this position is located in Naples, FL and is eligible for limited benefits. The ideal candidate will be available from May - August 2021.\n<br><br>\n<b>Main Objective:</b><br>\nTo assist the IT team with desktop support and inventory management.\n<br><br>\n<b>Essential Duties and Responsibilities:</b><br>\nAssist team with help desk call support and queue monitoring for software/hardware purchases.\n<br><br>\nGeneral desktop support for computers, phones, printers and peripherals.\n<br><br>\nAssist team with inventory management.\n<br><br>\nAssist Desktop Technicians with installations, upgrades and employee relocations.\n<br><br>\nManage vendor invoices and assist with purchase orders.\n<br><br>\n<b>Incidental Duties:</b><br>\nThe above statements describe the general nature and level of work being performed in this job. They are not intended to be an exhaustive list of all duties, and indeed additional responsibilities may be assigned, as required, by management.\n<br><br>\n<b>Education and Experience:</b><br>\nProgress towards a college degree in Computer Science, Computer Information Systems or Business Administration required.\n<br><br>\nKnowledge and Skill Requirements/Specialized Courses and/or Training:\n<br><br>\nBasic to intermediate computer skills. Be able to follow written and verbal direction.\n<br><br>\n<b>Machine, Tools, and/or Equipment Skills:</b><br>\nPC; Familiarity with Microsoft Outlook; PowerPoint; Word and Excel. Visio; Fax; Scanner.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n<br><br>\n<b>Nearest Major Market:</b> Naples</div><div></div>"
    },
    {
        "position": "Cloud Infrastructure Intern (Summer 2021) - San Mateo, CA",
        "company": "Guidewire Software, Inc. - 3.7",
        "location": {
            "city": "San Mateo",
            "state": "CA"
        },
        "posted": "2021-01-30T08:00:19.772Z",
        "url": "https://www.simplyhired.com/job/t7R33YQfSYvITZu-IYaLyUTM0KbZY5Kui64mDycJtAFqVjO5nbTkfQ?q=computer+science",
        "lastScraped": "2021-01-31T08:00:19.772Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Guidewire Software is seeking a summer intern (June – August) to join the Business Technology team in San Mateo, CA as a Cloud Infrastructure Intern.\n<br><br>\nWe live by our core values every day - COLLEGIALITY, INTEGRITY, RATIONALITY.\n<br><br>\nCollegiality - We value strong teams. We work together as professional equals. We strive to continuously improve our processes and make realistic assumptions to maintain a reasonable work-life balance. We are trusted to manage our own time. We value ideas, not titles. We happily welcome and consider contrary opinions.\n<br><br>\nIntegrity - We insist on candid relationships with customers, prospective customers, partners, investors, and each other in everything that we do.\n<br><br>\nRationality - We communicate through clear arguments. We decide carefully based on factual evidence. We like calm, systematic, thoughtful solutions. We believe in testing. We never take the assumption that we are building software the \"best\" way, and continuously seek to improve our processes.\n<br><br>\nWho are we and what do we do?\n<br><br>\nGuidewire is a rapidly growing software company that delivers the industry standard platform that Property and Casualty insurers rely upon to stay ahead of the curve in a time of accelerating change. We provide software, services, and partner ecosystem that empower our customers to run, differentiate and grow their business.\n<br>What will I be doing?\n<br>Interns will work on active DevSecOps/Infra projects and not made up intern projects.\n<br>Interns will work as part of scrum team in a 2 week sprint model.\n<br>Interns will have the chance to collaborate and work with DevSecOps/Infra engineers as part of their team, so this will be like a real-time work opportunity for them.\n<br>Slack integration, slack Apps and slack streamlining.\n<br>Tools provisioning and automation using AWS framework.\n<br>Other ad-hoc tasks related to our DevSecOps/Infra team’s needs.\n<br><br>\n<b>Requirements:</b><br>\nPursuing 3rd or final year BS in Computer Science, Computer Engineering or Software Engineering\n<br>Basic AWS/ Infra knowledge\n<br>Scripting language experience like Python/Go. Or React JS framework\n<br>Zest to learn and ramp up on new technologies\n<br>Ability to rapidly absorb new technologies and have the desire to work in a fast-paced environment\n<br>Strong communication and interpersonal skills\n<br>Team player\n<br>Demonstrated problem solving skills\n<br>Have Agile, systematic problem-solving approach, coupled with strong interpersonal skills and a sense of ownership and drive\n<br>About Guidewire\n<br>Guidewire is the platform P&amp;C insurers trust to engage, innovate, and grow efficiently.\n<br><br>\nGuidewire combines core, data, digital, analytics, and AI to deliver our platform as a cloud service. 380 insurers, including the largest and most complex in the world, run on Guidewire.\n<br><br>\nAs a partner to our customers, we continually evolve to enable their success. We are proud of our unparalleled implementation track record with 700+ successful projects, supported by the largest R&amp;D team and partner ecosystem in the industry. Our marketplace provides hundreds of add-ons that accelerate integration, localization, and innovation.\n<br><br>\nGuidewire Software, Inc. is proud to be an equal opportunity and affirmative action employer. We are committed to an inclusive workplace, and believe that a diversity of perspectives, abilities, and cultures is a key to our success. Qualified applicants will receive consideration without regard to race, color, ancestry, religion, sex, national origin, citizenship, marital status, age, sexual orientation, gender identity, gender expression, veteran status, or disability. All offers are contingent upon passing a criminal history and other background checks where it's applicable to the position.\n<br><br>\nDisability Accommodations and Guidewire’s Appeals Process. Guidewire provides accommodations to the hiring process to create a fair opportunity for candidates with disabilities to contend for open positions. Accommodation requests should be directed to (650) 356-4940 or Accommodations@guidewire.com. If things do not go as hoped, we invite you to use our appeals process. Guidewire promises to independently review any denied accommodation and any decision not to offer you the position. The appeals process is the same in either case. Within five business days of receiving a notice of denial of an accommodation, or receiving a notice of your non-selection for a vacancy, call (650) 356-4940 or e-mail Accommodations@guidewire.com to make an appeal. Guidewire will assign a new decision-maker to review the request and/or hiring decision, who will then notify you in writing of a decision within 10 business days.</div><div></div>"
    },
    {
        "position": "Wireless Engineer Intern",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-30T08:00:20.266Z",
        "url": "https://www.simplyhired.com/job/SEfM1_ESysYtOz4ulEa8lbfwgFf-KwYwMXH17V_vFgvgMJsBrUl28A?q=computer+science",
        "lastScraped": "2021-01-31T08:00:20.266Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n<br><br>\nThe Wireless Systems Engineering intern will be part of the Terragraph project under Facebook Connectivity. Terragraph is a high bandwidth wireless mesh network built on commodity radios operating at the 60GHz frequency spectrum. Its goal is to provide multi-gigabits of bandwidth to users in the developing and developed countries at costs much less than fiber. The intern will assist the Terragraph team working on network analysis and optimization tools that assist in the deployment and maintenance of the wireless mesh network. The Terragraph system collects data periodically, which in combination with active tests, is used to track the health of the network. The ideal candidate will have experience in data analysis, machine learning, programming, and wireless networking. The intern will assist the team in generating insights from available data, and tracking and debugging network health issues.\n<br><br>\nAnalyze node and link stats to find patterns and correlations\n<br>Implement ML algorithms to track and debug node and link health issues\n<br>Test deployed and new services\n<br>Implement already-planned improvements and fixes in existing Python code\n<br><br>\nIs in the process of obtaining a Ph.D. in Electrical Engineering, Computer Science, or a related technical field\n<br>Solid knowledge of data analysis and machine learning\n<br>Experience with programming\n<br>Knowledge of wireless communication theory and wireless networking\n<br>Ability to obtain and maintain work authorization in the country of employment</div><div></div>"
    },
    {
        "position": "Research Intern, Deep Learning for On-Device Computer Vision (PhD)",
        "company": "Facebook - 4.2",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-01-30T08:00:20.745Z",
        "url": "https://www.simplyhired.com/job/JOUMvMEeXdHoRC1qupOGdViDHfVkfuaAQjM9uuYTQtoYlHwcv2YAMw?q=computer+science",
        "lastScraped": "2021-01-31T08:00:20.746Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.\n<br><br>\nThe Camera and Sensors group at Facebook Reality Labs (FRL) is developing products for the next generation of augmented and virtual reality. Amongst other focus areas, the group specializes in research and implementation of advanced sensing technologies with an eye towards driving the state of the art. We are looking for candidates with experience in machine learning and image processing to collaborate with our team in pursuit of novel technologies.\n<br><br>\nOur internships are twelve (12) to sixteen (16) weeks long and we have various start dates throughout the year.\n<br><br>\nCollaborate with and support other research scientists and engineers across various disciplines\n<br>Investigate, design and develop novel deep learning based computer vision algorithms for on-device recognition tasks\n<br>Develop tools, scripts and tests to support your project\n<br>Document and present your progress and project\n<br><br>\nCurrently has, or is in the process of obtaining a PhD in Computer Science, Electrical Engineering, or related field\n<br>2+ years of experience with independent research in machine learning algorithms for image processing\n<br>2+ years of experience in Python and associated machine learning frameworks (Pytorch, Keras, TensorFlow)\n<br><b>Interpersonal skills:</b> cross-group and cross-cultural collaboration\n<br>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment</div><div></div>"
    },
    {
        "position": "Sys Integration/Test College Tech Intern",
        "company": "LOCKHEED MARTIN CORPORATION - 4.0",
        "location": {
            "city": "Littleton",
            "state": "CO"
        },
        "posted": "2021-01-30T08:00:21.035Z",
        "url": "https://www.simplyhired.com/job/dc7_qW0wOyeLu-lT4F3FwgIuLGVDioT1rLwVQ0FUZeuJy40y_CPExA?q=computer+science",
        "lastScraped": "2021-01-31T08:00:21.035Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">\"Going to space is just the beginning. It’s what you do when you get there that matters. Lockheed Martin builds the satellites and spacecraft that do amazing things in space for government and commercial customers. Connecting people. Advancing discovery. And protecting what matters most. Lockheed Martin-built satellites give earlier warning of severe weather, connect troops on the battlefield, and deliver GPS directions to a billion people worldwide.\n<br>As we look to the future, we’re driving innovations to help our customers do even more in orbit. That’s why we’re crafting smarter satellites that operate like smartphones in the sky, with apps that can be updated in orbit so they can adapt as mission needs on the ground change. Your mission is ours. And as that mission evolves, we’ll be ready. Will you?\n<br>What does this role look like?\n<br>You will support testing of a major program subsystem. Specific duties will include assisting the certified test conductor on the oversight of subsystem testing. This position will work closely with technical experts and test support staff to meet the demanding needs of our programs.\"\n<br><br>\n<b>Basic Qualifications:</b><br>\nActively enrolled in a Computer Science, Mechanical Engineering, Aerospace Engineering, Electrical Engineering, Math or other related degree program from an accredited college/university. This position requires special access to support the program and requires the selected candidate to be a US Citizen.\n<br><br>\n<b>Desired Skills:</b><br>\nExperience or classroom knowledge of test engineering knowledge, experience with testing hardware, software. Knowledge of CAD and simulation tools. Proficiency in Microsoft Office applications.\n<br><br>\n<b>BASIC QUALIFICATIONS:</b><br>\njob.Qualifications\n<br><br>\nLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.\n<br><br>\nAs a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\n<b>EXPERIENCE LEVEL:</b><br>\nCo-op/Summer Intern</div><div></div>"
    }
]