[
    {
        "position": "Intern",
        "company": "InternSource -",
        "location": {
            "city": "Sacramento",
            "state": "CA"
        },
        "posted": "2021-10-18T17:01:06.947Z",
        "url": "https://www.simplyhired.com/job/RHApqaKbh_CjW-QH7mt_50019WTOWTQs1nX46yuU3Xg6VsWeDyZriA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:03.547Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Title\n<br>Student Intern\n<br><br>\nJob Number\n<br>City 06-17-2021-Estevez\n<br><br>\nPositions Available\n<br>1\n<br><br>\nWorksite\n<br>City of Sacramento\n<br><br>\nSacramento\n<br><br>\nCA\n<br><br>\nPreferred Major\n<br>Computer Science, MIS or related majors\n<br><br>\nSchedule\n<br>20 Hours per week.\n<br><br>\nSalary\n<br>$15-17\n<br><br>\nResponsibilities\n<br><br>\nAnswer and troubleshoot service desk calls\n<br><br>\nPreferred Abilities\n<br><br>\nWorking knowledge of laptop and desktop PC’s\n<br>Ability to answer and troubleshoot service desk calls\n<br>Customer Service experience is preferred\n<br>Working knowledge of software such as MS office\n<br>Knowledge of Android and iOS devices is preferred\n<br><br>\nAdditional Information\n<br>Students hired for this position will be hired through the InternSource (a program of the not-for-profit The Community College Foundation) and work for City of Sacramento. The Community College Foundation is an equal opportunity employer to all regardless of race, color, national origin, ancestry, sex, marital status, disability, religious or political affiliation, age, or sexual orientation. It is the policy of Community College Foundation that the workplace be free from the effects of drug and alcohol abuse.\n<br><br>\nMandatory Qualification\n<br>Applicants must be currently enrolled and attending an accredited California college or university and must maintain a minimum of 6 semester units (or quarter equivalent) and an overall GPA of 2.0\n<br><br>\nClassification\n<br>Intern\n<br><br>\nExperience Level\n<br>None Required\n<br><br>\nEducation Level\n<br>Currently Enrolled in College\n<br><br>\nFinal Filing Date\n<br>12/31/2021</div><div></div>"
    },
    {
        "position": "IT Intern",
        "company": "Assurant - 3.5",
        "location": {
            "city": "Miami",
            "state": "FL"
        },
        "posted": "2021-10-18T17:01:11.080Z",
        "url": "https://www.simplyhired.com/job/X_ZbCmbkXm-pWuxPyK1SvlTqrluSAbMQVjE5b629LfaaN-ZNw-FuBA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:07.338Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">The IT Intern program (The Program) is a program designed for current and soon to be college graduates to gain a well-rounded introduction and experience in Information Technology. The Program will focus on one or more of the following disciplines: Application Development, Systems Engineering, and Business Analysis.\n<br><br>\nThe Program is paid internship consisting of one semester (12 to 16 weeks) focused in a discipline above or several semesters in rotation across the disciplines outlined above. The intern will be assigned a mentor for each discipline that they work on. The mentor will provide guidance, coaching, and training on the respective discipline. The Program includes both training and project work. The Intern must receive positive reviews in order to continue in the program.\n<br><br>\nThe IT Intern position is recognized as part-time employment at Assurant for the duration of the program. In order to progress beyond Internship, there needs to be a combination of exceptional performance as well as an open position that the intern could be placed into based on the discipline that best meets the skillset of the intern and the needs of the department and overall organization.\n<br><br>\nThe primary job accountabilities and responsibilities will vary depending on the discipline that the intern is engaged in. For each discipline, job responsibilities are as follows:\n<br><br>\nApplication Development\n<br><br>\nDevelop applications in various languages and disciplines, which may include the following areas of focus:\n<br><br>\nC#, VB.NET, Java\n<br><br>\nIDE’s – Visual Studio or Eclipse\n<br><br>\nObject Oriented design and development – MVC, Entity Framework\n<br><br>\nWeb Development – HTML, CSS, JavaScript and Frameworks\n<br><br>\nPlatforms – Windows/IIS, Unix – Unix/Apache/Tomcat\n<br><br>\nTest Driven Development – Nunit, Junit\n<br><br>\nDeployment Tools – NuGet, Ant, TFS-MSBuild\n<br><br>\nXML\n<br><br>\nInformation Architecture\n<br><br>\nUser Interface Usability and Design\n<br><br>\nCollaborate with business analysts and business users to ensure that development work will meet the needs and expectations of the business.\n<br><br>\nResearch, solve for, and engage others as necessary to develop code that will result in the desired business outcome. The intern must be able to work and think independently in order to produce working code at a reasonable pace.\n<br><br>\nPerform system testing on all code produced to uncover and resolve defects prior to engaging others in evaluating functionality.\n<br><br>\nWork through and resolve production issues for applications supported by the department or functional area.\n<br><br>\nPrepare documentation on work produced to ensure a smooth handoff to other developers as needed.\n<br><br>\nSystems Engineering\n<br><br>\nSupport in-house and vendor applications, which may include the following activities:\n<br><br>\nOperational Support of Enterprise Applications\n<br><br>\nProvide day-to-day support for large scale enterprise applications utilized across the entire organization.\n<br><br>\nProvide analysis, design, testing, debugging, maintenance, and documentation for complex enterprise applications. This requires expertise across multiple platforms, operating systems and tools. Understanding of various disciplines and technologies, such as web, directory services, directory synchronization, security, databases, networking, infrastructure and application development is key.\n<br><br>\nDocument processes and procedures of implemented changes.\n<br><br>\nManage and document procedures to maintain the long-term health of applications including monitoring, auditing, disaster recovery and business continuity and security compliance\n<br><br>\nOffer understanding of the configuration and usage of complex enterprise applications.\n<br><br>\nEnsure applications and systems are maintained, secure and current.\n<br><br>\nDrive Successful Delivery of Application Solutions\n<br><br>\nParticipate in focused technical teams to successfully support a small set of applications on strategic projects.\n<br><br>\nEnsure successful and timely delivery of vendor-based software solutions, through individual contribution, while working with cross-functional teams and acting as a technical resource.\n<br><br>\nPerform project requests, assignments and deliverables for platform-specific implementations. This includes installation and maintenance of all applications and web server software, configuration of load balancers, and migration of resource and code changes as needed.\n<br><br>\nSuccessfully assist in the transition of applications from an implementation phase to ongoing support by driving the completion of appropriate documentation, monitoring configuration and support procedures.\n<br><br>\nPrepare documentation on work produced to ensure a smooth handoff to other system engineers as needed.\n<br><br>\nBusiness Analysis\n<br><br>\nServe as a liaison between business areas and Information Technology on one or more projects. Activities include:\n<br><br>\nCommunicate with business users to understand their needs and document their requirements.\n<br><br>\nTranslate business requirements into functional requirements and technical specifications.\n<br><br>\nPresent requirements to developers.\n<br><br>\nWrite test scripts, test plans and perform application testing as needed.\n<br><br>\nCoordinate testing among several users and keep track of results.\n<br><br>\nManage defects identified through testing and ensure proper resolution.\n<br><br>\nOutline communication plans and manage the communication process.\n<br><br>\nFacilitate meetings\n<br><br>\nTake and distribute meeting minutes and action items.\n<br><br>\nResearch how existing technology is used by business or IT resources and determine how changes or upgrades may impact such resources.\n<br><br>\nAnalyze business processes and make recommendations for improvement\n<br><br>\nAssist project team as needed to ensure project success.\n<br><br>\nWork through and resolve production issues for applications supported by the department or functional area.\n<br><br>\nPrepare documentation on work produced to ensure a smooth handoff to other Business Analysts as needed.\n<br><br>\nBasic Qualifications Required - Experience, Skills, and Knowledge\n<br><br>\nEducation\n<br><br>\n<b>Prefers a Bachelor's degree in one of the following areas:</b><br>\nManagement Information Systems\n<br><br>\nComputer Science\n<br><br>\nInformation Technology\n<br><br>\nSoftware Development\n<br><br>\nApplication Architecture\n<br><br>\nSolutions Architecture\n<br><br>\nApplication implementation/Systems Engineering\n<br><br>\nIndustrial Engineering\n<br><br>\nBusiness Administration\n<br><br>\nWill consider candidates with a Bachelor's degree in any other STEM disciplines with a minimum 3.0 GPA and 1+ years of technical skills training.\n<br><br>\nFor candidates nearing graduation with a Bachelor’s degree in areas as noted above, completion of the degree helps demonstrate exceptional performance for progression beyond Internship.\n<br><br>\nPrevious Experience\n<br><br>\nExperience attained through the successful completion of one of the Bachelor’s Degrees outlined above, including but not limited to:\n<br><br>\nProject Work\n<br><br>\nPresentations\n<br><br>\nTeam Work\n<br><br>\nKnowledge and Skills\n<br><br>\nKnowledge and Skills attained through the successful completion of one of the Bachelor’s Degrees outlined above, including but not limited to:\n<br><br>\nPresentation Skills\n<br><br>\nAbility to meet deadlines\n<br><br>\nAbility to work under pressure\n<br><br>\nAbility to work in teams to accomplish a common goal\n<br><br>\nAbility to demonstrate logical thinking\n<br><br>\nEnvironment/Physical Demands\n<br><br>\nThis position requires incumbents to regularly sit at a desk and operate standard office equipment such as a computer and phone. Employee is occasionally required to stand and walk, lift, carry and/or move up to 10 pounds. Specific vision abilities required by this job include close vision and the ability to adjust focus. Must be able to talk and hear. Required to use hands to finger, handle, or feel objects, tools or controls. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nTravel\n<br><br>\nAlthough travel is not anticipated, project and business needs may require up to 10% travel.\n<br><br>\nPreferred Experience, Skills, and Knowledge\n<br><br>\nEducation\n<br><br>\nFor All Programs (Application Development, Systems Engineer, Business Analysis)\n<br><br>\nBachelor’s Degree with a GPA of 3.25 or greater in one of the areas outlined.\n<br><br>\nMaster’s Degree in any of the areas outlined above.\n<br><br>\nKnowledge and Skills\n<br><br>\nFor All Programs (Application Development, Systems Engineer, Business Analysis)\n<br><br>\nStrong aptitude for IT processes, systems/process improvement, quality assurance and/or project management.\n<br><br>\nCandidate must be perceived as ambitious, enthusiastic, self-confident, versatile and willing to learn.\n<br><br>\nCandidate must possess excellent interpersonal skills and have the ability to work individually and in a team environment.\n<br><br>\nCandidate must be able to communicate effectively, build credibility and trust, analyze problems and make decisions, and learn continuously.\n<br><br>\nCandidate must possess leadership qualities (leading self and others)\n<br><br>\n<b>For Business Analysis Programs (or rotations):</b><br>\nExperience facilitating meetings, taking meeting minutes and distributing action items to the appropriate audience.\n<br><br>\nAn understanding of the project life cycle and the ability to interact effectively with management personnel.\n<br><br>\nAn understanding of the Software Development Life Cycle (SDLC) and the ability to interact effectively with technical personnel.\n<br><br>\nAn understanding of SDLC methodologies.\n<br><br>\nAcademic experience creating written IT communications\n<br><br>\n<b>For Systems Engineering Programs (or rotations):</b><br>\nStudy of the implementation of web applications and infrastructure in either Microsoft of UNIX-based technologies (Systems Engineering)\n<br><br>\nKnowledge and understanding of supporting application infrastructure including directories (Active Directory, LDAP), load balancers (BigIP), operating systems (Linux, Windows) and databases (Oracle, SQL Server)\n<br><br>\nKnowledge of Agile development projects and support of business developers\n<br><br>\nKnowledge of application architecture, design, and development\n<br><br>\nUnderstanding of IT projects around reporting, print, storage, imaging and output\n<br><br>\nStudy of core Microsoft Technologies (Biztalk, Dynamics-CRM, Team Foundation Server, Office365, SharePoint) preferred\n<br><br>\nKnowledge of tools to provide for the monitoring and automation of application support tasks.\n<br><br>\nKnowledge of application security requirements and appropriate separation of duties and data management.\n<br><br>\nAwareness of cloud technologies for applications (Azure, Amazon Web Services, Office 365, etc.)\n<br><br>\nKnowledge of application automation and deployment tools and scripting\n<br><br>\nAn understanding of the project life cycle and the ability to interact effectively with management personnel.\n<br><br>\n<b>For Application Development Programs (or rotations):</b><br>\nSchool-level proficiency a programming language and some of these disciplines:\n<br><br>\nC#, VB.NET, Java\n<br><br>\nIDE’s – Visual Studio or Eclipse\n<br><br>\nObject Oriented design and development – MVC, Entity Framework\n<br><br>\nWeb Development – HTML, CSS, JavaScript and Frameworks\n<br><br>\nPlatforms – Windows/IIS, Unix – Unix/Apache/Tomcat\n<br><br>\nTest Driven Development – Nunit, Junit\n<br><br>\nDeployment Tools – NuGet, Ant, TFS-MSBuild\n<br><br>\nXML\n<br><br>\nInformation Architecture\n<br><br>\nUser Interface Usability and Design\n<br><br>\nAn understanding of the Software Development Life Cycle (SDLC) and the ability to interact effectively with technical personnel and business analysts.\n<br><br>\nAn understanding of SDLC methodologies and related tools.\n<br><br>\nMethodologies - Agile / SCRUM / Waterfall\n<br><br>\nTools - TFS, JIRA\n<br><br>\nPrevious Experience\n<br><br>\nExperience applying the knowledge and skills described above in academic or non-academic assignments (i.e. School projects or Internships). Application in non-academic assignments a plus.</div><div></div>"
    },
    {
        "position": "Computer Science Summer 2022 Intern – Undergraduate",
        "company": "Medtronic - 3.9",
        "location": {
            "city": "Minneapolis",
            "state": "MN"
        },
        "posted": "2021-10-18T17:01:15.112Z",
        "url": "https://www.simplyhired.com/job/gcJV25mM6u9ZHhtRXct9lfqilNNhMy6P4UgSwbIpjyMpOKqZUFyanA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:11.480Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Careers That Change Lives\n<br><br>\nThe possibilities at the intersection of medicine and technology are endless, which means endless opportunities to make your mark on the world. Our interns do real work within experienced engineering teams to improve lives of millions. Here you can:\n<br><br>\nCollaborate on code to make it more elegant.\n<br>Dig into huge datasets to extract value.\n<br>Build solutions to help doctors and patients monitor progress via telemedicine.\n<br>Get real world experience on a project you own.\n<br>Build your confidence and skills at the world leader.\n<br>Work with firmware, mobile, coding, verification, sensors, and testing teams.\n<br><br>\nWith our expanding portfolio of innovative products and services, Medtronic is the global leader in delivering healthcare solutions for over 70+ disease states in 150+ countries.\n<br><br>\nThese full-time (40 hours/week), paid positions that are 11-12 weeks in length. We offer housing assistance (for out of state interns), relocation expense reimbursement, and educational and social events throughout the summer. We have summer internship opportunities available across the U.S; including Minnesota, California, Colorado, Connecticut, Arizona, Massachusetts, Tennessee and Florida.\n<br><br>\nA Day in the Life\n<br><br>\nYou will use software engineering tools and methods to define requirements and to design, verify, and implement your project. Under the direction of a more experienced engineer, you will prepare plans for your own work, participate in technical reviews, implement advances in current state-of-the-art technology and identify opportunities for productivity and quality improvement.\n<br><br>\nWithin the Software Development Life Cycle, you may use agile methods to explore AI, ML, DevOps, cloud infrastructure, mobile, GUI.\n<br><br>\n<b>Must Haves:</b><br>\nTo be considered for a summer 2022 engineering internship, you must meet the following basic requirements. How you meet these criteria, must be clearly indicated on your resume to be considered for a position.\n<br><br>\nBachelor’s degree student with a sophomore or junior level class standing\n<br>Working towards a bachelor’s degree in computer science, data science, computer or software engineering, electrical engineering or related engineering major\n<br>A minimum 3.0 out of a 4.0 cumulative GPA\n<br>Legally authorized to work in the U.S. on a full-time basis and does not require sponsorship in the future for an employment visa\n<br>Participants must be able to participate full time (40 hours/week) as part of our intern cohort:\n<br>Monday, June 6 - Friday, August 19\n<br>If you attend a Medtronic Targeted School and meet the basic qualifications above, apply on your school’s career services website to one of our engineering intern job postings by the fall deadline listed on the site to be considered for an on campus interview\n<br><br>\n<b>Nice to Haves:</b><br>\nKnowledge of one or more of the following technologies is required: C, C++, C#, .NET, Java, Angular, Web Technologies, Xamarin, mobile technologies, design patterns, SQL, Database technologies, XML, Perl, Python, MATLAB\n<br><b>Familiarity or interest in one or more of the following areas:</b> Agile, Scrum, DevOps, Continuous Integration/Continuous Development (CI/CD) Pipeline, Version Control, TFS, Azure DevOps, GitHub, Product documentation, Process Documentation\n<br>Strong verbal/written communication skills\n<br>Prior work on projects in a team environment preferred\n<br>Relevant academic projects, internship or lab experience preferred\n<br><br>\nAbout Medtronic\n<br><br>\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n<br><br>\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\n<br><br>\nPhysical Job Requirements\n<br><br>\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nWhile performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.</div><div></div>"
    },
    {
        "position": "URBN Summer 2022 Internship: Supply Chain, Finance, Software Engineering, IT",
        "company": "URBN - Vetri Family -",
        "location": {
            "city": "Pennsylvania",
            "state": "Pennsylvania"
        },
        "posted": "2021-10-18T17:01:19.032Z",
        "url": "https://www.simplyhired.com/job/oiWeuqnhnNXHvd9HdUVGCWW4X_iz8WUYyAh7CCv-XdC-82voZko3HQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:15.491Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">URBN 2022 Summer Internship\n<br><br>\nSupply Chain, Finance, Software Engineering, IT\n<br><br>\nFor the Summer 2022 Internship Program, URBN offers a large range of opportunities within it’s Shared Services division, which supports all brands across the organization. These internship opportunities include the below:\n<br><br>\nSupply Chain\n<br>Finance\n<br>Software Engineering\n<br>Information Technology\n<br><br>\nAt URBN, we pride ourselves on more than just our unique products and successful portfolio of brands. We create unique retail experiences with an eye toward creativity and a singular focus on pleasing our customer. We source the best of the best talent to drive our business forward, and our Interns are a crucial part of that equation.\n<br><br>\n<b>Overview:</b><br>\nEach summer URBN Inc. welcomes candidates from across the country to immerse themselves within teams across our portfolio of brands and gain paid, hands-on learning experience in the area of business which they choose to pursue. For 10 weeks, interns will share in the unique culture &amp; perks found at our Home Office in the historic Philadelphia Navy Yard, while developing the skills to succeed in a fast-paced retail environment. Our selective program also offers a summer full of intern events, small group exposure to leadership, insight into company initiatives, off-site field trips &amp; even a chance full time job opportunity. See for yourself what our past &amp; present interns are up to @urbn_internships &amp; #myurbnsummer !\n<br><br>\nThe 2022 Summer Internship Program dates are to be determined. Summer Internships typically run from June to August.\n<br><br>\nSupply Chain\n<br><br>\n<b>Responsibilities include but not limited to:</b> This role will assist in the analysis and development of supply chain metrics and business processes. Assist with the development of standards using engineering time study methodology. The ideal candidate will have related education in Supply Chain Logistics, Operations Management, Engineering (Industrial, Packaging) along with have strong data management and Excel skills.\n<br><br>\nFinance\n<br><br>\n<b>Responsibilities include but not limited to:</b> This role will analyze the company’s economic performance, assist with budget and financial statement preparation, and assist with creating supporting documents and reports. Ideal candidate will have related education or internship experience in Finance, Economics and Business Operations.\n<br><br>\nSoftware Engineering\n<br><br>\n<b>Responsibilities include but not limited to:</b> This role will collaborate on software projects in collaboration with product design, develop, release, and maintain services and/or infrastructure and lead individual project priorities, deadlines, and deliverables. Ideal candidate will have related education or internship experience in Software Engineering, Computer Science, Data Science or related technical field. Experience of programming languages also preferred.\n<br><br>\nInformation Technology\n<br><br>\n<b>Responsibilities include but not limited to:</b> This role will analyze computer system requirements for information and functional operations, manage IT inventory assets ad support all IT standard related issues. Ideal candidate will have related education or internship experience in Information Technology or related field.\n<br><br>\nWhat to Submit\n<br><br>\nResume\n<br>Optional portfolio, website, additional relevant links / information\n<br>Creative project may be assigned later in the interview process\n<br><br>\n<b>Summer Internship Program Application Process:</b><br>\nSelect the one bucketed internship posting that best suits your interests &amp; skills. You will be considered for various opportunities throughout the brands from this application via our careers website. If there is a project component in the application (see above), it is required that you submit this to be considered for a position.\n<br><b>Complete HireVue:</b> Candidates selected will receive an email with a link to complete a HireVue Video Interview. You will have 2 days to complete this portion of the application once the email is received.\n<br>Video interviews will be scheduled with our internal teams, continuing on a rolling basis through the winter until each has selected the best fitting candidate for their role.\n<br>Please be flexible &amp; patient with us as we all work to navigate these unsure times :)\n<br><br>\nDon’t forget to check out urbn.com/internships and @urbn_internships on Instagram to learn more! Should you have any questions regarding the application process, please email homeofficeinternships@urbn.com.\n<br><br>\nUrban Outfitters, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.</div><div></div>"
    },
    {
        "position": "Computer Engineering Summer 2022 Intern – Undergraduate",
        "company": "Medtronic - 3.9",
        "location": {
            "city": "Minneapolis",
            "state": "MN"
        },
        "posted": "2021-10-18T17:01:22.997Z",
        "url": "https://www.simplyhired.com/job/BMdGpDL27GFhcw72imgvKOwJjDd6L8EXSHRq9aDfIIiGuMfYY3Va9w?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:19.407Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Careers That Change Lives\n<br><br>\nThe possibilities at the intersection of medicine and technology are endless, which means endless opportunities to make your mark on the world. Our interns do real work within experienced engineering teams to improve lives of millions. Here you can:\n<br><br>\nCollaborate on code to make it more elegant.\n<br>Build solutions to help doctors and patients monitor progress via telemedicine.\n<br>Get real world experience on a project you own.\n<br>Build your confidence and skills at the world leader.\n<br>Work with firmware, mobile, coding, verification, sensors, and testing teams.\n<br>Dig into huge datasets to extract value.\n<br><br>\nYou have learned a lot to get here — we want you to keep growing. With our expanding portfolio of innovative products and services, Medtronic is the global leader in delivering healthcare solutions for over 70+ disease states in 150+ countries.\n<br><br>\nThese are full-time (40 hours/week), paid positions that are 11-12 weeks in length. We offer housing assistance (for out of state interns), relocation expense reimbursement, and educational and social events throughout the summer. We have summer internship opportunities available across the U.S; including Minnesota, California, Colorado, Connecticut, Arizona, Massachusetts, Tennessee and Florida.\n<br><br>\nA Day in the Life\n<br><br>\nYou will use software engineering tools and methods to define requirements and to design, verify, and implement your project. Under the direction of a more experienced engineer, you will prepare plans for your own work, participate in technical reviews, implement advances in current state-of-the-art technology and identify opportunities for productivity and quality improvement. You will test for product integration and verification, conducting those tests based on design specifications, and will prepare formal documentation.\n<br><br>\n<b>Must Haves:</b><br>\nTo be considered for a summer 2022 engineering internship, you must meet the following basic requirements. How you meet these criteria must be clearly indicated on your resume to be considered for a position.\n<br><br>\nBachelor’s degree student with a sophomore or junior level class standing\n<br>Working towards a bachelor’s degree in computer or software engineering, computer science or related engineering major\n<br>A minimum 3.0 out of a 4.0 cumulative GPA\n<br>Legally authorized to work in the U.S. on a full-time basis and does not require sponsorship in the future for an employment visa\n<br>Participants must be able to participate full time (40 hours/week) as part of our intern cohort:\n<br>Monday, June 6 - Friday, August 19\n<br>If you attend a Medtronic Targeted School and meet the basic qualifications above, apply on your school’s career services website to one of our engineering intern job postings by the fall deadline listed on the site to be considered for an on campus interview\n<br><br>\n<b>Nice to Haves:</b><br>\n<b>Knowledge of one or more of the following technologies:</b> C, C++, C#/.NET, Java, Web Technologies, design patterns, Database technologies, XML, Perl, Python, MATLAB\n<br>Prior work on projects in a team environment preferred\n<br>Relevant academic projects, internship or lab experience preferred\n<br><br>\n<b>Physical Job Requirements:</b><br>\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\n<br><br>\nAbout Medtronic\n<br><br>\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n<br><br>\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.</div><div></div>"
    },
    {
        "position": "Project Management Intern - Summer 2022",
        "company": "Silicon Labs - 4.3",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2021-10-18T17:01:26.845Z",
        "url": "https://www.simplyhired.com/job/ctxvPdd4OCgK4uA8jxHFWDbEuDe9oVy189HrJgXvsvrbdOno4bc45w?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:23.363Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">We are Silicon Labs. We are a leader in secure, intelligent wireless technology for a more connected world. Our integrated hardware and software platform, intuitive development tools, unmatched ecosystem and robust support make us the ideal long-term partner in building advanced industrial, commercial, home and life applications. We make it easy for developers to solve complex wireless challenges throughout the product lifecycle and get to market quickly with innovative solutions that transform industries, grow economies and improve lives.\n<br><br>\nAs a Silicon Labs Project Management Intern you will obtain a deep understanding of Project Management, Organizational Change Management (OCM) and collaborate within the Central R&amp;D Organization on a global basis. You will also have the opportunity to assist the Chief of Staff with building state of the art PMO processes, templates, and tools.\n<br><br>\nAnd don’t worry, you’ll still have plenty of opportunities to learn, network, and develop new skills through our social events, development lectures, and volunteer opportunities.\n<br><br>\n<b>What You’ll Do:</b><br>\nProjects are specifically tailored to each intern, ensuring a meaningful contribution to both your skillset and Silicon Labs. Here are just a few of the challenges you might get to tackle:\n<br><br>\nCollaborate with diverse partners to drive projects for the Central R&amp;D organization\n<br>Manage a short-term project, under the Sr. Program Manager’s guidance, that will contribute to business value with high impact\n<br>Partake in all aspects of project management for the assigned project including scoping, planning, timelines, resource allocation and budgets (if applicable)\n<br>Learn to create impactful status reports for Leadership, and communications geared to the program stakeholders\n<br>Work on ad-hoc analysis and documentation of business processes to provide insights and recommendations\n<br><br>\n<b>Who You Are:</b><br>\nYou are an innovator, builder, and tinkerer. You have a curious mind and a drive to succeed. You want to work with a global team of technology enthusiasts and design pioneers. Here’s what you need:\n<br><br>\nCompletion of 2+ years of study\n<br>Enrollment in BS/MS/MBA Information Systems, Computer Science, or Statistics\n<br>Passion for tech industry and demonstrated interest in business (such as through major/minor, past work experience, extracurriculars)\n<br>Comfortable with Microsoft Office Suite – MS Word, PowerPoint, Excel\n<br>Good analytical and organizational skills\n<br>Detail-oriented\n<br>Strong interpersonal, written and verbal skills\n<br>Problem solving skills\n<br>Ability to summarize and communicate important data\n<br>You enjoy working well with others in a fast-paced environment\n<br><br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div><div></div>"
    },
    {
        "position": "IT Intern",
        "company": "Uline - 3.1",
        "location": {
            "city": "Pleasant Prairie",
            "state": "WI"
        },
        "posted": "2021-10-18T17:01:30.781Z",
        "url": "https://www.simplyhired.com/job/DY8m1lyV5Q9D6sSPZ-Z6uqez4fwvD71QFdJNScUg5CrHJ197hrxS1A?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:27.202Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Software Developer Internship\n<br>Paid Internship - Summer 2022\n<br>Corporate Headquarters\n<br>12575 Uline Drive, Pleasant Prairie, WI 53158\n<br><br>\nUline seeks summer 2022 Software Developer Interns at its Corporate Headquarters in Pleasant Prairie, WI.\n<br><br>\nUncover your full potential in a collaborative environment where you'll design, develop and deliver custom solutions to big challenges. And you'll be doing it for a proven industry leader that runs one of the largest e-commerce sites in the U.S.\n<br><br>\nUline's 200+ person IT Department is working on some of the largest and most challenging custom development projects in the Chicago and Milwaukee areas. We are undertaking an impressive modernization initiative to replace our legacy systems. Whether we're improving our customer experience or supporting our internal business units, Uline's IT Department seeks to do it the best way.\n<br><br>\nBetter together than apart. This position is on-site, and we are looking for good people who share our passion.\n<br><br>\nUline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment hair follicle drug screening.\n<br><br>\nPosition Responsibilities\n<br>Participate in Full-Stack application design and development.\n<br>Work in an Agile Scrum team to develop software using technologies like Java, Angular, C#, .NET, JPA, Hibernate, REST and SQL.\n<br>Collaborate using GIT to track source code changes.\n<br>Troubleshoot and resolve software-related issues.\n<br>Maintain code quality through unit testing.\n<br>Work with business analysts to gather requirements.\n<br><br>\nMinimum Requirements\n<br>This internship is open to Sophomores and Juniors majoring in Information Technology / Computer Science or a related field.\n<br>Two semesters of programming a must.\n<br>Solid communication skills and willingness to work in a team environment a must.\n<br>Detail-oriented, hardworking and enthusiastic.\n<br>Able to work independently when requested.\n<br><br>\nBenefits of a Uline Internship\n<br>Gain professional work experience by working on meaningful business projects.\n<br>All Uline interns are assigned a dedicated mentor.\n<br>Work in a positive, collaborative environment.\n<br>Learn about the industry from all levels of Uline management.\n<br>Potential opportunity for full-time employment upon graduation\n<br>Housing available for those who live more than 50 miles away.\n<br><br>\nIntern Perks\n<br>On-site cafe with meals and dinner-to-go options prepared by executive chefs.\n<br>First-class fitness center with sauna and complimentary personal trainers.\n<br>Over four miles of beautifully maintained walking trails.\n<br>Outings throughout the summer with interns across all departments.\n<br>Events hosted throughout the summer for interns across all departments.\n<br>Intern-specific \"Lunch and Learns\" and development opportunities.\n<br><br>\nAbout Uline\n<br><br>\nUline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800+ page catalog of over 38,500 quality products and same-day shipping of our huge in-stock inventory. With over 8,000 employees across 12 locations, it's time you joined Uline.\n<br><br>\nEach resume submitted gets individually reviewed by our team and retained for 24 months in case a great opportunity opens for you to join our Uline family.\n<br><br>\nApply online today to join us in 2022!\n<br><br>\nEEO/AA Employer/Vet/Disabled\n<br><br>\n#LI-POST\n<br>#CORP\n<br><br>\nOur employees make the difference and we are committed to offering exceptional benefits and perks! Explore Uline.jobs to learn more!</div><div></div>"
    },
    {
        "position": "C++ Software Engineering Student Internship - Spring 2022 - ACL",
        "company": "Georgia Tech Research Institute - 4.2",
        "location": {
            "city": "Dayton",
            "state": "OH"
        },
        "posted": "2021-10-18T17:01:34.729Z",
        "url": "https://www.simplyhired.com/job/WDFjsaU6ow-ri4rrWeap67NYwN1A3qArlL-Baa0b3eCNjDx2s9udEA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:31.155Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">GTRI's Dayton Field Office seeks undergraduate students for a 12- to 14-week Spring Semester internship. The position will primarily involve software development work on an open-source modeling and simulation engine. If selected for this internship, your contributions will not only make a difference to our research projects, but will also be visible to others by virtue of the open source nature of this tool.\n<br><br>\n<b>This internship will involve:</b><br>\n<ul><li>Writing, testing, and evaluating C++ code.</li><li>Integrating new features into an existing project.</li><li>Collaboration and clear, professional communication with teammates and stakeholders</li></ul>\nThis position is available for both remote and in-person work.\n<br><br>\nRequired Minimum Qualifications\n<br><br>\nIntern\n<br><br>\nPursuing a Bachelor’s degree in Computer Science, Computer Engineering, Aerospace Engineering, or Mechanical Engineering\n<br>3.0 or higher cumulative GPA\n<br>Preferred Qualifications\n<br>Demonstrated experience with object-oriented C++\n<br>Experience with other languages like Python and XML\n<br>Strong math skills and ability to learn complex engineering concepts\n<br>Familiarity with Linux, GNU utilities, and bash terminal work\n<br>An understanding of version control systems, especially git\n<br>Experience working with technical teams\n<br>Strong verbal and written communication skills to both technical and non-technical audiences\n<br>Experience with physics-based modelling and simulation tools\n<br>Hours per Week\n<br><br>\n40 hours per week\n<br><br>\nU.S. Citizenship Requirements\n<br><br>\nDue to our research contracts with the US federal government, candidates for this position are required to be US Citizens.\n<br><br>\nClearance Type Required\n<br><br>\nNone\n<br><br>\nHousing and Relocation\n<br><br>\nHousing and relocation assistance are not available for this position.\n<br><br>\nDiversity &amp; Inclusion</div><div></div>"
    },
    {
        "position": "C++ Software Engineering Student Internship -Spring 2022- ACL",
        "company": "Georgia Tech Research Institute - 4.2",
        "location": {
            "city": "Dayton",
            "state": "OH"
        },
        "posted": "2021-10-18T17:01:38.695Z",
        "url": "https://www.simplyhired.com/job/GX3GiqbkNMKLIDY7y5m9yJDCQKF_DI9ZSXFdjDnVdefkxtsHGwxuYQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:35.112Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">GTRI's Dayton Field Office seeks undergraduate students for a 12- to 14-week Spring Semester internship. The position will primarily involve software development work on an open-source modeling and simulation engine. If selected for this internship, your contributions will not only make a difference to our research projects, but will also be visible to others by virtue of the open source nature of this tool.\n<br><br>\n<b>This internship will involve:</b><br>\n<ul><li>Writing, testing, and evaluating C++ code.</li><li>Integrating new features into an existing project.</li><li>Collaboration and clear, professional communication with teammates and stakeholders</li></ul>\nThis position is available for both remote and in-person work.\n<br><br>\nRequired Minimum Qualifications\n<br><br>\nIntern\n<br><br>\nPursuing a Bachelor’s degree in Computer Science, Computer Engineering, Aerospace Engineering, or Mechanical Engineering\n<br>3.0 or higher cumulative GPA\n<br>Preferred Qualifications\n<br>Demonstrated experience with object-oriented C++\n<br>Experience with other languages like Python and XML\n<br>Strong math skills and ability to learn complex engineering concepts\n<br>Familiarity with Linux, GNU utilities, and bash terminal work\n<br>An understanding of version control systems, especially git\n<br>Experience working with technical teams\n<br>Strong verbal and written communication skills to both technical and non-technical audiences\n<br>Experience with physics-based modelling and simulation tools\n<br>Hours per Week\n<br><br>\n10–20 hours per week\n<br><br>\nU.S. Citizenship Requirements\n<br><br>\nDue to our research contracts with the US federal government, candidates for this position are required to be US Citizens.\n<br><br>\nClearance Type Required\n<br><br>\nNone\n<br><br>\nHousing and Relocation\n<br><br>\nHousing and relocation assistance are not available for this position.\n<br><br>\nDiversity &amp; Inclusion</div><div></div>"
    },
    {
        "position": "Software Developer Internship",
        "company": "Uline - 3.1",
        "location": {
            "city": "Pleasant Prairie",
            "state": "WI"
        },
        "posted": "2021-10-18T17:01:42.595Z",
        "url": "https://www.simplyhired.com/job/JYRhgK6Mib7EWXpHUAMrNLfIyNM86vzNR9o0cs-gMW9LPsoAvbBglg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:39.047Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Paid Internship - Summer 2022\n<br>Corporate Headquarters\n<br>12575 Uline Drive, Pleasant Prairie, WI 53158\n<br><br>\nUline seeks summer 2022 Software Developer Interns at its Corporate Headquarters in Pleasant Prairie, WI.\n<br><br>\nUncover your full potential in a collaborative environment where you'll design, develop and deliver custom solutions to big challenges. And you'll be doing it for a proven industry leader that runs one of the largest e-commerce sites in the U.S.\n<br><br>\nUline's 200+ person IT Department is working on some of the largest and most challenging custom development projects in the Chicago and Milwaukee areas. We are undertaking an impressive modernization initiative to replace our legacy systems. Whether we're improving our customer experience or supporting our internal business units, Uline's IT Department seeks to do it the best way.\n<br><br>\nBetter together than apart. This position is on-site, and we are looking for good people who share our passion.\n<br><br>\nUline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment hair follicle drug screening.\n<br><br>\nPosition Responsibilities\n<br>Participate in Full-Stack application design and development.\n<br>Work in an Agile Scrum team to develop software using technologies like Java, Angular, C#, .NET, JPA, Hibernate, REST and SQL.\n<br>Collaborate using GIT to track source code changes.\n<br>Troubleshoot and resolve software-related issues.\n<br>Maintain code quality through unit testing.\n<br>Work with business analysts to gather requirements.\n<br><br>\nMinimum Requirements\n<br>This internship is open to Sophomores and Juniors majoring in Information Technology / Computer Science or a related field.\n<br>Two semesters of programming a must.\n<br>Solid communication skills and willingness to work in a team environment a must.\n<br>Detail-oriented, hardworking and enthusiastic.\n<br>Able to work independently when requested.\n<br><br>\nBenefits of a Uline Internship\n<br>Gain professional work experience by working on meaningful business projects.\n<br>All Uline interns are assigned a dedicated mentor.\n<br>Work in a positive, collaborative environment.\n<br>Learn about the industry from all levels of Uline management.\n<br>Potential opportunity for full-time employment upon graduation\n<br>Housing available for those who live more than 50 miles away.\n<br><br>\nIntern Perks\n<br>On-site cafe with meals and dinner-to-go options prepared by executive chefs.\n<br>First-class fitness center with sauna and complimentary personal trainers.\n<br>Over four miles of beautifully maintained walking trails.\n<br>Outings throughout the summer with interns across all departments.\n<br>Events hosted throughout the summer for interns across all departments.\n<br>Intern-specific \"Lunch and Learns\" and development opportunities.\n<br><br>\nAbout Uline\n<br><br>\nUline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800+ page catalog of over 38,500 quality products and same-day shipping of our huge in-stock inventory. With over 8,000 employees across 12 locations, it's time you joined Uline.\n<br><br>\nEach resume submitted gets individually reviewed by our team and retained for 24 months in case a great opportunity opens for you to join our Uline family.\n<br><br>\nApply online today to join us in 2022!\n<br><br>\nEEO/AA Employer/Vet/Disabled\n<br><br>\n#LI-POST\n<br>#CORP\n<br><br>\nOur employees make the difference and we are committed to offering exceptional benefits and perks! Explore Uline.jobs to learn more!</div><div></div>"
    },
    {
        "position": "Computer Vision Engineer Intern",
        "company": "Sixish Inc -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-10-18T17:01:46.478Z",
        "url": "https://www.simplyhired.com/job/0ZqEjr-DsUjnutD2rH6I1ZQN3IBCp0Y2JXvi_f5aj0xd0BOuGB9Qrw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:42.974Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>About Us: </b><br>Sixish is an AI Startup providing innovative analytics to small businesses. Driving consumer engagement, traffic, forecasts, and sales, our technology has been spotlighted by our partner, Nvidia, as well as by Microway.</p><p><b>Job Summary: </b><br>Computer vision systems can “see,” but they don’t recognize images without training. Our vision engineers help computer models to home in on specific images and recognize them. Our vision engineers are provided a platform that allows them to draw bounding boxes around specific images and label them in a way that the model can understand.</p><p>Our vision engineers require skill and attention to detail. For example, a vision engineer must draw the bounding box around only the part of the image that the model that has the characteristics described in the label, whether that’s “tree,” “bicycle,” or “cat.” Including too much or too little of the image could result in inaccurate outputs. Our vision engineers must be able to sustain focus and work consistently.</p><p><b>Training: </b></p><p>All of our vision engineers are provided with the software require to complete this task and will be trained in how to correctly use it. All engineers in this position will also be trained on how computer vision operates and will be given opportunities to contribute ideas.<br><b>Compensation: </b><br>This is not a paid position, this is for extensive amount of learning opportunities and training.</p><p>Job Types: Part-time, Internship</p><p>Pay: Up to $1.00 per year</p><p>Benefits:</p><ul><li>Flexible schedule</li></ul><p>Application Question(s):</p><ul><li>Do you have a Mac computer?</li></ul><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Experience:</p><ul><li>Computer science: 1 year (Preferred)</li><li>Image processing: 1 year (Preferred)</li></ul><p>Work Location: Remote</p></div><div></div>"
    },
    {
        "position": "Software Development Intern",
        "company": "Ping Identity - 4.1",
        "location": {
            "city": "Austin",
            "state": "TX"
        },
        "posted": "2021-10-18T17:01:53.212Z",
        "url": "https://www.simplyhired.com/job/vT2nrw8lPCV-NaKwRnixGr5SymEYv8WREDO-o5CFfVXxRQjGKR8B8w?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:49.796Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>About Ping Identity:</b><br>\nAt Ping Identity, we're changing the way people think about enterprise security technology. With our innovative Identity Defined Security platform, we're helping to build a borderless world where people have total freedom to work wherever and however they want. Without friction. Without fear.\n<br><br>\nWe call this digital freedom. And it's not just something we provide our customers. It's something that drives our company. People don't come here to join a culture that's built on digital freedom. They come to cultivate it.\n<br><br>\nWe're headquartered in Denver, Colorado, and we have offices and employees around the globe. And we serve the largest, most demanding enterprises worldwide, including over half of the Fortune 100. Because even in the most complex enterprise environments, security shouldn't be a source of anxiety. It should be one of your greatest competitive advantages.\n<br><br>\n<b>You Will:</b><br>\nMake enhancements and bug fixes to Ping's platform services and products\n<br>Develop automated functional and unit tests for existing product code and new features\n<br>Implement tools and infrastructure to support the development group\n<br>Build APIs and micro-services and push code to production\n<br>Participate in peer code reviews and product feature reviews\n<br>Communicate your status on tasks and get help and coaching from others on the team\n<br><br>\n<b>You Have:</b><br>\nEnrollment in an undergraduate program in a Software-related Field (i.e. Computer Science, Electrical Engineering, Information Systems)\n<br>Experience writing code in Java or other object-oriented programming language\n<br>Understanding of data structures and basic understanding of data modeling using SQL or NoSQL\n<br>Linux/unix experience or experience using terminal commands\n<br>Understanding of RESTful APIs and basic concepts of micro-services and containerization\n<br>Eligibility for full-time employment in the following year\n<br><br>\nPing Identity is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.</div><div></div>"
    },
    {
        "position": "IT Intern",
        "company": "Other World Computing Inc. -",
        "location": {
            "city": "Woodstock",
            "state": "IL"
        },
        "posted": "2021-10-18T17:01:57.379Z",
        "url": "https://www.simplyhired.com/job/ixTPlYOmIROMCjl8fByySeGe_36Fx7pmEhqF3-TeduvMFeGuz4VB7A?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:53.604Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Responsibilities: </b></p><p>Assist the Helpdesk Team in responding to support requests submitted by end-users during scheduled periods.</p><p>Follow appropriate team responses, escalating requests if necessary to Helpdesk Technicians or Systems Administrators.</p><p>Assist in accurately recording and updating over 3,000+ assets across multiple locations by such categories as: asset number, serial number, specifications, employee, and department.</p><p>Provide client level support to our end-users in a mixed Mac OS and Windows 10 environment.</p><p>Perform basic computer preventive maintenance checks and perform standard repair or upgrade procedures as detailed by Helpdesk Technicians or Systems Administrators.</p><p>Assist end-users by providing general Mac and Windows operating system support and some general Office applications support.</p><p>Assist in the end-user support of general business phone system equipment and Teams apps.</p><p>Communicate via voice, chat and email for multiple remote locations and users.</p><p>Exhibit excellent organization and communication skills.</p><p><b>Required Skills/Abilities: </b></p><p>Interest or current progress towards an Associate’s or Bachelor's degree in Computer Sciences.</p><p>1-2 years experience working with Mac OS and Windows 10 applications.</p><p>Intermediate-level knowledge of Office applications.</p><p>Exceptional \"customer service mentality\" and attitude.</p><p>Must have experience in setting up printers, computers, and cable management.</p><p>Physical Requirements:</p><p>Candidate must have the ability to lift up to 40lbs.</p><p><b>About OWC: </b></p><p>OWC is a fast-paced, friendly atmosphere that advocates ingenuity and encourages every employee to contribute ideas towards the discovery of the next innovative concept that could change the world of technology. Our shared vision of the ultimate customer experience is a key component to achieving the industry-leading results OWC has become known for around the globe. We firmly believe that the best in life is obtained through dedicated teamwork and creativity.</p><p>OWC is an environmentally conscious company committed to the conservation of our planet's resources through the use of renewable energy and company-wide recycling programs. Today OWC is recognized as a leading zero-emissions Mac and PC technology company. Other World Computing (OWC) has been providing the highest quality hardware products and support to the computer industry since 1988, specializing in Mac upgrades and expansion products to extend the useful life of Macs and reduce e-waste. We have one of the largest online catalogs for computer and iDevice enhancement products through our e-commerce portal www.macsales.com and have been steadily expanding the software solutions we provide as well through our brands SoftRAID and Mediafour.</p><p>OWC offers great benefits such as medical, dental, vision, 401K, short/long term disability, HSA and FSA accounts and a wellness program. We provide paid time off and 6 paid holidays as well as flexible schedule and work from home opportunities. We value our employees so there is potential for career growth, cross functional training, stretch assignments and ongoing educational opportunities.</p><p>Job Types: Part-time, Internship</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Ability to commute/relocate:</p><ul><li>Woodstock, IL: Reliably commute or planning to relocate before starting work (Preferred)</li></ul><p>Education:</p><ul><li>High school or equivalent (Preferred)</li></ul><p>Experience:</p><ul><li>Customer service: 1 year (Preferred)</li></ul><p>Work Location: One location</p></div><div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "LOCKHEED MARTIN CORPORATION - 4.0",
        "location": {
            "city": "Huntsville",
            "state": "AL"
        },
        "posted": "2021-10-17T17:02:01.394Z",
        "url": "https://www.simplyhired.com/job/L__kXLN_AIJ2iqpz9mmUQHRwWfWwdXj3FP8DeX0wnzZ5w4FtlSR_Dg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:01:57.747Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Going to space is just the beginning. It s what you do when you get there that matters. Lockheed Martin builds the satellites and spacecraft that do amazing things in space for government and commercial customers. Connecting people. Advancing discovery. And protecting what matters most. Lockheed Martin-built satellites give earlier warning of severe weather, connect troops on the battlefield, and deliver GPS directions to a billion people worldwide. As we look to the future, we re driving innovations to help our customers do even more in orbit. That s why we re crafting smarter satellites that operate like smartphones in the sky, with apps that can be updated in orbit so they can adapt as mission needs on the ground change. Your mission is ours. And as that mission evolves, we ll be ready. Will you? What does this role look like? Working with experienced engineers, you will support the software engineering lifecycle following the program Software Development Plan (SDP) to include requirements analysis, object oriented analysis &amp; design, code &amp; unit test, integration, and support to formal test / delivery. You will also participate in technical reviews/audits of software products. These positions require security clearances and are subject to security investigation.\n<br><br>\n<b>Basic Qualifications:</b><br>\nActively enrolled in a Computer Science, Aerospace Engineering or other related degree program from an accredited college/university. This position requires special access to support the program and requires the selected candidate to be a US Citizen.\n<br><br>\n<b>Desired Skills:</b><br>\nprograming experience in C/C++, python or Java, Linux\n<br><br>\n<b>BASIC QUALIFICATIONS:</b><br>\njob.Qualifications\n<br><br>\nLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.\n<br><br>\nAs a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\n<b>EXPERIENCE LEVEL:</b><br>\nCo-op/Summer Intern</div><div></div>"
    },
    {
        "position": "Rookie 2022 Summer League Internship - Engineering & Technology",
        "company": "Under Armour - 3.8",
        "location": {
            "city": "Baltimore",
            "state": "MD"
        },
        "posted": "2021-10-17T17:02:05.428Z",
        "url": "https://www.simplyhired.com/job/k2JpmPsXgWPBZLqbfImlHoY4kgLP3z0TvA9kecehTMZVbg57s2YaOw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:01.765Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Under Armour has one mission:</b> to make you better. We have a commitment to innovation that lies at the heart of everything we do, not just for our athletes but also for our teammates. As a global organization, our teams around the world push boundaries and think beyond what is expected. Together our teammates are unified by our values and are grounded in our vision to inspire you with performance solutions you never knew you needed but can’t imagine living without.\n<br><br>\nPosition Summary\n<br><br>\nAs an Under Armour Rookie you’ll be given a hands-on, self-driven project that makes a real business impact. Throughout the 12 weeks you’ll work one-on-one with a mentor and have access to learning experiences, such as interactive Q&amp;A sessions with our executives and professional development opportunities with our talent advisors. With our focus on cross-functional collaboration and global mindset, as a Rookie, you get to see how your work goes way beyond yourself.\n<br><br>\nPotential Placement Areas\n<br><br>\nBackend Engineer\n<br>Engineering Rookies will join a team focused on creating software to power the future of connected fitness. The Backend Engineer Rookie will support our complex backend engineering systems along with our altered large legacy systems that handle millions of transactions per day. Our systems are mostly on the JVM as Scala/Finagle or Java/Spring Boot, though some legacy systems use Python/Django, Go, and Ruby/Rails. This opportunity might appeal to students with majors such as: Informatics, Computer Sciences, Mathematics, Physics, or Computer Engineering.\n<br><br>\nHardware Engineer\n<br>Hardware Rookies supports our team in building best-in-class custom hardware modules with custom firmware. This opportunity might appeal to students with majors such as: Mechanical Engineering, Electrical and Embedded Engineering, Computer Science, Mathematics, Physics, or Computer Engineering.\n<br><br>\nCommerce Services Engineer\n<br>The Digital Commerce Rookie will support maintaining a customer series ecosystem that host millions of customers across Web, iOS and Android. Digital Commerce engineering works with open-source technology operating as part of an Agile delivery team and are proficient in JavaScript, Roby, Python or Java. The Rookie will assist with projects focused on executing full lifecycle software development. This opportunity might appeal to students with majors such as: Informatics, Computer Science, Mathematics, Physics, or Computer Engineering.\n<br><br>\nEnterprise Data Management (EDM)\n<br>The Enterprise Data Management Rookie will join a team powering the storage, processing, integration and cataloging of UA data. As an EDM Rookie you will work across teams to support building pipelines, services, and tools that enable both internal teammates and our integrated systems with the data, information, and knowledge to fulfill UA’s mission. This opportunity might appeal to students with majors such as: Computer Science, Mathematics, Statistics, Data Management, Data Science/Analytics, Economics or Engineering.\n<br><br>\nEligibility\n<br><br>\nTo be eligible for our Rookie program, you must be expecting to graduate between December of 2022 and June 2023.\n<br><br>\nHiring Process\n<br><br>\nOur resume review process will start immediately upon applying for this role. If our teams are interested in your experience, you will be invited to interview virtually with members of your potential team. You may have the ability to interview for multiple roles if the opportunity arises. Once virtual interviews are completed our recruiting team will extend offers or follow up with you directly on your status.\n<br><br>\n<b>APPLICATION DEADLINE:</b> SUNDAY, DECEMBER 12, 2021 at 11:59 PM EASTERN TIME\n<br><br>\nAt Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern: Summer 2022",
        "company": "CommScope - 3.7",
        "location": {
            "city": "Suwanee",
            "state": "GA"
        },
        "posted": "2021-10-17T17:02:09.428Z",
        "url": "https://www.simplyhired.com/job/LTEu_Mhz29MHXOqUeIkBWGxKVlRYJ0TTq-FLn9ZobWVh2GsL0BdRRQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:05.809Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Learn More About Internship Programs at CommScope\n<br><br>\nAs CommScope designs and builds connectivity for the world's most advanced networks, we're building something equally as important: careers for forward-thinking college students like you. Our Summer Internship Program is designed to provide you an invaluable work experience through completing meaningful projects to help you grow and develop.\n<br><br>\nThroughout the 12-week program, you will collaborate with some of the best in the industry, receive on-the-job training, and participate in professional development workshops, executive speaker series, and other networking and social events!\n<br><br>\nWe are seeking a Software Engineering Intern to be based in Suwanee, Georgia.\n<br><br>\nYou Will Make an Impact By\n<br><br>\nDeveloping and/or testing software solutions for Cable modem and Gateway CPE delivery\n<br>Tracking and executing first level of debug on issues detected\n<br>Collecting diagnostic data for Software engineering\n<br>Updating or automating test procedures using scripting languages.\n<br>Generating Defect Reports in trouble ticket database\n<br>Configuring networks &amp; hardware and troubleshoot network &amp; hardware failures\n<br>Working with and debugging internet technologies (TCP, UDP, DHCP, routing protocols, DOCSIS) with industry standard test equipment and processes\n<br><br>\nRequired Qualifications for Consideration\n<br><br>\nJunior or Senior standing in a BS, BA or master’s degree in Computer Science, Computer Engineering or a similar program from an accredited university\n<br>Proven strong academic performer with a minimum GPA of 3.0\n<br>Ability to work in the US without sponsorship now or in the future\n<br><br>\nYou Will Excite Us If You\n<br><br>\nHave experience in Java/JavaScript or another high-level programming language\n<br><br>\nExperience with cloud technologies and protocols\n<br><br>\nStrong troubleshooting ability\n<br><br>\nHave experience with Linux/ UNIX\n<br><br>\nHave experience with C/C++\n<br><br>\nDemonstrate strong leadership, interpersonal and communication skills\n<br><br>\nShow innovation through unique ideas and propose them to the team\n<br><br>\n<b>What happens after you apply:</b><br>\nLearn how to prepare yourself for the next steps in our hiring process by visiting https://careers.commscope.com/how-we-hire.\n<br><br>\nWhy CommScope\n<br><br>\nCommScope is on a quest to deliver connectivity that empowers how we live, work, and learn. Our employees push the boundaries of communications technology that enables game-changing discoveries like 5G, the Internet of Things, and gigabit speeds for everyone, everywhere. With our unmatched expertise in copper, fiber, and wireless infrastructure, our global clients rely on us to outperform today and be ready for the needs of tomorrow.\n<br><br>\nIf you want to grow your career alongside bright, passionate, and caring people who strive to create what's next…..come connect to your future at CommScope.\n<br><br>\nCommScope is an Equal Opportunity Employer (EEO), including people with disabilities and veterans. If you are seeking an accommodation for the application or interview process, please contact us to submit your request at talentacquisition@commscope.com. You can also learn more about CommScope’s accommodation process and EEO policy at careers.commscope.com/eeo\n<br><br>\n6524365243</div><div></div>"
    },
    {
        "position": "Internship - IT Service Desk I",
        "company": "Newpark Resources - 4.1",
        "location": {
            "city": "The Woodlands",
            "state": "TX"
        },
        "posted": "2021-10-17T17:02:13.361Z",
        "url": "https://www.simplyhired.com/job/OWytBojKvaalW1qJxOGyPpGBS6UnHYUrO0eV59aXzFdI8gsMUazOLg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:09.799Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">WHY JOIN NEWPARK?\n<br><br>\nOne of Newpark’s Core Values is Excellence. It means we are committed to delivering value through performance, innovation and service quality and that commitment starts with YOU! Newpark is a place where you can challenge yourself in new and exciting ways and work in an environment that supports and values you. Here at Newpark we are committed to finding, developing, retaining, and rewarding the very best and providing an environment where our employees can grow both professionally and personally.\n<br><br>\nWHO WE ARE\n<br><br>\nNewpark was founded in 1932 as a mining company in Park City, Utah and is now headquartered in The Woodlands, TX. We have grown into a global technology leader in not only the oil and gas market but many others as well. We are focused in 3 areas that include Fluids Systems, Mats &amp; Integrated Services, and Industrial Minerals. We have a footprint in over 20 countries throughout North and South America, Europe, the Middle East, Africa and Asia Pacific and we employ over2,000 employees.\n<br><br>\nWHAT WE DO\n<br><br>\nNewpark is changing the paradigm in the industries we serve, developing new ways to help customers drive operating efficiencies while working in harmony with the environment and improving community relations.\n<br><br>\nNewpark Fluids Systems provides value-added fluids solutions, products, and services to thousands of wells around the world.\n<br><br>\nExcalibar Minerals is a quality processor and supplier of industrial minerals. Our main advantage over competitors is our ability to offer direct import capabilities to key geographic regions we work in.\n<br><br>\nNewpark Mats&amp; Integrated Services provides leading edge matting solutions and worksite construction services to diverse industry segments around the globe.\n<br><br>\nWHAT WE VALUE\n<br><br>\nWe maintain an unwavering commitment to act in accordance with our Core Values of Integrity, Respect, Excellence, and Accountability which ensure our customers receive the best products and services we can offer and that you experience a safe workplace where you can thrive:\n<br><br>\nSafety - Protecting each other like family while sustaining the environment in which we work. .\n<br>Integrity - Acting honestly, ethically, and responsibly in all aspects of our business.\n<br>Respect - Dealing fairly and openly with employees, customers, suppliers and community.\n<br>Excellence - Delivering value through performance, innovation and service quality.\n<br>Accountability - Using good judgment and taking responsibility for our actions.\n<br><br>\nEssential Functions ESSENTIAL FUNCTIONS\n<br><br>\nAssist personnel on installing MDM solution on company issued mobile devise (phones/tablets) remotely and on-site on a global platform\n<br><br>\nAssist in creating Newpark Apple/Android IDs for anyone currently using their personal ID on company devices\n<br><br>\nAssist in closing backlog of ticket request in company ITSM tool as time allows\n<br><br>\nADDTIONAL DETAILS\n<br><br>\nWill consider early career hires\n<br><br>\nRelated Certifications a plus (Network+, ICFN/CCNA, A+, Microsoft Office\n<br><br>\nEducation &amp; Experience Requirements Bachelors Degree in Computer Science or educational equivalent. Entry level. Ability to read and interpret documents such as operating and maintenance instructions and procedure manuals. Ability to write routine reports and correspondence. Good problem solving skills. Good presentation and analytical skills. Position Summary Under direct supervision, provides first level support to end users for either PC, server, or mainframe applications and hardware. May interact with network services, software systems engineering, and/or applications development to restore service and/or identify and correct core problem. Simulates or recreates user problems to resolve operating difficulties. Recommends system modifications to reduce user problems. Handles special projects, as assigned.</div><div></div>"
    },
    {
        "position": "Rookie 2022 Summer League Internship - Supply Chain & Planning",
        "company": "Under Armour - 3.8",
        "location": {
            "city": "Baltimore",
            "state": "MD"
        },
        "posted": "2021-10-17T17:02:17.352Z",
        "url": "https://www.simplyhired.com/job/7cy8MjfvhGNT29tfjgKzVr1lvTd441OzC4utvz0uxAOZAkR0cY1LxQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:13.757Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Under Armour has one mission:</b> to make you better. We have a commitment to innovation that lies at the heart of everything we do, not just for our athletes but also for our teammates. As a global organization, our teams around the world push boundaries and think beyond what is expected. Together our teammates are unified by our values and are grounded in our vision to inspire you with performance solutions you never knew you needed but can’t imagine living without.\n<br><br>\nPosition Summary\n<br><br>\nAs an Under Armour Rookie you’ll be given a hands-on, self-driven project that makes a real business impact. Throughout the 12 weeks you’ll work one-on-one with a mentor and have access to learning experiences, such as interactive Q&amp;A sessions with our executives and professional development opportunities with our talent advisors. With our focus on cross-functional collaboration and global mindset, as a Rookie, you get to see how your work goes way beyond yourself.\n<br><br>\nPotential Placement Areas\n<br><br>\nAccount Services\n<br><br>\nAccount Services Rookies support our team by analyzing account fill rates and actively problem solving for delayed product. This opportunity might appeal to students with majors such as: Marketing, Business Management, Communications, Sales Management, Business Analytics, Sports Management, Business Operations, or Supply Chain.\n<br><br>\nLogistics\n<br><br>\nLogistics Rookies support our teams by acting as a daily liaison for the tactical execution between UA cross functional teams focusing on logistics. This opportunity might appeal to students with majors such as: Logistics, Industrial Engineering, Business Operations, Business Management, Supply Chain, Information Systems, Economics, Systems Engineering, or Computer Science.\n<br><br>\nSupply Chain\n<br><br>\nSupply Chain Rookies support our teams by researching and analyzing business trends and developing solutions in a cross functional environment to problem solve. This opportunity might appeal to students with majors such as: Supply Chain, Business Management, Business Analytics, Business Operations, Information systems, Data Science, or Engineering\n<br><br>\nPlanning\n<br>Planning Rookies support the coordination and distribution of new product assortments by utilizing merchandise plans and product strategies. This opportunity might appeal to students with majors such as: Retail Merchandising/Buying, Supply Chain, Analytics, Business, Finance, or Economics.\n<br><br>\nEligibility\n<br><br>\nTo be eligible for our Rookie program, you must be expecting to graduate between December of 2022 and June 2023.\n<br><br>\nHiring Process\n<br><br>\nOur resume review process will start immediately upon applying for this role. If our teams are interested in your experience, you will be invited to interview virtually with members of your potential team. You may have the ability to interview for multiple roles if the opportunity arises. Once virtual interviews are completed our recruiting team will extend offers or follow up with you directly on your status.\n<br><br>\n<b>APPLICATION DEADLINE:</b> SUNDAY, DECEMBER 12, 2021 at 11:59 PM EASTERN TIME\n<br><br>\nAt Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.</div><div></div>"
    },
    {
        "position": "Data and Analytics IT Intern - Summer 2022",
        "company": "McCormick & Company - 3.7",
        "location": {
            "city": "Hunt Valley",
            "state": "MD"
        },
        "posted": "2021-10-17T17:02:21.327Z",
        "url": "https://www.simplyhired.com/job/F6Knf-MQAuRvAdFQ8uJ8e45QCy2hx8MNGC9xwSOAyXD9LJ4NNjv30g?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:17.728Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">McCormick &amp; Company, Inc., a global leader in the spice, flavor, and seasonings industry, is seeking a full-time Data and Analytics IT Intern on the Digital Business Solutions team.\n<br><br>\nMcCormick &amp; Company, Incorporated is a global leader in flavor with approximately 13,000 employees worldwide. As a Fortune 500 company with over $5 billion in annual sales across 160 countries and territories, we manufacture, market, and distribute spices, seasoning mixes, condiments, and other flavorful products to the entire food industry including e-commerce, retail, food manufacturers and foodservice businesses. Our most popular brands include McCormick, French's, Frank's RedHot, Stubb's, OLD BAY, Lawry's, Zatarain's, Ducros, Vahiné, Cholula, Schwartz, Kamis, DaQiao, Club House, Aeroplane, and Gourmet Garden. Every day, no matter where or what you eat or drink, you can enjoy food flavored by McCormick. Our Purpose is \"To Stand Together for the Future of Flavor and our Vision is \"A World United by Flavor—where healthy, sustainable and delicious go hand in hand.\"\n<br><br>\nAs a company recognized for its exceptional commitment to employees, McCormick offers a wide variety of benefits, programs, and services. Benefits include, but are not limited to, tuition assistance, medical, dental, vision, disability, group life insurance, 401(k), profit sharing, paid holidays, and vacations.\n<br><br>\nMcCormick continues to emphasize the value and growth opportunities associated with advanced analytics. Over the past 4 years, McCormick IT has partnered with key business stakeholders to formalize and accelerate our Data and Analytics vision. McCormick is looking to add energetic and ambitious data and analytics talent to help us unlock value working directly with IT and business data scientists and practitioners.\n<br><br>\n<b>Options for the work you will do:</b><br>\nWork with our business partners to assess relevant industry trends and identify business requirements to help us successfully build capabilities and solutions to meet our long term data and analytics objectives.\n<br>Demonstrate continuous learning in industry best practices for data services, analytic modeling and analytics solutions.\n<br><b>Option to leverage technologies such as:</b> Microsoft Azure (Cloud, Synapse, ML, Purview, Power BI) and Google Cloud Platform including Big Query.\n<br>Participate as a business analyst, data engineer and/or solution architect on data services/analytics initiatives. (examples may include – data democratization, data modeling, ETL, data virtualization and/or data visualization.)\n<br>Working with our analytics COE’s, potential to participate in understanding, defining and/or developing insights for various global business functions.\n<br><br>\n<b>Skills:</b><br>\nPursing degree in math, statistics, computer science, business or economics - required\n<br>Ability to use data insights to drive/influence decision making and growth - required\n<br>Ability to visualize results and present to peers and business parthers - required\n<br>Ability to programmatically extract and refine large data sets - preferred\n<br>Ability and curiosity to learn new technology - preferred\n<br>Data modeling experience (Python, ‘R’, and/or MS Synapse) - preferred\n<br>Ability to work across teams and geographies – required\n<br>Strong organization and communication skills - required\n<br><br>\nMcCormick &amp; Company is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.\n<br><br>\nAs a general policy, McCormick does not offer employment visa sponsorships upon hire or in the future.</div><div></div>"
    },
    {
        "position": "Software Quality Assurance Intern",
        "company": "CommScope - 3.7",
        "location": {
            "city": "Suwanee",
            "state": "GA"
        },
        "posted": "2021-10-17T17:02:25.310Z",
        "url": "https://www.simplyhired.com/job/qQm95WPewgaKmLiopwsxiwNnVI1KCCKRE3VcNQT1tcGVzHeDEnghcQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:21.680Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Learn More About Internship Programs at Commscope\n<br><br>\nAs CommScope designs and builds connectivity for the world's most advanced networks, we're building something equally as important: careers for forward-thinking college students like you. Our Summer Internship Program is designed to provide you an invaluable work experience through completing meaningful projects to help you grow and develop.\n<br><br>\nThroughout the 12-week program, you will collaborate with some of the best in the industry, receive on-the-job training, and participate in professional development workshops, executive speaker series, and other networking and social events!\n<br><br>\n<b>What to Expect:</b><br>\nAs a Software Quality Assurance (SQA) Engineering Intern, you will be responsible for:\n<br><br>\nTesting the latest hardware and software release for the E6000 Converged Cable Access Platform (CCAP) HeadEnd product.\n<br><br>\nTesting the latest hardware and software release for the GEN1 and GEN2 Remote Phy products.\n<br><br>\nYou will work closely with the SQA Engineering organization in Suwanee and development groups in a multi-site effort including Lisle, IL, Lowell, MA, and Cork, Ireland.\n<br><br>\n<b>You Will Make an Impact By:</b><br>\nTesting software releases for the Commscope CCAP integrated voice, high speed data, and video high density headend platform\n<br>Testing hardware and software releases for the Commscope Distributed Access Architecture (DAA) technology\n<br>Developing test programs to verify software functionality\n<br>Competency in one or more scripting languages.\n<br>Assisting in engineering changes to lab routing networks\n<br>Installing new support servers and software\n<br>Interconnecting lab elements to form a test bed to emulate customer applications of Commscope headend products\n<br><br>\nRequired Qualifications for Consideration\n<br><br>\nJunior or Senior standing in a BS, BA, or Master’s degree program of study Computer Science, Software Engineering, Computer Engineering, or Electrical/Electronic Engineering from an accredited university\n<br>Proven strong academic performer with a minimum GPA of 3.0\n<br>Ability to work in the US without sponsorship now or in the future\n<br><br>\nWhy Commscope?\n<br><br>\nIn today's always on world, Commscope is pushing the bounds of communications technology. We are building better connections and shaping the networks of the future. for more than 40 years, we've been leaders in innovating the network infrastructure of the future. Developments such as the Internet of Things, seamless connectivity and 5G introduce new requirements and demand creative thinking. With our unmatched expertise in copper, fiber, and wireless infrastructure, our global clients rely on us to outperform today and be ready for the needs of tomorrow.\n<br><br>\n6545265452</div><div></div>"
    },
    {
        "position": "Intern, Asset Management",
        "company": "CommScope - 3.7",
        "location": {
            "city": "Richardson",
            "state": "TX"
        },
        "posted": "2021-10-17T17:02:29.261Z",
        "url": "https://www.simplyhired.com/job/I663U1-JOW5HY2W4g7hxVYqIFachfh680jpsiNqNwK-d-m3FBdlRGg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:25.678Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Learn More About Internship Programs at CommScope\n<br><br>\nAs CommScope designs and builds connectivity for the world's most advanced networks, we're building something equally as important: careers for forward-thinking college students like you. Our Summer Internship Program is designed to provide you an invaluable work experience through completing meaningful projects to help you grow and develop.\n<br><br>\nThroughout the 12-week program, you will collaborate with some of the best in the industry, receive on-the-job training, and participate in professional development workshops, executive speaker series, and other networking and social events!\n<br><br>\nHow You’ll Help Us Connect the World\n<br><br>\nAs an Asset Management Intern, you will be responsible for assisting with execution and oversight of asset and configuration management processes and driving the overall quality of the Configuration Management Database (CMDB). You will work closely with the Business Process team in the execution of processes aligned with ITIL best practices, required to support the needs of the organization, and ensuring process compliance to maintain data quality. This role will be based in Richardson, Texas.\n<br><br>\nYou Will Make an Impact By\n<br><br>\nSupporting asset and configuration management processes, configuration planning, identification, baseline control and auditing activities\n<br>Ensuring configuration items and relationships are accurate and complete, building exception reports, and maintaining core data used by the asset and configuration management system\n<br>Maintaining and communicating configuration management standards, processes, policies, and procedures\n<br>Proactively identifying and suggesting improvements to configuration management processes\n<br><br>\nRequired Qualifications for Consideration\n<br><br>\nJunior or Senior standing in a BS, BA or master’s degree in an Information Technology/Computer Science related degree program from an accredited university\n<br>Proven strong academic performer with a minimum GPA of 3.0\n<br>Ability to work in the US without sponsorship now or in the future\n<br><br>\nYou Will Excite Us If You\n<br><br>\nDemonstrate strong leadership, interpersonal and communication skills\n<br>Show innovation through unique ideas and propose them to the team\n<br>Demonstrate strong statistical/data analysis skills\n<br>Have an instinctive problem-solving mentality\n<br>Can communicate complex data and ideas in comprehensible ways\n<br><br>\n<b>What happens after you apply:</b><br>\nLearn how to prepare yourself for the next steps in our hiring process by visiting https://careers.commscope.com/how-we-hire.\n<br><br>\nWhy CommScope\n<br><br>\nCommScope is on a quest to deliver connectivity that empowers how we live, work, and learn. Our employees push the boundaries of communications technology that enables game-changing discoveries like 5G, the Internet of Things, and gigabit speeds for everyone, everywhere. With our unmatched expertise in copper, fiber, and wireless infrastructure, our global clients rely on us to outperform today and be ready for the needs of tomorrow.\n<br><br>\nIf you want to grow your career alongside bright, passionate, and caring people who strive to create what's next…..come connect to your future at CommScope.\n<br><br>\nCommScope is an Equal Opportunity Employer (EEO), including people with disabilities and veterans. If you are seeking an accommodation for the application or interview process, please contact us to submit your request at talentacquisition@commscope.com. You can also learn more about CommScope’s accommodation process and EEO policy at careers.commscope.com/ee\n<br><br>\n6534165341</div><div></div>"
    },
    {
        "position": "Technical Support Engineer Intern",
        "company": "CommScope - 3.7",
        "location": {
            "city": "Lisle",
            "state": "IL"
        },
        "posted": "2021-10-17T17:02:33.260Z",
        "url": "https://www.simplyhired.com/job/pX6w2GAzmIfdFMgqTy66bicx_2W5D6nFwuj5x_7VzMC-Eswut5tCeg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:29.657Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Learn More About Internship Programs at CommScope\n<br><br>\nAs CommScope designs and builds connectivity for the world's most advanced networks, we're building something equally as important: careers for forward-thinking college students like you. Our Summer Internship Program is designed to provide you an invaluable work experience through completing meaningful projects to help you grow and develop.\n<br><br>\nThroughout the 12-week program, you will collaborate with some of the best in the industry, receive on-the-job training, and participate in professional development workshops, executive speaker series, and other networking and social events!\n<br><br>\nHow You’ll Help Us Connect the World\n<br><br>\nAs a Technical Support Engineer Intern, you will be responsible for installation, test, and support of Distributed Architecture Applications, including server-based applications for CMTS and CMTS related products. You will work closely with Technical Support, Software, and Hardware engineering teams to validate installation and support of several Broadband products in the CommScope portfolio. This Intern will have the opportunity to learn DOCSIS 3.1, IP/Routing (IP v4 &amp; v6), RF, and video technologies. The opportunity to trouble-shoot lab-based problems and work on customer issues from a vendor standpoint. This role will be based in Lisle, IL.\n<br><br>\nYou Will Make an Impact By\n<br><br>\nInstallation / setup of server / computer-based equipment in lab environment\n<br>Configuring and debugging CMTS and CMTS based products\n<br>Validating software installation packages and supporting documentation\n<br>Assist in network design and implementation new products\n<br><br>\nRequired Qualifications for Consideration\n<br><br>\nJunior or Senior standing in a BS, BA or master’s degree in Information Technology / MIS / CS / EE / CE from an accredited university\n<br>from an accredited university\n<br>Proven strong academic performer with a minimum GPA of 3.0\n<br>Ability to work in the US without sponsorship now or in the future\n<br><br>\nYou Will Excite Us If You\n<br><br>\nStrong computer and server skills\n<br>Linux skills\n<br>Experience with virtualization\n<br>Understanding of Networking and IP routing\n<br>Demonstrate strong leadership, interpersonal and communication skills\n<br>Show innovation through unique ideas and propose them to the team\n<br><br>\n<b>What happens after you apply:</b><br>\nLearn how to prepare yourself for the next steps in our hiring process by visiting https://careers.commscope.com/how-we-hire.\n<br><br>\nWhy CommScope\n<br><br>\nCommScope is on a quest to deliver connectivity that empowers how we live, work, and learn. Our employees push the boundaries of communications technology that enables game-changing discoveries like 5G, the Internet of Things, and gigabit speeds for everyone, everywhere. With our unmatched expertise in copper, fiber, and wireless infrastructure, our global clients rely on us to outperform today and be ready for the needs of tomorrow.\n<br><br>\nIf you want to grow your career alongside bright, passionate, and caring people who strive to create what's next, come connect to your future at CommScope.\n<br><br>\nCommScope is an Equal Opportunity Employer (EEO), including people with disabilities and veterans. If you are seeking an accommodation for the application or interview process, please contact us to submit your request at talentacquisition@commscope.com. You can also learn more about CommScope’s accommodation process and EEO policy at careers.commscope.com/eeo\n<br><br>\nLearn More About Internship Programs at CommScope\n<br><br>\nAs CommScope designs and builds connectivity for the world's most advanced networks, we're building something equally as important: careers for forward-thinking college students like you. Our Summer Internship Program is designed to provide you an invaluable work experience through completing meaningful projects to help you grow and develop.\n<br><br>\nThroughout the 12-week program, you will collaborate with some of the best in the industry, receive on-the-job training, and participate in professional development workshops, executive speaker series, and other networking and social events!\n<br><br>\nHow You’ll Help Us Connect the World\n<br><br>\nAs a Technical Support Engineer Intern, you will be responsible for installation, test, and support of Distributed Architecture Applications, including server-based applications for CMTS and CMTS related products. You will work closely with Technical Support, Software, and Hardware engineering teams to validate installation and support of several Broadband products in the CommScope portfolio. This Intern will have the opportunity to learn DOCSIS 3.1, IP/Routing (IP v4 &amp; v6), RF, and video technologies. The opportunity to trouble-shoot lab-based problems and work on customer issues from a vendor standpoint. This role will be based in Lisle, IL.\n<br><br>\nYou Will Make an Impact By\n<br><br>\nInstallation / setup of server / computer-based equipment in lab environment\n<br>Configuring and debugging CMTS and CMTS based products\n<br>Validating software installation packages and supporting documentation\n<br>Assist in network design and implementation new products\n<br><br>\nRequired Qualifications for Consideration\n<br><br>\nJunior or Senior standing in a BS, BA or master’s degree in Information Technology / MIS / CS / EE / CE from an accredited university\n<br>from an accredited university\n<br>Proven strong academic performer with a minimum GPA of 3.0\n<br>Ability to work in the US without sponsorship now or in the future\n<br><br>\nYou Will Excite Us If You\n<br><br>\nStrong computer and server skills\n<br>Linux skills\n<br>Experience with virtualization\n<br>Understanding of Networking and IP routing\n<br>Demonstrate strong leadership, interpersonal and communication skills\n<br>Show innovation through unique ideas and propose them to the team\n<br><br>\n<b>What happens after you apply:</b><br>\nLearn how to prepare yourself for the next steps in our hiring process by visiting https://careers.commscope.com/how-we-hire.\n<br><br>\nWhy CommScope\n<br><br>\nCommScope is on a quest to deliver connectivity that empowers how we live, work, and learn. Our employees push the boundaries of communications technology that enables game-changing discoveries like 5G, the Internet of Things, and gigabit speeds for everyone, everywhere. With our unmatched expertise in copper, fiber, and wireless infrastructure, our global clients rely on us to outperform today and be ready for the needs of tomorrow.\n<br><br>\nIf you want to grow your career alongside bright, passionate, and caring people who strive to create what's next, come connect to your future at CommScope.\n<br><br>\nCommScope is an Equal Opportunity Employer (EEO), including people with disabilities and veterans. If you are seeking an accommodation for the application or interview process, please contact us to submit your request at talentacquisition@commscope.com. You can also learn more about CommScope’s accommodation process and EEO policy at careers.commscope.com/eeo\n<br><br>\n6540565405</div><div></div>"
    },
    {
        "position": "Vehicle Hardware - Silicon Development Engineering Internship (Spring 2022)",
        "company": "Tesla - 3.4",
        "location": {
            "city": "Palo Alto",
            "state": "CA"
        },
        "posted": "2021-10-17T17:02:39.996Z",
        "url": "https://www.simplyhired.com/job/QkIpmEUKKDjYdxFGhf2_7bYi_Z2u2DKen_IwkCtDed_JBy5E9YgHTw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:36.593Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Disclaimer:</b> This position is expected to start around January 2022 and continue through the entire Spring term (i.e. through April/May) or into Summer 2022 if available. We ask for a minimum of 12 weeks, full-time (40 hours/week), for most internships. Please consider before applying.\n<br><br>\n<b>International Students:</b> If your work authorization is through CPT, please consult your school before applying. You must be able to work 40 hours per week. Many students will be limited to part-time depending on their academic standing.\n<br><br>\nInternship Program at Tesla\n<br><br>\nThe Internship Recruiting Team is driven by the passion to recognize emerging talent. Our year around program places the best students in positions that they will grow both technically and personally through their experience working closely with their Manager, Mentor, and team. We are dedicated to providing an experience that allows for the intern to experience life at Tesla by given them projects that are critical to their team’s success.\n<br><br>\nInstead of going on coffee runs and making copies, you’ll be seated at the table making critical decisions that will influence not only your team, but the overall achievement of Tesla’s mission.\n<br><br>\nThe Role\n<br><br>\nInterns within Vehicle Hardware Engineering will support the development, production, and testing of current &amp; future vehicle designs. You will help to ensure great quality of Tesla’s Autopilot hardware and software for current and next generation vehicle programs and working towards Tesla’s vision of fully autonomous vehicles. Your scope of work will be a combination of electrical and software projects depending on team requirements, challenging you to come up with creative solutions to affect rigorous quality and cost-down targets.\n<br><br>\nYour application for the Vehicle Hardware Engineering Internship – Silicon Development will be considered across all opportunities for the teams listed below:\n<br><br>\nThe Autopilot Silicon and Systems Validation team focuses on validating Pre and Post Silicon phases of the Autopilot Silicon and System that includes the SoC, PCBA, Firmware and Platform. They work closely with the Autopilot Firmware and the Autopilot Application Software teams to build confidence in the overall HW/SW platform that runs in the cars. This team builds validation test infrastructures that are capable of launching a variety of synthetic and use-case based tests in order to catch any hardware or firmware defects prior to production.\n<br><br>\nThe Autopilot Silicon and System Design team is responsible for designing and productizing silicon chips, ASICs, and the overall system for Tesla Autopilot. This team architects, designs, and verifies the entire system. This team is responsible for writing firmware and software drivers to communicate with the system. They are looking for interns with strong electrical engineering fundamentals, understanding of hardware-software concepts, and familiarity with PCBA design. Schematic entry and simulation, lab skills, and scripting are a must. Experience in mixed signal design, high speed signaling, or power supply design is preferred.\n<br><br>\nResponsibilities\n<br><br>\nThe intern will focus on developing silicon bring up and validation plans for SoCs and Board components. This involves writing test plans, executing test plan in pre and post silicon environments, debug system level issues prior to silicon arrival and implementing the post silicon strategy to get all the hardware interfaces brought up to a healthy state.\n<br><br>\nCreate and execute synthetic workloads that stress the various functional blocks inside the silicon such as the GPU, Fabric, Neural Network, Camera Interface etc.\n<br><br>\nDebugging alongside the Silicon and Board design engineers to identify and fix any hardware bugs before going into production.\n<br><br>\nEngage with the Silicon hardware and the PCB board design teams at the very early stages of the design, taking part in design and schematics review, providing feedbacks on use cases to be able to support them in design, and writing test plans &amp; tests to make sure all the features in the design gets well validated prior to Tapeout and final Production.\n<br><br>\nValidate many different IPs within the SoC like CPU, GPU, Caches, Interconnects, Accelerators, Power Management, High Speed Interfaces like PCIe, DDR, etc., and many different low speed interfaces.\n<br><br>\nRequirements\n<br><br>\nActively pursuing a degree in a relevant engineering program such as Computer Engineering, Electrical Engineering or Computer Science\n<br><br>\nDeep knowledge of Computer Architecture\n<br><br>\nProficiency in at least one programming language such as C, C++, Python, Linux OS Scripting\n<br><br>\nMicrocontroller &amp; Embedded Systems Programming Experience in C/C++\n<br><br>\nExperience with writing performance tests and analyzing results\n<br><br>\nExperience with debugging performance bottlenecks and issues\n<br><br>\nProfessional and positive communication skills\n<br><br>\nMust be self-managed and committed to working in a fast-paced environment.\n<br><br>\nHands-on experience is a must\n<br><br>\nProfessional and positive communication skills\n<br><br>\nAbility to relocate</div><div></div>"
    },
    {
        "position": "SAP Ariba iXp Intern - Business Intelligence",
        "company": "SAP - 4.3",
        "location": {
            "city": "Pittsburgh",
            "state": "PA"
        },
        "posted": "2021-10-17T17:02:44.098Z",
        "url": "https://www.simplyhired.com/job/z8JfDCBQsTguqxB7HU4YDnwAcZNeKeLCqGvfCPaXvsOSNu7Df8m8dg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:40.368Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">What we offer\n<br><br>\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. Apply now!\n<br><br>\nAbout the SAP Internship Experience Program\n<br><br>\nThe SAP Internship Experience Program is SAP’s global, strategic, paid internship program that provides university students with opportunities to find purpose in their careers.\n<br><br>\nThree reasons to intern at SAP\n<br><br>\n<b>Culture of collaboration:</b> meet with mentors, make new friends across the globe and create a thriving personal network.\n<br><b>Project-driven experience:</b> gain cross-functional skills from our virtual and in-person learning sessions, diverse subject matter experts, and project deliverables.\n<br><b>Gain visibility:</b> with SAP Internship Experience Program in your title, you’ll have a global network of SAP leaders, entrepreneurs and career development opportunities at your fingertips.\n<br><br>\nAbout the team\n<br><br>\nThe Ariba Analytics Team is globally located in Pittsburgh, PA and Bangalore, India.\n<br>Each member of the team comes from unique academic and industrial backgrounds spanning 8 countries.\n<br>Our team mission is to take data driven insights to the next level and positively impact Ariba’s customer adoption with valuable, usable information.\n<br>We strive to work hard and deliver the best experience possible at Ariba.\n<br><br>\n<b>What you’ll do:</b><br>\n<b>Position Title:</b> SAP Ariba iXp Intern - Business Intelligence\n<br><br>\n<b>Location:</b> Pittsburgh, PA\n<br><br>\n<b>Expected Start Date:</b> October 2021\n<br><br>\n<b>Contract Duration:</b> 6 months\n<br><br>\n<b>In this role, you’ll:</b><br>\nLearn how to turn data into meaningful insights and intelligence that drive business success.\n<br>Assist in creating analytics requirements to make data report-ready for various parts of the SAP Ariba Organization.\n<br>Assist in development and delivery of analytics solutions using Ariba Cloud Data (Ariba Network and Cloud Applications).\n<br>Gain a better understanding of business stakeholders to see how they use data, how data impacts their jobs, and how we contribute to a great customer experience.\n<br>Learn how marketing, communications and user support are impactful in the world of Analytics.\n<br>Gain a good mix of technical, business, process and analytical capabilities.\n<br><br>\n<b>Who you are:</b><br>\nWe’re looking for someone who takes initiative, perseveres, and stay curious. You like to work on meaningful innovative projects and are energized by lifelong learning.\n<br><br>\nEnrolled in a 2 or 4-year degree at a college or university in Business, Statistics, Information Systems, Engineering, Computer Science.\n<br>Some experience in SQL preferred.\n<br>Understanding of data modeling and database design.\n<br>Strong planner and organizer with demonstrated ability to master new concepts quickly, incorporate the latest technologies and develop business solutions that increase efficiency, productivity and profitability.\n<br>Superior written / communication skills and focus on detail.\n<br>Proficiency in spreadsheet applications (Microsoft Excel) are preferred.\n<br><br>\nFollow @SAPiXp on Instagram and don’t miss anything about our experiences worldwide!\n<br><br>\nWe are SAP\n<br><br>\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\n<br><br>\nOur inclusion promise\n<br><br>\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\n<br><br>\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com.\n<br><br>\n<b>EOE AA M/F/Vet/Disability:</b><br>\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\n<br><br>\nSuccessful candidates might be required to undergo a background verification with an external vendor.\n<br><br>\n<b>Requisition ID:</b>306549 | Work Area: Information Technology | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Intern |</div><div></div>"
    },
    {
        "position": "SAP iXp Intern - Business Performance Management Projects",
        "company": "SAP - 4.3",
        "location": {
            "city": "Newtown Square",
            "state": "PA"
        },
        "posted": "2021-10-17T17:02:48.043Z",
        "url": "https://www.simplyhired.com/job/-WD6vvn9t2o-zegyVT7biBaZOoWdda2DoErbgZoDkA511DTsiIX5Kw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:44.481Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">What we offer\n<br><br>\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. Apply now!\n<br><br>\nAbout the SAP Internship Experience Program\n<br><br>\nThe SAP Internship Experience Program is SAP’s global, strategic, paid internship program that provides university students with opportunities to find purpose in their careers.\n<br><br>\nThree reasons to intern at SAP\n<br><br>\n<b>Culture of collaboration:</b> meet with mentors, make new friends across the globe and create a thriving personal network.\n<br><b>Project-driven experience:</b> gain cross-functional skills from our virtual and in-person learning sessions, diverse subject matter experts, and project deliverables.\n<br><b>Gain visibility:</b> with SAP Internship Experience Program in your title, you’ll have a global network of SAP leaders, entrepreneurs and career development opportunities at your fingertips.\n<br><br>\nAbout the team\n<br><br>\nIntro to Business Process Intelligence at SAP - YouTube\n<br><br>\n<b>What you’ll do:</b><br>\n<b>Position Title:</b> SAP iXp Intern - Business Performance Management Projects\n<br><b>Location:</b> Newtown Square, PA / Virtual\n<br><b>Expected Start Date:</b> September 2021\n<br><br>\n<b>Contract Duration:</b> 6 months\n<br><br>\n<b>In this role, you’ll:</b><br>\nstart with a detailed and structured onboarding to get familiar with the different internal systems and analytical tools\n<br>have the possibility to learn about the different global sales processes and how to structure data along the different scenarios\n<br>support the transition of existing dashboards to a new system and front-end tool, learn how data are managed, prepared, structured and also visualized within state of the art dashboards that provide reliable insights into performance relative to KPIs and PPIs\n<br>support the creation and consumption of analytical insights into SAP’ global sales processes to drive efficiency and effectiveness; Measuring, monitoring and analyzing data helps us to identify, implement and execute activities to further improve SAP’ sales performance\n<br>expect interesting tasks in an agile environment with diverse teams\n<br><br>\n<b>Who you are:</b><br>\nWe’re looking for someone who takes initiative, perseveres, and stay curious. You like to work on meaningful innovative projects and are energized by lifelong learning.\n<br><br>\n<b>Preferred fields of study:</b> Computer Science, Data Science, Mathematics, Economics, Statistics\n<br><b>Computer skills:</b> MS Office (Outlook, Excel)\n<br><b>Language skills:</b> Strong written and verbal communication skills in English; German is a plus\n<br><b>Soft skills:</b> good communication skills, organized, proactive mindset, ability to learn quickly, team player\n<br><br>\nFollow @SAPiXp on Instagram and don’t miss anything about our experiences worldwide!\n<br><br>\nWe are SAP\n<br><br>\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\n<br><br>\nOur inclusion promise\n<br><br>\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\n<br><br>\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com.\n<br><br>\n<b>EOE AA M/F/Vet/Disability:</b><br>\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\n<br><br>\nSuccessful candidates might be required to undergo a background verification with an external vendor.\n<br><br>\n<b>Requisition ID:</b>297186 | Work Area: Information Technology | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Intern |</div><div></div>"
    },
    {
        "position": "Web Developer Intern, Spring 2022",
        "company": "Common Hire -",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        },
        "posted": "2021-10-17T17:02:52.013Z",
        "url": "https://www.simplyhired.com/job/puTTMIy4_MMZ6oiQwvlMtvDhzrXXXhJOeuuB75NmDRanPfTKTn4NVg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:48.394Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Common Hire is a technology startup based in Los Angeles, CA. </b></p><p><b>A Day in the Life..</b></p><p>Common Hire is seeking an enthusiastic, creative and motivated Web Developer intern for our digital team. The candidate must be comfortable with tight deadlines, be extremely detail oriented, highly organized and able to multi-task and thrive in an exciting, fast-paced environment.</p><p><b>Responsibilities</b></p><ul><li>Conceptualize and design new websites pages and web apps using a variety of tools for Common Hire's growing operations.</li><li>Writing code in HTML &amp; CSS</li><li>Participating in Sprint Planning and tracking work items</li></ul><p><b>Eligibility</b></p><ul><li>Currently pursuing an undergraduate Bachelor’s degree in Computer Science, Information Systems or other related fields at a U.S-based college/university.</li><li>Demonstrated experience with HTML/CSS</li><li>All candidates must be available to work up to 40 hours per week (100% remote)</li></ul><p>Job Types: Part-time, Internship</p><p>Pay: $20.00 per hour</p><p>Application Question(s):</p><ul><li>What is your expected graduation date? (month/year)</li></ul><p>Work Location:</p><ul><li>Multiple locations</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul><p>Work Location: Multiple Locations</p></div><div></div>"
    },
    {
        "position": "WordPress Web Developer Intern",
        "company": "Robot Startup -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-10-17T17:02:56.066Z",
        "url": "https://www.simplyhired.com/job/NSMWDFR-0-mrHxVRYIsTcnBbwHpwqbgtrFnpRMpxiY8JU8Qes4lNvQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:52.389Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>WordPress Web Developer Intern</p><p>No salary  * No equity  * College credit</p><p>Robot Startup is an EdTech company that is innovating a self-assembling modular kit called MorphBots for robotics Education. The MorphBots kit is a disruptive technology that will motivate more students to pursue robotics education and prepare them to solve the challenges in a technology based global economy. We are working with several school districts around the U.S. to bring our product to the market. We are currently developing a prototype for our beta test program that will lead to the successful commercial launch of the MorhpBots Robotic Kit.</p><p>We are seeking a WordPress Web Developer that is very comfortable with PHP, HTML, and the front-end and back-end of a WordPress website. The position with Robot Startup will be remote.</p><p>Your internship will focus on creating the look, layout, and features of our website. You will work with the founder of the company and other marketers to explore, experiment, and discover Robot Startup’s visual identity. We will work together to develop a consistent message to our target audience. The best marketing interns are genuinely excited to work with a startup whose mission is to give all students access to robotics education. Having the conviction that every child in the world deserves a great education will help you succeed in this internship.</p><p>Your commitments to this internship include the following:</p><p>- This internship is four months or at least one semester.</p><p>- This is an unpaid remote internship (held over Microsoft Teams).</p><p>- This is primarily for computer science, computer engineering, graphic design, communication, and management science majors.</p><p>- This internship is geared toward giving you a real-world experience, meeting deadlines, communicating well under pressure, and having fun growing a startup.</p><p>- Team video conference meeting each week to discuss strategy and implementation, review results, and set new goals for coming week. Expected workload is 10-15 hours per week.</p><p>As a web designer intern with Robot Startup, you’ll get to:</p><p>- Design, code, and modify websites while meeting company specifications.</p><p>- Write well designed, testable, efficient code.</p><p>- Maintain, expand, and scale websites as needed.</p><p>- Create website layout/user interface by using standard HTML/CSS practices.</p><p>- Coordinate with founder and other marketers to match visual design intent.</p><p>- Design, code, and debug applications in various software languages.</p><p>The requirements for this position:</p><p>- Proven experience as a Web Developer or equivalent background</p><p>- Extensive experience with WordPress, Page/template building tools and Adobe Creative Suite.</p><p>- High degree of comfort with HTML, CSS, and JavaScript.</p><p>- Front-end web development (HTML, CSS, JavaScript).</p><p>- Back-end web development (WordPress, PHP, MySQL).</p><p>- Experience in web design and programming.</p><p>- Knowledge of UI, browser compatibility, web functions and standards.</p><p>- Excellent organizational, planning and time management skills.</p><p>- Advanced attention to detail and problem solving skills.</p><p>- Solid communication skills (written and verbal).</p><p>- BS degree in Computer Science, Engineering or equivalent.</p><p>The benefits of doing this internship with Robot Startup are the following:</p><p>- Help market a revolutionary robotic kit that will help solve the dilemma of 2.5 million STEM jobs currently going unfilled because not enough US students are graduating with STEM degrees</p><p>- Be part of a company that will give low-income schools an opportunity to begin their first robotics class with MorphBots</p><p>- Add to your resume that your worked with a company that is providing robotics education to areas in America below the poverty line so the students have a better future</p><p>Your internship has a flexible schedule. You are expected to commit at least one semester to this internship. You can renew your internship each semester based on the performance of your work. Please complete the assessments, write a cover letter for this position, and provide your resume when applying for this internship.</p><p>Job Types: Part-time, Internship</p><p>Benefits:</p><ul><li>Flexible schedule</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Front-end development: 1 year (Preferred)</li><li>CSS: 1 year (Preferred)</li><li>Angular: 1 year (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Work Location: Remote</p></div><div></div>"
    },
    {
        "position": "Mechanicial Engineer Intern",
        "company": "Robot Startup -",
        "location": {
            "city": "Remote",
            "state": "Remote"
        },
        "posted": "2021-10-17T17:03:00.048Z",
        "url": "https://www.simplyhired.com/job/d4FvgddPmCWS0Whngfv1brEw4iGm_W5eol8GypCFsiu30yU602nKiw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:02:56.446Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Mechanical Engineer Intern</p><p>No salary  * No equity  * College credit</p><p>Robot Startup is an EdTech company that is designing an engaging robotics curriculum to entice more students to pursue robotics. K-12 students are the target market for the MorphBot E-Learning platform. Pilot testing of the educational version of the product is planned to launch in the first quarter of 2022. We are working with several K-12 schools around the U.S. to commercialize our product because the demand for STEM/Robotic grads continues to increase in the market.</p><p>The <b>Mechanical Engineer Intern</b> must have a high-level, prior working knowledge of C, C++, and using the Arduino IDE.</p><p>The intern must have experience working on a team with other developers and know how to collaborate with others to build something collectively. The most important thing to your success is having a drive for education and a belief that education can make a better world.</p><p>Your commitments to this internship include the following:</p><p>- This internship is for 4 months and is renewable depending on performance.</p><p>- You will sign an NDA (non-disclosure agreement) before beginning internship.</p><p>- This is an unpaid virtual internship (meetings held on Zoom).</p><p>- This is primarily for mechanical engineers, computer science, and computer engineering and software engineer majors. This internship is particularly suited for those who wish to work in a fast-paced, startup environment with individuals who have a passion for game design, education, and making something that can have a profound impact.</p><p>- Daily communication on the MorphBots Discord Server is a necessity. We follow the SCRUM framework. You will work with two managers who are handling different aspects of the game MVP.</p><p>- Team meetings will be held once a week discussing strategy, implementation, and reviewing results. Expected workload is 15-20 hours per week.</p><p>The benefits of doing this internship with Robot Startup are the following:</p><p>- Help bring a revolutionary robotic kit to schools that will ultimately motivate more K-12 students to pursue Robotics and STEM education.</p><p>- Gain valuable experience in game design with Unity, thinking like an entrepreneur, and working with a team.</p><p>- Be part of a company that will give low-income schools an opportunity to begin their first robotics class with our virtual robotics kit compatible on a Chromebook!</p><p>As a Mechanical Engineer Intern with Robot Startup, your expected to do or have the following:</p><p>- Be able to take instruction and execute on your workload.</p><p>- Excellent organizational, planning and time management skills.</p><p>- Advanced attention to detail and problem-solving skills.</p><p>- Solid communication skills (written and verbal).</p><p>- BS degree in Computer Science, Engineering, Programming, or equivalent</p><p>Along with your application, please provide examples of relevant past work. If your portfolio is limited, you may provide a one-page description of any relevant experience or knowledge you think would contribute to this internship, any current best practices you would recommend, and any software gaming projects you may have done or used in the past.</p><p>Please complete the assessments in this application as well.</p><p>Job Types: Part-time, Internship</p><p>Job Types: Part-time, Internship</p><p>Benefits:</p><ul><li>Flexible schedule</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Education:</p><ul><li>Bachelor's (Preferred)</li></ul><p>Experience:</p><ul><li>Arduino: 3 years (Preferred)</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Work Location: Remote</p></div><div></div>"
    },
    {
        "position": "IT Intern",
        "company": "Citizens Property Insurance Corporation - 3.5",
        "location": {
            "city": "Jacksonville",
            "state": "FL"
        },
        "posted": "2021-10-16T17:03:03.993Z",
        "url": "https://www.simplyhired.com/job/nllmL7FOnoVFNIW9FD1NjPLCZgi7pdlDJLQDn06KCP8n5q-t0roi4w?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:00.424Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">IT Intern - (2100008C)\n<br>Description\n<br><br>\nSearching for a place to make your mark? Every great team depends on the individual contributions of its members – the skills, talents and the passion that each team member brings. At Citizens, we’re building a workforce of top achievers committed to our company’s mission and vision. Our company values the knowledge that comes from experienced and dedicated individuals with a variety of backgrounds, in or out of insurance.\n<br><br>\nCitizens’ Mission is to provide property insurance protection in Florida to those who are, in good faith, unable to obtain coverage through the private market while also providing the utmost in customer service. Our Values are public service, integrity, respect, responsiveness and sound judgment. We strive to not only provide affordable insurance products and services but also to provide sound financial responsibility to the citizens of Florida.\n<br><br>\nAt Citizens, we are a team of dedicated, service-minded professionals committed to our policyholders. Come achieve and maximize your potential with us!\n<br><br>\n<b>Job Summary:</b><br>\nCitizens is offering a 6-month paid internship. Interns will have the opportunity to get hands on experience working in the Information Technology department. This paid internship will feature real world project work on one of our teams. Interns will have the opportunity to contribute to and meet deliverables on important projects. Project assignments will be made by IT leadership to best meet the needs of the business.\n<br><br>\nThe position is full-time 40 hours per week to work remotely\n<br>Pay is $20.00 per hour\n<br><b>Normal Business Hours:</b> Monday through Friday from 8:00 am – 5:00 pm\n<br><br>\n<b>Intern positions include the following:</b><br>\n<b>Application Development:</b> You will participate in learning and developing web products as a Software engineering Intern.\n<br><b>Software Quality Assurance:</b> You will participate in learning and testing of web applications as a Software QA Intern.\n<br><br>\n<b>Job duties:</b><br>\nModel ethical behavior and execute job responsibilities in accordance with Citizens’ core values, ethics and information protection policies.\n<br>Develop modern business, technical and professional skills sought after by top employers.\n<br>Deliver on a variety of tasks in support of web development and testing of modern applications.\n<br>Utilize Lean Agile practices and principles to deliver value to the organization.\n<br>Analyze data and results to assist in recommendations for business process improvement and other project work.\n<br><br>\nQualifications\n<br><br>\n<b>Required Education and Experience:</b><br>\nPursuit of a Bachelor’s degree in Information Technology, Computer Science or field with skills transferable to position OR pursuit of a technical certification at an accredited organization.\n<br><br>\n<b>Required Knowledge, Skills and Abilities:</b><br>\nStrong verbal and written communication skills.\n<br>Proficient in Microsoft Office, including Microsoft Word, Excel and Outlook.\n<br>Willingness to learn.\n<br><br>\n<b>Physical Requirements:</b><br>\nThis position requires the ability to sit for long periods of time, hear and converse over the telephone, and key frequently on a computer (4 or more hours per day).\n<br><br>\nThis is a seasonal employment position and is not eligible for participation in our benefits programs.\n<br><br>\nCitizens is proud to be an Equal Opportunity Employer\n<br><br>\nRelocation Assistance is not available for this position.\n<br><br>\n<b>Primary Location:</b> US-FL-Jacksonville\n<br><b>Work Locations:</b> Jacksonville 301 West Bay Street Suite 1300 Jacksonville 32202\n<br><b>Job:</b> EO - IT Services\n<br><b>Organization:</b> CPIC BU\n<br><b>Job Posting:</b> Oct 15, 2021, 12:35:11 PM</div><div></div>"
    },
    {
        "position": "Engineering Intern- Backend",
        "company": "Shipt - 3.4",
        "location": {
            "city": "Birmingham",
            "state": "AL"
        },
        "posted": "2021-10-16T17:03:07.994Z",
        "url": "https://www.simplyhired.com/job/MDv30CuSk9K-XX0m1YLS1XzhsbVr1f2GVXF2RrG2CqcxSYhXntMTQA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:04.376Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Shipt, we are transforming the shopping experience and giving time back to consumers. Shipt Shoppers handpick everything from fresh groceries to household essentials, then deliver them to your door in as little as one hour.\n<br><br>\nShipt is an online marketplace providing same-day delivery from national retailers and local stores. Our friendly shoppers handpick fresh groceries and household essentials and deliver them to members in as soon as one hour.\n<br><br>\nAre you passionate about technology, sharing knowledge, growing your skills, and working with great people? If you are self directed, enjoy autonomy in your work, and you are an excellent participant in a team, come join Shipt as an Intern.\n<br><br>\nInternships are available starting Summer 2022 and require the ability to maintain a consistent work schedule!\n<br><br>\nYour Responsibilities\n<br><br>\nExpand your technical knowledge under the mentorship of other Engineers\n<br><br>\nWork as part of a team alongside other Engineers to deliver amazing product experiences\n<br><br>\nFind creative, scalable solutions for problems\n<br><br>\nDesign, develop, review, test, deploy, and maintain backend systems\n<br><br>\nTroubleshoot issues and fix bugs\n<br><br>\nCollect and analyze metrics to drive quality and efficiency\n<br><br>\nCreate and maintain documentation for functionality, workflow and internal process\n<br><br>\nReview and collaborate with other engineers on their code\n<br><br>\nHave the opportunity to learn from an established, high-performance Engineering team\n<br><br>\nRequirements\n<br><br>\nYou are pursuing a degree in Computer Science (or related)\n<br><br>\nYou can communicate complex ideas and processes, simply and concisely\n<br><br>\nYou love collaboration, attention to detail, and solving problems\n<br><br>\nYou have a strong desire to continuously learn and master new skills\n<br><br>\nYou are interested in backend distributed systems\n<br><br>\nNice To Haves\n<br><br>\nExperience with Python, Go, or Ruby\n<br><br>\nExperience with SQL and no SQL databases, especially Postgres\n<br><br>\nExperience with Kafka or other messaging systems\n<br><br>\nExperience with open source back-end technologies\n<br><br>\nExperience with a non-relational data storage\n<br><br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div><div></div>"
    },
    {
        "position": "2022 Summer Internship Program – Technology",
        "company": "IHS Markit - 3.6",
        "location": {
            "city": "Dallas",
            "state": "TX"
        },
        "posted": "2021-10-16T17:03:11.979Z",
        "url": "https://www.simplyhired.com/job/MmvQr4H0EXAniNMXX7QEUnhOOo2iyU8x2q5ThwynEhMfa8wAlljvSw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:08.375Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">About IHS Markit\n<br><br>\nAt the heart of IHS Markit, we are an information company. With expertise across the world’s largest industries, we leverage technology and data science, to provide the insights, software, and data to help our customers make better informed decisions, driving growth, performance, and efficiency.\n<br><br>\n2022 Intern Program – Opportunities for students\n<br><br>\nDuring your internship you'll have the chance to partner with our industry experts, with on the job experience focusing on high impact work that allows you to apply and develop your skills. Networking, business insights and tailored learning opportunities all support your growth and development, setting you up for success as you begin your career.\n<br><br>\nEligibility\n<br><br>\nOur next internship program runs through the summer of 2022. We're looking for students who are working towards a Bachelor's or Master's degree (or equivalent), and due to complete their studies to be available for a full time role commencing in 2023.\n<br><br>\nThe role\n<br><br>\nAs an Intern with IHS Markit, you will undertake work on a real business projects intended to add value to the team as well as provide you with a great learning opportunity. Upon completion of the internship, you will have an understanding of how data plays a critical part in making key business decisions in several industries and how this adds value to our customers. You will see how the business and technical side of application development come together to create impactful and actionable information and how the technology is maintained and developed in order to keep it competitive in the marketplace.\n<br><br>\nIf you are passionate about solving challenging technical problems and have a desire to work in technology, this is the stream for you. Opportunities within this stream include, but are not limited to:\n<br><br>\nSoftware Engineer\n<br>Software Development\n<br><br>\nWhat we're looking for\n<br><br>\nWe seek candidates with diverse backgrounds and ideas with a desire to learn and thrive. The Summer Internship Program will provide a variety of experiences to help you identify your strengths, develop highly transferable skills, and align you to a successful career path for a bright future at IHS Markit. To be an ideal fit for the role, you should have:\n<br><br>\nA bachelor or master’s degree (or equivalent) completed no later than May 2023\n<br>0-6 months relevant work experience\n<br>Demonstrated passion or interest in one or more of our key industries\n<br>Excellent communication skills\n<br>Strong critical thinking and problem-solving skills\n<br>An aptitude to learn and adapt quickly in a rapidly changing environment\n<br>The ability to build strong working relationships in a collaborative setting\n<br>Be legally eligible to work for the duration of the program in the country for which you apply\n<br><br>\n<b>For Technology applicants, we recommend the following:</b><br>\nCurrently studying in an area of computer science or similar degree\n<br>Experience with coding languages such as Java, SQL, or Python\n<br>An understanding and/or interest in any of the following;\n<br>Software development methodologies\n<br>Quality assurance\n<br>Infrastructure\n<br>Microsoft technologies\n<br>Relational databases\n<br>Java based technologies\n<br>Ability to convey complex subject matter clearly and engagingly\n<br>Proficient with MS Office\n<br>Knowledge of object-oriented concepts and techniques\n<br><br>\nApplication and assessment process\n<br><br>\nThe assessment process that follows is designed to ensure you can learn more about us, showcase your skills, and find a role that is right for you.\n<br><br>\n<b>Stage 1:</b> Submit online application\n<br><br>\n<b>Stage 2:</b> Online pymetrics assessment\n<br><br>\n<b>Stage 3:</b> Initial screening process\n<br><br>\n<b>Stage 4:</b> Final stage assessment day\n<br><br>\nYou may be considered for multiple suitable roles throughout this process. If these roles fall within the same stream, you will be assessed during the same process. If the roles fall across multiple streams, you may be asked to complete different assessments aligned to those roles.\n<br><br>\nOur commitment to diversity\n<br><br>\nOur business and our customers are diverse, and we believe that embracing a diverse and inclusive environment is key to defining who we are. Our people are what makes us unique and you will get the opportunity to work with some of the brightest minds from across the world who continuously find the best viable solutions, adding value and driving change for our customers.\n<br><br>\n-\n<br><br>\nInclusion and diversity are critical to the success of IHS Markit, and we actively encourage applications from people of all backgrounds. We are committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected category.\n<br><br>\nWe are proud to provide reasonable accommodations to applicants with disabilities. If you are interested in applying for employment with IHS Markit and need special assistance or an accommodation to use our website or to apply for a position, please contact or call +1 212 849 0399. Determination on requests for reasonable accommodation are considered on a case-by-case basis. This contact information (email and phone) is intended for application assistance and accommodation requests only. We are unable to accept resumes or provide information about application status through the phone number or email address above. Resumes are only accepted through the online application process, and only qualified candidates will receive consideration and follow-up.\n<br><br>\nIHS Markit maintains a substance-free workplace; employees may be asked to submit to a drug test (where permitted by law). In addition, as a federal contractor in the United States, the company participates in the E-Verify Program to confirm eligibility to work.</div><div></div>"
    },
    {
        "position": "Intern – IT Software Engineer (NOA)",
        "company": "Nintendo of America Inc. - 4.1",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "2021-10-16T17:03:16.395Z",
        "url": "https://www.simplyhired.com/job/W93JNXnQP7s9lSUUAI1T_a25ZUF3gXinslPT4NamA-4OFLF1OvWLQw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:12.350Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Nintendo of America Inc.\n<br><br>\nThe worldwide pioneer in the creation of interactive entertainment, Nintendo Co., Ltd., of Kyoto, Japan, manufactures and markets hardware and software for its Nintendo Switch™ system and the Nintendo 3DS™ family of portable systems. Since 1983, when it launched the Nintendo Entertainment System™, Nintendo has sold billions of video games and hundreds of millions of hardware units globally, including Nintendo Switch and the Nintendo 3DS family of systems, as well as the Game Boy™, Game Boy Advance, Nintendo DS™ family of systems, Super NES™, Nintendo 64™, Nintendo GameCube™, Wii™, and Wii U™ systems. It has also created industry icons that have become well-known, household names, such as Mario, Donkey Kong, Metroid, Zelda and Pokémon. A wholly owned subsidiary, Nintendo of America Inc., based in Redmond, Wash., serves as headquarters for Nintendo’s operations in the Americas. For more information about Nintendo, please visit the company’s website at http://www.nintendo.com .\n<br><br>\nNintendo is an equal opportunity employer. We offer a welcoming and inclusive environment in service to one another, our products, the diverse consumers we represent, and the communities we call home. We do all of this with kindness, empathy and respect for each other.\n<br><br>\nGET SERIOUS ABOUT FUN\n<br><br>\nAs a Nintendo of America Intern, you will actively contribute to meaningful projects, and gain valuable hands-on work experience with a leading company in the entertainment industry. During the program from June through August, your work experience will be enhanced with mentoring, networking opportunities and exposure to industry leaders from across the company! Whether you are in a technical or non-technical role, you will be a part of a team committed to putting smiles on faces of millions around the world.\n<br><br>\nDESCRIPTION OF DUTIES\n<br>Work with Nintendo’s IT team and gain experience designing and implementing software features\n<br>Contribute to the team that plans IT application releases and deployment collaborating with experienced leaders in technical design.\n<br>Learn to collaborate with QA team to test the implemented features\n<br>SUMMARY OF REQUIREMENTS\n<br>3.0+ GPA\n<br>Freshmen to graduating seniors enrolled in accredited college or university\n<br>Pursuing a degree in Computer Science, Computer Engineering or related field\n<br>Knowledge in core pipeline deployment\n<br>Experience with Java, Python, and React\n<br>Familiarity with AWS is preferred\n<br>Ability to articulate technical challenges and solutions effectively\n<br>Legally authorized to work in the United States</div><div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Otis - 3.9",
        "location": {
            "city": "Farmington",
            "state": "MI"
        },
        "posted": "2021-10-16T17:03:20.430Z",
        "url": "https://www.simplyhired.com/job/TyO3toQWgkRclG7nTDnOQAHufkf-WFKnXI2NVg3PPSylZ52w4DRhBw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:16.776Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Date Posted:</b><br>\n2021-10-15-07:00\n<br><br>\n<b>Country:</b><br>\nUnited States of America\n<br><br>\n<b>Location:</b><br>\n<b>OT556:</b> Farmington Hills, 34705 West 12 Mile Rd, MI, 48331 USA\n<br><br>\nInternships at Otis are rewarding and challenging, providing you with the opportunity to learn, grow, and develop through meaningful projects that impact and drive our business. Our comprehensive Internship Program will allow you to gain hands-on experience and broaden your communication, leadership, and business acumen skills. You will have the opportunity to work with leading professionals in our industry and you’ll be immersed in the Otis culture where we collaborate to best serve our customers; where we empower and inspire each other through support, autonomy and trust; and where we set big goals, rise to achieve them, and win as a team!\n<br><br>\nThe Otis Global Engineering team has a summer internship opportunity for those interested in gaining experience in various specialties like Mechanical, Electrical, Design and Test Engineering. This internship offers practical, challenging, and meaningful global experiences in Engineering to help drive important business results.\n<br><br>\nSpecifically, our Engineering interns will be given assignments in support of the global Engineering transformation effort, including, but not limited to:\n<br><br>\nEmbedded Software - strengthening and modernizing our engineering software development practices, which includes increasing the predictability, development speed, and quality of software-rich products.\n<br><br>\nSystems Modeling - responsible for model-based systems engineering (MBSE) tools to develop and analyze architectures, designs, and requirements of electrical and electromechanical systems.\n<br><br>\nControls - advancing analytical and model-based design (MBD) capabilities to implement advanced control algorithms focusing on motion control, electronic safety, and dispatching products.\n<br><br>\nInnovation - reigniting Otis innovation focusing on opportunity analysis, exploration of new ideas and concepts, and by validating these ideas through MVPs (minimum viable products).\n<br><br>\nThis is a full-time, paid summer internship, typically ranging from 10-12 weeks. Throughout your internship, we provide continuous training and performance feedback to ensure you build the necessary skills to succeed. Additional career opportunities are available upon conclusion of a successful internship, including placement into entry-level, professional roles within the organization.\n<br><br>\nEducation / Qualifications\n<br><br>\nSelection for the Otis Internship Program will be based on the following minimum criteria:\n<br><br>\nBe pursuing a BS in one of the various Engineering concentrations\n<br><br>\nProactive and results-driven individual who thrives in a fast paced and dynamic environment\n<br><br>\nExcellent analytical and communication skills\n<br><br>\nFlexibility and Adaptability\n<br><br>\nTechnical aptitude\n<br><br>\nProject Management capability\n<br><br>\nSelf-directed- ability to work independently\n<br><br>\nSolid interpersonal skills\n<br><br>\nOtis is the world’s largest elevator and escalator manufacturing, installation and service business. We serve customers in over 200 countries and territories around the world and maintain more than 2 million elevators and escalators. We have more than 69,000 employees, including engineers, digital technology experts, sales and functional specialists, as well as factory and field technicians. We are proud to be a global team that continues to rise to the challenges of a fast-moving, high-performance company. Together, the people of Otis are creating new ideas and opportunities by collaborating across time zones, geographies and cultures to better serve our customers. Just imagine where you can take your career!\n<br><br>\nOtis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n<br><br>\nOtis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.</div><div></div>"
    },
    {
        "position": "2022 Internship - Software Engineering",
        "company": "Loon - 4.8",
        "location": {
            "city": "Mountain View",
            "state": "CA"
        },
        "posted": "2021-10-16T17:03:27.276Z",
        "url": "https://www.simplyhired.com/job/iWWnercpZjVMOF1Xch60FsSdEfH5an-tAZBMR3QblmYvVhJ3PNNbEA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:23.842Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.\n<br><br>\nTHE FOUNDATION OF AN AMAZING JOURNEY\n<br><br>\nOur goal at X is to make the world a radically better place. In order to do that we seek fresh unexpected perspectives, from different fields, and that’s why we’re excited about you.\n<br><br>\nLife here isn’t easy, but it’s fun. We’re trying to build things most people can’t even imagine, and we’re doing it with the hope of making a huge, positive impact on the world. You’ll be embedded into a moonshot project, where you’ll partner with team members to solve key challenges.\n<br><br>\nThis isn’t your ordinary internship. You’ll be positively challenged and pushed professionally, in ways that you may have never experienced. If this excites you - keep reading.\n<br><br>\n<b>DURING YOUR INTERNSHIP YOU CAN EXPECT:</b><br>\nTo be placed on one of our confidential or public X projects\n<br>To get paid competitively and with Google benefits\n<br>To be part of a lively community of other Interns and Residents\n<br>To addend colloquium and discussions with team leads from across Google, DeepMind and external organizations\n<br><br>\n<b>DETAILS:</b><br>\n<b>Location:</b> X's headquarters in Mountain View, CA\n<br><b>Start Date(s):</b> Year-round rolling basis\n<br><b>Duration:</b> a flexible 4 mo. to 1 year program based on project team needs and your availability\n<br><br>\n<b>REQUIREMENTS:</b><br>\nMust be enrolled in an academic program and working towards completing an Undergraduate or Master's degree.\n<br><br>\n<b>WHAT YOU'LL BE WORKING ON:</b><br>\nBecoming familiar with your teams specific goals and challenges\n<br>Experimenting and developing software solutions to help tackle challenges\n<br>Testing and documenting all code\n<br>Learning Moonshot thinking, attending colloquium and tech talks\n<br>Engaging with the X Internship community during the program\n<br>Having fun!\n<br><br>\n<b>MINIMUM QUALIFICATIONS:</b><br>\nBS degree in Computer Science, or similar technical field of study or equivalent practical experience.\n<br>Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, Python, JavaScript, Typescript, or Go.\n<br>Interest and ability to work at all levels of the software stack; from the front-end to building a data pipeline and cloud-based backend\n<br>Ability to jump to random new tasks in a fast paced project to get things done - learning new things on a daily basis\n<br><br>\n<b>PREFERRED QUALIFICATIONS:</b><br>\nExperience with JAX, TensorFlow, Keras\n<br>Experience in Machine Learning\n<br><br>\nAt X, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. We are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n<br><br>\nIf you have a disability or special need that requires accommodation, please contact us at: x-accommodation-request@x.team.</div><div></div>"
    },
    {
        "position": "Software Engineer Intern - Summer 2022 (Research)",
        "company": "GRAMMATECH -",
        "location": {
            "city": "Ithaca",
            "state": "NY"
        },
        "posted": "2021-10-16T17:03:31.442Z",
        "url": "https://www.simplyhired.com/job/IX0DlehHqV-Q90fSC4tXuU4TipRXJuCzzX4kuWbIMPS3GK4pva7LGQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:27.691Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Overview:</b><br>\nGrammaTech’s internship program for SUMMER 2022 offers students the opportunity to gain real experience in a friendly, open, and supportive environment. We choose projects based on real needs, and interns work closely with engineers to make sure that projects are completed successfully.\n<br><br>\nThis position is on the Research side of our business, please look at the information on the website before applying to learn more about some of our current and completed research projects, https://www.grammatech.com/sponsored-research.\n<br><br>\nGrammaTech will conduct a series of programming tests and screening interviews as part of our process in Python and C++.\n<br><br>\n<b>Responsibilities:</b><br>\nResearch projects at GrammaTech can take on a wide variety of topics and challenges. Projects focus on software assurance, software protection, reverse engineering, and software synthesis. We do both static and dynamic analysis on both source and object code, in order to tackle serious problems with practical solutions.\n<br><br>\n<b>Potential projects include:</b><br>\nReverse-engineering software binaries to extract information about structure and functionality\n<br>Developing new static analyses for binaries\n<br>Improving existing tooling for runtime instrumentation and introspection of programs\n<br>Enhancing user interfaces and workflows for reverse-engineering\n<br>Enhancing the robustness and scalability of existing static and dynamic analysis research prototypes in preparation for commercialization\n<br><br>\n<b>Qualifications:</b><br>\nRequired\n<br><br>\nCurrently enrolled in a BS, or MS in Computer\n<br>Excellent programming skills in Python and C++ using Linux tools.\n<br>Experience working with software binaries.\n<br><br>\nPreferred\n<br><br>\nExperience with Ghidra, IDA Pro, Binary Ninja, or radare2\n<br><br>\nAbout the Company\n<br><br>\nInnovation is at the heart of GrammaTech, and we are constantly pushing the boundaries of software research and development–from software assurance and software integrity to cyber‐security, threat mitigation and autonomic computing. We develop new technologies and see the results of our research incorporated into tools used by engineers and security professionals worldwide.\n<br><br>\nGrammaTech was founded in 1988, with the firmly‐grounded purpose of helping today’s organizations develop tomorrow’s software. With a focus on the evolving cyber‐security landscape, software hardening and intelligent systems, we tackle the most challenging software issues through a constant stream of highly innovative research and commercial development programs. Executive offices in Bethesda, MD, and a Research and Development Center in Ithaca, NY, as well as opportunities for remote employment.\n<br><br>\nWe offer a competitive salary and benefits package including health care plan options, a generous paid time off program, flexible hours, 401(k) plan with company contribution, and opportunities for professional and personal development.\n<br><br>\nGrammaTech, Inc. is an Equal Opportunity/Disability/Veterans/Affirmative Action employer.\n<br><br>\nMembers of protected groups are encouraged to apply.</div><div></div>"
    },
    {
        "position": "2022 IT Junior Software Developer Intern",
        "company": "Labcorp - 3.4",
        "location": {
            "city": "Burlington",
            "state": "NC"
        },
        "posted": "2021-10-16T17:03:35.475Z",
        "url": "https://www.simplyhired.com/job/KYPzyomFlnnqlwJsKBqD6aXUIrkdYATgdlhioq2zoD2lsCVQxZ7wkw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:31.838Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At LabCorp, we provide real-world experience by working on assignments in a team atmosphere which furthers an education in STEM and Healthcare disciplines.\n<br><br>\nOur interns have the opportunity to showcase their work by demonstrating their achievements to their supervisors, their mentors, and our senior management team. Each intern will participate in group projects that illustrate their creativity and builds on their technical teamwork skills.\n<br><br>\nYour Summer at a Glance\n<br><br>\nMay - Take Off\n<br>Program Kick-Off and the Start of the Summer!\n<br>June - Teamwork and Discovery\n<br>Work with your assigned team and fellow Interns on projects while also attending workshops, panels, and tours\n<br>July - Networking and Public Speaking\n<br>Present to Senior Leadership, work with team members on innovative new projects, and expand your career network\n<br>August - Takeaways\n<br>Provide insight for your future career, and create lasting career networks\n<br><br>\nDetails\n<br><br>\nOpportunity to expand knowledge of web development on the AWS platform, using tools such as Sagemaker, and using relational databases on the backend\n<br>Ability to participate in application development projects to capture detail level data terms and definitions, map data sources, and understand business data definitions, data classifications, and data retention\n<br>Opportunity to expand knowledge of script writing and creating automation for system reboots\n<br>Working on a Bachelor's Degree, and or professional certification.\n<br><br>\nSkills\n<br><br>\nKnowledge of Programming (Java, Python, C+, C#, etc.) and Information Management\n<br>Familiar with GIT revision control system\n<br>Experience in Container Management\n<br>Excellent Written and Verbal Communication Skills\n<br>Experience writing Scripts\n<br>Computer Science, Information Technology, or related field</div><div></div>"
    },
    {
        "position": "Reliability Engineer, Intern",
        "company": "Qorvo - 3.7",
        "location": {
            "city": "Greensboro",
            "state": "NC"
        },
        "posted": "2021-10-16T17:03:39.492Z",
        "url": "https://www.simplyhired.com/job/UxJZw1YbBPwlXxGBzy3THjxKvcBKVkCIIFyld0Jple0aQxND5CxUZw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:35.857Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Experience Level:</b> Internship\n<br><b>Job Type:</b> Intern\n<br><br>\n<b>Location:</b><br>\nNC - Greensboro (HQ), US\n<br><br>\n<b>Requisition ID:</b> 2275\n<br><br>\nQorvo is All Around You! We manufacture innovative RF solutions at the center of connectivity to enable high-performance applications for advanced wireless devices, wired and wireless networks and defense radar and communications for 5G networks, cloud computing, the Internet of Things, and other emerging applications. We are a global company thriving on a culture of innovation, diversity, and inclusion. Our people are always at the core of Qorvo’s innovation. Qorvo is a place to stretch your imagination and push boundaries to achieve success. Learn more about Top 10 Reasons to make a career at Qorvo.\n<br><br>\n<b>NOTE:</b> Because this is a student internship, candidate must be a currently enrolled student in a degree-seeking accredited program.\n<br><br>\nThis is a full-time Intern position located in Greensboro, NC. The position will be temporary in nature and last approximately 3-months.\n<br><br>\n<b>Desired Degree:</b> BS, CS (Computer Science), ME (Mechanical)\n<br><br>\n<b>SUMMARY:</b><br>\nThis position will be part of the Global Operations Reliability Team, which is responsible for performing product qualification testing. We are seeking an intern to support package level reliability testing systems in accordance with JEDEC testing standards and other customer requirements. This position will work closely with Reliability, Advanced Reliability, and Global Packaging to perform and improve qualification testing.\n<br><br>\n<b>QUALIFICATIONS:</b><br>\nMinimum 3.0 GPA.\n<br>Ability to provide great customer service\n<br>Proficiency with Microsoft Excel\n<br>Eagerness to learn qualification testing for new product introductions\n<br>Careful attention to detail\n<br><br>\n<b>RESPONSIBILITIES:</b><br>\nCollect the data from Drop Shock testers.\n<br>Collect the data from Temp Cycle systems.\n<br>Organize the data by Reliability job.\n<br>Analyze the data and compare to the customer requirement and industry standards.\n<br>Design ways to improve the testing environment and data collection for the two test types.\n<br>Perform on-time data entry of job details in the Quality Control System.\n<br>Maintain controlled reliability lab documents and manuals.\n<br><br>\n<b>Location:</b> Greensboro, NC\n<br><br>\n<b>Remote:</b> No\n<br><br>\nThe above duties are not intended to be all-inclusive or permanent. The requirements of the position may change based on the business need. Duties, responsibilities, and activities may change.\n<br><br>\n#LI-CB1\n<br><br>\nQorvo is an E-Verify Employer. For more information, please see the Right to Work and E-Verify Participation posters.</div><div></div>"
    },
    {
        "position": "Summer 2022 Intern - Commercial Applications Developer (California)",
        "company": "Stryker - 3.9",
        "location": {
            "city": "Fremont",
            "state": "CA"
        },
        "posted": "2021-10-16T17:03:43.542Z",
        "url": "https://www.simplyhired.com/job/gtAhgyJzewPNtbUoPVBV8pbllRw_BN_JFV2uSmeqHkM2uOSoouhmjw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:39.892Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Who we want\n<br><br>\nChallengers. People who seek out the hard projects and work to find just the right solutions.\n<br><br>\nTeammates. Partners who listen to ideas, share thoughts and work together to move the business forward.\n<br><br>\nCharismatic networkers. Relationship-savvy people who intentionally make connections with both internal partners and external contacts.\n<br><br>\nStrategic thinkers. Interns who propose innovative ideas and consistently exceed their performance objectives.\n<br><br>\nCustomer-oriented achievers. Individuals with an unparalleled work ethic and customer-focused attitude who bring value to their partnerships.\n<br><br>\nGame changers. Persistent interns who will stop at nothing to live out Stryker’s mission to make healthcare better.\n<br><br>\nWhat You Get Out of the Internship\n<br><br>\nStryker, a global leader in medical technology takes great pride in their people, and that’s why we’re looking to expand our talent. As a result, we are looking for the best and brightest students to strengthen our team and drive our business going forward. Stryker IS interns will get to:\n<br><br>\nApply classroom knowledge in a fast-paced and growing industry setting\n<br><br>\nBe a part of an innovative team and culture\n<br><br>\nExperience documenting complex processes and presenting them in a clear format\n<br><br>\nImplement new ideas, be constantly challenged, and develop your skills\n<br><br>\n<b>Position summary:</b><br>\nThe Technical Solution Analyst is responsible for design, configuration, and testing activities for a specific platform team and/or corresponding set of applications. Additionally, the candidate will be responsible for the delivery of approved projects through the project management framework. The Technical Solution Analyst needs to be able to produce detailed technical documents, configure and/or develop within the assigned applications and understand the overall design and architecture of a platform, and deliver the end-to-end technical solution.\n<br><br>\n<b>Essential duties &amp; responsibilities:</b> (detailed description)\n<br><br>\n<ul><li>Perform activities following Stryker’s Software Development Lifecycle (SDLC) framework and processes</li><li>Technical Design, Development, Testing and Delivery of solutions for Release Cycles and/or new projects within a Shared Service Platform / application stack</li><li>Identify opportunities to improve the systems process flow, performance and technical efficiencies.</li><li>These responsibilities will be distributed across Projects, Release Cycles and Operations / Support.</li><li>Produce technical documents, configure and/or develop within assigned applications and understand the overall design/architecture of a platform.</li><li>Communication within IS teams is critical for both day-to-day events and building out new solutions.</li><li>Transition knowledge of the new/enhanced capabilities (including technical aspects) to the Service Delivery Team(s).</li><li>Be able to support the business and recommend/provide holistic solutions that integrate the existing technical standards with the business needs and processes</li><li>Recommend approaches to optimize/tune systems performance.</li><li>Create both system and technical documentation.</li><li>Work with other IS teams along with business teams to deliver business solutions</li><li>Partner with Business Analysts in understanding system requirements and translating into solutions within an application and/or application stack</li><li>Guides and mentors other Solution Analysts</li><li>Special projects/assignments as required.</li></ul>\n<b>Education &amp; special trainings:</b><br>\n<ul><li>Enrolled in an accredited university pursuing a bachelor’s degree in the areas of Computer Science, Engineering, Information Systems, Business, or equivalent field of study preferred</li></ul>\n<b>Qualifications &amp; experience:</b><br>\n<ul><li>Experience documenting complex processes and presenting them in a clear and understandable format is preferred</li><li>Demonstrated ability to understand, evaluate and recommend changes to business processes is preferred</li><li>Knowledge of Agile Development methodologies is preferred</li><li>Versatility and willingness to work with constantly changing priorities with enthusiasm</li><li>Demonstrated ability to communicate effectively with Management</li><li>Demonstrated ability to work effectively in a matrix organization structure with significant emphasis on collaboration and persuasion, rather than relying entirely on command and control</li><li>Strong data analysis and problem-solving skills</li><li>Exceptional written, verbal and presentation skills to a diverse set of audiences</li><li>Cumulative 3.0 GPA or above; must be the case at the date of hire and also will be verified during background check in the spring</li><li>Must be legally authorized to work in the U.S. and not require employment-based sponsorship now or in the future.</li></ul>\n<b>Physical &amp; mental requirements:</b><br>\n<ul><li>Demonstrated strong communication and influencing skills – oral, written, listening, presentations</li><li>Demonstrate ability to work in and deal with ambiguous situations</li><li>Driven and results oriented. He/she will be required to drive results and integrate effectively into the culture. The successful candidate must possess the blend of confidence and humility while driving to achieve results and meeting committed timelines.</li><li>Experience in identifying opportunities for process optimization, process redesign, or development of new process/policies</li></ul>\n</div><div></div>"
    },
    {
        "position": "Gas Power Data and Analytics Intern – Summer2022",
        "company": "General Electric - 4.0",
        "location": {
            "city": "Atlanta",
            "state": "GA"
        },
        "posted": "2021-10-16T17:03:47.592Z",
        "url": "https://www.simplyhired.com/job/aOOGYDh41Gzg1kJJ4sxqiRHdAOnFKZaqGfH41AoWYyTYNcgDqWpk9A?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:43.939Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Description Summary\n<br>GE is seeking sharp, personable, highly organized interns who are looking for the opportunity to grow their domain knowledge in the data field. Interns will engage in hands-on data projects while also enhancing their business and professional skills. Interns will learn from the best in the industry and work on substantial projects with real world implications, getting hands-on with digital technologies.\n<br><br>\nJob Description\n<br><br>\n<b>Essential Responsibilities :</b><br>\nCandidates will join the summer internship program and will be working on one of the below assignments\n<br><br>\n<b>Data Governance Intern:</b><br>\nExpand the Data Lineage and Metadata Management solution\n<br>Build analytics to drive optimization and remove unused and duplicate data\n<br><br>\n<b>Platforms/Data Operations Intern:</b><br>\nExplore new Cloud technologies\n<br>Design solutions to implement and deploy new technologies\n<br><br>\n<b>Power Data Portal Intern:</b><br>\nOne-stop shop for Data @ GE Gas Power – integrate certified analytics, how-to s, training and data access into a single portal\n<br><br>\n<b>Qualifications/Requirements :</b><br>\nMust have one to two semesters left prior to graduation and be enrolled in a full-time undergraduate or graduate program in an engineering discipline as listed below.\n<br><b>Following majors accepted:</b> Degree focused in Computer Science, Computer Engineering,\n<br>Computer Information Systems, Management Information Systems, IT Security,\n<br>Informatics, Information Science/Technology, Software Engineering, Security and\n<br>Risk Analysis, or other relevant STEM majors with IT experience.\n<br><br>\n<b>ELIGIBILITY REQUIREMENTS:</b><br>\nMust maintain a minimum 3.0 cumulative GPA (without rounding).\n<br>Must submit your application for employment through gecareers.com/campus interview to be considered\n<br>Must be willing to take a drug test as part of the selection process\n<br>Must be willing to submit to a background investigation as part of the selection process\n<br>Must be 18 years of age or older\n<br>Must be able to develop and maintain good customer relationships\n<br>Must have reliable transportation and a valid driver's license\n<br>Must be willing to work in geographical area specified by the business\n<br><br>\n<b>Desired Characteristics :</b><br>\nPrior knowledge of SQL and Data modeling required.\n<br>Prior experience with Tableau/other visualization tools, Talend/other ETL tools and/or Postgres/other databases preferred.\n<br>Prior experience with Big Data technologies preferred.\n<br>Prior intern, co-op, or research experience in software, IT or relevant area.\n<br>Leadership experience inside and/or outside the classroom.\n<br>A strong commitment to a career in technology and passion/aptitude for both software and information technology.\n<br>Strong analytical and technical skills with experience in IT industry standards and development methodologies.\n<br>Excellent written and verbal communication skills and ability to articulate clearly.\n<br>Demonstrated creative problem solving and proactive learning.\n<br><br>\n<b>Additional Eligibility Qualifications :</b><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n<br><br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n<br><br>\n<b>Relocation Assistance Provided:</b> Yes</div><div></div>"
    },
    {
        "position": "Intern, Data Science (Graduate)",
        "company": "Horizon - 3.6",
        "location": {
            "city": "Deerfield",
            "state": "IL"
        },
        "posted": "2021-10-16T17:03:51.575Z",
        "url": "https://www.simplyhired.com/job/WzG9qxi8WqAm04AJebi2gcsyuq5Jilaw-JuHSWqge6_voCeunH78Ug?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:47.988Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Working at Horizon is more than a job – it’s personal. For us, success is measured by the numbers that matter most – the number of lives we touch, the number we change and those we work tirelessly to help save. We’re a team of agile, out-of-the-box thinkers who are inspired to do more because we know we’re a part of something bigger. We strive to build meaningful careers at a company whose values we share because when we live up to our potential, we help others live up to theirs.\n<br><br>\nThe Horizon Therapeutics Internship Program offers aspiring professionals an opportunity to build a strong foundation of business acumen, technical skills, and knowledge about the pharmaceutical industry. We are committed to providing program participants with experience-based learning, multidimensional assignments, targeted training, and continual coaching and development.\n<br><br>\n<b>Responsibilities:</b><br>\nThe Intern, Data Science is responsible for the application of advanced analytics to claims datasets and the synthesis of insights. This role will leverage cutting edge data science technologies and methods to help business leaders across the company make appropriate data-driven decisions. The intern will design, develop, and implement machine learning algorithms, and will serve as an internal advocate for the power of data science. The role will collaborate with other stakeholders across the business to drive growth for our brands.\n<br><br>\nSupport the implementation of advanced analytics across the organization, including applications of machine learning, statistical insights generation and, medical research support\n<br>Learn the process of building and fine-tuning algorithms that scale up from proof-of-concept to production-grade initiatives\n<br>Enhance the automation of machine learning deployment across Horizon’s portfolio of medicines\n<br>Create insightful visualizations that help non-technical audiences to understand complex datasets and outputs\n<br>Identify and shape business challenges and opportunities into analytical, data-driven solutions, ranging from scoping and evaluating data opportunities to developing data-driven insights, data models and recommendations to fuel strategic growth\n<br>Participate in ad hoc analytics and automation projects\n<br><br>\n<b>Qualifications and Skills Required:</b><br>\nMust be a current graduate student working towards a Master's degree in a quantitative field (Data Science, Computer Science, Software Engineering, Operations Research, Applied Math, Statistics or related)\n<br>Minimum GPA of 3.0\n<br>Prior experience with predictive modeling required\n<br>Proven experience with Python required; experience with distributed computing technologies for machine learning, such as Apache Spark and Linux, is a plus\n<br>Experience in biotech / pharmaceuticals preferred but not required\n<br>Knowledge and familiarity with state-of-the-art machine learn algorithms, such as deep learning and its use in time series applications with highly dimensional data\n<br>Ability to translate analysis into insights – able to tell compelling stories with data\n<br>Excellent problem-solving capabilities\n<br>Professional demeanor\n<br>Self-starter attitude\n<br>Strong interpersonal skills\n<br>Excellent written and verbal communication skills\n<br><br>\n<b>Horizon Core Values &amp; Competencies:</b><br>\nGrowth\n<br><br>\nManages Ambiguity\n<br>Strategic Mindset\n<br>Demonstrates Self-awareness\n<br>Cultivates Innovation\n<br>Develops Talent\n<br><br>\nAccountability\n<br><br>\nDrives Results\n<br>Ensures Accountability\n<br>Decision Quality\n<br><br>\nTransparency\n<br><br>\nCourage\n<br>Collaboration\n<br>Instills Trust\n<br><br>\nHorizon requires all U.S. employees to be fully vaccinated, as a condition of employment, with Pfizer that has been fully approved by the Food &amp; Drug Administration (FDA) or one of the vaccines currently granted emergency use authorization by the FDA such as Moderna or Johnson &amp; Johnson. Fully vaccinated is defined as two weeks after your final dose of the Pfizer, Moderna or Johnson &amp; Johnson vaccine. We will provide medical and religious accommodations as required by law.\n<br><br>\nHorizon Therapeutics plc does not discriminate on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, veteran status, or any other characteristic protected by law. It is our intention that all qualified applications are given equal opportunity and that selection decisions be based on job-related factors. Any individual, who, because of a disability, needs accommodation or assistance in completing this application or at any time during the application process, should contact the Human Resources Department.</div><div></div>"
    },
    {
        "position": "Cyber Intelligence Analyst Intern (Summer 2022)",
        "company": "Sierra Nevada Corporation - 3.6",
        "location": {
            "city": "Herndon",
            "state": "VA"
        },
        "posted": "2021-10-16T17:03:55.707Z",
        "url": "https://www.simplyhired.com/job/D4wcwdTgZFpIHc8oqo4cJot3rB-x_qqvdfq_drnrwMFCqm5GjLTLYQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:51.971Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Come start your career with some of the brightest and most innovative minds in the country. Get your hands on actual projects, and at the same time, prepare for a truly awesome career in aerospace and defense. This is not your parent’s internship program – you won’t be getting coffee and ordering lunch. Our Interns have the unique experience of getting both mentoring and coaching while working side by side with recognized industry experts on real-world assignments directly related to their field of study. Bring your knowledge and desire to learn, and we will provide the experience. Summer internships are typically 10-12 weeks starting in late May/early June and work an average of 40 hours a week. Depending on satisfactory completion of certain criteria during your internship, you may be considered for a full-time position upon graduation. As a Technical Intern, you'll ask questions, get involved, bring your ideas, be part of an actual project team, attend planning meetings, complete assignments as tasked by your team, absorb and learn from your team and apply that learning to projects assigned. You'll have the opportunity to learn fundamental business processes and procedures, build your technical foundation through practice and mentorship, and participate in an in-depth program built by our University Recruiting team, that includes cross-functional workshops and meeting with leadership to gain understanding of the business and SNC culture.\n<br><br>\nThe Mission Solutions and Technologies (MST) business area provides affordable, turn-key command/control, communications, integrated ISR, force protection and security solutions worldwide. The MST team has a long legacy of supporting the Department of Defense, Department of Homeland Security, commercial and international customers with years of experience in platform operations, engineering and full lifecycle management across domains – air, land, sea, space and cyber. Learn more about MST\n<br><br>\n<b>Must-haves:</b><br>\nMust be a Sophomore, Junior or Senior in college or technical school, with at least one academic term after end of internship\n<br>Background in technology, mathematics, statistics, computer engineering, digital forensics, or computer science\n<br>Strong skills in Word, Excel, PowerPoint\n<br>Ability to work in a highly collaborative team environment\n<br>Strong organization skills and work ethic; detail oriented\n<br><br>\n<b>IMPORTANT NOTICE:</b><br>\nTo conform to U.S. Government international trade regulations, applicant must be a U.S. Citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State or U.S. Department of Commerce.\n<br>At Sierra Nevada Corporation (SNC) we deliver customer-focused technology and best-of-breed integrations in the aerospace and defense sectors. SNC has been honored as one of the most innovative U.S. companies in space, a Tier One Superior Supplier for the U.S. Air Force, and as one of America’s fastest-growing companies. Learn more about SNC\n<br><br>\nSNC offers a generous benefit package, including medical, dental, and vision plans, 401(k) with 150% match up to 8%, life insurance, 3 weeks paid time off, tuition reimbursement, and more .\n<br><br>\nIn accordance with the Executive Order on ensuring adequate COVID Safety Protocols for Federal Contractors, SNC is complying with the requirements that all employees and contractors be vaccinated. As a condition of employment with SNC, you are required to provide proof that you are fully vaccinated for COVID-19 or have a valid exemption under the law.\n<br><br>\nAt Sierra Nevada Corporation (SNC), our mission is to dream, innovate, inspire and empower the next generation to transform humanity through technology and imagination. As an Equal Opportunity Employer, we welcome our employees to bring their whole selves to their work. SNC is committed to fostering an inclusive, accepting, and diverse environment free of discrimination on the basis of race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Contributions to SNC come in many shapes and styles, and we believe diversity in our workforce fosters new and greater ways to dream, innovate, and inspire.</div><div></div>"
    },
    {
        "position": "GE Renewable Energy Supply Chain Internship (EID, OMLP) – Summer 2022",
        "company": "General Electric - 4.0",
        "location": {
            "city": "Greenville",
            "state": "SC"
        },
        "posted": "2021-10-16T17:03:59.708Z",
        "url": "https://www.simplyhired.com/job/iNSCdw1Dp1bqK20sOH1XtpwFdsZ0rJ696qFcxfxKDfgF0jVHaCK3sw?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:03:56.088Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Description Summary\n<br>If you love technology, sustainability, and want a career in manufacturing operations management, a GE Renewable supply chain internship is for you! Assignments are projects taking on the world’s toughest challenges - clean and affordable energy - and motivated by real business priorities. You will experience technically challenging, meaningful, and creative assignments in all segments of our business, including assignments in Onshore Wind, LM Wind Power, Grid Solutions, and Hybrids.\n<br><br>\nJob Description\n<br><br>\n<b>Essential Responsibilities :</b><br>\nSupply Chain Interns are the pipeline for GE Renewable Energy’s Operations Management Leadership Program (OMLP). OMLP is an intensive program for people who have a real passion for technology, a drive for technical excellence, and share in GE's core beliefs. This is a 2-year rotational program designed to accelerate your professional development through intense technical training and a variety of business-critical assignments.\n<br><br>\nAs an Intern, you'll have the opportunity to work on a variety of high priority teams, potentially including product design, systems, component design (such as towers, machine head, power conversion), controls and operability, advanced technology and manufacturing, testing and validation, aerodynamics, performance, quality, services, cost-out, and more.\n<br><br>\n<b>Qualifications/Requirements :</b><br>\nStudents must be enrolled in a full-time undergraduate or graduate program in an engineering discipline as listed below from an ABET accredited university\n<br><b>Applicable Majors:</b> Mechanical Engineering, Electrical Engineering, Controls Engineering. Other Engineering majors such as: Aero Engineering, Computer Engineering, Materials Engineering, Mechatronics Engineering, Computer Science, Civil Engineering, or other Energy related majors will be considered\n<br>GPA greater than or equal to 3.0/4.0 overall\n<br><br>\n<b>Additional Eligibility Qualifications:</b><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen and background check (as applicable).\n<br><br>\n<b>Desired Characteristics :</b><br>\nPreference will be given to persons with 3.2/4.0 overall or higher GPA in the majors noted.\n<br>Strong dedication to a career in technology and a real passion for engineering\n<br>Demonstrated analytical approach to problem solving, learning agility\n<br>Excellent communication skills and ability to articulate technical problems in clear and simple terms\n<br>Demonstrated and enthusiastic leadership and team building skills\n<br>Strong team and interpersonal skills, ability to work in project teams in an international environment\n<br>Proven scholastic achievements and proactive leadership skills</div><div></div>"
    },
    {
        "position": "Technical Direction Intern (Virtual), DreamWorks, Spring 2022",
        "company": "NBCUniversal - 4.0",
        "location": {
            "city": "Glendale",
            "state": "CA"
        },
        "posted": "2021-10-16T17:04:03.691Z",
        "url": "https://www.simplyhired.com/job/JxznyOjT8rkXOYUeVGv24WyU1to7Wo43bA8f6gWa8L7rkgzdZ5FMNQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:00.091Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">DreamWorks Animation is seeking a qualified intern to join our Technical Direction team. This intern will observe and assist Technical Directors with writing tools for the production pipeline in order to gain an understanding of their daily activities. This intern will learn how to develop tools and provide artist support for large-scale feature animation productions. Through this internship, the individual will gain firsthand experience working in a fast-paced, creative environment while being exposed to various production workflows and strategies.\n<br><br>\n<b>Responsibilities:</b><br>\nDesign and develop new software tools and applications to assist artists in production\n<br>Test, debug, and extend existing tools and systems\n<br>Provide technical support to production artists\n<br>Provide support for any additional administrative and data-wrangling tasks as needed\n<br><br>\nQualifications/Requirements\n<br><br>\nExperience in programming\n<br>Enrolled in an Undergraduate or Graduate Program or be a recent graduate (within six months of graduation date)\n<br>Strong organizational skills\n<br>Ability to work independently\n<br>Ability to commit 12 weeks to the internship and work remotely\n<br>Ability to work part time (16-24 hours/week) from January 2022 - April 2022\n<br>Must have own equipment (computer, headphones, etc.) and stable Internet connection\n<br>Must have unrestricted authorization to work in the U.S. without requiring a new Visa or sponsorship\n<br><br>\nDesired Characteristics\n<br><br>\nMajor in Computer Science, Computer Engineering, Visualization or Digital Media (or equivalent)\n<br>Experience in programming languages such as Python, C++ or JavaScript\n<br>Computer Graphics and web development experience\n<br>Experience with project-tracking software such as Jira or equivalent\n<br>Understanding of digital content creation applications such as Maya, Houdini, and/or Nuke • Interest in Feature Animation\n<br>Solid grasp of revision control systems such as Git\n<br>Familiarity with User Experience (UX) concepts and/or User Interface (UI) design and development\n<br><br>\nSub-Business\n<br><br>\nDreamWorks Animation Internships\n<br><br>\nCareer Level\n<br><br>\nCo-op/Intern\n<br><br>\nCity\n<br><br>\nGlendale\n<br><br>\nState/Province\n<br><br>\nCalifornia\n<br><br>\nCountry\n<br><br>\nUnited States\n<br><br>\nAbout Us\n<br><br>\nFrom the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.\n<br><br>\nVisit www.dreamworksanimation.com to see our latest animated film and television productions.\n<br><br>\nDreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It’s our passion and commitment to excellence that drives NBCU’s vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It’s what makes us uniquely NBCU. Here you can create the extraordinary. Join us.\n<br><br>\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.\n<br><br>\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n<br><br>\nNotices\n<br><br>\nNBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable.</div><div></div>"
    },
    {
        "position": "Application Development Summer Intern",
        "company": "Pegasystems - 3.6",
        "location": {
            "city": "Cambridge",
            "state": "MA"
        },
        "posted": "2021-10-16T17:04:07.691Z",
        "url": "https://www.simplyhired.com/job/9Cl8mI5_4peBOs-87Da9E_GWagPU8aiGTnqhoW9Ma1B8UOLOcUWM6Q?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:04.089Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Meet Our Team:</b><br>\nAs a member of an innovative team of IT professionals, you will work closely with talented engineers and product owners across the globe to deploy and support enterprise applications that are used to run our business at Pega. The IT Application Support team plays an important role in helping Pega to grow by ensuring that our enterprise applications are working seamlessly in support of the Finance, Legal, Sales, Marketing, Consulting, HR, Order Management, and IT functions internally; as well as for our external stakeholders, clients and partners. We strive for excellence and embrace agile methodologies to achieve it.\n<br><br>\n<b>Picture Yourself at Pega:</b><br>\nPega’s internship program is the perfect platform to help students transition their academic knowledge into a successful professional career. We push great students to be better, we encourage them to take on the biggest challenges, and we also believe that great ideas can come from anyone or anywhere, irrespective of hierarchy or location. The purpose our internships are to provide students with the opportunity to gain valuable business skills, work on real-time, impactful initiatives, and collaborate on a global scale, all while earning a competitive compensation.\n<br><br>\n<b>What You'll Do at Pega:</b><br>\nWork with a team of IT Application Support Engineers to understand Pega product functionality and support the operations of our internal applications\n<br>Provide assistance to users in resolving support issues with applications through problem investigation using diagnostic support tools and best practices\n<br>Identify issues and offer solutions under guidance of senior support team members\n<br>Record, document and track support cases using ITSM tool\n<br>Proactively monitor application status and performance and write scrips to enhance application monitoring tasks\n<br>Leverage automation tools to automate routine activities\n<br><br>\n<b>Who You Are:</b><br>\nSelf-starter that is eager to learn and has the ability to provide clear, focused written and verbal communication\n<br>Independent thinker, but good team player\n<br>Excellent client relations and organization skills\n<br>Desire to continually learn\n<br>Enrolled in a BS degree or higher in Computer Science or Management Information Systems\n<br>Excellent analytical and problem solving skills\n<br>Strong communication and presentation skills\n<br>Familiarity with Object Oriented Programming concepts\n<br>Basic understanding of relational database concepts\n<br><br>\n<b>Pega Offers You:</b><br>\nOpportunity to work with diverse global teams on real-time, impactful projects and initiatives\n<br>Professional development seminars and meet &amp; greets with Pega’s CEO and Founder, and Executive Leadership Team through our “Coffee Break Series”\n<br>Participation in Pega and intern specific events such as social events, volunteer opportunities, group projects, team outings, etc.\n<br>Potential for full-time offer\n<br>Structured manager and mentor program\n<br>Competitive salary and perks\n<br>Casual and fun environment\n<br>As an Equal Opportunity and Affirmative Action employer, Pegasystems will not discriminate in its employment practices due to an applicant's race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, veteran or disability status, or any other category protected by law.\n<br>Accessibility – If you require accessibility assistance applying for open positions please contact PegaApplication@pega.com.</div><div></div>"
    },
    {
        "position": "Intern – IT BI Analytics (NOA)",
        "company": "Nintendo of America Inc. - 4.1",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "2021-10-16T17:04:14.609Z",
        "url": "https://www.simplyhired.com/job/FjMJsZBrSyBuPXRrC7CUfG4Hc1LSPGxPQ0m7O5W_erkc97zT719U7g?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:11.141Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Nintendo of America Inc.\n<br><br>\nThe worldwide pioneer in the creation of interactive entertainment, Nintendo Co., Ltd., of Kyoto, Japan, manufactures and markets hardware and software for its Nintendo Switch™ system and the Nintendo 3DS™ family of portable systems. Since 1983, when it launched the Nintendo Entertainment System™, Nintendo has sold billions of video games and hundreds of millions of hardware units globally, including Nintendo Switch and the Nintendo 3DS family of systems, as well as the Game Boy™, Game Boy Advance, Nintendo DS™ family of systems, Super NES™, Nintendo 64™, Nintendo GameCube™, Wii™, and Wii U™ systems. It has also created industry icons that have become well-known, household names, such as Mario, Donkey Kong, Metroid, Zelda and Pokémon. A wholly owned subsidiary, Nintendo of America Inc., based in Redmond, Wash., serves as headquarters for Nintendo’s operations in the Americas. For more information about Nintendo, please visit the company’s website at http://www.nintendo.com .\n<br><br>\nNintendo is an equal opportunity employer. We offer a welcoming and inclusive environment in service to one another, our products, the diverse consumers we represent, and the communities we call home. We do all of this with kindness, empathy and respect for each other.\n<br><br>\nGET SERIOUS ABOUT FUN\n<br><br>\nAs a Nintendo of America Intern, you will actively contribute to meaningful projects, and gain valuable hands-on work experience with a leading company in the entertainment industry. During the program from June through August, your work experience will be enhanced with mentoring, networking opportunities and exposure to industry leaders from across the company! Whether you are in a technical or non-technical role, you will be a part of a team committed to putting smiles on faces of millions around the world.\n<br><br>\nDESCRIPTION OF DUTIES\n<br>Work with Nintendo’s IT team that is responsible for the Enterprise Data warehouse\n<br>Collaborate with data engineers to learn and help build data pipelines, create data warehouse designs and data reconciliation\n<br>Learn the end to end lifecycle of data and gain exposure to SnowFlake, AWS and Matillion\n<br>Build visualizations that utilize data models from the data warehouse.\n<br>SUMMARY OF REQUIREMENTS\n<br>3.0+ GPA\n<br>Freshmen to graduating seniors enrolled in accredited college or university\n<br>Pursuing a degree in Computer Science, Information Technology, Data Engineering, or related field\n<br>Excellent interpersonal and communication skills to work cross-functionally\n<br>Experience with AWS, SQL and Python\n<br>Legally authorized to work in the United States</div><div></div>"
    },
    {
        "position": "DRAM Core Test Engineer Intern",
        "company": "Micron Technology - 3.7",
        "location": {
            "city": "Boise",
            "state": "ID"
        },
        "posted": "2021-10-16T17:04:19.474Z",
        "url": "https://www.simplyhired.com/job/5HoiwMTpIjIr2miuhooMzI9Ct4iV8jiK5Hd57EL2y-qgML8Vg9BySQ?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:15.002Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Our vision is to transform how the world uses information to enrich life for all. Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing.\n<br><br>\nOur vision is to transform how the world uses information to enrich life for all. Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing.\n<br><br>\nDo you love the interaction of cutting-edge hardware and innovative software solutions? In today's data economy, Micron's memory and storage products are essential to advancing state of the art computing technology. Continued scaling of memory technology presents challenges that require complex and creative testing solutions. As a Core Test Development Engineer in the Test Solutions Engineering department, you will be responsible for the development, debug and maintenance of test programs that help deliver Micron's world-class DRAM portfolio to market. A 'Core' test development engineer is specifically focused on the health and quality of the memory cells [DRAM features 16 billion cells in less than 80mm^2 of area]. As test engineers, we must constantly evolve and apply the right technology and testing solution to be successful! We need your passion and excitement to help take the team to the next level!\n<br><br>\nResponsibilities\n<br><br>\nA successful test development engineer must develop a good understanding of test equipment hardware, device knowledge and software systems.\n<br><br>\nDevelop, debug and support test programs from new product introduction phase up through high volume manufacturing\n<br>Write test programs and support scripts in C++, Python\n<br>Contribute input and feedback to help define next generation 'design for test' capabilities\n<br>Analyze device and test flow data to make informed test coverage decisions\n<br>Balance test time objectives while maintaining optimal yield and quality\n<br>Collaborate with partners in Product Engineering, Fab, Manufacturing, Yield Enhancement, Global Quality, Systems Integration Group, and Equipment Engineering teams to deliver the right test solution\n<br><br>\nQualifications\n<br><br>\nDeveloping array core test solutions will require constant learning and continued technical growth. A successful candidate should understand hardware fundamentals and possess programming capability in a major language. Specific knowledge that'll help:\n<br><br>\nBasic R/L/C circuit knowledge\n<br>Digital systems and logic gate representation\n<br>Understanding of CMOS transistor operation\n<br>Intermediate to advanced programming capability [C++ or Python]\n<br>Basic Unix / Linux environment\n<br>Excellent communication and interpersonal skills\n<br>Basic statistics and data analytics\n<br><br>\nEducation\n<br><br>\nBachelor’s degree or equivalent experience in Electrical Engineering, Computer Engineering, Computer Science or a related discipline.\n<br><br>\nAbout Micron Technology, Inc.\n<br><br>\nWe are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron® and Crucial® brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence and 5G applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience.\n<br><br>\nTo learn more, please visit micron.com/careers\n<br><br>\nMicron is proud to be an equal opportunity workplace and is an affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state, or local laws.\n<br><br>\nPlease note that in order to assist in providing a safe and healthy workplace for all Micron team members, new employment offers for jobs based in the U.S., Singapore and Malaysia are contingent upon the applicant’s provision of a copy of their COVID-19 vaccination document to Micron on a confidential basis prior to their scheduled start date confirming that they have completed the COVID-19 vaccination process, subject to any written request for medical or religious accommodation and to the extent permitted by applicable law.\n<br><br>\n<b>For US Sites Only:</b> To request assistance with the application process and/or for reasonable accommodations, please contact Micron’s People Organization at hrsupport_na@micron.com or 1-800-336-8918\n<br><br>\nMicron Prohibits the use of child labor and complies with all applicable laws, rules, regulations, and other international and industry labor standards.\n<br><br>\nMicron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.</div><div></div>"
    },
    {
        "position": "Co-op Internship Student, Computer Science",
        "company": "Husky Energy - 4.0",
        "location": {
            "city": "Lima",
            "state": "OH"
        },
        "posted": "2021-10-16T17:04:23.598Z",
        "url": "https://www.simplyhired.com/job/r4ULWo0FxUIuWoMtKn3SQtZqnFuSYsFoVMYVYf_pQTrxbAX1tl4j0w?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:19.861Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Posting End Date:</b> October 29, 2021\n<br>Posting will expire at 11:59 pm local time.\n<br><br>\nOn January 1, 2021, Husky and Cenovus combined to form a resilient integrated energy leader. Husky is now part of the Cenovus group of companies .\n<br><br>\nOne of Husky’s advantages is that we are an integrated oil and gas company. From exploration to development, production, refining and marketing, we’ve got it all! Combine this with a range of learning and development tools and an inclusive work environment, and you are well-positioned for a successful career at Husky.\n<br><br>\nWe have training, mentoring and career development programs and resources to help you develop both personally and professionally – as an employee or a leader. We offer many internal leadership and business skills courses along with tuition reimbursement programs for qualified employees. Every year, a significant number of our employees are able to take on new roles within the company thanks to our strong focus on hands-on learning and development.\n<br><br>\nJob Summary\n<br><b>Start Dates:</b> January 2022; May 2022; and September 2022\n<br><b>Location:</b> Ohio and Wisconsin\n<br><b>Length of Term:</b> 4 Months\n<br><br>\nAre you looking for an exciting Co-op/Internship opportunity full of meaningful, diverse, and challenging assignments working alongside industry leading professionals? You’ll be part of a driven, and collaborative team completing important projects while receiving the mentorship, knowledge, and experience to develop the skills you need to build an exciting career.\n<br><br>\nHusky Energy is seeking innovative and driven students to support various departments across the business.\n<br><br>\n<b>Benefits of a Husky Energy Student Position:</b> Opportunities to: take part in impactful business projects network with experienced professionals engage in a strong student network gain valuable exposure in the Oil and Gas industry Relevant work experience in your field of study Relocation assistance Competitive wages\n<br><br>\nHusky’s US Co-op positions are based in Ohio and Wisconsin. The responsibilities of the Co-op position will vary depending on the business unit and work location.\n<br><br>\nAs the COVID-19 situation continues to rapidly evolve, there is the potential for the Co-op Student to work remotely for a duration of the work term. The health and safety of our employees is of great importance to us and we thank you for your patience as we work together through these uncertain times.\n<br><br>\nQualifications\n<br>Experienced in Microsoft Windows and Office Applications (Word, Excel, PowerPoint, Outlook, SharePoint)\n<br>Experience with application installation and application testing is an asset\n<br>Experience with Data Management would be considered an asset\n<br>Proficiency in at least one back-end or front-end language like C#, Java, PHP HTML5 / CSS3 / JavaScript / jQuery or similar is an asset\n<br>Experience in R Language, Python, Spotfire, Knime, Alteryx is an asset\n<br>Ability to work safely in a rugged environment when necessary and to wear required Personal Protective Equipment.\n<br>Good organizational skills, with the ability to set priorities, follow-up and meet deadlines\n<br>Must be able to work effectively in a team environment\n<br>Effective written and oral communication skills\n<br>Experience in agile project delivery is an asset\n<br>Oil and gas experience would be an asset\n<br><br>\nEducation &amp; Professional Designations Must be currently enrolled in a post-secondary Co-op or Internship program Must receive Co-op credit for the duration of the work term Strong academic background in Information Technology, Computer Sciences and Engineering, Management Information Systems or related discipline Preference will be given to students in 3rd or 4th year\n<br><br>\nSafety Sensitive\n<br><b>Safety Sensitive:</b> Yes\n<br><br>\nOrganizational Competencies\n<br>Technical Professional Skills\n<br>Drives for Results\n<br>Forward Thinking\n<br>Change Agility\n<br>Develops Potential\n<br>Communicates Effectively\n<br>Works Collaboratively\n<br><br>\nSubmission\n<br>Please submit a resume and transcript in one PDF document. Applications without a recent transcript will not be considered.\n<br><br>\nRelocation\n<br>Students moving for their work term may be eligible to receive a lump sum payment to assist with relocation expenses.\n<br><br>\nCandidates must have their own means of transportation as there is no public transportation in field locations.\n<br><br>\n<b>Additional Information:</b><br>\nNew graduates are not eligible for student opportunities.\n<br>Please note that only those selected for an interview will be contacted.\n<br><br>\nPlease note that pre-employment background checks are pre-conditions to Husky employment offers and must be completed successfully before you are confirmed to start with Husky.\n<br><br>\nHusky Energy is an affirmative action employer and we are committed to providing equal employment opportunities to qualified applicants without regard to age, disability, genetic information, gender, gender identity, sexual orientation, race, color, religion, veteran status, or other personal or physical characteristics protected by law.\n<br><br>\nHusky Energy is an integrated Canadian energy company headquartered in Calgary, Alberta. The Company operates Upstream and Downstream business segments, with operations in Canada, the United States, China and Indonesia.\n<br><br>\nHusky's balanced growth strategy focuses on consistent execution, disciplined financial management and safe and reliable operations.</div><div></div>"
    },
    {
        "position": "Intern - Analytics (NOA)",
        "company": "Nintendo of America Inc. - 4.1",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "2021-10-16T17:04:27.678Z",
        "url": "https://www.simplyhired.com/job/YuouTXKgTRn-fCVDOomIL3WRD-9VOojld7Xt7E2ENsolNz2pZOug8Q?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:23.983Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Nintendo of America Inc.\n<br><br>\nThe worldwide pioneer in the creation of interactive entertainment, Nintendo Co., Ltd., of Kyoto, Japan, manufactures and markets hardware and software for its Nintendo Switch™ system and the Nintendo 3DS™ family of portable systems. Since 1983, when it launched the Nintendo Entertainment System™, Nintendo has sold billions of video games and hundreds of millions of hardware units globally, including Nintendo Switch and the Nintendo 3DS family of systems, as well as the Game Boy™, Game Boy Advance, Nintendo DS™ family of systems, Super NES™, Nintendo 64™, Nintendo GameCube™, Wii™, and Wii U™ systems. It has also created industry icons that have become well-known, household names, such as Mario, Donkey Kong, Metroid, Zelda and Pokémon. A wholly owned subsidiary, Nintendo of America Inc., based in Redmond, Wash., serves as headquarters for Nintendo’s operations in the Americas. For more information about Nintendo, please visit the company’s website at http://www.nintendo.com .\n<br><br>\nNintendo is an equal opportunity employer. We offer a welcoming and inclusive environment in service to one another, our products, the diverse consumers we represent, and the communities we call home. We do all of this with kindness, empathy and respect for each other.\n<br><br>\nGET SERIOUS ABOUT FUN\n<br><br>\nAs a Nintendo of America Intern, you will actively contribute to meaningful projects, and gain valuable hands-on work experience with a leading company in the entertainment industry. During the program from June through August, your work experience will be enhanced with mentoring, networking opportunities and exposure to industry leaders from across the company! Whether you are in a technical or non-technical role, you will be a part of a team committed to putting smiles on faces of millions around the world.\n<br><br>\nDESCRIPTION OF DUTIES\n<br>Work with Nintendo’s Business Analysis &amp; Planning team that facilitates and enables data-informed decision-making at Nintendo of America.\n<br>Combine and analyze multiple data sets to answer business questions.\n<br>Collaborate with business and technology functions to understand requirements, design solution and deliver data sets and business insights.\n<br>Create presentation materials on the results of data analysis / processes for team leadership.\n<br>SUMMARY OF REQUIREMENTS\n<br>3.0+ GPA\n<br>Freshmen to graduating seniors enrolled in accredited college or university\n<br>Pursuing a degree in Mathematics, Computer Science, Statistics, Physics, or related fields\n<br>Strong understanding of databases, data structures, and algorithms\n<br>Proficient in one or more additional programming languages (Python, R, SQL or similar).\n<br>Ability to effectively articulate technical challenges and solutions.\n<br>Familiar with machine learning modeling (Regression and Forecasting)\n<br>Adept at handling ambiguous or undefined challenges through strong problem-solving skills and effective communication.\n<br>Legally authorized to work in the United States</div><div></div>"
    },
    {
        "position": "Information Technology Intern",
        "company": "Herc Rentals - 3.1",
        "location": {
            "city": "Bonita Springs",
            "state": "FL"
        },
        "posted": "2021-10-16T17:04:31.656Z",
        "url": "https://www.simplyhired.com/job/GyAKe1jNS_lceK7xpyzu4bNlWG_53j3IoYuJ6jg8kvFbx_sFrUfZhA?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:28.058Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Req #:</b> 26101\n<br><br>\nHerc Rentals Inc. is a premier, full-service equipment rental firm – providing our customers the equipment, services and solutions they need to achieve optimal performance safely, efficiently and effectively. A pioneer of the equipment rental industry, Herc Rentals continues to evolve and grow through technological innovations, expanded product offerings and value-added services and consultative solutions to support its customers’ projects.\n<br><br>\nWith more than 55 years of equipment rental expertise, approximately 4,900 employees and approximately 270 company-operated locations across North America, Herc Rentals serves a broad range of end markets, including construction; industrial operations, refineries and petrochemical operations; governmental entities and contractors; disaster recovery and remediation; infrastructure; railroad operations; utilities; film, television, live entertainment and special event production; agricultural operations; and facilities management..\n<br><br>\n<b>We are looking for:</b><br>\nInformation Technology students who will work with technical and non-technical teams. The ideal candidate should be passionate about new technology.\n<br><br>\n<b>Who we are looking for:</b><br>\nWork closely with teams to solve problems and improve processes\n<br>Analytical mindset and ability to see the big picture and influence others\n<br>Effective communication skills with the ability to give impactful feedback to colleagues\n<br>Strong Communication and Interpersonal skills.\n<br>Ability to work independently and multi-task in a fast-paced environment.\n<br>Should be an aggressive and quick learner.\n<br><br>\n<b>Qualifications:</b><br>\nCurrently enrolled in Computer Science/MIS major\n<br>Applicants must be located within commutable distance to the Bonita Springs, FL HQ to allow for work while attending school.\n<br><br>\nOur long-term strategy underscores the understanding that our success depends on the dedication and capability of our team members. We are focused on attracting, retaining and empowering talented and dedicated people to build the best team in the equipment rental industry. We also seek to build a team that reflects the variety of people, cultures and communities we interact with every day and to create an inclusive, productive environment in which all team members feel valued and respected.\n<br><br>\nHerc Rentals provides an excellent compensation and benefits package, which includes a competitive salary, retirement savings plan, tuition reimbursement, comprehensive medical, dental, vision care, life insurance coverage, paid vacation and holidays.\n<br><br>\nHerc does not discriminate in employment based on the basis of race, creed, color, religion, sex, age, disability, nationals origin, marital status, sexual orientation, citizenship status, political affiliation, parental status, military service, or other non-merit factors.</div><div></div>"
    },
    {
        "position": "GE Aviation Digital Technology Intern - Summer 2022",
        "company": "General Electric - 4.0",
        "location": {
            "city": "Cincinnati",
            "state": "OH"
        },
        "posted": "2021-10-16T17:04:35.823Z",
        "url": "https://www.simplyhired.com/job/jizWVdBw5GUFaZaoUanRfCXJf6v6brPQult8KqWw41wF3LqQF7keYg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:32.056Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Description Summary\n<br>GE Aviation Digital Technology is seeking sharp, personable, highly-organized interns who are looking for the opportunity to grow their technical and professional skills while building a career with unlimited potential. Interns will learn from the best in the industry and work on substantial projects with real world implications, getting hands-on with digital technologies!\n<br><br>\nJob Description\n<br><br>\n<b>Essential Responsibilities:</b><br>\nWe offer meaningful, impactful work as well as a jam-packed events calendar for the summer that includes team building, career development opportunities, hackathons, and more. Interns are one of GE Aviation's pipelines to full-time employment opportunities either as a direct hire or as a member of one of GE’s world-class early talent leadership programs.\n<br><br>\nDigital Technology Interns are hired to focus on a particular area of the GE business based on availability of positions, the interviewer's assessment, and the applicant's preference. Focus areas could include but are not limited to Predix/Digital Platforms, Full Stack development, Cyber Security, Commercial, Data Analytics, ERP and more.\n<br><br>\nDigital intern assignments are dynamic and challenging based on the business needs and the type of work required. Interns have significant exposure to key IT and Software business leaders at GE; as well as a global internship support network to accelerate learning and development. Interns also have extracurricular opportunities to engage in various activities both socially and professionally.\n<br><br>\n<b>Qualifications/Requirements:</b><br>\nCurrently enrolled in a Associate's, Bachelor’s or Master’s Degree program at an accredited university or credentialed software accelerator program.\n<br>Degree focused in Computer Science, Computer Engineering, Computer Information Systems, IT Security, Informatics, Information Science/Technology, Management Information Systems, Software Engineering, Security and Risk Analysis, or other relevant STEM majors with Software/IT experience.\n<br>Minimum 3.0 cumulative GPA off a 4.0 scale without rounding\n<br>Dependable transportation to and from work\n<br>Willing to work in Cincinnati, OH or Detroit, MI\n<br>Due to access to export-controlled information, you must be one of the following: (1) US Citizen or national; (2) US permanent resident; (3) Person granted refugee status; (4) Person granted asylee status or Beneficiary of legalization through an amnesty program, or (5) other protected individuals under the Immigration and Naturalization Act, 8 U.S.C. 1324b(a)(3)).\n<br><br>\n<b>Desired Characteristics:</b><br>\nPrior intern, co-op, or research experience in software, IT or relevant area.\n<br>Leadership experience inside and/or outside the classroom.\n<br>A strong commitment to a career in technology and passion/aptitude for both software and information technology.\n<br>Strong analytical and technical skills with experience in software industry standards and development tools.\n<br>Excellent written and verbal communication skills and ability to articulate clearly.\n<br>Demonstrated creative problem solving and proactive learning.\n<br><br>\nThis role is restricted to U.S. persons (i.e., U.S. citizens, permanent residents, and other protected individuals under the Immigration and Naturalization Act, 8 U.S.C. 1324b(a)(3)) due to access to export-controlled technology. GE will require proof of status prior to employment.\n<br><br>\nAdditional Information\n<br><br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n<br><br>\n<b>Relocation Assistance Provided:</b> Yes</div><div></div>"
    },
    {
        "position": "Intern - Product Management",
        "company": "Blue Yonder - 4.4",
        "location": {
            "city": "Waukesha",
            "state": "WI"
        },
        "posted": "2021-10-16T17:04:39.825Z",
        "url": "https://www.simplyhired.com/job/YBi-cLeGqetgnDmakAOFfCALpI1NUwMsjzFkKaf3XzV693n7omSMQg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:36.208Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Blue Yonder’s internship program looks to attract, develop and invest in the future workforce of Blue Yonder: Generation Z. Our interns are given the opportunity to work on projects that deliver real business value, network with associates worldwide, learn about our cutting-edge supply chain technology and develop world-class business knowledge. With an internship at Blue Yonder, a growth-mindset oriented company, the great possibilities for you to develop your career are endless.\n<br><br>\nJob Title\n<br><br>\nIntern - Product Management\n<br><br>\nLocation\n<br><br>\nWaukesha, WI\n<br><br>\nProgram Start Dates\n<br><br>\nJanuary 2022\n<br><br>\nSpecial Notes\n<br><br>\nThis Internship is year-round, anticipated to be part-time (up to 20 hours/week) through the Spring and Fall Semester and will transition to full-time (40 hours/week) during Summer and Winter Breaks.\n<br><br>\nTo qualify, applicants must be Sophomores, Juniors or Seniors pursuing a Bachelor's Degree (expected graduation – Fall 2022/Spring 2023/ Fall 2023).\n<br><br>\nThis role is not eligible for visa sponsorship.\n<br><br>\nOverview\n<br><br>\nStudents working in the Blue Yonder, Inc. (formerly JDA Software) Internship Program will be challenged with all aspects of product management including industry analysis and interpretation for product opportunities, business analysis to understand and manage existing and new software solutions, help create compelling roadmaps, manage Special Interest Group (SIG) communities, and drive appropriate actions to drive growth and customer satisfaction.\n<br><br>\nThroughout the program, the student will have a mentor who will coach and guide them as they take on the responsibilities for the various roles within Product Management. Intern participants will work and contribute as a full team member of the Product Management organization.\n<br><br>\nResponsibilities\n<br><br>\nAssist the members of the product management team in cutting edge warehouse applications as they complete the day to day responsibilities in designing and delivering both new products and enhancements to existing product. This may include research to develop appropriate business cases, understanding market conditions and customer requests.\n<br><br>\nProducing online documentation, developing presentations, attend meetings with internal and external resources including product development, sales, marketing, partners, others where you will be asked to summarize and document outcomes or present research or other work that has been completed.\n<br><br>\nMaintaining and updating under the supervision of product managers, the roadmaps used to educate internal and external stakeholders on product roadmap and backlogs.\n<br><br>\nComplete other projects and day to day tasks as directed by your supervisor.\n<br><br>\nUnderstand the interactions between product management and all aspects of a software company including working with product development, sales, pricing, services and marketing.\n<br><br>\nQualifications\n<br><br>\nCurrently pursuing a Bachelor’s Degree in Business Administration, Information Systems, Supply Chain, Information Technology or an applicable field of study\n<br><br>\nAn understanding of software application development practices and life-cycle\n<br><br>\nKnowledge of/ Interest in back-end and front-end skills to create a full stack solution.\n<br><br>\nDatabase knowledge/experience highly desired\n<br><br>\nCritical thinking, excellent research, and strong analytical skills with superb attention-to-detail\n<br><br>\nAbility to work independently and take initiative while also serving as a team player\n<br><br>\nAbility to interact effectively with Associates across all levels of the organization and variety of cultures\n<br><br>\nStrong time management and organizational skills\n<br><br>\nAbility to handle confidential data\n<br><br>\n<ul><li>LI-LR1</li></ul>\nOur Values\n<br><br>\nIf you want to know the heart of a company, take a look at their values. Ours unite us. They are what drive our success – and the success of our customers. Does your heart beat like ours? Find out here: Core Values\n<br><br>\nDiversity, Inclusion, Value &amp; Equality (DIVE) is our strategy for fostering an inclusive environment we can be proud of. Check out Blue Yonder's inaugural Diversity Report which outlines our commitment to change, and our video celebrating the differences in all of us in the words of some of our associates from around the world.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n<br><br>\nWatch the Summer Internship Program Video !</div><div></div>"
    },
    {
        "position": "GE Renewable Energy - Digital Technology Internship - Summer 2022",
        "company": "General Electric - 4.0",
        "location": {
            "city": "Schenectady",
            "state": "NY"
        },
        "posted": "2021-10-16T17:04:43.939Z",
        "url": "https://www.simplyhired.com/job/2I4BIXbRtwWQ9JvOLpqj_YZB8fRe-rDjSvk87o00IrSZtk6REqBoCg?q=computer+science+intern",
        "lastScraped": "2021-10-18T17:04:40.207Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Job Description Summary\n<br><br>\nJob Description\n<br><br>\nGE Renewable Energy is seeking sharp, personable, highly-organized interns who are looking for the opportunity to grow their technical and professional skills while building a career with unlimited potential. Interns will learn from the best in the industry and work on substantial projects with real world implications, getting hands-on with digital technologies.\n<br><br>\nWe offer meaningful, impactful assignments as well as an internship that includes team building, career development opportunities, and more! Digital Technology Interns are GE Renewable Energy’s primary pipeline to full-time employment opportunities either as a direct hire or as a member of one of our world-class early talent leadership programs. Digital Technology Interns are hired to focus on a particular area of the business based on availability of positions, the interviewer's assessment, and the applicant's preference. Digital Technology Intern assignments, typically 2 months in length, are dynamic and challenging based on the business needs and the type of work required. Interns have significant exposure to key IT and software business leaders at GE Renewable Energy; as well as a global internship support network to accelerate learning and development.\n<br><br>\nQualifications/Requirements\n<br><br>\n<ul><li>Currently enrolled in a Bachelor’s or Master’s Degree program at an accredited university or credentialed software accelerator program.</li><li>Minimum cumulative 3.0/4.0 GPA or equivalent.</li><li>Degree focused in Computer Science, Computer Engineering, Computer Information Systems, Management Information Systems, IT Security, Informatics, Information Science/Technology, Software Engineering, Security and Risk Analysis, or other relevant STEM majors with IT experience.</li><li>Proficiency in oral and written English.</li><li>Preferably available to start May 2022.</li></ul>\nDesired characteristics\n<br><br>\n<ul><li>Leadership experience inside and/or outside the classroom.</li><li>A strong commitment to a career in technology and passion/aptitude for both software and information technology.</li><li>Strong analytical and technical skills with experience in IT industry standards and development methodologies.</li><li>Excellent written and verbal communication skills and ability to articulate clearly.</li><li>Demonstrated creative problem solving and proactive learning.</li></ul>\n<b>Additional Eligibility Qualifications:</b><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n<br><br>\nTo stay connected with exciting news and the latest job opportunities from GE businesses, follow us on twitter: @gecareers\n<br><br>\nAbout us\n<br><br>\nGE Renewable Energy harnesses the earth’s most abundant resources – the strength of the wind, the heat of the sun and the force of water – to power the world’s biggest economies and the most remote communities.\n<br><br>\nWith an innovative spirit and an entrepreneurial mindset, we engineer energy products and digital services that create industry-leading value for our customers around the world.\n<br><br>\nWe see the promise of renewable energy everywhere we look. Our team has the courage, scale, passion, diversity and resourcefulness needed to deliver that promise wherever and however the world needs it.\n<br><br>\nTogether with our customers, we’re proving that no one ever has to choose between affordable, reliable, or sustainable energy.\n<br><br>\nWe are unleashing limitless energy.\n<br><br>\nAdditional Information\n<br><br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n<br><br>\n<b>Relocation Assistance Provided:</b> No</div><div></div>"
    }
]