[
    {
        "position": "Data Engineer Intern",
        "company": "Cvent - 3.6",
        "location": {
            "city": "Dallas",
            "state": "TX"
        },
        "posted": "1 hour ago",
        "lastScraped": "2020-12-06T06:36:38.856Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">What you will be doing\n<br><br>\nContribute in developing database structures for OLTP systems in multiple backend types.\n<br>Contribute to implement ETL and ELT process to consolidate data across multiple systems\n<br>Develop APIs, services, data transfers to internal and external systems\n<br>Resolve performance and security issues relating to data access and maintenance\n<br>Understand and contribute to a corporate data model and overall data governance\n<br>Follow best practices for a full software development lifecycle involving data and code.\n<br>Perform unit testing of database and service API\n<br>Contribute to new technology evaluations and recommended usage by developing proof of concepts in java or aws services to use in upcoming projects\n<br>Provide support for database related issues affecting system or process availability.\n<br><br>\nWhat You Need for this Position\n<br><br>\nRising Seniors Graduating in December 2021 or May 2022\n<br>Pursuing a Bachelors degree in Computer Science, CIS or related field\n<br>Basic knowledge/experience of Java, AWS and Backend Types like postgres, Oracle, SQL Server and NoSQL DB would be a plus\n<br>Basic understanding of ETL process and data warehouse concepts\n<br>Good Communication skills.\n<br><br>\nKey Skills &amp; Competencies\n<br><br>\n<b>Superior Interpersonal Skills:</b> Ability to interface with a wide range of personalities and levels within Cvent and client organizations; Professional communication style\n<br><b>Data Collection and Analysis:</b> Proactive listening; resourceful in collecting sufficient data; Analysis of data to develop and implement best solution\n<br><b>Initiative:</b> Tenacity in problem solving with positive outcomes; Motivated to increase capacity and responsibility\n<br><br>\nAt Cvent we celebrate, support and are committed to creating a diverse and inclusive environment. We’re proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status or any other legally protected characteristics.\n<br><br>\nCvent Maintains a drug-free workplace.</div><div></div>"
    },
    {
        "position": "Intern Software Developer",
        "company": "Datix -",
        "location": {
            "city": "St",
            "state": "Louis"
        },
        "posted": "4 days ago",
        "lastScraped": "2020-12-06T06:36:38.910Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Is this you?</p><ul><li>Assertive, factual communicator</li><li>Continually pursuing personal growth and learning</li><li>Make decisions based on facts</li><li>Goal oriented</li><li>Proactive Multi-tasker</li><li>Strive for order and structure</li></ul><p>If so, we have a great opportunity waiting: the Software Development Intern will learn a multitude of software development languages and strategies. Prove yourself and you'll quickly convert to a full-time employee with competitive pay and benefits.</p><p>At Datix we:</p><ul><li>Work with <i>Cutting Edge Technologies</i></li><li>Offer great opportunity for <i>Career Advancement</i></li><li>Have a fast-paced environment where you'll never get bored working on just 1 project</li></ul><p>Technologies:</p><ul><li>C#, .Net</li><li>PHP</li><li>Apex</li><li>ERP, CRM, and E-commerce Platforms</li></ul><p>Duties:</p><ul><li>Build and test new systems and enhancements using the Datix dev process</li><li>Quickly get up to speed on new technologies</li><li>Create high quality code deliverables</li></ul><p>Qualifications:</p><ul><li>Bachelor degree in Computer Science, Engineering or Information Systems a plus</li><li>Experience with at least one programming language</li><li>Experience with at least one database management system</li><li>Strong attention to detail, dependability, and follow through</li><li>Desire to learn new technologies</li></ul><p>No H1B sponsorship available at this time.</p><p>Datix is a rapidly growing software consulting services company based in St. Louis, MO with clients throughout North America. During our 20 years in operation we have applied our unique approach to optimizing business processes to clients in a wide range of industries including distribution, manufacturing, and professional services.</p><p>Job Types: Part-time, Internship</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul></div><div></div>"
    },
    {
        "position": "Intern - Cyber Security",
        "company": "Conning & Company -",
        "location": {
            "city": "Hartford",
            "state": "CT"
        },
        "posted": "11 hours ago",
        "lastScraped": "2020-12-06T06:36:39.200Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">We are seeking a motivated college student with interest in joining our growing organization for a 10-week summer internship program. Conning’s comprehensive program features hands-on activities and daily interaction with our information security and IT infrastructure teams to perform information security daily, weekly and monthly functions. The candidate will be trained on security tools/processes and work on a wide variety of security tasks including vulnerability management, cybersecurity event monitoring, asset management, and product research.\n<br><br>\nThe program also offers valuable training and development for young professionals, meaningful mentoring relationships, and community service participation. The intern will lead a strategic project presented to company leadership at the end of the program.\n<br><br>\n<b>Duties and Responsibilities May Include:</b><br>\nWork directly with information security staff to ensure newly discovered vulnerabilities are collaborated with the remediation team in a timely manner\n<br>Review security tools, logs, and other systems as assigned\n<br>Monitor cybersecurity events/alerts platform\n<br>Assist with investigation, critical issue, and documentation of cybersecurity events\n<br>Assist with information security initiatives.\n<br>Maintain accurate and up-to-date security documentation\n<br>Maintain flexibility to work autonomously and in teams on variety of duties as assigned\n<br><br>\n<b>Requirements:</b><br>\nPursuing Bachelor’s degree in Information Security, Computer Science, or a related field.\n<br>Undergraduate students going into their Junior or Senior year ONLY\n<br>Must have local accommodation\n<br>Knowledge of information security concepts\n<br>Knowledge of networking concepts including TCP/IP, hardware, routers, switches, firewalls, IDS/IPS systems\n<br>Knowledge of Windows workstation and server operating systems\n<br>Experience with Microsoft Office Suite\n<br>Attention to detail and strong analytic skills\n<br><br>\nConning is an equal opportunity employer. Our company embraces the principles of diversity, equity and inclusion; our employees can bring the best version of themselves to work every day. We thrive in an environment where everyone’s voice is heard, every idea counts, and the differences of our employees are valued. We provide reasonable accommodations to those who need them.\n<br><br>\nIf you are unable to complete this application due to a disability, contact us to ask for an accommodation or an alternative application process.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div><div></div>"
    },
    {
        "position": "Intern",
        "company": "Conning & Company -",
        "location": {
            "city": "Hartford",
            "state": "CT"
        },
        "posted": "11 hours ago",
        "lastScraped": "2020-12-06T06:36:39.441Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>Position Summary:</b><br>\nWe are seeking a motivated college student with interest in joining our growing organization for a 10-week summer internship program. Conning’s comprehensive program features hands-on activities and daily interaction with our information security and IT infrastructure teams to perform information security daily, weekly and monthly functions. The candidate will be trained on security tools/processes and work on a wide variety of security tasks including vulnerability management, cybersecurity event monitoring, asset management, and product research.\n<br><br>\nThe program also offers valuable training and development for young professionals, meaningful mentoring relationships, and community service participation. The intern will lead a strategic project presented to company leadership at the end of the program.\n<br><br>\n<b>Duties and Responsibilities May Include:</b><br>\nWork directly with information security staff to ensure newly discovered vulnerabilities are collaborated with the remediation team in a timely manner\n<br>Review security tools, logs, and other systems as assigned\n<br>Monitor cybersecurity events/alerts platform\n<br>Assist with investigation, critical issue, and documentation of cybersecurity events\n<br>Assist with information security initiatives.\n<br>Maintain accurate and up-to-date security documentation\n<br>Maintain flexibility to work autonomously and in teams on variety of duties as assigned\n<br><br>\n<b>Requirements:</b><br>\nPursuing Bachelor’s degree in Information Security, Computer Science, or a related field\n<br>Undergraduate students going into their Junior or Senior year ONLY\n<br>Must be available June 7 – August 13, 2021\n<br>Must have local accommodation\n<br>Knowledge of information security concepts\n<br>Knowledge of networking concepts including TCP/IP, hardware, routers, switches, firewalls, IDS/IPS systems\n<br>Knowledge of Windows workstation and server operating systems\n<br>Experience with Microsoft Office Suite\n<br>Attention to detail and strong analytic skills\n<br><br>\nConning is an equal opportunity employer. Our company embraces the principles of diversity, equity and inclusion; our employees can bring the best version of themselves to work every day. We thrive in an environment where everyone’s voice is heard, every idea counts, and the differences of our employees are valued. We provide reasonable accommodations to those who need them.\n<br><br>\nIf you are unable to complete this application due to a disability, contact us to ask for an accommodation or an alternative application process.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div><div></div>"
    },
    {
        "position": "Amway Software Developer CRM Internship",
        "company": "Amway Inc. - 4.1",
        "location": {
            "city": "Ada",
            "state": "MI"
        },
        "posted": "15 hours ago",
        "lastScraped": "2020-12-06T06:36:39.706Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><b>About Our Internship Program:</b><br>\nHere at Amway, our interns develop through real world experience and are assigned meaningful projects that challenge and allow for personal growth. All Interns receive project support and on-going performance feedback from a person advisor and hiring manager. Amway hosts over 80+ interns each summer and offers programming events designed to assist navigating Amway culture, making the most of a summer internship, and building a successful career. The program provides exposure to a breadth of career fields and offers unique opportunities to learn business acumen, work cross-functionally and showcase their skillsets directly to hiring managers and executives.\n<br><br>\n<b>Internship Eligibility:</b><br>\nThis job posting is for our summer 2021 Internship Program (May – August); qualified candidates must have a minimum GPA of 3.0 and one semester or more left of school to complete at the beginning of their internship. Candidates who have graduated are not eligible to intern.\n<br><br>\n** Please note, these positions are not eligible for Sponsorship.\n<br><br>\n<b>Internship Job Title:</b> IT – Software Developer (CRM)\n<br><br>\n<b>What is special about this team:</b> The Marketing Automation team is a software product team within the Amway IT organization which is responsible for transforming Amway’s capabilities for Customer Relationship Management (CRM). We work closely with the Marketing and Digital teams at Amway to deliver platforms and solutions which help us engage with our ABOs and customers with relevant, personalized messaging. The team works on cutting-edge cloud technologies with many opportunities to learn new skills and solve exciting problems.\n<br><br>\nHow would an intern contribute to the team’s success? Candidates will get involved in the full-stack deployment of a new technology platform at Amway to expand our Marketing Automation capabilities. The team will be responsible to develop, deploy and support all aspects of the platform, which will be built on a modern cloud architecture. The initiative will follow an Agile/Scrum delivery model and will own the full lifecycle of the solution set following DevOps practices. Candidates will be given the tools and training required for the role, along with coaching and mentorship opportunities.\n<br><br>\n<b>An example of a typical project is:</b> Candidates will directly support the development and deployment of the Marketing Automation platform. You will apply your expertise to building the core platform along with the supporting technology components - event streams, REST APIs, messaging channel connectors, analytical data, log streams and more. You will have opportunity to work independently as well as in a team context to deliver features and functionality for our Marketing team.\n<br><br>\nWhat skills and background will be important to be successful in this internship:\n<br><br>\n<b>Desired Skills:</b> Experience or coursework involving programming/software development – JavaScript, TypeScript, Java or Python preferred. Experience with cloud platforms such as Amazon Web Services (AWS), Azure, or Google Cloud Platform. Familiarity with software integration patterns, DevOps tools and practices, or CRM software products is beneficial. A positive outlook, growth mindset, and desire to deliver solutions which will benefit Amway’s distributors and customers.\n<br><br>\n<b>Desired Degree:</b> Pursuing Bachelor’s Degree in Computer Science, Information Systems or equivalent\n<br><br>\n<b>Location of Internship:</b> Ada, Michigan</div><div></div>"
    },
    {
        "position": "Jr. Web Analyst Intern",
        "company": "Experian - 3.8",
        "location": {
            "city": "Costa",
            "state": "Mesa"
        },
        "posted": "23 hours ago",
        "lastScraped": "2020-12-06T06:36:39.981Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Our internship program is an excellent way for you to gain experience, work with amazing people and complement your studies as you set the course for your future. The program lasts for 6 months beginning January and ending in June/July. The Engineering team under Shared Marketing and Innovation is a fast-paced and flexible team. The team culture isn’t just about one kind of person. So many individuals make up who we are, making us that much more unique. It’s what sets us apart, the dynamic, diverse and collaborative environment.\n<br><br>\nAbout us, but we’ll be brief\n<br><br>\nExperian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that FORTUNE has named Experian one of the 100 Best Companies to work for. In addition, for the last five years we’ve been named in the 100 “World’s Most Innovative Companies” by Forbes Magazine.\n<br><br>\nWhat you’ll be doing\n<br><br>\nThe Engineering team is seeking a motivated software-oriented intern who is ready to apply their love of software development to the release and communication management. We are looking for a motivated individual who can learn the craft of release management, which is a transferable skill to many professions. We are a mighty team embedded within the Marketing, Creative and Infrastructure teams. You will enjoy learning about the process of software development end to end.\n<br><br>\nWe will pair you with seasoned managers, marketing owners and engineers who are practitioners of the Scaled Agile Framework and who work closely with software developers. You will support the program and release management duties of multiple development areas. You will have a chance to see the execution of releases into market, and get experience planning for the next release. You will work with many roles across the development lifecycle (such as product owner, software engineer, tester, scrum master)\n<br><br>\nWhat your background looks like\n<br><br>\nMust be enrolled in a BS/MS degree program in Business Administration, Economics, Marketing, Computer Science or related field\n<br>Minimum 3.0 GPA\n<br>Experience with Microsoft Office Suite Excellent critical thinking and problem-solving skills\n<br>Good written and verbal communication skills\n<br>Positive attitude and willingness to learn\n<br>Detail-oriented with strong organizational skills\n<br><br>\nPerks\n<br><br>\nDuring this pandemic, all Experian employees are working remotely. Once it’s safe to do so, we’ll slowly return to our offices however we are in no rush to do this. The safety of our employees is of utmost importance\n<br>Flexible work schedule and relaxed dress code\n<br><br>\nEOE including Disability/Veteran</div><div></div>"
    },
    {
        "position": "Research Intern - FPGA Acceleration",
        "company": "Microsoft - 4.2",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "19 hours ago",
        "lastScraped": "2020-12-06T06:36:40.256Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Virtual Internship\n<br><br>\nParticipation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship\n<br><br>\nResearch Internships at Microsoft provide a dynamic environment for research careers with a network of world-class research labs led by globally-recognized scientists and engineers. Our researchers and engineers pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.\n<br><br>\nThis is your chance to contribute to the tools and technologies unpinning Azure's accelerated computing platform. Our team's innovative solutions are used to build and optimize the hardware accelerators that power some of Microsoft’s most important and strategic projects in the cloud. Our work spans the stack from silicon to solutions, and across domains including deep learning, storage, and networking. Our team's building blocks are used by a fast-growing number of Microsoft engineering groups and customers to make large intelligent systems feasible, efficient, performant, and cost-effective. This is your chance to work on the future of computing.\n<br><br>\nResponsibilities\n<br><br>\nInterns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, interns learn, collaborate, and network for life. Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12-week internship, students are paired with mentors and expected to collaborate with other interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year-round, though they typically begin in the summer\n<br><br>\nAdditional Responsibilities\n<br>Develop prototype FPGA accelerators to demonstrate the feasibility of hardware acceleration of cloud workloads\n<br>Implement improvements to internal tools used in the development of hardware accelerators\n<br><br>\nQualifications\n<br><br>\nIn addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.\n<br><br>\nRequired Qualifications\n<br>Must have 2 years of experience with FPGA and/or ASIC development\n<br>Must have 2 years experience with C/C++ programming\n<br>Must be currently enrolled in a PhD program in Computer Science or a related STEM field.\n<br><br>\nParticipation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship\n<br><br>\nPreferred Qualifications\n<br>Substantial time spent developing a compiler\n<br>Prior experience implementing FPGA accelerators\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</div><div></div>"
    },
    {
        "position": "App Development Internship",
        "company": "Final Drill -",
        "location": {
            "city": "Los",
            "state": "Angeles"
        },
        "posted": "22 hours ago",
        "lastScraped": "2020-12-06T06:36:40.558Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><b>Company Overview</b></p><p>Final Drill is an all-in-one coaching platform built to create a safe, easy, and reliable online community where coaches can use several tools to continue to build upon and grow their coaching services. Athletes of all ages can join the community to connect with experienced coaches in their area who can help improve their athletic performance and skills.</p><p>We are a new startup and we're currently looking for a Web Development Intern to join our team. We are looking for an outstanding Web Developer to be responsible for the coding, innovative design and layout of our website. Web developer responsibilities include building our website from concept all the way to completion from the bottom up, fashioning everything from the home page to site layout and function.</p><p>This is a fully remote-based part-time position with the flexibility to work from wherever you'd like as long as you have internet and phone access. We are happy to work around your schedule whether it's for school, another job, or personal reasons (we believe in work-life balance), but are looking for someone you can commit 10 - 20 hours a week in this role. This is an unpaid internship.</p><p>At Final Drill we believe in self-development and continuous learning.</p><p><b>Responsibilities</b></p><ul><li>Write well designed, testable, efficient code by using best software development practices</li><li>Create website layout/user interface by using standard HTML/CSS practices</li><li>Integrate data from various back-end services and databases</li><li>Gather and refine specifications and requirements based on technical needs</li><li>Create and maintain software documentation</li><li>Be responsible for maintaining, expanding, and scaling our site</li><li>Stay plugged into emerging technologies/industry trends and apply them into operations and activities</li><li>Cooperate with Marketing team to match visual design intent</li></ul><p><b>Skills</b></p><ul><li>Proven working experience in web programming and mobile app development</li><li>Top-notch programming skills and in-depth knowledge of modern HTML/CSS</li><li>Familiarity with at least one of the following programming languages: React, PHP, ASP.NET, Javascript or Ruby on Rails</li><li>A solid understanding of how web applications work including security, session management, and best development practices</li><li>Adequate knowledge of relational database systems, Object Oriented Programming and web application development</li><li>Hands-on experience with network diagnostics, network analytics tools</li><li>Basic knowledge of Search Engine Optimization process</li><li>Aggressive problem diagnosis and creative problem solving skills</li><li>Strong organizational skills to juggle multiple tasks within the constraints of timelines and budgets with business acumen</li><li>Ability to work and thrive in a fast-paced environment, learn rapidly and master diverse web technologies and techniques.</li><li>BS in computer science or a related field preferred</li></ul><p>Job Type: Internship</p><p>Pay: $0.00 per hour</p><p>Benefits:</p><ul><li>Flexible schedule</li></ul><p>Schedule:</p><ul><li>Monday to Friday</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul></div><div></div>"
    },
    {
        "position": "Research Intern - Urban Innovation",
        "company": "Microsoft - 4.2",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "23 hours ago",
        "lastScraped": "2020-12-06T06:36:40.824Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Virtual Internship\n<br><br>\nParticipation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship.\n<br><br>\nResearch Internships at Microsoft provide a dynamic environment for research careers with a network of world-class research labs led by globally-recognized scientists and engineers. Our researchers and engineers pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.\n<br><br>\nThe Urban Innovation group at Microsoft Research pursues state of the art science and technology development for urbanization. Lines of research focus on climate change and mitigating the environmental impact of our increasingly urban world, ensuring equitable economic growth, social and environmental justice, and building strong, healthy communities.\n<br><br>\nWith more than 2 billion additional urban residents projected by 2050, humanity is rapidly becoming increasingly densely populated. Simultaneously, through the internet, mobile devices, and sensors and wearables, data and technology play an increasingly important and complex role in nearly every aspect of modern urban life, influencing communication, privacy and information exposure, mobility and transportation, environmental impact, economic equality and opportunity, and even the food we eat.\n<br><br>\nWith backgrounds in computer science, social sciences, engineering, biology, chemistry, and design, researchers on the Urban Innovation team thus bring a multidisciplinary approach to leverage these trends to understand sociotechnical systems in urban environments and help build the future of technology in the service of society.\n<br><br>\nThe Urban Innovation team seeks Research Interns in computer science, engineering, design, and social, health, and environmental science to help advance this agenda.\n<br><br>\nResponsibilities\n<br><br>\nInterns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, interns learn, collaborate, and network for life. Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12-week internship, students are paired with mentors and expected to collaborate with other interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year-round, though they typically begin in the summer.\n<br><br>\nInterns will collaborate with one or more mentors on a full life cycle research project, from project selection to research publication. Thus, interns will be responsible for participating in background research, some combination of project development, deployment, and/or analysis, and paper writing.\n<br><br>\nQualifications\n<br><br>\nIn addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.\n<br><br>\nRequired Qualifications\n<br>Must be currently enrolled in a PhD program in Computer Science or a related STEM field, a quantitative social science field (including urban planning), or a quantitative public health field such as epidemiology or biostatistics.\n<br>Participation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship\n<br>Preferred Qualifications\n<br>Demonstrated ability to develop original research agendas.\n<br>Must be able to collaborate effectively with other researchers.\n<br>Excellent interpersonal skills, cross-group, and cross-culture collaboration.\n<br>Ability to think unconventionally to derive creative and innovative solutions.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</div><div></div>"
    },
    {
        "position": "Research Intern - Privacy and Cryptography",
        "company": "Microsoft - 4.2",
        "location": {
            "city": "Redmond",
            "state": "WA"
        },
        "posted": "23 hours ago",
        "lastScraped": "2020-12-06T06:36:41.125Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Virtual Internship\n<br><br>\nParticipation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship.\n<br><br>\nResearch Internships at Microsoft provide a dynamic environment for research careers with a network of world-class research labs led by globally-recognized scientists and engineers. Our researchers and engineers pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.\n<br><br>\nThe Cryptography and Privacy Research Group at Microsoft Research seeks graduate students in applied cryptography and privacy for spring and summer internships. Topics of particular interest to us include (but are not limited to) secure computing (FHE, MPC, TEE), ML privacy, end-to-end encryption, web privacy and security, post-quantum cryptography, and zero-knowledge proof. We offer internship projects ranging from protocol design and security analysis to crypto and privacy engineering, so we encourage PhD students with any relevant experience to apply.\n<br><br>\nResponsibilities\n<br><br>\nInterns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, interns learn, collaborate, and network for life. Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12-week internship, students are paired with mentors and expected to collaborate with other interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year-round, though they typically begin in the summer.\n<br><br>\nQualifications\n<br><br>\nIn addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.\n<br><br>\nRequired Qualifications\n<br>Must be currently enrolled in a PhD program in mathematics, computer science, electrical engineering, or a related STEM field.\n<br><br>\nParticipation in the Research Internship Program requires that you are physically located in the United States or Canada for the duration of the internship\n<br><br>\nPreferred Qualifications\n<br>Demonstrated ability to engage in research.\n<br>Must be able to collaborate effectively with other researchers and product development teams.\n<br>Strong interpersonal skills, cross-group, and cross-cultural collaboration.\n<br>Ability to think unconventionally to derive creative and innovative solutions.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</div><div></div>"
    },
    {
        "position": "Software Development Intern",
        "company": "Hewlett Packard Enterprise - 3.8",
        "location": {
            "city": "Fort",
            "state": "Collins"
        },
        "posted": "1 day ago",
        "lastScraped": "2020-12-06T06:36:41.433Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">At Hewlett Packard Enterprise (HPE), we don't just believe in the power of technology, we believe in the power of people when technology works for them. We believe in applying new thinking and ideas to improve the way our customers live and work.\n<br><br>\nLearning does not only happen through training. Relationships are among the most powerful ways for people to learn and grow, and this is part of our HPE culture. In addition to working alongside talented colleagues, you will have many opportunities to learn through coaching and stretch assignment opportunities. You’ll be guided by feedback and support to accelerate your learning and maximize your knowledge. We also have a “reverse mentoring” program which allows us to share our knowledge and strengths across our multi-generation workforce.\n<br><br>\nHewlett Packard Enterprise's systems and software engineers develop solutions using the latest technologies to Make IT Simple for our customer base. HPE is more than an hardware company, we are a leading software development organization with a myriad of products ranging from an enterprise website getting millions of page views a week to a predictive analytics solution which can warn a customer of an issue before it happens. We're currently looking for hands-on, technically curious university students that want to grow their abilities as software engineers in a large-scale, worldwide development team.\n<br><br>\n<b>Responsibilities:</b><br>\nYou will be based in HPEs Fort Collins, CO site and will work on a specific project within an existing Agile, software engineering project team to solve problems within that team's focus.\n<br><br>\nYou will need to be customer focused and will be given the time and assistance to learn in-depth about our software development practices and the latest tools used for software development and front-end technology. At least one senior developer will mentor you on your way but you will be welcomed within the entire team. Our Scaled Agile Framework (SAFe) based teams include Scrum and Kanban methodologies depending on the team so at least a basic understanding of this environment is encouraged.\n<br><br>\nAs a system/software engineer, you will work on a specific project critical to HPEs needs with opportunities to gain experience across a broad range of cutting edge technologies. You will need to be enthusiastic and versatile to take on new problems across the full stack of of software engineering challenges. You will need to communicate effectively and be motivated to achieve results as part of your Agile team.\n<br><br>\n<b>Relevant Skills:</b><br>\n<b>Programming Languages:</b> Java, Java Script, Python\n<br><br>\n<b>Infrastructure/Operating Systems/Virtualization:</b> Windows, Linux, Docker, Swarm, Spring, Spring Boot, Kafka, Ansible\n<br><br>\n<b>Development Tools:</b> GitHub, Jenkins, Selenium, FitNesse, JUnit, JUnit Params, Eclipse\n<br><br>\n<b>Education/Requirements:</b><br>\nComputer Science, Information Technology, or Management Information Systems major\n<br><br>\nStrong verbal and written communication\n<br><br>\nExcellent analytical and problem-solving skills\n<br><br>\nAbility to work well in teams\n<br><br>\nStrong work ethic and attention to detail\n<br><br>\n<b>Hewlett Packard Enterprise Values:</b><br>\n<b>Partnership first:</b> We believe in the power of collaboration - building long term relationships with our customers, our partners and each other\n<br><br>\n<b>Bias for action:</b> We never sit still - we take advantage of every opportunity\n<br><br>\n<b>Innovators at heart:</b> We are driven to innovate - creating both practical and breakthrough advancements\n<br><br>\nHPE is an EOE / Female / Minority / Individual with Disabilities / Protected Veteran Status\n<br><br>\nWhat do we offer?\n<br><br>\nExtensive social benefits, flexible working hours, a competitive salary and shared values, make Hewlett Packard Enterprise one of the world´s most attractive employers. At HPE our goal is to provide equal opportunities, work-life balance, and constantly evolving career opportunities.\n<br><br>\nIf you are looking for challenges in a pleasant and international work environment, then we definitely want to hear from you. Apply now below, or directly via our Careers Portal at www.hpe.com/careers\n<br><br>\n<b>You can also find us on:</b><br>\nhttps://www.facebook.com/HPECareers\n<br><br>\nhttps://twitter.com/HPE_Careers\n<br><br>\n1073912</div><div></div>"
    },
    {
        "position": "Computer/Mechatronics Engineering Internship (Spring 2021)",
        "company": "Ommo Technologies Inc. -",
        "location": {
            "city": "Carrollton",
            "state": "TX"
        },
        "posted": "1 day ago",
        "lastScraped": "2020-12-06T06:36:41.705Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p>Responsibilities</p><ul><li>Operate test equipment, setup tests, and manage data collection for various test fixtures.</li></ul><ul><li>Organize and analyze data using existing analysis pipeline</li></ul><ul><li>Write new analysis tools and maintain and update existing analysis and test software</li></ul><ul><li>Develop new tests &amp; processes to help solve complex hardware/ software problems, with many unknowns.</li></ul><ul><li>Write technical documentation for internal R&amp;D development &amp; tests, and customer facing product or software specifications</li></ul><ul><li>Assemble PCB prototypes with SMT components and make custom cables</li></ul><ul><li>Opportunities for PCB &amp; Mechanical design of prototypes, test hardware, etc.</li></ul><ul><li>Opportunity to learn how to operate a CNC Mill &amp; assist in the fabrication of parts</li></ul><p>Qualifications</p><ul><li>Quick learner with a willingness to ask questions and take on new challenges</li></ul><ul><li>Pursuing or have obtained a BS in Computer, Computer Science, Mechatronics, or Electrical Engineering.</li></ul><ul><li>Other disciplines may be considered if a candidate has relevant experience outside of coursework</li></ul><ul><li>Proficiency in Python and object oriented programming, including familiarity with data analysis tools and best practices.</li></ul><ul><li>Working understanding of embedded systems and circuits</li></ul><ul><li>Hands-on electrical and/or mechanical prototyping experience</li></ul><ul><li>Strong written and verbal communication skills</li></ul><p>Nice To Haves</p><ul><li>PCB design and assembly experience</li></ul><ul><li>CAD and rapid prototyping experience</li></ul><ul><li>C/C++ experience/ proficiency, relating to application &amp; embedded software development.</li></ul><p>Job Type</p><ul><li>Full-Time</li></ul><ul><li>4-7 Months</li></ul><ul><li>Starting January 2021</li></ul><p>Job Type: Internship</p><p>Pay: $20.00 per hour</p><p>Schedule:</p><ul><li>8 hour shift</li></ul><p>COVID-19 considerations:<br>Our team is looking for an individual local to Dallas, Texas. You may work remotely if able, but will have to go into the office for certain projects/tasks. Our team is required to wear masks and has a COVID policy. Your health matters to us!</p><p>Work Remotely:</p><ul><li>No</li></ul></div><div></div>"
    }
]