[
    {
        "position": "QA Intern",
        "company": "Allscripts - 3.6",
        "location": {
            "city": "Illinois",
            "state": "Illinois"
        },
        "posted": "2021-01-22T06:22:43.281Z",
        "url": "https://www.simplyhired.com/job/KLhrIWth03hv5ehtk_l6WK4uARd7u-4ZdL-pk2xnVO33PPJX3Z1eeg?q=computer+science",
        "lastScraped": "2021-01-22T06:22:43.281Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\">Welcome to Allscripts! Our Mission is to be the most trusted provider of innovative solutions that empower all stakeholders across the healthcare continuum to deliver world-class outcomes. Our Vision is a Connected Community of Health that spans continents and borders. With the largest community of clients in healthcare, Allscripts is able to deliver an integrated platform of clinical, financial, connectivity and information solutions to facilitate enhanced collaboration and exchange of critical patient information.\n<br><br>\nThe University Relations team is looking for a QA Intern to join our FollowMyHealth team for a 12-week internship this summer 2021.\n<br><br>\n<b>Responsibilities:</b><br>\nWriting and executing manual test scripts\n<br>Learning FollowMyHealth product &amp; workflows\n<br>Writing and executing automated test scripts\n<br>Turn manual test cases into automated test scripts\n<br>Participate in team sprint planning &amp; grooming sessions\n<br><br>\n<b>Qualifications:</b><br>\n<b>Academic and Professional Qualifications:</b><br>\nCurrently enrolled in a bachelor's degree program in Computer Science, Management Information Systems or related discipline\n<br>3.0+ GPA preferred\n<br><br>\n<b>Experience:</b><br>\nWeb-based or mobile development experience\n<br>Analytical problem solving\n<br>Attention to detail\n<br>Taking Initiative with minimal supervision\n<br>Self-starter that is team oriented\n<br><br>\n<b>Travel Requirements:</b><br>\nNone\n<br><br>\n<b>Working Arrangements:</b><br>\nThis is a remote summer internship.\n<br><br>\nAt Allscripts, our greatest strength comes from bringing together talented people with diverse perspectives to support the technology needs of 180,000 physicians, 1,500 hospitals and 10,000 postacute organizations across the globe. Allscripts offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.\n<br><br>\nAllscripts' policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for North American based positions with Allscripts must be legally authorized to work in the United States or Canada. Verification of employment eligibility will be required as a condition of hire.\n<br><br>\nFrom a \"VEVRAA Federal Contractor\" We request Priority Referral of Protected Veterans\n<br><br>\nThis is an official Allscripts Job posting. To avoid identity theft, please only consider applying to jobs posted on our official corporate site.\n<br><br>\nVisa Sponsorship is not offered for this position\n<br><br>\nThank you for reviewing this Allscripts opportunity! Does this look like a great match for your skill set? If so, scroll on down and tell us more about yourself!</div><div></div>"
    },
    {
        "position": "Website Intern",
        "company": "Edge Sports -",
        "location": {
            "city": "United States",
            "state": "States"
        },
        "posted": "2021-01-21T06:22:43.533Z",
        "url": "https://www.simplyhired.com/job/s8fYDIVIPklYIaCu8arybrPq7-vUnyRjy530NtG33TwqrjyfNI8eaQ?q=computer+science",
        "lastScraped": "2021-01-22T06:22:43.533Z",
        "description": "<div class=\"h3\">Full Job Description</div><div class=\"p\"><p><i><b>A golden opportunity for you to grow your resume and experience with the Edge Sports podcast!</b></i></p><p><b>Description: </b></p><p>This position is for a website internship for either college credit or small monthly compensation during the spring semester. Overall, this internship is most beneficial as an opportunity to get experience in website development and maintenance.</p><p>The Website Internship offers practical work experience and an introduction to creating and improving web-based systems. This internship will involve challenging opportunities, real-world projects, and regular interaction with staff. It’s a fantastic opportunity to gain hands-on experience in the web and app development field.</p><p>The Edge Sports podcast is a brand new sports talk show coming to all podcast listening platforms this January 2021.</p><p>We are looking to hire an intern to grow and improve our website along with maintenance and updates when requested.</p><p>Only one candidate will be selected for the position and will be contacted within a day of applying.</p><p>The position runs from the end of January to the end of April.</p><p>Hiring Manager: Podcast host, Nate Brodsky</p><p><b>Job Responsibilities: </b></p><ul><li>Manage the website of the Edge Sports podcast through maintenance, recommendations for improvement, and updates</li><li>Design, recommend and pitch improvements to new and existing features</li></ul><ul><li>Weekly meetings planning any upcoming or expected updates and changes to the information listed</li><li>Incorporate podcast social media platforms into the website</li><li>Assist in troubleshooting issues on web-based systems</li><li>Update and edit website content, posts, and pages</li></ul><ul><li>Research data and analytics on existing NFL, College Football, NBA, and College Basketball teams and players to use for website updates</li><li>Reports directly to the host of the podcast</li></ul><p><b>Skills: </b></p><ul><li>Experience using Wix Websites is required</li><li>Some experience with HTML, CSS, PHP, and/or Javascript is beneficial</li><li>Proficient in Google Spreadsheets and other Google applications</li><li>Creative and innovative thinking</li><li>Organized and detail-oriented</li><li>Enthusiastic, passionate, and high-energy</li><li>Excellent time-management skills, punctual, good work ethic</li></ul><p><b>Education: </b></p><ul><li>Must be a student currently attending an accredited university</li><li>Must be pursuing a major/degree in computer science, IT, sports programming, and anything business or IT-related</li></ul><p>Job Types: Part-time, Internship</p><p>Pay: $20.00 - $50.00 per month</p><p>Schedule:</p><ul><li>On call</li></ul><p>Supplemental Pay:</p><ul><li>Bonus pay</li></ul><p>Work Location:</p><ul><li>Fully Remote</li></ul><p>Hours per week:</p><ul><li>10-19</li></ul><p>Internship Compensation:</p><ul><li>Pay</li><li>College Credit</li></ul><p>This Company Describes Its Culture as:</p><ul><li>Detail-oriented -- quality and precision-focused</li><li>Innovative -- innovative and risk-taking</li><li>Outcome-oriented -- results-focused with strong performance culture</li><li>Team-oriented -- cooperative and collaborative</li></ul><p>Company's website:</p><ul><li>https://www.edgesportsshow.com/</li></ul><p>Company's Facebook page:</p><ul><li>https://www.facebook.com/edgesportspod</li></ul><p>COVID-19 Precaution(s):</p><ul><li>Remote interview process</li><li>Virtual meetings</li></ul></div><div></div>"
    },
    {
        "position": "Error",
        "company": "Error",
        "location": {
            "city": "Error",
            "state": "Error"
        },
        "posted": "2021-01-22T06:22:43.996Z",
        "url": "https://www.simplyhired.com/job/Qn_3rpzGwxnnXzyP6XKf8XQoXX-89_wouh2-O7PQk96JcrSJfnZTyQ?q=computer+science",
        "lastScraped": "2021-01-22T06:22:43.996Z",
        "description": "Error"
    }
]