[
    {
        "position": "Case Camp 2.0",
        "company": "Rheinmetall",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-10-08T17:00:48.567Z",
        "url": "https://stackoverflow.com/jobs/553599/case-camp-20-rheinmetall?a=2ZEUMXSuX8bK&so=i&pg=1&offset=0&total=1&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "c#",
            "c++",
            "blockchain"
        ],
        "lastScraped": "2021-10-18T17:00:48.567Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Sie interessieren sich für Blockchain-Technologien und sind neugierig, wie Rheinmetall mögliche Anwendungsgebiete in diesem Bereich identifiziert?</p>\n<p>Dann laden wir Sie herzlich zu unserer zweiten Runde des virtuellen Case Camps 2.0 ein!</p>\n<p>Durch bekannte virtuellen Währungen wie Bitcoin konnten Blockchain-Technologien, mit ihren verteilten Datenbanken und Konsenssystemen, bereits Erfolge zeigen. Dieser Erfolg inspirierte u.a. viele Softwarefirmen, die Technologie auch auf andere Anwendungen einzusetzen, bei denen ein zentralisiertes System nicht erwünscht und Sicherheit zwingend erforderlich ist. Insbesondere Hacker oder feindliche Kräfte versuchen bspw. die Kommunikation abzuhören, zu verändern oder zu blockieren. Blockchains könnten mit ihren fälschungssicheren und verteilten Datenstrukturen eine vielversprechende Technologie in diesem Umfeld darstellen.</p>\n<p>Durch Ihre Teilnahme am Case Camp 2.0 haben Sie die Möglichkeit neue Erkenntnisse zu dem übergeordneten Thema der Blockchain-Technologie zu erlangen und bereits vorhandenes Know-how praxisorientiert anzuwenden. Dabei haben Sie die Wahl zwischen vier Themengebieten, wobei der von Ihnen gewählte Schwerpunkt in einem kleinen Team erarbeitet wird.</p>\n<ul>\n<li>Einsetzbarkeit der Blockchain-Technologie für sicherheitskritische Systeme</li>\n<li>Verbesserte Verantwortung für militärische Operationen mit Blockchain-Methoden</li>\n<li>Sichere und verlässliche Informations- und Ereignisverteilung in Netzwerken mit geringer Datendurchsatzrate mittels Blockchain-Ansätzen</li>\n<li>Anwendbarkeit der Blockchain-Technologie auf die nationale Sicherheit</li>\n</ul>\n\n<ul>\n<li>Darüber hinaus sollten Sie ausreichend Zeit mitbringen, da das Case Camp 2.0 vom <strong>18.10.2021 </strong>bis zum <strong>22.10.2021</strong>, täglich von 09:00 bis ca. 17:00 Uhr, stattfinden wird. Die meiste Zeit werden Sie in Absprache mit Ihrer Gruppe einteilen können, sodass Sie auch Ihren studentischen Verpflichtungen nachkommen können. Folgende Tage sollten Sie sich dennoch ganztags freihalten, da diese zur Bearbeitung des Themas essenziell sind: Montag, 18.10.2021 (09:00 bis ca. 17:00 Uhr) sowie Freitag, 22.10.2021 (09:00 bis ca. 16:00 Uhr)</li>\n<li>Weiterhin freuen wir uns, wenn Sie gute bis sehr gute Englischkenntnisse vorweisen können</li>\n<li>Idealerweise verfügen Sie bereits über Kenntnisse in der Softwareentwicklung (Java, C++, C# o.ä.)</li>\n</ul>            </div>"
    }
]
