[
    {
        "position": "Technical Internship: Siri Development Engineer in Test",
        "company": "Apple",
        "location": {
            "city": "Yokohama",
            "state": "Japan"
        },
        "posted": "2021-09-15T17:24:55.678Z",
        "url": "https://stackoverflow.com/jobs/544971/technical-internship-siri-development-engineer-apple?a=2WLw5Jfua4x2&so=i&pg=1&offset=0&total=3&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "automation",
            "objective-c",
            "ios"
        ],
        "lastScraped": "2021-09-20T17:24:55.678Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nWould you like to play a part in the next revolution in human-computer interaction? Contribute to a product that is redefining mobile and desktop computing, create groundbreaking technology to support large scale systems, spoken language, big data, and artificial intelligence and work with the people who built the intelligent assistant that helps millions of people get things done - just by asking. \nJoin the Siri team at Apple as the Siri Development Engineer in Test, Intern. You will design and build tools for automation in support of qualifying Siri features. This is a fast-paced role with high visibility, impact and helping to build the most advanced systems in the industry.<br><br><span>This position requires someone with the passion for Quality Engineering in support of delivering high quality products to Apple Customers, as well as, being a great partner with Product Engineering teams in establishing solid Automation and test frameworks. We also need a strong candidate that can work cross-functionally to understand the challenges and to design, review proposals and build solutions. You will gain a wealth of experience in the Machine Learning System Evaluation Engineering (ML SEE) team in being exposed to all teams, tools, and technologies. You should join the Apple Siri ML SEE team if you want to help deliver the next amazing Apple product and learn within a great team environment.</span>            </div>"
    },
    {
        "position": "Technical Internship: Machine Learning/AI Engineering & Research Internship",
        "company": "Apple",
        "location": {
            "city": "Tokyo",
            "state": "Japan"
        },
        "posted": "2021-09-16T17:24:56.344Z",
        "url": "https://stackoverflow.com/jobs/550222/technical-internship-machine-learning-ai-apple?a=2YwHsI21zmow&so=i&pg=1&offset=1&total=3&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "python",
            "machine-learning"
        ],
        "lastScraped": "2021-09-20T17:24:56.344Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nImagine what you could do here? At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Every role at Apple is crafted around our intention to leave the world a better place than we found it! \nApple is seeking highly qualified people for the position of AI/ML Engineer and AI/ML Researcher on the Global Product Experience team. The team pursues advancement of the end-to-end experience of Siri Japanese users through improving machine learning (ML) in areas of deep learning (DL) and Natural Language Processing (NLP). As a member of the team, you will work on some of the most ambitious technical problems, develop new and/or extend existing ML solutions that will impact future Apple products, and collaborate with the best product teams to integrate your ideas into products.<br><br><span>You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>            </div>"
    },
    {
        "position": "Head of Internal Audit (w/m/d) Siemens Bank",
        "company": "Siemens AG",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-09-19T17:24:58.721Z",
        "url": "https://stackoverflow.com/jobs/546724/head-of-internal-audit-w-m-d-siemens-bank-siemens-ag?a=2XlXZcf6ii1a&so=i&pg=1&offset=2&total=3&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-09-20T17:24:58.721Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>Wir finanzieren die Zukunft.</strong></p><p><br></p><p>Wir sind mehr als nur ein Finanzdienstleister, denn wir verwirklichen, worauf es ankommt. Ganz gleich, ob es um erneuerbare Energien, die Digitalisierung in der industriellen Fertigung, intelligente Infrastrukturen, Mobilitätslösungen oder Gesundheitssysteme geht - Finanzierung ist wichtiger denn je. Durch die Kombination aus Finanzexpertise und fundiertem Branchen-Know-how gelingt es uns jeden Tag aufs Neue, innovative Finanzierungslösungen zu verwirklichen. Möchten auch Sie die Zukunft mit uns gestalten? Brennen Sie dafür, Bewährtes auf den Kopf zu stellen, um die Welt von morgen zu verändern? Dann zögern Sie nicht länger und schlagen mit unserem Expertenteam neue Wege ein.</p><p><br></p><p><strong>Verändern Sie mit uns die Welt von morgen.</strong></p><p></p><ul><li>Sie sind für den Aufbau und die Weiterentwicklung der Internal Audit Funktion eines CRR-Kreditinstituts zuständig, unter Berücksichtigung aller regulatorischen Vorgaben sowie der Einhaltung von internen Auditstandards. </li><li>Sie stellen einen mehrjährigen Prüfungsplan für die Siemens Bank auf und nehmen die Revisionsfunktion im Rahmen von Bankprozessen und Committee-Strukturen wahr (z.B. Einbindung in NPA Prozess, Outsourcing Committee, Compliance Committee).</li><li>Des Weiteren nehmen Sie die Funktion der Internen Revision in wesentlichen Projekten wahr und stimmen sich mit externen Prüfern (Abschlussprüfern, Aufsicht) sowie mit weiteren Kontrollfunktionen der Siemens Bank ab. </li><li>Sie verantworten die Koordination und Durchführung operativer (on-site) Prüfungen an den Standorten in München, London und Singapur zu Fach- und IT-Themen. </li><li>Sie sind eng in die Konzernrevision CF A eingebunden und koordinieren die Einbeziehung von Mitarbeitern aus den verschiedenen CF A-Einheiten im Rahmen von Prüfungen.</li><li>Sie steuern die Nachverfolgung der Mängelbeseitigung.</li><li>Die Berichterstattung an Geschäftsführung und Aufsichtsrat der Siemens Bank zu Prüfungsplanung, Prüfungsergebnissen und Stand der Mängelbeseitigung ist ein weiterer Aufgabenschwerpunkt. </li><li>Zudem führen Sie die interne Audit-Funktion der Siemens Bank mit einem weiteren Mitarbeitenden sowie Prüfungsteams von i.d.R. etwa 10 Prüfern.</li></ul><p><strong>Ihr Profil für \"Zukunft möglich machen\".</strong></p><p></p><ul><li>Sie haben ein Hochschulstudium erfolgreich absolviert</li><li>Sie besitzen langjährige einschlägige Berufserfahrung (mindestens zehn Jahre) im internen Audit, Risikomanagement oder Risikocontrolling eines international tätigen Einlagenkreditinstituts oder einer externen Wirtschaftsprüfung (mit spezifischer Erfahrung in der operativen Prüfung von regulierten Finanzinstituten)</li><li>Des Weiteren können Sie mehrjährige Projekterfahrung inklusive der Leitung von Projekten nachweisen</li><li>Sie konnten Ihre Kompetenzen als Führungskraft bereits erfolgreich unter Beweis stellen </li><li>Ein mehrmonatiger Aufenthalt im Ausland ist von Vorteil</li><li>Ihre Expertenkenntnisse umfassen die Bereiche Audit Practices, Internes Kontrollsystem sowie Regulatorik (KWG, MaRisk, MAS)</li><li>Sie besitzen Kenntnisse von Geschäftsarten und Finanzprodukten: Kredit, Einlagen, Factoring und besitzen weitreichende Kenntnisse im Risikomanagement / Risikocontrolling</li><li>Sie können sehr gute IT-Kenntnisse nachweisen; Sie sind mit Anwendungsprogrammen und Anforderungen an die IT im Bankenumfeld vertraut. Zudem besitzen Sie grundlegende juristische Kenntnisse</li><li>Sehr gute Kenntnisse von Präsentationstechniken sowie verhandlungssichere Deutsch- und Englischkenntnisse runden Ihr Profil ab </li></ul><p><strong>Wir wollen, dass Sie wollen: Bewerben Sie sich!</strong></p><p><br><a href=\"https://new.siemens.com/de/de/unternehmen/jobs.html\" rel=\"nofollow\" target=\"_blank\"><strong>www.siemens.de/karriere</strong></a> - wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.</p><p><strong><br><a href=\"https://new.siemens.com/de/de/unternehmen/jobs/faq.html\" rel=\"nofollow\" target=\"_blank\">www.siemens.de/karriere/faq</a></strong> - wenn Sie eine Frage zum Thema Bewerbung bei Siemens haben.<br><br></p><p>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von <a href=\"https://new.siemens.com/de/de/unternehmen/jobs/arbeiten-bei-siemens/jobs-ohne-barrieren.html\" rel=\"nofollow\" target=\"_blank\">Menschen mit Behinderung</a>.</p><br><p><b>Organization:</b> Controlling and Finance</p><p><b>Company:</b> Siemens Bank GmbH</p><p><b>Experience Level:</b> Experienced Professional</p><p><b>Job Type:</b> Full-time</p>            </div>"
    }
]