[
    {
        "position": "Internal Cloud Developer",
        "company": "JPMorgan Chase Bank, N.A.",
        "location": {
            "city": "Columbus",
            "state": "OH"
        },
        "posted": "2021-07-06T08:26:56.863Z",
        "url": "https://stackoverflow.com/jobs/535180/internal-cloud-developer-jpmorgan-chase-bank-na?a=2TtVWrP83R3G&so=i&pg=1&offset=0&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "agile",
            "cloud"
        ],
        "lastScraped": "2021-07-08T08:26:56.863Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nWe're looking for members to fill out our Agile team. Your focus will be on the newer technologies (cloud, Domain Driven Design, API's, microservices) with the goal of decomposing a larger service into smaller microservices. The existing team is a truly diverse, fun mix of experience and skills who currently work extremely well together. This team solves the tough problems for breakfast!<p>We just need an experienced developer to put it all together!</p><p>Please note that we are describing our ideal candidate here. We don't expect you to know everything. Showing that you can learn something new is almost as valuable as already knowing it.</p><p>As a member of our Agile team we look first and foremost for people who are passionate around solving business and technical problems through innovation and engineering practices. Our team embraces a culture of experimentation and constantly strives for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.</p><p>Our ideal candidate possesses many of the following attributes:<br>     * BS/BA degree or equivalent experience<br>     * Minimum of 5 years of application development experience<br>     * Expertise in Java, Spring Boot, OO-design/implementation, Domain Driven Design, Data management, and relational databases<br>          + Website development is a plus but not critical<br>          + J2EE experience is welcome as we remove those components from our system<br>          + Kafka and Cassandra experience<br>     * Knowledge of industry-wide technology trends and best practices (let's use all the fun tools out there!)<br>     * Mindset of testing while coding (automated)<br>     * Passionate about building an innovative and inclusive culture<br>     * Strong communication skills - able to work with technical and non-technical stakeholders</p><p>Come be part of a genuinely fun team who can truly be independent. Come set the example for other teams in the area to follow. We have some interesting problems to solve over the next couple years. Isn't that why you really got into programming to begin with?JPMorgan Chase &amp; Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.</p><p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.</p><p>Equal Opportunity Employer/Disability/Veterans</p>            </div>"
    },
    {
        "position": "QA Intern for enterprise consumer facing sites",
        "company": "Hearst Magazines",
        "location": {
            "city": "Chicago",
            "state": "IL"
        },
        "posted": "2021-07-06T08:27:03.985Z",
        "url": "https://stackoverflow.com/jobs/526759/qa-intern-for-enterprise-consumer-facing-sites-hearst-magazines?a=2QEPMhWUhPOw&so=i&pg=1&offset=1&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:03.985Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>iCrossing a digital agency owned by Hearts Magazines Division.   Our technology team creates world-class data-driven solutions for Omni-channel digital marketing initiatives. We’re engineers, and solutions integrators experienced at all levels of the application development lifecycle with a clear focus on creating engaging, rich and dynamic customer experiences. Keeping up with the proliferation of devices, operating systems and APIs takes some serious technical talent – and our team has lots of it. No matter what their individual role, every team member has two basic responsibilities: Build technologies that power digital transformations and make the impossible, possible.</p>\n<p>As an intern working with our QA Leadership, you will have a chance to work on large consumer facing sites to ensure that our technical deliverables are of the highest quality.  You will be exposed to a variety of teams that work together to produce world class consumer facing sites. </p>\n<p><strong>What you’ll do and learn:</strong></p>\n<ul>\n<li>You will work with QA and Tech Leads to insure technical work is following the defined processes. You will see how QA functions within agile process for large scale web projects.</li>\n<li>You will participate in Test Case development according to project specifications. You will learn how to create test cases that will be used by others.</li>\n<li>You will execute the test cases and automated scripts required for the project. You will have a chance to practice scripting skills</li>\n<li>Analyze test automation execution results and provide execution summary.</li>\n<li>You will record results and communicate defects via bug tracking tools and validate defects once they are fixed.</li>\n<li>You will Provide test execution progress reports and test result reports.</li>\n<li>You will work with debugging tools as required by the project. </li>\n</ul>\n<p> <strong>Who you are</strong></p>\n<ul>\n<li> You have a knowledge and interest in web technologies, web design, internet protocols, operating systems, and relational databases</li>\n<li>You have an understanding of HTML, CSS, XML, JSON, HTTP/S), social media platforms, and mobile devices.</li>\n<li>You may have taken a course in Java and/or have basic Java development skills in Java</li>\n<li>You are detail oriented</li>\n<li>You are methodical when solving a problem</li>\n</ul>            </div>"
    },
    {
        "position": "Process Engineering Graduate Intern",
        "company": "Intel Corporation",
        "location": {
            "city": "Albuquerque",
            "state": "NM"
        },
        "posted": "2021-06-25T08:27:04.843Z",
        "url": "https://stackoverflow.com/jobs/531835/process-engineering-graduate-intern-intel-corporation?a=2SmnxTTfifJu&so=i&pg=1&offset=2&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:04.843Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<ul>\n<li>Job Description\n<p>Come intern with Intel's F11X. Responsibilities may be quite diverse of a technical nature. University experience and education requirements will vary significantly depending on the unique needs of the job. You must be actively enrolled in school and not graduated to work as a student intern. We are seeking students to work long term as a student intern part-time while attending school and full-time while on breaks from school (i.e. summer break).<br><br>The ideal candidate should exhibit the following behavioral traits:</p>\n<ul>\n<li>Excellent teamwork and leadership skills.</li>\n<li>Demonstrated problem solving and prioritization skills.</li>\n</ul>\n<p><br>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. The experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.</p>\n</li>\n<li>Qualifications\n<p><strong>Minimum Qualifications:</strong></p>\n<ul>\n<li>Must be pursuing a MS or PhD degree in Electrical Engineering, Photonics, Mechanical Engineering, Chemical Engineering, Optoelectronics, Optics, Physics, Material Science, or similar technical engineering discipline.</li>\n<li>6+ months of experience with programs such as Python, MS office, Power Bi, Statistical Analysis.</li>\n<li>6+ months of experience in semiconductor engineering manufacturing and development.</li>\n<li>6+ months of experience with design of experiment (DOE)</li>\n</ul>\n<p><br><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Knowledge of substrate manufacturing.</li>\n<li>Programming knowledge especially Python.</li>\n<li>Experience in photonics, optoelectronics, optical transceiver components, semiconductor physics and/or device physics is a plus.</li>\n<li>Experience in failure analysis techniques.</li>\n</ul>\n</li>\n</ul>            </div>"
    },
    {
        "position": "Process Engineering Graduate Intern",
        "company": "Intel Corporation",
        "location": {
            "city": "Albuquerque",
            "state": "NM"
        },
        "posted": "2021-06-25T08:27:05.608Z",
        "url": "https://stackoverflow.com/jobs/531834/process-engineering-graduate-intern-intel-corporation?a=2SmmfYmHV59m&so=i&pg=1&offset=3&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:05.608Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<ul>\n<li>\n\nJob Description\n\n\n\n\n\n<p>Come intern with Intel's F11X. Responsibilities may be quite diverse of a technical nature. University experience and education requirements will vary significantly depending on the unique needs of the job. You must be actively enrolled in school and not graduated to work as a student intern. We are seeking students to work long term as a student intern part-time while attending school and full-time while on breaks from school (i.e. summer break).<br><br>The ideal candidate should exhibit the following behavioral traits:</p>\n<ul>\n<li>Excellent teamwork and leadership skills.</li>\n<li>Demonstrated problem solving and prioritization skills.</li>\n</ul>\n<p><br>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. The experience listed below would be obtained through a combination of your school <span>work/classes/research</span> and/or relevant previous job and/or internship experiences.</p>\n\n\n\n\n</li>\n<li>\n\nQualifications\n\n\n\n\n\n<p><strong>Minimum Qualifications:</strong></p>\n<ul>\n<li>Must be pursuing a MS or PhD degree in Electrical Engineering, Photonics, Mechanical Engineering, Chemical Engineering, Optoelectronics, Optics, Physics, Material Science, or similar technical engineering discipline.</li>\n<li>6+ months of experience with programs such as Python, MS office, Power Bi, Statistical Analysis.</li>\n<li>6+ months of experience in semiconductor engineering manufacturing and development.</li>\n<li>6+ months of experience with design of experiment (DOE)</li>\n</ul>\n<p><br><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Knowledge of substrate manufacturing.</li>\n<li>Programming knowledge especially Python.</li>\n<li>Experience in photonics, optoelectronics, optical transceiver components, semiconductor physics and/or device physics is a plus.</li>\n<li>Experience in failure analysis techniques.</li>\n</ul>\n\n\n\n\n</li>\n</ul>            </div>"
    },
    {
        "position": "Software Engineer - Internal Applications",
        "company": "Jack Henry & Associates, Inc.®",
        "location": {
            "city": "Lenexa",
            "state": "KS"
        },
        "posted": "2021-06-26T08:27:07.669Z",
        "url": "https://stackoverflow.com/jobs/535037/software-engineer-internal-applications-jack-henry-associates-inc?a=2TqXALM9CrHa&so=i&pg=1&offset=4&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:07.669Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>Jack Henry and Associates is seeking an Advanced Software Engineer within our Internal Applications Development Service Team (IADS).  This team member will participate in design, architecture, implementation and testing of our software applications. This developer will need to be able to develop any slice of the application layer topology including the data layer, application layer and UI layer of applications that the team implements and maintains.  </p>\n<p>Working as part of the IADS, reporting to the Core Delivery Manager, this team is responsible for maintain and developing internal applications for Jack Henry as well as many different integrations between other supporting Jack Henry applications. </p>\n<p>A qualified candidate will have previously worked in an environment where continuous integration and the ability to deliver a working product with each sprint was a primary objective.  To be successful in this position you need to be self-motivated, have good research skills, and be flexible to keep up with rapid changes in technology. </p>\n<p>This position can be based to work out of the Jack Henry offices in Springfield, MO, Monett, MO, or Lenexa, KS, or remote. Remote candidates must be based within 200 miles of one of the three offices listed.</p>\n\n<p><strong><u>MINIMUM QUALIFICATIONS</u></strong></p>\n<ul>\n<li>Must have a minimum of 4 years of experience in C#/.Net development.</li>\n<li>Experience with Visual Studio required.</li>\n<li>Experience with SQL required.</li>\n<li>Bachelor’s degree.</li>\n<li>Must be able to travel up to 10% for team meetings at Jack Henry offices.</li>\n</ul>\n\n<p><strong><u>PREFERRED QUALIFICATIONS</u></strong></p>\n<ul>\n<li>Degree in business, software engineering, or computer science.</li>\n<li>Experience with Azure DevOps.</li>\n<li>SQL Server 2012 or higher experience.</li>\n<li>OOA and OOD experience.</li>\n<li>Experience with JavaScript frontend development using a modern framework such as Angular.</li>\n<li>Experience with Agile development methodologies.</li>\n<li>REST based API development experience.</li>\n<li>Automated unit testing experience.</li>\n</ul>\n\n<p><strong><u>ESSENTIAL FUNCTIONS </u></strong></p>\n<ul>\n<li>Completes product technical design and prototyping, software development, bug verification and resolution.  </li>\n<li>Performs system analysis and programming activities which require research.</li>\n<li>Provides technical/engineering support for new and existing applications from code delivery until the retirement of the application.  </li>\n<li>Provides reasonable task and project cost/effort estimates. </li>\n<li>Ensures timely, effective, and quality delivery of software into production.</li>\n<li>Develops and tests applications based on business requirements and industry best practices.</li>\n<li>Creates required technical documentation.</li>\n<li>Adheres to documented departmental and corporate standards.  May participate in the definition and documentation of standards.</li>\n<li>Collaboratively works with QA team to ensure timely delivery of high-quality products.</li>\n<li>Collaboratively works with customer support team to resolve or diagnose defects.</li>\n<li>Assists in training and mentoring less experienced peers.</li>\n</ul>            </div>"
    },
    {
        "position": "Full Stack Web Developer (Remote, International)",
        "company": "SOCi Inc.",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-06-16T08:27:08.712Z",
        "url": "https://stackoverflow.com/jobs/519652/full-stack-web-developer-remote-international-soci-inc?a=2Oh3Jh7jfKnu&so=i&pg=1&offset=5&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:08.712Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>About SOCi</strong></p>\n<p>SOCi is an award-winning all-in-one local marketing platform built specifically for \"next-level\" multi-location marketers. Our customers include top brands and influencers like Ace Hardware, Sport Clips, and Anytime Fitness who have the impossible challenge of managing their digital presence across hundreds and thousands of locations. The SOCi platform empowers local management of the entire customer journey across multiple mediums including local business listings, social, reviews, listening, ads, bots, and more. As the central command for multi-location marketers, SOCi makes the impossible possible by enabling top brands and their locations to strengthen and scale their digital presence across limitless local search and social pages while protecting what matters most, their reputation.</p>\n<p>*** This is a fully remote position; <strong>international applicants welcome!</strong></p>\n<p><strong>Full Stack Web Developer</strong></p>\n<ul>\n<li>As a member of an Empowered Product Team, you'll be accountable for deeply understanding the customer's problem, actively contributing to ideating on the solutions and measuring your impact through the results on our customers, not code written. There are no \"specs\" or top-down management here.</li>\n<li>A team consists of 2 other engineers, a UX designer and a product manager. You'll be \"mob programming\" with the other engineers, in real-time over Zoom throughout the day, while ad-hoc collaborating with the product manager and UX designer as needed.</li>\n<li>This position is fully remote, our teams are distributed across four continents. You'll be expected to observe ~6am...~4pm PST (±2) working hours (varies by team).</li>\n<li>You'll be deploying incremental slices of progress to production daily or even multiple times throughout the day; the only measure of progress is delivery of customer value to production.</li>\n</ul>\n<p><strong> Requirements</strong></p>\n<ul>\n<li>7+ years experience in building complex software systems</li>\n<li>Deep understanding of object-oriented programming, ability to articulate the pros and cons of inheritance vs composition, discuss common design patterns, their applications and common mistakes when using them</li>\n<li>Deep understanding of relational database systems (MySQL, Postgres), including normalization (pros, cons), indexing strategies for large databases (100s millions of rows), and query optimization strategies (and common pitfalls)</li>\n<li>Demonstrated track record of being able to balance making the right architectural decisions while moving fast do deliver customer value; can show examples of prior architectures built, articulate the tradeoffs and reasons for them</li>\n<li>Solid core programming skills in a couple of languages (JS, PHP preferred, but not required)</li>\n</ul>\n<p><strong>Why you’ll love it here</strong></p>\n<ul>\n<li>Fully remote, diverse international team</li>\n<li>An extremely talented group of engineers and tech leads to learn from</li>\n<li>Work directly with product and technology executives</li>\n<li>Active career coaching and professional development to keep you growing</li>\n<li>Learning budget (books, online courses)</li>\n<li>Directly see the impact of your work by working closely with customers and help build the fastest-growing mar-tech platform for top brands</li>\n</ul>\n<p><strong>What's SOCi's culture like?</strong></p>\n<p>SOCi stands for Selfless, Overachievers, Customer Centric, and Innovative. We strive to be in service to each other, consider learning as Job #1, and obsess over the customer problems such that we can deliver most valuable solutions to them. We hold each other accountable, are candid in our feedback, and expect you to do the same. It's okay to make mistakes, it's not okay to not learn from them. We partner strongly across departments and function, as we know it'll take a village to succeed. One team, one dream.</p>\n<p>SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</p>            </div>"
    },
    {
        "position": "Engineering Team Lead (Internal Platform)",
        "company": "Miro",
        "location": {
            "city": "Amsterdam",
            "state": "Netherlands"
        },
        "posted": "2021-06-27T08:27:10.102Z",
        "url": "https://stackoverflow.com/jobs/528842/engineering-team-lead-internal-platform-miro?a=2Rm95W89KnDi&so=i&pg=1&offset=6&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "agile"
        ],
        "lastScraped": "2021-07-08T08:27:10.102Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong><strong>About the team</strong></strong></p>\n<p>Miro is a successful and fast growing engineering company that has created a business-critical tool for various companies across the globe. We developed our product in a monolith application paradigm but it’s time to change it.<br>Service Communications team is a part of Internal Platform team, it is a new service team which is aimed to build and support a foundation for service-to-service communications.</p>\n<p>Each role at Miro is based at one of our physical hubs and we look for talent that want to be part of these local, collaborative communities. Mironeers work in a hybrid model, with a 3 days a week in office culture as our baseline.</p>\n<p><strong><strong>About the role</strong></strong></p>\n<p>We are looking for an experienced Team Lead. As the Service Communications team is a new function, a large part of your role will be to participate in developing and executing the strategy and being part of the hiring process too. At first, we need to support some base RPC interactions and then introduce other communications patterns to allow product-development teams to move faster.</p>\n<p><strong><strong>What you’ll do</strong></strong></p>\n<ul>\n<li>Develop and execute service-to-service communications strategy at Miro, communicate it with the team and stakeholders</li>\n<li>Lead the engineering team responsible for service communications architecture, infrastructure and quality. Hire and develop new talent</li>\n<li>Consolidate existing, and create new best practices for service and client-server communications for the entire engineering organization</li>\n</ul>\n<p><strong><strong>What you’ll need</strong></strong></p>\n<ul>\n<li>5+ years of experience in development with the required stack (Java, Spring Boot)</li>\n<li>2+ years of experience leading a team of developers: recruiting and onboarding, mentoring, professional development, motivation</li>\n<li>Experience of building a foundation for microservice/SOA architecture, especially service-to-service layer</li>\n<li>Experience building high load and large scale distributed systems</li>\n<li>Experience working in an agile cross-functional team in a fast-paced environment</li>\n<li>Strong communication and fluency in English</li>\n</ul>\n<p><strong><strong>What's in it for you</strong></strong></p>\n<ul>\n<li>Stock Option Grant</li>\n<li>Medical Insurance coverage</li>\n<li>Allowance to facilitate remote working during WFH period</li>\n<li>Weekly remote team activities to keep the spirits high</li>\n<li>Opportunity to work for a truly global multicultural team</li>\n<li>Lunch, snacks and drinks provided when back in the office</li>\n</ul>\n<p><strong><strong>About Miro</strong></strong></p>\n<p>Miro is an online collaborative whiteboard platform that enables distributed teams to work effectively together, from running brainstorming sessions and workshops to planning projects, from designing new products and services to facilitating agile ceremonies. With around 10 million users and counting, Miro is trusted by Dell, Cisco, Salesforce, PWC, EY, Deloitte and many more global companies of all sizes.</p>\n<p>At Miro, we are a team of dreamers. We look for individuals who dream big, work hard and above all stay humble. Collaboration is at the heart of what we do and through our work together we hope to create a supportive, welcoming, and innovative environment. We strive to play as a team to win the world and create a better version of ourselves everyday. If this sounds like something that excites you, we want to hear from you! </p>\n<p>Check out our <a href=\"https://miro.com/careers/\" rel=\"nofollow\" target=\"_blank\">career page</a> for all our open roles or hop onto this <a href=\"https://miro.com/app/board/o9J_klqghMw=/\" rel=\"nofollow\" target=\"_blank\">Miro board</a> to learn more about us!</p>            </div>"
    },
    {
        "position": "Internal Communication Strategist, Planning & Engagement",
        "company": "Apple",
        "location": {
            "city": "Cupertino",
            "state": "CA"
        },
        "posted": "2021-06-18T08:27:11.098Z",
        "url": "https://stackoverflow.com/jobs/531258/internal-communication-strategist-planning-apple?a=2SanRxvYkpzy&so=i&pg=1&offset=7&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:11.098Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nInternal communications at Apple connects our people to our purpose by bringing our values to life, communicating about products and initiatives, and elevating the employee experience. As a member, you’ll be part of the line of business communication team that supports Apple’s Information Systems &amp; Technology (IS&amp;T) organization. \nThink of IS&amp;T as Apple’s nerve center. Our employees design and lead the massive systems that run Apple services, such as Apple Pay and the Apple website, as well as manufacturing, logistics, retail operations, and all our corporate facilities. IS&amp;T also develops and manages our data centers all over the globe.<br><br><span>In this role, you’ll develop and lead large-scale, innovative internal communication campaigns, and coordinate efforts across our team—from editorial, to design, and more—to keep our people engaged. You’ll work with a number of internal customers, learn about their needs, and help them achieve their business goals by developing effective internal communications strategies and deliverables.\n\nThe ideal candidate is creative and super passionate about internal communications and engagement, as well as the employee experience. Someone who sees employees not as employees, but as our company’s first customers—who view themselves as internal marketers, always looking for exciting, novel ways to get the right message, to the right person, at the right time, and through the right channel.</span>            </div>"
    },
    {
        "position": "Senior Internal Tools Developer Advocate - Site Reliability Engineering",
        "company": "Apple",
        "location": {
            "city": "Cupertino",
            "state": "CA"
        },
        "posted": "2021-07-06T08:27:12.009Z",
        "url": "https://stackoverflow.com/jobs/533379/senior-internal-tools-developer-advocate-site-apple?a=2SSuarDFZrxe&so=i&pg=1&offset=8&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "scala"
        ],
        "lastScraped": "2021-07-08T08:27:12.009Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThe Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. \nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. \nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here.<br><br><span>Apple Media Products SRE team is looking for a hardworking engineer to join our Tools development team in the role of Developer Advocate to communicate with our users and gather feedback and to help us design and develop a future of our platform. A platform that powers people’s favorite products like App Store, Apple Music, Apple TV+ and many more!\n\nRESPONSIBILITIES WILL INCLUDE\n-  Know all ins-and-outs of the AMP Platform to be able to give advice on how users can leverage it in the best way.\n\n-  Teach our users capabilities of the platform and how to use it.\n\n-  Answer questions on our support channels and help troubleshoot issues to identify documentation, user experience and feature gaps.\n\n-  Write documentation that is missing and implement changes to the platform that will improve their user experience.\n\n-  Communicate with our users, receive their feedback and help us identify requirements for the new features and help shape us the platform roadmap.\n\n-  Help design the features and ascertain how they will affect user experience.</span>            </div>"
    },
    {
        "position": "Internal Communication Strategist, Content - Apple IS&T Strategy & Programs",
        "company": "Apple",
        "location": {
            "city": "Cupertino",
            "state": "CA"
        },
        "posted": "2021-06-18T08:27:12.764Z",
        "url": "https://stackoverflow.com/jobs/530901/internal-communication-strategist-content-apple?a=2S2XDj9NUtxu&so=i&pg=1&offset=9&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:12.764Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nInternal communications at Apple connects our people to our purpose by bringing our values to life, communicating about products and initiatives, and elevating the employee experience. As a member, you’ll be part of the line of business communication team that supports Apple’s Information Systems &amp; Technology (IS&amp;T) organization. \nThink of IS&amp;T as Apple’s nerve center. Our employees design and lead the massive systems that run Apple services, such as Apple Pay and the Apple website, as well as manufacturing, logistics, retail operations, and all our corporate facilities. IS&amp;T also develops and manages our data centers all over the globe.<br><br><span>In this role, you’ll lead IS&amp;T’s digital content strategy, enhance our storytelling capabilities, and showcase stories that matter, have impact, and make a difference for our employees. It will be up to you to determine what stories we tell, in what format we tell them, how we amplify them across our owned channels, and what new channels and methods we should explore.\n\nThe ideal candidate has superb writing and copyediting skills, experience creating content strategies that build and grow audiences, and knows how to keep their finger on the pulse of the organization to drive great storytelling opportunities.</span>            </div>"
    },
    {
        "position": "Internal Cloud Developer",
        "company": "JPMorgan Chase Bank, N.A.",
        "location": {
            "city": "Columbus",
            "state": "OH"
        },
        "posted": "2021-07-06T08:27:13.482Z",
        "url": "https://stackoverflow.com/jobs/535177/internal-cloud-developer-jpmorgan-chase-bank-na?a=2TtS4FfvWlhe&so=i&pg=1&offset=10&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "agile",
            "cloud"
        ],
        "lastScraped": "2021-07-08T08:27:13.482Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nWe're looking for members to fill out our Agile team. Your focus will be on the newer technologies (cloud, Domain Driven Design, API's, microservices) with the goal of decomposing a larger service into smaller microservices. The existing team is a truly diverse, fun mix of experience and skills who currently work extremely well together. This team solves the tough problems for breakfast!<p>We just need an experienced developer to put it all together!<br>Please note that we are describing our ideal candidate here. We don't expect you to know everything. Showing that you can learn something new is almost as valuable as already knowing it.<br>As a member of our Agile team we look first and foremost for people who are passionate around solving business and technical problems through innovation and engineering practices. Our team embraces a culture of experimentation and constantly strives for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.</p><p>Our ideal candidate possesses many of the following attributes:<br>     * BS/BA degree or equivalent experience<br>     * Minimum of 5 years of application development experience<br>     * Expertise in Java, Spring Boot, OO-design/implementation, Domain Driven Design, Data management, and relational databases<br>          + Website development is a plus but not critical<br>          + J2EE experience is welcome as we remove those components from our system<br>          + Kafka and Cassandra experience<br>     * Knowledge of industry-wide technology trends and best practices (let's use all the fun tools out there!)<br>     * Mindset of testing while coding (automated)<br>     * Passionate about building an innovative and inclusive culture<br>     * Strong communication skills - able to work with technical and non-technical stakeholders</p><p>Come be part of a genuinely fun team who can truly be independent. Come set the example for other teams in the area to follow. We have some interesting problems to solve over the next couple years. Isn't that why you really got into programming to begin with?JPMorgan Chase &amp; Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.</p><p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.</p><p>Equal Opportunity Employer/Disability/Veterans</p>            </div>"
    },
    {
        "position": "Apple Cloud Platform - Internal CI/CD Service & Tools",
        "company": "Apple",
        "location": {
            "city": "Philadelphia",
            "state": "PA"
        },
        "posted": "2021-06-18T08:27:14.202Z",
        "url": "https://stackoverflow.com/jobs/517321/apple-cloud-platform-internal-ci-cd-service-apple?a=2NuARwdSMw7e&so=i&pg=1&offset=11&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "design"
        ],
        "lastScraped": "2021-07-08T08:27:14.202Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nAre you a service developer looking to grow your skill set, invent new technology, and make a difference in developer productivity for thousands of developers inside all parts of Apple? \nThe Software Development Productivity team builds services and tools to help developers get ideas from commit to production quickly and with confidence. We’re constantly improving our existing CI/CD service to give developers the building blocks they need to produce scalable, high performance build and deploy pipelines with minimal friction. Our services power an enormous number of builds per day across all of Apple, including some of the most well known customer facing properties, and we want to do even more. \nOur engineering team is committed to innovating and pushing the bounds of continuous delivery. We ship to customers frequently and constantly strive to improve our delivery. Improving means constantly learning and making mistakes, something our team embraces. \nWe believe that the role of a developer is not to produce code, but tackle problems. This means asking a lot of questions, understanding and empathizing with customers, and helping make the hard choices about what to build.<br><br><span>YOU’LL DO WELL IN THIS ROLE IF YOU:\n-  Are driven to create outstanding customer experiences, and are passionate about helping developers write better code faster.\n\n-  Are good at understanding an entire customer problem and applying technology to it\n\n-  Love teaching people and learning new things\n\n-  Are not afraid to ask the hard questions or express your opinions, even when they are controversial.\n\n-  Enjoy evolving a large, critical system to provide next generation features</span>            </div>"
    },
    {
        "position": "Internal Cloud Developer",
        "company": "JPMorgan Chase Bank, N.A.",
        "location": {
            "city": "Columbus",
            "state": "OH"
        },
        "posted": "2021-07-05T08:27:15.042Z",
        "url": "https://stackoverflow.com/jobs/534323/internal-cloud-developer-jpmorgan-chase-bank-na?a=2Tc78j3OMzD2&so=i&pg=1&offset=12&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "java",
            "agile",
            "cloud"
        ],
        "lastScraped": "2021-07-08T08:27:15.042Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nWe're looking for members to fill out our Agile team. Your focus will be on the newer technologies (cloud, Domain Driven Design, API's, microservices) with the goal of decomposing a larger service into smaller microservices. The existing team is a truly diverse, fun mix of experience and skills who currently work extremely well together. This team solves the tough problems for breakfast! We just need a strong developer to help us put it all together!<p>Please note that we are describing our ideal candidate here. We don't expect you to know everything. Showing that you can learn something new is almost as valuable as already knowing it.</p><p>As a member of our Agile team we look first and foremost for people who are passionate around solving business and technical problems through innovation and engineering practices. Our team embraces a culture of experimentation and constantly strives for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.</p><p>Our ideal candidate possesses many of the following attributes:<br>     * BS/BA degree or equivalent experience<br>     * Minimum of 2 years of application development experience<br>     * Expertise in Java, Spring Boot, OO-design/implementation, Domain Driven Design, Data management, and relational databases<br>          + Website development is a plus but not critical<br>          + J2EE experience is welcome as we remove those components from our system<br>          + Kafka and Cassandra experience<br>     * Knowledge of industry-wide technology trends and best practices (let's use all the fun tools out there!)<br>     * Mindset of testing while coding (automated)<br>     * Passionate about building an innovative and inclusive culture<br>     * Strong communication skills - able to work with technical and non-technical stakeholders</p><p>Come be part of a genuinely fun team who can truly be independent. Come set the example for other teams in the area to follow. We have some interesting problems to solve over the next couple years. Isn't that why you really got into programming to begin with?JPMorgan Chase &amp; Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.</p><p>We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.</p><p>Equal Opportunity Employer/Disability/Veterans</p>            </div>"
    },
    {
        "position": "Senior Software Engineer - Web and International QA Team",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-06-27T08:27:15.889Z",
        "url": "https://stackoverflow.com/jobs/438809/senior-software-engineer-web-and-international-audible?a=2na6iyOFxJ28&so=i&pg=1&offset=13&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "qa",
            "testing"
        ],
        "lastScraped": "2021-07-08T08:27:15.889Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nGood storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br><br>ABOUT THIS ROLE<br>Are you a software engineer passionate about optimizing development and testing lifecycle via bringing in new testing methodologies, tools and process automation? Our team at Audible, ensures quality of Audible’s website applications (across International market places) and services for our global listeners. We are the home for tech talent that wants to grow Audible’s market leading business and help to deliver superior customer experience across desktop and mobile devices in an efficient and optimized manner using latest tools and processes. The team is comprised of QA engineers and developers who work in an agile environment and partner closely with Audible and Amazon tech teams - Product, UX and Dev.<br><br>As a Software Development Engineer at Audible Web and International team, you will be acting as Quality Engineering enabler by leading test automation and infrastructure development, and driving automated testing. You will be responsible for implementing new and best industry practices towards improvements across our stack which will provide you an opportunity for learning and career growth.<br><br>You will partner with Quality Assurance Engineers, Developers, and Product Managers to enable our QAEs and SDEs to deliver faster with high quality outcomes. You will be staying current in the latest trends in technology and have a desire to lead adoption of innovative practices and play a major role in transformation journey across the organization.<br><br><br><br>As a Senior Software Engineer, you will:<br>· Capable of independently clarifying technical requirements, assessing development estimates and applying a broad range of design approaches.<br>· Able to use technology to solve difficult problems. Able to define a design, turn it into high quality code, and deliver it on schedule. Proficient in a broad range of data structures and algorithms, knowing when it is (and isn’t) appropriate to use them.<br>· Drive continuous improvement of software quality, CX and maintainability of products/features.<br>· Develop the best automation and tooling, drive testability and diagnostic ability into the product, while promoting best practices in quality areas.<br>· Define and Develop standards and frameworks to ensure most efficient processes and highest level of quality, as well as design tools for unit, functional, performance and security testing in a programmatic manner.<br>· Build test software that exposes API defects in production level code as well as defects at the component and feature integration prospective.<br>· Innovate and drive adoption of latest industry best practices.<br>· Programmatically test the product, Measure test coverage and Develop right metrics to showcase value add based on adoption of new best practices.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br><br><br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· Bachelor’s degree in Computer Science or related field, or equivalent experience.<br>· Able to write and enforce logical and maintainable code.<br>· Able to provide code reviews and assess an existing software application, correctly identify enhancements that can be made to improve it.<br>· Proven ability to identify and resolve the root cause of software defects.<br>· Experience in designing and building test tools and systems.<br>· Experience with scripting languages (Perl/Ruby/Python, JavaScript, etc.).<br>· Knowledge of HTML, CSS, JavaScript, XML, and web client technologies.<br><br>Preferred Qualifications<br><br>· Expert level with Java/C++ or other OO languages.<br>· Understanding of QA Methodologies and software life cycle.<br>· Understanding of application architecture and technology infrastructure<br>· Experience with test and behavior driven development.<br>· Understanding of Continuous Integration and Deployment processes.<br>· Experience with but not limited to JUnit/TestNG, JBehave (or other BDD framework), Selenium, mock objects.<br>· Problem-solving skills with the ability to navigate highly complex and ambiguous situations.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>            </div>"
    },
    {
        "position": "JAVA Full Stack Web Application Developer – Entry Level & Internships",
        "company": "LBi Software",
        "location": {
            "city": "Melville",
            "state": "NY"
        },
        "posted": "2021-06-23T08:27:16.366Z",
        "url": "https://stackoverflow.com/jobs/521892/java-full-stack-web-application-developer-entry-lbi-software?a=2P1DBA8o3JL2&so=i&pg=1&offset=14&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-07-08T08:27:16.366Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>LBi Software is looking for an entry level Java Full Stack Web Application Developer. Candidates will be working on a team to design and develop custom enterprise web applications. LBi Software develops custom applications both <a href=\"http://lbidynasty.com/\" rel=\"nofollow\" target=\"_blank\">sports leagues/teams </a> and <a href=\"https://www.lbisoftware.com/about-us\" rel=\"nofollow\" target=\"_blank\">HR Enterprise Software</a> markets. Candidates must be self-starters and able to follow written and verbal direction working with a technical team leader. They must be able to produce well-documented and efficient code and possess the communication skills necessary to explain complex technical information. The position requires strong interpersonal and communication skills. The position requires strong knowledge of software architecture, development, database design, unit testing, continuous integration, continuous delivery, and QA processes.</p>\n<p>LBi is also looking for internships and co-ops with the same skillset.</p>\n<p>Qualified candidates will join a team utilizing agile methodologies towards software development and delivery. Team sizes vary roughly from 2-10 developers, who will work in 1-3 week sprints.</p>\n<p><strong>Required technical skills:<br></strong>Java or .NET(C#), REST Services, HTML, Angular, CSS/SCSS, Bootstrap, Junit, SQL, Database Design</p>\n<p><strong>Additional skills a plus:<br></strong>JSpring Framework, J2EE technologies, MyBatis, .NET Core, EF Core, UI/UX design, Responsive Design, SASS/LESS, React, Node, Tomcat, Jenkins, Docker, Kubernetes, Agile Process, Smartphone/Tablet App Development (iOS, Android), Business Objects, ETL, Crystal Report, database reporting tools, Apache Spark, DB2, Oracle, MySQL, MariaDB, PostgreSQL, SQL Server</p>\n<p>For more information see <a href=\"https://www.lbisoftware.com/careers\" rel=\"nofollow\" target=\"_blank\">https://www.lbisoftware.com/careers</a> and <a href=\"http://lbidynasty.com/\" rel=\"nofollow\" target=\"_blank\">http://lbidynasty.com/</a></p>\n<p>Send Resume and Cover letter to <a rel=\"nofollow\" target=\"_blank\"></a><a href=\"mailto:Resume@LBiSoftware.com\">Resume@LBiSoftware.com</a></p>            </div>"
    },
    {
        "position": "Senior Full Stack Development Engineer - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-06-30T08:27:17.027Z",
        "url": "https://stackoverflow.com/jobs/525968/senior-full-stack-development-engineer-audible?a=2Qoo3nP7FOSs&so=i&pg=1&offset=15&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "design",
            "user-interface",
            "java"
        ],
        "lastScraped": "2021-07-08T08:27:17.027Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nGood storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>About the team<br>Audible International Expansion team is delivering on a vision for launching a localized, customer-centric presence in new countries while building world class engineering platform to enable faster and differentiated launches. We are expanding and improving the platform from mobile web to back-end services while innovating and leveraging new Amazon technology and platforms. Success means we are delighting more customers in new countries while building on an already tremendously successful and much-loved product.<br><br>About you<br>You are an innovative and passionate top software engineer looking to make a positive impact on customer experience. You like to own deliverables end-to-end and have a meaningful influence on the final product. You are a builder. You like to work with fellow engineers and product people to share knowledge, imagine, design, develop, test, and launch software that wows our community and inspires our peers. You're curious and love to learn unprompted as you stay up to date with tools, trends, technologies and best practices in the industry. Please don't hesitate to apply!<br><br>As a Software Developer II, you will:<br>· Partner with cross-functional teams to imagine, design, develop, test, and launch software that impacts our community and inspires your peers.<br>· Set the technical direction and strategy within a team and strategize to influence technology across Audible and beyond.<br>· Work with your team to invent, design and build software that is stable and performant.<br>· Proficient in a broad range of design approaches and know when it is appropriate to use each.<br>· Solve difficult problems of diverse scope where analysis of data requires evaluation of identifiable factors, demonstrating sound judgment in selecting methods and techniques for obtaining solutions.<br>· Capable of independently clarifying technical requirements, developing coding estimates and applying a broad range of design approaches to bring innovative solutions to the table.<br>· Review code of other team members and provide constructive direction.<br>· Constantly strive to raise the bar on engineering excellence.<br>· Drive continuous improvement of software quality, CX and maintainability of products/features.<br>· Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br>· Additional duties as assigned.<br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· Bachelor’s degree in Computer Science or related field, or equivalent experience.<br><br>Preferred Qualifications<br><br>· Able to provide a code review, assess an existing software application and correctly identify where enhancements may be made to improve it, identify and resolve the root cause of software defects.<br>· Experience navigating highly complex and ambiguous situations.<br>· Past mentorship of other engineers within an organization, showing mutual growth.<br>· Experience building software systems that have been successfully delivered to internal or external customers.<br>· Ability to think creatively and adapt the message to the audience. Can provide information to technical and non-technical stakeholders alike and guide them to confidently informed decisions.<br>· Able to design, implement, and deploy software components and features, and solve difficult problems.<br>· Able to work independently and with your team to deliver software successfully.<br>· Able to establish good working relationships with peers. Able to recognize discordant views and take part in constructive dialogue to resolve them.<br>· Able to confidently train new team-mates about your customers, what the team’s software does, how it is constructed, tested, operates, and how it fits into the bigger picture.<br>· Knowledgeable about a broad range of design approaches and when to use them (and when to not).<br>· Understand the legacy of coding decisions. Know when a short-term workaround is a problem and when to limit this type of solution and the implications of adding new dependencies.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br>            </div>"
    },
    {
        "position": "Senior Full Stack Development Engineer - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-07-05T08:27:17.677Z",
        "url": "https://stackoverflow.com/jobs/529397/senior-full-stack-development-engineer-audible?a=2RxGzSoUa72U&so=i&pg=1&offset=16&total=17&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "design",
            "java",
            "testing"
        ],
        "lastScraped": "2021-07-08T08:27:17.677Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nGood storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>ABOUT THIS ROLE<br>As a Senior Full Stack Engineer, it’s up to you to define, design and refine the tech that keeps us one step ahead of listeners. Anticipate. Innovate. Bring challenging ideas and we’ll support you with the latest tech, tools and systems that you need to succeed. You’ll be essential in ensuring the team can reach their potential; working closely with them, reviewing their work, mentoring, and supporting them to develop. Together, you’ll build and maintain our platform to bring thousands of stories to millions of listeners and unleash the power of the human voice.<br><br>ABOUT THE TEAM<br><br>Audible International Expansion team is delivering on a vision for launching a localized, customer-centric presence in new countries while building world class engineering platform to enable faster and differentiated launches. We are expanding and improving the platform from mobile web to back-end services while innovating and leveraging new Amazon technology and platforms. Success means we are delighting more customers in new countries while building on an already tremendously successful and much-loved product.<br><br>ABOUT YOU<br>You feel pride in every step forward, however big, or small; to you, each challenge represents a well-executed venture to support our listeners. If you’re looking to build on your skills and grow into a leader, this is your next step. We look for people who take responsibility, set their standards high and see every failure as an opportunity to learn. You’re looking for an environment where you can thrive. With opportunities to challenge yourself and a talented team by your side, you’ll find what you’re looking for at Audible.<br><br><br>As a Senior Full Stack Engineer, you will:<br>· Design, develop, and test software components and applications for the largest creator and provider of audiobooks in the world.<br>· Work on an agile engineering team writing maintainable and scalable code for software components and influencing team decisions.<br>· Collaborate with stakeholders to imagine, design, develop, test, and launch software that impacts our customers and inspires your peers.<br>· Use technology to solve difficult problems. Define a design, turn it into high quality code, and deliver it on schedule. Proficient in a broad range of data structures and algorithms, knowing when it is (and isn’t) appropriate to use them.<br>· Independently clarify technical requirements, assessing development estimates and apply a broad range of design approaches.<br>· Review code of other team members and provide constructive direction.<br>· Drive continuous improvement of software quality, customer experience, and maintainability of products/features.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br><br><br><br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· Bachelor’s degree in Computer Science or related field, or equivalent experience.<br>· Experience writing clear, maintainable and extensible code.<br><br>Preferred Qualifications<br><br>· Strong problem-solving skills with the ability to navigate highly complex and ambiguous situations.<br>· Experience building and delivering software systems to internal or external customers.<br>· Strong verbal and written communication skills, enabling effective messaging with both technical and non-technical audiences.<br>· A high-quality bar: documentation, unit testing, code reviews, test automation, continuous integration &amp; deployment. Enthusiasm for instilling this attitude in others.<br>· Adaptable, enterprising, and willing to take ownership.<br>· Able to make improvements to the team’s development and testing processes.<br>· Able to establish good working relationships with peers. Able to recognize discordant views and take part in constructive dialogue to resolve them.<br>· Able to mentor teammates on team software, team culture, and customer obsession.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br>            </div>"
    }
]