[
    {
        "position": "Biomedical ontology developer - contribute to an international consortium",
        "company": "European Bioinformatics Institute (EMBL-EBI)",
        "location": {
            "city": "Hinxton",
            "state": "UK"
        },
        "posted": "2021-05-02T04:45:53.237Z",
        "url": "https://stackoverflow.com/jobs/522840/biomedical-ontology-developer-contribute-to-an-european-bioinformatics?a=2PllJ9EGlydq&so=i&pg=1&offset=0&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-05-03T04:45:53.237Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>This is an opportunity to contribute to an international ontology alignment effort (uPheno) covering all the major phenotype and trait ontologies in use today.  This work will improve tools that use intra and inter-species inference of phenotypic similarity to help find the genetic causes of clinical phenotype and disease from among the vast array of variants found in patient genomes.  It will also provide one of the critical inputs to tools developed to find and prioritise drug targets.<br><br>Your work will be part of the NIH funded Phenomics First Initiative, an international consortium co-ordinated by an NIH Center of Excellence in Genomic Science and including the developers of the Human Phenotype Ontology and MONDO disease ontology.   It will involve a wide range of collaborations with phenotype and trait ontology developers and users around the world.</p>\n<p><strong>Your role</strong></p>\n<ul>\n<li>Designing and implementing schemas and term templates for defining phenotype ontology terms</li>\n<li>Editing and extending ontologies used to define phenotypes including the cross-species anatomy ontology Uberon</li>\n<li>Contributing to human phenotype/trait to disease mappings</li>\n<li>Helping coordinate the work of a large community of ontology editors</li>\n<li>Soliciting expert input and feedback</li>\n</ul>\n<p><strong>You have</strong></p>\n<ul>\n<li>A PhD in biology/medicine</li>\n<li>A background in or good understanding of one or more of the following:</li>\n<ul>\n<li>clinical traits;  comparative anatomy; genetics; physiology; GWAS</li>\n</ul>\n</ul>\n<p><strong>You might also have</strong></p>\n<ul>\n<li>Experience in Biocuration, especially if it involves curation with ontology terms.</li>\n<li>Scripting skills:  knowledge and experience with Python &amp; Unix/shell would be especially useful.</li>\n<li>Some understanding of/experience with ontology development, especially ontology development using Web Ontology Language (OWL).</li>\n</ul>\n\n<p><strong>What else you need to know</strong></p>\n<p><strong>To apply</strong> please submit a covering letter and CV through our online system.  <br><br>At EMBL-EBI, we strongly believe that inclusive and diverse teams benefit from higher levels of innovation and creative thought. We encourage applications from women, LGBTQ and individuals from all nationalities. <strong>Visa exemptions</strong> will be offered to international candidates and details will be discussed during interview. We believe in science without borders and this <a href=\"https://www.ebi.ac.uk/about/jobs/brexit-and-embl-ebi-staff\" rel=\"nofollow\" target=\"_blank\">continues after Brexit</a>.<br><br>This role is based in Hinxton, UK and you will be required to relocate once it is safe to do so if you are currently based abroad. More info on how we are recruiting in this period is available on our page: <a href=\"https://www.ebi.ac.uk/about/jobs/recruitment-covid19\" rel=\"nofollow\" target=\"_blank\">Recruitment and Onboarding during Covid19</a>.<br><br>This position is limited to the project duration of 2-years or until end May 2025 in the first instance.<br><br>We aim to provide a response within two weeks after the closing date.<br><br><strong>Job no.: EBI01759</strong></p>            </div>"
    },
    {
        "position": "Mobile App - Marketing/Networking Support Intern",
        "company": "Grassroots Technologies, Inc",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-04-29T04:45:53.696Z",
        "url": "https://stackoverflow.com/jobs/523912/mobile-app-marketing-networking-support-intern-grassroots-technologies-inc?a=2PHDxMOpiSNa&so=i&pg=1&offset=1&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "instagram",
            "twitter",
            "facebook",
            "sysadmin"
        ],
        "lastScraped": "2021-05-03T04:45:53.696Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>GRT is carefully searching for one more interns to assist in promoting a newly released mobile app called CraftMEME.</p>\n<p>GRT’s search for this new person is focused with all of our past success factors in mind.</p>\n<p><strong>Required Background/Skills</strong></p>\n<ul>\n<li>Bachelor’s degree or currently working towards a bachelor’s degree in marketing, business, or a related field</li>\n<li>Experience with gaming and specifically mobile gaming environments.</li>\n<li>Experience and interest in different social networking concepts spanning Instagram, Twitter and/or Facebook platforms.</li>\n</ul>\n<p><strong>Work Focus:</strong></p>\n<ul>\n<li>Learn how CraftMEME works and is developed.</li>\n<li>Analyze personal experience and select one platform based on experience and begin to brainstorm ways to generate more presence for CraftMEME in meme based communities.</li>\n<li>Write copy for social media posts, promotional emails, and other marketing collateral.</li>\n<li>Potentially assist in the creation more advanced materials to be used.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Familiarity with standard email and document programs (MS Office, Google Suite, etc).Proficient with the use of Microsoft Office (Excel, Outlook)</li>\n<li>Any variety of introductory coding experience.</li>\n<li>Other technical exposure and interests.</li>\n</ul>            </div>"
    },
    {
        "position": "Front-End Engineer I Intern",
        "company": "Amazon Web Services",
        "location": {
            "city": "Seattle",
            "state": "WA"
        },
        "posted": "2021-04-13T04:45:54.657Z",
        "url": "https://stackoverflow.com/jobs/523808/front-end-engineer-i-intern-amazon-web-services?a=2PFtDhFK6Mgg&so=i&pg=1&offset=2&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "javascript",
            "reactjs",
            "coffeescript"
        ],
        "lastScraped": "2021-05-03T04:45:54.657Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nNOTE: By applying to this position, your application will be considered for all Front End Engineer Intern roles in Seattle, WA and San Francisco, CA.<br><br>Amazon Web Services is looking for a Front End Engineer Interns to help drive the development of new features, functionality, and capabilities for AWS.<br><br>Are you interested in enabling the coolest scientific and medical research teams out there to make the next big breakthrough? Or perhaps post-production houses to produce movies and other works of art?<br>In this role, you'll be part of a world-class team in a fast-paced agile environment. This is an opportunity to operate and engineer systems on a global scale, while touching and influencing large parts of the consumed AWS services. You'll be surrounded by people who are smart, passionate, and believe that world-class service is critical to customer success. You will design and build the features that will support some of the most important initiatives our customers are working on.<br><br>The ideal candidate will be passionate about the opportunities that AWS provides our customers with, building simple and elegant software solutions and customer-centric products. AWS is looking for candidates that will thrive and succeed, by delivering high quality sustainable solutions when priorities shift fast, and are able to work with a team or independently as the situation dictates. If you're looking to solve challenging technical problems and create great products for customers, then this is the right role for you!            </div>"
    },
    {
        "position": "Apple Media Products - Full-Stack Engineer, Internal Tools",
        "company": "Apple",
        "location": {
            "city": "Seattle",
            "state": "WA"
        },
        "posted": "2021-04-18T04:45:55.229Z",
        "url": "https://stackoverflow.com/jobs/437960/apple-media-products-full-stack-engineer-apple?a=2mSrXPGYVsn6&so=i&pg=1&offset=3&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "reactjs",
            "node.js",
            "java"
        ],
        "lastScraped": "2021-05-03T04:45:55.229Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThe Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here.<br><br><span>In this role, you will be creating tools for Apple editors and business managers, so that they can succeed in creating the most immersive and useful experience possible for Apple’s millions of users worldwide. The work will consist of building tooling to power our users to create a great AppStore. We power the pages, and recommendation signals that drive user engagement to allow for immersive and engaging app discovery experiences\n\nYou will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology to further improve Apple's hardware performance and user experience.\n\nThe people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us to help deliver the next amazing Apple product.</span>            </div>"
    },
    {
        "position": "Full Stack Web Developer (Remote, International)",
        "company": "SOCi Inc.",
        "location": {
            "city": "Unknown",
            "state": "Unknown"
        },
        "posted": "2021-04-18T04:45:55.720Z",
        "url": "https://stackoverflow.com/jobs/519652/full-stack-web-developer-remote-international-soci-inc?a=2Oh3Jh7jfKnu&so=i&pg=1&offset=4&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-05-03T04:45:55.720Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p><strong>About SOCi</strong></p>\n<p>SOCi is an award-winning all-in-one local marketing platform built specifically for \"next-level\" multi-location marketers. Our customers include top brands and influencers like Ace Hardware, Sport Clips, and Anytime Fitness who have the impossible challenge of managing their digital presence across hundreds and thousands of locations. The SOCi platform empowers local management of the entire customer journey across multiple mediums including local business listings, social, reviews, listening, ads, bots, and more. As the central command for multi-location marketers, SOCi makes the impossible possible by enabling top brands and their locations to strengthen and scale their digital presence across limitless local search and social pages while protecting what matters most, their reputation.</p>\n<p>*** This is a fully remote position; <strong>international applicants welcome!</strong></p>\n<p><strong>Full Stack Web Developer</strong></p>\n<ul>\n<li>As a member of an Empowered Product Team, you'll be accountable for deeply understanding the customer's problem, actively contributing to ideating on the solutions and measuring your impact through the results on our customers, not code written. There are no \"specs\" or top-down management here.</li>\n<li>A team consists of 2 other engineers, a UX designer and a product manager. You'll be \"mob programming\" with the other engineers, in real-time over Zoom throughout the day, while ad-hoc collaborating with the product manager and UX designer as needed.</li>\n<li>This position is fully remote, our teams are distributed across four continents. You'll be expected to observe ~6am...~4pm PST (±2) working hours (varies by team).</li>\n<li>You'll be deploying incremental slices of progress to production daily or even multiple times throughout the day; the only measure of progress is delivery of customer value to production.</li>\n</ul>\n<p><strong> Requirements</strong></p>\n<ul>\n<li>7+ years experience in building complex software systems</li>\n<li>Deep understanding of object-oriented programming, ability to articulate the pros and cons of inheritance vs composition, discuss common design patterns, their applications and common mistakes when using them</li>\n<li>Deep understanding of relational database systems (MySQL, Postgres), including normalization (pros, cons), indexing strategies for large databases (100s millions of rows), and query optimization strategies (and common pitfalls)</li>\n<li>Demonstrated track record of being able to balance making the right architectural decisions while moving fast do deliver customer value; can show examples of prior architectures built, articulate the tradeoffs and reasons for them</li>\n<li>Solid core programming skills in a couple of languages (JS, PHP preferred, but not required)</li>\n</ul>\n<p><strong>Why you’ll love it here</strong></p>\n<ul>\n<li>Fully remote, diverse international team</li>\n<li>An extremely talented group of engineers and tech leads to learn from</li>\n<li>Work directly with product and technology executives</li>\n<li>Active career coaching and professional development to keep you growing</li>\n<li>Learning budget (books, online courses)</li>\n<li>Directly see the impact of your work by working closely with customers and help build the fastest-growing mar-tech platform for top brands</li>\n</ul>\n<p><strong>What's SOCi's culture like?</strong></p>\n<p>SOCi stands for Selfless, Overachievers, Customer Centric, and Innovative. We strive to be in service to each other, consider learning as Job #1, and obsess over the customer problems such that we can deliver most valuable solutions to them. We hold each other accountable, are candid in our feedback, and expect you to do the same. It's okay to make mistakes, it's not okay to not learn from them. We partner strongly across departments and function, as we know it'll take a village to succeed. One team, one dream.</p>\n<p>SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</p>            </div>"
    },
    {
        "position": "WatchOS Internal Tools and Frameworks Engineer",
        "company": "Apple",
        "location": {
            "city": "San Diego",
            "state": "CA"
        },
        "posted": "2021-04-18T04:45:56.274Z",
        "url": "https://stackoverflow.com/jobs/526017/watchos-internal-tools-and-frameworks-engineer-apple?a=2QppnPYOEPvi&so=i&pg=1&offset=5&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "c",
            "python",
            "c++"
        ],
        "lastScraped": "2021-05-03T04:45:56.274Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nThe Apple Watch is our most personal product ever! The Apple Watch QA team is seeking a highly motivated Software Developer to build tools, frameworks and automated tests to improve the watchOS software platform. We are looking for someone who loves to dive deep into technology, build scalable tests, find bugs, and ensure an impeccable user experience. If you're passionate about Software Quality, Automation, and Performance, join the Apple Watch Engineering team and drive innovation that touches lives!<br><br><span>As a Software Developer on the Apple Watch Software team, you will join a dynamic group responsible for developing tests, tools and frameworks to test watchOS software functionality and reliability. You will be joining our team to assist with automating robust, highly reliable and complex test cases for all Apple Watch Software features covering productivity, health apps, BT/WiFi transport technologies and more.</span>            </div>"
    },
    {
        "position": "Cloud Support Associate Intern (Summer 2021)",
        "company": "Amazon Web Services",
        "location": {
            "city": "Dallas",
            "state": "TX"
        },
        "posted": "2021-04-13T04:45:57.005Z",
        "url": "https://stackoverflow.com/jobs/523809/cloud-support-associate-intern-summer-2021-amazon-web-services?a=2PFuVdchtWQo&so=i&pg=1&offset=6&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "cloud",
            "linux"
        ],
        "lastScraped": "2021-05-03T04:45:57.005Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nNOTE: By applying to this position, your application will be considered for all Cloud Support Associate Intern roles in Dallas, TX and Herndon, VA.<br><br>Amazon Web Services (AWS) is the market leader and technology forerunner in the cloud business. As an intern with the AWS Cloud Support team you will participate in a training program, preparing you to be at the forefront of this transformational technology, assisting a global list of companies and developers utilizing a growing set of services and features to run their mission-critical applications. As a future cloud support engineer, you will act as the ‘cloud ambassador’ across all the cloud products, arming our customers with required tools and tactics to get the most out of their product and support investment.<br><br>Amazon Web Services is looking for highly talented and technical interns to help accelerate our growing Cloud Support business. This is an excellent opportunity to join Amazon’s world class technical teams, working with some of the best and brightest engineers while also developing your skills and furthering your career within one of the most innovative and progressive technology companies.<br><br>You’ll be learning about the services of AWS, the tools and technologies utilized by AWS customers, and following a simulation of our environment to gain insight into providing expert technical support to organizations all across the globe. You will benefit from the opportunity to gain experience on our cloud services, hands on training, and learning as you go.<br>If you fit the description, you could be the person we are looking for. We are a group of smart people, passionate about cloud computing, and believe that world-class support is critical to customer success. Come build the future with us.<br><br><br>What you will do: This is a training program and simulation of the Cloud Support role in the Cloud. As an Amazon intern, you will be interacting with your peers and the AWS global team of full-time professionals as part of our AWS Cloud Support team. You’ll be learning about some of AWS’s top services, including EC2, load balancers, and S3 storage solutions; the tools and technologies utilized by AWS customers; and following a simulation of our environment to gain insight into providing expert technical support to organizations all across the globe. You will benefit from the opportunity to gain experience on our cloud services, hands on training, and learning as you go.<br><br><br>· Learn and use groundbreaking technologies.<br>· Collaborate with AWS engineers and interns in a virtual classroom to learn about AWS services and troubleshooting techniques. You’ll have an opportunity to apply your new skills through customer case simulations.<br>· Interact with leading engineers around the world.<br>· Work with a mentor during your internship.<br>· Work on a group presentation to be delivered to senior leadership.<br>· Network with other AWS interns and employees to learn about Amazon’s peculiar culture and opportunities to grow.<br><br><br>            </div>"
    },
    {
        "position": "Senior Software Engineer - Web and International QA Team",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-04-09T04:45:59.217Z",
        "url": "https://stackoverflow.com/jobs/438809/senior-software-engineer-web-and-international-audible?a=2na6iyOFxJ28&so=i&pg=1&offset=7&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "amazon-web-services",
            "qa",
            "testing"
        ],
        "lastScraped": "2021-05-03T04:45:59.217Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nAre you a software engineer passionate about optimizing development and testing lifecycle via bringing in new testing methodologies, tools and process automation? Our team at Audible, ensures quality of Audible’s website applications (across International market places) and services for our global listeners. We are the home for tech talent that wants to grow Audible’s market leading business and help to deliver superior customer experience across desktop and mobile devices in an efficient and optimized manner using latest tools and processes. The team is comprised of QA engineers and developers who work in an agile environment and partner closely with Audible and Amazon tech teams - Product, UX and Dev.<br><br>As a Software Development Engineer at Audible Web and International team, you will be acting as Quality Engineering enabler by leading test automation and infrastructure development, and driving automated testing. You will be responsible for implementing new and best industry practices towards improvements across our stack which will provide you an opportunity for learning and career growth.<br><br>You will partner with Quality Assurance Engineers, Developers, and Product Managers to enable our QAEs and SDEs to deliver faster with high quality outcomes. You will be staying current in the latest trends in technology and have a desire to lead adoption of innovative practices and play a major role in transformation journey across the organization.<br><br><br>HOW DOES AMAZON FIT IN?<br>We're a part of Amazon: they are our parent company and it's a great partnership. You'll get to play with Amazon's technologies, but it doesn't stop there. Audible is built on a strong foundation of Amazon technology and you'll have insight into the inner workings of the world's leading eCommerce experience. There's a LOT to learn! Your career will benefit from working with teams like Alexa, Search, Kindle, A9, P13N and many more.<br><br>If you are excited to own and solve problems, work with a creative dynamic team, fail fast in a supportive environment while growing your career and delivering high quality features to millions of customers worldwide, we want to hear from you.<br><br>KEY RESPONSIBILITIES<br>· Capable of independently clarifying technical requirements, assessing development estimates and applying a broad range of design approaches.<br>· Able to use technology to solve difficult problems. Able to define a design, turn it into high quality code, and deliver it on schedule. Proficient in a broad range of data structures and algorithms, knowing when it is (and isn’t) appropriate to use them.<br>· Drive continuous improvement of software quality, CX and maintainability of products/features.<br>· Develop the best automation and tooling, drive testability and diagnostic ability into the product, while promoting best practices in quality areas.<br>· Define and Develop standards and frameworks to ensure most efficient processes and highest level of quality, as well as design tools for unit, functional, performance and security testing in a programmatic manner.<br>· Build test software that exposes API defects in production level code as well as defects at the component and feature integration prospective.<br>· Innovate and drive adoption of latest industry best practices.<br>· Programmatically test the product, Measure test coverage and Develop right metrics to showcase value add based on adoption of new best practices.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· Bachelor’s degree in Computer Science or related field, or equivalent experience.<br>· Able to write and enforce logical and maintainable code.<br>· Able to provide code reviews and assess an existing software application, correctly identify enhancements that can be made to improve it.<br>· Proven ability to identify and resolve the root cause of software defects.<br>· Experience in designing and building test tools and systems.<br>· Experience with scripting languages (Perl/Ruby/Python, JavaScript, etc.).<br>· Knowledge of HTML, CSS, JavaScript, XML, and web client technologies.<br><br>Preferred Qualifications<br><br>· Expert level with Java/C++ or other OO languages.<br>· Understanding of QA Methodologies and software life cycle.<br>· Understanding of application architecture and technology infrastructure<br>· Experience with test and behavior driven development.<br>· Understanding of Continuous Integration and Deployment processes.<br>· Experience with but not limited to JUnit/TestNG, JBehave (or other BDD framework), Selenium, mock objects.<br>· Problem-solving skills with the ability to navigate highly complex and ambiguous situations.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br>            </div>"
    },
    {
        "position": "JAVA Full Stack Web Application Developer – Entry Level & Internships",
        "company": "LBi Software",
        "location": {
            "city": "Melville",
            "state": "NY"
        },
        "posted": "2021-04-25T04:45:59.954Z",
        "url": "https://stackoverflow.com/jobs/521892/java-full-stack-web-application-developer-entry-lbi-software?a=2P1DBA8o3JL2&so=i&pg=1&offset=8&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [],
        "lastScraped": "2021-05-03T04:45:59.954Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>LBi Software is looking for an entry level Java Full Stack Web Application Developer. Candidates will be working on a team to design and develop custom enterprise web applications.  LBi Software develops custom applications both <a href=\"http://lbidynasty.com/\" rel=\"nofollow\" target=\"_blank\">sports leagues/teams </a> and <a href=\"https://www.lbisoftware.com/about-us\" rel=\"nofollow\" target=\"_blank\">HR Enterprise Software</a> markets.  Candidates must be self-starters and able to follow written and verbal direction working with a technical team leader. They must be able to produce well-documented and efficient code and possess the communication skills necessary to explain complex technical information. The position requires strong interpersonal and communication skills. The position requires strong knowledge of software architecture, development, database design, unit testing, continuous integration, continuous delivery, and QA processes.</p>\n<p>LBi is also looking for internships and co-ops with the same skillset. </p>\n<p>Qualified candidates will join a team utilizing agile methodologies towards software development and delivery. Team sizes vary roughly from 2-10 developers, who will work in 1-3 week sprints.</p>\n<p><strong>Required technical skills:<br></strong>Java or .NET(C#), REST Services, HTML, Angular, CSS/SCSS, Bootstrap, Junit, SQL, Database Design</p>\n<p><strong>Additional skills a plus:<br></strong>JSpring Framework, J2EE technologies, MyBatis, .NET Core, EF Core, UI/UX design, Responsive Design, SASS/LESS, React, Node, Tomcat, Jenkins, Docker, Kubernetes, Agile Process, Smartphone/Tablet App Development (iOS, Android), Business Objects, ETL, Crystal Report, database reporting tools, Apache Spark, DB2, Oracle, MySQL, MariaDB, PostgreSQL, SQL Server</p>\n<p>For more information see <a href=\"https://www.lbisoftware.com/careers\" rel=\"nofollow\" target=\"_blank\">https://www.lbisoftware.com/careers</a> and <a href=\"http://lbidynasty.com/\" rel=\"nofollow\" target=\"_blank\">http://lbidynasty.com/</a></p>\n<p>Send Resume and Cover letter to <a rel=\"nofollow\" target=\"_blank\"></a><a href=\"mailto:Resume@LBiSoftware.com\">Resume@LBiSoftware.com</a></p>            </div>"
    },
    {
        "position": "Senior Quality Assurance Engineer – Web and International",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-04-15T04:46:00.953Z",
        "url": "https://stackoverflow.com/jobs/486356/senior-quality-assurance-engineer-web-and-audible?a=2D6JUB0xQtVe&so=i&pg=1&offset=9&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "qa",
            "reactjs",
            "testing"
        ],
        "lastScraped": "2021-05-03T04:46:00.953Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nGood storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>Audible’s Quality Assurance organization promotes product quality, and organizational quality ownership thru well-defined measurable processes, comprehensive quality assessment and identification of risk. In addition, the organization provides tools and infrastructure needed to support agile feature delivery, improve quality and increase engineer productivity. The team includes Quality Assurance Engineers, Quality Assurance Technicians and Software Engineers working side by side with Software Development Engineers, Product Managers, User Experience, and Customer Support staff to understand features, bugs, customer usage, and technical implementation to deliver high quality products to our customers.<br><br>Audible Web &amp; Internationalization (i18n) QA team is responsible for validating Customer Experiences across all of the US and International marketplaces, and supporting Audible Business, Marketing and Engineering teams to expand Audible’s presence into various marketplaces. Customer Obsession principle is in our DNA to advocate for and enhance the Customers’ Experiences on Audible and Amazon platforms including Web, Mobile and Native Apps. We simulate and continuously improve the Customers’ End to End journey by delivering high quality consumer facing products.<br><br><br>KEY RESPONSIBILITIES<br>· Drive the creation and execution of test strategy, test plans, test cases as well as utilize automated tools to optimize the STLC.<br>· Perform exploratory testing, automate repetitive tasks and work side by side with software development engineers to deliver high quality product to Audible customers.<br>· Review user interfaces for conformity and functionality.<br>· Efficiently execute test cases across all functional and UI areas of our products.<br>· Find, isolate, document, regress, and track bugs through resolution.<br>· Measure, interpret and report testing results, and be a vocal proponent for quality in every phase of the development process.<br><br>Basic Qualifications<br><br>· 4+ year of experience working as a Quality Assurance Engineer or SDET.<br>· Hands on experience with test automation using a programming or scripting language (Java or Python preferred).<br>· Experience owning the full test strategy through test completion for major components of a software systems.<br>· Communication skills – ability to communicate cross-functionally and across management levels in formal and informal settings.<br><br><br><br><br>Preferred Qualifications<br><br>· Bachelor's Degree in Computer Science or related fields.<br>· Solid grounding in computer science fundamentals.<br>· Must be able to thrive in an ambiguous environment - where change is the only constant.<br>· Ability to triage issues, react well to changes, collaborate with other test and development teams.<br>· Must be an effective multi-tasker comfortable working on multiple products and projects.<br>· Experience in testing and test automation for consumer facing applications and devices.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of audio storytelling and spoken-word entertainment, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br><br><br>            </div>"
    },
    {
        "position": "Senior Full Stack Development Engineer - International Expansion",
        "company": "Audible",
        "location": {
            "city": "Newark",
            "state": "NJ"
        },
        "posted": "2021-05-01T04:46:01.724Z",
        "url": "https://stackoverflow.com/jobs/525968/senior-full-stack-development-engineer-audible?a=2Qoo3nP7FOSs&so=i&pg=1&offset=10&total=11&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "design",
            "user-interface",
            "java"
        ],
        "lastScraped": "2021-05-03T04:46:01.724Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nGood storytelling starts with great listening. At Audible, that means each role and every project has our audience in mind. Because the same people who design, develop, and deploy our products also happen to use them. To us, that speaks volumes.<br><br>About the team<br>Audible International Expansion team is delivering on a vision for launching a localized, customer-centric presence in new countries while building world class engineering platform to enable faster and differentiated launches. We are expanding and improving the platform from mobile web to back-end services while innovating and leveraging new Amazon technology and platforms. Success means we are delighting more customers in new countries while building on an already tremendously successful and much-loved product.<br><br>About you<br>You are an innovative and passionate top software engineer looking to make a positive impact on customer experience. You like to own deliverables end-to-end and have a meaningful influence on the final product. You are a builder. You like to work with fellow engineers and product people to share knowledge, imagine, design, develop, test, and launch software that wows our community and inspires our peers. You're curious and love to learn unprompted as you stay up to date with tools, trends, technologies and best practices in the industry. Please don't hesitate to apply!<br><br>As a Software Developer II, you will:<br>· Partner with cross-functional teams to imagine, design, develop, test, and launch software that impacts our community and inspires your peers.<br>· Set the technical direction and strategy within a team and strategize to influence technology across Audible and beyond.<br>· Work with your team to invent, design and build software that is stable and performant.<br>· Proficient in a broad range of design approaches and know when it is appropriate to use each.<br>· Solve difficult problems of diverse scope where analysis of data requires evaluation of identifiable factors, demonstrating sound judgment in selecting methods and techniques for obtaining solutions.<br>· Capable of independently clarifying technical requirements, developing coding estimates and applying a broad range of design approaches to bring innovative solutions to the table.<br>· Review code of other team members and provide constructive direction.<br>· Constantly strive to raise the bar on engineering excellence.<br>· Drive continuous improvement of software quality, CX and maintainability of products/features.<br>· Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.<br>· Mentor and lead developers by cultivating curiosity and deep technical understanding.<br>· Additional duties as assigned.<br><br>Basic Qualifications<br><br>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>· 2+ years of non-internship professional software development experience<br>· Bachelor’s degree in Computer Science or related field, or equivalent experience.<br><br>Preferred Qualifications<br><br>· Able to provide a code review, assess an existing software application and correctly identify where enhancements may be made to improve it, identify and resolve the root cause of software defects.<br>· Experience navigating highly complex and ambiguous situations.<br>· Past mentorship of other engineers within an organization, showing mutual growth.<br>· Experience building software systems that have been successfully delivered to internal or external customers.<br>· Ability to think creatively and adapt the message to the audience. Can provide information to technical and non-technical stakeholders alike and guide them to confidently informed decisions.<br>· Able to design, implement, and deploy software components and features, and solve difficult problems.<br>· Able to work independently and with your team to deliver software successfully.<br>· Able to establish good working relationships with peers. Able to recognize discordant views and take part in constructive dialogue to resolve them.<br>· Able to confidently train new team-mates about your customers, what the team’s software does, how it is constructed, tested, operates, and how it fits into the bigger picture.<br>· Knowledgeable about a broad range of design approaches and when to use them (and when to not).<br>· Understand the legacy of coding decisions. Know when a short-term workaround is a problem and when to limit this type of solution and the implications of adding new dependencies.<br><br>ABOUT AUDIBLE<br>At Audible, we innovate and inspire through the power of voice. We're changing the narrative on storytelling. As a leading producer and provider of original spoken-word entertainment and audiobooks, we've redefined the ways people access, discover, and share stories. The stories we tell have the ability to transport and transform everyday moments into meaningful experiences and it's our people who make Audible's service possible. We're listeners, storytellers, and problem-solvers. Our perspectives and experiences power our ideas and come together in our mission to unleash the power of the spoken word.<br><br>Audible is committed to a diverse and inclusive workplace. Audible is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit <a href=\"https://www.amazon.jobs/en/disability/us\" rel=\"nofollow\" target=\"_blank\">https://www.amazon.jobs/en/disability/us</a>.<br>            </div>"
    }
]