[
    {
        "position": "Technical Internship: Machine Learning/AI Engineering & Research Internship",
        "company": "Apple",
        "location": {
            "city": "Tokyo",
            "state": "Japan"
        },
        "posted": "2021-09-14T01:30:51.048Z",
        "url": "https://stackoverflow.com/jobs/550222/technical-internship-machine-learning-ai-apple?a=2YwHsI21zmqA&so=i&pg=1&offset=0&total=1&so_medium=Internal&so_source=JobSearch&q=internship",
        "skills": [
            "python",
            "machine-learning"
        ],
        "lastScraped": "2021-09-27T01:30:51.048Z",
        "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nImagine what you could do here? At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Every role at Apple is crafted around our intention to leave the world a better place than we found it! \nApple is seeking highly qualified people for the position of AI/ML Engineer and AI/ML Researcher on the Global Product Experience team. The team pursues advancement of the end-to-end experience of Siri Japanese users through improving machine learning (ML) in areas of deep learning (DL) and Natural Language Processing (NLP). As a member of the team, you will work on some of the most ambitious technical problems, develop new and/or extend existing ML solutions that will impact future Apple products, and collaborate with the best product teams to integrate your ideas into products.<br><br><span>You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.</span>            </div>"
    }
]