[
    {
        "position": "Systems Reliability Engineer - 2022 Summer Internship",
        "company": "Nutanix",
        "location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c60cf931715780c4410475f5bf5f4aad?lvk=WJ82yDOhMLA8KpXwBlCfWg.--MBaWpXnz3",
        "posted": "2021-09-16T18:35:25.796Z",
        "lastScraped": "2021-09-23T18:35:25.796Z",
        "description": "<div><div><p>The Systems Reliability Engineering (SRE) team acts as our customer's champion and provides top level customer support. The team supports our customers and systems in the field to provide an enriched and successful product experience.&nbsp;<br><br>This is a full-time summer internship starting in May / June 2022.</p><p><strong>Responsibilities:</strong></p><ul><li>Work technical cases independently and as a team. This will include remotely troubleshooting customer's technical issues, searching documentation, testing features, and collaborating with our technology partners.</li><li>Assist SREs with recreates and lab set-up.</li><li>Validate and review knowledge base articles, under direction of a mentor.</li><li>Create and update engineering tickets based on feedback from customers and partner implementations</li><li>Create and review internal documentation. This can include new hire documents, training documents and problem determination documents.</li></ul><p><strong>Requirements:</strong></p><ul><li>Currently pursuing a Bachelors or Masters in Engineering or related field</li><li>Excellent verbal and written communication skills, problem solving skills, customer service and interpersonal skills.</li><li>Understanding of networking, virtualization, or Linux required. Understanding of all three preferred.</li><li>The passion &amp; ability to learn new things, while never being satisfied with the status quo.</li><li>Internship will be in-person in Durham and San Jose if indicated safe by CDC guidelines. If virtual, willingness to work east coast business hours (8am to 5pm ET) for Durham location, west coast business hours (8am to 5pm PT) for San Jose location.</li></ul><p><strong>Qualifications and Experience:</strong></p><p>Must be currently enrolled in a Bachelor's or Master's degree program in Networking, Systems Administration, Computer Information Technology, Computer Science, or a related discipline.<br><br>~~~~~~~~~~</p><p><b>About us</b><br> Founded in 2009 and headquartered in San Jose, California, Nutanix is a passionate team of 6000+ employees worldwide. Our people (we call ourselves \"Nutants\") are the heartbeat of #LifeAtNutanix&nbsp;and one of the many things that makes Nutanix a great place to work at. We share an intellectual curiosity, a bias for action, and an obsession for our customers. We are builders and problem solvers with an entrepreneurial spirit. Above all, we celebrate what makes each of us unique.<br><br> We are humbled to be recognized as one of Bloomberg's Top 50 Companies to Watch in 2020and one of the Fortune 100 Best Companies to Work For 2020.<br><br> We're growing fast and disrupting the computing industry. Join us and make your mark.<br><br><strong>About our business</strong><br> Nutanix is a global leader in cloud software and a pioneer in hyperconverged infrastructure solutions, making computing invisible anywhere. Companies around the world use Nutanix software to leverage a single platform to manage any app, at any location, at any scale for their private, hybrid, and multi-cloud environments.<br><br><b>We're an equal opportunity employer</b><br> Nutanix is an Equal Employment Opportunity and (in the U.S.) an Affirmative Action employer. Qualified applicants are considered for employment opportunities without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, marital status, protected veteran status, disability status, or any other category protected by applicable law. We hire and promote individuals solely on the basis of qualifications for the job to be filled.<br><br> We strive to foster an inclusive working environment that enables all our Nutants to be themselves and to do great work in a safe and welcoming environment, free of unlawful discrimination, intimidation, or harassment. As part of this commitment, we will ensure that persons with disabilities are provided reasonable accommodations. If you need a reasonable accommodation, please let us know by contacting&nbsp;<b>[email&nbsp;protected]</b></p><p>&nbsp;</p><p>--</p></div></div>"
    },
    {
        "position": "Software Engineer Undergrad Internship",
        "company": "Intel",
        "location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5f814a05ba807531cecea3a6146a3606?lvk=GQAxNBd9l9pO0aSYybCDJg.--MBanXnr4V",
        "posted": "2021-09-17T18:35:27.819Z",
        "lastScraped": "2021-09-23T18:35:27.819Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>Responsibilities may be quite diverse of a nonexempt technical nature. U.S. experience and education requirements will vary significantly depending on the unique needs of the job. Job assignments are usually for the summer or for short periods during breaks from school. Responsibilities may be quite diverse of a software technical nature.</p><p></p><p>Experience and education requirements will vary significantly depending on the unique needs of the job. Job assignments are usually for the summer or for short periods during breaks from school.</p><p></p><p>Responsibilities may include, but are not limited to: Candidate will creatively apply the technical know-how (engineering fundamentals, scientific knowledge, systems thinking, analytical thinking, prototyping, and testing knowledge) against design constraints and boundary conditions (industrial design, cost, performance criteria and other design constraints) to research, develop and demonstrable solutions. Can grasp the big picture to convert research into requirements and execute to completion.</p><p></p><p><b>The ideal candidate should exhibit the following behavioral traits:</b></p><ul><li><p>Self-motivated individual willing to take and follow directions and deliver to schedule</p></li><li><p>Strong verbal &amp; written communication and interpersonal skills</p></li><li><p>Strong quantitative, analytical, and problem solving skills, problem/conflict resolution skills</p></li><li><p>Effective prioritization and time management skills</p></li></ul><p></p><p>Length of internship: Minimum of 3 months with the possibility to extend it as per business' needs.</p><p></p><p></p><b>Qualifications:</b>Qualifications<p>Candidate must possess minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school <span class=\"long-word\">work/classes/research</span> and/or relevant previous job and/or internship experiences. This is an entry level position and will be compensated accordingly.</p><p></p><p>This position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience.This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience.</p><p></p><p><b>Minimum Qualifications:</b></p><p>Candidate must be pursuing a BS in a Computer Science, Computer Engineering, Mathematics, or other related engineering program.</p><p></p><p>Minimum 3+ months of experience or equivalent coursework in the following areas:</p><ul><li><p>Software Validation Testing</p></li><li><p>Programming skills in one or more languages like C, C++, C, Perl, Python, SQL</p></li><li><p>Knowledge of Linux/Android operating systems- Intel architecture, BIOS and device drivers</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><p>Minimum 3+ months of experience or equivalent coursework in the following areas:</p><ul><li><p>Algorithms, Data-structures, Operating Systems internals, Computer System Organization</p></li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, California, Santa Clara<p></p><p></p>Additional Locations:Virtual US and Canada<p></p><p></p><p></p><p></p>Business group:Employees of the Internet of Things Solutions Group (IOTG) have an exciting opportunity before them: To grow Intel's leadership position in the rapidly evolving IoT market by delivering the best silicon, software and services that meet a wide range of customer requirements - from Intel Xeon to Intel Quark. The group, a fresh, dynamic collaboration between Intel's Intelligent Solutions Group and Wind River Systems, utilizes assets from across all of Intel in such areas as industrial automation, retail, automobiles and aerospace. The IOTG team is dedicated to helping Intel drive the next major growth inflection through productivity and new business models that are emerging as a result of IoT.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A<p></p><p>Annual Salary Range for jobs which could be performed in US, Colorado:</p>$52,000.00-$147,000.00 (Hourly Role)<p></p><p><b>Benefits:</b></p><p>We offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, and benefits programs. Find out more information about our Amazing Benefits here.</p></div></div>"
    },
    {
        "position": "System Validation Engineer Undergraduate Internship",
        "company": "Intel",
        "location": {
            "city": "Hillsboro",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/682f77b36a3b4861accafe4cee5bbc13?lvk=7GQpQqUU3EbS-sEdrrq_Bw.--MBamnW2jV",
        "posted": "2021-09-15T18:35:30.825Z",
        "lastScraped": "2021-09-23T18:35:30.825Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>Responsibilities may be quite diverse of a technical nature. U.S. experience and education requirements will vary significantly depending on the unique needs of the job.</p><p></p><p>Responsibilities may include, but are not limited to:</p><p></p><p>Applicants will creatively apply the technical know-how (engineering fundamentals, scientific knowledge, systems thinking, analytical thinking, prototyping, and testing knowledge) against design constraints and boundary conditions (industrial design, cost, performance criteria and other design constraints) to research, develop and productive mass producible solutions.<br><br>The ideal candidate should exhibit the following behavioral traits:</p><ul><li><p>Self-motivated individual willing to take and follow directions and deliver to schedule</p></li><li><p>Strong communication and interpersonal skills</p></li><li><p>Strong quantitative, analytical, and problem-solving skills, problem/conflict resolution skills</p></li><li><p>Effective prioritization and time management skills</p></li><li><p>Willingness to motivate the team to deliver</p></li></ul><p><br>Length of internship: 3 months with the possibility to extend it as per business needs.</p><p></p><p></p><b>Qualifications:</b><p>Minimum qualifications are required to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your <span class=\"long-word\">schoolwork/classes/research</span> and/or relevant previous job and/or internship experiences.</p><p></p><p>This is an entry level position and it will be compensated accordingly.</p><p></p><p><b><i>This position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience.This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience.</i></b><br><br><b>Minimum Qualifications:</b></p><p></p><p>Candidate must be pursuing a Bachelor's degree in Electrical Engineering, Computer Systems Engineering or Computer Science.</p><p></p><p>3+ months of experience or equivalent coursework in some of the following areas:</p><ul><li><p>OS, BIOS, and Hardware/Software interactions</p></li><li><p>Scripting languages such as Python or PERL</p></li></ul><p><br><b>Preferred qualifications:</b></p><p></p><p>3 + months of experience or equivalent coursework in the following areas:</p><ul><li><p>Oscilloscopes, Signal analyzers and other test tools</p></li><li><p>Test development and <span class=\"long-word\">validation/triage/debug</span> environment</p></li><li><p>Firmware development and validation</p></li></ul><p></p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, Oregon, Hillsboro<p></p><p></p>Additional Locations:Virtual US and Canada<p></p><p></p><p></p><p></p>Business group:The Data Platforms Engineering and Architecture (DPEA) Group invents, designs &amp; builds the world's most critical computing platforms which fuel Intel's most important business and solve the world's most fundamental problems. DPEA enables that data center which is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies-spanning software, processors, storage, I/O, and networking solutions-that fuel cloud, communications, enterprise, and government data centers around the world.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A<p></p><p>Annual Salary Range for jobs which could be performed in US, Colorado:</p>$52,000.00-$147,000.00 (Hourly Role)<p></p><p><b>Benefits:</b></p><p>We offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, and benefits programs. Find out more information about our Amazing Benefits here.</p></div></div>"
    },
    {
        "position": "Internships",
        "company": "Dis-Tran",
        "location": {
            "city": "Pineville",
            "state": "LA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/becc55cd5b81b60186bc4c6ba5c6468a?lvk=PanuDfbZfm-TqQVz-xSWPA.--MBd1FkF4k",
        "posted": "2021-09-11T18:35:32.865Z",
        "lastScraped": "2021-09-23T18:35:32.865Z",
        "description": "<div><div><p>Crest Industries has openings for internships in Pineville, LA within our various business units. &nbsp;Fields include, but are not limited to, the following:</p><ul><li>Civil Engineering</li><li>Electrical Engineering</li><li>Mechanical Engineering</li><li>Computer Science</li><li>Engineering Technologies</li><li>Project Management</li><li>Estimating</li><li>Accounting</li><li>Human Resources</li><li>Finance</li><li>Drafting and Design</li><li>Manufacturing</li><li>Marketing</li></ul><p>Junior or Senior level class status is preferred.</p><p>Crest Industries offers paid internships and provides our intern with exposure to a variety of projects and technical skills. &nbsp;We have set agreements with local colleges and housing facilities for month-to-month rentals for the course of internships.</p><p>&nbsp;</p><p>Crest Industries is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information.</p><p>Crest Industries is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request information regarding reasonable accommodation, contact your Human Resource Business Partner.</p><p>&nbsp;</p></div></div>"
    },
    {
        "position": "Mobile Developer Intern",
        "company": "Del's Feed & Farm Supply",
        "location": {
            "city": "Brentwood",
            "state": "TN",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/299d6ea1bfe76ba32b7e2b7541de502a?lvk=MiBa40X89erb9C0adMb8YQ.--MBdBwoiew",
        "posted": "2021-09-07T18:35:33.872Z",
        "lastScraped": "2021-09-23T18:35:33.872Z",
        "description": "<div><div><p>Overview </p><p>This&nbsp;<strong>Summer 202</strong><strong>2</strong><strong> Internship</strong>&nbsp;will be a 12-week internship starting on May 16th, 2022 and ending on August 5th, 2022. Working at our Store Support Center in Brentwood, Tennessee, as an intern, you will work alongside TSC professionals in a variety of areas to make a real impact on our business. You will have the opportunity to work on projects in the department, get exposure to day-to-day operations and have a successful and meaningful internship.</p><p>&nbsp;</p><p>Bring your ambition, enthusiasm and big ideas to this internship and you will have a great experience!</p> Responsibilities <p><strong>Projects you will be working on will include:</strong></p><ul><li>Mobile app development knowledge or corresponding courses</li><li>Knowledge of simple styling changes</li><li>Knowledge of JavaScript changes</li><li>Basic component development</li></ul> Qualifications <ul><li>Java or similar high level development language use.</li><li>Willingness to learn JavaScript</li><li>Interest in mobile development</li><li>Pursuing computer science / software engineering or equivalent major</li><li>Familiarity with mobile devices</li><li>Problem solving skills</li><li>Willingness to try new things outside of their comfort zone.</li></ul> Company Overview <p><strong><em>Tractor Supply Company (TSCO),</em></strong><em> the largest rural lifestyle retailer in the United States, is dedicated to enhancing our strong company culture built on our Team Members' commitment to our Mission and Values.&nbsp; With over 1,900 stores in 49 states and an innovative e-commerce platform, Tractor Supply ranks in the Fortune 400 with annual revenues of more than 11 billion and growing! Come grow your career with us as we serve those who live <strong>\"Life out Here\"!</strong></em></p><p>&nbsp;</p><p>Click Here to See Why We are a Great Place to Work!</p><p>&nbsp;</p><p><strong>Tractor Supply Company</strong> offers a competitive Benefits package, including Medical, Dental, &amp; Vision plans, to all Full-time Team Members as well as Part-time Team Members who are deemed eligible based on a minimum hours requirement. In addition, TSC offers access to other Benefits such as a Health Savings Account, Life Insurance, 401(k), and an Employee Stock Purchase Plan.</p></div></div>"
    },
    {
        "position": "Bridge Engineering Internship 2022",
        "company": "Hanson Professional Services",
        "location": {
            "city": "Peoria",
            "state": "IL",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/480a370cff1d98b8059a1a06142234ef?lvk=ZFVjm0HWADFLVVmw5AGUxQ.--MBapJQC7-",
        "posted": "2021-09-16T18:35:35.430Z",
        "lastScraped": "2021-09-23T18:35:35.430Z",
        "description": "<div><div><p>Hanson Professional Services Inc. is a dynamic, employee-owned engineering consulting firm of more than 400 employees providing a full range of multi-disciplined engineering, scientific, and allied services throughout the USA.</p><p></p><p><b><i>We are proud to be a great place to work and a top company for internships!</i></b></p><ul><li>#18 in the multidiscipline category in the Zweig Group Best Firms to Work For.</li><li>#2 Best Places to Work in Illinois</li><li>#4 Best Places to Work in Florida.</li><li>#3 for Best Internships for Engineering</li><li>#8 for the Best Tech and Engineering Internships</li><li>#21 for Best Internship for compensation &amp; benefits</li><li>Check out our Vault rankings HERE</li></ul><p></p><p>Hanson is seeking candidates for our <b>Bridge Engineering 2022 Internship</b> programs. We have potential opportunities in the following locations: Peoria, IL; Kansas City, MO; Lisle, IL; Springfield, IL; and St. Louis, MO.</p><p></p><p>Our <b>Bridge Engineering</b> discipline is made up of Structural engineers, designers and technicians design bridges and related structures for both public-sector and private-sector projects. Areas of specialty within the discipline include a focus on roadway bridge structures and rail bridge structures. Typical project types include local and state highway bridges, river crossing bridges, bridge rehabilitations and bridge condition ratings.</p><p></p><p><b><i>Click </i></b><b><i>HERE</i></b><b><i> to see examples of Hanson's Bridge Engineering projects. </i></b></p><p></p><p>General Assignments: Interns will perform routine <b>bridge engineering</b> tasks using standard procedures under supervision of Registered Structural and Professional Engineers and may assist Hanson engineers, designers, and technicians in disciplines related to their field of study.</p><p></p><p>Interns will typically support one or more experienced professional staff in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of <b>bridge engineering</b>. Interns may perform and/or participate in additional activities/events which help them build a strong network within the Hanson community and with fellow interns. Internships may require travel to suppliers, customers, or other Hanson locations.</p><p></p><p></p><p><b>Key Responsibilities: Bridge Engineering interns will be expected to perform the following key responsibilities with assistance from a Hanson <span class=\"long-word\">Professional/Structural</span> Engineer:</b></p><p></p><ul><li>Assist in preparing plans, designs, specifications, and cost estimates.</li><li>Gathering and/or providing data for the preparation of engineering reports and studies.</li><li>Assist and participate in the inspection of in-service bridges and structures.</li><li>Conduct observation and documentation of construction activity.</li><li>Conduct evaluation of construction for compliance with contract documents.</li><li>Performing and/or reviewing calculations or reports such as those related to bridge design, foundation engineering, and quantities.</li><li>Utilize engineering software packages such as MicroStation, RISA, STAAD, etc.</li><li>Performing related duties such as writing memoranda, letters, or general reports; writing legal descriptions; collecting and correlating engineering data; maintaining records; attending meetings; and operating technical equipment.</li></ul><p></p><p><b>Qualifications: </b></p><p></p><p>Intern must be actively enrolled in a Civil Engineering, Structural Engineering, or relevant field of study. The ideal candidate will have successfully completed their sophomore year and be actively enrolled in an accredited 4-year college or university.</p><p></p><p><b>Key requirements are listed but not limited to the following:</b></p><ul><li>Strong written and oral communication skills</li><li>Strong analytical skills</li><li>Knowledge of Microsoft Office</li><li>Valid driver's license</li></ul><p></p><p></p><p></p><p></p><p>As <span class=\"long-word\">employers/governmental</span> contractors, we comply with government regulations, including affirmative action responsibilities where they apply. To assist us in meeting our affirmative action goals, employees are encouraged to refer minorities, women, individuals with disabilities and veterans.</p><p></p><p></p><p>AN EQUAL OPPORTUNITY - AFFIRMATIVE ACTION EMPLOYER</p><p>EEO / MINORITY / FEMALE / INDIVIDUALS WITH DISABILITIES / VETERANS</p><p></p></div></div>"
    },
    {
        "position": "R&D - Internship",
        "company": "BD",
        "location": {
            "city": "Salt Lake City",
            "state": "UT",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/86add3fe8859a2436843125fea653b6d?lvk=n-2xecBWzpxnTf-DQrNwNg.--MBap0yFtw",
        "posted": "2021-09-21T18:35:37.560Z",
        "lastScraped": "2021-09-23T18:35:37.560Z",
        "description": "<div><div><p>Job Description SummaryThis temporary position assists with R&amp;D engineering activities and performs tasks associated with those activities.</p><p></p><p></p>Job Description<p><b>Be part of something bigger!</b></p><p>BD is one of the largest global medical technology companies in the world and is advancing the world of health by improving medical discovery, diagnostics and the delivery of care. We have over 65,000 employees and a presence in virtually every country around the world to address some of the most challenging global health issues.</p><p></p><p><b>Summary of Position with General Responsibilities</b></p><p><i>The following duties and responsibilities are intended to be representative of the work performed by the incumbent(s) in this position and are not all-inclusive. The omission of a specific duty or responsibility will not preclude it from the position.</i></p><p></p><p><b>SCOPE</b></p><p>This internship position is for a candidate that is available for part time work (15-20 hrs/wk) throughout the year and requires the candidate be local to the greater Salt Lake City, UT area.</p><p></p><p><b>POTENTIAL TASKS AND ASSIGNMENTS</b></p><p>1. Initiates new or revised documentation and tracks through appropriate approval cycles and implementation</p><p>2. Maintains a professional working relationship with internal &amp; external team members</p><p>3. Participates on cross-functional teams</p><p>4. Provides technical support on components, material methods, systems and equipment</p><p>5. Assists in developing physical and functional test requirements to assure specifications &amp; regulations are met</p><p>6. Writes and reviews protocols, reports and data</p><p>7. Conducts testing outlined in protocols and test methods</p><p>8. Executes validation studies on equipment &amp; processes</p><p>9. Executes design controls</p><p>10. Analyzes design inputs</p><p>11. Trains on, understands and follows company procedures and regulatory requirements</p><p>12. Participates in and provides input to training on department &amp; division procedures, and policies</p><p>13. Prepares and presents oral and written project updates and technical discussions</p><p></p><p><b>KNOWLEDGE AND SKILLS:</b></p><p>1. Basic Technical writing skills</p><p>2. Basic interpersonal skills - active listening</p><p>3. Ability to read drawings</p><p>4. Good understanding of engineering principles</p><p>5. Demonstrated ability to apply engineering principles</p><p>6. Ability to perform testing per written directions</p><p>7. Demonstrated comprehension of basic descriptive statistics</p><p>8. Basic Software application skills</p><p>9. Basic problem solving skills</p><p>10. Ability to collect and analyze data and derive conclusions</p><p>11. Ability to make recommendations to reach a solution</p><p>12. Oral and written presentation skills</p><p>13. Ability to follow design controls</p><p>14. Ability to work independently</p><p>15. Detail and results oriented</p><p></p><p><b>Basic Qualifications</b></p><ul><li><p>A student working towards a Bachelor degree in science or engineering.</p></li><li><p>The incumbent must demonstrate the ability to perform the essential functions of the job as outlined in the duties and responsibilities.</p></li></ul><p></p><p><b>Physical Requirements</b></p><ul><li><p>This position is in an office and/or laboratory environment and requires the incumbent to sit, stand and perform general office functions.</p></li><li><p>The incumbent may also be required to lift up to twenty five pounds occasionally.</p></li><li><p>The incumbent may be required to stand for extended periods of time.</p></li><li><p>Bending, stooping and reaching are also frequently required.</p></li></ul><p></p><p></p><p><b>Why join us?</b></p><p>A career at BD means being part of a team that values your opinions and contributions and that empowers you to bring your authentic self to work. Here our associates can fulfill their life's purpose through the work that they do every day.</p><p></p><p>You will learn and work alongside inspirational leaders and colleagues who are equally passionate and committed to fostering an inclusive, growth-centered, and rewarding culture. Our Total Rewards program - which includes competitive pay, benefits, continuous learning, recognition, career growth, and life balance components - is designed to support the varying needs of our diverse and global associates.</p><p></p><p>To learn more about BD visit <span class=\"long-word\">https://jobs.bd.com/</span></p><p></p><p>Becton, Dickinson and Company is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. We do not unlawfully discriminate on the basis of race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status, or any other protected status.</p><p></p><p></p>Primary Work LocationUSA UT - Salt Lake City BAS<p></p><p></p>Additional Locations<p></p><p></p>Work Shift</div></div>"
    },
    {
        "position": "Part-Time Student Single Sign-on Developer - Bepko Internship",
        "company": "Indiana University",
        "location": {
            "city": "Bloomington",
            "state": "IN",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f7bec7319c2b5b657c546fcc417c735e?lvk=GmNbOO1bSPaMVhB8SJ3R8g.--MBdHPvo97",
        "posted": "2021-09-16T18:35:38.743Z",
        "lastScraped": "2021-09-23T18:35:38.743Z",
        "description": "<div><div><strong>Job Description</strong><b>Department</b><br><br>VICE PRES INFORMATION TECHNLGY (UA-VPIT-IUBLA)<br><br><b>Department Information</b><br><br>For years the Bepko Internship Program has been upholding Chancellor Bepko's commitment to diversity within IT. The program targets applications from Indiana University student populations that are traditionally under-represented in information technology professions and places them in high quality internships where they are mentored by top professionals and gain first hand experience in their field. Interns are compensated competitively and have the ability to work flexible hours to accommodate class schedules. <br><br>At University Information Technology Services (UITS) we ensure a workplace that encourages growth, flexibility, and creativity, as well as a culture that champions inclusion, diversity, and overall employee well-being through programs supported university wide. Our core values define who we are, how we act and what we aspire to, which helps us to make amazing things happen in each neighborhood, community, and county we touch. As an Equal Opportunity Employer, we believe in each person's potential, and we'll help you reach yours. <br><br>The Research and Education Networking Information Sharing and Analysis Center (REN-ISAC) is hosted at Indiana University and our staff report to the Vice President for Information Technology and CIO through the REN-ISAC Executive Director. We receive funding and support from membership fees, Indiana University, Internet2, and EDUCAUSE. <br><br>REN-ISAC has two primary roles. As the computer security incident response team (CSIRT) supporting the R&amp;E community at-large, we serve the entire EDU space in the United States, including non-members. In this role, we work with trusted third parties to notify higher education institutions of infected hosts and suspicious network traffic. <br><br>REN-ISAC serves over 680 member institutions in Australia, New Zealand, Canada, the UK, and the United States. For a modest annual fee, member institutions gain access to additional services and benefits. <br><br>Bring your programming aspirations to be part of REN-ISAC single sign-on implementation. We are looking for someone with programming experience to help us integrate 3rd party applications as part of our SSO roll out. Have an opportunity to work with multiple different systems, CI and unit testing. <br><br><b>Job Summary</b><br><br>This position offers candidates a unique opportunity to learn about and gain work experience in Cybersecurity - a field with growing opportunity and a bright future. <br><br><strong>Description of duties:</strong><br><ul><li>Perform compatibility research and implementation of SSO plug-ins for multiple 3rd party applications such as but not limited to wiki and confluence.</li><li>Assist in integration of the plug-ins/packages, troubleshooting and QA.</li></ul><br><b>Qualifications</b><br><br>EDUCATION<br><br><strong>Required</strong><br><ul><li>Currently enrolled as a student at Indiana University. </li><li>Students from all academic backgrounds are welcome.</li></ul>SKILLS<br><ul><li>Excellent communication skills.</li><li>Self-motivated, able to work independently as well as part of a larger team.</li><li>Strong time management and organizational skills.</li><li>General interest in Information Security and technology.</li></ul><br><b>Work Location</b><br><br>Bloomington, Indiana<br><br><b>Job Classification</b><br><br>Career Level: Temporary<br><br>FLSA: Nonexempt<br><br>Job Function: Temporary Hourly<br><br>Job Family: Temporary Student<br><br>Click here to learn more about Indiana University's Job Framework.<br><br><b>Posting Disclaimer</b><br><br>Due to the COVID-19 pandemic, there may be differences in the working conditions as advertised in our standard job postings (e.g., the ability to travel from one campus to another, etc.). If you are invited for an interview, please discuss your questions or concerns regarding the working conditions at that time. <br><br>This posting is scheduled to close at 11:59 pm EST on the advertised Close Date. This posting may be closed at any time at the discretion of the University, but will remain open for a minimum of 5 business days. To guarantee full consideration, please submit your application within 5 business days of the Posted Date.<br><br>If you wish to include a cover letter, you may include it with your resume when uploading attachments.<br><br><strong>New employees will be provided with information regarding Indiana University's COVID-19 vaccine policy, which includes the opportunity to request an exemption. To learn more, view our COVID-19 vaccine information page.</strong><br><br><b>Equal Employment Opportunity</b><br><br>Indiana University is an equal employment and affirmative action employer and a provider of ADA services. All qualified applicants will receive consideration for employment without regard to age, ethnicity, color, race, religion, sex, sexual orientation, gender identity or expression, genetic information, marital status, national origin, disability status or protected veteran status. Indiana University does not discriminate on the basis of sex in its educational programs and activities, including employment and admission, as required by Title IX. Questions or complaints regarding Title IX may be referred to the U.S. Department of Education Office for Civil Rights or the university Title IX Coordinator. See Indiana University's Notice of Non-Discrimination here which includes contact information.<br><br><b>Campus Safety and Security</b><br><br>The Annual Security and Fire Safety Report, containing policy statements, crime and fire statistics for all Indiana University campuses, is available online. You may also request a physical copy by emailing IU Public Safety at [ Link Removed ] or by visiting IUPD.<br><br><b>Contact Us</b><br><br>Request Support<br>Telephone: [ Phone number blocked ] Qualifications: * Excellent communication skills. * Self-motivated, able to work independently as well as part of a larger team. * Strong time management and organizational skills. * General interest in Information Security and technology., Due to the COVID-19 pandemic, there may be differences in the working conditions as advertised in our standard job postings (e.g., the ability to travel from one campus to another, etc.). If you are invited for an interview, please discuss your questions or concerns regarding the working conditions at that time.Education: BachelorEmployment Type: [\"PART_TIME\"]</div></div>"
    },
    {
        "position": "Engineering Co-Op / Internship",
        "company": "Precision Castparts Corp.",
        "location": {
            "city": "Irvine",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/361705853fafab1f58ce09a4f10ae8d1?lvk=ybTai1Z_cRauWqoGg2G15w.--MBdHKYY8s",
        "posted": "2021-09-15T18:35:39.857Z",
        "lastScraped": "2021-09-23T18:35:39.857Z",
        "description": "<div><div><strong>Country</strong> &nbsp; United States of America <strong>State / County</strong> &nbsp; California <strong>City</strong> &nbsp; Irvine <strong>Division</strong> &nbsp; Fasteners <strong>Company</strong> &nbsp; SLC <strong>Function</strong> &nbsp; Engineering General <strong>Position type</strong> &nbsp; Part Time <strong>Anticipated start date</strong> &nbsp; <strong>Anticipated start date</strong> - day <strong>Anticipated start date</strong> - month <strong>Anticipated start date</strong> - year September 1 2021 <p>&nbsp;&nbsp;</p><br><strong>Opportunity ID</strong> &nbsp; <p>2361</p><strong>Company Profile</strong> &nbsp; <p>With more than 120 operations and approximately 20,000 employees worldwide, Precision Castparts Corp. is the market leader in manufacturing large, complex structural investment castings, airfoil castings, forged components, aerostructures and highly engineered, critical fasteners for aerospace applications. In addition, we are the leading producer of airfoil castings for the industrial gas turbine market. We also manufacture extruded seamless pipe, fittings, and forgings for power generation and oil &amp; gas applications; commercial and military airframe aerostructures; and metal alloys and other materials for the casting and forging industries. With such critical applications, we insist on quality and dependability - not just in the materials and products we make, but in the people we recruit.</p><p>PCC is relentless in its dedication to being a high-quality, low-cost and on-time producer; delivering the highest value to its customers while continually pursuing strategic, profitable growth.</p><p>In 2016, Berkshire Hathaway, led by Chairman and CEO Warren E. Buffett, acquired Precision Castparts Corp.</p><strong>Position Summary</strong> &nbsp; <p>We are seeking highly motivated IMPACT players to join our world of manufacturing. Do you thrive in a fast-paced, challenging environment where you are rewarded for results?&nbsp; Do you want to be a member of a team that is driven to win?&nbsp; If so, Precision Castparts Corp. may be just the place for you.</p><p>&nbsp;</p><p>Find out what it's like to work with our team in our fast-paced, dynamic work environment through a variety of internship and cooperative program opportunities. This is your chance to gain invaluable on-the-job experience while getting an introduction to our collaborative and exciting culture. </p><p>&nbsp;</p><p>Job assignments will be related to your functional engineering discipline; typically mechanical, industrial or materials science engineering. You will be responsible for accomplishing performance goals and will receive progressive responsibility in process and/or product engineering.</p><p>&nbsp;</p><p><strong>Essential Duties and Responsibilities</strong></p><p>The student will:</p><ul><li>Apply principles that he or she has learned in school to hands-on situations, such as process and product design and improvement.</li><li>Identify and recommend process improvements for specified projects.</li><li>Attend regular departmental meeting.</li><li>Attend training sessions, symposiums and other appropriate educational opportunities.</li><li>Perform or review system analysis, testing and documentation for existing processes.</li><li>Take ownership and responsibility for identified projects.</li><li>Participate on project teams for assigned projects; analyze improvements and new product or applications and develop requirements and specifications with team.</li><li>Work within specifications provided to meet project goals and objectives in a timely and accurate manner.</li><li>Participate with peers, project team members and other departments on new product development, product line extensions and product enhancements.<strong> </strong><br><br></li></ul><p><strong>Qualifications:</strong></p><ul><li>Current student pursuing a bachelor's degree in mechanical, industrial systems or materials science engineering</li><li>Demonstrated results-driven leadership</li><li>Critical problem analysis, decision making and analytical abilities</li><li>Strong interpersonal skills</li><li>Excellent written and verbal communication skills</li><li>Integrity</li><li>US citizen or permanent resident</li></ul><p>Students with a passion for leadership and who are seeking a great career in a fast-paced, growing organization are encouraged to apply.&nbsp;</p><p>We firmly believe that our strength lies in our people. We build our team with strong leaders who enjoy the everyday challenge of making an impact on the bottom line.&nbsp; Our employees are given unparalleled opportunities to build their careers and capabilities - career growth at PCC is directly linked to an individual's ability to drive the company to new levels of performance. The path you choose is based on your education, experience and passion.</p> &nbsp; <p><br><br></p><p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</p><br></div></div>"
    },
    {
        "position": "Marketing Internship or Market Research Intern",
        "company": "WCMG",
        "location": {
            "city": "Las Vegas",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/wcmg-f0ed2f70/marketing-internship-or-market-research-intern-5e38b9ed?lvk=fGMJiOlzczPrxtwkd07_Zg.--MBcMFJbX7",
        "posted": "2021-09-23T18:35:42.396Z",
        "lastScraped": "2021-09-23T18:35:42.396Z",
        "description": "<div><p>Marketing Paid Internship Position – UNLV (3-4 months)<br>Market Analysis Intern, Social Media Intern, and or Business Development Intern</p><p><br>*Minimum wage, school credit, endorsement on Linkedin or Letter of Recommendation upon successful completion of the internship<br>Up to 3 positions<br>15-25 hours per week (Flexible)</p><p><br>Exposure to multifamily real estate marketing, market research, and business development.<br>Intern would be able to work on increasing brand awareness, market research, brand partnerships, and creating a social media influencer program. Successful marketing interns possess a good understanding of the latest marketing trends and techniques. They are enthusiastic with excellent communication skills.</p><p><br>Projects may include:<br>- Designing graphics for blog posts, brochures and packages.<br>- Create newsletters, email campaigns, online promotions, community management for social media, etc.<br>- Provide support to social media efforts to target new audiences.<br>- Research and analyze competitor marketing and sales materials.<br>- Create sales presentations, proposals, TikTok, Pinterest, other social media platforms<br>- Developing marketing reports, market research, data analysis, proformas</p><p><br>Requirements<br>- Knowledge of Photoshop, In Design, Adobe Premiere Pro<br>- WordPress, social media, email campaigns a plus!<br>- Pursuing a Bachelor’s Degree in Marketing/Graphic <span class=\"long-word\">Design/Advertising/Business</span> (Sophomore, Juniors, Seniors) and Graduate students in Business or Marketing<br>- Strong computer skills (Adobe, Microsoft Office, Google Docs, Excel)<br>- If artistic/graphic design, please submit portfolio with resume.<br>- If applying for market research, submit previous course record<br>- Should be open-minded, a fast learner, enthusiastic, and adaptable</p><p>HIRING IMMEDIATELY...</p></div>"
    },
    {
        "position": "Part-Time 3D Digitization Assistant - Bepko Internship",
        "company": "Indiana University",
        "location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b159f5ba069279c5dbfa439e9def18fa?lvk=GdbwdEm97nDFmb0cH-trKQ.--MBdHpdbAR",
        "posted": "2021-09-14T18:35:43.894Z",
        "lastScraped": "2021-09-23T18:35:43.894Z",
        "description": "<div><div><strong>Job Description</strong><b>Department</b><br><br>VICE PRESIDENT INFORMATION TEC (UA-VPIT-IUINA)<br><br><b>Department Information</b><br><br>For years the Bepko Internship Program has been upholding Chancellor Bepko's commitment to diversity within IT. The program targets applications from Indiana University student populations that are traditionally under-represented in information technology professions and places them in high quality internships where they are mentored by top professionals and gain first hand experience in their field. Interns are compensated competitively and have the ability to work flexible hours to accommodate class schedules.<br><br>At University Information Technology Services (UITS) we ensure a workplace that encourages growth, flexibility, and creativity, as well as a culture that champions inclusion, diversity, and overall employee well-being through programs supported university wide. Our core values define who we are, how we act and what we aspire to, which helps us to make amazing things happen in each neighborhood, community, and county we touch. As an Equal Opportunity Employer, we believe in each person's potential, and we'll help you reach yours.<br><br><b>Job Summary</b><br><br>Come help us \"scan the world\" and \"share the world\"! The IU3D team in UITS Research Technologies is seeking an enthusiastic intern to help us digitize a diverse set of three-dimensional assets from across IU, Indiana, and beyond. Examples of IU3D projects and their benefits include:<ul><li>Developing 3D scans and virtual tours of IU schools, academic buildings, and public spaces to augment student recruitment and alumni outreach. </li><li>Creating virtual tours of museums and art galleries with rotating exhibits in order to expand audiences and accurately document past exhibits. </li><li>Digitizing 3D objects in research collections that are of cultural, scientific, and teaching importance to enable online examination, measurement, comparison, and appreciation. </li><li>Capturing 3D creative works such as statues, sculptures, furnishings, and art installations to document, combine, and share with broader audiences. </li></ul>For a representative sample of IU3D projects, see the IU3D Hub. <br><br>Description of Duties: <br><br>This internship will familiarize the student with cutting-edge techniques and best practices across all steps of the 3D pipeline, including planning, acquisition, processing, distribution, data management, and documentation. In this internship, you will:<ul><li>Learn to process 2D photo sets into 3D objects using state-of-the-art photogrammetry software on IU's high-performance computing environment. </li><li>Learn to digitize and create 3D models of sculptures and other cultural and scientific artifacts using 2D photogrammetry and structured light scanners. </li><li>Help to digitize and create virtual tours of physical spaces at IU, including building interiors, exteriors, and terrains using a variety of technologies such as Matterport, LiDAR, 360 imaging, and drone-based photogrammetry. </li><li>Work with faculty and students to digitize objects in support of student coursework and faculty research and creative activities. </li><li>Help to document techniques and workflows to create future learning opportunities for IU students, faculty, and staff. </li></ul><br><b>Qualifications</b><br><br>EDUCATION<br><br><b>Required</b><br><ul><li>High school diploma or GED</li></ul>EXPERIENCE<br><br><b>Preferred</b><br><ul><li>Some exposure to 3D technologies and their uses</li></ul>SKILLS<br><ul><li>Strong interest in advanced technologies and their application.</li><li>Enthusiasm for learning new skills and techniques.</li><li>Excellent attention to detail.</li><li>Strong communication skills.</li></ul><br><b>Work Location</b><br><br>Indianapolis, Indiana<br><br><b>Job Classification</b><br><br>Career Level: Temporary<br><br>FLSA: Nonexempt<br><br>Job Function: Temporary Hourly<br><br>Job Family: Temporary Regular<br><br>Click here to learn more about Indiana University's Job Framework.<br><br><b>Posting Disclaimer</b><br><br>Due to the COVID-19 pandemic, there may be differences in the working conditions as advertised in our standard job postings (e.g., the ability to travel from one campus to another, etc.). If you are invited for an interview, please discuss your questions or concerns regarding the working conditions at that time. <br><br>This posting is scheduled to close at 11:59 pm EST on the advertised Close Date. This posting may be closed at any time at the discretion of the University, but will remain open for a minimum of 5 business days. To guarantee full consideration, please submit your application within 5 business days of the Posted Date.<br><br>If you wish to include a cover letter, you may include it with your resume when uploading attachments.<br><br><strong>New employees will be provided with information regarding Indiana University's COVID-19 vaccine policy, which includes the opportunity to request an exemption. To learn more, view our COVID-19 vaccine information page.</strong><br><br><b>Equal Employment Opportunity</b><br><br>Indiana University is an equal employment and affirmative action employer and a provider of ADA services. All qualified applicants will receive consideration for employment without regard to age, ethnicity, color, race, religion, sex, sexual orientation, gender identity or expression, genetic information, marital status, national origin, disability status or protected veteran status. Indiana University does not discriminate on the basis of sex in its educational programs and activities, including employment and admission, as required by Title IX. Questions or complaints regarding Title IX may be referred to the U.S. Department of Education Office for Civil Rights or the university Title IX Coordinator. See Indiana University's Notice of Non-Discrimination here which includes contact information.<br><br><b>Campus Safety and Security</b><br><br>The Annual Security and Fire Safety Report, containing policy statements, crime and fire statistics for all Indiana University campuses, is available online. You may also request a physical copy by emailing IU Public Safety at [ Link Removed ] or by visiting IUPD.<br><br><b>Contact Us</b><br><br>Request Support<br>Telephone: [ Phone number blocked ] Qualifications: Required * High school diploma or GED EXPERIENCE Preferred * Some exposure to 3D technologies and their uses SKILLS * Strong interest in advanced technologies and their application. * Enthusiasm for learning new skills and techniques. * Excellent attention to detail. * Strong communication skills., Due to the COVID-19 pandemic, there may be differences in the working conditions as advertised in our standard job postings (e.g., the ability to travel from one campus to another, etc.). If you are invited for an interview, please discuss your questions or concerns regarding the working conditions at that time.Education: Secondary <span class=\"long-word\">EducationEmployment</span> Type: [\"PART_TIME\"]</div></div>"
    },
    {
        "position": "Fall Engineering Intern",
        "company": "Northrop Grumman Corporation",
        "location": {
            "city": "San Diego",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/dbff8849fe8be87eb79871c32ec5a7c8?lvk=4qiuUiRPKMEanWG7uxPYzQ.--MBdOvkpZV",
        "posted": "2021-09-22T18:35:45.354Z",
        "lastScraped": "2021-09-23T18:35:45.354Z",
        "description": "<div><div><p>US CITIZENSHIP REQUIRED FOR THIS POSITION: Yes</p><p></p><p></p>RELOCATION ASSISTANCE: No relocation assistance available<p></p><p></p>CLEARANCE TYPE: Secret<p></p><p></p>TRAVEL: Yes, 10% of the Time<p></p><p></p><b>Description</b><p></p>Join Northrop Grumman on our continued mission to push the boundaries of possible across land, sea, air, space, and cyberspace. Enjoy a culture where your voice is valued and start contributing to our team of passionate professionals providing real-life solutions to our world's biggest challenges. We take pride in creating purposeful work and allowing our employees to grow and achieve their goals every day by Defining Possible. With our competitive pay and comprehensive benefits, we have the right opportunities to fit your life and launch your career today.<p></p><p></p><p></p><p>Northrop Grumman is seeking Engineering Interns to join the Aeronautics Systems Intern Program. This position will be located in San Diego, CA.</p><p>The qualified candidate will become part of Northrop Grumman's Autonomous Design Center of Excellence.</p><p>The selected candidate will work in a dynamic people-focused environment where he/she will interact with users, customers and other developers.</p><p>As an intern, you'll participate in a summer internship program to develop competencies in a variety of engineering specializations that may include:</p><ul><li>Construct, troubleshoot, calibrate, adjust, test, and maintain equipment, components, devices, or systems.</li><li>Work from engineering drawings and written or verbal instructions.</li><li>Operate related equipment; conduct tests and report data in prescribed format.</li><li>Perform calibration and alignment checks; make adjustments, modifications, and replacements as directed.</li><li>Prepare prescribed compounds and solutions.</li></ul><p></p><p><b>Basic Qualifications</b></p><p><b>A candidate, regardless of age and hiring source, must meet ALL of the below criteria. The candidate must:</b></p><p></p><ul><li>Be enrolled in a community college and pursuing an Associate degree from an accredited community college with a STEM (Science, Technology, Engineering or Mathematics) emphasis such as: math and science, computer programming, mechanical design, engineering technology or computer-aided drafting and design</li></ul><ul><li>Maintain an overall cumulative GPA of 3.0/4.0 or higher (academic transcripts must be provided at the end of each semester to your NG manager)</li></ul><ul><li>Be available to work part-time (up to 19 hours per week)</li><li>Be able to obtain and maintain a U.S. Government security clearance (U.S. citizenship is a pre-requisite)</li></ul><p></p><p></p><p><b>Preferred Qualifications</b></p><ul><li>Have an overall cumulative GPA of 3.25/4.0 or higher.</li></ul><ul><li>Previous internship/co-op experience, leadership &amp; teamwork capabilities, interpersonal communication skills, and activities <span class=\"long-word\">(professional/community/extracurricular)</span></li></ul><p></p><p>Pay Range: $24.00 - 29.75</p><p></p><p></p><p></p>Salary Range: $24.00 - $29.75<p></p><p>Employees may be eligible for a discretionary bonus in addition to basepay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results.Employees in Vice President or Director positions may be eligible for Long Term Incentives.In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO)for vacation and/orpersonal business.</p><p></p><p></p><p>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit <span class=\"long-word\">http://www.northropgrumman.com/EEO.</span> U.S. Citizenship is required for most positions.</p></div></div>"
    },
    {
        "position": "Clinical Laboratory Scientist - Clinical Laboratory",
        "company": "Sonoma County Entities - St Josephs Healthcare System",
        "location": {
            "city": "Petaluma",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5b0a32c3899af0a593dafd8570e7c443?lvk=HjlydzevIuF8jGJ-dQ5Plw.--MBaLQ7K2k",
        "posted": "2021-09-14T18:35:46.879Z",
        "lastScraped": "2021-09-23T18:35:46.879Z",
        "description": "<div><div><b>We are looking for a Clinical Laboratory Scientist&nbsp;for the Clinical Laboratory&nbsp;Department at NorCal HealthConnect.</b> &nbsp; Location: Petaluma, CA Work Schedule: &nbsp;Part Time - 40 Biweekly Hours Shift:&nbsp;8-hour, Days (Variable Shifts) &nbsp; <b>Job Summary:</b> Performs a wide variety of clinical laboratory tests classified as waived, moderate and high complexity tests and procedures according to established standards; maintains and calibrates highly scientific equipment; serves as a resource to others relative to technical questions; participates in QC/QA activities relative to the laboratory. &nbsp; <b>Essential Functions:</b><ul><li> Perform lab specimen testing for all ages of patients in order to provide accurate and timely diagnostic data in accordance with established procedures and policies. </li><li> Evaluate the validity of results to determine if the value is outside the expected norms and documents and verbally reports all panic and critical test results to patient care area according to procedure. </li><li> Perform quality control studies, calibration, and equipment maintenance to ensure accuracy of clinical lab data; recognize and report problems and document corrective action. </li><li> Demonstrate effective organization and set appropriate priorities by completing assignments within prescribed timeframes. </li><li> Contributes to the effective communication needs of the department by providing timely and accurate communication in a positive manner, assisting callers or visitors. </li><li> Maintain a safe, clean environment for all members of the health care team including collecting and disposing of specimens and other contaminated material according to established procedure with adherence to standards of infection control and blood/body fluid precautions and protective equipment when necessary. </li><li> Demonstrate and maintain commitment for self- growth and competency including completion of all mandatory education requirements according to hospital and department standards and state licensing standards. </li><li> Participates in department activities, provide input into staff discussion, problem solving effort and follow-up. </li><li> Effectively uses all computer equipment, programs, and instrument interfaces related to departmental operating functions. </li></ul> &nbsp; <b>Skills:</b><ul><li> Knowledge and aptitude for basic computer and secretarial skills. </li><li> Answer telephone, demonstrating telephone etiquette. </li><li> Organization and problem-solving skills. </li><li> Evaluative and interpretive skills. </li><li> Adapts to rapidly changing conditions in the work environment. </li><li> Communication skills, both verbal and written. </li><li> Interpersonal skills. </li><li> Knowledge of medical terminology and troubleshooting and maintaining sophisticated lab instruments. </li></ul> &nbsp; <b>Minimum Position Requirements:</b> <b>Education:&nbsp;</b><span class=\"long-word\">Coursework/Training</span> -&nbsp;1 year internship in an approved Medical Technology program. <b><span class=\"long-word\">Licenses/Certifications:</span>&nbsp;</b>California state license as a Clinical Laboratory Scientist. &nbsp; <b>Preferred Position Qualifications:</b> <b>Experience:&nbsp;</b>1 year experience in a clinical laboratory in an acute care laboratory. &nbsp; <p>Providence St. Joseph Health (Providence) has worked for decades to improve health and quality of life in California's North Bay region, starting in Sonoma County, where the Sisters of St. Joseph of Orange opened the doors of Santa Rosa Memorial Hospital in 1950. Today, we continue the mission begun by the Sisters to those we serve through an integrated spectrum of primary, urgent, acute, outpatient, palliative care and regional referral services. Sonoma County facilities aligned with Providence include the 278-bed Santa Rosa Memorial Hospital, the region's only Level II trauma center. In addition, the 80-bed Petaluma Valley Hospital and 43-bed Healdsburg Hospital are secular (non-religious) affiliates of Providence. Our services also encompass three Urgent Care centers, Hospice of Petaluma, Memorial Hospice and North County Hospice, the Annadel Medical Group doing business as St. Joseph Health Medical Group, as well as the St. Joseph Home Care Network (post-acute care services). We act as a regional referral hub for outlying hospitals, while also providing outpatient behavioral health care, education to promote health and prevent chronic disease, rehabilitation, oral health care, community benefit programs, and more, all fostering health and quality of life throughout the area.<br><br> Providence provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Providence complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br><br> Positions specified as \"on call/per diem\" refers to employment consisting of shifts scheduled on as \"as needed basis\" to fill in for staff vacancies.</p></div></div>"
    },
    {
        "position": "Intern (Recycled Water - GIS)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/df25537156cfbc74cc9df5647ee222a4?lvk=VOc4wf1ZWf-xJkX5dY7ZnQ.--MBahrm3ms",
        "posted": "2021-09-20T18:35:48.485Z",
        "lastScraped": "2021-09-23T18:35:48.485Z",
        "description": "<div><div> THE POSITION: <p></p><div><div><div><div><div><br></div><div><br></div><div> &nbsp; <div> Are you an undergraduate or graduate with major course work in Computer Science or Geographic Information Systems? &nbsp;Do you want a meaningful internship that enhances and preserves the quality of life throughout the region? The Inland Empire Utilities Agency is seeking a motivated student or graduate to join our team as an Intern (Recycled Water - GIS)! <br>&nbsp; <br>&nbsp;The Chino Basin Recycled Water distribution system consists of approximately 90 miles of pipeline and hundreds of &nbsp;individual control structures. The distribution system supports direct use customers and the Groundwater Recharge (GWR) program whose infrastructure consists of a network of streams and pipelines that direct stormwater run-off, imported water from the State of California Water Project, and IEUA recycled water to recharge sites consisting of several individual recharge basins. These recharge basins are located throughout the IEUA service area (approximately 245 square miles) and are designed to hold the water so that it can percolate into the ground and replenish the groundwater supply held within the Chino Basin's alluvial aquifers. <br>&nbsp; </div>&nbsp; <div></div><br><br><strong>There is (1) internship opportunity in the Recycled Water Groundwater Recharge section of the Operations Division.</strong><br><br><strong>This recruitment is being conducted to fill (1) vacancy and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.</strong></div></div></div></div><div><div><br></div><div><strong>Open until filled, Apply Immediately<br>First Review of Applications scheduled for October 4, 2021</strong>&nbsp; </div><div><br><strong>Internships are limited to 25 hours week and 960 hours per fiscal year<br>(July 1st to June 30th)</strong><br><br><strong>Note: &nbsp;Internship are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals only interested in short term internships will not be considered.</strong></div></div></div><div><div><br><em>Work schedule is estimated to be approximately 15 to 20 hours a week;&nbsp;</em><br><em>Office Hours are Monday through Friday from 8:00 a.m. to 5:00 p.m.</em><br>&nbsp; </div></div><div> &nbsp; </div><div><div><strong>FLSA: Non-Exempt</strong><br><br>Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. <br>&nbsp; <br>The successful candidate will be a responsible, analytical, and detailed oriented individual with excellent communication (written/oral) skills. time management skills with the ability to work in the office and field on multiple projects simultaneously; must be flexible and be able to learn and distinguish components of the recycled water distribution system, and assist with ad hoc projects as required in a fast-paced environment.&nbsp; </div></div><br><br><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p></p><div><div><strong>May include, but are not limited to the following:</strong></div><div> Assist Recycled Water Distribution operations in verifying asset locations and types using GPS and GIS equipment and software (ArcMap GIS and Trimble or Geo Explorer GPS devices); compiling field data into databases; updating distribution system maps; providing KPI (Key Performance Index) reports and updates; assisting in asset management tracking in both field and office settings.&nbsp; </div><br><div> Field data collections includes both working independently and working in teams, working in variable weather conditions, reviewing on-line monitoring systems, taking field notes, walking on unimproved slopes and on wet surfaces, photographing conditions, and communicating with supervisor. May be requested to occasionally work outside normal Agency hours of operation if work hour limits and school schedule allows. <br>&nbsp; <br>Must be able to drive Agency vehicles (e.g., sedan, light duty truck, heavy duty vehicle) on a variety of road surfaces (e.g., asphalt, concrete, unimproved, wet, dry, rough, smooth) dimensions, and orientations throughout the service area and recognize limits in ability to do so to prevent accidents. <br>&nbsp; <br>Occasionally conduct water sampling, which includes coordinating with the groundwater recharge department and IEUA laboratory, organizing of priorities, following protocols, meeting deadlines, lifting and loading full sample coolers, and navigating/driving within the service area. <br>&nbsp; <br>Perform the full array of duties assigned including professional <span class=\"long-word\">administrative/technical</span> work on special projects. <br>&nbsp; <br>Prepare reports and recommendations relative to assigned areas of responsibility; prepare and update manuals and protocols. <br>&nbsp; <br>Participate in pulling documents and filing information. <br>&nbsp; <br>Travel to offsite locations is required. <br>&nbsp; <br>Perform other related duties as required. </div></div><div><div><br></div></div><br><p></p> QUALIFICATION GUIDELINES: <p></p><div><div><strong>EXPERIENCE AND EDUCATION:</strong><br>Graduation from high school or G.E.D. equivalent. </div><div><br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with major course work in Computer Science, Geographic Information Systems, or a closely related field. <br>&nbsp; <br>While no prior work experience is required, <strong>preference will be given to individuals with prior related professional work experience.</strong><br><strong>&nbsp;</strong><br>Interns will have the ability to communicate clearly and concisely, to establish and maintain effective working relationships. <br>&nbsp; <br>Proficiency in necessary computers and computer applications. </div><br></div><div><div><br><strong>LICENSES AND CERTIFICATES:</strong></div>A valid class \"C\" California driver's license. &nbsp; <br>&nbsp; <div><div><br><strong>KNOWLEDGE OF:</strong></div>Basic knowledge of data collection, the practices and principles of GIS theory and function, tabular and spatial data analysis; GIS programming languages, development tools, technologies and ESRI application software; GIS data handling and conversion techniques and methods and techniques for basic report preparation and writing; modern office equipment including a computer; database structures and applicable software; the ability to read or learn basic engineering design drawings, use of &nbsp;proper English, spelling, and grammar. <br>&nbsp; <br>Practices of cartography and geography are required. Knowledge of AutoCAD, Visual Basic and Global Positioning System (GPS) is desirable. <br>&nbsp; </div><div> &nbsp; </div><div><div><strong>ABILITY TO:</strong></div>Work in a variety of GIS applications; perform moderately complex technical computations and compile/analyze GIS data and statistics; utilize Agency computer hardware (PC's, scanners, digitizers, etc.) and software required for assigned duties; interpret requirements, coordinate necessary work with customers, and prepare maps, reports and other GIS-related reports in a timely manner; perform technical analysis; participate on a team focused on producing high quality results; communicate clearly and concisely, both orally and in writing; understand and follow verbal and written instructions; analyze data, situations and research materials; formulate options and make recommendations; establish and maintain effective working relationships with those contacted in the course of work; and handle stress in a professional manner. <br><br>&nbsp; </div></div><p></p> SELECTION PROCESS: <p></p><div><div><div> All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span> examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. <br>&nbsp; </div><div><div><strong>Any applicant requiring reasonable accommodation during the selection process due to a qualified disability must inform the Human Resources Office at (</strong> <strong>909</strong> <strong>) 993-1674 or hrdept@ieua.org at least 72 hours in advance of the need for accommodation.</strong><br>&nbsp; </div><div><div> THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br>&nbsp; </div></div></div></div></div></div></div>"
    },
    {
        "position": "Engineering Internship - Department of Transportation & Infrastructure",
        "company": "City and County of Denver",
        "location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/37efeb413d0c94dfcf3bd1a14753a478?lvk=1tg7nq7b8njBorpaRfWyEA.--MBapxpOGR",
        "posted": "2021-09-15T18:35:49.991Z",
        "lastScraped": "2021-09-23T18:35:49.991Z",
        "description": "<div><div><p>Denver is the nation's top place to live, work, and play, and we need the best people working for the residents of Denver. People who want to make a difference; people who want to give back; people who want to be at the heart of this city and have a hand in creating our future. </p><p></p><p>Equity, diversity and inclusion are cornerstones of ourvalues at the City and County of Denver. We celebrate uniqueness and strive to be a world-class city where everyone matters. Join us! Be a part of the city that you love.<b>#WhereDenverWorks</b></p><p></p><p>For more information about our hiring process including ADA resources, assessments and testing, pre-employment, and onboarding, click here. For information about employee benefits, click here.</p>About Our Job<p><b>Employment Requirement</b>: City Employees must be fully vaccinated against COVID-19 by September 30, 2021. All persons offered a position will be required to provide valid proof of vaccination prior to starting employment.</p><p></p><p>The Department of Transportation and Infrastructure (DOTI) delivers services that help to define and improve the quality of life in Denver. Denver Public Works is responsible for road maintenance and repair; residential trash, recycling and compost collection; design and construction of streets, bridges, public buildings, and storm and sanitary sewers; transportation and parking services; oversight and regulation of use of the public right-of-way; and implementation of the DOTI Environmental Management System (EMS).</p><p></p><p>The Right of Way Services section of DOTI oversees activities and uses of the public Right of Way. Divisions within include the City Surveyor, Development Plan Review, Engineering &amp; Regulatory Review and Construction Inspections. The Construction Inspection section works with citizens, private developers, contractors, utility providers, event organizers and other City employees including City council staff to regulate activities such as private construction, infrastructure projects, events, utility repairs and other occupations of this valuable land asset that is used by many people and businesses.</p><p></p><p>For more information, please visit the DOTI website.</p><p></p><p>As an intern you will have the opportunity to experience:</p><ul><li><p>Pavement design and soil analysis</p></li><li><p>Assist with records retention and converting to an electronic records system</p></li><li><p>Reviewing technical designs</p></li><li><p>Reviewing and Completing technical research</p></li><li><p>Assisting in various data analysis projects </p></li><li><p>Assisting with data mining</p></li><li><p>Collaborating with various divisions and levels of professionals </p></li></ul>About You<p>Our ideal intern will have/be:</p><ul><li><p>Understanding and ability of high attention to detail </p></li><li><p>Previous experience with soil analysis </p></li><li><p>Excellent written and verbal communication </p></li><li><p>Ability to take initiative</p></li><li><p>Advanced experience with Microsoft Excel </p></li><li><p>Experience or exposure with PowerBI</p></li></ul><p></p><p>We realize your time is valuable so please do not apply if you do not have at least the following required minimum qualifications:</p><p></p><ul><li><p>Current enrollment in an accredited college program leading to a certificate, licensure, associates, bachelor's, or higher degree in Science, technology, engineering, mathematics or closely related field, or a recent graduate (completed specified program within 1 year of completion).</p></li><li><p>Experience: None</p></li><li><p>Education and Experience Equivalency: No substitution of experience for education is permitted</p></li><li><p>Licensure &amp; Certification:A valid Driver's License at the time of application. Licenses and certifications must be kept current as a condition of employment.</p></li></ul><p></p><p>Other mandatory documentation required to be considered for this position:</p><ul><li><p>Resume</p></li><li><p>Copy of Transcripts - unofficial or official</p></li></ul><p></p>About Everything Else<p></p><p><b>Job Profile</b></p>TA3182 Professional Technical Intern<p>To view the full job profile including position specifications, physical demands, and probationary period, click here.</p><p></p><p><b>Position Type</b></p>Oncall<p></p><p><b>Position Salary Range</b></p>$19.95 - $22.46<p></p><p><b>Starting Pay</b></p>Based on Education<p></p><p><b>Agency</b></p>Dept of Transportation &amp; Infrastructure<p></p><p><i>The City and County of Denver provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, national origin, disability, genetic information, age, or any other status protected under federal, state, and/or local law.</i></p><p></p><p>For information about right to work, click here for English or here for Spanish.</p></div></div>"
    },
    {
        "position": "Engineering Aide (Co-op/Interns) - Hancock",
        "company": "OHM Advisors",
        "location": {
            "city": "Hancock",
            "state": "MI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7101b17b75640148d9c7ccc3a441f39e?lvk=fMKZ9bYVwYHeFZJTrwbBZQ.--MBd1HsQL7",
        "posted": "2021-09-16T18:35:52.084Z",
        "lastScraped": "2021-09-23T18:35:52.084Z",
        "description": "<div><div><p><strong>Come work for OHM Advisors, the community advancement firm.</strong></p><p>With the singular mission of <em>Advancing Communities</em>, our diverse, 500+ member team works collaboratively across multiple service areas, including architecture, engineering, planning, surveying, and construction engineering, to create better places for people.</p><p>We are a team of experts with individual specialties working together, driven to make a difference through people-focused problem solving, design, and ideas. In everything we do, we put people first. We create places for communities of people that help solve a problem and drive them forward-advancing the whole community today and well into the future.</p><p><strong>What You Will Contribute to OHM Advisors</strong></p><p>As an Engineering Intern student, you will work alongside experienced engineers and technicians who will provide training, direction, and guidance. Primary duties will utilize entry-level engineering skills to contribute to the design and plan development of municipal and transportation projects as well as oversee and document construction projects. OHM Advisors' internship and co-op program encourage students to submit their resumes and inquire about an opportunity that would best fit their needs. Internships are available year-round and typically last up to four months.</p><p><strong>Your Responsibilities</strong></p><ul><li>Assist project engineers in the application of principles, methods, and techniques of engineering design.</li><li>Collaborate with teams to solve problems and complete projects</li><li>Assist in developing design documents and construction plans utilizing CAD</li><li>Assist survey crew</li><li>Perform daily field inspections of construction work and prepare daily work reports</li><li>Communicate with the project team throughout the process and exercise safe work methods</li><li>Demonstrate strong project organization skills</li></ul><p><strong>Your Team</strong></p><p>As a trusted member of OHM Advisors' Group, you will join a growing, mission-driven team of innovative thinkers who collaborate daily, using our combined gifts and talents to advance the communities we serve continually.</p><p><strong>What You Will Need to Succeed</strong></p><ul><li>Current enrollment in college - studying civil engineering, environmental engineering, or construction management.</li><li>Excellent verbal and writing skills</li><li>Willingness to collaborate with a team and problem solve</li><li>Proficiency in Microsoft Office products, with emphasis on Word, Excel, and Outlook</li><li>Capable of working as a team member with other disciplines</li><li>Basic <span class=\"long-word\">AutoCAD/Microstation</span> experience preferred, Civil 3D experience a plus.</li><li>Material testing certifications is a plus</li><li>Able to work 40 hours per week.</li></ul><p><strong>Growth at OHM Advisors</strong></p><p>Advancement isn't just for our clients. We're committed to moving our team forward, too. At OHM Advisors, you'll enjoy challenging, meaningful work at a growing company creating innovative solutions for forward-thinking clients. But there's not just cool work on big projects. You'll be empowered to create your own career path in a culture that supports your individual professional development goals and encourages your pursuits through continued opportunities for growth. Read about some of our opportunities for career growth and enrichment on our website.</p><p><strong>OHM Advisors is an Equal Opportunity Employer (EOE).</strong> All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetic information, or protected veteran status.</p></div></div>"
    },
    {
        "position": "Data Analyst Part Time Intern - Undergrad",
        "company": "Emerging Threats Pro",
        "location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/94d9b3ee6b6d79e55680bc0608291493?lvk=3tHyE5Qe5a_69SxKkQzbIA.--MBdMl81K3",
        "posted": "2021-09-16T18:35:53.056Z",
        "lastScraped": "2021-09-23T18:35:53.056Z",
        "description": "<div><div><p>It's fun to work in a company where people truly BELIEVE in what they're doing!</p><p></p><p><i>We're committed to bringing passion and customer focus to the business.</i></p><p></p><p></p><p><b>The Role</b></p><p>Proofpoint is looking for a Data Analyst Part Time intern to add to Proofpoint's Resident CISO team. The Resident CISO team uses their deep knowledge of the cybersecurity industry, as well as cybersecurity expertise to help articulate Proofpoint's value proposition and industry strategy to customers, partners and prospects. </p><p>As a Data Analyst Part Time intern you will utilize Microsoft Office, HTML, CSS, JavaScript, SQL, Visual Basic for Applications, and Python. This team supports customer needs within the CIO/CISO community. You will be mentored by one of our Resident CISOs to support our sales and resident CISO team initiatives. You will gain significant knowledge on security architecture, data protection, and identity &amp; access management and how they relate to legal and regulatory frameworks. </p><p></p><p><b>Job Requirements</b></p><ul><li>Hands on experience with CSS, HTML, SQL, JavaScript, Python and other scripting languages</li><li>Experience with Microsoft Office Suite (Word, Excel, PowerPoint) required.</li><li>Basic knowledge of information security and risk mitigation principles, theories, and techniques preferred.</li><li>Experience or exposure to Microsoft Sharepoint, Workflow, &amp; Power Apps preferred</li><li>Progress toward undergraduate or graduate degree in Cyber Security, MIS, Business, Computer Science, Computer Engineering, Information Systems or Information Technology, Operations Research, Industrial Engineering or Business related degree required.</li><li>Ability to work independently and as part of a team</li><li>Attention to detail and ability to thoroughly think through problems</li><li>Ability to communicate clearly and concisely, both orally and in writing</li><li>Strong commitment to continuous learning</li><li>High attention to detail and quality</li><li>Time management</li></ul><p></p><p><b>Candidate Profile</b></p><p>You have the ability and interest in working <b>part time</b> (a maximum of 30 hours/week) in our <b>Sunnyvale, CA</b> office or remotely until it is safe to work in office. You are currently pursuing an <b>undergraduate degree</b>, and are successfully maintaining an above average GPA, preferably 3.0 or higher. This internship is scheduled to start immediately and run through August 2022.</p><p></p><p></p><p><i>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!</i></p></div></div>"
    },
    {
        "position": "IoT Development Intern (Summer 2022 | Remote)",
        "company": "Open Systems Technologies Inc",
        "location": {
            "city": "Grand Rapids",
            "state": "MI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/fc4d48b5d1c0535a608d80019f20639d?lvk=r1L2ot6BQuN5QNzl6okm3A.--MBf6quC_B",
        "posted": "2021-09-22T18:35:54.503Z",
        "lastScraped": "2021-09-23T18:35:54.503Z",
        "description": "<div><div><div><b>IoT - Software Development Intern (Summer 2022)</b></div><div></div><div><strong>Overview</strong></div><div>OST is looking to bring on an intern for the summer of 2022 to our Connected Products (IoT) team. This team is seeking highly talented and motivated interns that will work with our consultants developing solutions for our clients while gaining valuable real-work experience. </div><div></div><div><strong>What you'll accomplish:</strong></div><ul><li>Help deliver highly scalable cloud based solutions</li><li>Work effectively within <span class=\"long-word\">frameworks/architectures</span> based on internal and external standards</li><li>Focus on quality and security including automation, design reviews, and unit testing</li><li>Perform analysis and fine tuning of system performance and reliability</li><li>Work on multiple initiatives and recommend improvements</li><li>Develop and support projects throughout all phases of the development life cycle</li><li>Analyze technical issues and clearly communicate <span class=\"long-word\">recommendations/solutions</span></li><li>Utilize agile development methodologies</li></ul><div><b>What you'll bring:</b></div><ul><li>Currently a junior or senior level student at an accredited computer science, engineering or related program.</li><li>Pursuing a master's degree in Data Science- bonus!</li><li><span class=\"long-word\">Experience/exposure</span> with some of the following : C#, Java, Python and Node</li><li><span class=\"long-word\">Experience/exposure</span> with some of the following : SQL, NoSQL, Batch data processing, ETL, Qlik, Tableau, PowerBI</li><li>Object Oriented and Microservices development</li><li>Strong proven analytical abilities in relation to system design</li><li>Full-time hours during the summer with the ability to work part-time through the school year</li></ul><div><div><p>You matter! Your experiences matter, your journey with OST matters, and your success matters. People drive all our achievements, and we know that taking care of each other takes care of everything else. This is why we strive to promote diversity, equity and inclusion within our company, the work we do and our communities. We’ll surely face challenges along the way. And we’ll all continually learn from them to build a caring culture true to our guiding principles: honor, delight, serve, embrace, and learn. </p><div></div></div><div><p>OST is an equal opportunity employer that is committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected veterans status, or any other characteristic protected by federal, state, or local laws, and will not be discriminated against on the basis of disability. </p></div></div></div></div>"
    },
    {
        "position": "U.S. Grand Strategy and History Internship",
        "company": "Hudson Institute",
        "location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/hudson-institute-43257c61/u-s-grand-strategy-and-history-internship-f4607bb3?lvk=d-voI0oAKYYXO7V0RrUhcw.--MBfAvOYqB",
        "posted": "2021-09-21T18:35:56.337Z",
        "lastScraped": "2021-09-23T18:35:56.337Z",
        "description": "<div><p>Hudson Institute is seeking a Spring 2022, part-time intern to support the Institute's work on issues surrounding the role of history in formulating American grand strategy and improving national security. In addition to being exposed to critical issues in these fields, interns will spend significant time discussing these issues with their scholar. Onsite interns also attend weekly events featuring experts from Hudson Institute and across Washington, DC. Applicants should have a strong interest in American and European history, as well as knowledge of diplomatic and military history. A strong background in research, writing, and editing is preferred.</p><br><p>Responsibilities:</p><ul><li>Gathering and analyzing data for inclusion in reports and articles;</li><li>Keeping the scholar and team up to date on current events;</li><li>Assisting the scholar with research projects and presentations;</li><li>Assisting with articles, op-eds, reports, and briefing papers;</li><li>Assisting with administrative tasks and event support.</li></ul><strong>Qualifications:</strong><hr><p>Recent graduates or current students working towards a degree in political science, international relations, strategy, European studies, history, or related fields are encouraged to apply. Candidates should be able to work independently, manage their time wisely, and meet deadlines. They should be detail-focused, reliable, professional, and possess strong research, writing, editing, and analysis skills, as well as excellent communication, and interpersonal skills. Candidates should be proficient in all Microsoft Office applications. French language skills are preferred. </p><br><p><strong>How to Apply:</strong></p><hr><p>Please upload a cover letter, resume, and short, relevant writing sample (2-3 pages) in a single .pdf file. Due to the large number of applications that we receive, we regret that we can only contact those applicants who have been selected for an interview.</p><br><br><b><i>Job Posted by ApplicantPro</i></b><br></div>"
    }
]