[
    {
        "position": "Software Development Internship",
        "company": "Viewpoint",
        "location": {
            "city": "Portland",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/179f6caf2b0bbeebc26d40744f6184a1?lvk=FCNYNQllELg3UWBRy8wTTg.--MD7Qas45N",
        "posted": "2021-10-11T17:01:17.594Z",
        "lastScraped": "2021-10-18T17:01:17.594Z",
        "description": "<div><div><p><b>Software Development Intern</b><br><br>The Viewpoint Trimble Internship is a full time summer internship that will be approximately 12 weeks and will be based in our Portland, Oregon headquarters. Viewpoint is a provider of innovative construction-specific software solutions to the global construction and capital project industries. For over 40 years Viewpoint has been committed to bringing information technology-based efficiencies to construction projects and their stakeholders, engaging in a highly collaborative process with customers to ensure every product and service addresses key industry issues.<br>The internship program provides college students the opportunity to learn and practice both job-specific skills, as well as communication and teamwork skills in an innovative work environment. Interns will gain first-hand experience with daily operations. Interns will receive hands-on experience working with agile teams of Engineers and Analysts with industry-leading, vertical software solutions in the construction market.<br><br>As a Software Development Intern you'll join an existing agile development team where you'll help to create new foundations and functionality for our web offerings. Along the way, you'll learn a lot from our team and we hope you'll help us get better at what we do by challenging our assumptions and bringing in new ideas.<br><br><b>Required</b>:<br>College students working towards a degree in computer science, business intelligence, or web content management. Applicants should be in their junior or higher year and plan to continue working toward a degree.<br>Applicants should have an undergraduate GPA of 3.0 or better.<br>Demonstrates effective written and verbal communication skills.<br><br><b>Preferred</b>:<br>Knowledge of agile development methodologies.<br>Knowledge of Software Development, Quality Assurance, or User Experience principles and practices.<br>Ability to read and understand code used in typical frameworks.<br>Experience with relational databases (MS SQL Server, Oracle, etc.) and writing SQL queries.<br>Familiarity with the Microsoft Windows platform (server and workstation).<br>Basic understanding of computer networking (tcp/ip, routing, windows domains).<br>Basic troubleshooting and debugging skills.<br></p><p><b>Viewpoint is an Equal Opportunity Employer</b></p><p>DISCLOSURE for US-BASED POSITIONS ONLY: Viewpoint requires a criminal background investigation, and employment and education verification as a condition of employment.</p></div></div>"
    },
    {
        "position": "Software Engineer Internship (Part-time)",
        "company": "ClickBank",
        "location": {
            "city": "Boise",
            "state": "ID",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/clickbank-6c5e4508/software-engineer-internship-part-time-373ff0d9?lvk=Gu9xavgyLlAlAvlARi8eFA.--MDRWIaogc",
        "posted": "2021-10-16T17:01:19.521Z",
        "lastScraped": "2021-10-18T17:01:19.521Z",
        "description": "<div><p>***Only local applicants will be considered. This position does not support relocation***</p><p><strong>Do you want to be a part of one of Boise's top tech companies?</strong></p><p><strong>Are you you a problem-solver, learner, self-starter, and team player?</strong></p><p><strong>Then we are looking for YOU!</strong></p><p>CLICKBANK has an opening for a <strong>Software Engineer Intern!</strong></p><p><strong>What is ClickBank?</strong> <em>Hint: we are NOT a bank!</em><br></p><p><em>ClickBank is a top global e-commerce platform and affiliate marketplace powering many of the world's leading digital and physical products. ClickBank lowers the barrier to entry for entrepreneurs looking to start an online business and drives sales for online brands looking to establish an affiliate marketing program. The ClickBank platform enables growth through its proprietary affiliate marketplace, as well as powerful back-office tools such as integrated payments, analytics, and risk management. Over 20+ years, ClickBank has built a reputation for reliability and scale. To date, ClickBank has distributed $5 billion in commission payouts in more than 200 countries without ever missing a payment. <br></em></p><p><strong>What's in it for you?</strong><br></p><p>Here at ClickBank, we're empowered to grow both personally and professionally. From personal development opportunities, to a variety of epic team building adventures, as teammates and individuals, we're only getting stronger If you're looking for a new opportunity to develop (and maybe show off) your skills, we're looking forward to hearing from you! #ClickBankLife</p><p>For a cool message from our team, CLICK HERE!</p><p><strong>The Job....</strong></p><p>This person will work directly with the development and product teams to ensure a high- quality user experience across the Click Bank platform. </p><p><strong>KEY RESPONSIBILITIES INCLUDE, BUT ARE NOT LIMITED TO</strong><strong>:</strong></p><ul><li>Learning software engineering practices in an Agile environment</li><li>Learning to modify scripts for use, sharing and maintenance for the engineering staff</li><li>Running software migration scripts on request</li><li>Converting data from rest.client scripts into macros</li><li>Learning to add global functions to database schemas</li><li>Documenting system changes, SCRUM stories, test cases and other artifacts for easy reference</li><li>Learning to identify, document and fix minor bugs</li><li>Learn microservices logging, XML, JSON and integration with dashboard toolsets</li></ul><p><strong>Requirements</strong></p><ul><li>Currently working towards a degree in computer science</li><li>Strong communication skills, both spoken and written</li><li>Eagerness and capability to learn new technology</li><li>Hardworking with excellent attention to detail</li><li>Education or experience with any of the following (Java, REST, XML, JSON, MySQL)</li><li>Education or experience with Java, Selenium, or Cypress.</li><li>Education or experience with building test plans, defect reporting, integration testing.</li></ul><p><strong>PREFERRED SKILLS</strong><strong>:</strong></p><ul><li>Some experience with any of the following (AWS, Jira, Confluence, or Grafana)</li><li>An understanding of Agile concepts (e.g. Scrum, Kanban). </li></ul><p><strong>Benefits</strong></p><ul><li>The equipment you'll need to be successful</li><li>Flexible work schedule (we will work around your school schedule)</li><li>Potential to grow into a fulltime ClickBank employee after graduation or end of internship</li><li>Free snacks and coffee in office (lots of variety with healthy alternatives plus a fancy espresso machine)</li><li>Open modern work space with big windows overlooking Boise valley</li><li>Easy access work location is near Overland/Cole road near I-84 in center of Boise</li><li>9 Paid <span class=\"long-word\">Holidays...including</span> your birthday (because that should be a holiday) </li><li>Wellness Reimbursement Program</li><li>Frequent team buildings, contests, gifts, and events</li></ul><p>At ClickBank we have a laid-back, yet high performing culture. Our team is everything to us! We believe in treating our employees (and interns) well, having fun together, and cultivating an exciting collaborative environment! #WorkHardPlayHard</p><ul></ul></div>"
    },
    {
        "position": "Technical Direction Intern (Virtual), DreamWorks, Spring 2022",
        "company": "NBC Universal, Inc.",
        "location": {
            "city": "Glendale",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3f4f21cb3fa7ddfa28d6b51096399946?lvk=sq8VyfWHoBxsXXyiUwX2HQ.--MDRVVSH8s",
        "posted": "2021-10-16T17:01:26.968Z",
        "lastScraped": "2021-10-18T17:01:26.968Z",
        "description": "<div><div><p>Job Title: Technical Direction Intern (Virtual), DreamWorks, Spring 2022 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: DreamWorks Animation is seeking a qualified intern to join our Technical Direction team. This intern will observe and assist Technical Directors with writing tools for the production pipeline in order to gain an understanding of their daily activities. This intern will learn how to develop tools and provide artist support for large-scale feature animation productions. Through this internship, the individual will gain firsthand experience working in a fast-paced, creative environment while being exposed to various production workflows and strategies.<br><br><b>Responsibilities: </b></p><ul><li>Design and develop new software tools and applications to assist artists in production </li><li>Test, debug, and extend existing tools and systems </li><li>Provide technical support to production artists </li><li>Provide support for any additional administrative and data-wrangling tasks as needed </li></ul><br>Job Number: 64797BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation Internships <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> Experience in programming <br>Enrolled in an Undergraduate or Graduate Program or be a recent graduate (within six months of graduation date) <br>Strong organizational skills <br>Ability to work independently <br>Ability to commit 12 weeks to the internship and work remotely <br>Ability to work part time (16-24 hours/week) from January 2022 - April 2022<br>Must have own equipment (computer, headphones, etc.) and stable Internet connection<br>Must have unrestricted authorization to work in the U.S. without requiring a new Visa or sponsorship <br>Desired Characteristics: Major in Computer Science, Computer Engineering, Visualization or Digital Media (or equivalent) <br>Experience in programming languages such as Python, C++ or JavaScript <br>Computer Graphics and web development experience <br>Experience with project-tracking software such as Jira or equivalent <br>Understanding of digital content creation applications such as Maya, Houdini, and/or Nuke Interest in Feature Animation <br>Solid grasp of revision control systems such as Git <br>Familiarity with User Experience (UX) concepts and/or User Interface (UI) design and development <br>City: Glendale <br>Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. <br></div></div>"
    },
    {
        "position": "RN, Pediatric Hematology/Oncology/BMT, PT, Nights",
        "company": "Oregon Health & Science University",
        "location": {
            "city": "Portland",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/78488c5f9e1f70d308f54e10692b0a40?lvk=H7efOM0mTRyvz1w1YxVReA.--MDakicwyc",
        "posted": "2021-10-16T17:01:28.801Z",
        "lastScraped": "2021-10-18T17:01:28.801Z",
        "description": "<div><div><p>Department Overview </p><p>The PHOT provides Intermediate Level of Care to patients ages 0-18. Obstetric patients less than 18 with a new Hem/Onc/BMT diagnosis are case by case. Patients with specific pediatric oncology diagnosis may be followed until the age of 25 years. Presenting diagnosis may include leukemia, brain tumors, bone tumors, sarcoma, lymphomas, blood diseases, immunological diseases, storage diseases, Bone Marrow Transplants and Graft vs Host Disease patients. Nurses on this unit also provide support to Hem/Onc/BMT patients on other units, to include but not limited to chemotherapy support, expertise with BMT patients and central lines.</p> Function/Duties of Position <p>The OHSU Clinical registered nurse (RN) provides compassionate, evidence-based, and efficient care to individuals, families, communities and patient populations. The Clinical RN's care delivery is consistent with the Oregon Nurse Practice Act, the ANA Scope and Standards of Practice, and the ANA Code of Ethics. The Clinical RN demonstrates the professional role obligations of scientist, leader, practitioner, and knowledge transferor [Onsomble Model of the Professional Role]. Professional accountability enriches the Clinical RN's engagement as a leader in promoting an inter-professional culture of collaborative decision-making, innovation, life-long learning, and teamwork. The Clinical Nurse exemplifies the principles of a Culture of Safety by committing to a Just Culture, a Reporting Culture, Learning Culture, and an Engaged Informed Culture</p> Required Qualifications <ul><li>External Applicants: <strong>BSN - </strong>Baccalaureate Degree in Nursing from a program accredited by Commission of Collegiate Nursing Education (CCNE), Accreditation Commission for Education in Nursing (ACEN) or Commission for Nursing Education Accreditation (CNEA). *<strong>Current OHSU employees: BSN preferred</strong></li><li>Communication skills including fluency in oral and written English</li><li>Basic computer skills including the ability to send/receive email, navigate information technology associated with the position, and use Electronic Health Record information and tools</li><li>Current unencumbered Oregon RN license</li><li>Current BLS certification issued by the American Heart Association or the Military Training Network</li><li>Current PALS certification</li><li>Must be able to perform the essential functions of the position with or without accommodation</li></ul> Preferred Qualifications <ul><li>One year <span class=\"long-word\">Hematology/Oncology/BMT</span> Experience or completion of a Pediatric <span class=\"long-word\">Hematology/Oncology/BMT</span> Internship program</li><li>APHON/ONS Chemotherapy Certification</li></ul> All are welcome Oregon Health &amp; Science University values a diverse and culturally competent workforce. We are proud of our commitment to being an equal opportunity, affirmative action organization that does not discriminate against applicants on the basis of any protected class status, including disability status and protected veteran status. Individuals with diverse backgrounds and those who promote diversity and a culture of inclusion are encouraged to apply. To request reasonable accommodation contact the Affirmative Action and Equal Opportunity Department at 503-494-5148 or aaeo@ohsu.edu.</div></div>"
    },
    {
        "position": "Business Development Interrn",
        "company": "Florida Courier & Logistics Service",
        "location": {
            "city": "Vero Beach",
            "state": "FL",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/florida-courier-logistics-service-9ce01f07/business-development-interrn-9b095969?lvk=MLvpWzVTpgHJ7tKZ9iUuww.--MDcbchVmJ",
        "posted": "2021-10-14T17:01:34.303Z",
        "lastScraped": "2021-10-18T17:01:34.303Z",
        "description": "<div><p>This position begins as a part-time, entry level, internship and can become full time (depending on your availability) upon completion of self-paced internship program.</p><p>NOTE: Must currently live in or near Vero Beach, Florida.<br><br><strong>Experience not required.</strong> A strong desire to succeed and a positive attitude are essential. All training will be provided in a concentrated internship program, designed to make you successful and well compensated. You will receive continual on the job training and mentoring while gaining experience.<br><br><strong>This position is ideal for someone who is:</strong><br>* A quick learner – Enjoys learning and can apply newly acquired knowledge.<br>* Detail-oriented – Pays close attention to the details which make up the bigger picture<br>* Achievement-oriented – Takes on challenges, but recognizes the risks entailed<br>* Autonomous – Works towards goals independently and with minimal supervision<br>* Innovative -- Prefers working in unconventional ways or on tasks that require creativity<br>* Stress tolerant – Is not easily stressed by rapidly moving day-to-day events<br><br><strong>Job Type</strong>: Part-time internship becoming full time career employment. Most work can be performed remotely, from home.<br><br><strong>You will develop and maintain relationships</strong> with local businesses to build our company’s market share, success, and growth by calling and visiting with current and prospective clients throughout Florida's Treasure Coast (Stuart, Port. St Lucie, Fort Pierce, Vero Beach, Sebastian, Melbourne, Merritt Island, etc. by:<br>* Researching current industry and market trends,<br>* Collecting / analyzing data from customers, clients, and competitors<br>* Developing / proposing new business ideas<br><br><strong>Your personal and professional qualities</strong> knowledge, skills, and abilities must include<br>* Strong academic background. HS graduate with excellent GPA (Bachelor's preferred)<br>* Excellent verbal and written communication skills complemented by a good listening ability<br>* Proficiency in Microsoft Office (Word, Excel, PowerPoint, Outlook, and Access) applications<br>* Understanding social medial (Google, Facebook, Instagram, TikTok, etc.) marketing concepts<br>* Strong, service-industry-related (Hospitality, Retail, or Restaurant) customer contact business experience.<br>* Well organized, observant, intuitive, and extremely detailed<br>* Very reliable with excellent time-management skills<br>* Able to manage stress and rapid pivots with a good sense of humor<br>* Fully remote, available 20+ hours a week including via zoom video<br>* Professional in appearance, dress, and demeanor.<br>* Critical thinker and with problem-solving skills and ability to propose mutually beneficial solutions<br>* Being independent, self-motivated, committed, and multidisciplinary.<br>* Availability and willingness to travel locally (up to 50% of the time) to meet with <span class=\"long-word\">prospective/existing</span> clients<br>* Cultivating and maintaining current client relationships<br>* Monitoring operations to ensure contracts are executed as agreed<br>* Identifying, researching, and reaching new prospective clients<br>* Creating and presenting mutually beneficial proposals<br>* Negotiating contract terms with prospective clients<br><br><strong>You must have a:</strong><br>* Home work environment conducive to conducting business undisturbed by telephone<br>* Reliable computer able to display on multiple screens, and a laser printer<br>* Relatively late model passenger vehicle in good condition and appearance to travel to client sites and occasionally transport clients to various venues.<br><br><strong>Salary:</strong> $15 per hour beginning upon completion of a demonstration project which you must complete and submit during the two-week (or less) self-paced first phase of internship. Up to $20/hour draw against commission upon successful completion of internship program. We are a goal oriented, accomplishment driven company, in which results are rewarded. We offer a flexible work schedule, expense account, and bonuses paid upon goal achievement. Benefits: Paid vacation and stock options after one year.<br><br><strong>Work Location</strong>: Home based - 90% remote. Attendance a meetings, etc. will be required. Your prospecting territory will consist of the Florida Treasure Coast, where you will call upon and engage with current and prospective client, determine their requirements, and present proposals designed to meet their needs. Multiple site visits will be necessary. Work in the field will be approximately 50%. Overnight travel is NOT anticipated at this time.<br><br><strong>Application procedure</strong>: Reply to this post via the ZIp provided link. A resume and a cover letter specific to your qualifications for this position will get you ahead of applicants who do not submit these documents. Tell us why you are the right person for this job and why we should hire you. DO NOT submit a generic cover letter! Be sure to include your full name, phone number, and best time to call.<br><br>Your interview(s) whether by telephone, zoom, or in person will consist mostly of questions about how you meet the criteria and qualifications listed in this post. Prepare accordingly.<br><br>Thank you for your interest.</p></div>"
    },
    {
        "position": "STDT INTERN",
        "company": "UC San Francisco",
        "location": {
            "city": "San Francisco",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e2bd032b6c481eb0892d2754dbca636c?lvk=IkkujNXAjwVqIiFCuHFldA.--MDaf1P7ER",
        "posted": "2021-10-14T17:01:35.297Z",
        "lastScraped": "2021-10-18T17:01:35.297Z",
        "description": "<div><div><p>Job Code and Payroll Title: 004740 STDT INTERN <br>Job Summary: This position is a Contract position for 6-12 months.<br><br>The University of California San Francisco (UCSF) Medical Center is seeking an Intraoperative Neurophysiological Monitoring (IONM) Fellow interested in obtaining training for a career in IONM. This position targets two distinct classes of candidates: Transition and Clinical Classes. The Transition Class candidate possesses a doctorate in advanced scientific or medical background and seeks didactic and clinical training in order to transition into the field of IONM. The Clinical Class candidate possesses an undergraduate degree with didactic training in IONM, but seeks clinical experience to become credentialed in IONM.<br><br>During the first six months, the goal of this program is for the fellow to receive supervised training, while obtaining the case volume to meet certification requirements, in all aspects of IONM provided for UCSF surgical procedures (including neurosurgery, otolaryngology, vascular and orthopedic surgery) in which neural structures are at risk. To complement the hands-on training, the fellow will learn the IONM background through participation in regular tutorials, seminars and from studying primary and secondary sources.<br><br>Continuation in the program for an additional six months is contingent on obtaining a passing score on the CNIM examination and meeting departmental standards. During the second part of the fellowship, the fellow will expand their IONM capabilities by providing IONM services with increasing complexity and independence, in preparation for a career in IONM.<br><br>All patient care team members are responsible to meet patient needs, demonstrate willingness to learn new skills, and foster a harmonious work environment in which high quality patient care and customer service is consistently provided.&nbsp; Team members promote a cooperative working relationship with each other, physicians, other disciplines and the public by facilitating and enhancing communication, displaying honesty and respect, displaying sensitivity to cultural differences, and expressing and accepting feedback in a professional manner.<br>&nbsp; <br>Organization: Health <br>Req Number: 62273BR <br>Job Title: Neurophysiological Monitoring Fellow <br>Employee Class: Contract <br>Percentage: 100% <br>Shift Length: Variable <br>Shift: Variable <br>Bargaining Unit: 99 - Policy-Covered (No Bargaining Unit) <br>Job Category: Allied Health <br>Required Qualifications: </p><ul><li>Certification in Neurophysiologic Intraoperative Monitoring (CNIM) within 6 months of the start of internship.</li><li>Transition-Class: Doctorate degree in physical science, life science or clinical allied health profession (Ph.D., M.D., D.O., D.C.,Au.D. and D.Pt.) OR;</li><li>Clinical-Class: Undergraduate degree in physical science, life science or clinical allied health profession (B.A. or B.S.) with a specialization in IONM.</li><li>Strong computer literacy.</li><li>Literacy and Fluency in English; Clear, concise written documentation and interpersonal communication skills.</li></ul><br>Preferred Qualifications: <ul><li>Coursework in anatomy, electrophysiology, neuroscience &amp;/or medicine.</li><li>Experience with research methodology and scientific publications.</li><li>Potential to qualify for DABNM after meeting experience prerequisites (Transition-Class).</li><li>Language mapping or neuropsychological testing experience.</li></ul><br><span class=\"long-word\">License/Certification:</span> <ul><li>Certification in Neurophysiologic Intraoperative Monitoring (CNIM) within 6 months of the start of internship.</li></ul><br>Position Type: Full Time <br>Department Name: Neuromonitoring <br>Equal Employment Opportunity: The University of California San Francisco is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. <br>Department Description: The Department of Neuromonitoring at UCSF is committed to the highest standard of intraoperative neurophysiology (IONM) through skilled provision and original scholarship. Our Department provides IONM to preserve the neural function of nearly 3000 patients a year undergoing surgery in these top-ranked UCSF departments (U.S. News &amp; World Report): Neurosurgery, Orthopedics and Otolaryngology. Our department covers a wide-variety of pediatric and adult conditions and procedures ranging from cortical and subcortical mapping to preserve language function during awake craniotomies for Glioma resection to multimodality monitoring to preserve spinal cord and nerve root integrity in patients treated for spinal deformity. It is through the diversity of our group, which is an international composition of DABNM and CNIM neurophysiologists with backgrounds in medicine and science, that we meet the demands of medicine to preserve and protect the neurologic health and well-being of our patients at UCSF Medical Center. Additionally, our group contributes to IONM serving in the leadership of the American Society of Neurophysiological Monitoring (ASNM) and the American Board of Neurophysiologic Monitoring (ABNM) and through regular contributions at IONM meetings and to the scientific literature. Lastly, through our fellowship program at UCSF and through contributions to education of IONM at the national meetings, we invest in the future of IONM by training the next generation of neurophysiologists to meet UCSF excellence in patient care. <br>About UCSF: At UCSF Health, our mission of innovative patient care, advanced technology and pioneering research is redefining what's possible for the patients we serve - a promise we share with the professionals who make up our team. <br><br> Consistently ranked among the top 10 hospitals nationwide by U.S. News &amp; World Report - UCSF Health is committed to providing the most rewarding work experience while delivering the best care available anywhere. In an environment that allows for continuous learning and opportunities for professional growth, UCSF Health offers the ideal atmosphere in which to best use your skills and talents. <br>Pride Values: UCSF is a diverse community made of people with many skills and talents. We seek candidates whose work experience or community service has prepared them to contribute to our commitment to professionalism, respect, integrity, diversity and excellence - also known as our PRIDE values. <br><br> In addition to our PRIDE values, UCSF is committed to equity - both in how we deliver care as well as our workforce. We are committed to building a broadly diverse community, nurturing a culture that is welcoming and supportive, and engaging diverse ideas for the provision of culturally competent education, discovery, and patient care. Additional information about UCSF is available at diversity.ucsf.edu <br><br> Join us to find a rewarding career contributing to improving healthcare worldwide. <br>Location: Parnassus Heights (SF) <br></div></div>"
    },
    {
        "position": "Clinical Supervisor - LCSW",
        "company": "Community Research Foundation",
        "location": {
            "city": "Oceanside",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/community-research-foundation-fd0c2678/clinical-supervisor-lcsw-cffa053f?lvk=XKVjF4sns3YbKglKzUf7qg.--MDR2zWKjZ",
        "posted": "2021-10-09T17:01:36.759Z",
        "lastScraped": "2021-10-18T17:01:36.759Z",
        "description": "<div><p><strong>Clinical Supervisor - LCSW (4968)</strong> (Regular Part-Time, Hourly)<br><strong>Program/Location:</strong> Turning Point (Oceanside)<br></p><p><strong>Clinical Supervisor / Licensed Clinical Social Worker – Mental Health Services for Transitional Residential Program</strong></p><p><strong>Hours</strong>: 10 hours per week; schedule to be determined in collaboration with program management</p><p><strong>Pay Rate</strong>: $47.00 per hour</p><p><strong>In order to create a workplace that meets maximum health and safety standards, CRF follows all mandated COVID-19 safety protocols and guidelines as outlined by the State of California, San Diego County, and the CDC. <em>All new hires are required to show proof of completed vaccination before their first date of work, unless legally exempted</em>. </strong></p><p><strong>Community Research Foundation (CRF) inspires and mentors the next generation of mental health professionals! </strong>This position provides clinical supervision and mentoring to new professionals who need hours to advance in their profession. It's a great opportunity to guide and support these new clinicians and therapists!</p><p><strong>Program Overview:</strong><br><br>Located in Oceanside, CA, Turning Point Crisis Center is a Short Term Acute Residential Treatment (START) program provides intensive, community-based crisis residential services for adults throughout San Diego County. We deliver a unique alternative to psychiatric hospitalization to clients who are experiencing a psychiatric crisis that is not manageable in an outpatient basis. Our services are provided in a home-like environment that specializes in the psychosocial rehabilitation of each individual.</p><p>Built around a bio-psychosocial approach, our multi-disciplinary team addresses each aspect of a client's unique situation, including mental health, co-occurring substance abuse, housing, medical/medication needs, and establishing connections to social service supports within the community to facilitate successful transition beyond the START program.</p><p><strong>Typical Duties of the Clinical Supervisor</strong></p><ul><li>Provides individual and group supervision of interns and practicum students from various local college programs</li><li>Follows Professional Board requirements and educational institution contracts and requirements</li><li>Participates in utilization management</li><li>Reviews and co-sign clinical records</li><li>Is available for on-call clinical consultation</li></ul><p><strong>Required Skills and Qualifications</strong></p><ul><li>Current and valid license to practice as a Licensed Clinical Social Worker (LCSW) in California and must be kept current during length of employment</li><li>Experience working with the severe and persistent mentally ill population and with adults/older adults is required; experience with co-occurring disorders also strongly preferred</li><li>Eligible to provide clinical supervision per Board of Behavioral Sciences criteria</li><li>Previous supervisory experience is preferred</li><li>Basic computer skills are required; proficiency in MS Office applications required</li><li>Ability to thrive in a fast-paced environment is essential</li><li>Ability to pass <span class=\"long-word\">criminal/background</span> clearance</li></ul><p></p><p></p><p>Be a part of our vibrant non-profit organization and make a difference in the lives of the people we serve!</p><p></p><p><strong>We are an Equal Opportunity Employer</strong></p></div>"
    },
    {
        "position": "Equipment & Operations Internship",
        "company": "Css Farms",
        "location": {
            "city": "Winnemucca",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/659b2494830ab885a03040b93de48718?lvk=sEpAurdhVGJIJmZfX4UwAA.--MDUICoPbV",
        "posted": "2021-10-16T17:01:37.766Z",
        "lastScraped": "2021-10-18T17:01:37.766Z",
        "description": "<div><div><p>CSS Farms is a multi-state agricultural business with a mission of Growing Great Together.&nbsp; We achieve this by leading the way in stewardship and solutions for every field, every load, every day.&nbsp; &nbsp;</p><p>At CSS Farms we take great pride in doing the job right and believe our best work is achieved when we work together.&nbsp; Farming is our way of life, we have a deep passion for the land, our families, and our communities.&nbsp; We have a legacy rooted in solving hard problems and tackling new business ventures.</p><p>&nbsp;</p><p><strong>Summary </strong></p><p>The Equipment &amp; Operations Intern works closely with the CSS Farms Equipment Management Team to support and learn hands-on skills related to farm operations. &nbsp;As the Equipment &amp; Operations Intern, you will gain exposure to all facets of our chip potato operation through field work, research projects, and educational opportunities.</p><p>&nbsp;</p><p><strong>Responsibilities </strong></p><p>In this role, you will:</p><ul><li>Support the site Equipment Manager with maintenance, repair, calibration, and operation of field equipment</li><li>Assist with fabrication, modification, and solving technical problems on equipment</li><li>Participate in equipment sourcing and purchasing</li><li>Provide support for equipment related inventory</li><li>Assist with planting, harvesting, and irrigation management as necessary</li><li>Give and receive real-time performance feedback to further your growth and leadership development.</li><li>Take on other tasks and responsibilities, as needed.</li></ul><p>&nbsp;</p><p><strong>Physical Demands </strong></p><ul><li>Walking and working outdoors in the elements.</li><li>Driving between farm sites to move samples and other supplies.</li><li>Regularly lifting objects of up to 40-50 lbs.</li></ul><p>&nbsp;</p><p><strong>Expected Hours of Work </strong></p><ul><li>Mid-May through Mid-August (Start and End Dates are Flexible based on Candidate's schedule)</li><li>Typical, daily farm hours are 7 AM to 5 PM, Monday through Friday, with occasional hours outside this window during peak times <span class=\"long-word\">(Planting/Harvest).</span></li></ul><p>&nbsp;</p><p><strong>Required Qualifications </strong></p><ul><li>Are pursuing an Associates or Bachelor's degree in agricultural engineering, agribusiness, crop science, mechanized systems management, equipment maintenance, or a related field.</li><li>A valid driver's license or the ability to obtain one and pass vehicle insurance verification.</li></ul><p>&nbsp;</p><p><strong>Desired Qualifications </strong></p><ul><li>Ability to understand and operate computerized equipment</li><li>Are generally tech savvy and can use basic software systems such Excel, Word.</li><li>Possess excellent organizational and project management skills.</li><li>Are an excellent communicator; asking for and valuing positive and constructive feedback in an effort to grow within your role and career.</li></ul><p>&nbsp;</p><p><strong>Work Authorization </strong></p><ul><li>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</li></ul><p>&nbsp;</p><p><strong>Benefits </strong></p><ul><li>Receive a competitive pay package</li><li>Paid Holidays</li><li>Use of a company vehicle, when applicable</li><li>Reimbursements for eligible travel expenses</li><li>Participate in real-world farming equipment and maintenance management from a leading, US potato company.</li><li>Make valuable contacts within the industry who can assist you with your career development, now and in the future.</li><li>Gain an understanding of the <em>entire </em>business, including operations, employee management, and logistics by spending time with Farm, Equipment, and Operations Managers.</li></ul><p>&nbsp;</p><p><strong>AAP/EEO Statement </strong></p><p>CSS Farms is an EOE.</p><p>CSS Farms expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.</p></div></div>"
    },
    {
        "position": "JR0189686 - US Applications Design in Center (ADC) Graduate Technical Intern",
        "company": "Intel",
        "location": {
            "city": "Folsom",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/52da9a0affa8741dd20c8af0f768e753?lvk=jyHFJEbOAD48wHfHA-pv2A.--MDRR3fEzo",
        "posted": "2021-10-16T17:01:38.869Z",
        "lastScraped": "2021-10-18T17:01:38.869Z",
        "description": "<div><p>Job ID: JR0189686 Job Category: Intern/Student Primary Location: Folsom, CA US Other Locations: Job Type: Intern US Applications Design in Center (ADC) Graduate Technical Intern Job Description The Application Design-In Center (ADC) in Intel's Sales and Marketing group provides world-class support to our large customers and developer partners. As a member of this team you will have the opportunity to work on Intel's Atom, Core, Xeon product lines. Responsibilities will include, but not limited to: Investigating, debugging, and troubleshooting various software/hardware designs in support of Intel Architecture designs across all product segments. </p><p>Replicating customer issues and researching problems and work with Intel engineering teams to communicate issues, and coordinating the technical resources required to resolve problems. Work closely with technical engineers to supports customers from product definition, hardware design/bring up, validation stages, and through postproduction support. A successful candidate will demonstrate the following behavioral traits: Highly organized and disciplined Excellent written and verbal communication skills Self-starter, self-motivator, and highly adaptable Qualifications This position is not eligible for employment-based visa/immigration sponsorship. </p><p>Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience. </p><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience would be obtained through a combination of prior education level classes, and current level school classes, projects, research and relevant previous job and/or internship experience. </p><p>Minimum Qualifications: Must be pursuing a Master's degree in Computer Science, Electrical Engineering or related field. At least 6+ months of experience with computer architecture Minimum GPA: 3.0 Must be able to work Full Time starting Summer 2022 and continue Part time (around 20 hours per week) for 2022-2023 school year Preferred Qualifications: 3 + months of experience with: - Reviewing and interpreting schematics, PCB layout files - Knowledge with lab equipment, such as oscilloscopes and logic analyzers, and working with firmware programmers - Familiar with software development practices/tools on IA-based platforms. - Understanding of Linux or Windows environment Inside this Business Group Intel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. </p><p>SMG works across business units to amplify the customer voice and deliver solutions that accelerate their business. We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. </p><p>Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions. Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. <span class=\"long-word\">USInternJR0189686FolsomSales</span> and Marketing</p></div>"
    },
    {
        "position": "Program Specialist I - Return Utah",
        "company": "State of Utah",
        "location": {
            "city": "Salt Lake City",
            "state": "UT",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5a4162c08e0fc9b780313c432225a256?lvk=8U_gnEwUTqBdvViXYxoibQ.--MDSlP4Lqs",
        "posted": "2021-10-14T17:01:40.403Z",
        "lastScraped": "2021-10-18T17:01:40.403Z",
        "description": "<div><div> Job Description <p></p><p><strong>The new Return Utah program is similar to an internship designed for adults looking to re-enter the workforce after an extended absence. These opportunities are structured as return-to-work positions that provide the experience, training, skills, and mentoring an individual needs to return to the workforce.</strong></p><strong><br></strong><p><strong>Return Utah is a 16-week program&nbsp;for people who have taken a career break of at least two years for reasons such as starting or raising a family, caring for a family member, military service, continuing education, or other personal/career related reasons.</strong></p><strong>&nbsp;</strong><br><strong>The program will commence on Monday January 3rd, 2022, with the first week of the program consisting of learning, development and workplace orientation.</strong><br><strong><br>This is a part-time, experience-only Return Utah opportunity. Please note, that while we will provide access to resources that will enable you to explore further employment opportunities, your participation does not guarantee employment with the State of Utah upon the conclusion of the program.<br>&nbsp;</strong><br><strong>To be eligible for this return-to-work opportunity, candidates must:</strong><ol><li><strong>Be on a career break of two or more years at time of application</strong></li><li><strong>Have prior professional experience in functional area of interest</strong></li></ol><strong>#oneutah &nbsp;#returnutah</strong><br>&nbsp; <div><strong>**The anticipated offer amount for the successful candidate will be $20.00-$24.00/hour.**</strong></div>&nbsp; <br><strong>PRINCIPAL DUTIES</strong><br>In this position, you will focus on relevant legislation for the Department of Commerce during the legislative session. With the direction of the Deputy Director, you will track legislation affecting the department, attend legislative update meetings during the session, observe relevant committees and floor time, and provide post-session analysis on rules that require drafting, updates to each division's laws, and issues of statewide significance. At the end of the session, you will create a post-session report. Help with projects as assigned. <br>&nbsp; <br>&nbsp; <strong>THE IDEAL CANDIDATE</strong><br>&nbsp;Our model candidate will: <ul><li>Be effective at organizing information in an intuitive, readable way.</li><li>Have excellent report writing skills.</li><li>Possess above-average computer skills, especially with Excel, Word, Google Sheets, and Google Docs.&nbsp;</li><li>Have excellent work ethic.&nbsp;</li><li>Be able to work independently and collaboratively when needed.&nbsp;</li><li>Have the ability to communicate professionally with Agency Management.&nbsp;</li></ul><strong>PREFERENCES</strong><br>Preferences may be given to applicants with the following: <ul><li>Related education (political science, public administration, economics, business administration, international relations, public policy, English, communications, public health).&nbsp;</li><li>Experience, knowledge, and/or understanding of state <span class=\"long-word\">government/political</span> process (law-making, the legislative process, etc.).&nbsp;</li></ul><strong>WHY YOU SHOULD JOIN OUR TEAM</strong><br>During this Return Utah opportunity, you will work closely with senior leadership at the Department of Commerce, including reporting to the Deputy Director. You will attend and contribute at meetings with leaders from multiple state agencies. You will be trained on how to utilize the tools at le.utah.gov to track legislation in process. You will have the opportunity to gain practical experience of the political process in action, following legislation from draft bills to committee hearings and floor debates <br>&nbsp; &nbsp; <br><strong>AGENCY</strong><br>The Department of Commerce is the licensing and registration agency for Utah's professional and business community. Its mission is to strengthen trust in Utah's commercial activities through education, licensing, enforcement, and regulation. &nbsp;We provide oversight of business registrations, trademarks, Uniform Commercial Code filings, professional and occupational licensing, consumer protection, public utilities, securities, real estate and residential mortgage lending. Please visit our website for more information about our agency. <p></p> Supplemental Information <p></p><ul><li>This position is not eligible for telework&nbsp;</li><li><p>This is a part-time position, 20 hours per week&nbsp;</p></li><li><p>Valid driver license required to drive a motor vehicle on a highway in this state per UCA53-3-202(1)(a)</p></li></ul>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <p></p></div></div>"
    },
    {
        "position": "System Administrator",
        "company": "Simply Smart Technology",
        "location": {
            "city": "Milwaukee",
            "state": "WI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/simply-smart-technology-67e69f14/system-administrator-950648de?lvk=QA29pP8QGu_873pxqlS3jg.--MDMLt90X7",
        "posted": "2021-10-15T17:01:42.288Z",
        "lastScraped": "2021-10-18T17:01:42.288Z",
        "description": "<div><p>Simply Smart Technology is an IT Managed Services Provider seeking a highly skilled Systems Administrator to join our growing company.</p><p>Our team assists local businesses by providing comprehensive technology solutions for their companys internal technology. Our technical team works closely with our clients on desktop, server, and network technology within a wide variety of environments.</p><p><strong>The Role:</strong></p><p>The System Administrator works directly with our clients and help desk team to deliver high-quality, accurate, and helpful technical support.</p><ul><li>Handle complex troubleshooting of desktop and server systems</li><li>Work on escalated support requests</li><li>Spot issues and create plans to proactively resolve technical issues</li><li>Find the root cause of technology issues</li><li>Create change and project plans, participate in technical reviews plans, and implement plans</li><li>Be prepared to escalate a request, pull in a teammate, or ask for help in the right situations</li><li>Collaborate and work with teammates on new and ongoing issues</li><li>Create documentation about common problems/fixes, computer systems, servers, and network layouts</li><li>Cross-train teammates by co-working on troubleshooting tasks</li><li>Be a resource for junior members of the technical team by teaching, training, and answering questions</li><li>Work in a fast-paced environment with deadlines</li><li>Travel to and from client sites and company offices (mileage reimbursed)</li></ul><p><strong>Requirements</strong></p><p>We are looking for individuals with good character, a genuine interest in technology, and the ability to troubleshoot and resolve complex technical problems.</p><p>Location:</p><ul><li><strong>Must be presently living in or around the Milwaukee, WI area</strong></li></ul><p>Education:</p><ul><li><strong>Bachelors of Science from accredited 4 year University</strong></li></ul><p>Work Experience:</p><ul><li>3-5 years experience doing direct hands-on troubleshooting and IT Support</li><li>2-3 years experience working on servers side technology</li><li>Previous experience in computer support, internship, part-time job, computer lab, etc.</li></ul><p>Technical Skills:</p><ul><li>In-depth knowledge of command line utilities</li><li>Expert working with Windows 7, 8, 8.1, and 10 operating systems</li><li>Comfortable working with Mac computers / OS X</li><li>Expert working with Windows Server operating systems</li><li>Expert understanding of core Microsoft technologies like Active Directory, Group Policy, DNS, DHCP</li><li>Expert understanding of one or more server side software like Microsoft SQL, Microsoft Exchange</li><li>Expert understanding of one or more of the Microsoft and Google cloud based platforms</li><li>Experience with virtualization technologies</li><li>Experience writing batch scripts, PowerShell, or VBScript is a plus</li></ul><p>Personal Characteristics:</p><ul><li>Ability to follow written processes</li><li>Team oriented approach to problem solving</li><li>Excellent communication skills, written and telephone</li><li>Communicates directly and clearly</li><li>Ability to self-start</li></ul><p>Physical Demands:</p><ul><li>Ability to carry equipment up to 50 pounds</li><li>Ability to mount equipment in a rack</li><li>Ability to install equipment on a wall</li><li>If handicapped, reasonable accommodations will be made, we are an equal opportunity employer</li></ul><p>Certifications:</p><ul><li>Industry certifications are desired</li></ul><p>Employment Eligibility:</p><ul><li>Must be eligible to work in the US without needing sponsorship</li></ul><p><strong>Benefits</strong></p><p>Salary negotiable based on experience.</p><p>Full-time position.</p><p>Benefits include health insurance, dental insurance, vision insurance, 401K, and commuter transit benefits.</p></div>"
    },
    {
        "position": "Mental Health Counselor for Adult Outpatient Program",
        "company": "Compass Health",
        "location": {
            "city": "Bellingham",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/compass-health-d5dd3696/mental-health-counselor-for-adult-outpatient-program-56f7f99a?lvk=IiKiwFJ_G7K6XgW4kpUFNA.--MDNgYTvKZ",
        "posted": "2021-10-15T17:01:43.608Z",
        "lastScraped": "2021-10-18T17:01:43.608Z",
        "description": "<div><p>Compass Health is currently looking for a <strong>Mental Health Counselor / Clinician II for our Adult Outpatient program in Whatcom County. </strong>Our new Clinician will be provide a range of clinically indicated services, including but not limited to individual psychotherapy, group therapy, family therapy, and case management services for adults with behavioral health conditions and their families/natural supports. . This position is responsible for assessing client/family functioning and needs, and partnering with the client/family to develop an individually tailored care plan designed to address the client/families goals. This position may also provide clinical support to Interns as appropriate.</p><p></p><p><strong>The team you will be joining</strong></p><p>The Bellingham Adult Outpatient team is a close and inclusive bunch that work together to provide wellness, hope and recovery to our community while also having fun as a team. We are looking for someone to join our team that shares our passion and mission to the community. We are passionate about serving adults in Whatcom county with dignity and respect. We pride ourselves in providing quality care to this population while also caring for each other on the team.</p><p></p><p><strong>What we can offer:</strong></p><p>As the region’s largest non-profit community behavioral healthcare organization, we have been serving our clients and our communities for over 110 years. Our commitment to care doesn’t stop with our clients though, as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement as well as a focus on employee satisfaction and work/life balance.</p><p><em>(benefits pro-rated for part time employees)</em></p><ul><li>Medical, dental, and vision insurance at NO COST to Full-time employees </li><li>16 days of paid vacation the first year</li><li>12 sick days with great wellness day</li><li>10 paid holidays – 8 regular and 2 that you choose</li><li>Professional funds and paid education leave</li><li>Up to 2% match for the 403B Retirement plan the first year</li><li>And much, much more!!!</li></ul><p><br><br><strong>What you will bring with you:</strong><br>• MA/MS/MSW Degree in a Behavioral Science related field.<br>• Qualifies as a Mental Health Professional (MHP) as defined by WAC preferred.<br>• Meets educational and training requirements for designation as a Child Mental Health Specialist preferred.<br>• Demonstrated knowledge and experience with Evidence-Based Practices, or interest and ability to learn.<br>• Individuals who do not already hold a license or associate license through the Washington State Department of<br>Health must submit Agency<br>Affiliated Counselor application upon hire and be approved by the DOH.<br>• Valid Washington State Driver’s License including vehicle and appropriate insurance, if applicable.<br>• Ability to work effectively with individuals with complex needs and multi-system involvement.<br>• Ability to maintain a positive, solution-focused demeanor when responding to conflicts or problems.<br>• Demonstrated organizational skills and the ability to multitask within a fast-paced environment.<br>• Excellent communication skills, written and verbal.<br>• General computer proficiency, including the ability to utilize electronic medical record systems.<br>• Ability to pass pre-employment criminal background check, which may or may not include an additional search by DSHS.</p><p><br><br><strong>The organization you will be a part of:</strong><br>Compass Health is the region’s largest private, non-profit organization providing mental health and chemical dependency services in Island, San Juan, Skagit, Snohomish, and Whatcom counties of Western Washington. We provide quality creative services to children, families and adults in a variety of outpatient, residential and inpatient settings. We have been serving our clients and our communities for over 110 years, though our commitment to care doesn’t stop with our clients as we take pride in offering our employees the opportunity to work in a culture that promotes learning, growth, and advancement. We maintain a focus on employee satisfaction and work/life balance, which includes competitive compensation and benefits programs. Please visit our website for more information: <span class=\"long-word\">www.compasshealth.org.</span> </p><p><em>Compass Health promotes equal treatment and equal employment opportunity to all applicants and employees regardless of race, creed, color, national origin, sex, religion, age, marital status, sexual minority status, sexual orientation, veteran status, or disability unless based on a bona fide occupational qualification</em></p><p></p><p></p><p><strong>POSITION SUMMARY</strong><br>Job Title: Clinician II<br>Program: 205-21280 –Mental Health 2<br>Location: Bellingham<br>Hours: Full-Time, 40Hours/Week<br>Wage: $19.53 - $36.12/hour, DOE</p><p><strong>KEYWORDS</strong>: Mental Health Counselor, Mental Health Therapist, Therapist, Counselor, Trauma Specialist, LMHC / LMHCA, LMFT / LMFTA, MSW / LICSW / LSWAIC, LMFT / LMFTA Supervision, LMHC / LMHCA Supervision</p></div>"
    },
    {
        "position": "STUDENT TRAINEE (OFFICE SUPPORT/OA)",
        "company": "US Army",
        "location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/eb49da436e4861e9d61134dbbfff9ae2?lvk=ClA0a0NhKhsTzb_cmClQaA.--MDDikYZ2w",
        "posted": "2021-10-12T17:01:45.202Z",
        "lastScraped": "2021-10-18T17:01:45.202Z",
        "description": "<div><div><strong>About the Position: </strong>Position(s) will be filled under the Department of the Army Pathways Intern Program. Click here for more information on Pathways program participation. <strong>THIS IS NOT ONLY A SUMMER JOB. This is a year round internship; potentially leading to a permanent appointment.</strong><br><br>Qualifications: <strong>Who May Apply:</strong> <strong>Students who are eligible for participation in the Department of the Army Internship Program</strong><br>Positions are open to current students pursuing a qualifying degree or certificate in an accredited high school, college (including 4-year <span class=\"long-word\">colleges/universities,</span> community colleges, and junior colleges); professional, technical, vocational, and trade school; advanced degree programs; or other qualifying educational institution on at least a half-time basis (as defined by the institution in which the student is enrolled). Short-term training programs (e.g., several two-week programs completed) are not considered an academic course of study.<br><br>Internship for current students in good standing at an accredited education.<br><br>For this internship, we are seeking students to work full-time and/or part-time. Full-time is available when not attending classes (i.e. summers, fall and spring breaks, etc.) based on agency needs while continuing their education. <strong>THIS IS NOT ONLY A SUMMER JOB. This is a year round internship; potentially leading to a permanent appointment.</strong><br><br>This intern position is designed to prepare a student trainee for employment after graduation as an Office Support Assistant (OA) GS-0303-06. Interns will be assigned tasks designed to increase familiarity with the target occupation in a real world work environment.<br><br>This opportunity follows a standard promotional path:<ol><li>Internship selection will be made at the GS-03 or GS-04. These grade levels are what typical college students in their second or third year may qualify.</li><li>Within 120 days after completion of Internship requirements, you may be eligible for conversion to the entry-level for the target occupation. The actual grade level at the time of conversion depends on academic achievement and other factors.</li><li>The full performance level of this position is GS-06.</li><li>Progression from the entry-level to the full performance level for this occupation will depend on successful completion of all requirements for promotion. Promotions may be considered after a year at each grade level, but are not guaranteed to occur on a specific time schedule.</li></ol>See requirements for conversion to permanent or term position in the \"Additional Information\" section below.<br><br>To qualify for a Pathways Internship as a GS-03, students must have completed one full academic year of post-high school study.<br><br>To qualify for a Pathways Internship as a GS-04, students must have completed two full academic years of post-high school study or have an associate's degree.<br><br>For qualification purposes, an academic year is computed as follows:<ul><li>At the undergraduate level, successfully completed education that has not led to possession of a degree is credited based on its relationship to 120 semester hours or 180 quarter hours. For example, 30 semester hours or 45 quarter hours is comparable to 1 year of undergraduate education. Four years of progressive study or 120 semester hours meets the degree requirements. Additional credit cannot be given for duplicate course work.</li><li>For study at a business or technical school, 36 weeks of study (20+ classroom hours per week) is comparable to 1 academic year above high school.</li><li>An academic year of graduate education is considered to be the number of credit hours that the school attended has determined to represent 1 academic year of full-time study. This determination is made based on normal course loads for a full year of study in the graduate program. If that information cannot be obtained from the school, 18 semester hours or 27 quarter hours should be considered as satisfying the 1 year of full-time study requirement. Part-time graduate education is creditable in accordance with its relationship to a year of full-time study at the school attended.</li><li>When academic credit is expressed in contract months, units, or other terms that differ from conventional semester or quarter hours, it is the responsibility of the applicant to provide an interpretation of such credits from the appropriate institution in order to equate them to the semester or quarter hours specified in the standard.</li></ul><br>NOTE: If your college, vocational, trade, technical or high schools' definition of \"academic year\" differs from above, you must submit proof of this difference (e.g., copy of course catalog that defines an academic year). Absent this documentation, you will screened for academic qualifications based on the academic hours as defined in the bullets above.<br><br>You will be evaluated on the basis of your level of competency in the following areas:<br><ul><li>Computer Literacy</li><li>Grade Point Average</li></ul>Education: For this internship, we are seeking current students majoring in Business Management, Business Communications, Human Resources, Accounting, Information Technology, Management, or Public Affairs.<br><br><strong>FOREIGN EDUCATION:</strong> If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: <span class=\"long-word\">http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite</span>-visitus-forrecog.html<br><br>This is a student internship opportunity. Your transcripts and proof of enrollment are a required part of your application. Additional information about transcripts is in this <span class=\"long-word\">document.Employment</span> Type: OTHER</div></div>"
    },
    {
        "position": "Department Support- Arts & Humanities (Part-Time)",
        "company": "Muskegon Community College",
        "location": {
            "city": "Muskegon",
            "state": "MI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/36271b38b83ae2a484edfb2f32d670c9?lvk=xfp1sKJH6c5ZiuUkCSHuvA.--MDM4TWIjk",
        "posted": "2021-10-15T17:01:46.165Z",
        "lastScraped": "2021-10-18T17:01:46.165Z",
        "description": "<div><p>Muskegon Community College Named the 19th Best Community College in the U.S. in 2021, Muskegon offers accredited academic programs leading to 54 associate degrees and 32 certificates. As an Achieving the Dream Leader College, MCC's nationally recognized commitment to student success unites its faculty and staff in their mission to prepare students, build communities and improve lives. </p><p>One of Michigan's most picturesque community colleges, the Muskegon main campus building - an award-winning Alden Dow design - spans Four Mile Creek on a 15-acre sylvan setting. The campus boasts several new multimillion-dollar facilities - the Health and Wellness Center, the Science Center and the Art and Music Building - and includes University Park Golf Course and the Carr-Fles Planetarium. The Sturrus Technology Center in historic downtown Muskegon is home to state-of-the-art applied technology offerings, the Rooks|Sarnicola Entrepreneur Center and the Lakeshore Fab Lab. </p><p>MCC offers classes in adjacent Ottawa and Newaygo Counties. Living in Muskegon County Muskegon County residents enjoy 26 miles of sugar-sand beaches along Lake Michigan's shoreline, as well as one of America's only luge tracks at the Winter Sports Complex and the regionally popular Michigan's Adventure Amusement &amp; Water Park. An outdoor recreation hub with three state parks and swimming, fishing and boating on its many lakes and rivers, the Muskegon area offers dynamic downtown and beachfront restaurant and entertainment venues. </p><p>The Muskegon Farmer's Market is the second largest in Michigan. Cruise ships dock in Muskegon, while a high-speed ferry connects the city to Milwaukee. Notable local museums range from rare art collections to an actual World War II submarine and a U.S. </p><p>Navy ship used during D-Day. Department- Arts &amp; Humanities Part Time Part Time 28 hours/42 weeks Hours: Typically Monday-Thursday 9:00AM-4:00PM and will include occasional weekend or evening hours. Spring &amp; Summer as scheduled by the supervisor. </p><p>Starting Wage for ESS 4 up to $16.25 Depending on experience APPLICATION DEADLINE: Open until filled General Description Perform clerical duties and assistance for the department to maintain a professional, well-organized and friendly environment among the students, faculty/staff, and visitors. Duties include clerical, receptionist, scheduling, and other assignments relative to efficient operations of department and/or college. Qualifications: Knowledge, Skills &amp; Abilities: Associate's Degree or 3 years' experience. </p><p>Demonstrated ability to relate to people of all ages, races, and social-economic backgrounds. Ability to mentor, coach and work with student workers/interns while setting a good example by demonstrating professional workplace behavior and work ethics. Demonstrated ability to operate office technology, software and equipment. </p><p>Establishing yourself as the \"go to\" person with all equipment and software. Ability and willingness to be adaptable, and flexible including upgrading of technology skills or process changes including e-learning systems. Ability to establish and maintain effective working relationships with students, staff, and outside persons. </p><p>Demonstrated ability to create a warm, welcoming environment to students, parents, faculty/staff, colleagues, and community members especially during busy/chaotic times. Demonstrated organizational ability, attention to detail, and solid decision-making skills. Demonstrated use of tact, judgment and discretion, the ability to maintain confidentiality, and follow policy/procedure including but not limited to FERPA. </p><p>Demonstrated history of dependability and punctuality. Demonstrated ability to work as part of a successful team while accomplishing tasks and assignments without assistance, even while multi-tasking. Ability to stay calm while working under pressure in a fast-paced environment. </p><p>Highly motivated and solution oriented with a high degree of integrity, ethics and dedication to the mission of the College. Demonstrated appropriate problem solving skills, and ability to resolve customer complaints and reduce customer frustrations. Demonstrated excellence in both oral and written communication skills, to be demonstrated in various formats including but not limited to in person, online and via phone. </p><p>Flexible scheduling to allow for evening and occasional weekend work as scheduled by your supervisor. Willingness to work overtime occasionally. Requires prolonged sitting or standing, keyboarding and work on computer (hand/eye strain), speaking in English via phone or in person. </p><p>Essential Function: Serve as a receptionist; answering routine questions via phone or in person and/or route calls to appropriate people, may also provide directions to other rooms or office. Answer inquiries requiring knowledge of departmental and College operations, activities, and procedures while exercising discretion in providing information. Type all correspondence for the department staff and/or others assigned. </p><p>Including, but not limited to letters, meeting agenda and minutes, performance programs, field trip itinerary, news releases, award certificates, course materials, and other miscellaneous documents, taking occasional dictation. Perform routine filing of materials, records and documents as appropriate; organize and maintain files in an accessible manner. Sort and distribute mail within the department. </p><p>Coordinate ticket sales for events; reserve tickets as requested, update and maintain ticketing system, catalog and file for later purchase; receive and record monies from ticket sales making change if necessary; balance cash on hand or otherwise reconcile cash with sales records. Interview, hire, schedule, train, supervise and evaluate two to ten student workers to assist with the Arts &amp; Humanities Department office operations, Overbrook Theater Box Office, ticket sales, and Overbrook Art Gallery security; verify and approve time sheets for supervised student workers. Prepare purchase orders and supply requests for instructional and office materials required by the department. </p><p>Prepare accurate faculty load sheets for department (Full-time/adjunct) and acquiring appropriate approvals so individuals are compensated appropriately. Manage departmental schedules on system(s) ensuring all meetings and appointments are accounted for including all student appointments. Provide information to students and College staff concerning faculty office/conference hours. </p><p>Make arrangements for meetings as directed by determining <span class=\"long-word\">schedules/availability.</span> Provide programming information to College Services offices to assure proper reservation of facilities and services. Provide programming information to the Public Information office to assure proper dissemination of department activities and news to the general public. </p><p>Coordinate with the Information Technology office mailing lists/label preparation, maintenance and printing, including regular updating. Coordinate with the campus mailroom bulk mailing, checking for proper sizing, labeling, printing and bundling. Assist the Department Chair in the formation and dissemination of semester class schedules. </p><p>When necessary, assist with access and security for visitors to the Overbrook Art Gallery. Assist faculty in preparing grant applications or other special projects. Perform other duties as assigned. </p><p>Physical, Mental, and Environment Requirements Include: Mental Demands: Detailed Work Student Contact Deadline oriented Problem Situations Multiple Priorities &amp; Demands Emergency Situations Confidentiality On-call Availability Continual Interruptions Working Alone Faculty Contact Working with Others Physical Demands: Standing &amp; Walking Sitting Reclining Carrying Lifting up to 10 lbs. Up to 25 lbs. Up to 50 lbs. </p><p> 80 + lbs. Pushing, Pulling, Twisting, Bending Climb or Balance Stoop, Kneel, Crouch, or Crawl Squatting Handle or Feel Reach with Hands and Arms Talking or hearing Tasting/Smelling Working Overhead Speak in English via Phone or In Person Close, Distance, Peripheral, and Color Vision along with Depth Perceptions Ability to Adjust and Focus Work Environment: Exposure to wet, humid conditions (non-weather), fumes or airborne particles, toxic or caustic chemicals; extreme heat/cold; and moderate to loud noise levels. Normal Office environment with little, if, any, discomfort due to heat, dust, noise and the like. </p><p>Ability to travel to all campus locations required. Muskegon Community College continues to promote staff diversity, and is an equal opportunity employer. MCC does not discriminate on the basis of race, color, religion, sex, national origin, marital status, sexual orientation, gender identity, transgender status, political persuasion, disability, height, weight, veteran status, age or any other protected class in any of its educational programs, activities or employment. </p><p>Minorities, women, veterans, and the physically challenged are encouraged to apply. Anyone with a disability will be reasonably accommodated by the College. If you have a disability and need an accommodation or assistance in applying for this position, please contact the Human Resources Office.</p></div>"
    },
    {
        "position": "Quality (Technical) Intern",
        "company": "Weyerhaeuser",
        "location": {
            "city": "Grayling",
            "state": "MI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9357ebb24679d1aee3eeb58ca5a80611?lvk=yxz_AmrgeipA9IFU7nj4Jw.--MCszJSIcF",
        "posted": "2021-10-09T17:01:47.081Z",
        "lastScraped": "2021-10-18T17:01:47.081Z",
        "description": "<div><div><p>Are you looking for real-world experience that aligns with your future career goals and current course of study? &nbsp;Weyerhaeuser is recruiting for interns to work with maintenance and/or operational departments in a variety of roles in wood products manufacturing.&nbsp;<br> &nbsp;<br> At Weyerhaeuser, interns receive extensive mentoring and have hands-on work experiences to build the foundations for a professional career. &nbsp;Many of our interns return as full-time employees post-graduation, and a number of our senior leaders started their careers as interns at Weyerhaeuser</p><p><strong>Background:</strong>&nbsp;<br> A Quality (Technical) Intern is assigned to our site for a predetermined time on a part-time temporary basis. During that period, the Intern receives a comprehensive orientation to Weyerhaeuser and its OSB business, performs assignments in most areas of the mill and receives training as determined by site mentors. Successful completion of the program may lead to a full-time regular position within the OSB Business.</p><p><strong>Key Functions:</strong><br> The individual will learn to perform the quality control functions of the Technical Team in the Weyerhaeuser OSB mill in Grayling, Michigan. &nbsp;They will have the opportunity to be involved in process improvement projects. &nbsp;This position is an opportunity to develop valuable hands-on operations experience. &nbsp;It will involve some vacation coverage and requires working on shifts while supporting an operations team. &nbsp;The individual will be fully involved in a high-performance self-directed work system.</p><ul><li>Must be enrolled at an accredited college or university pursuing &nbsp;an Associates degree that supports a Wood Science/Forestry Bachelors degree OR currently pursuing a Bachelor's degree in Wood Science or other related disciplines.</li><li>Minimum Sophomore Standing .</li><li>Excellent verbal and written communication skills along with a technical writing&nbsp;</li><li>capability. &nbsp;</li><li>Must commit to a 2-3 month internship.</li><li>Strong interpersonal skills and ability to work within a team environment. &nbsp;</li><li>Well-developed problem solving and analytical skills. &nbsp;</li><li>High level of initiative and motivation. &nbsp;</li><li>Excellent planning and organizational skills. &nbsp;</li><li>Must pass a pre-employment drug screen and background check.</li><li>Eligible to work in the U.S.</li><li>Must be willing to work rotating shifts.</li></ul><p>&nbsp;</p><p><strong>About Wood Products:</strong><br> We've been delivering quality building products and solutions to our customers for more than 100 years. From builders and dealers to specifiers and homeowners, we offer exceptional product performance and unparalleled support.<br><strong>For more than a century, we've been building our reputation as a leader in sustainable wood products.</strong></p><p><strong>About Weyerhaeuse</strong>r<br> We sustainably manage forests and manufacture products that make the world a better place. We're serious about safety, driven to achieve excellence, and proud of what we do. With multiple business lines in locations across North America, we offer a range of exciting career opportunities for smart, talented people who are passionate about making a difference.&nbsp;<br><strong>We know you have a choice in your career. We want you to choose us.&nbsp;</strong></p><p>&nbsp;<br><em>Weyerhaeuser is an equal opportunity employer. Inclusion is one of our five core values and we strive to maintain a culture where all our people feel a sense of belonging, opportunity and shared purpose. We are committed to recruiting a diverse workforce and supporting an equitable and inclusive environment that inspires people of all backgrounds to join, stay and thrive with our team.&nbsp;</em></p></div></div>"
    },
    {
        "position": "Amplification Intern",
        "company": "Sensis Inc.",
        "location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/2f44c79931cd3a9332a86403cfd60465?lvk=ni8s0shb5nLLNGnB1yD2EA.--MDMtGmXq7",
        "posted": "2021-10-14T17:01:48.004Z",
        "lastScraped": "2021-10-18T17:01:48.004Z",
        "description": "<div><div><p>&nbsp;</p><p>SENSIS</p><p>&nbsp;</p><p>Who we are: An integrated cross-cultural marketing agency. We reflect and embrace the cultural diversity of America to develop meaningful marketing programs that drive measurable conversions.<br>We opened our doors in 1998 (as Focus Multimedia). We got our start building websites and have expanded into a full service advertising agency, helping our clients take advantage of the fundamental changes taking place in the marketing world – the emergence of digital technologies, expanded multiculturalism, and the transformative impact of social media.</p><p>&nbsp;</p><p>.</p><p>What we are looking for: Amplification Department Intern<br>Part-Time / $15 an Hour</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>What you'll be doing:</p><p>&nbsp;</p><p>Responsibilities include but are not limited to:</p><ul><li>Assisting with writing media alerts and pitches</li><li>Media/press tracking</li><li>List curating</li><li>Editor research</li><li>Content brainstorming</li><li>Coordinating press mailings (when necessary)</li><li>Updating and compiling press and celebrity contact lists</li><li>Supporting social media efforts</li><li>Developing press kits and media clippings</li><li>Assisting in some administration work</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>What you'll bring along:</p><p><br><b>Experience / Skills</b></p><ul><li>Excellent verbal and written communication skills</li><li>Ability to work in a fast-paced environment</li><li>Reliable, dependable and organized</li><li>Must be extremely organized and prioritize well to meet deadlines</li><li>Strong computer skills with working knowledge of Word &amp; Excel</li><li>Strong Internet/Social Media research skills</li><li>Maintain a positive attitude and have a customer service approach at all times</li><li>Available to work a minimum of 2 days (9a.m. - 6p.m.) weekly from home</li><li>Previous internship experience or current <span class=\"long-word\">communications/marketing/pr</span> major is a plus</li><li>Pursuing degree in Communications, Marketing, Public Relations, or related field; recent grads welcome</li></ul><p>&nbsp;</p><p><b>What We Offer:</b><br>Want to learn the ins and outs of Public Relations? Do you have a keen interest in Influencer Marketing and Social Media? Get real world experience by joining the internship team at SENSIS. Known for giving interns a true inside look into what makes Public Relations work, SENSIS is a fast-paced marketing agency with growing Amplification practice. Opportunities continue to unfold for full-time positions so send your resume and cover letter today to have your chance!</p><p>Where: Los Angeles, CA</p><p>&nbsp;</p></div></div>"
    },
    {
        "position": "Access Your Future Service Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Compton",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9cb30fab279c5db1114c859e74da6d0d?lvk=A9yUUnvbQzXL4YZMLYFj9Q.--MDCKKWJ73",
        "posted": "2021-10-12T17:01:49.621Z",
        "lastScraped": "2021-10-18T17:01:49.621Z",
        "description": "<div><div><strong>Job Description</strong><p>Access Your Future is a sponsorship program for students interested in a career in the equipment industry as a Service Technician. This program provides a career path for a qualified student and an educational incentive upon successful completion of an approved diesel program. <br>The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships.<br><br><strong>Specific Duties Include:</strong><br></p><ul><li> Enrolled or attending an approved Diesel Technology program or another program approved in writing by RDO Equipment Co.<br></li><li> Part time paid employment at sponsoring store (if store location permits) while attending college.<br></li><li> Possible full time paid employment between college academic years at sponsoring store location.<br></li><li> This program offers sponsored students graduating, an educational incentive over a two or four year period while they maintain full time employment with RDO Equipment Co. <br></li><li> Company provided work uniforms.<br></li><li> Eligible for the RDO Equipment Co. tool discount program with Matco upon full time employment.<br></li><li> Maintain a GPA of 3.0 (on a 4.0 scale) while in program.<br></li><li> Maintain acceptable attendance record while in program.<br></li><li> It is the student's responsibility to provide a copy of their transcripts to RDO Equipment Co. after each quarter or semester and a diploma in order to receive reimbursement upon full time employment. <br></li><li> Adhere to academic policies, rules and regulations set forth by the higher learning center the student is attending.<br></li><li> Document machine information and repairs completed on work order, including parts and fluids used. <br></li><li> Maintain a clean work area, as well as care for all shop tools, machines, and equipment.<br></li><li> Identify and communicate solutions for customer service opportunities in the dealership's area of responsibility.<br></li><li> Maintain technical and product knowledge on all equipment sold within the dealerships area of responsibility.<br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set.<br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts.<br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service.<br></li><li> Perform all other duties as assigned by management in a professional and efficient manner.<p><strong>Job Requirements:</strong><br></p></li><li> Mechanical skills<br></li><li> Trade specific tooling, including hand and pneumatic tools<br></li><li> Strong computer skills<br></li><li> Excellent customer service skills<br></li><li> Ability to assemble and perform maintenance functions on equipment<br></li><li> Excellent communication and written skills<br></li><li> Strong organizational skills<br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships., * Mechanical skills * Trade specific tooling, including hand and pneumatic tools * Strong computer skills * Excellent customer service skills * Ability to assemble and perform maintenance functions on equipment * Excellent communication and written skills * Strong organizational skills * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Employment</span> Type: [\"PART_TIME\"]</li></ul></div></div>"
    },
    {
        "position": "Intern - Ball State University",
        "company": "Hensel Phelps Construction",
        "location": {
            "city": "Muncie",
            "state": "IN",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/388edd49acce71af3ab922f6b47678d3?lvk=HLd6urL1tsILWtteXhxThA.--MDNKYBj97",
        "posted": "2021-10-12T17:01:50.615Z",
        "lastScraped": "2021-10-18T17:01:50.615Z",
        "description": "<div><div><p><strong>Any Employment Offers are Contingent Upon Successful Completion of the Following:</strong></p><ul><li>Verification of Work Authorization and Employment Eligibility</li><li>Substance Abuse Screening</li><li>Physical Exam (if applicable)</li><li>Background Checks for Badging/Security Clearances (if applicable)</li></ul><p></p><p><strong>About Hensel Phelps:</strong></p><p>At Hensel Phelps, construction is our business. With world-class leadership and a well-honed approach developed over more than three quarters of a century, we employ expertise, experience, and ingenuity to build landmark properties - and build lasting relationships with our clients. We approach every project \"The Hensel Phelps Way,\" inspiring trust and delivering excellence in all we do. Our comprehensive construction services - from preconstruction through constructability and field management - deliver superior results on time and on budget. Hensel Phelps' Virtual Design and Construction (VDC) technology enhances our ability to deliver projects faster, more cost effectively and with a greater level of quality.</p><p>The Hensel Phelps Way is built on four pillars: People, Process, Partnership and Technology.</p><p></p><p><strong>Position Description:</strong></p><p>The primary goals for interns are to gain an understanding of the construction process and to assist the Field Engineers and Office Engineers in field and materials management. The internship program provides the intern and Hensel Phelps with an extended opportunity to evaluate if the fit is right for a long and successful career with Hensel Phelps after graduation.</p><p></p><p><strong>Position Qualifications:</strong></p><ul><li>Strong communication skills</li><li>Computer software - Microsoft Office Suite, specifically Excel based templates, Prolog, Primavera and AutoDesk Suite</li><li>Candidates are preferred to be pursuing a 4-year degree in Civil, Structural, Architecture or Construction Management</li></ul><p></p><p><strong>Essential Duties:</strong></p><ul><li>Subcontractor Management</li><li>Submittal review skills</li><li>RFI development</li><li>Layout / surveying</li><li>Daily reports</li><li>Quality control and support of our safety plan</li></ul><p></p><p><strong>Benefits:</strong></p><p>Hensel Phelps believes in the importance of taking time to recharge. As a result, employees are eligible for paid time off beginning upon hire. Employees are also eligible for a company cell phone or cell phone allowance in accordance with company policy.</p><p></p><p><strong>Equal Opportunity and Affirmative Action Employer:</strong></p><p>Hensel Phelps is an equal opportunity and affirmative action employer. Hensel Phelps shall not discriminate against any employee or applicant for employment on the basis of race, color, religion, sex, age, national origin, sexual orientation, gender identity and expression, domestic partner status, pregnancy, disability, citizenship, genetic information, protected veteran status, or any other characteristic protected by federal, state, or local law.</p></div></div>"
    },
    {
        "position": "Student Intern-Geographical Information Systems (GIS)",
        "company": "University Enterprises Inc - Sacramento State",
        "location": {
            "city": "Sacramento",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c6ac71512251ba7952a6c6d0102f7ce3?lvk=pRxFtO6Pa6uZp3-FG7Qtyg.--MDSlgEkZZ",
        "posted": "2021-10-15T17:01:51.761Z",
        "lastScraped": "2021-10-18T17:01:51.761Z",
        "description": "<div><div><div> Job Title Student Intern-Geographical Information Systems (GIS) Student Classification Student Assistant or Graduate Assistant Job Code C50118 Posting Type <span class=\"long-word\">Student/nonbenefited</span> (NSTU) Posting Number PE479F21 Job Description Summary <div> The County of Sacramento ( SACCO) is seeking to hire a student assistant to work in the field of Geographic Information Systems ( GIS). The student assistant will work under supervision, in addition, to tasks that require independent initiative and judgment for a variety of GIS related tasks and projects. </div> Conditions of Employment <div> This is a part-time, temporary, non-benefited, student position. Employment in all positions with University Enterprises, Inc. is dependent upon the mutual consent of University Enterprises, Inc. and the employee. This means that either University Enterprises, Inc. or the employee can, at any time, terminate the employment relationship at will, with or without cause.&nbsp; <br>&nbsp; <br>Depending on the type of position you are applying for, a pre-employment background check consisting of one or more of the following may be conducted: employment history, professional references, criminal check, educational verification (i.e., degree, license, or official transcript) and physical exam and drug urinalysis test. Applicants will be required to pass required pre-employment checks to the satisfaction of University Enterprises Inc., ( UEI) and the hiring Agency or Department. </div> Work Schedule <div> Flexible hours, Monday through Friday, between the hours of 8 am and 5 pm. Final schedule to be determined between supervisor and student. </div> Additional Work Schedule <p>Student Assistants and Graduate Student Assistants generally work up to 20 hours per work week (Sunday-Saturday) during the academic year and up to 40 hours per work week during breaks; (Winter, Spring and Summer).</p> Area Sacramento On/Off Sacramento State Campus Off Campus Worksite City Sacramento Pay Range $15.00 - $18.00 per hour Department/Agency County of Sacramento (SACCO) Unit/Division GIS Project Description <div> The Department of Technology (DTech) is the central information technology and telecommunications service provider for Sacramento County employees, departments and regional partners. <br><br>To learn more please visit <span class=\"long-word\">http://www.technology.saccounty.net/Pages/default.aspx</span> </div> Majors/Fields of Study Computer Information Systems, Computer Science and Engineering, Other - Geographic Information Systems Minimum Qualifications <ul><li>Minimum of 6 months experience with ArcGIS Desktop.</li><li>Proficient with computer hardware and software including Microsoft Office, email, and internet browser programs.</li><li>Effective oral and written communication skills.</li><li>Problem solving skills, attention to detail, and ability to work independently.</li><li>Must be able to pass a background check.&nbsp;</li></ul> Prerequisites <div> Must be a college student attending classes during the regular term (Fall, Spring and Winter, if applicable), at an accredited college or university.&nbsp; <br>&nbsp; <br>Students must be enrolled at a minimum in: six semester units or nine quarter units for undergraduate students; four semester units or six quarter units for graduate students.&nbsp; <br><br>Students declared major must match the major(s) listed in the job posting. </div></div><div> Preferred Qualifications <ul><li>Experience with Enterprise Geodatabases.</li><li>ArcGIS Desktop Editing.</li><li>ArcGIS ModelBuilder</li><li>AutoCAD.</li><li>Python.</li></ul> Duties and Responsibilities <div> Under supervision, but with broad scope for independent initiative and judgment, the intern will:&nbsp; </div><ul><li>Update and clean-up existing datasets / databases.</li><li>Help in creating and documenting GIS standards.</li><li>Creation and maintenance of geodatabases; editing tabular and geometry data.</li><li>Maintains accurate records and documentation of work performed.</li><li>Develop custom workflows and scripts to increase productivity and accuracy.</li><li>Aid in the management of enterprise geodatabases.</li><li>Assist GIS staff as required.</li><li>Provide additional GIS and technical support as needed.</li></ul> Physical Requirements <div> Sit for extended periods; frequently stand and walk; manual dexterity and hand-eye coordination; corrected hearing and vision to normal range; verbal communication; use of office equipment including computer workstations, telephones, calculators, copiers, printers and scanners with or without a reasonable accommodation. </div> Working Conditions <div> Work is performed in an office environment. </div> Hours Per Week Students (part-time) 0-20 hours per week during the academic year, up to 40 hours per week during breaks; (Winter, Spring and Summer). (NSTU) Posting Date 10/15/2021 Closing Date 10/31/2021 Open Until Filled No Special Instructions to Applicant <div> Please complete all fields of the employment application. Include your educational history in the \"Educational Experience\" section and any employment history in the \"Employment Experience\" section of our application. </div> Quick Link for Internal Postings <span class=\"long-word\">https://ueijobs.peopleadmin.com/postings/19784</span> </div></div></div>"
    },
    {
        "position": "Intern Research",
        "company": "Signature Estate and Investment Advisors LLC",
        "location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/signature-estate-and-investment-advisors-llc-fe43a235/intern-research-73377106?lvk=KXaD5YjjQz6Y2P28htHJyA.--MDFsZyM8V",
        "posted": "2021-10-14T17:01:54.435Z",
        "lastScraped": "2021-10-18T17:01:54.435Z",
        "description": "<div><div><div><div><p>JOB TITLE: Portfolio Associate Intern<br><br>EMPLOYER: Signature Estate and Investment Advisors Inc<br><br>DEPARTMENT: Research<br><br>REPORTS TO: Senior Investment Strategist<br><br>EFFECTIVE DATE: 4/1/2021<br><br>SUMMARY: SEIA combines its foundations in investment management and financial planning with advanced advisory services to create a truly customized client experience. Our holistic wealth management process includes the oversight and stewardship of all elements of our clients’ financial lives. </p><p>We are seeking a driven and self-motivated individual to serve as an integral part of the Research and Marketing Departments.</p><p><br>JOB SUMMARY AND RESPONSIBILITIES:</p><p>Portfolio Associate Interns will work with our portfolio associates, analysts, and marketing department on a day-to-day basis. Responsibilities include, but are not limited to:</p><ul><li>Assist with new client proposals and investment analysis</li><li>Compare and analyze information from industry publications and proprietary sources, such as Morningstar Direct and Bloomberg Terminal</li><li>Assist with maintaining, updating, and improving marketing collateral</li><li>Write reports and communicate research findings to analysts and associates</li></ul><p><br>QUALIFICATIONS:</p><ul><li>Pursuing undergraduate bachelor’s degree <span class=\"long-word\">(sophomores/juniors</span> preferred)</li><li>Business Related, Finance, Marketing, or Economics degree preferred, but all majors welcome</li><li>Excellent written and verbal communication skills</li><li>Strong computer skills, and eagerness to learn advanced Microsoft Excel</li><li>Must be detail oriented, with the ability to maintain a high degree of accuracy in work product</li><li>Interest in <span class=\"long-word\">financial/investment</span> planning and the investment process</li></ul><p><br><br>COMPETENCIES:<br>• Diversity - Demonstrates knowledge of EEO policy; Shows respect and sensitivity for cultural differences; Educates others on the value of diversity; Promotes a harassment-free environment; Builds a diverse workforce.<br>• Ethics - Treats people with respect; Keeps commitments; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values.<br>• Adaptability - Adapts to changes in the work environment; Manages competing demands; Changes approach or method to best fit the situation; Able to deal with frequent change, delays, or unexpected events.<br>• Analytical - Synthesizes complex or diverse information; Collects and researches data; Uses intuition and experience to complement data; Designs work flows and procedures.<br>• <span class=\"long-word\">Attendance/Punctuality</span> - Is consistently at work and on time; Ensures work responsibilities are covered when absent; Arrives at meetings and appointments on time.<br>• Customer Service - Manages difficult or emotional customer situations; Responds promptly to customer needs; Solicits customer feedback to improve service; Responds to requests for service and assistance; Meets commitments.<br>• Dependability - Follows instructions, responds to management direction; Takes responsibility for own actions; Keeps commitments; Commits to long hours of work when necessary to reach goals; Completes tasks on time or notifies appropriate person with an alternate plan.<br>• Initiative - Volunteers readily; Undertakes self-development activities; Seeks increased responsibilities; Takes independent actions and calculated risks; Looks for and takes advantage of opportunities; Asks for and offers help when needed.<br>• Innovation - Displays original thinking and creativity; Meets challenges with resourcefulness; Generates suggestions for improving work; Develops innovative approaches and ideas; Presents ideas and information in a manner that gets others' attention.<br>• Interpersonal Skills - Focuses on solving conflict, not blaming; Maintains confidentiality; Listens to others without interrupting; Keeps emotions under control; Remains open to others' ideas and tries new things.<br>• Motivation - Sets and achieves challenging goals; Demonstrates persistence and overcomes obstacles; Measures self against standard of excellence; Takes calculated risks to accomplish goals.<br>• Oral Communication - Speaks clearly and persuasively in positive or negative situations; Listens and gets clarification; Responds well to questions; Demonstrates group presentation skills; Participates in meetings.<br>• Problem Solving - Identifies and resolves problems in a timely manner; Gathers and analyzes information skillfully; Develops alternative solutions; Works well in group problem solving situations; Uses reason even when dealing with emotional topics.<br>• Professionalism - Approaches others in a tactful manner; Reacts well under pressure; Treats others with respect and consideration regardless of their status or position; Accepts responsibility for own actions; Follows through on commitments.<br>• Quality - Demonstrates accuracy and thoroughness; Looks for ways to improve and promote quality; Applies feedback to improve performance; Monitors own work to ensure quality.<br>• Quantity - Meets productivity standards; Completes work in timely manner; Strives to increase productivity; Works quickly.<br>• Teamwork - Balances team and individual responsibilities; Exhibits objectivity and openness to others' views; Gives and welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests; Able to build morale and group commitments to goals and objectives; Supports everyone's efforts to succeed.<br>• Technical Skills - Assesses own strengths and weaknesses; Pursues training and development opportunities; Strives to continuously build knowledge and skills; Shares expertise with others.<br>• Written Communication - Writes clearly and informatively; Edits work for spelling and grammar; Varies writing style to meet needs; Presents numerical data effectively; Able to read and interpret written information.<br><br>The above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br></p></div></div></div></div>"
    }
]