[
    {
        "position": "Software Testing Intern",
        "company": "phoenixNAP",
        "location": {
            "city": "Tempe",
            "state": "AZ",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/phoenixnap-b58ed511/software-testing-intern-d8e6c271?lvk=7_DU0DmUieQL4nTL5zKLbQ.--M4AnWHhGk",
        "posted": null,
        "lastScraped": "2021-06-21T06:47:53.890Z",
        "description": "<div><p>The Software Testing Intern will be responsible for the testing of product lines, reporting defects and for testing complex implementations of enterprise software. The enterprise components themselves are a black box, but how they interact requires a great deal of understanding of the business problems being solved.</p><p></p><p>Software Testing interns are responsible for writing and executing test plans and test cases. The ideal candidate will possess the flexibility to understand various nuances of software development &amp; testing; the ability to research issues; analysis capability on critical issues. The function heavily focuses on black-box test execution but may also include grey box and white box testing.</p><p></p><p><strong>Key Job Responsibilities</strong></p><ul><li>Perform multiple types of black-box and grey-box testing including functional, system, end to end, smoke, regression, and ad-hoc testing, both automated and manual testing</li><li>Submit comprehensive defects using our bug tracking system.</li><li>Regress and verify defects as needed.</li><li>Record results and provides metrics.</li><li>Analyze requirements and write test cases.</li><li>Assist with the design of test plans.</li></ul><p></p><p><strong>Key Qualifications</strong></p><ul><li>Studying for a university degree in Computer Sciences or related degree.</li><li>Basic understanding of programming concepts and best practices.</li><li>Experience using Linux/Unix/Windows OS.</li><li>Excellent oral and written communication skills in English.</li><li>A high degree of flexibility and creativity.</li><li>Ability to work independently with minimal supervision.</li><li>Ability to communicate effectively with all levels of <span class=\"long-word\">employees/management.</span></li><li>Ability to stay focused on the task at hand, ensuring that timelines are met.</li></ul><p></p><p>This is an exciting opportunity to work with a highly innovative and creative team, in a great working environment using the latest technologies, methodologies, and frameworks.</p></div>"
    },
    {
        "position": "TechX Intern - Cyber Security",
        "company": "T-Mobile",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/01b93896f78912bee9adf65df8f5d423?lvk=iuGNzm435zM6mhNk63l78w.--M3wF1g5-F",
        "posted": "2021-06-12T06:47:55.687Z",
        "lastScraped": "2021-06-21T06:47:55.687Z",
        "description": "<div><div><p>Title: TechX Intern - Cyber Security <br>Location: WA507-WA-Headquarters, Building 1 <br>Job Description: </p><p>Technology powers everything we do at T-Mobile. We need our product managers, developers, and engineers to have outstanding teamwork to bring exciting technology. Are you innovative, customer driven, and interested in becoming part of the Un-carrier? We would love you to join our teams to share your innovative ideas and perspectives that will impact the future of Technology!<br><br>The TechX Internship program is a paid 9-month, part-time learning experience that begins in October for students currently enrolled in a full-time undergraduate degree program, majoring in Software Engineering, Computer Science, Cybersecurity, Data Management, IT or another Technology-related field. Work closely with our teams, be paired with a mentor, and participate in projects alongside with some of the best senior technologists in the industry. For our eager explorers, you'll also have the opportunity to rotate teams giving you exposure to a wide variety of technologies across our organization. We encourage you to be a TechX Intern with our Technology Team!<br><br>The Cybersecurity&nbsp;Intern will help ensure that our software, systems and infrastructure are crafted and implemented to the highest security standards. They will work with&nbsp;an&nbsp;Information Security Manager to analyze the cybersecurity controls for the <span class=\"long-word\">containerized/cloud</span> based&nbsp;deployments. The Associate will become familiar with the Center for Internet Security Cyber Security Controls and how to apply&nbsp;to&nbsp;<span class=\"long-word\">containerized/cloud</span> based&nbsp;deployments. Performs technical security assessments, code reviews and vulnerability testing to highlight risk and re-mediate associated findings while helping T-Mobile teams and partners improve. Works closely with other T-Mobile Engineers and associates to craft and build proactive methods to improve our security posture.&nbsp;<br><br><strong>Internship Cybersecurity Roles Offered:</strong></p><ul><li>Software Engineering</li><li>Radio Frequency Engineering</li><li>Analyst</li></ul><br>Req ID: 168607BR <br>Positions Remaining: 1 <br>Functional Group: Technology <br>Location Address: 3617 131st Ave SE <br>EOE Statement: <b>Equal Employment Opportunity</b><br><br> We take equal opportunity seriously-by choice.<br><br>T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated. <br>Brand: T-Mobile <br>Responsibilities: <ul><li>Supports cybersecurity review and examination of new technologies, modifications to existing technologies, and <span class=\"long-word\">systems/application</span> designs. Provides appropriate cybersecurity gap remediation guidance.</li><li>Maintains documentation on security requirements and <span class=\"long-word\">recommendations/guidance</span> for cybersecurity issue(s)</li><li>Develops transparency inside &amp; outside of cybersecurity. Collaborate with groups such as application support, engineering ops, finance, privacy, risk management, and other DSO teams, as appropriate</li><li>Keeps updated documentation for security policy lifecycle throughout, including cybersecurity intake requests, documentation in support of intake requests, review, approval, implementation, publishing, and communication to requester(s). Communicates accordingly to partners at each of the steps for the cybersecurity request.</li><li>May participate in security, compliance, and risk assessments on projects throughout project lifecycle</li><li>Supports peers with security projects driven by groups both internal and external to info security</li><li>Also, responsible for other Duties/Projects as assigned by management as needed.</li><li>Ability to produce high quality detailed documentation and process flow diagrams</li><li>Ability to communicate clearly and concisely with technical and non-technical staff</li><li>Basic understanding of cyber security fundamentals (e.g., common attack techniques, vulnerability types, OWASP Top 10...etc.)</li><li>Proficiency in MS Office applications (Word, Excel, PowerPoint, Outlook, Visio)</li><li>Scripting or programming skills using Python, Perl, C#, and/or C++</li><li>Database Engineers (e.g., MS, SQL, and/or MS Access)&nbsp;</li><li>Visualization Tool (e.g., PowerBI, Qlik, and/or Tableau)</li><li>HTML5 Web Sit Design with JavaScript, CSS, PHP</li></ul><br>Company Profile: T-Mobile U.S. Inc. (NASDAQ: TMUS) is America's supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile's customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com<br><br>Applicant Privacy Policy<br><br>We are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy. <br>City: Bellevue <br>Zip: 98006 <br>Qualifications: <ul><li>Working toward a&nbsp;Bachelor's Degree, in Computer Science, Business Administration, Project Management or combination of equivalent experience and education.</li><li>Intern must not graduate before spring 2023.&nbsp;</li><li>Able to work 15-25 hours per week during regular daytime business hours (schedule will be flexible to accommodate classes and coursework)</li><li>Authorization to work for any employer in the United States without sponsorship now or in the future</li></ul><br>State: Washington <br>Schedule: Temporary <br>Travel Required?: No <br>Other Locations Available: OVERLAND PARK, KS <br>Department: Engineering <br></div></div>"
    },
    {
        "position": "Project Management Student Intern (STS, GG) - SISW - PLM (254619)",
        "company": "Siemens Corp",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7e3edf3a659d5bac44ca7a35c352e95a?lvk=ewvY3uXW2k-C7QplWY9Z-Q.--M3tg4ltjg",
        "posted": "2021-06-15T06:47:56.445Z",
        "lastScraped": "2021-06-21T06:47:56.445Z",
        "description": "<div><p>Project Management Student Internship Location: State College, PA, Seattle, WA Start Date: October 2021 Hours: Part-time during the school year Discover your career with us at Siemens Digital Industries Software! We are a leading global software company dedicated to the world of computer aided design, 3D modeling and simulation- helping innovative global manufacturers design better products, faster! With the resources of a large company, and the energy of a software start-up, we have fun together while creating a world class software portfolio. </p><p>Our culture encourages creativity, welcomes fresh thinking and focuses on growth, so our people, our business, and our customers can achieve their full potential. In this position, you will get the opportunity to: Learn about Project Management and Commercial Software Development Hands-on experience with software development tools, project management methodology, business analytics, quality assurance, and change management Support project managers in managing schedules and milestones Assisting with documentation and project deliverables Identifying and managing constraints, risks, issues, assumptions, and dependencies; documenting risk mitigation plans Coordinating activities between project team members and stakeholders Contribute to the reporting of project statuses Requirements: Currently enrolled in a university pursuing an undergraduate or master's degree in Software Engineering, Computer Science, Information Science, Information Systems, Business Management, Business Administration, or a related field GPA of 3.0 or above Graduating in 2022 or later Past internship experience in software development Experience with Confluence, Jira Collaborative and a team player Use strong interpersonal skills to actively listen and communicate in ways that foster trust and show flexibility. Proficient in MS Office and Excel Easily adaptive to change Strong verbal and written communication skills Must be able to complete projects with limited supervision and able to take ownership Interested in technology and project management Organization: Digital Industries Company: Siemens Industry Software Inc. </p><p>Experience Level: Student (Not Yet Graduated) Job Type: Part-time temporary Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. EEO is the Law Applicants and employees are protected under Federal law from discrimination. </p><p>To learn more, Click here. Pay Transparency Non-Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. </p><p>California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here.</p></div>"
    },
    {
        "position": "Structural design RLS flow automation engineering student and library collateral delivery",
        "company": "Intel",
        "location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3f2e7c287f9bbec9462ebd445ec54687?lvk=P63t9d9YAlzdSem7TK2N7g.--M45OdWDz3",
        "posted": "2021-06-17T06:47:57.181Z",
        "lastScraped": "2021-06-21T06:47:57.181Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>If you are studying to get an engineering major or master's degree in Electric-Electronic Engineering, computer sciences or embedded systems, you have a curious mind that enjoys to deep dive and implement solutions, you are eager to learn and work in top of the notch technology and you are within 1 year of getting your university degree (plus or minus 6 months), then we are looking for you.<br><br>As a student contributing in leading-edge RLS team you will have the opportunity to balance your classes while learning in many of the available focus areas within this team. RLS team offers you technical career growth opportunities such as: working with industry leading foundry technologies, working with EDA vendors on development of next generation capabilities, breakthrough innovation in low power optimizations, inclusive work environments, access to principal engineers and highly competitive team members from which to learn from and codevelop methodologies and solutions that will directly impact Intel's GPU product roadmap.</p><p></p><p>In this team, you can grow and contribute in many different internal sub-scopes such as: ML/AI applied techniques, improve synthesis placement and routing to foster a better design convergence, clock tree implementation, power efficiency, library collateral delivery, floor planning, interface with DFX architects to implement SCAN flows to guarantee high coverage, timely design convergence and reliable chain connectivity algorithms to detect issues.</p><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school <span class=\"long-word\">work/classes/research</span> and/or relevant previous job and/or internship experiences.</p><p></p><p><b>Minimum Qualifications:</b></p><ul><li>Studying Bachelor's Degree, \"Licenciatura\" or Master's Degree in Electronic, Electrical engineering, VLSI, Computer Science</li><li>6 months of academic experience in topics such as: VLSI, Synthesis place and route tools, structural design flow automation, digital design, DRC convergence (School or previous assignment are ok)</li><li>Fluent written and spoken English (Advanced Level)</li><li>Immediate availability</li><li>Experience scripting languages: Python and TCL.</li><li>1 year internship</li></ul><p><br><br><b>Preferred Qualifications:</b></p><ul><li>Experience with Synopsys suite basics: ICC, Design Compiler, Fusion Compiler, Library compiler</li><li>Interpret Verilog or System Verilog netlists and older scripted languages such as PERL</li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (Costa Rica)<p></p><p></p>Primary Location:&nbsp;Costa Rica, San Jose<p></p><p></p>Additional Locations:<p></p><p></p><p></p><p></p>Business group:Intel Architecture, Graphics, and Software (IAGS) brings Intel's technical strategy to life. We have embraced the new reality of competing at a product and solution level-not just a transistor one. We take pride in reshaping the status quo and thinking exponentially to achieve what's never been done before. We've also built a culture of continuous learning and persistent leadership that provides opportunities to practice until perfection and filter ambitious ideas into execution.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>"
    },
    {
        "position": "Engineer Internship",
        "company": "IKO Industries, Inc",
        "location": {
            "city": "Sumas",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ebd4e7c136a0a2ce77fa822173ed9b65?lvk=G6YF6WPoG9fcC-Zta_moag.--M3wQyJHpZ",
        "posted": "2021-06-16T06:47:57.948Z",
        "lastScraped": "2021-06-21T06:47:57.948Z",
        "description": "<div><div><p><b>IKO Industries Ltd.</b> is a market leader in the manufacturing of roofing and building materials. IKO is a Canadian owned and operated business with production facilities worldwide and has many years of unparalleled success in the roofing materials industry. Quality, integrity, and trustworthiness are the values that underlie this success, and we have built this company by hiring people who hold these values. People like you!<br>&nbsp;</p><p></p><p><b>Job Description</b></p><p><b>Key Responsibilities:</b></p><ul><li>Facilitate the implementation of 5S Lean Manufacturing systems into the manufacturing plant environment</li><li>Monitor critical environmental data</li><li>Gather data from various data tracking systems</li><li>Conduct plant walk-throughs daily for the identification of any safety or environmental concerns</li><li>Evaluate workplace ergonomics</li><li>Facilitate the creation of a visual workplace for the manufacturing floor</li><li>Conduction vibration testing and analysis</li><li>Create drawings in Auto-Cad</li><li>Assist in the transitioning of data from the existing Computerized Maintenance Management System (CMMS) from MP2 to Maximo</li><li>Assist with inventory and parts management</li><li>Other duties as assigned</li></ul><p><b>Qualifications: </b></p><ul><li>Must be a current Junior or Senior enrolled in Mechanical, Electrical, Industrial, or Environmental Engineer degree programs.</li><li>Auto-CAD proficiency preferred</li><li>Must be able to stand and walk frequently</li><li>Must be comfortable working at heights occasionally</li><li>Must be able to lift up to 30 lbs unassisted</li><li>Microsoft Office Suite proficiency required (Outlook, Word, Power Point and Excel)</li></ul><p></p><p><b>Benefits of Employment:</b> IKO recognizes that its success is due to the strength of its employees. A primary goal of IKO is to promote individual employee's sense of accomplishment and contribution so that employees enjoy their association with IKO. The Company invests in its employees so that they are the most knowledgeable in the industry, and undertakes great efforts to nurture loyalty to, and teamwork at, IKO. We are pleased to offer competitive compensation, health care, a progressive and challenging workplace and a commitment to teamwork and integrity.<br></p><p><b>Diversity and Equal Opportunity Employment:</b> IKO Industries Ltd. is an equal opportunity employer. We are committed to diversity and inclusion and are pleased to consider all qualified applicants for employment without consideration to race, religion, creed, color, national origin, age, gender, sexual orientation, marital status, veteran status or disability.IKO Industries Ltd. encourages and welcomes applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.</p></div></div>"
    },
    {
        "position": "Career Training Program (CTP) - Food Manufacturing Quality Assurance",
        "company": "Kroger",
        "location": {
            "city": "Layton",
            "state": "UT",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3ca5c12a59615e7edae805dd9cd68ff5?lvk=0V6HHwq-L6JMc8ud9zFH8w.--M4Cal05D7",
        "posted": "2021-06-18T06:47:58.689Z",
        "lastScraped": "2021-06-21T06:47:58.689Z",
        "description": "<div><div><p><strong>Company Name:</strong>Layton Dough<br><strong>Position Type:</strong>Employee<br><strong>FLSA Status:</strong>Non-Exempt<br></p><p>Kroger's purpose, to feed the human spirit by feeding our associates, our customers and our communities, starts with food. Food nourishes our bodies, brings us joy and connects us to each other. As a leading food manufacturing company, Kroger operates throughout the United States providing superior products that fill 40% of the dairy, bakery and grocery items you see at our retail stores. Are you passionate about the future of food? You've come to the right place. We want the very best talent to help lead something big.</p><p><br> In our Quality Career Training Program, you will learn with the best in the business in championing supplier food safety, managing ingredient material categories, and working with both internal and external partners to ensure the safety of our products and processes. You will impact our business and your development by leveraging your knowledge and skills to provide technical expertise, become a leader, and be recognized as a valued partner for our plant, sourcing, and business teams.</p><p><br> The projects you manage in this role will provide you with a high level of cross-functional exposure and will accelerate your ability to navigate and influence across our organization.Do meaningful work, make a difference, and improve lives - starting with your own. Join our team in the Career Training Program and start building your foundation for success!</p><p><br><strong>PLEASE NOTE</strong>: Mobility for promotion to additional plants throughout the United States is expected.<br></p> Position Summary: <p>Entry level professional opportunity for recent college graduates. The CTP Program is designed to prepare candidates for first level leadership positions upon successful completion of the 12-24 month program. CTPs build technical and leadership competencies in the selected area of expertise while gaining a broad knowledge base of all core business functions critical to the manufacture of Kroger products. Relocation is a requirement of the CTP Program. Perform all jobs safely, efficiently and accurately to maintain and improve the performance of the entire division in the areas of Safety, Quality, Reliability (SQR) and our Customer 1st strategy. Provide leadership that embodies our 7 Kroger Manufacturing High Performance Work System Principles. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety.</p> Essential Job Functions: <ul><li>Initiate active development through interactions with team members, mentors, Corporate and Plant sponsors</li><li>Demonstrate excellence in project planning, execution, and timing through project evaluation and use of available resources to expedite project completion</li><li>Participate in the multi-faceted orientation process</li><li>Demonstrate commitment inthe plant safety process</li><li>Contribute and participate in practical, challenging and meaningful assignments</li><li>Follow established programs, policies and practices to produce safe quality foods that meet regulatory and company requirements</li><li>Support the development, implementation, maintenance, and ongoing improvement of the SQF Systems</li><li>Accountable to the Kroger Manufacturing Food Safety and Quality Principles</li><li>Must be able to perform the essential functions of this position with or without reasonable accommodation</li></ul> Minimum Position <span class=\"long-word\">Qualifications/Education:</span> <ul><li>Must relocate as a requirement of the CTP Program</li><li>Experience through internships, part time, or full time positions</li><li>Self-motivated; able to meet deadlines with limited supervision</li><li>Strong oral and written communication skills</li><li>Strong attention to detail, with high degree of accuracy and precision</li><li><strong>Administration</strong>: Bachelor's degree in Business or related field</li><li><strong>Engineering</strong>: Bachelor's degree in Mechanical or Electrical Engineering</li><li><strong>Finance</strong>: Bachelor's degree in Accounting/Finance</li><li><strong>Human Resources</strong>: Bachelor's degree in Human Resources or related field</li><li><strong>Manufacturing Information Technologist (MIT)</strong>: Bachelor's degree in Computer Engineering or Computer Science, Microsoft (MS) Certified IT Professional (MCITP) or MS Certified Systems Administrator (MCSA) with emphasis in MS Windows 2008 Server and MS SQL 2008 database management; or MS Certified Technology Specialist certifications in Windows 7, MS Windows 2008 Server, and MS SQL Server 2008</li><li><strong>Operations</strong>: Bachelor's degree in Operations Management or related field</li><li><strong>Quality Assurance</strong>: Bachelor's degree in Food Science, Biological or Chemical Sciences; knowledge of Dairy/ Bakery/Grocery Food Science or Product Development</li></ul> Desired Previous Job <span class=\"long-word\">Experience/Education:</span> <ul><li>Graduate degree in discipline related field</li><li>Experience in manufacturing environment</li><li>Experience in union environment</li></ul><p><strong>Education Level:</strong>Bachelor's Required<br><strong>Required Travel:</strong>Up to 25%<br><strong>Required <span class=\"long-word\">Certifications/Licenses:</span></strong>None<br><strong>Position Type:</strong> Full-Time<br><strong>Regions:</strong>Mountain</p><p>States: Utah; Alabama; Alaska; American Samoa; Arizona; Arkansas; California; Connecticut; Delaware; District of Columbia; Federated States of Micronesia; Florida; Georgia; Guam; Hawaii; Idaho; Illinois; Indiana; Iowa; Kansas; Kentucky; Louisiana; Maine; Marshall Islands; Maryland; Massachusetts; Michigan; Minnesota; Mississippi; Missouri; Montana; Nebraska; Nevada; New Hampshire; New Jersey; New Mexico; New York; North Carolina; North Dakota; Northern Mariana Islands; Ohio; Oklahoma; Oregon; Palau; Pennsylvania; Puerto Rico; Rhode Island; South Carolina; South Dakota; Tennessee; Texas; Vermont; Virgin Islands; Virginia; Washington; West Virginia; Wisconsin; Wyoming<br> Keywords: Food Science</p><p></p><p><strong>Jobs at Kroger Logistics: </strong>To support<strong></strong>and reward our hardworking and friendly associates, we offer much more than just a paycheck. We strive to feed your future by offering the ingredients you need to create your own recipe for success at work and in life. Our associates receive a full plate of benefits that promote their physical, emotional and financial well-being, including access to competitive health care and retirement benefits, paid time off, mental health resources, associate discounts and opportunities to learn, grow and advance. Our associates also get to help us make a difference in our communities through our Zero Hunger | Zero Waste and Framework for Action: Diversity, Equity and Inclusion plans. Visit the thekrogerco.com to learn more about our work in the communities we serve and how our associates help us be a good neighbor. </p><p>Below is a list of some of the benefits we offer our associates.</p><p>Health &amp; Well-being Benefits:</p><ul><li><em>Health care benefits</em></li><li><em>Paid time off such as vacation, sick leave, and parental leave </em></li><li><em>Mental and emotional support resources through our Employee Assistance Program</em></li></ul><p>Financial Benefits:</p><ul><li><em>Participation in a 401(k) plan, subject to certain eligibility requirements</em></li><li><em>Group term life insurance eligible </em></li><li><em>Eligible for an annual bonus based upon company performance </em></li><li><em>Associate discounts</em></li></ul><p>Growth and Development Benefits:</p><ul><li><em>Tuition assistance, college scholarships and educational leave of absence, depending on varying criteria by location and subject to certain eligibility requirements</em></li><li><em>Robust internal training and development resources to grow your career</em></li></ul><p><em>We</em>want the best for associates and our customers, and together, we strive to create a welcoming and engaging environment where you'll love to work. If you are interested in becoming a valued member of our team, apply now. We look forward to getting to know you!</p><p><strong>Company Overview:</strong>Kroger Family of Companies employs nearly half a million associates who serve over 11 million customers daily through a seamless shopping experience under a variety of banner names. At The Kroger Co., we are Fresh for Everyone and dedicated to our Purpose: To Feed the Human Spirit. We are committed to creating <span class=\"long-word\">#ZeroHungerZeroWaste</span> communities by 2025. Careers with The Kroger Co. and our family of companies offer competitive wages, flexible schedules, benefits and room for advancement.</p><p>Posting Notes: UT||Layton|| 500 Sugar Street-Bld.5 ||84041 || Layton Dough||None||Food Technology; Management; Manufacturing ||Employee|| Non-Exempt || Full-Time|| None</p><p></p></div></div>"
    },
    {
        "position": "per diem Audiologist",
        "company": "Ohio Health",
        "location": {
            "city": "Riverside",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7d8eba2f9f39f48cedc497532b1af861?lvk=S5gdpbQwWhUP0B4KpALSrQ.--M40MXQAdN",
        "posted": "2021-06-17T06:47:59.412Z",
        "lastScraped": "2021-06-21T06:47:59.412Z",
        "description": "<div><div><p><b>We are more than a health system. We are a belief system.</b> We believe wellness and sickness are both part of a lifelong partnership, and that everyone could use an expert guide. We work hard, care deeply and reach further to help people uncover their own power to be healthy. We inspire hope. We learn, grow, and achieve more - in our careers and in our communities.</p><p></p><p><b>Job Description Summary:</b></p><p></p>This position is responsible for performing, measuring, and assessing acoustic emissions and other auditory response procedures on patients. The position supports the hospital program of Universal Newborn Hearing Screening.<p></p><p><b>Minimum Qualifications:</b></p><p></p>Master's Degree (Required)LIC - Licensed in Field - State of Ohio<p>Speech and Hearing science with an emphasis in Audiology; Current License in good standing with the Ohio Board of speech-Language Pathology and Audiology Completion of audiology internship; Basic computer skills; Understanding of how to interpret test results. 1-2 yrs. related Experience</p><p></p><p><b>Work Shift:</b></p>Day<p></p><p><b>Scheduled Weekly Hours :</b></p>1<p></p><p><b>Department</b></p>Speech Therapy<p></p><p></p><p>Join us!<br>... if your passion is to work in a caring environment<br>... if you believe that learning is a life-long process<br>... if you strive for excellence and want to be among the best in the healthcare industry</p><p></p><p>Equal Employment Opportunity</p><p></p><p>OhioHealth is an equal opportunity employer and fully supports and maintains compliance with all state, federal, and local regulations. OhioHealth does not discriminate against associates or applicants because of race, color, genetic information, religion, sex, sexual orientation, gender identity or expression, age, ancestry, national origin, veteran status, military status, pregnancy, disability, marital status, familial status, or other characteristics protected by law. Equal employment is extended to all person in all aspects of the associate-employer relationship including recruitment, hiring, training, promotion, transfer, compensation, discipline, reduction in staff, termination, assignment of benefits, and any other term or condition of employment&nbsp;</p></div></div>"
    },
    {
        "position": "Dietitian Research - CRU",
        "company": "Mayo Clinic",
        "location": {
            "city": "Rochester",
            "state": "MN",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e3c83e3c92004215a23379999877b874?lvk=RsJN4iQ3Vt7Z70UmXPpHwg.--M40EdW0pc",
        "posted": "2021-06-17T06:48:00.095Z",
        "lastScraped": "2021-06-21T06:48:00.095Z",
        "description": "<div><p>The Research Dietitian is responsible for implementing nutrition related needs of research protocols. He/she is a nutrition resource to clinical investigators and may assist them in protocol development. The nutrition requirements of assigned protocols must be assessed and carried out by the Research Dietitian. </p><p>Tasks performed in this position include: developing research related assessment tools and education materials; conducting patient education and assesments; developing research diet regimens; collecting and analyzing nutritional data;maintaining up-to date, accurate nutritional analysis software and nutrient data bases;assisting researchers in interpreting nutritional data; and writing scientific papers.A Bachelors degree in nutrition or dietetics, completion of an American Dietetic Association accredited internship and ADA Registered Dietitian status is required. The candidate must demonstrate good communication skills to interact with patients, physicians and co-workers. Attention to detail and analytic ability is important for developing research diet regimens, compiling, analyzing and interpreting nutrition data and managing an accurate nutrient database. </p><p>Understanding of nutrition analysis software and basic computer skills is also necessary.Masters in nutrition or a related field and/or previous clinical experience is preferred.ADA Registered Dietitian statusMayo Clinic is located in the heart of downtown Rochester, Minnesota, a vibrant, friendly city that provides a highly livable environment for more than 34,000 Mayo staff and students. The city is consistently ranked among the best places to live in the United States because of its affordable cost of living, healthy lifestyle, excellent school systems and exceptionally high quality of life.Employment Type: PT</p></div>"
    },
    {
        "position": "Youth Therapist - 1,000 Sign-On Bonus!",
        "company": "Devereux Texas Treatment Network",
        "location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/83382b95d09a91fda12bbc232b3d2779?lvk=ELpvxO1CBzLwvU8qnGWDdw.--M3t_5BdMF",
        "posted": "2021-06-15T06:48:00.887Z",
        "lastScraped": "2021-06-21T06:48:00.887Z",
        "description": "<div><div><p>Description </p><p><em></em></p><p>&nbsp;</p><p><em>Have you been keeping your eyes open for a new opportunity?</em> <em>Do you enjoy working in a collaborative environment being a positive influence in the behavioral health field? If you answered YES, then Devereux's Clinician role is the perfect fit for you!</em></p><p>&nbsp;</p><p><strong>Being a Clinician has its Advantages!&nbsp;<em>Full and Part Time Available! PLUS - 1,000 Sign-On Bonus for Full Time!</em></strong></p><p>&nbsp;</p><p>Devereux Advanced Behavioral Health Arizona's Outpatient program offers comprehensive outpatient counseling services for individuals, families, and groups in the office, school and/or home setting. Specialties include the treatment of Autism Spectrum Disorder, ADHD, Conduct Disorders, Mood Disorders, Physical Abuse, Sexual Abuse, and Anxiety Disorders.</p><p>&nbsp;</p><p>As a Clinician you will provide individual, family and at times group therapy services to clients and/or their families in a variety of settings including but not limited to the client's home, in office, school or other community locations. Completes assessments and treatment plans, as well as all required documentation related to the client. Is an active member of the client's Child and Family Team. &nbsp; &nbsp; &nbsp;&nbsp;&nbsp; </p><p>&nbsp;</p><p>As a Clinician at Devereux, you will work with other dedicated professionals who share your passion for helping individuals in need. We offer:</p><ul><li><p><strong>Competitive Pay</strong> - Annual salary <strong>PLUS</strong> incentive-based compensation for meeting performance and productivity targets ***<strong>PLUS - 1,000 Sign-On Bonus for Full Time!</strong></p></li><li><p>The opportunity to work in a highly collaborative environment, with an incredibly supportive team</p></li><li><p>The chance to further develop your clinical skills, including supervision hours toward&nbsp;licensure</p></li><li><p>Flexible <strong>day</strong> schedule Monday-Friday 9am-5pm (some flexibility for evening hours may be needed) - <em><strong>Full and Part Time Available!</strong></em></p></li><li>Paid time off and sick time</li><li>Generous Employee Referral Program with a fast payout milestone</li><li><strong>Quality Low-Cost Benefits (medical, dental, vision), plus student loan debt assistance and 30-day benefit eligibility waiting period for new hires! <span class=\"long-word\">http://benefits.devereux.org</span></strong></li></ul><p>&nbsp;</p><p><em>Keywords: Clinician, LAC, LPC, LMSW, LCSW, LAMFT, LMFT, therapist, intakes, assessment, behavioral health, mental health, human services</em></p> Qualifications <ul><li>Master's degree in psychology, counseling, social work or related field <strong>required</strong></li><li>Current and valid associate or independent level license through the AZBBHE (LAC, LPC, LMSW, LCSW, LASAC, LISAC); <strong>OR&nbsp;</strong>ability to obtain within 6 months of hire</li><li>Clinical Internship and one (1) year of relevant experience working within the behavioral health field <strong>required</strong></li><li><strong>Bilingual in English and Spanish (preferred not required)</strong></li><li>Proficient computer skills and a working knowledge of Microsoft office programs</li><li>Exceptional communication skills (written and verbal)</li><li>Current unrestricted AZ Level One Fingerprint Clearance Card</li><li>Able to attend full time paid New Hire Orientation Monday-Friday 8:30am-5:00pm</li><li><strong>Devereux requires all individuals interviewing for a position involving contact with children to complete The Diana Screen, a screening that assesses a candidate's understanding of appropriate boundaries between adults and children</strong></li></ul><p>&nbsp;</p><p><strong>What is Devereux doing to support and protect the health and safety of our staff during the COVID-19 pandemic?</strong></p><p>Devereux is committed to the health and safety of our staff. &nbsp;All Devereux centers have formal infectious-disease and emergency-management plans tailored to specifically address the unique aspects of communicable disease prevention including COVID-19. We adhere to all mandates and guidelines in accordance with the Centers for Disease Control and Prevention (CDC) and the World Health Organization and practice all protocols that protect the health and safety of our staff. To learn more of how Devereux is supporting and protecting our staff during the pandemic, please visit <span class=\"long-word\">https://jobs.devereux.org/#covid.</span></p> Company Overview <p><strong>About Devereux Advanced Behavioral Health</strong></p><p>&nbsp;</p><p>Devereux Advanced Behavioral Health is one of the largest and most advanced behavioral healthcare organizations in the country. Informed by the latest advancements in science and medicine, we combine evidence-based interventions with compassionate family engagement to help change lives. We were founded in 1912 by special education pioneer, Helena Devereux. Today, Devereux is a national nonprofit partner for individuals, families, schools and communities, serving many of the most vulnerable members of our society in areas of autism, intellectual and developmental disabilities, specialty mental health, and child welfare.</p><p>&nbsp;</p><p><strong>Our Mission:&nbsp;</strong>Devereux Advanced Behavioral Health changes lives - by unlocking and nurturing human potential for people living with emotional, behavioral or cognitive differences.</p><p>&nbsp;</p><p>We employ more than 7,500 staff and operate 15 centers in 13 states. We offer a comprehensive national network of clinical, therapeutic, educational, and employment programs and services that positively impact the lives of tens of thousands of children, adults and their families every year.</p><p><br><strong>Our Culture, Our Expectations</strong></p><p>At Devereux, we strive to incorporate Servant Leadership into our culture and every aspect of our organizational framework. This is integrated into the delivery of quality programming for the individuals we serve, their families, and other stakeholders, as well as the development and empowerment of our employees. We offer challenging and exciting work, and our supportive team environment creates an empowering and positive atmosphere. To be successful in our work environment, you will put the needs of others first, and will feel called to serve, and called to lead. As a member of our team, you will support our commitment to cultural diversity and equity across all programs and services, and within all policies and employee practices.</p><p>&nbsp;</p><p>We also believe diversity, equity and inclusion (DEI) is fundamental to providing the highest quality of services. We will continuously engage in anti-racist work across our organization and strive to dismantle systemic and structural racism, starting with ourselves. We are deeply committed to racial justice and equity as an employer and as a healthcare provider. We denounce racism in all forms.</p><p>&nbsp;</p><p><strong>Competitive Salary and Benefits</strong></p><p>In addition to a competitive salary, Devereux provides a comprehensive health and welfare program to eligible full-time employees, family members and domestic partners. Eligible employees are eligible to start benefits after <strong>30 days</strong> of employment. In addition, we offer;</p><ul><li>Medical (including telemedicine via phone, web, app), dental, prescription drug, preventative care, and mental health services.</li><li>Student loan debt assistance, tuition reimbursement and continuing education assistance.</li><li>Generous time-off,&nbsp;403(b) retirement plan with matching benefit, and voluntary/employee paid supplemental life and accident coverage.</li><li>Employee assistance / work-life balance program.</li></ul><p><strong>Visit <span class=\"long-word\">benefits.devereux.org</span> to see why we are a great place to work!</strong></p><p>&nbsp;</p><p><em>Devereux is a drug-free workplace, drug screening required. EOE</em></p> We can recommend jobs specifically for you! Click here to get started.</div></div>"
    },
    {
        "position": "Intern.220217",
        "company": "Scientific Games",
        "location": {
            "city": "Reno",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9ee4f2d065a74a8b844ae23cab7928f5?lvk=9EwO2vGe2x4W_68qXg_4_w.--M3wRCnnkR",
        "posted": "2021-06-15T06:48:01.580Z",
        "lastScraped": "2021-06-21T06:48:01.580Z",
        "description": "<div><div><p>Gaming:</p><p>Are you ready to level up your career?</p><p><br>At Scientific Games, we are committed to making the best games, platforms and systems in the world. We are looking for smart, passionate and creative people to join our team and help us transform the gaming world. We are a global, industry-leading gaming technology company that embraces challenge, fosters an inclusive culture, values integrity, innovation and winning, and is committed to developing and supporting its people.</p><p></p><p>Whether you are a member of our award winning game studios, our industry leading systems group, product management, manufacturing group, services or any of our other amazing Gaming teams, you will be creating compelling games played around the world. We are dedicated to being the industry's only COMPLETE global solutions provider with products that will enhance the entire gaming operation, both on the casino floor and behind the scenes.</p><p></p><p>If you are ready to play...Come join us and let's make games!</p><p></p><p></p><p></p>Scientific Games:<p>Scientific Games (SG) is a global leader focused on delivering an ever-expanding portfolio of lottery and gaming products and services to the world's government-regulated and government-sponsored entities. Scientific Games' global reach is made possible through the expertise, skill and dedicated efforts of its 8,000+ employees who serve lottery and gaming customers in more than 100+ countries on 6 continents.</p><p></p><p></p>Position Summary<p><b>Job Description</b></p><p></p><p>Intern: The person in this position works in a temporary or part time position with an emphasis on on-the-job training</p><p></p><p></p><p></p><p></p>Qualifications<p><b>Education</b></p><p>Must have a high school diploma or equivalency.</p><p><br><b>Years of Related Experience</b></p><p></p><p><br><b>Physical Requirements</b></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit, stand, walk, bend, use hands, operate a computer, and have specific vision abilities to include close and distance vision, and ability to adjust focus working with computer and business equipment.</p><p><br><b>Work Conditions</b></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.<br><br>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.<br><br>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, ethnicity, gender, sexual orientation, veteran status, or on the basis of disability or any other federal, state or local protected class. If you'd like more information, please click on this link: EEO Poster</p><p></p><p></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.</p><p></p><p>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.</p><p></p><p>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law, please click here for EEOC Poster.</p></div></div>"
    },
    {
        "position": "JR0172826 - Hardware Validation Engineer Intern",
        "company": "Intel",
        "location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b601443b471dc3efac116dc3db1c1ee2?lvk=ARSoQdonwsM8OQm28wXL_Q.--M4-npxbkV",
        "posted": "2021-06-18T06:48:02.262Z",
        "lastScraped": "2021-06-21T06:48:02.262Z",
        "description": "<div><p>Job ID: JR0172826 Job Category: Intern/Student Primary Location: Phoenix, AZ US Other Locations: Job Type: Intern Hardware Validation Engineer Intern Job Description Technology and Manufacturing Group (TMG) at Intel Corporation in Chandler, AZ, is looking for a candidate to do a 6 to 12 months internship starting in the Summer/Fall of 2021. This candidate will work full-time during the summer months and work part-time while attending school full-time. Responsibilities may be quite diverse of a technical nature. </p><p>Job assignments are usually for the summer or for short periods during breaks from school. The candidate will be part of the test engineering team working on world-class Automatic Test Equipment (ATE) in Chandler, Arizona. This is an internship and compensation will be given accordingly based on candidate education level and internship duration. </p><p>You must possess the below requirements to be initially considered for this position. Qualifications You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the requirements and are considered a plus factor in identifying top candidates. </p><p>Knowledge and/or experience listed below would be obtained through a combination of your school work and/or classes and/or research and/or relevant previous job and/or internship experiences. Minimum Qualifications: Candidates must be pursuing a Master's degree or PhD degree in Electrical or Computer System Engineering or Computer engineering degrees. 3+ months of experience in digital logic design and scripting skills, python basic coding skills CC. </p><p>Inside this Business Group As the world's largest chip manufacturer, Intel strives to make every facet of semiconductor manufacturing state-of-the-art -- from semiconductor process development and manufacturing, through yield improvement to packaging, final test and optimization, and world class Supply Chain and facilities support. Employees in the Technology and Manufacturing Group are part of a worldwide network of design, development, manufacturing, and assembly/test facilities, all focused on utilizing the power of Moore's Law to bring smart, connected devices to every person on Earth Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. <span class=\"long-word\">USInternJR0172826Phoenix</span></p></div>"
    },
    {
        "position": "Information Systems Part-Time Intern",
        "company": "Walnut Valley Water District (CA)",
        "location": {
            "city": "Walnut",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/6c69e1afde5eb95a079fbd020428d713?lvk=_NzaTCgneciGJfu0fGyHog.--M3thzVnOZ",
        "posted": "2021-06-14T06:48:03.000Z",
        "lastScraped": "2021-06-21T06:48:03.000Z",
        "description": "<div><div> DEFINITION <p></p><p>Under direct supervision: to provide technical, operational, and internal customer service computer support to District departments; to introduce, implement, and maintain computers and related hardware and software, operating systems and networks; and to perform a variety of related technical tasks.</p><p>&nbsp;</p><p>DISTINGUISHING CHARACTERISTICS</p><p>This is the entry-level position for performing a variety of work in the Information Systems Department. Incumbents work under close supervision, performing various tasks associated with maintaining the District's information systems.&nbsp;</p><p>&nbsp;</p>Receives immediate, technical and functional supervision from the Information Systems Specialist. May receive immediate supervision from other assigned management or supervisory staff.&nbsp; <p></p> DUTIES MAY INCLUDE, BUT ARE NOT LIMITED TO THE FOLLOWING: <p></p><p>Duties may include, but are not limited to, the following:</p><p>&nbsp;</p><div><ul><li>Perform a variety of responsible technical duties in support of District computer set-ups and troubleshooting.</li><li>&nbsp;Monitor information technology systems to ensure integrity and tune the system to meet performance requirements.</li></ul></div><div><ul><li>Prepares new computer workstations for use with the District network and installs necessary software; installs and maintains software on existing computer workstations.</li></ul></div><div><ul><li>Perform printer set up and deployment. Tasks may also include printer troubleshooting and diagnostics including downloading drivers, replacing toner, cleaning or replacing rollers and clearing jams.&nbsp;</li></ul></div><div><ul><li>Answer questions and respond in a timely manner; provide technical support and information, assistance and training over the phone and in person related to computer technology related issues.&nbsp;</li></ul></div><div><ul><li>Analyze, diagnose, test, and recommend solutions for problems with computers, tablets, operating systems, software and hardware problems.&nbsp;</li></ul></div><div><ul><li>Perform UPS battery replacement and deployment.&nbsp;</li></ul></div><div><ul><li>Create user ID's and troubleshoot network and application logins.&nbsp;</li></ul></div><ul><li>Create, modify, copy or delete files.&nbsp;</li><li>Install, upgrade, configure, and program software, applications and hardware.&nbsp;</li></ul><div><ul><li>Monitor systems for viruses and take corrective action, as needed.&nbsp;</li></ul></div><div><ul><li>Build and maintain positive working relationships with co-workers, vendors, and the public using principles of good customer service.&nbsp;</li></ul></div><div><ul><li>Perform related duties as assigned.</li></ul></div><p>TYPICAL PHYSICAL ACTIVITIES</p><ul><li>Positions in this class typically require: stooping, bending, kneeling, crouching, standing, lifting, fingering, grasping, talking, hearing, seeing, and repetitive motions</li><li>Communicates orally with management, co-workers, and the public in face-to-face, one-on-one, and group settings</li><li>Regularly uses a telephone for communication</li><li>Operate and use modern office equipment including a computer, computer terminals, copiers, and various software packages.</li><li>Must be capable of reading, writing, and understanding material that is highly technical in nature</li><li>Must be able to carry, push, pull, reach, and lift equipment and materials up to 50 lbs.</li><li>Sits for extended periods of time</li><li>Hearing and vision within normal ranges</li></ul><p>EMPLOYMENT STANDARDS KNOWLEDGE OF:</p><ul><li>Methods and techniques of computer equipment and related hardware.</li><li>Common software used in personal computers, such as Microsoft Office, Word, Excel, Power Point, and others.</li><li>Telecommunications equipment</li><li>Proper safe use of the tools, materials, and equipment used to accomplish assigned duties or projects</li><li>Principles and practices of good customer service.</li></ul><p>ABILITY TO:</p><ul><li>Maintain computer systems and software applications</li><li>Troubleshoot computer hardware, software, network problems</li><li>Maintain personal computers and network servers, as well as related peripheral and communications equipment</li><li>Assist the Information Systems Specialist in updating technical documentation and policies.&nbsp;</li><li>Maintain confidentiality of records and information</li><li>Effectively learn and apply related policies, procedures and practices affecting information systems</li><li>Communicate clearly and concisely, both orally and in writing.</li><li>Prepare and maintain accurate and complete records and reports</li></ul><p></p><p></p><p>DESIRABLE EDUCATION AND EXPERIENCE</p><p>Any combination of education and experience, which would likely provide the necessary knowledge and abilities, is qualifying.</p><p>A typical way to obtain the knowledge and abilities would be:</p><p>Experience troubleshooting IT issues or performing technical or support tasks for computer systems.</p><p>High school graduation or equivalent supplemented by college level course work or specialized training in computer science, information technology, database design or related fields.</p><p>Bachelor's degree with major coursework in computer science, information technology or a related field.</p><p>&nbsp;</p><p>SPECIAL REQUIREMENTS</p><ul><li>Ability to pass a pre-employment physical.</li><li>Valid California Driver's License - Class \"C\". &nbsp;Must maintain an acceptable driving record as determined by the District's insurance carrier.</li><li>Reliable telephone in service at all times.</li><li>Reliable personal transportation.</li></ul><p>WORK SCHEDULE</p><p>Up to 20 hours per week.&nbsp;</p>Tentative schedule: Monday, Tuesday, and Thursday- hours may vary.&nbsp; <p></p><p></p><p>Overtime assignments</p><p>The purveyance of water is a vital service to the community and as such requires the availability of District personnel at all times. &nbsp;Consequently, Information Systems employees, including the Information Systems Intern will be required to respond to emergency calls, accept periodic overtime assignments, and perform any and all other duties deemed necessary by the District. &nbsp;Lacking a bona fide excuse satisfactory to the District, a failure to report when called could result in termination.</p><p>&nbsp;</p><p>FAIR LABOR STANDARDS ACT</p>For the purposes of the Fair Labor Standards Act, the Information Systems Intern shall be considered a \"non-exempt\" position. <p></p></div></div>"
    },
    {
        "position": "Returns & Resale Operations Intern",
        "company": "Abound",
        "location": {
            "city": "Burbank",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/abound-9b19b5f1/returns-resale-operations-intern-291fcbdc?lvk=kU2-bHWsxjJwV99AE6Y_lg.--M49_Addnk",
        "posted": "2021-06-17T06:48:04.015Z",
        "lastScraped": "2021-06-21T06:48:04.015Z",
        "description": "<div><p><strong>Abound is seeking rising seniors or recent college graduates who are ready to explore a career in ecommerce, including but not limited to: warehouse management, returns processing, inventory management, fulfillment, and customer experience. Our internship could be the first step on a career path that offers tremendous growth opportunities!</strong></p><p>The ideal candidate is forward-thinking, communicative and excited about being a part of a unique effort to build a returns &amp; fulfillment model for a one-of-a-kind marketplace in the ecommerce wholesale warehousing industry.</p><p>What you will learn:</p><ul><li>How to carry-out returns processing &amp; order fulfillment from start to finish</li><li>How to inspect inbound returns for damage, defects, misrepresentation</li><li>How to utilize inventory management software to process and locate merchandise</li><li>How to label and organize inventory according to shelving location system</li><li>How to utilize project management software to process, track, document efforts from start to finish</li><li>How to pick and pack ecommerce orders, upholding fantastic fulfillment standards and helping implement sustainable fulfillment efforts</li><li>How to document feedback, pain-points, and successes on returns processing, order fulfillment, shelving organization, and inventory management systems to later present in strategy sessions with the team</li></ul><p>Requirements:</p><ul><li>This position requires that candidates must be authorized to work in the United States on an ongoing basis without requiring sponsorship in the future</li><li>Must be able to lift objects/boxes up to 25 pounds</li><li>Must be able to commute to Burbank, CA and work in-person, subject to COVID-19 protocols</li><li>Excellent written and verbal communication skills</li><li>Competitive GPA</li><li>Proficient computer literacy, open to learning new software programs. Familiarity with Notion, Monday, Slack, Kustomer, Excel and Google Suite helpful but not required.</li></ul><p>Who you are:</p><ul><li>You are driven and ready to dive into hands-on work with a small team</li><li>You have a strong ability to operate independently, and you are passionate about growing professionally</li><li>You are very organized and detail-oriented</li><li>You are extremely reliable and you communicate challenges well</li><li>You resonate with Abound's mission and have a genuine interest in one or more of the facets of our returns &amp; resale operations</li><li>You are team-oriented and thrive on collaboration with an open-minded and supportive team</li></ul><p>About us:</p><p>Abound helps indie retailers stock their stores by making product sourcing as easy as online shopping. With Abound, indie store owners get access to thousands of the very best emerging brands. And, emerging brands are able to get their products into retail shops around the country.</p><p>Based in NYC, we're a small, fast-growing company. We're excited to be building a team as diverse as the thousands of brands and retailers who use Abound every day.</p><p>Terms &amp; benefits:</p><ul><li>3-month, part-time Internship, $20/hour</li><li>In-person in Burbank, CA</li><li>Room to grow and take on new responsibilities within the company with a possibility of permanent work</li><li>Supportive, flexible team environment</li><li>Become a core member of a rapidly growing startup</li></ul><p>Job Types: Part-time, Internship</p><p>Pay: $20.00 per hour</p><p>Schedule:</p><ul><li>Monday to Friday</li></ul></div>"
    },
    {
        "position": "Plant Facilities Intern",
        "company": "Matanuska Telephone Association",
        "location": {
            "city": "Palmer",
            "state": "AK",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ea0b5cff9e0141a7c65c57854664c1a3?lvk=U_zlqq7fCLzH1RXGlAJ_ng.--M48OeDXc3",
        "posted": "2016-09-15T06:48:04.830Z",
        "lastScraped": "2021-06-21T06:48:04.830Z",
        "description": "<div><div><p><strong>Plant Facilities Intern<br></strong></p><p><br>We are searching for an experienced Plant Facilities Intern at our Palmer Plant Bldg facility.&nbsp; <br><br><strong>Primary Duties and Responsibilities:</strong>&nbsp;</p><p></p><p><strong>SUMMARY OF POSITION'S ROLE</strong></p><p>Temporary interns are used periodically to help supplement the workforce throughout MTA.&nbsp; They will work in close collaboration with the Plant Facilities staff by assisting with research and records correction of various Business Intelligence (BI) generated discrepancy reports between the plant facilities equipment, customer location and billing data.</p><p><strong>&nbsp;SPECIFIC TASK DESCRIPTION</strong><strong>&nbsp; </strong></p><ol><li><ol><li>Assist Plant Facilities with researching the cause(s) of various BI discrepancy reports. Helping to identify patterns in the discrepancies caused by current automation or current workflows failing, or where new automation may help.</li><li>Assist with reconciling equipment information into records database where applicable or notifying the appropriate work group of corrections that need to be made by their department. Other database work as required.</li><li>Good written and oral communication skills. Ability to be effective and efficient working either independently with mentor oversight, or as a supporting role as a member of a small team.</li><li>Other duties as assigned.</li></ol></li></ol><ol><li>&nbsp;</li></ol><br><br><strong>Required Qualifications:</strong><p></p><p><strong></strong></p><p><strong>EDUCATION: </strong> Applicants currently enrolled in a Bachelor's program for Electrical or Computer Engineering, or equivalent major will be given first preference. Applicants will be currently enrolled in a full time degree program and returning to the program after the completion of the internship.&nbsp; When a student intern is required during the normal school year, the applicant may be a part time student. 3.0 GPA or greater preferred. Strong computer skills in MS Office and drafting skills preferred. </p><p><strong>WORK EXPERIENCE:</strong> Previous related internship/work experience preferred, preference will be given to returning student interns that have performed satisfactorily in the past.</p><p></p><p><em>*full (PDF) job description available upon request*</em><br><br>Employment Type: Temporary Student Intern</p><p>Compensation Type: Hourly Wage</p></div></div>"
    },
    {
        "position": "Engineering Intern",
        "company": "City of Ontario",
        "location": {
            "city": "Ontario",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/7e8a32e14da6630ccc7e8333030c0f75?lvk=2aDyxQ4CcGg3nf9KQTvMIQ.--M3thxuGKw",
        "posted": "2021-06-14T06:48:05.598Z",
        "lastScraped": "2021-06-21T06:48:05.598Z",
        "description": "<div><div> The Position <p></p><div><div><strong>Engineering Intern</strong></div><div> &nbsp; </div><em>The City of Ontario reserves the right, if necessary, to accept only the first one hundred (100) applications from applicants that meet the qualification guidelines below.</em><br><div><br>Are you interested in making a positive impact on your community while developing professional skills in the areas of water and sewer infrastructure, environmental programs, and land development? The City of Ontario has an excellent part-time opportunity for an Engineering Intern to assist in and complete a wide variety of administrative, technical, and research-oriented assignments. Interns have the ability to observe in and participate in a variety of tasks that support the overall operation of the assigned department. </div><div> &nbsp; </div><div> The ideal candidate shall have knowledge of basic engineering principles, especially as they pertain to hydraulics, pipe design, and the operation and maintenance of municipal utilities; the capability to use AutoCAD and MS Office software programs; the ability to compile and organize data and create reports and spreadsheets; and perform other essential functions as required.&nbsp;In addition, the candidate will have the ability to work effectively and efficiently in a team environment.&nbsp;Additionally, the successful candidate will be a model for the City's Approach to Public Service -&nbsp;Commitment to the Community, Achieving Excellence Through Teamwork, and Doing the Right Thing the Right Way - and emulate the qualities of a 5 Tool Player - Leader, Thinker, Operator, Communicator, and Public Servant. Interns can be assigned to&nbsp;the Ontario Municipal Utilities Company&nbsp;or Engineering. </div><div> &nbsp; </div><div> The Administrative Intern is a part-time/temporary position, scheduled to work less than 29 hours per week, and is not eligible to participate in the City's health insurance or retirement plans. </div><div> &nbsp; </div></div><strong>The City of Ontario&nbsp;</strong><br>&nbsp; <div> The City of Ontario is a dynamic leading community in the Inland Empire with a variety of full-time and part-time employment and volunteer opportunities. Ontario enjoys the reputation of being a&nbsp;progressive City which provides solid leadership to its citizens and to the business community. The City provides a full range of services to the community including; Police, Fire, Administrative Services, Community Life &amp; Culture, Development, Economic Development, Housing &amp; Neighborhood Preservation, Public Works and the Ontario Municipal Utilities Company. The City's team is staffed with approximately 1,200 full-time and 200 part-time diverse and talented employees who work to support a common goal of providing excellent service to the community. <br><br>We invite you to learn more about the City of Ontario by reviewing the City's&nbsp;website. A few useful links are also listed below: <br><br> Approach to Public Service (Core values for City of Ontario employees) <br><br> <span class=\"long-word\">OntarioCityEmployees.org</span> (Information about City of Ontario employee benefit plans) <br><br> The Ontario Plan (The City's Comprehensive Business Plan for Development) </div><p></p> Examples of Essential Functions <p>The essential functions typically performed by the Administrative Intern include the following:<br><br></p><ul><li>Assists members of management, professional, and technical staff by performing basic administrative and technical assignments.<br>&nbsp;</li><li>Utilizes Geographical Information Systems (GIS) for data analysis.<br>&nbsp;</li><li>Operates personal computers, printers, and other office equipment.<br>&nbsp;</li><li>Performs research and preliminary administrative analysis.<br>&nbsp;</li><li>Performs field work which includes photo documentation of construction sites and public streets.<br>&nbsp;</li><li>Reviews and summarizes publications and documents.<br>&nbsp;</li><li>Composes and edits correspondence, memorandums, reports, and other special assignments.<br>&nbsp;</li><li>Gathers and tabulates data.<br>&nbsp;</li><li>Responds to requests for information and general questions from the public.<br>&nbsp;</li><li>Prepares files for storage.<br>&nbsp;</li><li>Assists with specials projects and events.<br>&nbsp;</li><li>Performs other related duties as assigned.<br>&nbsp;</li></ul><p></p> Qualification Guidelines <p><strong>Education</strong><br><br>Equivalent to completion of two years of college at an accredited college/university with major course work in&nbsp;Engineering, Environmental Science, or a related field.<br><br><strong>Licenses</strong><br><br>Valid California Class C driver's license and an acceptable driving record at the time of appointment and throughout employment.<br><br><strong>Desirable</strong><br><br>Currently enrolled as a junior/senior level undergraduate student, in good standing, at an accredited college/university with a major emphasis in Civil Engineering, Environmental Science or a related field.</p> Supplemental Information <p><strong>How to Apply</strong><br><br>Apply online by clicking on the \"Apply\" link at the top of this announcement. If this is the first time applying for a position using&nbsp;governmentjobs.com&nbsp;you will be prompted to create a new user account, otherwise log in with your user name and password. Your application and responses to any supplemental questions will be used to evaluate your qualifications for this position.&nbsp;It is suggested that your application include the following:<br>&nbsp;</p><ul><li>List any relevant experience and education that demonstrates that&nbsp;you&nbsp;qualify for the position.</li><li>List all periods of employment for at least the past 10 years, beginning with your most recent or present employer (including if applicable, all employment with the City of Ontario).</li><li>Separately list each position held, including different positions with the same employer.</li></ul>A resume may be attached to your application&nbsp;but will not substitute for the&nbsp;proper completion of your application. Applications that are not properly completed&nbsp;may be&nbsp;rejected. <br><br><strong>Supplemental Questions</strong><br><br>To complete your application for this position you will be prompted to respond to supplemental questions. This information will be used as part of the application screening and selection process and is designed to help you present&nbsp;your qualifications for this position.&nbsp;This may include a selection step in which your application and supplemental questions are reviewed and scored by a panel of raters familiar with this position. <br><br>Incomplete responses, false statements, omission, or partial information may result in disqualification from the selection process. Your responses should be consistent with the information provided on your application. <br><br>Please provide succinct, concise, descriptive, and detailed information for each question. If you have no experience, write \"no experience\" for the appropriate question. <br><br><strong>Email Notices</strong><br><br>Email is the primary way that the Human Resources or Hiring Department will communicate with you. Please check your email account (including the SPAM folder) on a regular basis for any emails related to the application or selection process. Emails from the city of Ontario will come from \"@ontarioca.gov\" or \"<span class=\"long-word\">governmentjobs.com.</span>\" If you change your email address after submitting your application please visit governmentjobs.com and update your profile. <br><br><strong>Frequently Asked Questions</strong><br><br>If you have any additional questions regarding the application process, please refer to our Frequently Asked Questions <p></p></div></div>"
    },
    {
        "position": "Intern, Chassis and Vehicle Dynamics, Fall 2021",
        "company": "Lucid Motors",
        "location": {
            "city": "Newark",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/a4738305cd4007bbe5d253964f1cec4d?lvk=OUFbZMF6pZZfWDtAR2eqyw.--M3tQtaxgs",
        "posted": "2021-06-13T06:48:06.342Z",
        "lastScraped": "2021-06-21T06:48:06.342Z",
        "description": "<div><div><div> Leading the future of luxury mobility</div><div><br></div><div> Lucid's mission is to inspire the adoption of sustainable energy by creating the most captivating luxury electric vehicles, centered around the human experience. Working at Lucid Motors means having a shared vision to power the future in revolutionary ways. Be part of a once-in-a-lifetime opportunity to transform the automotive industry.</div><div><br></div><div> We are actively seeking&nbsp;interns for our Chassis and Vehicle Dynamics team. Our ideal candidate exhibits a can-do attitude and approaches his or her work with vigor and determination. Candidates will be expected to demonstrate excellence in their respective fields, to possess the ability to learn quickly and to strive for perfection within a fast-paced environment.&nbsp;</div><div><br></div><div> Responsibilities <ul><ul><li>Take one or more technical projects, related to suspension, steering, braking, wheels, tires, and/or vehicle dynamics, from idea through to completion</li><li>Apply data-driven, decision making, and teamwork, to solve complex problems and questions</li><li>Support other engineers on the team, in data collection and analysis, component/system, design, project management, and logistics, and prototype vehicle fleet, management</li><li>Ask questions, absorb learning, make the most of this opportunity to grow your skills and knowledge - we're here to help you as much as you're here to help us!</li></ul></ul></div><div> Qualifications <ul><ul><li>0-3 Years of work or intern experience</li><li>Proven knowledge of how passenger vehicles, especially their suspension, steering, and braking systems, work</li><li>Experience with a CAD program</li><div><br></div><div><b>Preferred Qualifications</b></div><div><br></div><li>A desire to apply what you know, but also question every assumption</li><li>Experience in 3D design (CATIA, Solidworks, AutoCAD, Creo, etc) is a plus</li><li>Experience with CAN tools and data acquisition equipment is a plus</li><li>Experience with scripting languages/tools and methods to optimize data management is a plus</li><li>Experience with Formula SAE Electric, </li></ul></ul></div><div> Other <ul><ul><li><b>Programming Timing: </b>September 7th - November 26th, 2021 (12 weeks); End date can be extended up to December 23rd, 2021 based on individual needs; Some flexibility with start date is available if needed</li><li><b>Availability:</b> Full-time preferred but Part-Time available</li><li><b>Location:</b> This position is in Newark, CA. You must be prepared to start on site for your first day of employment</li><li><b>Work Environment: </b>Production Lab</li><li><b>Anticipated Hours:</b> 8:30 am - 5:30 pm</li><li><b>Compensation:</b> Student compensation is based on location and current degree level, non-negotiable</li><li><b>Visa Sponsorship: </b>Lucid may but is not obligated to sponsor foreign national employees requiring company sponsorship for U.S. employment authorization</li><li><b>Medical benefits:</b> Dental and vision on day 1 for all interns working 30+ hours a week; medical for interns in California working 30+ hours a week</li><li><b>Housing:</b> No compensation for housing</li><li><b>Bonus:</b> No signing bonus, relocation bonus, equity, or other bonuses currently</li><li><b>Relocation:</b> Round trip flight from/to permanent residence</li><li><b><span class=\"long-word\">Housing/Transportation:</span></b> You must provide your own living arrangements and transportation in the local area</li><li><b>Background Check:</b> All offers of employment are contingent on clearing a background check</li><li><b>Publications:</b> This internship may involve access to and/or knowledge of Lucid confidential and proprietary information. As a requirement of accepting an offer of employment with Lucid Motors, you will agree to keep all such information confidential and not disclose such information to any third party including but not limited to research papers, thesis, dissertation, school papers, or any other publication in any form without prior written approval from Lucid Legal Department.</li></ul></ul></div><div> Be part of something amazing</div><div><br></div><div> Come work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we're providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.</div><div><br></div><div> At Lucid, we don't just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace and is an affirmative action employer. &nbsp;We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.</div><div><br></div><div><i>To all recruitment agencies: Lucid Motors does not accept agency resumes. Please do not forward resumes to our careers alias or other Lucid Motors employees. Lucid Motors is not responsible for any fees related to unsolicited resumes.</i> <b><i>&nbsp;</i></b></div></div></div>"
    },
    {
        "position": "Planning Intern",
        "company": "City of Carson",
        "location": {
            "city": "Carson",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e4f684de55ac3be1da84814dbc8a4c0b?lvk=VUCfBIAv_FFjhz1Hrkhi4Q.--M3ti4_kB7",
        "posted": "2021-06-15T06:48:07.049Z",
        "lastScraped": "2021-06-21T06:48:07.049Z",
        "description": "<div><div> THE POSITION <p></p><strong>This job postings is open continuously and may close at any time without prior notice </strong><br> The City of Carson - Community Development Department is seeking current/recently graduated Planning/Urban <span class=\"long-word\">Development/Geography</span> students, who are are eager and passionate to learn about planning within the public sector. Interns will be exposed to various related fields, including California Environmental Quality Act (CEQA) for both Public and private projects. &nbsp; Interns will be directly supervised and trained by professional planners, and will be expected to assist with Planning Division counter activities and special projects while becoming experienced with plan reviews and the processing of ministerial applications.. Also, interns will get the opportunity to collaborate with other City personnel on various projects. &nbsp; The ideal candidate must be motivated and willing to engage others within a professional and dedicated planners and other staff members within the Planning Division. S/he must have successfully complete at least two to three relevant college courses, and preferably is at least at the junior level. &nbsp; <br>&nbsp; <strong>Position Information</strong>: <br>&nbsp;This is a part-time at-will position (FLSA: non-exempt), limited to 960 hours per fiscal year. &nbsp;Typical work schedule is between 7 am to 6 pm, Monday to Thursday. &nbsp;Position will be classified in accordance with the selected candidate's qualifications. <br><br>&nbsp; <strong>Required Documents</strong>: <br> All required documents must be submitted with the application at the time of submission. <ol><li>Resume</li><li>Cover Letter, addressed to the Planning Manager, detailing why you are interested in the position</li><li>Proof of relevant education (official or unofficial transcripts)</li><li>Proof of current college/grad school enrollment (if applicable)&nbsp;</li></ol><strong>Job Summary</strong>: <br>Under direction, performs entry level tasks relating to urban planning, zoning and community design. <p></p> ESSENTIAL DUTIES <p></p> (These functions are representative and may not be present in all positions in the class. &nbsp;Management reserves the right to add, modify, change or rescind related duties and work assignments.) <ol><li>Performs research, compiles data and prepares reports related to municipal planning and zoning.</li><li>Conducts surveys and studies and makes recommendations based on findings.</li><li>Assists with file maintenance, data entry and generates reports using a variety of computer software programs.</li><li>Prepares written correspondence.</li><li>Participates in the preparation and revision of brochures, graphic materials, maps and other administrative materials.</li><li>Works with other professional planning employees assigned to special work projects.</li><li>Provides information to and consults with staff and the public on planning matters.</li><li>Operates a variety of office machines, including a personal computer.</li><li>Reads and interprets architectural drawings and maps.</li><li>Attend meetings or events in the evening or on weekends.</li><li>May drive to different locations to perform work, site <span class=\"long-word\">inspections/surveys</span> or attend meetings within and outside the City.</li><li>Performs related duties as required.</li></ol><p></p> QUALIFICATIONS <p></p> A typical way to obtain the requisite qualifications to perform the duties of this class is as follows: <br>&nbsp; <br><strong>Education and Experience</strong>: <br>Must be enrolled in a college or university as a senior or graduate student majoring in Planning, Architecture, Urban Studies or related field or must have graduated with a degree in Planning, Architecture, Urban Studies or related field within the last six months. <br><br><strong>Knowledge of</strong>: <ul><li>Modern English usage.</li><li>Mathematics, including statistics.</li><li>Research and analytical methods.</li><li>Personal computers and related software applications.</li><li>Principles of planning and urban development.</li><li>Methods of report presentation.</li></ul><p><strong>Skill and Ability to</strong>:</p><ul><li>Compile, review and evaluate data.</li><li>Communicate effectively orally and in writing.</li><li>Read and interpret architectural drawings and maps.</li><li>Understand and carry out oral and written instructions.</li><li>Learn City organization, operations, policies and objectives.</li><li>Establish and maintain effective working relationships.</li><li>Deal tactfully with the public.&nbsp;</li></ul><strong><span class=\"long-word\">License/Certificate</span></strong>: <br>Possession of a valid California Class C Drivers License. <p></p> WORKING CONDITIONS <p>Employee accommodations for physical or mental disabilities will be considered on a case-by-case basis. &nbsp;Positions in this class normally:</p><ul><li>Require vision (which may be corrected) to read small print.</li><li>Perform work which is primarily sedentary.</li><li>Are subject to inside environmental conditions.</li><li>May be required to use personal vehicle in the course of employment.</li><li>May be required to attend periodic evening meetings and/or to travel within and out of City boundaries to attend meetings.</li><li>May be required to work evenings or weekends.</li></ul><strong>RECRUITMENT PROCESS</strong><br> &nbsp; <br> Applications will be screened and evaluated for relevant training and experience. &nbsp;Applications must be complete, and include any and all required documents. Only those applicants determined to be among the most qualified may be invited to participate in the recruitment process, which will consist of the following steps: <ol><li>Complete applications - including all required documents</li><li>HR review for minimum qualifications</li><li>SME review (100% weight)</li></ol> This is an at-will position, with no permanency rights. <br><br> Revisions to the recruitment process can be made at the discretion of the Human Resources Department. &nbsp;Applicants will be notified by email if a revision is made.&nbsp; <br> &nbsp; <br><strong><strong><strong>OTHER INFORMATION</strong><br><br>The City of Carson is an Equal Opportunity Employer. &nbsp;Special assistance with the application and examination process is available, upon request, for persons with disabilities. &nbsp;Call Human Resources for assistance at (310) 952-1736.</strong></strong><br> &nbsp; <br><strong><strong><strong>APPOINTMENT</strong><br><br>Any offer of employment, or acceptance of an employment offer, is contingent upon passing live scan, background check and other tests. &nbsp;All new employees are required to take a loyalty oath.</strong></strong><br> &nbsp; <br> The provisions of this bulletin do not constitute an expressed or implied contract. &nbsp;Any provisions contained herein may be modified or revoked without notice. &nbsp;All statements made on the job application are subject to investigation and/or verification. &nbsp;Inaccurate and/or false statements will be cause for disqualification, removal from the eligibility list or discharge from employment. <br> &nbsp; <br><em>IMPORTANT NOTICE</em> : &nbsp;THIS POSITION IS OPEN AND INTERNAL. <br> &nbsp; <br><strong><strong><strong>CURRENT CITY OF CARSON EMPLOYEES</strong><br><br>Please do not use your City of Carson email address as part of this application. &nbsp;You must indicate a personal email address in order to receive communications and/or notices from Human Resources throughout the recruitment process.</strong></strong> &nbsp; <p></p></div></div>"
    },
    {
        "position": "Engineering Intern",
        "company": "Southern California Gas Company",
        "location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/4ee660997b43c4023fabc1bb44ed28c3?lvk=x6uv5x4OpC9ZV8KP8Av26g.--M44kkZ07s",
        "posted": "2021-06-18T06:48:07.745Z",
        "lastScraped": "2021-06-21T06:48:07.745Z",
        "description": "<div><div><p><strong>Primary Purpose</strong></p><p>SoCalGas is offering exciting new opportunities for hands-on training with skilled professionals. Student internships provide developmental opportunities for the right candidates, to put theory into practice and gain valuable work experience that is personally and professionally rewarding. Current enrollment in an engineering program as an undergraduate or graduate in a 4-year college or university. This is a year-round part time position and requires reliable transportation. </p><p>The Engineering Intern supports their department with reviews, analysis and recommendations for engineering requests from the field, planning office and headquarters. This position provides research support (data gathering utilizing company records stored in hard copy or computer form), engineering and cost benefit analysis for gas processing facility projects. Provides gas processing analysis support utilizing available simulation software.</p><p>Join SoCalGas today and share our vision of becoming the cleanest natural gas utility in North America. Headquartered in the heart of downtown Los Angeles, we deliver affordable and increasingly renewable energy to 22 million customers across central and Southern California.</p><p><strong>Qualifications </strong></p><ul><li>Sophomore/Junior or Senior with at least two semesters or quarters before graduation. </li><li>Full-time student in a College or University Engineering program, in the chemical or mechanical engineering disciplines.</li><li>A 3.0 over all GPA or above is required and maintain the 3.0 throughout the internship. </li><li>Be able to work 16-20 hours per week on a year-round basis, with a flexible work schedule.</li><li>Solid understanding of fluid flow, thermal dynamics, piping systems and computer applications preferable.</li><li>Must be able to analyze significant amounts of data and develop multiple options and scenarios in reaching decisions.</li><li>Must be able to manage and implement multiple projects and to coordinate assigned activities and individual projects.</li><li>Knowledge of project management software tools, PC operations, spreadsheets, CAD, mainframe, networks, and MS Office preferable.</li><li>Must clearly and concisely communicate technical information and concepts in formal and informal settings with other departments in the company.</li><li>Strong communications skills. This position requires constant communication with people of various levels of work experience; must be willing to learn from others, be self-motivated to perform tasks that are simple or complex.</li></ul><div>&nbsp;</div><div><p><strong>Southern California Gas Company is an EEO/AA Employer</strong></p></div></div></div>"
    },
    {
        "position": "Strategic Student Program: Application Support Intern (T&I; Fall 2021; SISW-PLM)",
        "company": "Siemens Corp",
        "location": {
            "city": "Cypress",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/4647e97715e5926c948a3ac3d525aae8?lvk=FmgC6En3tCSrdBBqJ8Smew.--M3tg9LXtc",
        "posted": "2021-06-15T06:48:08.429Z",
        "lastScraped": "2021-06-21T06:48:08.429Z",
        "description": "<div><p>Strategic Student Program (SSP) Discover your career with us at Siemens Software! We are a leading global software company dedicated to the world of product lifecycle management; from computer aided design, to 3D modeling and simulation- helping innovative global manufacturers design better products, faster! With the resources of a large company, and the energy of a software start-up, we have fun together while creating a world class software portfolio. </p><p>Our culture encourages creativity, welcomes fresh thinking and focuses on growth, so our people, our business, and our customers can achieve their full potential. We're currently recruiting students for our Fall 2021 Strategic Student Program. Our intern and co-op positions will allow you to find a career path that most inspires you. </p><p>Here, you will apply your education to solve real-world problems, and turn theory into practice. At Siemens, our goal is to empower our students to become the next leaders of our company. We have positions available in software development, user experience, data management, technical marketing, engineering consulting, and research &amp; design innovation. </p><p>More information on our specific roles are included in this document. Baseline Requirements: Currently enrolled as an undergraduate student Minimum 3.0 GPA Authorized to work in the United States without the need for current or future sponsorship by the company Preferred junior or senior status Able to work a maximum of 25 hours during the Fall 2021 semester Perks: Victorious daily ping pong tournaments Paid volunteer time off Employee discounts at our top customer sites Networking with our global leaders Mentorship from senior engineers Individual career development planning Professional and technical workshops Energetic student community Leadership opportunities Potential for full time offers after university graduation and completion of the program Technology &amp; Innovation (T&amp;I) Application Support Intern As part of our architecture team in T&amp;I, you will become immersed in innovation and research activities with our group. We work with new technologies and partners initiatives that add additional capabilities to our portfolio typically using NX, Teamcenter and others as data sources. </p><p>These capabilities are developed with focus on engineering data leveraging technologies around data inference, data science and data blending. In this role, you will work with SW portfolio architects to use new technologies to create new insights that will support development of new capabilities. The intern will champion projects to: Work on a team in an agile development environment Work collaboratively with internal business clients to understand their needs and build solutions to address them Work with on-premise and cloud technology Populate data warehouses and data lakes with data from inhouse systems Produce and consume APIs Write scripts if required to address temporary needs Debug, troubleshoot and fix issues Organization Requirements: Currently enrolled in a university pursuing an undergraduate or master's degree in Computer Science, Information Systems, IT, or a related field Exceptional written and verbal communication skills Experience with Java, Javascript, and Python Experience with Machine Learning, Data Warehouse, Natural Language Processing, or Ontologies is a plus Experience with data analytics tools such as Power BI or Tableau Result-driven, detail-oriented Eager learner and team player Works well under pressure Driven and self-motivated Working knowledge of AWS is preferred but not required Organization: Digital Industries Company: Siemens Industry Software Inc. </p><p>Experience Level: Student (Not Yet Graduated) Job Type: Part-time Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. EEO is the Law Applicants and employees are protected under Federal law from discrimination. </p><p>To learn more, Click here. Pay Transparency Non-Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. </p><p>California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here.</p></div>"
    },
    {
        "position": "Environmental Programs Intern",
        "company": "City of Ontario",
        "location": {
            "city": "Ontario",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/77de1a2442c9ef4bd02e28da295c3e3c?lvk=Y5BsKBdeyZ1brTBBD0AeVA.--M3ti-Tu27",
        "posted": "2021-06-14T06:48:09.187Z",
        "lastScraped": "2021-06-21T06:48:09.187Z",
        "description": "<div><div> The Position <p></p><strong>Environmental Programs Intern</strong> &nbsp; <em>The City of Ontario reserves the right, if necessary, to accept only the first one hundred (100) applications from applicants that meet the qualification guidelines below.</em><br><br>Are you interested in making a positive impact on your community while developing professional skills in the areas of municipal utilities environmental programs? The City of Ontario has an excellent part-time opportunity for an Environmental Programs Intern to assist in and complete a wide variety of administrative, technical, and research-oriented assignments. Interns have the ability to observe in and participate in a variety of tasks that support the overall operation of the Ontario Municipal Utilities Company Environmental Programs Division. &nbsp; The ideal candidate shall have knowledge of basic engineering principles, as they relate to protection of the environment and the health and safety of the public. The intern will work with a team involved in preparing wastewater discharge permits issued to industrial users, performing monitoring and regulatory compliance activities, initiating enforcement activities to ensure industrial user compliance, education outreach, data management and analysis, and field work. Knowledge of principles of mathematics, biology, chemistry, and other scientific disciplines are important in order to perform the duties. The ideal candidate will have a basic understanding of the operation and maintenance of municipal utilities; the capability to use MS Office software programs; the ability to compile and organize data and create reports and spreadsheets; and perform other essential functions as required. In addition, the candidate will have the ability to work effectively and efficiently in a team environment. Additionally, the successful candidate will be a model for the City's Approach to Public Service - Commitment to the Community, Achieving Excellence Through Teamwork, and Doing the Right Thing the Right Way - and emulate the qualities of a 5 Tool Player - Leader, Thinker, Operator, Communicator, and Public Servant.&nbsp; &nbsp; The Administrative Intern is a part-time/temporary position, scheduled to work less than 29 hours per week, and is not eligible to participate in the City's health insurance or retirement plans. &nbsp; <strong>The City of Ontario&nbsp;</strong><br>&nbsp; The City of Ontario is a dynamic leading community in the Inland Empire with a variety of full-time and part-time employment and volunteer opportunities. Ontario enjoys the reputation of being a&nbsp;progressive City which provides solid leadership to its citizens and to the business community. The City provides a full range of services to the community including; Police, Fire, Administrative Services, Community Life &amp; Culture, Development, Economic Development, Housing &amp; Neighborhood Preservation, Public Works and the Ontario Municipal Utilities Company. The City's team is staffed with approximately 1,200 full-time and 200 part-time diverse and talented employees who work to support a common goal of providing excellent service to the community. <br><br>We invite you to learn more about the City of Ontario by reviewing the City's&nbsp;website. A few useful links are also listed below: <br><br> Approach to Public Service (Core values for City of Ontario employees) <br><br> <span class=\"long-word\">OntarioCityEmployees.org</span> (Information about City of Ontario employee benefit plans) <br><br> The Ontario Plan (The City's Comprehensive Business Plan for Development) <p></p> Examples of Essential Functions <p></p><p>The essential functions typically performed by the Environmental Programs Intern include the following:</p><br><ul><li>Performs customer service-related activities, assigns billing codes, prepares reports, manages data, reviews wastewater pretreatment and business permit applications and tracks them.</li></ul><ul><li>Assists with compliance activities and performs other administrative program related work to assist with the operations of the Environmental Programs Division.</li></ul><ul><li>Assists members of management, professional, and technical staff by performing basic administrative and technical assignments.</li></ul><ul><li> Utilizes Geographical Information Systems for data analysis. </li><li> Operates personal computers, printers, and other office equipment. </li></ul><ul><li>Performs research and preliminary administrative analysis.</li></ul><ul><li>Performs field work when requested of commercial and industrial users.</li></ul><ul><li>Reviews and comments on publications and documents.</li></ul><ul><li>Composes and edits correspondence, memorandums, reports, and other special assignments.</li></ul><ul><li>Gathers and tabulates data.</li></ul><ul><li>Responds to requests for information and general questions from the public.</li></ul><ul><li>Prepares files for storage.</li></ul><ul><li>Assists with specials projects and events.</li></ul><ul><li>Performs other related duties as assigned.</li></ul><p></p> Qualification Guidelines <p><strong>Education</strong><br><br>Equivalent to completion of two years of college at an accredited college/university with major course work in&nbsp;Engineering, Environmental Science, or a related field.<br><br><strong>Licenses</strong><br><br>Valid California Class C driver's license and an acceptable driving record at the time of appointment and throughout employment.<br><br><strong>Desirable</strong><br><br>Currently enrolled as a junior/senior level undergraduate student, in good standing, at an accredited college/university with a major emphasis in Civil Engineering, Environmental Science or a related field.</p> Supplemental Information <p><strong>How to Apply</strong><br><br>Apply online by clicking on the \"Apply\" link at the top of this announcement. If this is the first time applying for a position using&nbsp;governmentjobs.com&nbsp;you will be prompted to create a new user account, otherwise log in with your user name and password. Your application and responses to any supplemental questions will be used to evaluate your qualifications for this position.&nbsp;It is suggested that your application include the following:<br>&nbsp;</p><ul><li>List any relevant experience and education that demonstrates that&nbsp;you&nbsp;qualify for the position.</li><li>List all periods of employment for at least the past 10 years, beginning with your most recent or present employer (including if applicable, all employment with the City of Ontario).</li><li>Separately list each position held, including different positions with the same employer.</li></ul>A resume may be attached to your application&nbsp;but will not substitute for the&nbsp;proper completion of your application. Applications that are not properly completed&nbsp;may be&nbsp;rejected. <br><br><strong>Supplemental Questions</strong><br><br>To complete your application for this position you will be prompted to respond to supplemental questions. This information will be used as part of the application screening and selection process and is designed to help you present&nbsp;your qualifications for this position.&nbsp;This may include a selection step in which your application and supplemental questions are reviewed and scored by a panel of raters familiar with this position. <br><br>Incomplete responses, false statements, omission, or partial information may result in disqualification from the selection process. Your responses should be consistent with the information provided on your application. <br><br>Please provide succinct, concise, descriptive, and detailed information for each question. If you have no experience, write \"no experience\" for the appropriate question. <br><br><strong>Email Notices</strong><br><br>Email is the primary way that the Human Resources or Hiring Department will communicate with you. Please check your email account (including the SPAM folder) on a regular basis for any emails related to the application or selection process. Emails from the city of Ontario will come from \"@ontarioca.gov\" or \"<span class=\"long-word\">governmentjobs.com.</span>\" If you change your email address after submitting your application please visit governmentjobs.com and update your profile. <br><br><strong>Frequently Asked Questions</strong><br><br>If you have any additional questions regarding the application process, please refer to our Frequently Asked Questions <p></p></div></div>"
    },
    {
        "position": "Intern - Springdale, AR (Year-Round)",
        "company": "Tyson Foods",
        "location": {
            "city": "Springdale",
            "state": "AR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b771fb8eee11b7414938f89caf5c7412?lvk=s2O2R9n5XS3AlBVi9QkCkw.--M3wP4IYag",
        "posted": "2021-06-15T06:48:09.865Z",
        "lastScraped": "2021-06-21T06:48:09.865Z",
        "description": "<div><div><p>SUMMARY: This position is responsible for maintaining internal reports using Microsoft Office applications internal systems and external databases including IRI Spectra Mintel NPD ; creating ad hoc reports; running errands for the department - trips to Sam s etc; making copies filing etc; ordering samples for sales presentations; and any other project needs of the marketing managers on the team. Based on initiative this position offers the potential for exposure to accounting systems sales analysis and a financial perspective; customer service; large corporate environment; consumer packaged goods marketing experience; business planning; and enhancement of computer skills. REQUIREMENTS: Education: Incoming junior senior or MBA at least one year of school remaining . Business or Animal Science majors preferred. Experience: Previous work experience in any field. Computer Skills: Strong computer skills with a working knowledge of Excel familiarity with Access Word and PowerPoint. Supervisory: None Special Skills: Ability to multitask; motivated self-starter.</p><p></p><p></p><p><b>Work Shift: </b></p><p></p>1ST SHIFT (United States of America)<p></p><p></p><p></p><p>When completing a Tyson Foods employment application, be sure to complete all tasks listed on the candidate home page. If not, you will see a message that there are 1 or more task(s) that require attention. Applicants for hourly production positions must complete the task to provide additional information to be considered from employment.</p><p></p><p>Tyson is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. All qualified applicants will be considered without regard to race, national origin, color, religion, age, genetics, sex, sexual orientation, gender identity, disability or veteran status.</p><p></p><p><b>CCPA Notice. If you are a California resident, and would like to learn more about what categories of personal information we collect when you apply for this job, and how we may use that information, please read our CCPA Job Applicant Notice at Collection, click here.</b></p></div></div>"
    }
]