[
    {
        "position": "IT Internship Summer 2022 - Corporate",
        "company": "Humana",
        "location": {
            "city": "Louisville",
            "state": "KY",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/3dcebc153695cf075e696aa8999f907a?lvk=W0JlZN1u8Fl1buDZRC04Dg.--M9aI1zWU-",
        "posted": "2021-08-27T18:31:42.040Z",
        "lastScraped": "2021-09-03T18:31:42.040Z",
        "description": "<div><div><p><b><b><b>Description</b></b></b></p><p></p>Humana Inc., is a health and well-being company based out of Louisville, KY. We started out as a nursing home company back in 1961...who knew that decades later we would be listed as a Fortune 500 company for 25 years! Today we are home to 50,000+ employees who help to serve our 14.2 million members on a daily basis. Together we are dedicated to helping both our members and employees in becoming the healthiest version of themselves - covering all ends of the spectrum from physical health to mental health. This past year, we have been ranked on the best places to work in IT by Computer World and placed on both Forbes' lists of Best Employers for Diversity and America's Best Employers for New Grads! <br><br>While we may be well known for our efforts in the insurance space, Humana is a tech company at its core. We would not be able to function the way we do today without the solutions, support, and analytical insights provided by our IT organization! We are currently seeking interns who are interested in joining our team and bringing fresh new perspectives to the world of health using technology as a conduit.<p></p><p><b><b>Responsibilities</b></b></p><p></p><p><b>The Basics:</b></p><p></p><p>A key ingredient to ourprogram'ssuccess has revolved around ourdedication to our internship being a developmental program -meaningyoudo notneed to know everything when you join the IT team as an intern!We arehere to help teach and guide you along the way by providing learning sessions, resources, and workshops.You willhave a safe space to learn and be given autonomy to bring your creative solutions tovery real problems.Interns are alsoprovided multiple opportunities for networking throughout the summer!One networking event in particular that is back by popular demand are the coffee chatsthatwe hostwith anyone and everyonefrom directors up to our CIO!On top of that, youwill be exposed to the latest technologies andbestpractices within a <span class=\"long-word\">Fortune500company.The</span> solutions developed by past and current interns are accessibletoover 50,000+Humana associates, which means no \"coffee run\" projectshere - onlymeaningful work!</p><p></p><p><b>What's in it for you?</b></p><ul><li>Collaborate with experienced professionals+ pasttechinterns</li><li>Gain real worldexperience along with industry, business, and technical knowledge</li><li>Network with Humana's leaders</li><li>Competitive summer pay</li><li>Paid Housing(if internship is<b>not</b>virtual)</li><li>Opportunities for Full-time(seniors)and Advanced (juniors and below)offersafter successful completion of Entry Program</li><li>Part-time <span class=\"long-word\">opportunitiesworking</span> remotely from school</li></ul><p></p><p></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p><b>Must-Haves:</b></p><ul><li>Available to work full-time forthe FULL 12 Weeks of theprogram(late May to early August)</li><li>Be acurrent student (3- 6 minimum credit hours) pursuing a degree related to the technology field (Computer <span class=\"long-word\">Science,Information</span> Systems, Informatics, Management Information Systems,etc)</li><li>Have a curiosity+passion for learning</li><li>Display self-motivation + initiativebalanced with a <span class=\"long-word\">collaborativeattitude</span></li><li><b>Work Eligibility: Humana does not provide visa sponsorship or OPT/CPT for our summer internship. For example, this would mean you are either a U.S. citizen, a Lawful Permanent Resident, or in Refugee or Asylee status and do not require visa sponsorship to be eligible</b><b></b></li></ul><p></p><p><b>Nice-to-Haves:</b></p><ul><li>Previous internship and/or workexperience a plus</li><li>Be actively involved on-campus and/or inyourcommunity</li><li>Stronginterest in health and well-beingwith a passion for helping others</li><li>Overall GPA of 3.0 or higher</li></ul><p></p><p></p><p><b><b><b>Scheduled Weekly Hours</b></b></b></p><p></p>40</div></div>"
    },
    {
        "position": "ABA Behavior Technician RBT/BCAT - $22/hr",
        "company": "Learning ARTS",
        "location": {
            "city": "Sacramento",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/learning-arts-e9c9bbf8/aba-behavior-technician-rbt-bcat-22-hr-a859fc37?lvk=CrLMrQrlkUXOCiYLPWu40A.--MA0gIy8Sc",
        "posted": "2021-09-02T18:31:44.961Z",
        "lastScraped": "2021-09-03T18:31:44.961Z",
        "description": "<div><p><strong>**Part-Time Afternoon/Evening shifts available Mon-Fri**<br>**$500 Sign on Bonus**</strong></p><p>Become part of an innovative team that will help design, test, and implement new training and practice methods for an award-winning company. As an RBT/BCAT on our Quality Assurance Team, you will be working directly with Clinical, Regional, and operations directors as you help children in program and use your advanced skills to help others grow on the Learning ARTS Team.</p><p>Learning ARTS has been helping children with developmental disabilities since 1997. We are looking for strong technicians with the following characteristics to fill the Quality Control RBT/BCAT position:</p><ul><li>Good interpersonal and teaching skills</li><li>Excellent computer skills</li><li>Excellent writing skills</li></ul><p><strong>We Offer:</strong></p><ul><li>$500 Sign on Bonus (paid out in 2 increments upon sign off and 90 days)</li><li>Competitive rates</li><li>In-house paid training</li><li>Drive time compensation</li><li>Paid vacation time</li><li>Tuition assistance towards advanced certification</li><li>Assistance in your education goals: free supervision, letters of recommendation, internship opportunities</li><li>Fast promotional opportunities for those wishing to pursue a career in helping kids</li></ul><p><strong>Additional Qualifications:</strong></p><ul><li>Current RBT/BCAT Certification</li><li>6 Semester units of undergraduate work in Human Sciences (Psychology, Human Development, Behavior Analysis, or similar)</li><li>Available Monday-Friday 3PM-7PM and Monday’s 9AM-10AM (for first 3 months of employment)</li><li>High School diploma or GED</li><li>Reliable Transportation</li><li>US work authorization</li><li>Ability to Actively play with kids for 20 minutes at a time</li><li>Ability to stand, sit, squat, bend, twist, and lift 50 lbs</li></ul><p>Employees will also need DOJ/FBI Live Scan Background Clearance, TB Clearance and Immunization records prior to starting work. Learning ARTS will assist in getting the needed clearances.</p><p><em>Learning ARTS supports a diverse workforce and is an Equal Opportunity Employer</em></p></div>"
    },
    {
        "position": "IT Intern",
        "company": "Workforce Enterprises",
        "location": {
            "city": "Santa Fe Springs",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/workforce-enterprises-55fd607a/it-intern-fdb8f564?lvk=qCKEp1NrqC_YfcfF7fFe-Q.--MA5PTHdxs",
        "posted": "2021-09-01T18:31:47.792Z",
        "lastScraped": "2021-09-03T18:31:47.792Z",
        "description": "<div><p>IT Technical Support duties and responsibilities</p><ul><li>Provide technical assistance with computer hardware and software</li><li>Resolve issues for staff via phone, in person, or electronically</li><li>Log bugs and enhancement requests</li><li>Perform hardware and software installations, configurations and updates as needed</li><li>Create and maintain tips and tricks solutions for online database and web site</li><li>Provide introductory on-line &amp; classroom training for company products</li><li>Resolve technical issues in a timely manner using available resources within the company</li></ul><p>IT Technical Support requirements</p><ul><li>Excellent customer service skills</li><li>Strong troubleshooting and critical thinking skills</li><li>Previous working experience in IT support</li><li>Degree in Computer Science or Management Information Systems (MIS)</li><li>In depth knowledge of Windows 10, Mac OS, Microsoft Office 365</li></ul></div>"
    },
    {
        "position": "Software Engineer Intern - Spring 2022",
        "company": "Southwest Airlines Co.",
        "location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c598b9cccfb01dffb7638f4e0973dd96?lvk=00xuMHTZWfy1ubt7pJH7LA.--M9z5r4dJV",
        "posted": "2021-09-01T18:31:49.772Z",
        "lastScraped": "2021-09-03T18:31:49.772Z",
        "description": "<div><div><p>Southwest will provide a stable work environment with equal opportunity for learning and personal growth. Employees will be&nbsp;provided&nbsp;the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.&nbsp;</p><br><p>This Spring Internship is&nbsp;&nbsp;</p><p>&nbsp;</p><ul><li>Part-time and virtual with an expectation of about 24&nbsp;hrs&nbsp;per week (about 2.5-3 days a week) during normal business hours (8am-5pm CT) There is the ability to work up to 40hrs per week if applicable.&nbsp;&nbsp;</li><li>If selected, you will work with your Leader to determine your work schedule.&nbsp;</li><li>Students will still be expected to work Monday – Friday and maintain normal business hours.&nbsp;&nbsp;</li><li>Most teams maintain a hybrid workplace flexibility model with only a few days a week working at HDQ and therefore relocation to Dallas for the internship this Spring 2022 is not required, but opportunities to travel into HDQ on the company jets (Boeing 737’s of course) for training and meetings with your team are supported throughout the internship as needed or able.&nbsp;&nbsp;</li></ul><p>&nbsp;</p><p>Even with a virtual/hybrid model for the spring internships, the culture and connection with your Team is still a vital part of the experience. Trust us, it is sure to be a lot of fun no matter where you are located!&nbsp;</p><p>&nbsp;</p><p>Interns will receive any needed equipment, such as a laptop, for the internship as well as a living stipend and internet stipend paid out one time on your first paycheck (less applicable taxes).&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>DUTIES AND RESPONSIBILITIES: </strong></p><p>&nbsp;</p><p>The Intern will work part-time as a Software Engineer within the Technology Department.</p><p>&nbsp;</p><p>Analyze, design, write program code, test, document, and implement functionally appropriately, technically sound, and well-integrated application systems in accordance with Customer requirements, and organizational methodologies and standards.</p><p>&nbsp;</p><p>Respond to production problems and implement immediate resolution efforts across technology areas.</p><br><p><strong>BASIC QUALIFICATIONS: </strong></p><p><strong>&nbsp;</strong></p><p>High School Diploma, GED or equivalent education required. </p><p>&nbsp;</p><p>Must be at least 18 years of age. </p><p>&nbsp;</p><p>Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986.</p><p>&nbsp;</p><p>This position requires authorization to work in the United States as a permanent employee without sponsorship.</p><p>&nbsp;</p><p><strong>EDUCATION:</strong></p><p><strong>&nbsp;</strong></p><p>Progress toward undergraduate or graduate degree in <strong>Computer Science, Computer Engineering, Information Systems or Information Technology, Operations Research, Industrial Engineering, Business or related degree required.</strong></p><p>&nbsp;</p><p>Students must have a minimum of 30 credit hours completed by the start of the internship.</p><p>&nbsp;</p><p><strong>Senior </strong>level students are preferred.</p><p>&nbsp;</p><p>Students who graduate prior to December 2021 are not eligible for this internship.</p><p>&nbsp;</p><p>Coursework must include computer science fundamentals, programming languages, and related technical studies.</p><p>&nbsp;</p><p><strong><span class=\"long-word\">Skills/Abilities/Knowledge/Work</span> Style:</strong></p><p><strong>&nbsp;</strong></p><p>Exposure to Agile methodologies preferred.</p><p>&nbsp;</p><p>Classroom and/or inudstry experience with the full software development life-cycle preferred.</p><p>&nbsp;</p><p>Classroom and/or industry experience with system and acceptance criteria preferred.&nbsp;</p><p>&nbsp;</p><p>Classroom and/or industry experience using at least one programming language.</p><p>&nbsp;</p><p>Classroom and/or industry experience using Object Oriented Programming (Java) preferred.&nbsp;</p><p>&nbsp;</p><p>Exposure or experience with AWS preferred.&nbsp;</p><p>&nbsp;</p><p>Classroom and/or industry experience using JavaScript, JSON, XML, HTML, and CSS preferred.</p><p>&nbsp;</p><p>Classroom and/or industry experience React preferred.</p><p>&nbsp;</p><p>Previous internship or work experience as a Software Engineer within the past 12 months preferred.</p><p>&nbsp;</p><p>Involvement in Software Development clubs a plus.</p><p>&nbsp;</p><p>Basic knowledge of development methodologies, practices, concepts, technologies and technical options</p><p>&nbsp;</p><p>Demonstrate programming aptitude and ability for logical and abstract thinking.</p><p>&nbsp;</p><p>Facilitate or complete Analysis, design, and programming of viable solutions to high complexity business problems according to user specifications.</p><p>&nbsp;</p><p>Ability to stay organized and manage multiple and concurrent assignments under tight deadlines.</p><p>&nbsp;</p><p>Works well in a culture that is open, direct, respectful, courteous and compassionate.</p><p><strong>&nbsp;</strong></p><p><strong>TIME COMMITMENT:</strong></p><p><strong>&nbsp;</strong></p><p>Part-time - 24-40 hours/week</p><p>&nbsp;</p><p><strong>PAY:</strong></p><p><strong>&nbsp;</strong></p><p>$20.00 per hour + flight privileges</p><p><strong>&nbsp;</strong></p><p>&nbsp;</p><p><em><strong>Please print/save the job description because it won’t be available after you apply</strong></em></p><p><strong>All students must apply online at <span class=\"long-word\">careers.southwestair.com</span>&nbsp;&nbsp;</strong></p><p>&nbsp;</p><p><strong><em>Southwest Airlines is an Equal Opportunity Employer.</em></strong></p><br></div></div>"
    },
    {
        "position": "Forklift Shop Service Technician / Mechanic Internship (Part-time)",
        "company": "Alta Equipment",
        "location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1fa4a5735f6c197f8cebac88890436b2?lvk=Zjq2BOmQYlm_CHUIeS30Hg.--MA38M02S3",
        "posted": "2021-08-17T18:31:51.819Z",
        "lastScraped": "2021-09-03T18:31:51.819Z",
        "description": "<div><div><p>Overview </p><p></p><p>&nbsp;</p><p>Come work for the largest equipment dealer in the Midwest! Are you a <span class=\"long-word\">Technician/Mechanic</span> with auto, diesel, agricultural, material handling, lift truck or heavy equipment repair experience? If so, then we want you on our team!</p><p>&nbsp;</p><p>Technicians are at the backbone of our organization; therefore, we provide them with the tools and resources to be successful:</p><ul><li>Manufacturer technical training program with raises</li><li>Tool insurance</li><li>Bonus incentive programs (safety, quote, profit sharing, new sales leads)</li><li>Competitive wages</li><li>Company uniforms provided</li><li>Work schedule: M-F 7-3:30P</li></ul> Responsibilities The design of our internship program is to expose the student to a dealership environment where Alta can build upon the knowledge already gained. The intern will be partnered with an experienced technician to learn the equipment and the way we conduct business, then proceed to wrench on their own. Full-time availabilty for the summer is available as well as part-time during the school semester.<br> &nbsp; Branch locations include:Itasca, IL, Montgomery, IL, Calumet City, IL and Bolingbrook, IL <p>&nbsp;</p><p>The primary responsibilities of the position consist of, but are not limited to:</p><ul><li>Performing preventative maintenance on customer forklifts and other material handling equipment</li><li>Assisting with the diagnosis and repair on various forms of customer equipment</li><li>Completing each repair job in a timely, efficient and professional manner</li><li>Providing exceptional customer service</li><li>Proper completion and submission of all required paperwork</li><li>Incorporate Alta's Guiding Principles into daily activities</li><li>Performs other duties as assigned</li><li>Consistent, regular, and reliable attendance including being ready for work at the designated start time</li></ul> Qualifications <strong>Desired Skills and Qualifications:</strong><ul><li>This internship/part-time position is open to individuals who are majoring in Applied Science, Automotive, Heavy Equipment, or an equivelant servicing technology degree</li><li>Working knowledge of electric and liquid propane units</li><li>Excellent mechanical aptitude</li><li>Possess own tools</li><li>Computer programs - HYPASS, Hyster TKC training software and Hyster contact management system</li><li>Language Skills - Intermediate: Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of the organization.</li><li>Mathematical Skills - Basic: Ability to add and subtract two digit numbers and to multiply and divide with 10's and 100's. Ability to perform these operations using units of American money and weight measurement, volume, and distance.</li><li>Reasoning Ability - Intermediate: Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.</li></ul><strong>Physical Demands/Work Environment:</strong><ul><li>Physical/Sensory Functions: Regularly will stand, walk, use hands, reach with hands; Frequently will talk/hear; Occasionally will sit, climb or balance, stoop, kneel, crouch or crawl.</li><li>Vision: No special vision requirements.</li><li>Lift and/or Move Functions: Regularly will lift up to 10 pounds; Frequently will lift 11 to 25 pounds; Occasionally will lift from 26 to 100 plus pounds</li><li>Work Environment: Regularly will work near moving mechanical parts; Frequently will be exposed to fumes or airborne particles, outdoor weather conditions; Occasionally will work in wet or humid conditions (non-weather), extreme cold and heat (non-weather), risk of electrical shock, vibration</li></ul> About Alta: <p>Culture is Job #1. Alta Equipment Company prides itself in the 3 P's of business: <em>People, Process and Product. </em>By investing in the best people and creating a \"one team\" approach, Alta Equipment Company earns customers for life. </p><p>&nbsp;</p><p>If you have a passion for excellence and are ready to make a difference within our organization, we're ready for you. Whether it's selling the world's-best big iron, rolling up your sleeves and servicing our industry-leading construction and material handling product brands or being a difference maker behind the scenes, we can use your skillset. </p><p>&nbsp;</p><p>At Alta Equipment Company, we believe in mutual respect and are committed to diversity while inspiring our employees to reach their maximum potential. Voted a \"Top Work Place\" by the Detroit Free Press, our 900 employees in Michigan, Illinois and Northern Indiana are committed to excellence. It's the Alta way. </p><p>&nbsp;</p><p>So, let's start the conversation. Click the link to apply and begin the journey of a lifetime. </p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p> What We Look For: <p>At Alta Equipment Company, we are looking for candidates who are a cultural fit with our organization and understand that every task and job goes toward fostering customers for life. Along with that, a great attitude that embraces mutual respect and delivering a consistent high energy level that exudes a passion for excellence. Also, we are searching for a skill set that has a high aptitude for the position with a continual focus on investing in one's profession through additional training and learning</p> Other Opportunities at Alta Please visit our careers page at&nbsp;<strong><span class=\"long-word\">www.altaequipment.jobs</span>&nbsp;</strong>to view other openings that may be of interest to you! &nbsp; <p>We are an equal opportunity employer. Employment selection and related decisions are made without regard to gender, race, age, disability, religion, national origin, color, gender identity, sexual orientation, veteran status or any other protected class.</p> Connect with us to stay up to date on job listings.</div></div>"
    },
    {
        "position": "Clinical Laboratory Scientist- $1,500 contract completion bonus!",
        "company": "Spherion",
        "location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/spherion-73572a92/clinical-laboratory-scientist-1-500-contract-completion-bonus-38c37291?lvk=7Y-iPip7ilSy2aY29fQ0TQ.--M9wPsSfvB",
        "posted": "2021-08-27T18:32:01.073Z",
        "lastScraped": "2021-09-03T18:32:01.073Z",
        "description": "<div><p>Spherion, in partnership with Exact Sciences, is actively recruiting for multiple part-time Clinical Laboratory Scientists to join their collaborative and innovative team. This position performs laboratory analysis on clinical specimens using established laboratory procedures under the direction of the Laboratory Medical Director. As a Clinical Laboratory Scientist, you are responsible for recognizing and resolving problems using good laboratory practices.</p><p><strong>This temporary role is estimated to last 3-6 months based on business needs. Multiple shift options are available and will be discussed during the interview process!</strong></p><p><strong>$1,500 bonus given after 6 months or at the completion of the contract!</strong></p><p><strong>Responsibilities:</strong></p><ul><li>Perform moderate, and/or highly complex analytic processes without direct supervision. Interpret problems with specimens that meet the rejection criteria for unacceptable samples. Make the decision to reject a sample and request recollection to ensure the validity of results</li><li>Operate laboratory instruments and ensure the proper functioning of laboratory equipment</li><li>Complete and document required maintenance activities on equipment, recognize and elevate potential issues reporting service needs to leadership for resolution</li><li>Perform quality control procedures as specified and maintain quality control records and documentation necessary to meet the standards of accrediting agencies</li><li>Understand appropriate specimen collection, handling, and transport procedures</li><li>Prepare specimens for analysis and determine the acceptability of samples within guidelines</li><li>Assists in developing procedures for specimen collection, handling, and transport to maintain specimen integrity and viability</li><li>Validate the acceptability of test results by reviewing test parameters</li><li>Identify the technical, instrumental, and/or physiologic causes of unexpected test results</li><li>Monitor quality assurance and assist in data collection and preparation of QA indicators</li><li>Perform internal and external proficiency testing. Handle proficiency testing samples in the same manner as patient samples</li><li>Maintain a clean and orderly work area. Clean bench surfaces and equipment each shift or after contamination or spill</li><li>Meet work product output expectations maintaining all section turn-around times</li><li>Participate in continuing education and staff meetings. Prepare and presents continuing education programs for department personnel as requested</li><li>Apply step by step thinking, problem-solving, and critical thinking patterns</li><li>Contribute to design, research, review, and writing of laboratory manuals. Remain informed of procedure updates and changes</li><li>Comply with safety and hazard regulations as outlined in the Clinical Laboratory Safety Manual. Understand, maintain, and enforce safety guidelines</li><li>Observe principles of data security and patient confidentiality. Maintain ethical standards in the performance of testing and in interactions with patients, co-workers, and other health care professionals</li><li>Demonstrate adaptability by embracing changes in the laboratory with a positive attitude</li><li>Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork</li><li>Support and comply with the company’s Quality Management System policies and procedures</li></ul><p><strong>Skills and Qualifications:</strong></p><ul><li>Bachelor's degree in Biology, Chemistry, Biochemistry, Microbiology, Molecular Biology, Clinical Laboratory Sciences, or a similar laboratory intensive life sciences degree, which includes a minimum of 6 Chemistry credits, 6 Biology credits, and a combined total of 24 credits in Chemistry and Biology</li><li>6+ months of laboratory experience which may include laboratory coursework, internship(s), and/or research assistantship</li><li>Experience in molecular testing preferred</li><li>Regular and reliable attendance</li><li>Ability to work outside assigned schedule as needed</li><li>Ability to lift up to 40 pounds for approximately 25% of a typical working day</li><li>Ability to work seated for approximately 50% of a typical working day. Ability to work standing for approximately 50% of a typical working day</li><li>Ability to work in front of a computer screen and/or perform typing for approximately 75% of a typical working day</li><li>Ability and means to travel 5% between Madison Laboratory locations</li><li>Ability to comply with any applicable personal protective equipment requirements</li></ul></div>"
    },
    {
        "position": "R&D Software Engineering Intern (Virtual), DreamWorks, Fall 2021",
        "company": "CNBC",
        "location": {
            "city": "Glendale",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1227099cf8df30170bd62964dece3826?lvk=jZTzPOgcViAmnFeRR2IsnA.--M9pK4xT8g",
        "posted": "2021-08-31T18:32:03.144Z",
        "lastScraped": "2021-09-03T18:32:03.144Z",
        "description": "<div><div><p>Job Title: R&amp;D Software Engineering Intern (Virtual), DreamWorks, Fall 2021 <br>Business Segment: Filmed Entertainment Group <br>Responsibilities: </p><p>DreamWorks is excited to announce that we are currently accepting resumes for our Fall 2021 Software Engineering Internships within our Research &amp; Development and Creative Technologies teams. The engineering teams at DreamWorks develop state-of-the-art techniques, algorithms, and tools that are core to the production of our CG animated films. <br><br>Our engineering teams work in several disciplines across our pipeline and company. As a DreamWorks Software Engineering Intern, you may work in one of the following areas:</p><ul><li>Rendering and Shading</li><li>Physics and Simulation</li><li>Computer Animation and Graphics</li><li>Big Data and Analytics</li><li>Large Scale Application Development</li><li>Extensions to Third Party CG Applications</li><li>Cloud-Native Application Development</li><li>Configuration Management</li><li>Technical Writing / Web Development</li><li>DCC Tools and Workflow</li><li>FX/CFX</li><li>Machine Learning</li><li>Production Engineering</li></ul>During the course of a 10-week internship, interns will design, implement, and support aspects of the company's proprietary software tools. They will work closely with our world-class artists and top engineers in this field.&nbsp; Some of our engineers started themselves as interns here at Dreamworks and are now leading efforts that are recognized industry-wide. <br><br><b>Interns will learn to:</b><ul><li>Create unique software solutions that unleash the highly ambitious and creative visions of our artists</li><li>Innovate to provide our world-class artists with the best tools and deliver a competitive advantage to the studio</li><li>Work hand-in-hand with the most talented artists anywhere and have an immediate, positive impact on their work</li><li>Work in a collaborative environment</li><li>Develop problem-solving skills</li></ul><br>Job Number: 63347BR <br>Posting Category: Internships <br>Country: United States <br>Sub-Business: DreamWorks Animation TV Production <br>About Us: From the award-winning storytellers, artist and innovators at DreamWorks Animation and DreamWorks Animation Television come the beloved characters and stories that come alive on the big and small screens. From films like Shrek, How to Train Your Dragon and Trolls to original TV series including Trollhunters, Voltron and Home: Adventures with Tip &amp; Oh, DreamWorks Animation continues to bring home the laughter, fun and courage to dream.<br><br>Visit <span class=\"long-word\">www.dreamworksanimation.com</span> to see our latest animated film and television productions.<br><br> DreamWorks is a division of NBCUniversal. At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.<br><br>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal's commitment and how we are making an impact. <br>State/Province: California <br>Career Level: Co-op/Intern <br><span class=\"long-word\">Qualifications/Requirements:</span> What We Are Looking For:<br>Current student/recent grad majoring in Computer Science, Computer Graphics, Physics, and Mathematics or related field(s)<br>Strong interest in animation; passion for how technology and art work together<br>Dedicated, resourceful, an excellent communicator, possesses critical thinking skills, and is a team player.<br>Ability to commit 10 weeks to the internship and work remotely<br>Ability to work part time (16-24 hours/week) from Sept - Dec 2021. <br>Must be 18 years of age or older<br>Must have strong grades and excellent written and oral communication skills.<br>Must have own equipment (computer, webcam, headphones, etc.) and stable Internet connection<br>Must be authorized to work in the United States without visa sponsorship<br><br>Submission Requirements:<br>Your resume and cover letter with an indication of which area you are interested in.<br>A link to any websites (Github, Stack Overflow, etc) or blog indicating technical skills such as math and programming. <br>Relevant coursework listed at the top of your res</div></div>"
    },
    {
        "position": "Year Round Under/Graduate Internship: University Partnerships Program",
        "company": "NREL",
        "location": {
            "city": "Golden",
            "state": "CO",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f005140140c61856ac740f4e4f851508?lvk=G67CywA0qCA_28TrBX6Z3g.--MA3Nt4LJR",
        "posted": "2021-09-02T18:32:05.137Z",
        "lastScraped": "2021-09-03T18:32:05.137Z",
        "description": "<div><div><p><b>Posting Title</b></p>Year Round Under/Graduate Internship: University Partnerships Program<p>.</p><p><b>Location</b></p>CO - Golden<p>.</p><p><b>Position Type</b></p>Intern (Fixed Term)<p>.</p><p><b>Hours Per Week</b></p>30<p>.</p><b>Working at NREL</b>The National Renewable Energy Laboratory (NREL), located at the foothills of the Rocky Mountains in Golden, Colorado is the nation's primary laboratory for research and development of renewable energy and energy efficiency technologies.<p></p><p>From day one at NREL, you'll connect with coworkers driven by the same mission to save the planet. By joining an organization that values a supportive, inclusive, and flexible work environment, you'll have the opportunity to engage through our eight employee resource groups, numerous employee-driven clubs, and learning and professional development classes.</p><p></p><p>NREL supports inclusive, diverse, and unbiased hiring practices that promote creativity and innovation. By collaborating with organizations that focus on diverse talent pools, reaching out to underrepresented demographics, and providing an inclusive application and interview process, our Talent Acquisition team aims to hear all voices equally. We strive to attract a highly diverse workforce and create a culture where every employee feels welcomed and respected and they can be their authentic selves.</p><p></p><b>Job Description</b><p><b>University Partnerships Program</b></p><p>NREL's University Partnerships Program seeks to build and strengthen collaboration with universities around the world on cutting-edge research. By partnering with leading universities and research institutions, we leverage our scientific knowledge and state-of-the-art facilities to solve complex, multidisciplinary challenges in energy efficiency, sustainable transportation, renewable power technologies, and grid integration. Working hand in hand with universities across all NREL technical disciplines, we aim to:</p><ul><li><b>Enhance research collaboration</b>between NREL and universities through joint appointments, funding proposals, publications, and research facilities</li><li><b>Foster the exchange of ideas</b>to expand research capabilities that lead to scientific breakthroughs and global recognition</li><li><b>Attract rising stars</b>in scientific and engineering disciplines who can gain experience and training at NREL's world-class research facilities</li><li><b>Create pathways</b>for graduate and undergraduate students-as well as postdoctoral researchers-to work jointly with NREL scientists and university professors to pursue innovative research leading to joint publications, funding, and career advancement</li><li><b>Explore new ways to engage</b>with a range of educational institutions to broaden the reach of NREL's engagement</li></ul><p></p><p><b>Position Description</b></p><p>The candidate will support a variety of tasks related to the strategic partnerships NREL has with universities and other stakeholders, with a particular focus on underrepresented groups. The successful candidate will have strong research, writing, interpersonal, and communication skills.</p><p></p><p>The candidate will be a self-starter that brings creativity and enthusiasm to support the strengthening of renewable energy and energy efficiency programs in a way that promotes equity and inclusion through desk research, critical thinking, opportunity analyses, and interviews with key internal/external stakeholders.</p><p></p><p>Key projects include:</p><ul><li>Support the establishment and launch in 2022 of NREL's pilot undergraduate internship program with Historically Black Colleges and Universities (HBCUs) and Hispanic Serving Institutions (HSIs), including working closely and thoughtfully on the recruitment strategy; mentor application process; mentor, faculty, and student pairing process; funding pipeline and logistics; program success measurement tactics; and several other various program components</li><li>Support the design and roll out of the new Strategic Partner University Program (SPUP)-a research collaboration and student engagement program with top tier engineering universities that will be a key pillar of the university partnerships program</li><li>Track, organize, and systematize internal NREL data on the full array of university partnerships, contacts, and engagements</li><li>Support outreach, engagement, and continued relationship building with cohort of HBCUs, HSIs, tribal colleges, and other institutions identified as having academic programs aligned with NREL research</li><li>Engage with NREL colleagues, bringing awareness to university partnership programs and building support and involvement</li><li>Research and prepare a summary report on graduate and undergraduate program partnerships between universities and national labs to better understand the benefits and possible challenges with these programs</li><li>Support research examining barriers and opportunities for STEM undergraduate education in clean energy topics and pathways for graduate school</li></ul><p>.</p><b>Basic Qualifications</b>Must be enrolled as a full-time student in a Bachelor's, Master's or PhD degree program, or graduated in the past 12 months from an accredited institution. Internship period cannot exceed 12 months past graduation. Minimum of a 3.0 cumulative grade point average. <br><br>Please Note: <br>You will need to upload official or unofficial school transcripts as part of the application process.<br>If selected for position, a letter of recommendation will be required as part of the hiring process.<p>.</p><b>Additional Required Qualifications</b><p>Master's degree or upper-level Bachelor's degree student in <span class=\"long-word\">environmental/energy/climate</span> policy, law, economics, or behavioural sciences, preferably with a background in the clean energy transition, climate justice, economic development, engineering, or other relevant field.</p><p></p><p>Expertise and confidence in research, critical thinking, and capturing key findings to develop clear and concise reports, briefing notes, and thought pieces. Experience with Salesforce or building a similar database is a plus, but not required.</p><p></p><p>Knowledge and experience in one or more:</p><ul><li>Clean energy and climate change</li><li>Energy and societal issues</li><li>STEM education and career pathways</li><li>Sustainable economic and social development</li></ul><p></p><p></p><p><b>Preferred Qualifications</b></p><p>.</p><b>Annual Salary Range (based on full-time 40 hours per week)</b>Annual Salary Range: $39,600 - $63,500<p></p><p></p>Offers will typically be made in the bottom half of the listed range. NREL takes into consideration a candidate's education, training, and experience, as well as the position's work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the Colorado Equal Pay for Equal Work Act, a potential new employee's salary history will not be used in compensation decisions.<p></p><p></p><b>Benefits Summary</b>Benefits include medical, dental, and vision insurance; 403(b) Employee Savings Plan with employer match*; and sick leave (where required by law). NREL employees may be eligible for, but are not guaranteed, performance-, merit-, and achievement- based awards that include a monetary component. Some positions may be eligible for relocation expense reimbursement. Internships projected to be less than 20 hours per week are not eligible for medical, dental, or vision benefits.<p></p><p><b>* </b>Based on eligibility rules</p><p></p><p><b>Submission Guidelines</b></p><p>Please note that in order to be considered an applicant for any position at NREL you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application.</p><p>.</p><p><b>EEO Policy</b></p><p>NREL is an Equal <span class=\"long-word\">Opportunity/Affirmative</span> Action Employer. All qualified applicants will receive consideration for employment without regard basis of age (40 and over), color, disability, gender identity, genetic information, marital status, military or veteran status, national origin/ancestry, race, religion, creed, sex (including pregnancy, childbirth, breastfeeding), sexual orientation, and any other applicable status protected by federal, state, or local laws.</p><p></p><p><b>EEO is the Law</b> | <b>Pay Transparency Nondiscrimination</b> | <b>Reasonable Accommodations </b></p><p></p><b>E-Verify www.dhs.gov/E-Verify</b>|For information about right to work, click here for English or here for Spanish.<p>E-Verify is a registered trademark of the U.S. Department of Homeland Security. This business uses E-Verify in its hiring practices to achieve a lawful workforce.</p></div></div>"
    },
    {
        "position": "Student Opportunities - IT Internship - Summer 2022 (Remote Available)",
        "company": "Cincinnati Financial Corporation",
        "location": {
            "city": "Fairfield",
            "state": "OH",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/8cc9f63665746981446bfdf9a1362a66?lvk=S45zXekYfb2rwpo9PBYC5Q.--M9uGW3H3J",
        "posted": "2021-09-01T18:32:07.114Z",
        "lastScraped": "2021-09-03T18:32:07.114Z",
        "description": "<div><div><p>At The Cincinnati Insurance Companies, we put people first and apply the Golden Rule to our daily operations. To put this into action, we're looking for extraordinary people to join our talented team. Our service-oriented, ethical, knowledgeable, caring associates are the heart of our vision to be the best company serving independent agents. We help protect families and businesses as they work to prevent or recover from a loss. Share your talents to help us reach for continued success as we bring value to the communities we serve and demonstrate that <i>Actions Speak Louder in Person</i>. </p><p>&nbsp;</p><p>If you're ready to build productive relationships, collaborate within a diverse team, embrace challenges and develop your skills, then Cincinnati may be the place for you. We offer career opportunities where you can contribute and grow. </p><p>&nbsp;</p><p>The Cincinnati Insurance Companies' Information Technology department is currently looking for students who seek to gain a meaningful work experience with us for Summer&nbsp;2022. IT Interns will assist with maintaining and supporting applications for the corporate portal as part of our infrastructure, security, desktop support, auditing, and business analyst teams.<br><br> Some of the roles may include IT Helpdesk/ PC Support, IT Audit, Analyst, etc.<br><br><b>Starting Rate of Pay:</b> $16.00/hr<br><br> Learn more about our company and develop your professional skills by:</p><p><br> participating in an introductory insurance class<br> learning about various business departments and IT service areas<br> signing up for optional learning development tracks<br> interacting with associates and management<br> participating in group and individual research projects as assigned</p> *This is a full time internship/co-op. If you will be continuing the internship/co-op&nbsp;into the semester following your full-time internship/co-op, there will&nbsp;be a&nbsp;part time option available depending on the role.&nbsp; <p><strong>**Internship/Co-op work location: Remote available for non-location critical roles. Location critical roles must have a presence on-site.&nbsp;</strong></p><p>Be equipped with:&nbsp;<br> Knowledge of scripting languages such as PowerShell, VBScript, and object-oriented programming concepts and languages<br> Knowledge of databases, simple data analysis, and reporting<br> Knowledge of computer hardware, imaging, software installation including applications such as Microsoft Office 365 Suite<br> Understanding of computer networks (TCP/IP protocol, load balancing, monitoring, etc.), Linux/Windows server platform, virtualization, cloud computing concepts<br> Prior experience in customer-facing service work through volunteering, employment, and/or extracurricular activities<br> Ability to research, and understand and author technical documentation, and to utilize available resources to resolve technical problems<br> Good communication skills with the ability to effectively explain technical concepts to non-technical audience<br> Ability to interact effectively with management and colleagues to prioritize and organize work<br> Willingness to continually learn new technologies, skills, and improved processes<br> Awareness of current and emerging technology trends<br> Reliable and service-oriented mindset</p><p>&nbsp;</p><p>You are:<br> Full-time undergraduate student currently enrolled in an accredited U.S. college or university<br> Returning to school full-time in the semester after internship<br> Able to furnish collegiate transcripts with initial submission of candidate profile<br> In good academic standing (cumulative GPA: 3.0 or higher preferred)<br> Able to communicate effectively at all levels<br> Service-minded, team-oriented, driven, and passionate about information technology<br> Proficient in Microsoft Office software and tools</p><p><b>Embrace a diverse team</b></p><p>As a relationship-based organization, we welcome and value a diverse workforce. We provide equal employment opportunity to all qualified persons without regard to race; creed; color; sex, including sexual orientation, gender identity and transgender status; religion; national origin; age; disability; military service; veteran status; pregnancy; AIDS/HIV or genetic information; or any other basis prohibited by law. Learn More.</p></div></div>"
    },
    {
        "position": "IT Audit Intern",
        "company": "State of Washington",
        "location": {
            "city": "Olympia",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/ca9d30dac9f07312ef92da57e325a8ff?lvk=s92BjwogLwN-gqU2UEwckA.--M9razKnmV",
        "posted": "2021-08-30T18:32:09.130Z",
        "lastScraped": "2021-09-03T18:32:09.130Z",
        "description": "<div><div> Description <p>We offer a chance to make a difference in how government operates. We value innovators and creative thinking. We continue to look for new ideas to ensure our audits are relevant and interesting to the citizens who we serve. We take pride in the services we perform for the government and citizens of Washington State. To learn more about our agency and the work that we perform visit our website at www.sao.wa.gov.<br><br>We offer seasonal and year-round paid internships with our audit teams across the state. The start and length of internships is flexible.<br><br>This recruitment will be used to source an IT Audit Intern candidate. Qualified candidates must be currently enrolled in an accredited college or university.<br><br></p> Duties <p>IT Audit Interns work with our Data Analysis staff and perform Computer Assisted Audit Tests (CAATs), analyze data, develop data analysis reports, communicate with entity staff, and provide support for more complex IT audit related data procedures. Interns may be involved in several small assignments or one large assignment over the course of the internship. IT Audit Interns will be initially given routine data analysis assignments and work under direct supervision of a higher level IT Auditor.&nbsp;</p> Qualifications <p>Candidates:</p><ul><li>Currently enrolled in an accredited college or university</li><li>Completed their sophomore year</li><li>Completed some accounting OR finance course work</li><li>Completed some information systems OR computer science work</li><li>Have strong computer skills</li><li>Have strong written and verbal communication skills</li></ul>Preferred candidates will: <ul><li>Have intermediate knowledge of Microsoft Excel</li><li>Have basic knowledge of Microsoft Access</li><li>Have basic knowledge of SQL</li></ul><br><p></p> Supplemental Information <p>As outlined in Governor Inslee's&nbsp;Proclamation 21-14 (Download PDF reader), State Auditor's Office employees must be fully vaccinated no later than October 18, 2021. &nbsp;Your vaccine status will be verified on the first day of employment. Please contact our HR Office at <span class=\"long-word\">applicationsunit@sao.wa.gov</span> &nbsp;if you need information on medical or religious accommodation.<br><br>Questions may be directed to the applications unit by emailing: <span class=\"long-word\">applicationsunit@sao.wa.gov.</span><br><br>The Office of the Washington State Auditor is an equal opportunity employer. Persons with a disability who need assistance in the application or testing process, or who need this announcement in an alternative manner may call (564) 999-0947 or via the telecommunications relay service by dialing 7-1-1.<br><br></p></div></div>"
    },
    {
        "position": "Railway Engineering Internship 2022",
        "company": "Hanson Professional Services",
        "location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e046b264b1705f9b107f0a3f34be784f?lvk=fcoY4UyhBG6LrGlbM73Qxg.--M9kFbpz0Z",
        "posted": "2021-08-28T18:32:11.220Z",
        "lastScraped": "2021-09-03T18:32:11.220Z",
        "description": "<div><div><p>Hanson Professional Services Inc. is a dynamic, employee-owned engineering consulting firm of more than 400 employees providing a full range of multi-disciplined engineering, scientific, and allied services throughout the USA.</p><p></p><p><b><i>We are proud to be a great place to work and a top company for internships!</i></b></p><ul><li>#18 in the multidiscipline category in the Zweig Group Best Firms to Work For.</li><li>#2 Best Places to Work in Illinois</li><li>#6 Best Places to Work in Florida.</li><li>#3 for Best Internships for Engineering</li><li>#8 for the Best Tech and Engineering Internships</li><li>#21 for Best Internship for compensation &amp; benefits</li><li>Check out our Vault rankings HERE</li></ul><p></p><p>Hanson is seeking candidates for our <b>Railway Engineering 2022 Internship</b> programs. We have potential opportunities in the following locations: Kansas City, MO; Seattle, WA.</p><p></p><p>Our <b>Railway Engineering</b> discipline is made up of Civil Engineers who plan, design, and prepare construction documents for a variety of rail clients. Aspects of design include rail alignments and geometrics, grading plans, drainage and utility plans, pavement markings, construction details, erosion control and construction staging and phasing. Work is typically done in MicroStation OpenRoads. AutoCAD with Civil3D is used for select projects. The Railway Engineering discipline also supports construction management efforts in the field. Potential opportunities include monitoring contractor work activities, preparing reports and helping review contractor invoices.</p><p></p><p><b>Here are some examples of exciting Railway Engineering projects our interns have worked on:</b></p><ul><li><i>Midwest Rail Yard. </i>Helping prepare plan sheets in MicroStation, calculating quantities of various pay items to be used by contractor to bid the project, attending project meetings, and learning to write meeting minutes, and review work by others.</li><li><i>Pacific Northwest Alignment. </i>Reviewing 100 miles of track to determine which side of the track is more feasible for new infrastructure to be placed. Collecting information in excel for review, analysis, and presentation to client.</li><li><i>BNSF Sandpoint, ID. </i>Helping prepare typical details for railroad fiber optic conduit running along the tracks and across a new railroad bridge.</li></ul><p></p><p><b><i>Click </i></b><b><i>HERE</i></b><b><i> to see more examples of Hanson's Transportation projects. </i></b></p><p></p><p>General Assignments: Interns will perform routine <b>railway engineering</b> tasks using standard procedures under supervision of Registered Professional Engineers and may assist Hanson engineers, designers and technicians in disciplines related to their field of study.</p><p></p><p>Interns will typically support one or more experienced Professional Engineers in performance of assignments, spend time shadowing actual operations, and have unique assignments that support larger projects as well as experience the day-to-day workings of <b>railway engineering</b>. Interns may perform and/or participate in additional activities/events which help them build a strong network within the Hanson community and with fellow interns. Internships may require travel to clients, or other Hanson locations.</p><p></p><p></p><p><b>Key Responsibilities: Railway Engineering interns will be expected to perform the following key responsibilities with assistance from a Hanson Professional Engineer:</b></p><p></p><ul><li>Preparing plans, designs, specifications, and cost estimates</li><li>Gathering and/or providing data for the preparation of engineering or environmental reports and studies</li><li>Performing and/or reviewing calculations or reports such as those related to surveying, transportation engineering, soil capacities and quantities</li><li>Utilize engineering software packages such as MicroStation</li><li>Conducting field investigations and/or survey assistance to gather information</li><li>Documenting and/or observing construction operations</li></ul><p>Performing related duties such as writing memoranda, letters, or general reports; collecting and correlating engineering data; attending meetings; and maintaining records.</p><p></p><p><b>Qualifications: </b></p><p></p><p>Intern must be actively enrolled in a Civil Engineering or relevant field of study. The ideal candidate will have successfully completed their sophomore year by the time of their internship and be actively enrolled in an accredited 4-year college or university.</p><p></p><p><b>Key requirements are listed but not limited to the following:</b></p><ul><li>Strong written and oral communication skills</li><li>Strong analytical skills</li><li>Knowledge of Microsoft Office</li><li>Valid driver's license</li></ul><p></p><p></p><p></p><p></p><p>As <span class=\"long-word\">employers/governmental</span> contractors, we comply with government regulations, including affirmative action responsibilities where they apply. To assist us in meeting our affirmative action goals, employees are encouraged to refer minorities, women, individuals with disabilities and veterans.</p><p></p><p></p><p>AN EQUAL OPPORTUNITY - AFFIRMATIVE ACTION EMPLOYER</p><p>EEO / MINORITY / FEMALE / INDIVIDUALS WITH DISABILITIES / VETERANS</p></div></div>"
    },
    {
        "position": "Internship - Software Development",
        "company": "GuideOne Insurance",
        "location": {
            "city": "West Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/guideone-insurance-31525ad1/internship-software-development-4adbc7cc?lvk=8zk6CTb8ciDEEZDu2W76Hg.--MA5NVgysN",
        "posted": "2021-08-27T18:32:17.287Z",
        "lastScraped": "2021-09-03T18:32:17.287Z",
        "description": "<div><p>GuideOne serves to make the world a better place by supporting organizations that serve the greater good: churches, educational institutions, health care and nonprofit organizations. Our IT department is vital to this mission and our ongoing success. IT supports the company with the most current technology and expertise, making it possible for us to expeditiously and reliably connect with our members, prospects, employees and other stakeholders. We are only as good as our infrastructure, and IT is dedicated to maintaining the highest performance levels. This support powers our goal to make positive change possible by providing products and services to our key markets. </p><p>We have an excellent opportunity for a highly motivated <strong>Software Development Intern.</strong></p><p>If you are looking to kick off your career with hands on experience in Information Technology with the support of a collaborative Agile environment, this may be the opportunity for you! This internship will provide you with access to our engineer and development teams including hands on experience with software development. This is a front row seat to insurance technology that you can't afford to miss! </p><p>Our ideal candidate will be a top performer in their class, with some prior Java experience, and be an independent thinker actively pursuing a degree in Computer Engineering, Software Engineering, or a related field. This will be part time during the school year (up to 20 hours) and full time (39 hours) during the Summer of 2022.</p><p><strong>Will</strong> s<strong>upport the software development team by:</strong></p><ul><li> Application development using object oriented programming.</li><li> Assisting with software architectural design.</li><li> Troubleshooting code defects.</li><li> Applying modern coding practices to improve quality and efficiency.</li></ul><p><strong>What we are looking for:</strong></p><ul><li> Exposure to one or more of the following technologies and/or development languages:</li><li> .NET (C#)</li><li> Java</li><li> JavaScript</li><li> HTML &amp; CSS</li><li> WordPress/PHP</li><li>Angular</li><li>AWS</li></ul><p><strong>Ideal candidates have:</strong></p><ul><li> 3.00+ cumulative GPA.</li><li>Junior/Senior standing.</li><li> Prior experience in a related field.</li><li> Willingness to work part time during the school year and full time during the summer.</li></ul><p><strong>Pay: </strong> $18 to $20/hour (Commensurate with experience and college level)</p><p><strong>About GuideOne:</strong></p><p>GuideOne Insurance was founded upon two key philosophies that endure to this day: a commitment to social responsibility, and a dedication to serving customers in select niche markets.</p><p>At GuideOne Insurance, we believe that our people are our greatest asset. We encourage our employees to work towards common goals and succeed together. GuideOne is a recognized expert in providing Commercial Lines insurance and financial services to:</p><ul><li>Religious Organizations</li><li>Small Businesses</li><li> Schools and Higher Education Institutions</li><li> Non-Profit Organizations</li><li>Programs</li><li>Specialty Business</li></ul><p> Thank you for considering GuideOne for your Internship, we look forward to hearing from you!</p><p></p><p>This Company Participates in E-Verify<br><span class=\"long-word\">https://www.guideone.com/AboutUs/PDFs/everify.pdf</span><br>Background Check Required<br>EOE</p><p><br></p></div>"
    },
    {
        "position": "Signal & Data Processing Engineer Intern - Summer 2022",
        "company": "CACI",
        "location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f89ffbc4521f18956dab2a3fb7957a95?lvk=QphL4gV4OTl-ZUW49HdAKQ.--M9WHPSbwR",
        "posted": "2021-08-26T18:32:20.073Z",
        "lastScraped": "2021-09-03T18:32:20.073Z",
        "description": "<div><div><p>Signal &amp; Data Processing Engineer Intern - Summer 2022</p><p></p><p></p>Job Category: Intern/Co-op<p></p><p></p>Time Type: Part time<p></p><p></p>Minimum Clearance Required to Start: None<p></p><p></p>Employee Type: Part-Time On-Call<p></p><p></p>Percentage of Travel Required: Up to 10%<p></p><p></p>Type of Travel: Continental US<p></p><p></p><p><br><b>What You'll Get to Do:</b></p><p></p><p>Are you a problem solver, ready for a challenge this summer? CACI is seeking 2022 Summer Interns for Electrical Engineering Internships! CACI is a recognized industry leader providing Mission-Ready Geolocation and Intelligence, Surveillance, and Reconnaissance (ISR) Systems and Services to Government and Industry. Through our Intern program's on the job training and mentorship, you will gain experience with cutting edge technology alongside engineers and computer scientists.</p><p></p><p>Our Collection Systems Division designs and manufactures RF sensors for precision geolocation. This position entails the researching of critical sensor components such as software defined radios (SDRs) and Global Positioning System (GPS) receivers, as well as the design and development of signal processing algorithms for digital communications signals.</p><p><br><b>More About the Role:</b><br></p><p>This position is for individuals interested in a broad area of software development, digital signal processing, Radio Frequency engineering, and statistical data analysis. The ideal candidate should have strong academic credentials, desire to work in a team environment, while being able to make progress independently. The single most important attribute is an inquisitive nature and a strong desire to learn real world applications to compliment your academic experience. Familiarity with hardware (e.g., spectrum analyzer) or software tools (e.g., MATLAB, C++, Java, Xilinx Vivado) should be at a level that is appropriate for your academic level. The internship will be ~11-12 weeks in the summer of 2022.</p><p><br>Our office in Austin, Texas with about 200 employees was recently named by Austin American Statesman as one of the Top Places to Work in Austin. We are an industry leader in interoperable, mission-ready Time and Frequency Difference of Arrival (T/FDOA) Precision Geolocation systems and produce diverse portfolio of Intelligence, Surveillance and Reconnaissance (ISR) products spanning small lightweight sensors, rack-mounted deployments, cloud-based solutions which are deployed across the world. <br><br><b>You'll Bring These Qualifications:</b></p><ul><li>Current status as a Sophomore-Senior pursuing a Bachelor's or Master's degree in Electrical Engineering/Signal Processing, Physics, Math, Computer Science, or a related degree</li><li>Minimum of 3.0 GPA</li><li>Must be a US Citizen, as required by US Government Contracts</li></ul><p><br><b>These Qualifications Would be Nice to Have:</b></p><ul><li>Signal processing experience</li><li>Use of MATLAB or similar computational modeling tools</li><li>Creating or implementing DSP algorithms</li><li>Developing software in C/C++ or Java</li><li>Shell or scripting experience (Python, Perl, Ruby, bash, ksh, etc)</li><li>Experience in the Linux/Unix environment</li><li>Experience with RF hardware, including software defined radios (SDR) and analog to digital samplers (ADC)</li><li>Previous internship experience</li></ul><p><br><b>What We Can Offer You:</b></p><ul><li>We've been named a Best Place to Work by the Washington Post.</li><li>Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.</li><li>We offer competitive benefits and learning and development opportunities.</li><li>We are mission-oriented and ever vigilant in aligning our solutions with the nation's highest priorities.</li><li>For over 55 years, the principles of CACI's unique, character-based culture have been the driving force behind our success.</li></ul><p></p><p>inrn2</p><p></p><p></p>Company Overview: At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is an Equal Opportunity Employer - <span class=\"long-word\">Females/Minorities/Protected</span> <span class=\"long-word\">Veterans/Individuals</span> with Disabilities.</div></div>"
    },
    {
        "position": "Intern (Strategic Planning & Resources)",
        "company": "Inland Empire Utilities Agency",
        "location": {
            "city": "Chino",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/1a8f1b1c62273dbca9afb2948a522bd5?lvk=wuPl_5CGWC2R40zL1YCWvg.--M9wT3jBUN",
        "posted": "2021-08-30T18:32:21.702Z",
        "lastScraped": "2021-09-03T18:32:21.702Z",
        "description": "<div><div> THE POSITION: <p></p><div><div><div><br><br><strong>There&nbsp;are two (2)&nbsp;internship opportunities in the Planning and Environmental Resources Department.</strong><br><br><strong>This recruitment is being conducted to fill two&nbsp;(2) vacancies and will establish an eligibility list which may be used to fill future vacancies as they occur during the active status of the eligibility list.<br><br>Open Until Filled, Apply Immediately</strong><br><br><strong>Internships are limited to 25 hours week and 960 hours per fiscal year</strong><br><strong>(July 1st to June 30th)</strong><br>&nbsp; <br><strong>Note: &nbsp;Internships are not meant to be short term, for example, limited to summer, winter and/or spring breaks. &nbsp;Individuals interested in short term internships will not be considered.</strong><br>&nbsp; <br><em>Work schedule is estimated to be approximately&nbsp;20 to 25 hours a week;</em><br><em>Office Hours are Monday through Thursday from 7 a.m. to 5:30 p.m.</em><br>&nbsp; </div><div><strong>FLSA: Non-Exempt</strong></div></div></div><div> &nbsp; </div><div><div> The successful candidate will be a responsible, analytical and detailed oriented individual with excellent communication (written/oral) skills. &nbsp;Efficient time management skills with the ability to work on multiple projects simultaneously are required. &nbsp;Additionally, be willing to learn, and be flexible and assist with ad hoc projects as required in a fast paced and changing environment. &nbsp; <em>Advanced computer skills in Word, Excel,&nbsp;PowerPoint,&nbsp;and Publisher are preferred</em>. &nbsp;Interns assist with entering, interpreting and analyzing data as well as creating charts/graphics. &nbsp;The incumbent will be exposed to one or more field and technical aspects of planning, water resources, water use efficiency, energy management, and/or environmental compliance. <br><br>Interns provide assistance on &nbsp;a variety of programs and activities that include supporting internal and external clients, preparing PowerPoint presentations, developing program materials, compiling reports, entering, interpreting and analyzing data, creating charts/graphics, and providing customer service &nbsp;among other tasks. &nbsp;The incumbent will be exposed to one or more field and technical aspects of planning, water resources and water use efficiency. <br><br>Intern staff work flexible hours as established by his/her respective supervisor. &nbsp;While the Agency is flexible and will strive to work around an intern's schedule, an intern's work hours will vary and be mutually agreeable between the intern and his/her supervisor. </div></div><br><br><p></p> EXAMPLES OF ESSENTIAL FUNCTIONS: <p></p><div><strong>May include, but are not limited to the following:</strong><br>Performs the full array of duties assigned including professional <span class=\"long-word\">administrative/technical</span> work on special projects. <br>&nbsp; <br>Prepare reports and recommendations relative to assigned areas of responsibility. <br>&nbsp; <br>Compile data or materials and create spreadsheets, prepare reports, manuals, and publications. <br>&nbsp; <br>Participate in pulling documents, and filing information. <br>&nbsp; </div><div> Assists in the coordination and implementation of public awareness, information, community and education outreach programs and internal communication projects related to water resources; may attend meetings. </div><div> &nbsp; </div><div> May assist in analyzing problems related to planning, water resources issues and/or environmental compliance. </div><div> &nbsp; </div><div> May assist in responding to Agency staff and outside agencies requests for information; provides assistance and support to member agencies and others in the areas of water supply, water conservation, and water management issues. </div><div> &nbsp; </div><div> May assist in service area field inspections and/or staff internal/external agency coordinated special events. </div><div> &nbsp; </div><div> Updates written manuals, SOPs, and instructions. </div><div> &nbsp; </div><div> Travel to offsite locations&nbsp;will be required. </div><div> &nbsp; </div><div> Perform other related duties as required. </div><br><br><p></p> QUALIFICATION GUIDELINES: <p></p><div><div><strong>EXPERIENCE AND EDUCATION:</strong></div></div><div> Graduation from high school or G.E.D. equivalent. <br><br>Graduation or current enrollment in undergraduate or graduate studies in an accredited college or university with major course work in business, communications, water resources, environmental science, planning,&nbsp;civil or utility engineering, planning or a closely related field. <br><br><span class=\"long-word\">Knowledge/experience</span> in GIS is highly desirable. </div><div><br><strong>LICENSES AND CERTIFICATES:</strong></div><div><div> A valid class \"C\" California driver's license. &nbsp; <br>&nbsp; </div><div><strong>KNOWLEDGE OF:&nbsp;</strong><br>Principles of data collection, and research techniques and methods; methods and techniques for basic report preparation and writing; modern office equipment including a computer and applicable software; proper English, spelling and grammar. </div><br><div> General principles and practices of water resource management. General practices of sound business communications. Safety policies and safe work practices applicable to the work. </div><div><br><strong>ABILITY TO:&nbsp;</strong><br>Operate office equipment including a computer and applicable software; communicate effectively, both orally and in writing; understand and follow verbal and written instructions; analyze data, situations and research materials; formulate options and make recommendations; establish and maintain effective working relationships. </div><br><div> Prepare clear and accurate records, reports, correspondence and other written materials. Collect, analyze, and integrate relevant data from various sources. May assist in conducting research studies, prepare studies/reports of current water resource developments and trends, analyze issues and problems. Operate a computer and standard business software and advanced analytical and statistical software. Exercise good judgment and initiative within established guidelines. </div></div><br><br><p></p> SELECTION PROCESS: <p></p><div><div> All employment applications will be reviewed for accuracy, completion, relevant experience, education, training and other job related qualifications. Applicants with the strongest background relating to the responsibilities of this position will be invited to participate in the testing process which may include one or more of the following: written test, oral interview, <span class=\"long-word\">performance/practical</span> and/or agility examination. The successful candidate will be required to pass a <span class=\"long-word\">background/reference</span> check and pre-employment physical examination including a drug screen (for safety sensitive position) at no cost to the candidate. Please visit our website at www.ieua.org and select the Human Resources Department for additional information regarding the Agency, the hiring process and benefit information. <br><br>THE PROVISIONS OF THIS ANNOUNCEMENT DO NOT CONSTITUTE A CONTRACT, EXPRESSED OR IMPLIED, AND ANY PROVISION CONTAINED IN THIS BULLETIN MAY BE MODIFIED OR REVOKED WITHOUT NOTICE. <br><br>&nbsp;\"The Agency's success is obtained by creating a positive and diverse work environment which recognizes individual differences and experiences\". </div></div><p></p></div></div>"
    },
    {
        "position": "Quantum Architecture Intern",
        "company": "Intel",
        "location": {
            "city": "Hillsboro",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/995ad5ffdb0e6d62bba87ed019eccde0?lvk=n7Tfy2KZ2NbIral2jNcxNg.--M9pJ8Fd9-",
        "posted": "2021-08-30T18:32:23.146Z",
        "lastScraped": "2021-09-03T18:32:23.146Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>Quantum computing has the potential to transform the industry by achieving large computational speed-ups over classical computers. Advances in quantum technologies have propelled quantum computing from a theoretical physics field to experimental physics and engineering.<br><br>Come join us as part of a small Intel Labs team exploring quantum computer architecture. You will work on co-designing quantum machines of tomorrow, exploring the performance of technology alternatives while collaborating with algorithm and application researchers to explore hardware/software trade-offs.</p><p></p><p></p><b>Qualifications:</b><p>You must possess the below minimum qualifications to be initially considered for this position. Experience would be obtained through a combination of prior education level classes, and current level school classes, projects, research, and relevant previous job and/or internship experience.</p><p></p><p><b>Minimum Requirements</b></p><ul><li><p>The candidate must be pursuing a PhD degree in Computer Science or Computer Engineering</p></li><li><p>6+ months research experience in Computer Architecture</p></li><li><p>6+ months experience coding in C/C++</p></li><li><p>6+ months experience with quantum computing research</p></li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, Oregon, Hillsboro<p></p><p></p>Additional Locations:US, Pennsylvania, Philadelphia<p></p><p></p><p></p><p></p>Business group:Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A</div></div>"
    },
    {
        "position": "Web Development Intern",
        "company": "Schweitzer Engineering Laboratories",
        "location": {
            "city": "Pullman",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/fe93a4082aa8aa33de9bba0b8c0d31e6?lvk=YRZKFb-h_-Kn6BCnoH85-Q.--M9zL2qS6-",
        "posted": "2021-08-31T18:32:24.766Z",
        "lastScraped": "2021-09-03T18:32:24.766Z",
        "description": "<div><div><p>Schweitzer Engineering Laboratories (SEL) seeks a professional, innovative, and detail-oriented individual for a Software Engineering Internship in Pullman, WA. The ideal candidate for this position will be able to work part-time during the school year and full-time during the summer. If you are a current student at an accredited university in the Pullman area looking for an opportunity to develop your web design and software programming skills, learn from industry leading engineers, and enhance your academic learning, then this may be the position for you!</p><p></p><p><i><b>Essential Duties and Responsibilities</b></i><br>1. Support SEL's software development process<br>2. Verify that software meets requirements.<br>3. Implement firmware/software design.<br>4. Provide support to engineering staff as needed.<br>5. Follow engineering quality assurance procedures.<br>6. Continuously identify, measure, and improve processes.<br>7. Follow and apply SEL Values, Principles of Operations, and World Class Manufacturing Principles.<br>8. Understand. Create. Simplify.<br>9. Other duties as assigned.</p><p></p><p><i><b>Required Qualifications</b></i><br>Current student pursuing a degree in computer science or equivalent with at least one year of technical coursework completed<br>Experience in Ruby on Rails, AngularJS, CSS, SASS, PHP, React and Redux.<br>Ability to execute and document defined testing procedures<br>Strong writing, documentation, and speaking skills<br>Ability to learn new skills and assume new responsibilities<br>Ability to work cooperatively in a team environment<br>Background check results satisfactory to SEL<br>Negative drug test result(s)</p><p><br><i><b>Preferred Qualifications</b></i><br>Experience using languages, such as JavaScript, C++, Java and REST.<br>Practical knowledge of developing Microsoft Windows applications<br>Knowledge of SQL and database concepts<br>Experience using revision control and source code management systems such as Git, Mercurial, SVN, and Rational ClearCase<br><br><i><b>Physical Requirements</b></i><br>None</p><p></p><p><b><i>Location Information</i></b></p><p><b>Pullman, WA</b>- SEL's corporate office is located in Eastern Washington where you'll enjoy an unmatched quality of life. Enjoy the smaller town life: country space, freedom from traffic, easy access to recreational activities in nearby mountains, rivers, and forests, as well as great schools and universities.</p><p></p><p><b><i>An Award Winning Company</i></b></p><p>Schweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets in many different industries, markets, and geographies around the world.</p><p></p><p><b><i>Communication with Applicants</i></b></p><p>SEL sends an initial e-mail response to all applicants at time of resume or CV submittal. If you do not receive this communication, please check your SPAM filter and make sure your system is not blocking e-mails from SEL. It is important that you ensure your receipt of this e-mail as SEL may communicate future position updates via e-mail.</p><p></p><p></p><p></p><p>SEL is an Equal Opportunity Employer: M/F/Vets/Disabled.</p></div></div>"
    },
    {
        "position": "Software Application Engineer Undergraduate Intern",
        "company": "Intel",
        "location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/9f857ee7f889ff6ab73a23f751946e72?lvk=RvPjSULYKDYbiNdcslxp0A.--M9zLA-RBF",
        "posted": "2021-09-01T18:32:26.867Z",
        "lastScraped": "2021-09-03T18:32:26.867Z",
        "description": "<div><div><b>Job Details:</b><p></p><p></p>Job Description:&nbsp;<p>In this position, responsibilities may be quite diverse of a nonexempt technical nature.</p><p></p><p>Job assignments are usually for the summer or for short periods during breaks from school.</p><p></p><p>As a Software Application Engineer Undergrad Intern, you will be involved in analyzing, programing, debugging, or modifying software enhancements and/or new products. You may get the opportunity to directly work with companies that develop applications software, focused on enabling and optimizing of 3rd-party software applications. Code may be used in a wide variety of commercial or end-user applications.</p><p></p><p></p><b>Qualifications:</b><p>You must possess the minimum qualifications to be initially considered for this position. Experience listed below would be obtained through a combination of your <span class=\"long-word\">schoolwork/classes/research</span> and/or relevant previous job and/or internship experiences. This position is not eligible for employment-based visa/immigration sponsorship. Intel sponsors individuals for employment-based visas for positions where we experience a shortage of US Workers. These skills shortage roles are typically STEM contributing positions requiring a Master's or PhD degree, or a Bachelor's degree with three years' related job experience. This position does not qualify for Intel Sponsorship because it is either (1) a non-STEM contributing position, or (2) a STEM position that only requires a Bachelor's degree and less than three years' experience.<br><br><b>Minimum Qualifications</b><br>- Candidate must be pursuing a Bachelors degree in Computer Science, Computer Engineering or Electrical Engineering<br>- 6+ months experience with:</p><ul><li>Hardware and Software maintenance.</li><li>Troubleshooting</li><li>Data Collection and analysis</li><li>Network Maintenance</li></ul><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>Job Type:Student / Intern<p></p><p></p>Shift:Shift 1 (United States of America)<p></p><p></p>Primary Location:&nbsp;US, California, Santa Clara<p></p><p></p>Additional Locations:Virtual US and Canada<p></p><p></p><p></p><p></p>Business group:The Client Computing Group (CCG) is responsible for driving business strategy and product development for Intel's PC products and platforms, spanning form factors such as notebooks, desktops, 2 in 1s, all in ones. Working with our partners across the industry, we intend to continue to advance PC experiences to deliver the real-world performance people demand. As the largest business unit at Intel, CCG is investing more heavily in the PC, ramping its capabilities even more aggressively, and designing the PC experience even more deliberately, including delivering a predictable cadence of leadership products. As a result, we are able to fuel innovation across Intel, providing an important source of IP and scale, as well as help the company deliver on its purpose of enriching the lives of every person on earth.<p></p><p></p>Posting Statement:All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.Position of TrustN/A<p></p><p>Annual Salary Range for jobs which could be performed in US, Colorado:</p>$52,000.00-$147,000.00 (Hourly Role)<p></p><p><b>Benefits:</b></p><p>We offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, and benefits programs. Find out more information about our Amazing Benefits here.</p></div></div>"
    },
    {
        "position": "Fashion and Beauty Internship- 2022",
        "company": "Hy-Vee",
        "location": {
            "city": "West Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/92b11d2e69383d150ec9cb63c8d733ed?lvk=T0_DQorV3WAtI9OHVcRg7g.--MA24d_aeZ",
        "posted": "2005-09-27T18:32:27.897Z",
        "lastScraped": "2021-09-03T18:32:27.897Z",
        "description": "<div><div><div></div><div>&nbsp;</div><div><strong>Job Title</strong><strong>:</strong>&nbsp; Fashion and Beauty Intern</div><div>&nbsp;</div><div><strong>General Function</strong>:&nbsp;</div><div>The ideal candidate has a blend of creative vision and strong financial background. They will help the team with buying, marketing and the operations side of the business. &nbsp;</div><div>&nbsp;</div><div><strong>Reporting Relations:</strong></div><div>Accountable and Reports to:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Vice President of Fashion and Beauty</div><div>&nbsp;</div><div>Positions that Report to you:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; None</div><div>&nbsp;</div><div><strong>Primary Duties and Responsibilities</strong>:</div><ol><li><div>Provides prompt, efficient and friendly customer service by exhibiting caring, concern and patience in all employee interactions.</div></li><li><div>Attend buying virtual markets</div></li><li><div>Observe and help with the buying process including new item set up and managing replenishment programs.</div></li><li><div>Assist with the marketing process and assist with needs of marketing projects/reports</div></li><li><div>Assists with eCommerce online orders and promotions</div></li><li><div>Supports new store set ups. Overview of the store merchandising while assisting set up.</div></li><li><div>Adheres to company policies and individual facility guidelines.</div></li><li><div>Reports to work when scheduled and on time.</div></li></ol><div>&nbsp;</div><div><strong>Secondary Duties and Responsibilities:</strong></div><ol><li><div>Performs other job-related duties and special projects as required.</div></li></ol><div>&nbsp;</div><div><strong>Education and Experience:</strong></div><div>High School Diploma or GED required. Experience with Microsoft Office (Word, Excel and PowerPoint), pursuing secondary education in business or related field.</div><div>&nbsp;</div><div><strong>Competencies:</strong></div><ul><li><div>Commitment to the Hy-Vee Mission and a willingness to promote the values of the company</div></li><li><div>Must possess the ability to interview, counsel or advise people; evaluate data, compose correspondence</div></li><li><div>Must have the ability to solve practical problems; variety of variables with limited standardization; interprets instructions</div></li><li><div>Must be able to perform arithmetic and calculations involving fractions, decimals, and percentages</div></li><li><div>This position requires strong computer and analytical skills. The person must also have strong verbal and written communication skills and be extremely detailed oriented.&nbsp; The person must be well organized and capable of multi-tasking simultaneously</div><div>&nbsp;</div><div><strong>Physical Requirements:</strong></div></li></ul><ul><li><div>Must be physically able to perform light work exerting up to 20 pounds of force occasionally to move objects.</div></li><li><div>Visual requirements include vision from less than 20 inches to more than 20 feet with or without correction, depth perception, and color vision, and field of vision.</div></li><li><div>Must be able to perform the following physical activities: Climbing, balancing, stooping, kneeling, reaching, standing, walking, pushing, pulling, lifting, grasping, feeling, talking, hearing, and repetitive motions.</div></li></ul><div><strong>Working Conditions</strong>:</div><div>This position frequently involves a fast work pace in an office setting.&nbsp; Must be able to handle multiple jobs/situations every day.&nbsp;&nbsp;</div><div><strong>Equipment Used to Perform Job:</strong></div><div>Computer, Microsoft Word, Outlook, calculator, phone, copier.</div><div><strong>Contacts:</strong></div><div>Has daily contact with employees</div><div>&nbsp;</div></div></div>"
    },
    {
        "position": "Test Development Engineer",
        "company": "Teradyne",
        "location": {
            "city": "Agoura Hills",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/0d0a20a2b334fd2a288a7f0ce28b27ef?lvk=mG4hGA5ay_cR7KST6OTLIw.--M9u0vUQi3",
        "posted": "2021-09-01T18:32:29.322Z",
        "lastScraped": "2021-09-03T18:32:29.322Z",
        "description": "<div><div><div><div><div> Apply now </div></div><div><div><div><div><div> Test Development Engineer </div></div></div></div><div><div></div></div><div><div><div><div> ID:&nbsp; 2210 </div></div></div></div><div><div><div><div> Function:&nbsp; Engineering </div></div></div></div><div><div><div><div> Location:&nbsp; <p> Agoura Hills, CA, US </p> #job-location.job-location-inline {display: inline;} </div></div></div></div><div><div><br></div></div><div><div><div><div><p>&nbsp;</p><p>Teradyne's Silicon Technology Engineering group (STE) needs an entry level ATE test engineer who supports new product introduction and is responsible for updating production test programs to improve test repeatability, test time and product yield. Candidates must have in depth knowledge on computer programming and good working knowledge of semiconductor devices. The role will involve direct communication with Teradyne's new product introduction, supply line management and operations groups as well as communication to Teradyne's ASIC supply chain vendors.</p><p>&nbsp;</p><p>Great opportunity for New Grads, Masters degree preferred.</p><p><br> &nbsp;</p><ul><li>Support transfer of production test program from Teradyne to aggregator</li><li>Works with product engineers to produce correlation reports between TER ATE results and aggregator ATE results</li><li>Works with product engineers to manage ATE yield characterization over process</li><li>Execute Gage R&amp;R plan and improve test program to meet the repeatability and reproducibility goals</li><li>Define specification limits for wafer sort (WS) and final test (FT)</li><li>Establish acceptable yield targets for WS and FT </li><li>Define and ensure that product quality and yield targets are met</li><li>Track in-line wafer monitor data (process control monitors) as needed to ensure quality and yield of products</li><li>Track yield at both WS and FT and provide periodic summary reports on yield</li><li>Analyze supplier data to identify ways to prevent quality issues </li><li>Provide first level of debug when WS or FT yield is below acceptable yield targets</li><li>Looks at wafer process control monitors to identity correlation between wafer process monitors and yield </li><li>Appropriately notifies Teradyne of production yield issues</li><li>Archive data logs from WS and FT</li><li>Production test development and maintenance</li></ul><ul><li>Technical interface between Teradyne and vendors of Teradyne's STE</li><li>Sign-off of Production Test releases</li><li>Initiate and assist in the implementation of production test changes to enhance yield as needed for cost reduction and/or assurance of supply</li><li>Support root cause analysis of ASIC failures as first point of contact for RMAs and failure analysis</li><li>Expedient and effective hands-on diagnosis of issues with products</li><li>Support Root Cause Analysis as required both during development and in high volume manufacturing </li><li>Assist in evaluation of devices as needed on bench set ups or at ATE to diagnose issues </li><li>Support corrective action for Test Escapes by managing production test changes (limit changes, test enhancements)</li><li>Define and support DOEs for yield and quality improvements</li><li>Provide inputs into DFM, DFT and FMEA activities. </li></ul><p>&nbsp;</p><p>Education required</p><p>&nbsp;</p><ul><li>Bachelor's degree in Electrical Engineering or Computer Science required</li><li>Master's degree is preferred</li><li>Any working experience in ATE industry via part time employment or internship is desired</li><li>A good understanding of semiconductor operation is a must</li></ul><p>&nbsp;</p></div></div></div></div><p><br><strong>Nearest Major Market: </strong>Los Angeles <br><strong>Job Segment: </strong> Manufacturing Engineer, Engineer, Electrical, Intern, Computer Science, Engineering, Entry Level, Technology </p></div><div></div><div> Apply now </div></div><div></div></div></div>"
    },
    {
        "position": "Strategic Student Program: Project Management and Technical Documentation Interns (IT; Spring 202...",
        "company": "Siemens Corp",
        "location": {
            "city": "Cypress",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/524f6922fe374a9d24cef9a185ddd6ff?lvk=Zyvgd97LyN1_pSQZuXst4g.--MA4d55tkN",
        "posted": "2021-09-02T18:32:30.254Z",
        "lastScraped": "2021-09-03T18:32:30.254Z",
        "description": "<div><p>Siemens Digital Industries Software Strategic Student Program (SSP) Discover your career with us at Siemens Software! We are a leading global software company dedicated to the world of product lifecycle management; from computer aided design, to 3D modeling and simulation- helping innovative global manufacturers design better products, faster! With the resources of a large company, and the energy of a software start-up, we have fun together while creating a world class software portfolio. </p><p>Our culture encourages creativity, welcomes fresh thinking and focuses on growth, so our people, our business, and our customers can achieve their full potential. We're currently recruiting students for our Spring 2022 Strategic Student Program. Our intern and co-op positions will allow you to find a career path that most inspires you. </p><p>Here, you will apply your education to solve real-world problems, and turn theory into practice. At Siemens, our goal is to empower our students to become the next leaders of our company. We have 2 positions listed within this job description: (1) Project Operations Intern and (2) Technical Documentation Intern Baseline Requirements: Currently enrolled as an undergraduate student Minimum 3.0 GPA Authorized to work in the United States without the need for current or future sponsorship by the company Available to work in a part-time capacity (10-25 hours / week) and full-time in summer 2022 Preferred junior or senior status Perks: Victorious daily ping pong tournaments Paid volunteer time off Employee discounts at our top customer sites Networking with our global leaders Mentorship from senior engineers Individual career development planning Professional and technical workshops Energetic student community Leadership opportunities Potential for full time offers after university graduation and completion of the program Information Technology (IT) (1) IT Projects &amp; Operations Intern As part of our IT Software Product Support organization, you will become immersed in IT operations and project management activities for our software development &amp; support effort. </p><p>The team provides an enterprise platform for Product Development and Support operations within Siemens Digital Industries Software. The IT Projects &amp; Operations intern will: Participate in executing an IT Application Development team's operations. Perform project management including documenting meetings and requirements. </p><p>Learn agile methods for software development &amp; project tracking. Support users who have questions and problems with our applications. Organization Requirements: Currently enrolled in a university pursuing an undergraduate or master's degree in Information Systems, Business Administration, Communication, or equivalent field. </p><p>Available to work in a part-time capacity (10-25 hours per week) in the spring and full-time in summer 2022. Experience in a Project Management tool helpful, but not required. Good communication skills, both verbal and written. </p><p>Good Power Point and Excel skills. Result-driven, detail-oriented. Quick learner and team player. </p><p>(2) IT Technical Documentation Intern As part of our IT Software Product Support organization, you will become immersed in producing technical documentation for our software development &amp; support effort. The team provides an enterprise platform for Product Development and Support operations within Siemens Digital Industries Software. The IT Technical Documentation intern will: Participate in learning various IT applications and operations, based on the team's reference manuals, Wiki articles, and other documents (Power Points, workflow diagrams.) Create and update technical documentation which include reference manuals, user guides, online Wiki articles, training videos, and workflow diagrams. </p><p>Support users who have questions and problems with our applications and apply the knowledge in updating existing documentation Organization Requirements: Currently enrolled in a university pursuing an undergraduate or master's degree in Information Systems, Communication, or equivalent field. Available to work in a part-time capacity (10-25 hours per week) in the spring and full-time in summer 2022. Experience in Wiki or other authoring tools helpful, but not required. </p><p>Experience in Viso or other diagramming tools helpful, but not required. Good communication skills. Must be extremely comfortable and skillful in writing and organizing contents of documents. </p><p>Good Power Point and Word skills. Result-driven, detail-oriented. Quick learner and team player. </p><p>Organization: Digital Industries Company: Siemens Industry Software Inc. Experience Level: Student (Not Yet Graduated) Job Type: Part-time Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. </p><p>EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non-Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. </p><p>To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here.</p></div>"
    },
    {
        "position": "Career Training Program (CTP) - Manufacturing Engineering Leadership",
        "company": "Kroger",
        "location": {
            "city": "Riverside",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b303e9131520c1598663c2f677c92245?lvk=IzlMiYFLKRqgt4nSd3npIw.--MA22jqgog",
        "posted": "2021-08-31T18:32:31.138Z",
        "lastScraped": "2021-09-03T18:32:31.138Z",
        "description": "<div><div><p><strong>Company Name:</strong>Riverside Creamery<br><strong>Position Type:</strong>Employee<br><strong>FLSA Status:</strong>Non-Exempt<br></p><p></p> Position Summary: <p>Entry level professional opportunity for recent college graduates. The CTP Program is designed to prepare candidates for first level leadership positions upon successful completion of the 12-24 month program. CTPs build technical and leadership competencies in the selected area of expertise while gaining a broad knowledge base of all core business functions critical to the manufacture of Kroger products. Relocation is a requirement of the CTP Program. Perform all jobs safely, efficiently and accurately to maintain and improve the performance of the entire division in the areas of Safety, Quality, Reliability (SQR) and our Customer 1st strategy. Provide leadership that embodies our 7 Kroger Manufacturing High Performance Work System Principles. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety.</p> Essential Job Functions: <ul><li>Initiate active development through interactions with team members, mentors, Corporate and Plant sponsors</li><li>Demonstrate excellence in project planning, execution, and timing through project evaluation and use of available resources to expedite project completion</li><li>Participate in the multi-faceted orientation process</li><li>Demonstrate commitment inthe plant safety process</li><li>Contribute and participate in practical, challenging and meaningful assignments</li><li>Follow established programs, policies and practices to produce safe quality foods that meet regulatory and company requirements</li><li>Support the development, implementation, maintenance, and ongoing improvement of the SQF Systems</li><li>Accountable to the Kroger Manufacturing Food Safety and Quality Principles</li><li>Must be able to perform the essential functions of this position with or without reasonable accommodation</li></ul> Minimum Position <span class=\"long-word\">Qualifications/Education:</span> <ul><li>Must relocate as a requirement of the CTP Program</li><li>Experience through internships, part time, or full time positions</li><li>Self-motivated; able to meet deadlines with limited supervision</li><li>Strong oral and written communication skills</li><li>Strong attention to detail, with high degree of accuracy and precision</li><li><strong>Administration</strong>: Bachelor's degree in Business or related field</li><li><strong>Engineering</strong>: Bachelor's degree in Mechanical or Electrical Engineering</li><li><strong>Finance</strong>: Bachelor's degree in Accounting/Finance</li><li><strong>Human Resources</strong>: Bachelor's degree in Human Resources or related field</li><li><strong>Manufacturing Information Technologist (MIT)</strong>: Bachelor's degree in Computer Engineering or Computer Science, Microsoft (MS) Certified IT Professional (MCITP) or MS Certified Systems Administrator (MCSA) with emphasis in MS Windows 2008 Server and MS SQL 2008 database management; or MS Certified Technology Specialist certifications in Windows 7, MS Windows 2008 Server, and MS SQL Server 2008</li><li><strong>Operations</strong>: Bachelor's degree in Operations Management or related field</li><li><strong>Quality Assurance</strong>: Bachelor's degree in Food Science, Biological or Chemical Sciences; knowledge of Dairy/ Bakery/Grocery Food Science or Product Development</li></ul> Desired Previous Job <span class=\"long-word\">Experience/Education:</span> <ul><li>Graduate degree in discipline related field</li><li>Experience in manufacturing environment</li><li>Experience in union environment</li></ul><p></p><p><strong>Education Level:</strong>Bachelor's Required<br><strong>Required Travel:</strong>Up to 25%<br><strong>Required <span class=\"long-word\">Certifications/Licenses:</span></strong>None<br><strong>Position Type:</strong> Full-Time<br><strong>Regions:</strong>West</p><p><br></p><p></p><p><strong>Jobs at Kroger Manufacturing:</strong>Through quality products, strong individual commitments and team spirit, Kroger has been established as a leader in the manufacturing industry. Kroger Manufacturing provides career development programs aligned with aspirations in Engineering, Process Management, Information Systems, Quality Assurance, Operations Management, Human Resources, Finance and Procurement. Our work force programs provide technically challenging rotations with cross-functional teams, plants and locations to allow our Associates to learn from some of the brightest minds in the business. Experience and training combined with mentoring and guidance from plant sponsors prepare our Associates with the skills and leadership behaviors needed to achieve a successful career at Kroger.</p><p></p><p><strong>Company Overview:</strong>Kroger Family of Companies employs nearly half a million associates who serve over 11 million customers daily through a seamless shopping experience under a variety of banner names. At The Kroger Co., we are Fresh for Everyone and dedicated to our Purpose: To Feed the Human Spirit. We are committed to creating <span class=\"long-word\">#ZeroHungerZeroWaste</span> communities by 2025. Careers with The Kroger Co. and our family of companies offer competitive wages, flexible schedules, benefits and room for advancement.</p><p>Posting Notes: CA||Riverside|| 1500 Eastridge Ave. ||92506 || Riverside <span class=\"long-word\">Creamery||None||Manufacturing</span>; Engineering &amp; Operations; Management ||Employee|| Non-Exempt || Full-Time|| None </p></div></div>"
    },
    {
        "position": "Environmental Coordinator (Part-Time)",
        "company": "Coeur Mining",
        "location": {
            "city": "Lovelock",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/coeur-mining-8a6c960b/environmental-coordinator-part-time-d6ef57da?lvk=PZlsmhX-zq3j3iMpN7VPjg.--MA3V5hup3",
        "posted": "2021-08-23T18:32:32.970Z",
        "lastScraped": "2021-09-03T18:32:32.970Z",
        "description": "<div><div><p>Our purpose statement is, We Pursue a Higher Standard. Everything we do is fueled by this statement; it is our foundation and inspiration for our actions every day. At Coeur, we PROTECT our people, places and planet, DEVELOP quality resources, growth and plans, and DELIVER impactful results through teamwork.</p><p> </p><p>Coeur Mining, Inc. is a well-diversified growing precious metals producer with five operations in North America. Coeur’s wholly-owned operations include the Palmarejo gold-silver complex in Mexico, the Rochester silver-gold mine in Nevada, the Kensington gold mine in Alaska, the Wharf gold mine in South Dakota and the Silvertip silver-zinc-lead mine in British Columbia. In addition, the Company has interests in several precious metals exploration projects throughout North America. Coeur’s headquarters are located in Chicago, IL. </p><p><strong> </strong></p><p>Coeur Rochester is looking for a Part-Time Environmental Coordinator to join the Environmental Team at site. This role will report directly to the Environmental Manager. This Part-Time opportunity will have 2 shifts, 10 hours per day. This is a key role involving environmental monitoring, permits and regulatory reports, leading environmental training to staff, and beyond. </p><p><strong><br></strong>Responsibilities:</p><p> </p><ul><li>Assists the Environmental Manager with the review of compliance, data trends and reporting. Assists in the development and communication of improvement plans related to environmental management.</li><li>Provides input and assists the Environmental Manager and Operations personnel in the planning and response to environmental issues and concerns.</li><li>Assists with planning, schedules, and monitoring environmental aspects of capital projects. Helps ensure that resources are available for the timely completion of all capital projects.</li><li>Ensures compliance with the required environmental deliverables through inspections, physical audits, and timely correction of identified deficiencies. Assists with the implementation of the environmental management system.</li><li>Conducts field environmental monitoring activities related to air, water, wildlife, soils, vegetation, meteorology, and archaeology. Assist, formulate, document and implement environmental sampling routines and quality control procedures in compliance with regulatory requirements of applicable permits and company policy.</li><li>Assists in the preparation of permits, studies, or regulatory reports related to environmental compliance.</li><li>Develop and update monitoring and reporting protocols in accordance with state and federal statutes and regulations.</li><li>Supervise activities of external <span class=\"long-word\">contractors/consultants</span> involved with environmental and reclamation projects.</li><li>Provide Environmental training to staff as requested.</li></ul><p> </p><p><strong>Qualifications:</strong></p><ul><li>BS, MS, or Technical Degree in environmental, biological, or earth sciences.</li><li>Effective written and verbal communication skills. </li><li>Proficient in computer skills including Word, Excel, PowerPoint, and database applications. </li><li>Excellent interpersonal skills, including the ability to work well within a team environment. </li><li>Strong analytical ability, problem-solving skills, &amp; work ethic.</li><li>1-3 years of work experience required within the Environmental sector. Internships to be considered as well. </li><li>Environmental experience at an operational mine preferred.</li><li>Working knowledge of Federal and State regulations and permit requirements preferred.</li><li>Working knowledge of Nevada environmental regulations preferred.</li></ul><p> </p><p><strong> </strong></p><p><strong>Go to </strong><strong>www.coeur.com</strong><strong> to apply for this position.</strong></p><p> </p><p>It is the policy of Coeur Mining, Inc. and its direct and indirect United States subsidiaries (the</p><p>“Company”) to provide equal opportunity employment to all Employees and applicants for</p><p>employment. No person working at the Company's facilities in the United States is to be</p><p>discriminated against in employment because of race, religion, color, sex, age, national origin, disability, or veteran status.</p><p><strong> </strong></p><p></p></div></div>"
    },
    {
        "position": "Maintenance Avionics & Aircraft Performance Engineering Intern - Spring 2022",
        "company": "Southwest Airlines Co.",
        "location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/c2f3f7a8c7ea38720773b0e433fa1137?lvk=4t-SkFuHOZ2PtpZM2KCKiA.--M9z5rvG_B",
        "posted": "2021-09-01T18:32:34.942Z",
        "lastScraped": "2021-09-03T18:32:34.942Z",
        "description": "<div><div><p>Southwest will provide a stable work environment with equal opportunity for learning and personal growth. Employees will be&nbsp;provided&nbsp;the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.&nbsp;</p><br><p>This Spring Internship is&nbsp;&nbsp;</p><ul><li>Part-time and virtual with an expectation of about 24&nbsp;hrs&nbsp;per week (about 2.5-3 days a week) during normal business hours (8am-5pm CT) There is the ability to work up to 40hrs per week if applicable.&nbsp;&nbsp;</li><li>If selected, you will work with your Leader to determine your work schedule.&nbsp;</li><li>Students will still be expected to work Monday – Friday and maintain normal business hours.&nbsp;&nbsp;</li><li>Most teams maintain a hybrid workplace flexibility model with only a few days a week working at HDQ and therefore relocation to Dallas for the internship this Spring 2022 is not required, but opportunities to travel into HDQ on the company jets (Boeing 737’s of course) for training and meetings with your team are supported throughout the internship as needed or able.&nbsp;&nbsp;</li></ul><p>&nbsp;</p><p>Even with a virtual/hybrid model for the spring internships, the culture and connection with your Team is still a vital part of the experience. Trust us, it is sure to be a lot of fun no matter where you are located!&nbsp;</p><p>&nbsp;</p><p>Interns will receive any needed equipment, such as a laptop, for the internship as well as a living stipend and internet stipend paid out one time on your first paycheck (less applicable taxes).&nbsp;&nbsp;</p><p>&nbsp;</p><p>Southwest Airlines' Engineering Internships span across different Teams within the Technical Operations Department and the Network Operations Control Departments.</p><p>&nbsp;</p><p>&nbsp;</p><hr><p>If selected, you will work part-time as a Team Member within one of the following areas: &nbsp;</p><div><p>&nbsp;</p><p><strong>Avionics Engineering</strong></p><p>The Avionics Engineering Team works within the Technical Operations Department and is responsible for the mechanical systems of the aircraft. These systems include: Autopilot, Cockpit Voice Recorders, Flight Data Recorders, Navigation, Communications, Displays, WiFi, Lighting, Electrical Power and Software. Avionics Engineering is responsible for evaluation and processing of manufacturers’ service information, such as service bulletins and letters; adapting regulatory requirements such as Airworthiness Directives from the FAA; participating in teleconferences with OEMs for emerging technical issues; deriving solutions to enhance Safety, Reliability, and Optimal Operation of our fleet; daily interaction with multiple groups within Technical Operations and the Company to best tailor our products to suit their needs.</p><p>&nbsp;</p></div><p><strong><span class=\"long-word\">Aerodynamics/Performance</span> Engineering</strong></p><p>The Operations Engineering Team works within the Network Operations Control Department and analyzes aerodynamic configurations and modifications, airport and aviation critical area changes, and environmental conditions to determine mission capabilities for our fleet of aircraft. &nbsp;We provide Pilots and Dispatchers with information and data to show them what the aircraft can do in a given situation.&nbsp; We develop special flight procedures to help minimize the impact of performance-limiting situations.</p><p>&nbsp;<em><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></em></p><p><strong>DUTIES &amp; RESPONSIBILITIES:</strong></p><p>All roles will work on various size engineering projects in a maintenance or operations environment.</p><p>&nbsp;</p><p>The intern will be utilized as an entry-level engineer and may get hands on experience with aircraft under supervision.</p><p>&nbsp;</p><p>Assist with special projects and events as requested.</p><p>&nbsp;</p><br><p><strong>BASIC QUALIFICATIONS: </strong></p><p>&nbsp;</p><p>High School Diploma, GED or equivalent education required.</p><p>&nbsp;</p><p>Must be at least 18 years of age.</p><p>&nbsp;</p><p>Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986.</p><p>&nbsp;</p><p><strong>EDUCATION:</strong></p><p>&nbsp;</p><p>Progress towards degree with a major/minor in Aerospace Engineering, Aeronautical Engineering, Mechanical Engineering, Aviation Maintenance Science, or other Engineering related degree.</p><p>&nbsp;&nbsp;</p><p>To be eligible must be currently enrolled as a full-time student (minimum 12 credit hours.)</p><p>&nbsp;</p><p>Maintained 3.0 or above cumulative GPA.</p><p>&nbsp;</p><p><strong>EXPERIENCE:</strong></p><p>&nbsp;</p><p>Work experience in an Aviation/Aerospace environment a plus.</p><p>&nbsp;</p><p>Previous Work or Internship experience in an engineering related role is a plus.</p><p>&nbsp;</p><p>Participation in Aviation/Aerospace organizations and clubs a plus.</p><p>&nbsp;</p><p>Completion of 9 hours of Engineering related coursework is preferred.</p><p>&nbsp;</p><p>Leadership in organizations and clubs a plus.</p><p>&nbsp;</p><p>Proficient in Microsoft applications.</p><p>&nbsp;</p><p>Understanding on how to write technical documents/reports.</p><p>&nbsp;</p><p>The internship may also require a basic knowledge and understanding of current Engineering drawings and software to create them a plus.</p><p>&nbsp;</p><p>Basic understanding and knowledge of maintaining the aircraft structure, avionics, aircraft performance, systems, avionics, interiors, and powerplant is preferred.</p><p>&nbsp;</p><p><strong><span class=\"long-word\">SKILLS/ABILITIES/KNOWLEDGE/WORK</span> STYLE:</strong></p><p>&nbsp;</p><p>Must possess excellent organizational and time management skills.</p><p>&nbsp;</p><p>Ability to work independently and the willingness to function as part of a team.</p><p>&nbsp;</p><p>Ability to multi-task and complete assignments with tight deadlines.</p><p>&nbsp;</p><p>Good oral and written communication skills required.</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>TIME COMMITMENT:</strong></p><p>&nbsp;</p><p>Part-time - 24-40 hours per week.</p><p>&nbsp;</p><p><strong>PAY:</strong></p><p>&nbsp;</p><p>$20 per hour + flight privileges</p><p>&nbsp;</p><p>&nbsp;</p><p><strong><em>All students must apply online at </em></strong><strong><em><span class=\"long-word\">careers.southwestair.com</span></em></strong></p><p>&nbsp;</p><p>&nbsp;</p><p><strong>Please print/save the job description because it won’t be available after you apply.</strong><strong><br></strong></p><p>&nbsp;</p><p>&nbsp;</p><p><strong><em>Southwest Airlines is an Equal Opportunity Employer.</em></strong></p><br></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Scientific Games",
        "location": {
            "city": "Reno",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f7a3c190d87ba158214b5b1b787b1ac0?lvk=XcMqb2pnVQDfD-v0xDImwQ.--M9pN7QjgN",
        "posted": "2021-08-30T18:32:36.418Z",
        "lastScraped": "2021-09-03T18:32:36.418Z",
        "description": "<div><div><p>Gaming:</p><p>Are you ready to level up your career?</p><p><br>At Scientific Games, we are committed to making the best games, platforms and systems in the world. We are looking for smart, passionate and creative people to join our team and help us transform the gaming world. We are a global, industry-leading gaming technology company that embraces challenge, fosters an inclusive culture, values integrity, innovation and winning, and is committed to developing and supporting its people.</p><p></p><p>Whether you are a member of our award winning game studios, our industry leading systems group, product management, manufacturing group, services or any of our other amazing Gaming teams, you will be creating compelling games played around the world. We are dedicated to being the industry's only COMPLETE global solutions provider with products that will enhance the entire gaming operation, both on the casino floor and behind the scenes.</p><p></p><p>If you are ready to play...Come join us and let's make games!</p><p></p><p></p><p></p>Scientific Games:<p>Scientific Games (SG) is a global leader focused on delivering an ever-expanding portfolio of lottery and gaming products and services to the world's government-regulated and government-sponsored entities. Scientific Games' global reach is made possible through the expertise, skill and dedicated efforts of its 8,000+ employees who serve lottery and gaming customers in more than 100+ countries on 6 continents.</p><p></p><p></p>Position Summary<p>The person in this position works in a temporary or part time position with an emphasis on on-the-job training. The person in this position is responsible for directly assisting a team of experienced developers who are responsible for creating and modifying software for casino and lottery gaming platforms. They will be responsible for a variety of software, hardware and mathematical related tasks as well as obtaining working knowledge and experience with organized software development and the Scientific Gaming codebase and tools.</p><p></p><p><b>Essential Job Functions: </b></p><ul><li>Testing and reviewing code created by developers.</li><li>Creation and maintenance of development tools.</li><li>Basic software debugging using debugging tools.</li><li>Math testing and verification using simulation tools and excel sheets.</li><li>Research and education of the Scientific Gaming codebase.</li><li>Basic software development.</li></ul><p><br></p><p></p><p></p>Qualifications<p><b>Special Restrictions and Qualifications:</b></p><ul><li>Must be able to acquire and hold a Nevada Gaming Card. (Requires being at least 21 years of age at time of employment).</li><li>Part time position.</li><li>Able to work remote.</li></ul><p></p><p><b>Training and/or Experience: </b></p><ul><li>At least two years of experience coding in C++.</li><li>Experience with UNIX/Linux is preferred.</li></ul><p></p><p><b>Knowledge, Skills and Abilities: </b></p><ul><li>Experienced in C++</li><li>Use of debuggers including GDB.</li><li>Microsoft Excel or Open Office Spreadsheet</li><li>Understanding of basic probability and statistics.</li><li>Problem solving and analytical skills</li><li>Knowledge of Bash, Perl or Python scripting a plus.</li></ul><p></p><p><b>Education: </b></p><ul><li>At least 2 years of experience working towards a Computer Science degree.</li></ul><p></p><p><b>Work Experience: </b></p><ul><li>At least 2 years of working experience.</li></ul><p></p><p></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.</p><p></p><p>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.</p><p></p><p>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law, please click here for EEOC Poster.</p></div></div>"
    },
    {
        "position": "Software Engineering Intern (long-term)",
        "company": "Scientific Games",
        "location": {
            "city": "Reno",
            "state": "NV",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/cc9765d50ca4f769c6c039269698d996?lvk=aEw4qEuFIW4A-M0tzp6X8A.--M9WIRsBuk",
        "posted": "2021-08-26T18:32:38.349Z",
        "lastScraped": "2021-09-03T18:32:38.349Z",
        "description": "<div><div><p>Gaming:</p><p>Are you ready to level up your career?</p><p><br>At Scientific Games, we are committed to making the best games, platforms and systems in the world. We are looking for smart, passionate and creative people to join our team and help us transform the gaming world. We are a global, industry-leading gaming technology company that embraces challenge, fosters an inclusive culture, values integrity, innovation and winning, and is committed to developing and supporting its people.</p><p></p><p>Whether you are a member of our award winning game studios, our industry leading systems group, product management, manufacturing group, services or any of our other amazing Gaming teams, you will be creating compelling games played around the world. We are dedicated to being the industry's only COMPLETE global solutions provider with products that will enhance the entire gaming operation, both on the casino floor and behind the scenes.</p><p></p><p>If you are ready to play...Come join us and let's make games!</p><p></p><p></p><p></p>Scientific Games:<p>Scientific Games (SG) is a global leader focused on delivering an ever-expanding portfolio of lottery and gaming products and services to the world's government-regulated and government-sponsored entities. Scientific Games' global reach is made possible through the expertise, skill and dedicated efforts of its 8,000+ employees who serve lottery and gaming customers in more than 100+ countries on 6 continents.</p><p></p><p></p>Position Summary<p>Our Reno team at Scientific Games focuses primarily on specialty markets. We design and develop exclusive content for our Central Determination, Class II, VLT, and Historical Horse Racing markets. These markets are located across the United States and Canada. We support multiple platforms on both Windows and Linux, designing and developing using the Unity game engine. It is an exciting environment where game designers, engineers, artists, sound designers, and testers work together to produce some of the best content for the market.</p><p></p><p>The person in this position is responsible for directly assisting an experienced game development team in developing games and software for casino and video lottery gaming platforms. They will be responsible for a variety of software, hardware and mathematical related tasks as well as obtaining working knowledge and experience with game development and common codebases and tools.</p><p></p><p><b>*Sponsorship is not available for this position.</b></p><p></p><p><b>Essential Job Functions: </b></p><ul><li>Testing and reviewing code</li><li>Creation and maintenance of development tools</li><li>Basic software debugging using debugging tools</li><li>Math testing and verification using simulation tools and excel sheets</li><li>Writing and installation of software</li></ul><p></p><p><b>Other Duties and Responsibilities:</b></p><ul><li>Physical installation and setup of Gaming Cabinets including software installation</li><li>Research and education of the Scientific Gaming codebase</li></ul><p></p><p></p>Qualifications<p><b>Qualifications</b>:</p><ul><li>Knowledge of Object Oriented Programming</li><li>Basic software development</li><li>Working knowledge of Windows and/or Linux</li><li>Knowledge and experience with C/C++, C#, and Unity a plus</li><li>Must be a current student enrolled in a bachelor's degree or master's degree program in Engineering, Computer Science, Mathematics, or related fields</li></ul><p></p><p><b>Required Experience:</b></p><ul><li>Overall, 0-1 year work experience</li></ul><p></p><p><b>Preferred Experience:</b></p><ul><li>Object oriented programming in any language</li><li>Experience with C# and Object-Oriented programming languages</li></ul><p></p><p><b>Knowledge, Skills, &amp; Abilities:</b></p><ul><li>Excellent written and oral communication skills</li><li>Ability to communicate and collaborate with other team members.</li><li>Ability to work in a fast paced, deadline-oriented environment</li><li>Detail-oriented and organized</li></ul><p></p><p><b>Physical Requirements: </b></p><ul><li>Office environment</li></ul><p></p><p>The physical demands and work environment characteristics described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p></p><p><b><i>Note: </i></b><i>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The incumbent may be requested to perform other job-related tasks and responsibilities than those stated above.</i></p><p></p><p></p><p>Scientific Games Corporation and its affiliates (collectively, \"SG\") are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due <span class=\"long-word\">diligence/background</span> investigation on you.</p><p></p><p>This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.</p><p></p><p>SG is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law, please click here for EEOC Poster.</p></div></div>"
    },
    {
        "position": "Student Intern",
        "company": "City of San Pablo (CA)",
        "location": {
            "city": "San Pablo",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/02d24ae73d893510a0542ff3ac864002?lvk=q1AGAm848Je2qnR57KoTtw.--M9XDXze_B",
        "posted": "2021-08-26T18:32:40.307Z",
        "lastScraped": "2021-09-03T18:32:40.307Z",
        "description": "<div><div><p></p><p><strong>(Assignment in Community Services Department)</strong></p><p><strong>Temporary; Part-Time; At-Will Employment</strong></p><p><strong>$14.42 per hour</strong></p><p><strong>(up to 150 hours)</strong></p><p><strong>&nbsp;</strong></p><p><strong>Final Filing Date:</strong>&nbsp;<strong>September 9, 2021&nbsp;</strong>at 5:00 p.m., or first 100 applications (whichever occurs first)</p><p><strong>Applications MUST be submitted online at&nbsp;</strong><strong><span class=\"long-word\">www.GovernmentJobs.com</span></strong></p><p>&nbsp;</p><p><strong>About the City</strong>: The City of San Pablo is located in the San Francisco Bay Area and has a population of approximately 29,000. The City is seeking an energetic person with a positive \"can-do\" attitude who enjoys working in a diverse community.&nbsp;</p><p><strong>About the San Pablo Beacon Community Schools Initiative:&nbsp;</strong>On November 21, 2011, the City of San Pablo City Council passed a resolution to develop a San Pablo Full Service Community Schools (FSCS) Initiative with the goal of transforming all schools in the City into Full Service Community Schools. In a Full Service Community School (Community School), the school district, city, county, community and faith-based organizations, businesses, families and philanthropists form a strong, deep and transparent partnership to jointly address the identified needs of students, families and the community in a comprehensive, integrated and accountable way. They share leadership, work towards a common vision and agenda, and share responsibility for results.&nbsp;</p><p>&nbsp;</p><p>To leverage partnership between Cities and Schools, the City of San Pablo and West Contra Costa Unified School District provide matching funds to employ Beacon Directors (community school coordinators) at all six San Pablo schools: Helms, Dover, Lake, Bayview, Downer and Riverside. The Beacon Directors oversee implementation of the community schools strategy and manage program funding to support youth development, violence prevention, family engagement, school culture and climate, and other services based on the needs of their school site.&nbsp;</p><p>&nbsp;</p><p>San Pablo Beacon Directors are conducting a needs assessment during the 2021-22 school year to better understand the priority needs and assets of children, youth and their families. The information collected will support future planning on the programmatic areas and overall implementation of the San Pablo Beacon Community Schools Initiative.&nbsp;</p><p><strong>&nbsp;</strong></p><strong>About the opportunity</strong>: The City of San Pablo is seeking interns to provide administrative support to the Youth, School, and Community Partnerships Division and San Pablo Beacon Directors in conducting a needs and assets assessment of their school site as well as supporting with marketing. Interns will also gain exposure to and knowledge of city government, its structure and inner workings. <br><br><p><strong>About the position</strong>: For additional information about the position, see the&nbsp;Job Description page&nbsp;on the City's website. This is an \"at?will\" employment opportunity with the City, without expectation of indefinite employment, and where the employment agreement may be terminated at any time without cause and within the total discretion of the appointing authority. &nbsp;</p><br><p></p> Examples of Duties / Knowledge &amp; Skills <p><strong>Duties</strong>: Interns primary responsibility is to support with conducting a needs and assets assessment and marketing. Duties may include, but are not limited to:&nbsp;<br></p><ul><li>Conducting research to gather publically available data&nbsp;</li><li>Preparing and administering surveys to youth, parent/guardians, and other stakeholder groups&nbsp;</li><li>Supporting with focus group and interview planning and preparation&nbsp;</li><li>Notetaking and transcribing interviews and focus groups&nbsp;</li><li>Analyzing information, data and surveys collected&nbsp;</li><li>Creating reports, infographics, and presentation on findings&nbsp;</li><li>Preparing social media content, newsletters, flyers, briefs and other marketing materials</li><li>Other duties as requested by Beacon Director or Youth, School, and Community Partnerships staff&nbsp;</li></ul><p></p> Minimum qualifications &amp; Requirements <p></p><p><strong>Experience and Training</strong>: No experience required but an ideal candidate will have completed or is currently enrolled in Research Methods, or a comparable course. Students who have not taken a Research Methods class can still apply.</p><p><strong>Required license and certificate</strong>: None required. &nbsp;</p><p><strong>Other Requirements</strong>:&nbsp;</p><ul><li>The program is a semester long internship with the option to continue for a second semester. Interns work 10-20 hours a week Monday - Friday.</li><li>Candidate may need to use their own laptop/computer and cell phone for work use, at their own expense. If this is a barrier, arrangements can be made to provide the candidate access to equipment.&nbsp;</li><li>A mandatory program orientation will be held on the first day of the program, and required training opportunities may be offered throughout the program.</li><li>The program requires a culminating presentation to San Pablo City Council and/or West Contra Costa Unified School District.&nbsp;</li><li>The successful candidate having been offered employment, if a MINOR, must have a valid work permit.</li><li>The successful candidate having been offered employment will be required to have a bank account to their name for direct deposit payment. No exceptions. Parent/guardian bank accounts are not accepted, and live checks will not be issued. A voided check or direct deposit slip with the candidate's name must be submitted upon request.</li><li>The successful candidate having been offered employment will undergo background investigation and fingerprinting. Minors will be required to be accompanied by a parent/guardian.&nbsp;</li><li>The successful candidate having been offered employment will have to complete a Pre-employment Medical Questionnaire, with possible Medical Examination. MINORS will be required to have parent consent in submitting their Pre-employment Questionnaire.</li><li>The successful candidate&nbsp;having been offered employment may be required to pass a City-paid pre-employment medical examination which may include TB testing.</li><li>The successful candidate having been offered employment will need to present valid identification, which may include one or more of the following: U.S. Passport, School Photo ID, Driver's License, CA ID, Social Security Card, and/ or Birth Certificate. Please do not submit any of these until requested to do so. &nbsp;</li></ul><p><strong>All applicants are advised that all City employees (full- and part-time) must comply with the City's current COVID policies.</strong></p><br><p></p> Supplemental information <p></p><p><strong>How to apply</strong>: &nbsp;&nbsp;Applications will only be accepted online at<strong>&nbsp;</strong><strong><span class=\"long-word\">http://www.governmentjobs.com/careers/sanpabloca</span></strong><strong>. &nbsp;</strong>For general questions, call the Human Resources Division at (510) 215-3000. &nbsp;Applications must be submitted to GovernmentJobs.com by the date and time listed on the job announcement. &nbsp;Applications not submitted by the posted date and time will not be considered. &nbsp;The most qualified applicants will be invited to participate in the subsequent phases of the selection process. Meeting the minimum requirements of the position does not guarantee the advancement in any phase of the selection process. Final selection will be made from an eligibility list.</p><p>&nbsp;</p><p><strong>Recruitment timeline</strong>: Although dates may change we suggest planning your calendar accordingly, as these are currently the only interview dates. <strong>Interviews:</strong>&nbsp;Early September. <strong>Start Date:</strong>&nbsp; late September/early October 2021&nbsp;</p><p>&nbsp;</p><p><strong>Background investigation and Pre-employment medical examination</strong>: &nbsp;Successful candidates will undergo a complete background investigation, fingerprinting, and pre-employment medical examination, which includes TB testing. Americans with Disabilities Act (ADA): Please contact the Human Resources Department on, or before, the filing deadline if special accommodations are necessary at any stage of the selection process. Every attempt will be made to consider your request (medical documentation must be provided upon request). Immigration Reform &amp; Control Act: In accordance with the Immigration Reform and Control Act of 1986, all potential employees will be required to provide proof of United State Citizenship or authorization to work in the United States. Drug-Free Workplace Policy: In accordance with the Drug-Free Workplace Act of 1988, it is the objective of the City of San Pablo to achieve a drug-free workplace.&nbsp;</p><p>&nbsp;</p><p>THE CITY OF SAN PABLO IS AN EQUAL OPPORTUNITY EMPLOYER. &nbsp;<span class=\"long-word\">MINORITIES/WOMEN/INDIVIDUALS</span> WITH DISABILITIES ARE ENCOURAGED TO APPLY. &nbsp; QUALIFIED APPLICANTS RECEIVE EQUAL CONSIDERATION, WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, ANCESTRY, AGE, MARITAL STATUS, AND DISABILITY EXCEPT WHERE DICTATED BY THE REQUIREMENTS OF THE JOB.</p><p><strong>&nbsp;</strong></p><p><strong>The information contained herein does not constitute either an expressed or implied contract of employment and these provisions are subject to change.</strong></p><p></p></div></div>"
    },
    {
        "position": "Access Your Future Service Intern",
        "company": "RDO Equipment Co",
        "location": {
            "city": "Irving",
            "state": "TX",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/b918b0fb49873c3697f2914086a46911?lvk=VbhZCfQ0O2YTpExT7webNA.--MA-0I9JLN",
        "posted": "2021-08-31T18:32:42.229Z",
        "lastScraped": "2021-09-03T18:32:42.229Z",
        "description": "<div><div><strong>Job Description</strong><p>Access Your Future is a sponsorship program for students interested in a career in the equipment industry as a Service Technician. This program provides a career path for a qualified student and an educational incentive upon successful completion of an approved diesel program. <br>The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships. <br><br><strong>Specific Duties Include:</strong><br></p><ul><li> Enrolled or attending an approved Diesel Technology program or another program approved in writing by RDO Equipment Co. <br></li><li> Part time paid employment at sponsoring store (if store location permits) while attending college. <br></li><li> Possible full time paid employment between college academic years at sponsoring store location. <br></li><li> This program offers sponsored students graduating, an educational incentive over a two or four year period while they maintain full time employment with RDO Equipment Co. <br></li><li> Company provided work uniforms. <br></li><li> Eligible for the RDO Equipment Co. tool discount program with Matco upon full time employment. <br></li><li> Maintain a GPA of 3.0 (on a 4.0 scale) while in program. <br></li><li> Maintain acceptable attendance record while in program. <br></li><li> It is the student's responsibility to provide a copy of their transcripts to RDO Equipment Co. after each quarter or semester and a diploma in order to receive reimbursement upon full time employment. <br></li><li> Adhere to academic policies, rules and regulations set forth by the higher learning center the student is attending. <br></li><li> Document machine information and repairs completed on work order, including parts and fluids used. <br></li><li> Maintain a clean work area, as well as care for all shop tools, machines, and equipment. <br></li><li> Identify and communicate solutions for customer service opportunities in the dealership's area of responsibility. <br></li><li> Maintain technical and product knowledge on all equipment sold within the dealerships area of responsibility. <br></li><li> Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook. <br></li><li> Conduct self in the presence of customers and community so as to present a professional image of RDO Equipment Co. <br></li><li> Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set. <br></li><li> Participate in all company/location driven communication efforts, including open book meetings, huddles, department meetings and other related efforts. <br></li><li> Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service. <br></li><li> Perform all other duties as assigned by management in a professional and efficient manner. <br><br><strong>Job Requirements:</strong><br></li><li> Mechanical skills <br></li><li> Trade specific tooling, including hand and pneumatic tools <br></li><li> Strong computer skills <br></li><li> Excellent customer service skills <br></li><li> Ability to assemble and perform maintenance functions on equipment <br></li><li> Excellent communication and written skills <br></li><li> Strong organizational skills <br></li><li> Candidates must have valid work authorization and be able to work in the U.S. without company sponsorship.Equal Opportunity Employer/Protected <span class=\"long-word\">Veterans/Individuals</span> with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-<span class=\"long-word\">1.35(c)Qualifications:</span> The Access Your Future Service Intern path offers students part time employment at a sponsoring store during their education. Upon graduation from an accredited diesel technology program, sponsored students are offered full time employment. While in school, students are expected to maintain a GPA of 3.0 and complete any required internships., * Mechanical skills * Trade specific tooling, including hand and pneumatic tools * Strong computer skills * Excellent customer service skills * Ability to assemble and perform maintenance functions on equipment * Excellent communication and written skills * Strong organizational skills * Candidates must have valid work authorization and be able to work in the U.S. without company <span class=\"long-word\">sponsorship.Employment</span> Type: [\"PART_TIME\"]</li></ul></div></div>"
    },
    {
        "position": "Student Intern - Information Technology Support",
        "company": "University Enterprises Inc - Sacramento State",
        "location": {
            "city": "Sacramento",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e2deeb42f95cf91132e39a02443fe6ea?lvk=5QWRDZS_5_SP48LsoEvCRA.--MA4flfqh3",
        "posted": "2021-09-02T18:32:43.635Z",
        "lastScraped": "2021-09-03T18:32:43.635Z",
        "description": "<div><div><div> Job Title Student Intern - Information Technology Support Student Classification Student Assistant Job Code C50118 Posting Type <span class=\"long-word\">Student/nonbenefited</span> (NSTU) Posting Number PE399F21 Job Description Summary <div> The City of Sacramento is looking to hire a Student Intern. The Intern will provide technical assistance and end user support related to computer systems, software, and hardware via multiple avenues including in person or over the phone. </div> Conditions of Employment <div> This is a part-time, temporary, non-benefited, student position. Employment in all positions with University Enterprises, Inc. is dependent upon the mutual consent of University Enterprises, Inc. and the employee. This means that either University Enterprises, Inc. or the employee can, at any time, terminate the employment relationship at will, with or without cause.&nbsp; <br>&nbsp; <br>Depending on the type of position you are applying for, a pre-employment background check consisting of one or more of the following may be conducted: employment history, professional references, criminal check, educational verification (i.e., degree, license, or official transcript) and physical exam and drug urinalysis test. Applicants will be required to pass required pre-employment checks to the satisfaction of University Enterprises Inc., ( UEI) and the hiring Agency or Department. </div> Work Schedule <div> Flexible, Monday through Friday from 8:00am to 5:00pm. Final schedule will be determined between student and supervisor. </div> Additional Work Schedule <p>Student Assistants and Graduate Student Assistants generally work up to 20 hours per work week (Sunday-Saturday) during the academic year and up to 40 hours per work week during breaks; (Winter, Spring and Summer).</p><p>Student Assistants are not permitted to telecommute or work remotely.</p> Area Sacramento On/Off Sacramento State Campus Off Campus Worksite City Sacramento Pay Range $14.00 - $17.00 per hour Department/Agency City of Sacramento (CitySac) Unit/Division Information Technology Project Description <div> The City of Sacramento Information Technology Department's mission: Ensure IT investments and strategic business technologies are customer focused, sound, and deliver the highest possible value to the City and its constituents. To learn more visit <span class=\"long-word\">http://www.cityofsacramento.org/Information</span>-Technology </div> Majors/Fields of Study Computer Information Systems, Computer Science and Engineering, Engineering, Mathematics, Mechanical Engineering Minimum Qualifications <div> - Understand and follow oral and written instructions.&nbsp; <br>- Learn and understand the operational characteristics of medium to large-scale enterprise, client/server, and network systems.&nbsp; <br>- Communicate effectively orally and in written format in a variety of situations.&nbsp; <br>- Reason logically, use a variety of techniques to resolve problems, manage time and resources, concurrently handle multiple assignments and work under strict deadlines.&nbsp; <br>- Establish and maintain effective working relationships with others.&nbsp; <br>- Familiarity with MS Office. </div> Prerequisites <div> Must be a college student attending classes during the regular term (Fall, Spring and Winter, if applicable), at an accredited college or university.&nbsp; <br><br>Students must be enrolled at a minimum in: six semester units or nine quarter units for undergraduate students; four semester units or six quarter units for graduate students.&nbsp; <br>&nbsp; <br>Students declared major must match the major(s) listed in the job posting. </div></div><div> Preferred Qualifications Duties and Responsibilities <div> Duties include:&nbsp; <br>- Endpoint support, troubleshooting, deployment, in Sacramento's south region.&nbsp; <br>- This includes computers, printers, mobile devices, general network troubleshooting, responding to requests via phone, email, and portal. </div> Physical Requirements <div> Sit for extended periods; frequently stand and walk; manual dexterity and hand-eye coordination; corrected hearing and vision to normal range; verbal communication; use of office equipment including computer workstations, telephones, calculators, copiers, printers, scanners, and fax machines, with or without a reasonable accommodation. </div> Working Conditions <div> Work is performed in an office environment. </div> Hours Per Week Students (part-time) 0-20 hours per week during the academic year, up to 40 hours per week during breaks; (Winter, Spring and Summer). (NSTU) Posting Date 09/02/2021 Closing Date 10/02/2021 Open Until Filled No Special Instructions to Applicant <div> Please complete all fields of the employment application. Include your educational history in the \"Educational Experience\" section and any employment history in the \"Employment Experience\" section of our application. </div> Quick Link for Internal Postings <span class=\"long-word\">https://ueijobs.peopleadmin.com/postings/19370</span> </div></div></div>"
    },
    {
        "position": "Strategic Student Program: Software Engineering Intern (MFE; Spring 2022; SISW-PLM)",
        "company": "Siemens Corp",
        "location": {
            "city": "Cypress",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/92f4556c4ac0ba95768e728c4dfb09b4?lvk=tkfbrsCxxBTc4nmE72kDUw.--MA4d2MmkZ",
        "posted": "2021-09-02T18:32:45.015Z",
        "lastScraped": "2021-09-03T18:32:45.015Z",
        "description": "<div><p>Siemens Digital Industries Software Strategic Student Program (SSP) Discover your career with us at Siemens Software! We are a leading global software company dedicated to the world of product lifecycle management; from computer aided design, to 3D modeling and simulation- helping innovative global manufacturers design better products, faster! With the resources of a large company, and the energy of a software start-up, we have fun together while creating a world class software portfolio. </p><p>Our culture encourages creativity, welcomes fresh thinking and focuses on growth, so our people, our business, and our customers can achieve their full potential. We're currently recruiting students for our Spring 2022 Strategic Student Program. Our intern and co-op positions will allow you to find a career path that most inspires you. </p><p>Here, you will apply your education to solve real-world problems, and turn theory into practice. At Siemens, our goal is to empower our students to become the next leaders of our company. We have positions available in software development, user experience, data management, technical marketing, engineering consulting, and research &amp; design innovation. </p><p>More information on our specific roles are included in this document. Baseline Requirements: Currently enrolled as an undergraduate student Minimum 3.0 GPA Authorized to work in the United States without the need for current or future sponsorship by the company Available to work in a part-time capacity (10-25 hours / week) and full-time in summer 2022 Preferred junior or senior status Perks: Victorious daily ping pong tournaments Paid volunteer time off Employee discounts at our top customer sites Networking with our global leaders Mentorship from senior engineers Individual career development planning Professional and technical workshops Energetic student community Leadership opportunities Potential for full time offers after university graduation and completion of the program Manufacturing Engineering Software (MFE) Software Engineer Intern Our NX CAM business unit, is developing the next generation of Manufacturing solutions. As a part of executing this vision, we are building automated toolpath generation systems that help our customers intuitively machine parts. </p><p>We are also working on improving the usability of the NX CAM software. NX CAM Toolpath generation software is used to drive CNC (Computer Numeric Control) machines. We are looking for a highly motivated and driven intern to help support our automation, tool path generation and architectural initiatives and develop prototypes. </p><p>You will be working in a lean-agile environment. Responsibilities and duties: Design, develop, modify and maintain the NX CAM Software Conduct research, design, prototype, and other exploration activities, as necessary Create and test the constituents of the features Test the solutions being created and/or evolved Collaborate with and support the Product Owner to create and refine user stories and acceptance tests Estimate the size and complexity of work Use pairing and other practices for frequent review Build Quality into all work/activities Continuously communicate/share to align expectations and to support a transparent and safe environment When coding, design and implementation best practices should be used to build high-quality components and solutions Equal to all others in the team, such that everyone's voice is heard. Self-organizing to benefit from the expertise within the team, whilst sharing/spreading that knowledge for the future benefit of the team Own, with the rest of the team, how the work gets done Organizational Requirements: GPA of a 3.0 or higher Experience in C/C++ programming, preferably in the Microsoft Visual Studio environment Eligible to work in the U.S. </p><p>without current or future sponsorship from the company Majoring in Computer Science, Computer Engineering, or related field Strong oral and written communications skills You get high fives if: You have experience working with CAD/CAM software (preferably NX) You have experience working effectively and collaborating in a diverse team You have Software development experience in agile environments (preferably SAFe) You have experience writing multi-threaded code You have a working knowledge of Machine Learning techniques You have development experience in Python or HTML and CSS Organization: Digital Industries Company: Siemens Industry Software Inc. Experience Level: Student (Not Yet Graduated) Job Type: Part-time temporary Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. </p><p>EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non-Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. </p><p>To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here.</p></div>"
    },
    {
        "position": "Student Employee",
        "company": "United States Steel",
        "location": {
            "city": "Granite City",
            "state": "IL",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/784efb0a07700916c28a956801ce28ce?lvk=-n_KfRnwbhqQiBjbphDYhg.--M9SHCfkdc",
        "posted": "2021-08-25T18:32:47.428Z",
        "lastScraped": "2021-09-03T18:32:47.428Z",
        "description": "<div><p>Job Description: This Intern will be invited to work part-time remotely during the academic year and full-time during the 2022 summer. <br><br>This Intern position will work within the Plant Process Control group and will afford the opportunity to apply educational experiences to real world industrial applications. Experiences are offered that encompass both existing system maintenance / enhancements, as well as ground up design, development and installation of new systems and processes, focused on productivity and quality improvements. Strong mentoring by seasoned Control Engineers ensures a mutually beneficial work experience. <br><br>Under supervised direction, the primary responsibilities include developing, testing, debugging, documenting, and maintaining software applications for use in the production environment. These applications are based on the client/server technology. A typical process application today, supports one or more user interfaces, connects to one or more database servers, and communicates with one or more process data servers. The role includes the design and development of database systems, user interfaces, process algorithms, reusable software modules, communications servers, and application specific code. The operating systems and tools utilized in this effort include OpenVMS, Windows, PLC's, DCS's, RDB, MS SQL, Oracle, Wonderware, OSISoft PI, Intellutions iFix, C language, .NET languages, FORTRAN, and PLC block and ladder logic. The successful candidate will be expected to take part in a cross functional team of management information systems, process control, and operations personnel in the development of a computer integrated manufacturing environment.<br><br>Requirements:<br> Candidates must be a full-time student pursuing a Bachelor's Degree or Master's Degree in Computer Science, Computer Management &amp; Information Systems, Computer Engineering, Electrical Engineering, or other IT related discipline. .<br> Candidates must be a current student and have completed their sophomore year by June 2021 and be in good academic standing.<br> Minimum 3.0 GPA<br> Be authorized to work in the US without sponsorship <br>Auto req ID: 10894BR <br>Requisition Type: US-Non-Exempt <br>Posting Title: IL - Student Intern Information Technology <br>State/Province: US - IL <br>Work Location - City: Granite City <br>Company Overview: Steel is essential to advancing modern society. In fact, countless aspects of our lives wouldn't be possible without it. From state-of-the-art household appliances and safer, more fuel-efficient automobiles - to steel framing that makes our homes stronger and tubular products that support the development of our nation's energy resources - our products build quality of life for people around the world. U. S. Steel is on an exciting transformational journey to become the iconic corporation - a company set apart from the competition through the talent of our people, the quality of our product, and the strength of our performance. We are seeking talented, motivated people to help us create the next generation of U. S. Steel, known for consistently out-performing the competition, delivering superior returns, and creating value for our customers as a world-class supplier of innovative steel products and solutions. <br>Preferred Skills: We are looking for motivated self-starters that can work in a fast paced, data-driven environment. The successful undergraduate will be an analytical problem solver, have an extremely high level of customer focus and a passion for process improvement. In addition, a successful intern will have:<br><br> Demonstrated outstanding academic achievement and an aptitude for your area of study<br> A strong record of team, project and/or people leadership in a work setting and/or extracurricular activities<br> A willingness to take initiative to understand the business<br> An aptitude for problem solving; strong writing and verbal communication skills<br> A strong commitment to excellence and to personal and professional growth<br> Must be resourceful, responsible, tenacious, curious, independent, confident and high energy<br> The ability to prioritize and manage multiple tasks. <br> Leadership and strong decision-making skills<br> Ability to think and act both strategically and tactically <br>Competency Summary: Think: Think Critically and Drive Change<br>Lead: Develop Talent and Collaborate <br>Do: Empower Performance and Deliver Results <br>Equal Employment Opportunity: U. S. Steel is a principled company committed to its core values of safety, diversity &amp; inclusion, environmental stewardship, results focus &amp; accountability. We focus on our customers, driving quality and ensuring cost effectiveness. We promote an environment of respect, transparency and collaboration - encouraging new ideas that drive innovation and our collective success. U. S. Steel is an Equal Opportunity Employer. It is our policy to provide equal employment opportunity (EEO) according to job qualifications without discrimination on the basis of race, color, religion, ancestry, national origin, age, genetics, sexual orientation, sex, gender identity, disability status or status as a protected Veteran or any other legally protected group status. <br>(California residents may visit <span class=\"long-word\">www.ussteel.com/CANotice</span> for information regarding collection of personal information and U. S. Steel's privacy practices.) <br>Job Category: Student Employment <br>Diversity Commitment: <b>UNITED BY STEEL</b> - We are committed to fostering an inclusive workplace culture and celebrate the diversity of our employees. We are all responsible to live these principles and lead by example as we prioritize the physical and psychological safety of every team member. <br></p></div>"
    },
    {
        "position": "Software Engineer Intern",
        "company": "Schweitzer Engineering Laboratories",
        "location": {
            "city": "Lynnwood",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/60a5006903873dd236584993cf359e41?lvk=nKnUC6JWUI14WRAyc8DUBQ.--M9aHoMzR3",
        "posted": "2021-08-26T18:32:49.414Z",
        "lastScraped": "2021-09-03T18:32:49.414Z",
        "description": "<div><div><p><b><i>Essential Duties and Responsibilities</i></b></p><ul><li>Develop tools to support SEL's software development processes.</li><li>Implement enhancements and fix defects in software products.</li><li>Create automated tests.</li><li>Participate in team code and test reviews.</li><li>Continuously identify, measure, and improve processes.</li><li>Follow and apply SEL Values, Principles of Operation, and World Class Manufacturing Principles.</li><li>Understand. Create. Simplify.</li><li>Other duties as assigned.</li></ul><p><b><i>Required Qualifications</i></b></p><ul><li>Current student pursuing a degree in computer science or equivalent with at least one year of technical coursework completed</li><li>Programming experience in C#, C++, Java or equivalent OO programming language</li><li>Strong writing, documentation, and speaking skills</li><li>Ability to learn new skills and assume new responsibilities</li><li>Ability to work cooperatively in a team environment</li><li>Background check results satisfactory to SEL</li><li>Negative drug test result(s)</li></ul><p><b><i>Preferred Qualifications</i></b></p><ul><li>Experience using scripting languages, such as Python, Javascript, Perl, Ruby</li><li>Practical knowledge of developing Windows or web applications</li><li>Knowledge of automated testing</li><li>Knowledge of SQL and database concepts</li><li>Experience using revision control and source code management systems such as Git, Mercurial, or SVN</li></ul><p></p><p><b><i>Physical Requirements</i></b></p><p>None</p><p></p><p><b><i>An Award-Winning Company</i></b></p><p>Schweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets in many different industries, markets, and geographies around the world.</p><p></p><p></p><p>SEL is an Equal Opportunity Employer: M/F/Vets/Disabled.</p></div></div>"
    },
    {
        "position": "Research & Development Intern",
        "company": "Mercer Foods, LLC.",
        "location": {
            "city": "Modesto",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/mercer-foods-llc-0192ef77/research-development-intern-b37da21a?lvk=xkQhCdLc71DIBIcCnSi2Dw.--M9ph4qnVg",
        "posted": "2021-08-25T18:32:52.336Z",
        "lastScraped": "2021-09-03T18:32:52.336Z",
        "description": "<div><div><p><strong>Job Title:</strong> Research &amp; Development Intern</p><p><strong>Department:</strong> Quality and R&amp;D</p><p><strong>Reports to: </strong> Supervisor</p><p><strong>Job Type: </strong>Hourly, Part - Time</p><p>The ideal candidate will possess and live by Mercer Foods core values.</p><p>CONTINUOUS IMPROVEMENT ● ACCOUNTABILITY ● INTEGRITY ● PERSONAL GROWTH AND WELLNESS ● </p><p>TEAMWORK ● WORK – LIFE BALANCE</p><p><br></p><p><strong>ESSENTIAL DUTIES &amp; RESPONSIBILITIES: </strong> The Research &amp; Development Intern will serve as a multifaceted member of the Research &amp; Development team. The Research &amp; Development Intern will assist in handling raw material, developing and maintaining the raw material and finished product specifications, maintaining work instructions, updating and maintaining drying ramp profiles, researching shelf life of the frozen and freeze-dried products, resolving drying related quality, production, and efficiency problems. Other duties as assigned. </p><p><strong>COMPETENCIES: </strong></p><p>Living Mercer Values  Demonstrates the characteristics and behaviors of an individual who is living Mercer's values. Mercer's values are accountability, continuous improvement, integrity, personal growth and wellness, teamwork, and work-life balance. </p><p>Attendance Attendance is essential in demonstrating dependability. A reliable team member is on time for all scheduled shifts and is present as scheduled. Any team member with two or more active steps of discipline for attendance does not meet expectations of position. </p><p>Performance Demonstrates the skills and abilities to perform his or her job. Any team member with two or more active steps of discipline for any combination of disciplinary actions does not meet expectations of position. </p><p>Safety Good judgement is demonstrated at all times to maintain a safe work environment. Any team member with two or more active steps of discipline for safety related incidents does not meet expectations of position. </p><p>Training Current training is an indication of job preparedness from a safety, job skills, and food safety perspective. An employee that has completed all training expectations throughout the year as it pertains to his or her job requirements demonstrates that he or she meets the expectations of his or her position. A person that has past due trainings does not meet the expectations of his or her position. </p><p><strong>SKILLS: </strong></p><p>Attention to Detail Completes tasks efficiently and accurately while paying close attention to detail.</p><p>Communication Possesses strong communication skills and can explain complex concepts in ways everyone can understand. Is often seen as having strong interpersonal skills.</p><p>Compliance Ensure compliance with Federal and State laws and regulations, and corporate <span class=\"long-word\">policies/processes.</span></p><p>Documentation Maintain proper documentation and records.</p><p>Individual Contributor Must be highly motivated and able to work independently</p><p>Integrity Maintain highest integrity with regard to the Company’s policies, procedures, practices, and data.</p><p>Microsoft Office Ability to use all MS applications such as Excel, Power Point, Outlook and Word. </p><p>Priorities Identifying and aligning priorities with business vision, mission, and values while achieving objectives.</p><p>Quality Standards Must be able to understand quality standards, methods, and reporting as required.</p><p>Relationships Works with all teams to maintain effective relationships.</p><p>System Management Manage data systems, to include developing and monitoring data entry, maintenance, tracking, reporting, and output.</p><p><strong>REQUIREMENTS: </strong> B.S in Food Science preferred. The position will require basic math, reading, and writing skills. Experience utilizing lab equipment in a food production environment (educational lab work is acceptable). Demonstrated ability to communicate orally and in written form effectively with co-workers and customers. Must have computer operation systems knowledge and expertise. </p><p><strong>FOOD SAFETY REQUIREMENTS: </strong></p><p>• Place high priority on food safety, quality, and sanitation by understanding and executing Mercer Food’s food safety and sanitation policies and procedures.</p><p>• Hold self and others accountable to Mercer Foods food safety &amp; sanitation guidelines and policies by communicating any food safety incident, observation, or opportunity to your leadership team or teammates. </p><p>• In the absence of QC Manager or QA Senior Manager, serves as back up to ensure all food safety, quality objectives and SQF system requirements are met. </p><p><strong>WORK ENVIRONMENT: </strong> The usual and customary methods of performing the job's functions require the following physical demands: occasional lifting, carrying, pushing, and/or pulling; occasional stooping, kneeling, crouching, and/or crawling; and frequent fine finger dexterity. Generally, the job requires the following percentages of time committed to physical activity: 50% or more sitting, 20% or more walking, and 20% or more standing. The job is performed under occasional temperature variations and in a food manufacturing production environment. This position requires the ability to travel internationally on an occasional basis. Unrestricted visual and audio abilities are required for the safety of all employees. The ability to lift to 40 lbs. is required.</p><p><br></p></div><br>Part time role working 4 hour shifts, 5 days a week. Days and hours are flexible.</div>"
    },
    {
        "position": "Intern - Asset Management, Preservation Equity Fund",
        "company": "WNC & Associates, Inc.",
        "location": {
            "city": "Irvine",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/wnc-associates-inc-a983ff26/intern-asset-management-preservation-equity-fund-c9010a1d?lvk=VaOCjqMx0vEMpIKbqhnHQA.--MA2idDWaV",
        "posted": null,
        "lastScraped": "2021-09-03T18:32:57.254Z",
        "description": "<div><p>WNC seeks an Intern for up to 30 hours per week to support the growing Asset Management team in Preservation Equity Fund (PEF). PEF is dedicated to preserving affordable housing through acquisition of existing apartment communities while in return, providing cash flow and appreciation to its investors. The Asset Management Intern will directly report to and assist the Director of Asset Management. The ideal candidate enjoys working with a team and has the desire to learn. </p><p></p><p><strong>Position Responsibilities:</strong></p><p><strong>Financial Statement Review: </strong>Review monthly financials for <span class=\"long-word\">inconsistencies/errors,</span> enter financials into proprietary database, and ensure proper income and expense allocation.</p><p><strong>Budget Variance:</strong> Review annual budget and compare management company budgets to underwriting projections. Enter budgets into proprietary database.</p><p><strong>Data Entry:</strong> Gather property specific information and enter data into proprietary database.</p><p><strong>Capital Improvements:</strong> Track progress and budgets for various projects.</p><p><strong>Ad Hoc Analysis</strong>: Complete various ad hoc reports and tasks for Preservation Equity Fund Team.</p><p></p><p><strong>Qualifications:</strong></p><p>Positive attitude and willingness to contribute to a team.</p><p>Must have the ability to multi-task and work in a fast-paced environment.</p><p>Strong computer skills and thorough knowledge of MS Excel &amp; Power Point.</p><p>Proficient oral and written communication skills.</p><p>Professional and courteous.</p><p></p><p><strong>Education &amp; Experience:</strong></p><p>Preferred areas of study for this internship are business, accounting, finance, or real estate.</p></div>"
    }
]