[
    {
        "position": "Software Testing Intern",
        "company": "phoenixNAP",
        "location": {
            "city": "Tempe",
            "state": "AZ",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/phoenixnap-b58ed511/software-testing-intern-d8e6c271?lvk=7_DU0DmUieQL4nTL5zKLbQ.--M4V6ZF79R",
        "posted": null,
        "lastScraped": "2021-06-24T10:55:37.346Z",
        "description": "<div><p>The Software Testing Intern will be responsible for the testing of product lines, reporting defects and for testing complex implementations of enterprise software. The enterprise components themselves are a black box, but how they interact requires a great deal of understanding of the business problems being solved.</p><p></p><p>Software Testing interns are responsible for writing and executing test plans and test cases. The ideal candidate will possess the flexibility to understand various nuances of software development &amp; testing; the ability to research issues; analysis capability on critical issues. The function heavily focuses on black-box test execution but may also include grey box and white box testing.</p><p></p><p><strong>Key Job Responsibilities</strong></p><ul><li>Perform multiple types of black-box and grey-box testing including functional, system, end to end, smoke, regression, and ad-hoc testing, both automated and manual testing</li><li>Submit comprehensive defects using our bug tracking system.</li><li>Regress and verify defects as needed.</li><li>Record results and provides metrics.</li><li>Analyze requirements and write test cases.</li><li>Assist with the design of test plans.</li></ul><p></p><p><strong>Key Qualifications</strong></p><ul><li>Studying for a university degree in Computer Sciences or related degree.</li><li>Basic understanding of programming concepts and best practices.</li><li>Experience using Linux/Unix/Windows OS.</li><li>Excellent oral and written communication skills in English.</li><li>A high degree of flexibility and creativity.</li><li>Ability to work independently with minimal supervision.</li><li>Ability to communicate effectively with all levels of <span class=\"long-word\">employees/management.</span></li><li>Ability to stay focused on the task at hand, ensuring that timelines are met.</li></ul><p></p><p>This is an exciting opportunity to work with a highly innovative and creative team, in a great working environment using the latest technologies, methodologies, and frameworks.</p></div>"
    }
]