[
    {
        "position": "Software Engineering Intern",
        "company": "Juniper Networks",
        "location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/abd08685594e1d89aa795e1c34bd80b1?lvk=Le3ASBf6z6UBgZX2TzuDAQ.--LxTS8MmtZ",
        "posted": "2021-03-12T23:03:52.820Z",
        "lastScraped": "2021-03-15T23:03:52.820Z",
        "description": "<div><div><p>Seeking a highly motivated hands-on&nbsp;coder&nbsp;with strong&nbsp;interest in&nbsp;testing Juniper Networks routers and switches.&nbsp;This intern will help develop test automation suites&nbsp;to&nbsp;execute test cases.&nbsp;</p><p>&nbsp;</p><p>The candidate must be able to demonstrate strong proficiency in one or more of the following areas:&nbsp;</p><p>&nbsp;</p><ul><li><p>Programming Skills in Shell Scripts and Python&nbsp;</p></li><li><p>Networking knowledge in TCP/IP and basic routing protocol&nbsp;</p></li><li><p>Fluency&nbsp;in Windows, UNIX and Linux operating systems&nbsp;&nbsp;</p></li></ul><p>&nbsp;</p><p>In addition:&nbsp;</p><p>&nbsp;</p><ul><li><p>The candidate must possess outstanding problem-solving skills.&nbsp;&nbsp;</p></li><li><p>The candidate must possess excellent communication skills, both verbal and written.&nbsp;&nbsp;</p></li></ul><p>&nbsp;</p><p>Minimum Qualification:&nbsp;</p><p>&nbsp;</p><p>Candidate must be currently enrolled in a bachelor/master's program (EE,&nbsp;CS, or CE&nbsp;degree preferred) and returning to school following completion of the summer internship.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>Juniper's University Talent Program (UTP)&nbsp;introduces next generation talent to Juniper's workforce and provides talented students with an opportunity to develop professional experience at a world-class technology company. And it's not hard to see why so many accomplished students have been compelled to spend their summers at Juniper!&nbsp;</p><p>&nbsp;</p><p>Here at Juniper,UTP provides a comprehensive&nbsp;program that fosters professional as well as&nbsp;personal growth, thoroughly preparing its interns for the next step in their careers. Juniper internships are project-based, allowing interns to solve important problems, make lasting impacts on their teams, and contribute to the company's overall objectives. They are mentored by some of the most talented and skillful innovators in the industry; they connect with transformative thought leaders who promote disruptive ideas in their field.&nbsp;Interns participate in constructive professional&nbsp;workshops, company-wide community service&nbsp;initiatives, and executive speaker series.They build lasting friendships, expand their network, and connect with colleagues from around the world.&nbsp;&nbsp;</p><p>&nbsp;</p><p>At Juniper Networks, you will not only have opportunities to build real-life, hands-on work experience - you'll also have the chance tolearn from the bestand lay the groundwork for a successful career.&nbsp;</p><p>&nbsp;</p><p>Please note that Juniper's 2021 internship program will be conducted remotely. The location listed reflects the location of the team the intern will join, whereas the intern will work from their residence in the US.&nbsp;</p><p>&nbsp;</p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Envestnet",
        "location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/5047bf26b0667aaacb2c4dbe0aed900e?lvk=4wG56K2_ghgBQS-rmznZBg.--Lw3-EPdas",
        "posted": "2021-02-23T23:03:54.641Z",
        "lastScraped": "2021-03-15T23:03:54.641Z",
        "description": "<div><div><p>It's fun to work in a company where people truly BELIEVE in what they're doing!</p><p></p><p><i>We're committed to bringing passion and customer focus to the business.</i></p><p></p><p></p><p><b>Job Description Summary:</b></p><p></p><p></p><p></p>Envestnet is a leading independent provider of technology-enabled, web-based investment solutions and services to financial advisors. Our mission is to help investors achieve their financial goals, by providing financial advisors the access, tools, and support they need to deliver excellence in wealth management. <br><br>The Envestnet Summer Internship is a full-time internship program designed for qualified college students to gain hands on experience within the Envestnet \"location\" Office. Interns will work alongside various department experts and collaborate with fellow Envestnet interns on a project presented to leaders in the company. <br><br>The Summer Internship program will run from June 2, 2021 through August 6, 2021.<p></p><p></p><p></p><p><b>Job Description:</b></p><p></p><p></p><p></p><p><b>Essential Duties and Responsibilities</b></p><p>You will join an agile software development team supporting the Tamarac Trading product. You will collaborate with mentors on the team to deliver high quality software used by over 3000 financial firms managing over $1.2 trillion in assets.</p><p></p><p>Tamarac Trading is used by financial advisors to manage client portfolios and rebalance to their financial wellness strategy. This tax aware platform processes over 500,000 trades weekly - making quality, scalability, and performance paramount.</p><p></p><p>You will:</p><ul><li>Participate in daily software scrum team activities.</li><li>Collaborate with a scrum team on feature development working in a .NET environment.</li><li>Develop test cases and implement test automation.</li><li>Participate in design, code, and test case reviews.</li></ul><p></p><p><b>Knowledge, Skills, and Abilities</b></p><p>Basic Qualifications</p><ul><li>Knowledge of programming languages such as Java or C#.</li><li>Knowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving, and complexity analysis.</li><li>Ability to effectively articulate technical challenges and solutions.</li></ul><p></p><p>Preferred Qualifications</p><ul><li>Experience with distributed, multi-tiered web applications, algorithms, and relational databases.</li><li>Experience in development tools such as Visual Studio and GIT.</li><li>Adept at handling ambiguous or undefined problems as well as ability to think abstractly.</li></ul><p></p><p><b><span class=\"long-word\">Education/Experience</span></b></p><ul><li>Currently enrolled in a Bachelor's or Master's Degree in Computer Science, Computer Engineering, or related field at time of application.</li></ul><p></p><p><b>NOTE: </b><i>This is intended to describe the general content of and qualifications for the job. It is not intended as an exhaustive statement of all functions, duties, or desired qualifications.</i></p><p></p><p><b>Envestnet is an Equal Opportunity Employer</b></p><p></p><p></p><p></p><p></p><p></p><p></p><p><i>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!</i></p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Synopsys",
        "location": {
            "city": "Hillsboro",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d911a0caa123b31b7d48ef9ef1ea14f6?lvk=461qmXh-bspIHzARfh_oYA.--LxC_mEcqZ",
        "posted": "2021-02-25T23:03:56.258Z",
        "lastScraped": "2021-03-15T23:03:56.258Z",
        "description": "<div><p>Requisition Number: 29131BR <br>Job Description and Requirements: As an intern at Synopsys, you will have the opportunity to gain hands-on experience while working alongside industry professionals. You will build and refine skills relevant to your major and future career. The Synopsys intern program emphasizes integrating our interns, allowing you to work hand-in hand with mentors and colleagues on your team. Your contributions will be invaluable to the company and products, guaranteeing you a fulfilling internship that you can proudly bring back to your courses.<br><br>This internship in is Full Time 40 hours/week and will ideally start in May 2021 and last for the duration of 3 months.<br><br><b>What you'll learn and do: </b><br>This technical intern will learn application of SAT solvers as part of developing a new method for optimization of Boolean variables. The intern will research state-of-the-art solutions for Boolean optimization and apply them in C++.<br><br><b>Skill Requirements:</b><br>C++, SAT Solvers<br><br><b>Education Qualifications: </b><br>All interns must be currently enrolled in an accredited educational institution.&nbsp; Pursuing MS.<br><br>Our Silicon Design &amp; Verification business is all about building high-performance silicon chips-faster. We're the world's leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance-eliminating months off their project schedules.<br><br>At Synopsys, we're at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we're powering it all with the world's most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.<br><br><strong>Inclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.</strong><br><br>&nbsp; <br>Business Title: Software Engineering Intern <br>Hiring Location: USA - California - Mountain View/Sunnyvale, USA - Oregon - Hillsboro <br>Hire Type: Intern <br>Job Category: Interns/Temp <br>Country: United States <br></p></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Experian",
        "location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/27a4dfb334208cd33909714e7a412929?lvk=MUzrz8j3OeoZNCSWrccIRw.--LxThe2uTV",
        "posted": "2021-03-12T23:03:57.725Z",
        "lastScraped": "2021-03-15T23:03:57.725Z",
        "description": "<div><div><p>Experian is very excited to share this internship opportunity with you. We are looking for someone<i>who can start immediately, even if only part time while you are still in classes</i>. Then in the summer you could work full-time hours. <i>About us, but we'll be brief</i> Experian is the world's leading global information services company, unlocking the power of data to transform lives and create opportunities for consumers, businesses and society. We're investing in the future, through new technologies, talented people and innovation so we can help create a better tomorrow. We embrace our diversity yet share similar values and growth mindsets. We are thrilled to share that<i>FORTUNE</i>has named**Experian one of the***100 Best Companies to Work For<i>. In addition, for the last five years we've been named in the</i>100 \"World's Most Innovative Companies\" by Forbes Magazine<i>. </i>What you'll be doing* Experian is seeking a Software Engineering intern that wants to develop their skills and have an opportunity to work with the latest technologies and data architectures. While this is a fairly general job description to start, we'll certainly have defined projects by the time you are ready to start with us. It's safe to say that you'll be exposed to microservices architecture, hybrid cloud environments, Big Data architecture, Java microservices, streaming services like Kafka, etc.</p><p><i>What your background looks like</i> <i> Currently enrolled or just completed Bachelor of Science degree in Computer Engineering, Computer Science, Software Engineering, or related field. </i> Knowledge of one or more programming languages and operating environments. <i> Knowledge of software development and project management methodologies. </i> You have experience writing code in Java or Python * You are curious and you can't wait to learn new <span class=\"long-word\">technologiesExperian</span> is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOUand it ensures that we live what we believe.</p><p><strong>Job:</strong> **Product Development*</p><p><strong>Organization:</strong> **CIS*</p><p><strong>Title:</strong> <i>Software Engineering Intern </i></p><p><strong>Location:</strong> <i>California-San Jose</i></p><p><strong>Requisition ID:</strong> <i>211560</i></p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "PlayStation",
        "location": {
            "city": "San Francisco",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/playstation-40577ddd/software-engineering-intern-3fbf98bb?lvk=MuSFWlQR9fD3kbkLaPBtBg.--Lx6ClMj7c",
        "posted": "2021-03-06T23:03:59.481Z",
        "lastScraped": "2021-03-15T23:03:59.481Z",
        "description": "<div><div><p>PlayStation isn't just the Best Place to Play —it's also the Best Place to Work. We've thrilled gamers since 1994, when we launched the original PlayStation. Today, we're recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.</p><p></p></div><p>PlayStation isn't just the Best Place to Play —it's also the Best Place to Work. We've thrilled gamers since 1994, when we launched the original PlayStation. Today, we're recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.</p><p></p><p>PlayStation isn't just the Best Place to Play —it's also the Best Place to Work. We've thrilled gamers since 1994, when we launched the original PlayStation. Today, we're recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.</p><p>This internship is for Summer 2021.</p><p><strong>Software Engineering Intern</strong><strong>Software Engineering Intern</strong></p><p><strong>San Francisco, CA</strong><strong>San Francisco, CA</strong></p>Responsibilities:<p>As a Software Engineering Intern, you will design and code PlayStation-side software components, systems, and features. You will handle individual project priorities, deadlines, and deliverables. You will adhere to standardized design techniques and coding standards in order to improve, test, and deploy our software.</p>Qualifications:<ul><li>Pursuing a Bachelor's or Master's degree in Computer Science (or related field) and/or within 1 year of their post-graduation date</li><li>You have demonstrated success in partnering and collaborating with other members</li><li>Highly motivated with outstanding verbal and written communication skills and not afraid to ask for help/seek knowledge</li><li>Working experience building distributed and scalable software</li><li>You have built software using Java, Go, Kotlin or similar languages</li><li>You have proven understanding of service oriented architecture and familiarity with microservices architecture</li><li>You have knowledge of different data storage technologies like Cassandra, Couchbase etc</li><li>Knowledge of virtualization technologies like Docker and Kubernetes</li><li>You have a good understanding of public cloud design like AWS or GCE</li></ul><ul><li>Pursuing a Bachelor's or Master's degree in Computer Science (or related field) and/or within 1 year of their post-graduation date</li><li>You have demonstrated success in partnering and collaborating with other members</li><li>Highly motivated with outstanding verbal and written communication skills and not afraid to ask for help/seek knowledge</li><li>Working experience building distributed and scalable software</li><li>You have built software using Java, Go, Kotlin or similar languages</li><li>You have proven understanding of service oriented architecture and familiarity with microservices architecture</li><li>You have knowledge of different data storage technologies like Cassandra, Couchbase etc</li><li>Knowledge of virtualization technologies like Docker and Kubernetes</li><li>You have a good understanding of public cloud design like AWS or GCE<p>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.</p><p>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.</p><p>We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.</p><p></p><div><p>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.</p><p>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.</p><p>We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.</p><p><strong>PRIVACY NOTICE TO SIE LLC'S JOB APPLICANTS</strong></p><p>This Privacy Notice explains what personal information we at Sony Interactive Entertainment LLC collect from you, and why we collect it and use it. This Notice covers our practices regarding the personal information of all applicants to our job positions. Please review it carefully.</p><p><strong>Categories of personal information we collect from you</strong></p><p>We collect personal information about you throughout the recruiting process, in particular the following categories. Generally, we obtain this information through our Recruiting Team:</p><p><strong><em>A. Identification and contact information</em></strong></p><ol><li><ol><li>Direct identifiers such as your first and last name.</li><li>Indirect identifiers such as a government ID, your Social Security, work permit or passport #.</li><li>Contact information such as your email address, mailing address, telephone number.</li></ol></li></ol><p></p><p><strong><em>B. Other information about you or that can be associated with you such as:</em></strong></p><ol><li><strong><em><span class=\"long-word\">Sensitive/Protected</span> Data. </em></strong>During the recruitment process, you may (voluntarily) provide us with your ethnicity, gender, military service information, or physical or mental health information, as well as your national origin and citizenship.</li><li><strong><em>Professional or job position-related information</em></strong>, including your past professional experience, references; background verification; talent management and assessment; information regarding any conflicts of interests; and the terms and conditions of your job offer.</li><li><strong><em>Non-public education information</em></strong>, including information about your education records, such as grades and transcripts.</li></ol><p></p></div><p></p><p>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.</p><p>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.</p><p>We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.</p><p><strong>PRIVACY NOTICE TO SIE LLC'S JOB APPLICANTS</strong><strong>PRIVACY NOTICE TO SIE LLC'S JOB APPLICANTS</strong></p><p>This Privacy Notice explains what personal information we at Sony Interactive Entertainment LLC collect from you, and why we collect it and use it. This Notice covers our practices regarding the personal information of all applicants to our job positions. Please review it carefully.</p><p><strong>Categories of personal information we collect from you</strong><strong>Categories of personal information we collect from you</strong></p><p>We collect personal information about you throughout the recruiting process, in particular the following categories. Generally, we obtain this information through our Recruiting Team:</p><p><strong><em>A. Identification and contact information</em></strong><strong><em>A. Identification and contact information</em></strong><em>A. Identification and contact information</em></p><ol><li><ol><li>Direct identifiers such as your first and last name.</li><li>Indirect identifiers such as a government ID, your Social Security, work permit or passport #.</li><li>Contact information such as your email address, mailing address, telephone number.</li></ol></li></ol><p></p></li><li><ol><li>Direct identifiers such as your first and last name.</li><li>Indirect identifiers such as a government ID, your Social Security, work permit or passport #.</li><li>Contact information such as your email address, mailing address, telephone number.</li></ol><ol><li>Direct identifiers such as your first and last name.</li><li>Indirect identifiers such as a government ID, your Social Security, work permit or passport #.</li><li>Contact information such as your email address, mailing address, telephone number.</li></ol></li><li>Direct identifiers such as your first and last name.</li><li>Indirect identifiers such as a government ID, your Social Security, work permit or passport #.</li><li>Contact information such as your email address, mailing address, telephone number.<p><strong><em>B. Other information about you or that can be associated with you such as:</em></strong><strong><em>B. Other information about you or that can be associated with you such as:</em></strong><em>B. Other information about you or that can be associated with you such as:</em></p><ol><li><strong><em><span class=\"long-word\">Sensitive/Protected</span> Data. </em></strong>During the recruitment process, you may (voluntarily) provide us with your ethnicity, gender, military service information, or physical or mental health information, as well as your national origin and citizenship.</li><li><strong><em>Professional or job position-related information</em></strong>, including your past professional experience, references; background verification; talent management and assessment; information regarding any conflicts of interests; and the terms and conditions of your job offer.</li><li><strong><em>Non-public education information</em></strong>, including information about your education records, such as grades and transcripts.</li></ol><p></p></li><li><strong><em><span class=\"long-word\">Sensitive/Protected</span> Data. </em></strong>During the recruitment process, you may (voluntarily) provide us with your ethnicity, gender, military service information, or physical or mental health information, as well as your national origin and citizenship.<strong><em><span class=\"long-word\">Sensitive/Protected</span> Data. </em></strong><em><span class=\"long-word\">Sensitive/Protected</span> Data. </em></li><li><strong><em>Professional or job position-related information</em></strong>, including your past professional experience, references; background verification; talent management and assessment; information regarding any conflicts of interests; and the terms and conditions of your job offer.<strong><em>Professional or job position-related information</em></strong><em>Professional or job position-related information</em></li><li><strong><em>Non-public education information</em></strong>, including information about your education records, such as grades and transcripts.<strong><em>Non-public education information</em></strong><em>Non-public education information</em></li></ul></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "CDK",
        "location": {
            "city": "Portland",
            "state": "OR",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/08dcc37b45dd3a3fe799db03fd77b11c?lvk=7s04uJsk_XO9tW1q1q8vvg.--Lx7XJIYTJ",
        "posted": "2021-03-09T23:04:01.467Z",
        "lastScraped": "2021-03-15T23:04:01.467Z",
        "description": "<div><div><p><strong>Power the Possibilities</strong><br>The CDK Global technology team is looking for collaborative innovators who are passionate about making their mark on emerging enterprise software products. We’re building and developing cloud technology for the automotive retail industry<br>that will change the landscape for automotive dealers, original equipment manufacturers (OEMs) and the customers they serve.<br><br><strong>Be Part of Something Bigger</strong><br>Each year, more than three percent of the U.S. gross domestic product (GDP) is attributed to the auto industry, which flows through our customer, the auto dealer. It’s time you joined an evolving marketplace where research and development<br>investment is measured in the tens of billions. It’s time you were a part of something bigger.<br><br>We’re expanding our workforce – engineers, architects, developers and more – onboarding early adopters who can optimize, pivot and keep pace with ever-evolving development roadmaps and applications.<br><br><strong>Join Our Team</strong><br>Growth potential, flexibility and material impact on the success and quality of a next-gen, enterprise software product make CDK an excellent choice for those who thrive in challenging, fast-paced engineering environments.<br>The possibilities for impact are endless. We have exceptional opportunities to evolve our industry by driving change through new technology.</p><p><br>If you’re ready for high-impact, you’re ready for CDK.</p><p><strong>CDK Global</strong><strong>Stability meets</strong><strong>Agility</strong>. CDK is the largest technology provider to the automotive industry, with more than 26,000 dealer sites in over 100 countries and nearly 10,000 employees worldwide. We're hiring to support your growth and ours.</p><p></p><p>As a<strong>Software Engineering Intern</strong>, you will help engineer the next generation of enterprise-class software solutions at CDK utilizing a broad range of the latest technologies. Your primary responsibilities will include development of platform, applications, services, quality assurance, and <span class=\"long-word\">infrastructure/devops</span> components. We will provide hands-on technical experience and an opportunity to work with other team members, architects and product owners in the early and continuous delivery of high-quality software products.</p><p></p><p><strong>Requirements:</strong></p><ul><li>Actively enrolled in a Bachelor's or Master's Computer Science/Computer Engineering degree program</li><li>Anticipated graduation date after December 2021</li><li>Software skills and a passion to develop them</li><li>A great attitude</li><li>Drive to learn and innovate</li><li>Ability to participate in a summer internship program of 10+ weeks (June-August)</li></ul><p></p><p><strong>What We Offer You:</strong></p><p></p><ul><li>Dedicated mentor and a community of encouragement &amp; support</li><li>Exposure to development process in a professional environment</li><li>Planned social &amp; volunteer activities to enhance your summer experience</li></ul><p>&nbsp;</p><p>CDK Global knows you have passions outside of work. &nbsp;You have family, friends, sporting events, and lots of things going on. &nbsp; That’s why we offer a comprehensive benefits package to not only take care of you but your family as well. &nbsp; All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few.</p><p>At CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives&nbsp;they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status.&nbsp;&nbsp;</p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "METER Group",
        "location": {
            "city": "Pullman",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/meter-group-83d487a5/software-engineering-intern-2d75edfa?lvk=y-jhJUFbGzVU-iHPZq7F4Q.--LxViy1XmF",
        "posted": "2021-02-25T23:04:02.981Z",
        "lastScraped": "2021-03-15T23:04:02.981Z",
        "description": "<div><p>METER is seeking a part-time Software Engineering Intern to support its Food Science Division. The successful candidate will be pursuing a degree in computer science or a related field at a local university within 50 miles of Pullman, WA. The Software Engineering Intern will champion a number of small projects under the supervision of the Director of Food Science Products and a mentor who is a seasoned software engineer. The duration of the internship will be at least three months. </p><p>Responsibilities:</p><ul><li>Design and implement systems using Python.</li><li>Create and maintain documentation.</li><li>Test systems for bugs.</li><li>Collaborate and communicate with coworkers in software, internal development partners, and at times external development partners regarding project progress, and issue resolution.</li></ul><p>Minimum Qualifications:</p><ul><li>At least a junior at a local university studying computer science or a similar field (candidates not located within the area won't be considered).</li><li>Experience with Python programming (a coding test will be required during the interview process).</li><li>Demonstrated problem solving ability. </li><li>Strong academic and/or professional references will be required.</li><li>Background check results satisfactory to METER.</li></ul><p>Preferred Qualifications:</p><ul><li>Experience with git version control.</li><li>Familiarity with scrum or agile development methodologies. </li></ul><p><strong>To Apply for This Position:</strong></p><p>We ask all applicants to apply through our website at <span class=\"long-word\">https://metergroup.applicantpro.com/jobs/.</span> If your interests, qualifications, and experience match any of our openings please apply for that position so that you are considered immediately. You may also subscribe at our careers page so that we email you when we have openings in your area of interest.</p><p>METER is an Equal Opportunity Employer. All qualified applicants are considered regardless of ethnicity, nationality, gender, veteran or disability status, religion, age, sexual orientation or gender identity, or other protected status.</p><br><br><b><i>Job Posted by ApplicantPro</i></b><br></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "CDK",
        "location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/f3e5bb7d02ca7f6dd64ae83995bd2f98?lvk=be7nJRLnb9FdLjaIVkf1Ig.--LxIPpiZso",
        "posted": "2021-03-08T23:04:04.806Z",
        "lastScraped": "2021-03-15T23:04:04.806Z",
        "description": "<div><div><p><strong>Power the Possibilities</strong><br>The CDK Global technology team is looking for collaborative innovators who are passionate about making their mark on emerging enterprise software products. We’re building and developing cloud technology for the automotive retail industry<br>that will change the landscape for automotive dealers, original equipment manufacturers (OEMs) and the customers they serve.<br><br><strong>Be Part of Something Bigger</strong><br>Each year, more than three percent of the U.S. gross domestic product (GDP) is attributed to the auto industry, which flows through our customer, the auto dealer. It’s time you joined an evolving marketplace where research and development<br>investment is measured in the tens of billions. It’s time you were a part of something bigger.<br><br>We’re expanding our workforce – engineers, architects, developers and more – onboarding early adopters who can optimize, pivot and keep pace with ever-evolving development roadmaps and applications.<br><br><strong>Join Our Team</strong><br>Growth potential, flexibility and material impact on the success and quality of a next-gen, enterprise software product make CDK an excellent choice for those who thrive in challenging, fast-paced engineering environments.<br>The possibilities for impact are endless. We have exceptional opportunities to evolve our industry by driving change through new technology.</p><p><br>If you’re ready for high-impact, you’re ready for CDK.</p><p><strong>CDK Global</strong><strong>Stability meets</strong><strong>Agility</strong>. CDK is the largest technology provider to the automotive industry, with more than 26,000 dealer sites in over 100 countries and nearly 10,000 employees worldwide. We're hiring to support your growth and ours.</p><p></p><p>As a<strong>Software Engineering Intern</strong>, you will help engineer the next generation of enterprise-class software solutions at CDK utilizing a broad range of the latest technologies. Your primary responsibilities will include development of platform, applications, services, quality assurance, and <span class=\"long-word\">infrastructure/DevOpscomponents.</span> We will provide hands-on technical experience and an opportunity to work with other team members, architects and product owners in the early and continuous delivery of high-quality software products.</p><p></p><p><strong>Requirements:</strong></p><ul><li>Actively enrolled in a Bachelor's or Master's Computer Science/Computer Engineering or Management Information Systems degree program</li><li>Anticipated graduation date after December 2021</li><li>Technical skills (REST API's, react, node.js, java, bash commands and scripts) and a passion to develop them</li><li>An understanding of GIT (github or bitbucket)</li><li>A great attitude</li><li>Drive to learn and innovate</li><li>Ability to participate in a summer internship program of 10+ weeks (June-August)</li></ul><p></p><p><strong>What We Offer You:</strong></p><p></p><ul><li>Dedicated mentor and a community of encouragement &amp; support</li><li>Exposure to development process in a professional environment</li><li>Planned social &amp; volunteer activities to enhance your summer experience</li></ul><p>&nbsp;</p><p>CDK Global knows you have passions outside of work. &nbsp;You have family, friends, sporting events, and lots of things going on. &nbsp; That’s why we offer a comprehensive benefits package to not only take care of you but your family as well. &nbsp; All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few.</p><p>At CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives&nbsp;they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status.&nbsp;&nbsp;</p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Fortive Corporation",
        "location": {
            "city": "Everett",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/d2701aa477527f1ca5b6461666da6470?lvk=eUrcpoUJSHzQ9dbp8uyGcQ.--LxClrA3_g",
        "posted": "2021-03-01T23:04:06.207Z",
        "lastScraped": "2021-03-15T23:04:06.207Z",
        "description": "<div><div><p>The software team at Fluke Calibration is looking for a front end or full stack software developer intern to join one of our software teams delivering game changing solutions for our industry. If you are looking for an opportunity to learn how large-scale client-server projects are being developed in serverless architecture and want to roll up your sleeves to also help, then this might be the position for you.</p><p> We are looking for developer interns to join our team and contribute to our SAAS projects delivering Calibration and Thermal Imaging software platforms. We leverage AWS serverless infrastructure and React/Redux, Node and Python in our front and backends. Our teams function in an Agile development environment, and leverage our Fortive Business Systems toolkits in a rapid iteration release cycle.</p><p> Responsibilities:</p><p> Contribute to our highly scalable React front-end integrated with our AWS micro-services stack</p><p>Contribute towards internal tools for analytics, tracking, marketing and support</p><p>Work with the Product and Test teams to help deliver on 2 week sprint cycles</p><p> + Working towards a degree in Computer Science, Information Systems, Computer Engineering, Software Engineering, Mathematics or equivalent technical degree</p><p> + For Front End devs: Some experience building web UI's utilizing React</p><p> + For Full Stack devs: Some experience using Node for server side development</p><p> + AWS knowledge is a huge plus</p><p> + Ability to perform in an Agile team environment</p><p> + Ability to work in a fast-paced environment, both independently and in a team</p><p> Fortive is a diversified industrial growth company comprised of global businesses that are recognized leaders in attractive markets. With more than $6 billion in annual revenues, Fortive's well-known brands hold leading positions in field instrumentation, transportation, sensing, product realization, automation and specialty, and franchise distribution.</p><p> Fortive is headquartered in Everett, Washington and employs a team of more than 24,000 research and development, manufacturing, sales, distribution, service and administrative employees in more than 40 countries around the world. Our team grows by tackling challenges that accelerate progress and further their careers. With a culture rooted in continuous improvement, the core of our company's operating model is the Fortive Business System. For more information please <span class=\"long-word\">visit:www.fortive.com.</span></p><p>Fluke is leading the world in creating software, test tools and technology that will support customers today and in the future. We are a customer-obsessed market leader with a strong reputation for reliability, quality and safety.</p><p> A wholly owned subsidiary of Fortive Corporation (www.fortive.com), Fluke is a global corporation headquartered in the greater Seattle area. Driven by the successful Fortive Business System, Fluke offers the passion of a startup with the resources of a Fortune 500 company. We are focused on the growth of our individual employees, teams and the Fluke brand. \"The company in which you have expressed employment interest is a subsidiary or affiliate of Fortive Corporation. The subsidiary or affiliate is referred to as a Fortive Company. Fortive Corporation and all Fortive Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, ancestry, sex (including pregnancy, childbirth and related medical conditions), age, marital status, disability, veteran status, citizenship status, sexual orientation, gender identity or expression, and other characteristics protected by law. The \"EEO is the Law\" poster is available at: <span class=\"long-word\">http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf.</span> Individuals who need a reasonable accommodation because of a disability for any part of the employment process should call 1-866-272-5573 or e-mail <span class=\"long-word\">applyassistance@fortive.com</span> to request accommodation.\"</p></div></div>"
    },
    {
        "position": "Software Engineering Intern",
        "company": "Fluke",
        "location": {
            "city": "Everett",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/21e4e4f79e42c673c6da4a12ca753031?lvk=MdID2rLXaXYDbIULtYfhgw.--LxFd7NpjF",
        "posted": "2021-02-19T23:04:07.562Z",
        "lastScraped": "2021-03-15T23:04:07.562Z",
        "description": "<div><div><p>The software team at Fluke Calibration is looking for a front end or full stack software developer intern to join one of our software teams delivering game changing solutions for our industry. If you are looking for an opportunity to learn how large-scale client-server projects are being developed in serverless architecture and want to roll up your sleeves to also help, then this might be the position for you.</p><p>We are looking for developer interns to join our team and contribute to our SAAS projects delivering Calibration and Thermal Imaging software platforms. We leverage AWS serverless infrastructure and React/Redux, Node and Python in our front and backends. Our teams function in an Agile development environment, and leverage our Fortive Business Systems toolkits in a rapid iteration release cycle.&nbsp;</p><p>Responsibilities:&nbsp;<br> &nbsp;&nbsp; &nbsp;Contribute to our highly scalable React front-end integrated with our AWS micro-services stack<br> &nbsp;&nbsp; &nbsp;Contribute towards internal tools for analytics, tracking, marketing and support<br> &nbsp;&nbsp; &nbsp;Work with the Product and Test teams to help deliver on 2 week sprint cycles<br> &nbsp;</p><ul><li>Working towards a degree in Computer Science, Information Systems, Computer Engineering, Software Engineering, Mathematics or equivalent technical degree</li><li>For Front End devs: Some experience building web UI's utilizing React</li><li>For Full Stack devs: Some experience using Node for server side development</li><li>AWS knowledge is a huge plus</li><li>Ability to perform in an Agile team environment </li><li>Ability to work in a fast-paced environment, both independently and in a team</li></ul></div></div>"
    }
]