[
    {
        "position": "Software Engineer",
        "company": "Experis",
        "location": {
            "city": "Sacramento",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/experis-8022b001/software-engineer-adc47e08?lvk=XeXciOxTQtVeCpOcY59yYQ.--M2huNfrjg",
        "posted": "2021-06-01T21:16:10.474Z",
        "lastScraped": "2021-06-06T21:16:10.474Z",
        "description": "<div><p><br> Immediate 6 month contract for Software Engineer with expertise in C#, SQL and strong knowledge of database design and programming and data migration. Responsibilities include analyzing, modifying, enhancing, testing and debugging existing database structures, systems, and programs to meet user needs and/or system design changes; analyze problems and make modifications to systems and individual programs; preserve the performance and integrity of data. Strong knowledge of API documentation frameworks required and experience with Azure or AWS is desired.<br><br> Requirements:<br> B.S. Degree in Computer Science<br> 5+ years of software development experience<br> Expertise in C# and SQL<br> Extensive experience working with data management and relational databases including data modeling, normalization, mining, warehousing, and security<br> AWS or Azure experience highly desired</p></div>"
    },
    {
        "position": "Software Development Engineer, Web Platforms",
        "company": "Ardor Digital Inc",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/ardor-digital-inc-a03d3de4/software-development-engineer-web-platforms-07e9e16a?lvk=VpGwuUzoqOi98ASfxdkmuw.--M339uY0_V",
        "posted": "2021-06-06T21:16:24.882Z",
        "lastScraped": "2021-06-06T21:16:24.882Z",
        "description": "<div><p><strong>Job Summary &amp; Responsibilities</strong></p><p>The <strong>Software Development Engineer, Web Platforms</strong> will help develop the next generation of Motor Trend Group’s platforms for Motortrend.com and key brands. The Software Engineer will be contributing to the implementation of front-end and content management for problems of scale on the platform. Essential duties and responsibilities include but not limited to:</p><ul><li>Architect and implement applications for problems of scale.</li><li>Provide technical expertise and troubleshooting</li><li>Collaborate with other teams on prioritizing roadmap initiatives and providing estimations.</li><li>Contribute significantly to a software project and planning efforts.</li><li>Consult and lead on overall software architecture and strategy and drive high-impact decisions.</li><li>Enforce standards, best practices, and modern development conventions.</li></ul><p><br>The ideal candidate has a track record of having built multiple high-performance, stable, scalable systems that have been successfully shipped to customers in production. You are a key influencer in your team’s strategy and contribute significantly to team planning. You show good judgment making trade-offs between immediate and long-term business needs.</p><p><strong><span class=\"long-word\">Education/Experience:</span></strong></p><ul><li>BA/BS in a Computer Science or related technical field, or equivalent professional experience.</li><li>5-7 years of experience in a software engineer/developer-related position, building applications for enterprise customer-facing solutions.</li><li>5+ years of experience with developing software in at least one modern programming language.</li><li>Preferred expertise in JavaScript (Node.js, TypeScript, GraphQL, React) and at least one strongly typed programming language — preferably Java.</li><li>Strong Experience with relational (Postgres, RDS) and non-relational databases (Mongo, Document DB), as well as optimized search and content discovery.</li><li>Experience with building backend services on public cloud platforms, such as Google Cloud, Microsoft Azure, and preferably AWS.</li><li>Experience with Kafka, Kinesis, SNS, and SQS.</li><li>Experience and understanding of Docker and Kubernetes.</li><li>Experience in CMS platforms preferred.</li></ul><p><strong>Knowledge, Skills, &amp; Abilities:</strong></p><ul><li>Strong knowledge architecting applications on top of high-traffic, high-availability production systems.</li><li>Strong knowledge of software engineering best practices (e.g., unit testing, design patterns, building maintainable code, performance).</li><li>Strong knowledge of current web standards and best practices.</li><li>Strong knowledge of the integration of 3rd party APIs, libraries, and frameworks.</li><li>Strong knowledge of third-party analytics libraries like Google Analytics and/or Adobe Analytics.</li><li>Proficiency with optimizing for performance, scalability, algorithm design, problem-solving, and complexity analysis.</li><li>Working knowledge conducting code and architecture reviews with an eye for best practices.</li><li>Working knowledge of CI/CD principles with tools like Git, Bamboo, or Jenkins.</li><li>Working knowledge of source code management using GIT, various workflows, and popular branching models.</li></ul><p></p></div>"
    },
    {
        "position": "Program Manager (Diversity Recruiting)",
        "company": "Tailored Management",
        "location": {
            "city": "San Francisco",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/tailored-management-3bf08809/program-manager-diversity-recruiting-9a9bd360?lvk=EG93w-mAxI1w-hiOnH6Xdw.--M2nm1Cwxs",
        "posted": "2021-06-02T21:16:28.890Z",
        "lastScraped": "2021-06-06T21:16:28.890Z",
        "description": "<div><strong>Title</strong>: Program Manager (Diversity Hiring)<br><strong>Job ID</strong>: 10313-1<br><strong>Location</strong>: San Francisco, CA (Remote until further notice)<br><strong>Pay</strong>: $40-$45/hr.<br><strong>Duration</strong>: <strong>6-</strong><strong>month contract</strong> M-F, full-time (40 hours); W2,<br><em>*Opportunity for extension or conversion based on performance and business needs*</em><br><strong>Health Benefits</strong> <strong>+ PTO</strong><br><em>This position requires authorization to work in the U.S. without sponsorship, now and in the future</em><br><br><strong>Job Description</strong>: Seeking a detail-oriented and analytical PM to help us grow and scale our diversity efforts at target campuses as part of our Computer Science Education team, which aims to eliminate <span class=\"long-word\">underrepresentation</span> in tech by driving innovations to computer science curricula. In this role, you will work closely with internal team members and cross-functional stakeholders (engineering, recruiting, programs, communications, and other resources groups) to support team operations and ensure that our execution is aligned with the strategy. The ideal candidate is self-driven, exhibits patience, teamwork, and optimism, and can navigate ambiguity in a calm, mature manner.<br><br><strong>Responsibilities</strong><ul><li>Support Program Manager and partner with Recruiters by planning marketing, reporting, detailed tracking and analysis.</li><li>Create dashboards for and manage incoming CS Education Initiatives program data, including bimonthly reports, to identify, assess, and minimize program/project risks until successful completion.</li><li>Source and manage relationships to cultivate a comprehensive bank of summer internship and full-time opportunities for participants of CS Education Initiatives.</li><li>Develop internal communications strategy with cross-functional stakeholders, including internal FB groups and more.</li><li>Create timelines and project plans to ensure the programs are delivered smoothly and on a day-to-day basis and within budget.</li><li>Partner with Program Managers to drive innovation and process improvements to anticipate needs before they arise.</li><li>Send agendas/meeting notes for quarterly FB CS Education Advisory Board meetings.</li></ul><br><strong>Minimum qualifications</strong><ul><li>BA or BS degree</li><li>1+ years of work experience supporting diversity initiatives, including events management or facilitation, education, or diversity recruitment</li><li>Willingness to work flexible hours as needed</li></ul><br><strong>Preferred Qualifications</strong><ul><li>Passion for increasing diversity in tech and strong understanding of the views, values, and perspectives of diverse communities.</li><li>Able to grow positive, customer-service oriented working relationships with a wide range of stakeholders, including internal team members, cross-functional partners, students, school administrators, and/or vendors.</li><li>Highly motivated, flexible, proactive, and responsible; is comfortable working in a fast-paced, rapidly changing environment.</li><li>Strong attention to detail and ability to prioritize, multi-task, and follow-through with team members to achieve individual and group goals.</li></ul></div>"
    },
    {
        "position": "Industrial Engineering Intern II",
        "company": "Keysight Technologies",
        "location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/ojob/e453bc0e6db9ef562fa16e6943423c1f?lvk=nLh4v2VFrIvsAR5L49_zHw.--M2Os4qfZs",
        "posted": "2021-05-28T21:16:29.922Z",
        "lastScraped": "2021-06-06T21:16:29.922Z",
        "description": "<div><div><p></p><div><div><div>Job Description</div><div><p>Job Description<br>Keysight Technologies has a 6 month position for an Industrial Engineer Intern for the packaging area of our Santa Clara site. We design and build test instruments for RF/microwave communications. These instruments are performance and market leading products, which are used extensively by leading electronic and communications companies worldwide.<br>Come spend an exciting internship working with a high caliber team of Engineers at our site in Santa Clara. &nbsp;In this Internship role, you will:<br>•&nbsp;&nbsp; &nbsp;Improve Warehousing and PoU (Point of Use) replenishment for all packaging material<br>•&nbsp;&nbsp; &nbsp;Consolidate packaging material into dedicated location and establish replenishment processes and expectations with clear instructions.<br>•&nbsp;&nbsp; &nbsp;Identify correct system data to support these program decisions<br>•&nbsp;&nbsp; &nbsp;Establish Service Level Agreements<br>•&nbsp;&nbsp; &nbsp;Apply industrial engineering and inventory control concepts to reduce costs and maximize return on investment. Update CAD drawings as needed.<br>•&nbsp;&nbsp; &nbsp;Provide dependable data about packaging details including ownership, part numbers on Bills of Material, and ID/update safety stocks in ERP system</p><p>•&nbsp;&nbsp; &nbsp;Develop tools that identify replenishment needs (reports, triggers, etc…) Present turn around times in Power BI.<br>•&nbsp;&nbsp; &nbsp;Develop visual Kanban for service items</p></div></div><div><div>Job Qualifications</div><div><p>Job Qualifications<br>•&nbsp;&nbsp; &nbsp;Third or Fourth year university student with previous internship experience preferred.<br>•&nbsp;&nbsp; &nbsp;Must work well in a team environment<br>•&nbsp;&nbsp; &nbsp;Must possess strong organizational, time management, and task execution skills<br>• &nbsp; &nbsp;Must be able to work effectively on both short and extended timetables<br>• &nbsp; &nbsp;Effective interpersonal skills to coordinate efforts with different work groups<br>•&nbsp;&nbsp; &nbsp;Must be able to work on-site in Santa Clara, California for 6 months<br>Desired skills<br>•&nbsp;&nbsp; &nbsp;Familiarity with ERP<br>•&nbsp;&nbsp; &nbsp;Familiarity with industrial engineering, data analysis with presentation and inventory control concepts&nbsp;<br>•&nbsp;&nbsp; &nbsp;Familiarity with CAD software and creating technical drawings<br>•&nbsp;&nbsp; &nbsp;Basic knowledge of Power BI or other BI software<br>•&nbsp;&nbsp; &nbsp;Must be able to lift and move 15 pounds<br>•&nbsp;&nbsp; &nbsp;Current student in Industrial Engineering or similar. Experience or completed class in inventory control and data analysis.&nbsp;<br>&nbsp;Keysight Technologies is an equal opportunity employer.</p></div></div><div><div>Job Function</div><div><ul><li>Internships</li></ul></div></div><p><span class=\"long-word\">___________________________________________________________________________________</span></p><p>Careers Privacy Statement&nbsp;</p><p>***Keysight is an Equal Opportunity Employer.***</p><p><br>Keysight Technologies Inc. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other protected categories under all applicable laws.</p><p>Candidates can be considered to work from the following locations:</p><p>Americas : United States : California : Santa Clara</p><p>Job ID :&nbsp;40976&nbsp;</p></div></div></div>"
    },
    {
        "position": "Software Engineer",
        "company": "Integrated Resources, Inc",
        "location": {
            "city": "Bothell",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/integrated-resources-inc-214952f4/software-engineer-d295fb4e?lvk=tLRTYcLpA-SdJCKgoh3czQ.--M2LqrVgmg",
        "posted": "2021-05-27T21:16:31.169Z",
        "lastScraped": "2021-06-06T21:16:31.169Z",
        "description": "<div><strong>Title: Software Engineer </strong><br><strong><strong>Location: Bothell, WA</strong><br><strong>Duration: 12 months contract on W2 + High possibility of extension based on your performance. </strong></strong><br><br><strong>Overview</strong><br>As a Staff Software Engineer, you will join a cross-functional engineering team that designs micro product imaging devices to aid in cutting-edge medical research. You will be part of an innovative software team that write code to control an instrument, visualize data, and run analysis algorithms providing vital information to researchers. You will work closely with the software, hardware, firmware, and biology teams to build innovative products that change the world of biotech.<br><br><strong>What you will do:</strong><br>Propose software solutions to challenging problems<br>Develop software GUI, workflows, algorithms, backend, and tools<br>Perform all phases of software development for the company’s cell analysis instruments<br>Work with product owners to translate scientific research needs into instrument user stories and requirements (biology experience not required)<br><br><strong>Requirements:</strong><br>Bachelor's Degree or higher (Computer <span class=\"long-word\">Science/Engineering)</span><br>Strong software technical skills. Understands good design and trade-offs<br>Experience shipping high quality and scalable user experiences<br>5+ years experience developing commercially released applications using C#<br>Highly proficient C# skills and knowledge of .NET<br>Strong knowledge of software design patterns and best practices<br>A passion for writing clean code<br>Experienced with Agile development<br>Excellent verbal and written communication skills<br>Team player<br>Git<br><br><strong>Bonus Experience</strong><br>GPU programming<br>AI/Client<br>AWS/Azure<br>Docker<br>NuGet<br>XAML<br></div>"
    },
    {
        "position": "Tools Software Engineer",
        "company": "Neal Analytics",
        "location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "url": "https://www.ziprecruiter.com/jobs/neal-analytics-2b41a9bd/tools-software-engineer-c457a765?lvk=sYOh956D7ixvT8BC19sjnA.--M2tCnKXg7",
        "posted": "2021-06-04T21:16:32.576Z",
        "lastScraped": "2021-06-06T21:16:32.576Z",
        "description": "<div><p><strong>Job Description:</strong> Do you have a passion for supporting development with best-in-class tools and workflows? Do you get excited about Xbox and by the prospect of transforming gaming through efficient and scalable services?</p><p>In this role, you will help drive the design and implementation of tools and workflows optimized for AAA game development in a fast-paced and dynamic work environment. You will work closely with a variety of departments including our Engine team, our Design and Art Teams, and other co-development partners to build out and support tools and pipelines for our various titles.</p><p>REMOTE capacity (they do not need to relocate to Vancouver, BC) but must be available PST hours.</p><p>18 Months Contract</p><p><strong>Typical Day in the Role:</strong></p><p>• Develop and maintain a variety of tools and workflows used by a large game development team including tools integrated into our art packages, our source control software, and Unreal Engine.</p><p>• Increase the overall effectiveness of the development teams by aligning closely with various disciplines both within and outside of the studio.</p><p>• Identify new and existing workflows which can be developed and extended to aid in the development of the game.</p><p><strong>Years of experience required: Strong experience with 3D art pipelines, C++, C#, Unreal, and scripting languages is required. The Github link is a plus.</strong></p><ul><li>• 3+ years in a programming background in C#, C++, SQL, and scripting languages</li></ul><ul><li>2+ years of using Unreal (editor code side and NOT content-focused)</li></ul><ul><li>Solid understanding of software engineering best practices</li></ul><ul><li>Strong communication skills</li></ul><ul><li>Passion for games and a “customer-obsessed” attitude</li></ul><ul><li>At least 3 years of professional software development experience</li></ul><ul><li>2+ years' experience 3D art package pipelines (or corresponding depth in C++ and 3D math)<p></p><p>Code samples are a plus (Github link) – needs to be complex coding</p><p>A coding test will take place to measure the candidate's C++ skills.</p><p><strong>Preferred</strong></p></li></ul><ul><li>Solid 3D Math skills (linear algebra and trig.)</li></ul><ul><li>Strong grasp of UX design principles</li></ul><ul><li>Experience with building UI applications (MVVM)</li></ul><ul><li>Experience with complex game systems (animation, graphics, game engine, etc.)</li></ul><ul><li>Experience using 3D editors and applications<p></p><p><strong>Degrees or certifications required:</strong></p><p>Bachelor of Math/Computer Science</p><p><strong>Disqualifiers</strong></p><p>Lack of SDE experience, not able to use various programming languages. Does not have strong coding skills.</p><p><strong>Best vs. average</strong></p><p>We are looking for someone with significant project experience using Unreal Engine and C++. The team needs a candidate who can ramp up quickly on both Unreal/C++-centric and C#-centric tasks as needed – perhaps more weighted towards Unreal. This individual will have worked on software development for a AAA game in the past using Unreal. They are customer-driven and have a passion for games including game knowledge and industry.</p><p><strong>Top 3 Must-Haves:</strong></p><p>1- 3+ years in a programming background in C#, C++, SQL, and scripting languages</p><p>2- 2+ years' experience using Unreal (editor code-focused side and NOT content-focused)</p><p>3- 2+ years' experience 3D art package pipelines</p></li></ul></div>"
    }
]