[
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Engineer-Summer-2022-Internship-Bachelors-Meraki/1353180",
    "position": [
      "Full Stack Engineer Summer 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Summer Internship (May - August 2022), full-time work schedule, Monday- Friday 40 hours per week\n\nCisco Meraki Business Unit\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\n\n\n\nAs a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.\n\n\n\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.\n\n\n\nExample projects of a Full Stack Web Developer Intern:\nCreate services to fetch data from millions of Meraki devices, then present that data in a user-friendly way\nImprove performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay\nBuild internal frameworks and refine front end infrastructure to augment developer productivity\nConstruct API endpoints to allow Meraki users and third party companies to build custom tools and features\nBuild a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms\nBuild a graph for network traffic analysis using clustering and other algorithms\nYou are an outstanding applicant if:\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science\nYou strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular\nYou are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)\nYou have worked with SQL and relational Databases\nYou would flourish within a small engineering team and are excited to tackle open-ended problems\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\n\n\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\n\n\nIntern Benefits:\n\nHousing Assistance\n\nCompetitive salary\n\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\n\nLunch and dinner daily\n\nCustomized laptop and desk setups\n\nMedical coverage plan\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Management-Intern-MBA-Summer-2022-Internship-Meraki/1349331",
    "position": [
      "Product Management Intern, MBA - Summer 2022 Internship (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Product Management Internship, Summer 2022 (May - August) in San Francisco. \n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nAs a Product Management Intern at Meraki, you will collaborate with forward-thinking engineers and excited customers to help ensure that we have another homerun product addition to the Meraki #fullstack. You will work closely with the executive team to establish a winning strategy, and collaborate with our extraordinary sales, marketing, and partner teams to ensure market-adoption and rapid growth. We want your help to make this nascent product line shake up the burgeoning multi-billion-dollar analytics market.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nExample projects of a Product Management Intern:\n\nWorking closely with the customer and our engineering team to identify new product concepts and GTM strategies.\nDevelop new MX product for service provider customers, working with sales, marketing, hardware, and software engineering teams\n\nYou are an outstanding applicant if:\n\nStrong business background (ex: MBA, Product Management or Marketing) desired\nCCNA/CCNP/CCIE routing/switching/security certifications a plus\nExperience with or passion for learning about networking, cloud, and emerging disruptive technologies\nStrong user empathy with a deep desire to understand top customer problems\nEasily communicate complicated concepts to non-technical folks\nEntrepreneurial, can-do attitude with a strong sense of product quality\nLove solving technical problems in creative ways\n\nIntern Program Overview:\n\nMeraki interns join the team for a 12 or14 week program and are placed directly onto subteams. During the program, interns have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the remaining duration of the program on a larger project, such as building the infrastructure for a new service. Projects are cross-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Test-Automation-Engineer-Summer-2022-Internship-Bachelors-Meraki/1348849",
    "position": [
      "Test Automation Engineer Summer 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Summer Internship (May 2022 - August, full-time work schedule, Monday- Friday 40 hours per week)\n\nCisco Meraki Business Unit\n\nSimplicity. Meraki makes setting up, managing, and maintaining networks easier than it has ever been before. Simplified and smarter networking means that businesses run more efficiently, and more people have reliable access to the information they need. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nYou will join a test automation team that is fully embedded within our software engineering team. We handle all types of testing projects for our cloud managed products; from nightly feature tests across the latest firmware images to performance testing of all kinds. We run large scale testing to measure how small changes could impact our performance. Our automation framework is being used across software engineering, and we continue to make it more intuitive. Our products are used in over a million networks and our customers rely on our products to serve ten of millions of people. With the large footprint that we have, quality is our highest priority. We are looking for the newest additions to our teams who are as passionate about quality as we are. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions. Your contributions will make direct impact to the success of our business.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nA day in the life of Test Automation Engineering Intern:\n\nYou may design a testbed from the ground up that has the ability to change topologies on the fly. You will have an in-house automation framework at your disposal as well as APIs to hook into for further automation. You will have the autonomy to craft and implement a solution as well as the knowledge and experience of team members to help you along the way.\n\nIn addition to software testing, you may have a chance to work on our latest hardware appliances from an early phase of development. You will get to learn some of the cool technologies inside the box. Through testing, you will gain firsthand knowledge about the performance and be able to guide the team in improving the quality before we release the product.\n\nWhat does it take?\nYou are pursuing a bachelors technical degree or equivalent experience with a great foundation in the fundamentals of computer science and computer networking\nYou are proficient in scripting languages such as Ruby or Python\nYou are proficient in Lunix and REST API\nYou have solid understanding of core network protocols like TCP/IP, DHCP, DNS, VLANS, etc.\nYou have experience in performance testing\nYou have CCNA or equivalent certification\nYou have familiarity with UI framework such as React/Ember/Angular\nYou have familiarity with IPv6 and routing protocols like OSPF and BGP\nYou have worked with virtualization or container technology, such as ESXi, Xen, Docker, etc.\nYou have used development infrastructure tools such as Jenkins, Git, Gerrit, and JIRA and/or have experience with Database solutions (e.g, InfluxDB, PostgreSQL, etc)\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto sub-teams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing assistance in San Francisco for duration of program\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/UX-Designer-UX-Researcher-Intern-Summer-2022-Internship-Meraki/1345408",
    "position": [
      "UX Designer / UX Researcher Intern - Summer 2022 Internship (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "UX Design / Research Internship, Summer 2022 (appx. end of May to mid August 2022)\n\n\n\n\nPlease include a link to your portfolio in your application or within your resume\n\n\n\n\nMeraki makes setting up and maintaining reliable Internet and Internet-powered devices easier than ever before. We enable organizations everywhere, from local libraries to hotels operating worldwide, to focus on their mission and have technology that simply works.\n\n\n\n\nWe’re looking for a UX Design intern to join us in simplifying IT! As a UX intern at Meraki, you will be responsible for the design of interactions and components. Collaborating with other designers, researchers, and partners in product management and engineering, you will collect data and conduct research to understand users’ goals, and you will explore and iterate on solutions.\n\n\n\n\nWe place a high value on encouraging the growth and development of everyone on the team. On the UX team, we give and get feedback early and often, share what we know, and learn from each other. UX interns will be paired with a mentor and work closely with them throughout their internship.\n\n\n\n\nThe UX team’s primary focus is on software, but we also find opportunities to collaborate with teams across the organization and think about how to improve the entire customer journey.\n\n\n\nResponsibilities\nLearn about the domain and workflows of our users\nResearch: Run and synthesize research, collaborate to create solutions with designers, engineers, and product managers\nDesign: Design lo-fi and hi-fi interactions, collaborate with teammates to prototype solutions\nIterate on designs based on peer feedback, user research, usability testing, analytics, and other data\nPresent rationale for product decisions\nSolicit feedback from designers, researchers, and other collaborators\nQualifications\nMust be pursuing a degree towards Human-Computer Interaction, Graphic Design, Interaction Design, UX Design, Media Arts, or similar\nDriven, eager, and open to learning new skills and deepening your area(s) of expertise\nExcellent communicator and take initiative to check-in with your teammates\nFocus area and strength in user-centered research, human-centered design, or both\nCollaborated with people in other fields (engineering, product, etc.) and worked as a team\nInvestigated problems in screen-based products and fashioned sophisticated solutions. Assessed the impact of the solutions and iterated on them.\nA basic understanding and familiarity with front-end code (HTML/CSS)\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Summer-2022-Internship-Bachelors-Meraki/1341219",
    "position": [
      "Site Reliability Engineer Summer 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Site Reliability Engineer\n\n\n\n\nSummer Internship (May- August), full-time work schedule, Monday - Friday / 40 hours)\n\n\n\n\nCisco Meraki Business Unit\n\nAs a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.\n\n\n\n\nMeraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones.\n\n\n\n\nIn this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.\n\n\nWhat we look for in our SRE intern/co-op candidates:\n\nJunior/Senior status pursuing a BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress), no masters\nClear and effective communication skills\nProactive learners who can quickly pick up working in multiple frameworks, languages and environments\nPassionate team players\nContinually able to learn from experience and eager for feedback\nPrevious internship or large scale project experience\nA strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)\n \nBonus Points:\nKnow your way around *nix systems. We run Debian.\nAre familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.\n \n\nProjects and Work Life:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\n\n\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\n\n\n\nExamples of Past Projects\n\nAdding at-rest encryption to our cloud-based database backups\nRevamping our Organization Move process to move customers between servers\nImplementing Docker Containers to move our infrastructure to a containerized world\n\nIntern Benefits:\n\nHousing Assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets,    friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical, dental, and vision coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-San-Francisco-Summer-2022-Internship-Bachelors-Meraki/1341029",
    "position": [
      "Network Support Engineer Intern - San Francisco, Summer 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Summer Internship (May-August, full-time, San Francisco)\n\n\n\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineer Interns act as key players on the Support team! You will troubleshoot cases that cover the entire Meraki product line, including our wireless access points, security appliances, switches, and Systems Manager application, just like our full-time engineers. With a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support that will carry with them for the rest of their careers. Our interns are an integral part of the Support team - we look for smart, passionate individuals who are open to taking on any task and are proactive in helping the team. The position is full-time and based out of the San Francisco office. \n\n\n\n\nResponsibilities\n\nResearch and resolve issues reported by Meraki customers and partners\nIdentify issues suitable for entry in the Meraki Knowledge Base\nWrite, review, and release KB articles\nAssist with lab testing work as needed for Meraki products\nIdentify, reproduce, and document bugs\nHave a project in mind? Let us know and we'll help to make it happen!\n\nQualifications\n\nMust be a Junior or Senior working towards a B.S in Networking and Systems Administration, Computer Information Technology, Network Technologies, Computer Science, or a related discipline from an accredited university - Not accepting Masters students\nBasic understanding of networking fundamentals, e.g. be able to explain the functions of and differences among the link, network, transport, and application layers\nA passion to assist and problem-solve with our customers\nOutstanding account management, follow-through, and problem-solving skills\nResourcefulness and attention to detail\nExcellent communication skills, both written and verbal\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Winter-2022-Internship-Bachelors-Meraki/1340139",
    "position": [
      "Site Reliability Engineer Winter 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Site Reliability Engineer\n\n\n\n\nWinter Internship (January- April, full-time work schedule, Monday - Friday / 40 hours)\n\n\n\n\nCisco Meraki Business Unit\n\nAs a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.\n\n\n\n\nMeraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones.\n\n\n\n\nIn this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.\n\n\nWhat we look for in our SRE intern/co-op candidates:\n\nJunior/Senior status pursuing a BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress), no masters\nClear and effective communication skills\nProactive learners who can quickly pick up working in multiple frameworks, languages and environments\nPassionate team players\nContinually able to learn from experience and eager for feedback\nPrevious internship or large scale project experience\nA strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)\n \nBonus Points:\nKnow your way around *nix systems. We run Debian.\nAre familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.\n \n\nProjects and Work Life:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\n\n\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\n\n\n\nExamples of Past Projects\n\nAdding at-rest encryption to our cloud-based database backups\nRevamping our Organization Move process to move customers between servers\nImplementing Docker Containers to move our infrastructure to a containerized world\n\nIntern Benefits:\n\nHousing Assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets,    friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical, dental, and vision coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Helpdesk-IT-Computer-Science-Summer-2022-Internship-Meraki/1340044",
    "position": [
      "Network Support Engineer Intern (Helpdesk, IT, Computer Science) - Summer 2022 Internship (Meraki)"
    ],
    "location": {
      "city": "Chicago",
      "state": "Illinois",
      "country": ""
    },
    "description": [
      "Summer Internship (May - August 2022, full-time) in Chicago, IL or San Francisco, CA\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineering team troubleshoots cases that cover the entire Meraki product line, including our wireless access points, security appliances, cameras, switches, and Systems Manager application!\n\n\n\n\nThe Network Support Internship allows individuals to explore the wonders of Networking by rapidly developing an understanding of networking fundamentals through structured classroom instruction, Packet Tracer exposure, labs, and troubleshooting scenarios instructed by a Meraki Intern Instructor/Mentor.\n\n\n\n\nWith a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support.\n\n\n\n\nYou will…\n\nParticipate in and successfully complete structured classroom workshops specific to core CCNA preparation administered by a Meraki instructor\nWork through lab assignments via Packet Tracer, NetAcad labs, and Meraki troubleshooting labs to learn the fundamentals of networking and troubleshooting\nGain an understanding of the networking field by participating and engaging in various courses\nAssist with lab testing work as needed for Meraki products\nIdentify issues suitable for entry in the Meraki Knowledge Base\nGain exposure to researching and resolving issues reported by Meraki customers and partners\n\nYou are….\n\nJunior or senior pursuing a bachelor's degree with a computer science, information technology, networking, systems administration, or a related field from an accredited university. Individuals already graduated or pursuing a master’s degree will not be considered\nHardworking and interested in exploring the Networking field\nPassionate to assist and problem-solve with customers\nAble to strategically and critically think about how to look for solutions, willing to be pushed outside your knowledge areas, and eager to learn and find solutions\nA strong communicator and problem-solver\nAuthorized to work in the U.S. without requiring sponsorship now or in the future\n\nPreferred experiences within helpdesk, technical call center, desktop support, or past networking experiences preferred, but not required. \n\n\n\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Chicago-Summer-2022-Internship-Bachelors-Meraki/1339621",
    "position": [
      "Network Support Engineer Intern - Chicago, Summer 2022 Internship, Bachelors (Meraki)"
    ],
    "location": {
      "city": "Chicago",
      "state": "Illinois",
      "country": ""
    },
    "description": [
      "Summer Internship (May-August, full-time, Chicago)\n\n\n\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineer Interns act as key players on the Support team! You will troubleshoot cases that cover the entire Meraki product line, including our wireless access points, security appliances, switches, and Systems Manager application, just like our full-time engineers. With a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support that will carry with them for the rest of their careers. Our interns are an integral part of the Support team - we look for smart, passionate individuals who are open to taking on any task and are proactive in helping the team. The position is full-time and based out of the Chicago office. \n\n\n\n\nResponsibilities\n\nResearch and resolve issues reported by Meraki customers and partners\nIdentify issues suitable for entry in the Meraki Knowledge Base\nWrite, review, and release KB articles\nAssist with lab testing work as needed for Meraki products\nIdentify, reproduce, and document bugs\nHave a project in mind? Let us know and we'll help to make it happen!\n\nQualifications\n\nMust be a Junior or Senior working towards a B.S in Networking and Systems Administration, Computer Information Technology, Network Technologies, Computer Science, or a related discipline from an accredited university - Not accepting Masters students\nBasic understanding of networking fundamentals, e.g. be able to explain the functions of and differences among the link, network, transport, and application layers\nA passion to assist and problem-solve with our customers\nOutstanding account management, follow-through, and problem-solving skills\nResourcefulness and attention to detail\nExcellent communication skills, both written and verbal\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Software-Engineer-Summer-2022-Internship-Meraki/1339636",
    "position": [
      "Product Software Engineer Summer 2022 Internship (Meraki)"
    ],
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": [
      "Product Software Engineer\n\nSummer Internship (May - August 2022, full-time work schedule, Monday- Friday 40 hours per week)\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to elite universities to global hospitality groups operating thousands of sites.\n\n\n\n\nAs a Product Software Engineer at Meraki, you will bring life to our products, imbuing them with what some call the Meraki Magic. Through your contributions, you will enable our customers to do more things more easily than ever before. You will have opportunities to work across our stack, developing software ranging from bootloaders, device drivers, and routing code to our distributed, cloud-hosted backend.\n\n\n\n\nHere are some of the projects you might find yourself working on:\n\nDesigning and implementing (usually in C/C++) features to improve the reliability, simplicity, and performance of our devices, as well as make them more flexible and powerful\nBringing up our Linux-based system on new hardware platforms\nCollaborating with our hardware engineers on the design of new platforms\nYou’re the kind of person we’re looking for if:\nBA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress)\nYou are comfortable writing systems-level C/C++ (or if you’ve written your own OS!)\nYou have familiarity developing and implementing computer networking fundamentals (TCP/IP, routing protocols, IPv6, etc.)\nYou have worked with Linux on embedded platforms\nYou have an understanding of OS fundamentals and experience working in both kernel and user space\nYou love being a part of a tight-knit, hard-working team and want to have an impact with your own work while also elevating your teammates\nYou have previous internship or large project experience\n\nAs a software engineer early in your career, you may still be identifying areas that you are curious about or in which would like to develop more depth. At Meraki, you will have the opportunity to explore multiple technology areas and problem domains. Whether you have a passion for user interfaces, distributed systems, network protocols, or embedded development — or perhaps more than one of these — you will be able to dive deep here. Together with your team you will craft from top to bottom the suite of innovative products that make Meraki unique.\n\n\n\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\n\n\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\n\n\nIntern Benefits:\nHousing Assistance\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\n\n\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Hardware-Engineer-Master-s-Intern-United-States/1338932",
    "position": [
      "Hardware Engineer Master's (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nImpact the product development from the lowest levels of circuit design to large system design and see your contribution all the way through to high volume manufacturing. Creative Hardware Engineering positions available in: \n\nASIC Design and Verification\nSystem/Board Design\nCircuit Board Layout\nHardware Automation\nValidation and Test\nSignal Integrity\nPower Design. \n\n\n\n\nWho You'll Work With \n\n\n\n\nEngineering: \n\nOpen-minded, driven, diverse and deeply creative people at Cisco design the hardware that makes the internet work. Bring your knowledge of computers and networking and take it to a new level in any one of the following product categories including: cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, Internet of Things, routing, switching, IPv6, data center, HPC, TelePresence and \n\nmany more. Your work will affect billions globally. \n\n\n\n\nSupply Chain Operations: \n\nCollaborate with peers on projects that have a real world impact. From our processes to manufacturing, you'll deliver a standout customer experience of Cisco products and services. Take your creative ideas from the drawing board to deliver powerful solutions. You'll collaborate with multi-functional teams to determine our infrastructural needs and product specifications. \n\n\n\n\nServices: \n\nLet's change the world together. You will work directly with our customers and gain hands on experience and exposure into their networks. You will also be immersed in a small close-knit group of cohorts to collaborate on a variety of projects that have a real impact. You'll learn from industry professionals. We value your ideas and perspective on how to get things done. Finally, you'll have the opportunity to work on network infrastructures, and deliver business solutions and technology solutions from data, security, mobility, and cloud. \n\n\n\n\nWho You Are \n\nCurrently pursuing a Master’s degree in Computer Science, Computer Engineering, Electrical Engineering, or a related major such as Math, Physics \nYou possess the ability to lead multiple tasks and work toward long-term goals \nYou hold a solid understanding of engineering fundamentals and technical problem-solving skills \nYou have experience in establishing and sustaining strong relationships with the extended team \nYou possess excellent communication skills (verbal and written) \n\n \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n \nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n \nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n \nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n \nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  \n\n \n\n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Program-Manager-MBA-Intern-United-States/1338943",
    "position": [
      "Program Manager MBA (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\n• Lead and/or direct projects/programs, build and deliver program status presentations \n\n• Spearheading teams and individuals towards project timelines and identify issues and risk mitigation while ultimately providing an excellent customer experience and a common objective \n\n• Recognize and resolve project issues and institute appropriate next steps, as well as developing client relationships \n\n• Work closely with our partner network internally and externally to identify areas of improvement that deliver a valuable advantage for Cisco and our customers in terms of service offerings, scalability, simplicity and cost \n\n• Support identification of social & business improvement opportunities using quantitative analysis to drive decision-making and improvement of processes and tools \n\n \n\nWho You'll Work With \n\nProgram management has never been more vital to our organization. You'll play an integral role in the business tying project results to business goals, resulting in better market positioning. Team with cross-functional departments groups for collaboration and business efficiency. You will be involved in the definition, planning, management, and delivery of various projects. \n\n \n\nWho You Are \n\n• Actively pursuing an MBA degree with a tech undergrad degree in Engineering, Computer Science, Electrical, Mechanical or Industrial Engineering or equivalent \n\n• Understanding about process control, quality metrics, lean manufacturing, six sigma, etc.. \n\n• Knowledge of software tools are required (e.g. MSOffice, statistics packages, etc.) \n\n• Self-motivated and highly determined \n\n• Strong written and verbal skills including presentation and social abilities \n\n• Ability to handle multiple tasks and work toward long-term goals \n\n \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n \nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n \nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n \nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n \nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  \n\n "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Technical-Marketing-Engineer-Intern-United-States/1338945",
    "position": [
      "Technical Marketing Engineer (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You'll Do  \n\nWe are looking for a Technical Marketing Engineer to promote and increase customer adoption of various enterprise technologies such as network visibility, security, switching, wireless, routing, and Software Defined intent based networking technologies. We are seeking a motivated, detail oriented & committed engineer that will rise to the challenge to communicate, design, build & help customers and sales teams on enterprise networking technologies. Often times you will work as part of a team as well as independently in customer engagements of the latest technologies. You should be curious and eager to learn about new products, technologies, and solutions to provide valuable input and communication to the sales, engineering, and product management organization. The engineer will help drive the future technical product direction. Be a technical consultant on customer calls and meetings. Work closely with the field, key Systems Integrators, Engineering, and Cisco Technology Partners in an Agile environment. Work with automation or cloud software to enable next generation network design and network architectures. Develope automated methods to own the network and optimize our customer's user experience. Build messaging about key customer challenges and benefits of Cisco's solutions based on use cases. Build Documents and Presentations with technical details for the products, technologies, and solutions. Travel and deliver training to customers, partners, sales teams both domestically and internationally at events and customer locations  \n\nWho You'll Work With  \n\nCisco’s Enterprise Networking Group is a core technology group within Cisco. By defining and delivering market-leading campus networking solutions with Cisco Digital Network Architecture (DNA) which is an intent-based networking architecture that delivers advanced solutions for enterprises.  \n\nWho You Are  \n\nLoves technology, computer networking, loves automation, loves digital. Self-starter who is passionate about ground-breaking technology and driving change. Has a strong sense of ownership, loves turning ambiguity into real outcomes, working across all functions and matrixed teams, embraces the belief that leadership happens from all levels, and we are better together than any one of us in individually.  \n\nActively enrolled and pursuing a B.S. or M.S. degree in Computer Science, Electrical Engineering or related technical field or program\n\nExcellent communication skills both in technical and non-technical discussions  \n\nExcellent analytical skills. Confirmed ability to understand sophisticated and in-depth level technical situations, related business challenges, and be able to communicate these technologies in a clear and simple way to customers and sales teams.  \n\nDevOps Programming and scripting experience in Python, Linux, or other programming language is desired  \n\nInterest and knowledge of networking technologies and networking is desired. Cisco Routing, Catalyst Switching, IOS XE, Aironet AP and Wireless controller experience is desired. Cisco certifications is desired.  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n \nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n \nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n \nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n \nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  \n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Bachelor-s-Intern-United-States/1338396",
    "position": [
      "User Experience Bachelor's (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for phenomenal people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nOur minimum requirements for this role:  \n\nCurrently pursuing a Bachelor's degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nProven understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Security-Solutions-Engineer-Intern-United-States/1338413",
    "position": [
      "Security Solutions Engineer (Intern) United States"
    ],
    "location": {
      "city": "RTP",
      "state": "North Carolina",
      "country": ""
    },
    "description": [
      "What You’ll Do\n\n\n\nEverything is converging on the Internet, making networked connections more meaningful than ever before in our lives. Our employees' revolutionary ideas impact everything imaginable - from entertainment, retail, healthcare, and education, to public and private sectors, smart cities, smart cars, and everyday devices in our homes. Here, that means you’ll take creative ideas from the drawing board to powerful solutions that have real world impact. You’ll collaborate with Cisco leaders, partner with experienced mentors, and develop incredible relationships with colleagues who share your interest in connecting the unconnected. You’ll be part a team that cares about its customers, enjoys having fun, and you’ll participate in changing the lives of those in our local communities. Come prepared to be inspired. \n\n\n\nWho You'll Work With\n\n\n\nLet’s change the world together. Work directly with our customers and gain hands on experience and exposure into their networks. Be immersed in a small close-knit group of cohorts, to collaborate on several projects that have a real impact. You’ll learn from industry experts. We value your ideas, perspective on how to get things done. Work on network infrastructures. Deliver business solutions and technology solutions from data, security, mobility, and the cloud. Our Security Services internship program covers two lines of Service: Advisory and Implementation. To find out more about Cisco Security Services, go to: http://www.cisco.com/c/en/us/products/security/service-listing.html\n\n\n\nAdvisoryServices\n\n\n\nAdvisory Services Consultants help our clients take on their complex security needs through world-class expertise, mature methodologies, and advanced research capabilities. Our Risk and Strategy team helps organizations grow mature strategies for dealing with risk and compliance management. The Assessment and Penetration Testing team takes a technical approach to identifying and mitigating vulnerabilities and threats by emulating real-world-attack techniques through penetration testing, application assessments and social engineering. The Incident Response team provides both dedicated and reactive services to organizations to bolster their approach to detecting, mitigating and eradicating security incidents. \n\n\n\nWhat You’ll Do\n\nDefine and assist in small-scale projects to improve operational efforts\nUnderstand common application, network vulnerabilities and techniques for testing and exploitation\nPractice and emulate real world attack tactics in simulated lab environments\nBecome familiar with a number of security testing tools, including Kali Linux, Nmap, Metasploit and BurpSuite\nHelp clients assess their level of risk in using technology within the business and provide recommendations to reduce business risks\nWork with clients to strategize on effective controls around people and technology to prevent unnecessary risk while meeting compliance requirements\nShadow a variety of client engagements including risk assessments, penetration tests, and IR investigations\n\nImplementation Services\n\n\n\nImplementation Services Consultants with Cisco’s Security Services team bring deep expertise on Cisco security products to our customers. Our team assists customers with developing strategies for deploying new technologies in their environments, assist in designing and implementing new technologies, handle the integration of Cisco technology into existing security portfolios and assist customers in optimizing existing and new security technologies. Our customers expect Cisco to be authorities in security technology…the Integration team are those guides. \n\n\n\nWhat You’ll Do\n\nAttend on-site design and configuration sessions with a Cisco Security Solutions mentor\nIdentify and support in large-scale-design efforts for customer network integrations\nSupport in gathering requirements from customers for projects to meet critical business goals\nWork with a security team mentor to define the business goals and requirements for integration efforts\nConfigure lab devices with configuration templates or system configurations which will be used in customers’ production implementations\nAid in analyzing and designing policy creation for Identity Services, Firepower Intrusion Detection, ASA Firewall Rules, and Catalyst Switch Configurations\nAnalyze customer configurations and provide feedback on possible improvements or changes to the configuration to improve alignment with customer business goals\nAnalyze customer logs or net flow data to advise on improvements aligned with their business goals\n\nWho You Are\n\nYou're currently pursuing a bachelor’s or master’s degree in Computer Science, Computer Engineering, or Information Systems (or equivalent) with software development skill set or interest in information security\nYou have knowledge of IT systems, networking concepts, TCP/IP protocols, network devices and applications, OSI 7-layer model, or code development\nYou have a desire and passion for information security and willingness to learn and teach yourself tough concepts\nYou are able to work well in small dynamic teams and balance multiple responsibilities\nYou have the ability to work in collaborative teams distributed across the US\nYou possess excellent written and verbal skills\n\nWhy Cisco\n\n\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Master-s-Intern-United-States/1338423",
    "position": [
      "User Experience Master's (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for great people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nCurrently pursuing a master’s degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nSolid understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Manager-MBA-Intern-United-States/1338244",
    "position": [
      "Product Manager MBA (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You'll Do\n\nDevelop strategic marketing plans for a product or product line through market research, competitive analysis, pricing, customer engagement, and business planning\nDrive new business and opportunities for the business unit and technology group\nDevelop innovative product features and functionality in partnership with Engineering and UX\nProvide customer use-case examples to Engineering and act as the primary liaison customer feedback and requirements and R&D. Drive resolution of customer happiness issues. Handle issues associated with ordering of product, systems and tools, and manufacturing supply\nForecast and help drive opportunities for product lines with annual revenues from $100M to $4B. Identify areas for growth and craft strategic product line roadmaps to help drive adoption of the product and differentiating features\nDevelop and drive results-oriented campaigns across various markets to ensure Cisco's market share and profitability including media releases, launch materials, customer presentations, videos, podcasts, and sales training materials\n\nWho You'll Work With\nFind the career path in Product Management that you’re passionate about! Cisco provides an environment that allows your creativity to become a reality. Work as part of a global team. Collaborate with Cisco leaders via social events, information sessions, and brown bag lunches. Partner with an experienced mentor. It’s your career, own it. \n\nWho You Are\n\nYou are pursuing an MBA (technical or business undergrad preferred)\nYou are a self-motivated and forward-thinking individual\nStrong written, verbal, and interpersonal communication along with strong presentation abilities, adept business knowledge and interpersonal skills round out your portfolio\nYour strong people skills allow you to easily partner with people at all levels\nYou possess the ability to handle multiple tasks and work towards long-term goals\n\nWhy Cisco\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Project-Specialist-Manager-Intern-United-States/1337889",
    "position": [
      "Project Specialist/Manager (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nExecute project management skill sets and methodologies to address long-term opportunities that impact and improve the business \n\nAssist in all project management cycles, including quantitative and qualitative analysis, forecast market trends, to identify risks and issues and work toward innovation and operational success \n\nIdentify process gaps and process implementation planning within Supply Chain \n\nSupport and further build change management processes \n\nCollaborate with partners to provide innovative solutions to optimize internal and external processes, policies, protocols, and tools that will enable the best cost, quality, and delivery of Cisco products \n\n \n\nWho You'll Work With \n\nProject management has never been more integral to our organization. You'll play an integral role in the business tying project outcomes to business goals, resulting in better market positioning. Collaborate with cross-functional teams and strive for business efficiency. You will be involved in the definition, planning, management, and deliverables of various projects. \n\n \n\nWho You Are \n\nYou are actively pursuing a Bachelor’s or Master’s degree in Business, Supply Chain, Communications, Mathematics, Statistics, Finance, Industrial Engineering or a related field \n\nYou possess a strong foundational understanding with project management fundamentals and methodologies \n\nYou show strong communication and collaboration skills with a real passion for solving complex problems \n\nYou have excellent organization and time management skills, and can demonstrate the ability to be agile  \n\nProcess oriented with drive to simplify/improve process \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n \n\nWhy Cisco \n\n  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\n  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\n  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\n  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \n\n \n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Hardware-Engineer-PhD-Intern-Co-Op-United-States/1338940",
    "position": [
      "Hardware Engineer PhD (Intern/Co-Op) United States"
    ],
    "location": {
      "city": "Research Triangle Park",
      "state": "NC - Moorestown",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nImpact the product development from the lowest levels of circuit design to large system design and see your contribution all the way through to large volume manufacturing.  \n\n \n\nCreative Hardware Engineering positions available in: \n\n• ASIC Design and Verification \n\n• System/Board Design \n\n• Circuit Board Layout \n\n• Hardware Automation, Validation and Test \n\n• Signal Integrity \n\n• Power Design \n\n \n\nWho You'll Work With \n\nOpen-minded, driven, diverse and very creative people at Cisco design the hardware that makes the internet work. Bring your knowledge of computers and networking and take it to a new level in any one of the following product categories including: cloud, social, mobile/wireless, video, VoIP, large data, collaboration, web, Internet of Things, routing, switching, IPv6, data center, HPC, Telepresence and many more. Your work will impact billions globally. \n\n \n\nWho You Are \n\n• Actively enrolled in a PhD program in Computer Science, Electrical Engineering, Computer Engineering, Applied Science, Material Engineering, Applied Physics, Math, Physics or related major \n\n• Ability to handle multiple tasks and work toward long-term goals \n\n• Demonstrated understanding of engineering fundamentals and technical analytical skills \n\n• Experience in establishing and sustaining positive relationships with the extended team \n\n• Excellent communication skills (verbal and written) \n\n #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n \nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n \nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n \nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n \nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Data-Scientist-Intern-United-States/1338394",
    "position": [
      "Data Scientist (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nAcquire, clean and structure data from multiple sources and maintain databases/data systems. \n\nIdentify, analyze, and interpret trends or patterns in complex data sets \n\nDevelop, prototype and test predictive algorithms \n\nFilter and \"clean\" data, and review computer reports, printouts, and performance indicators to locate and correct code problems \n\nDevelop and implement data collection systems and other strategies that optimize statistical efficiency and data quality \n\nInterpret data, analyze results using statistical techniques and provide ongoing reports \n\nWho You’ll Work With \n\nWork on massive structured, unstructured, transactional and real-time data sets from a variety of sources to analyze customer usage patterns and provide actionable, intuitive, impactful insights using metrics, algorithms, and statistics.  \n\nWho You Are \n\nCurrently enrolled in a BS, MS or MBA program or equivalent in Computer Science, Mathematics, Economics, Information Management, Statistics or a related field \n\nYou know how to work a problem from beginning to end with data science tools and techniques, including data manipulation (SQL, Hadoop, etc.) and programming (R, Python, XML, Javascript, or ETL) frameworks \n\nExperience with Oracle databases is desirable. Strong knowledge of and experience with reporting packages (Business Objects etc). Knowledge of statistics and experience using statistical packages for analyzing large datasets (Excel, SPSS, SAS etc). \n\nTechnical knowledge regarding data models, database design development, data mining and segmentation techniques \n\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy \n\nProficient in queries, report writing and presenting findings \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\n  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\n  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\n  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \n\n \n\n "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Management-Specialist-Intern-United-States/1338685",
    "position": [
      "Product Management Specialist (Intern) United States"
    ],
    "location": {
      "city": "RTP",
      "state": "NC",
      "country": ""
    },
    "description": [
      "What You’ll Do  \n\nYou will drive projects with market analysis and product definition while utilizing product management skill sets and methodologies. You will work cross-functionally through Cisco channels, business units and internal organizations while working with product managers to build:  \n\nProduct strategy documents including marketing requirements  \n\nProduct requirements  \n\nProduct life-cycle-commit process  \n\nJob-role analysis  \n\nYou will present to leadership and other members of the organization, identify process gaps and process implementation planning as you continue to support and further build organizational change processes.  \n\nJoin us as we transform the world of tomorrow. Develop creative ideas on how to work better and smarter. Influence and participate in top-priority projects that have a real impact.  \n\nWho You Are  \n\nCurrently enrolled in a bachelor’s or master’s in Business, Computer Engineering or an equivalent field  \n\nExperienced in product management processes  \n\nGeneral project and program management skills  \n\nYou possess strong communication and partnership skills  \n\nShow a proven understanding of product management, supply chain, demand planning, logistics and project management methodologies \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship  \n\nWhy Cisco  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!  "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Consulting-Engineer-Intern-United-States/1338391",
    "position": [
      "Consulting Engineer (Intern) - United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You'll Do \n\nAs a Consulting Engineer Intern, you will gain hands-on experience on leading-edge technology. You will be mentored by some of the industry’s brightest minds who will help you challenge and develop your skills. \n\n\n\n\nYou will collaborate with and learn from industry-leading engineers. At Cisco, we value your ideas and perspective. We encourage you to innovate and push boundaries. You will join a team to build your technical expertise, learn Cisco specific technologies and how to build a positive experience for our customers. \n\n\n\n\nYou will make a proven impact on network infrastructure and solutions like security, mobility and cloud. Customer Experience covers full customer life-cycle experience. \n\n\n\n\nWho You’ll Work With \n\nLet’s change the world together. Work closely with your team to gain experience and insights into real-world customer deployments and challenges. Be immersed in a small close-knit group of cohorts, to collaborate on a variety of projects that have a real impact. You’ll learn from industry experts. We value your ideas, perspective on how to get things done. Work on network infrastructures. Deliver business solutions and technology solutions from data, security, mobility and the cloud. \n\n\n\n\nWho You Are \n\nCurrently enrolled in an associate’s, bachelor’s or master’s degree in a related field such as Computer Networking, Computer Science, Electrical/Computer Engineering, Information Technology, Data Science or a similar field. \nBasic computer networking fundamentals relating to IP addressing, routing, switching, TCP/IP and OSI model. \nAwareness and general understanding of how consumer applications work over the internet (e.g., Browser, Voice/Video calls, Social Networks, Streaming etc.). \nFluent in English with excellent verbal and written communication. \nPassionate about Computer Networking, Information Technology and Computer Science. \nProficient in Python, REST APIs, Automation. \nComfortable with Data Analysis, creating visualizations such as graphs and heatmaps. \nAbility to multi-task, self-start, work in a dynamic team environment and work independently. \nAbility to quickly learn new technologies. \nStrong analytical and problem-solving skills with ability to troubleshoot technical problems. \nWilling to tackle new challenges and develop new skills. \nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\n  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\n  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\n  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/IT-Engineer-Intern-United-States/1338498",
    "position": [
      "IT Engineer (Intern) United States"
    ],
    "location": {
      "city": "RTP",
      "state": "NC",
      "country": ""
    },
    "description": [
      "IT has never been more important to Cisco and our communities. Our Digital Enterprise Solutions team reimagining the Cisco experience in order to show the world how to reinvent applications and leverage the future of the Internet and showcase the power of Cisco: our people, products, processes, systems, and data.As a technical engineer, you will play a key role in designing, implementing, automating, and supporting solutions that are critical to Cisco’s strategy and operations.\n\n\n\n\nWhat You’ll Do\n\nFrom our Technical Systems Engineers who build, configure, and upgrade our systems, to our Site Reliability Engineers who bring a software engineering mindset to our systems administration, our IT technical engineers interns are making Cisco’s IT transformation happen, all with their swagger for collaboration and innovation.\n\n\n\n\nYour roles & responsibilities may include:\n\nSpecify, build, maintain, and support technical infrastructure to achieve desired performance and site reliability.\nAnalyze, install, modify, configure, and support operating systems, IT environments, platforms, database or utilities software.\nOperate in and/or maintain engineering environment to support automated testing of code that is actively being used by customers.\nPerform root cause analysis for bugs or service interruptions and bring system or services back online once a problem is resolved.\nWork cross-functionally to be proactively aware of potential changes needed with applications or systems\n\n\n\nWho You Are\n\nYou are pursuing a bachelor’s or master's degree in Computer Science, Computer Engineering, Electrical Engineering, or a related major such as Math, Physics, etc\nPassionate about cloud technology, automation techniques, systems integration, data, and security\nAbility to simply and effectively communicate complex technical concepts to stakeholders\nPossess strong problem-solving instincts and attention to detail\nSelf-Motivated learner who can ramp up on new technology in a fast-paced, dynamic environment\nAbility to work efficiently as part of a collaborative team\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship\n\n\n\nWho You’ll Work With\n\nWe are engineers, developers, network administrators, analysts, project managers, and technology professionals. We are also community leaders, activists, parents, daughters/sons, and we stay united as one IT Family to “power an inclusive future for all.”\n\nYou would play a crucial role in transforming IT, Customer and Partner Relationships, and the Employee Experience through strategic and architecture-led projects, transparency and data-driven decision making, and finding ways to become more efficient.\n\n\n\n\nWhy Cisco\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! "
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Bachelor-s-Intern-United-States/1338366",
    "position": [
      "Software Engineer Bachelor's (Intern) United States"
    ],
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\n \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\n \n\nWho You Are \n\nPursuing a Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \nUp-to-date on programming and scripting languages: C/C++, Python, Java \nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \nHands on QA, Testing, and/or Debugging skills \nExperience with Databases, Web Application Development, and Web Services \nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n \n\nWhy Cisco \n\n  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\n  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\n  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\n  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \n\n \n\n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Master-s-Intern-United-States/1338368",
    "position": [
      "Software Engineer Master's (Intern) United States"
    ],
    "location": {
      "city": "RTP",
      "state": "NC - Austin",
      "country": ""
    },
    "description": [
      "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\n \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\n \n\nWho You Are \n\nPursuing a Master’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \n\nUp-to-date on programming and scripting languages: C/C++, Python, Java \n\nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \n\nHands on QA, Testing, and/or Debugging skills \n\nExperience with Databases, Web Application Development, and Web Services \n\n \n\nWhy Cisco \n\n  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\n  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\n  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\n  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\n  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \n\n\n"
    ],
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-30T23:22:58.042Z"
  }
]