[
  {
    "url": "http://www.cyber-iaml-program.com/details.htm",
    "position": "Navy Cyber IA and ML Internship",
    "location": {
      "city": "",
      "state": "",
      "country": "United States"
    },
    "description": "Cyber interns will be selected based upon academic achievement, resume', recommendation, and career & research interests. Selected undergraduate students will receive $8,500 in total for the work completed. All students will receive a housing and travel allowance, based on the lab location, if the program is an in-person program in 2022.",
    "company": "Department of the Navy",
    "contact": "",
    "posted": "",
    "due": "Nov 1, 2021",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  },
  {
    "url": "https://develop.larc.nasa.gov/apply.php",
    "position": "NASA DEVELOP Internship",
    "location": {
      "city": "",
      "state": "",
      "country": "United States"
    },
    "description": "DEVELOP addresses environmental and public policy issues through interdisciplinary research projects that apply the lens of NASA Earth observations to community concerns around the globe. Bridging the gap between NASA Earth science and society, DEVELOP builds capacity in both participants and partner organizations to better prepare them to address the challenges that face our society and future generations.\nTeams of DEVELOP participants partner with decision makers to conduct rapid feasibility projects that highlight relevant applications of Earth observing missions, cultivate advanced skills, and increase understanding of NASA Earth science data and technology.",
    "company": "NASA",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  },
  {
    "url": "https://twitteracademy2022.splashthat.com/",
    "position": "Twitter Academy",
    "location": {
      "city": "",
      "state": "",
      "country": "United States"
    },
    "description": "Twitter Academy is a paid 12-week summer internship program for historically underrepresented (Women,Black, Hispanic/Latinx and/or Indigenous People) second-year computer science students located in the U.S., Canada and Mexico.\nWhen you log into Twitter, you’ll likely see a feature shipped by one of our interns. You'll be given a project to drive. All of our interns have a hand in building a product that’s changing the world.\nYou’re given the freedom to take risks and the ability to use your knowledge to solve challenging problems.",
    "company": "Twitter, Inc.",
    "contact": "",
    "posted": "",
    "due": "2021-11-07",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  },
  {
    "url": "https://www.nsin.mil/x-force/",
    "position": "X-Force Fellowship",
    "location": {
      "city": "",
      "state": "",
      "country": "United States"
    },
    "description": "The X-Force Fellowship is a summer internship program that provides undergraduate and graduate students and recent graduates a chance to serve their country by solving real-world national security problems in collaboration with the U.S. military.\nThe Fellowship is a full-time (40 hours per week), paid opportunity. Depending on COVID-19 and Department of Defense guidance, the 2022 fellowship may be in-person or virtual. Fellows will be notified if the fellowship will be completed in person or virtually in early March 2022.\n\nApplications for the Summer 2022 cohort open October 18, 2021, and close December 17, 2021.",
    "company": "U.S. Department of Defense",
    "contact": "",
    "posted": "",
    "due": "2021-12-07",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  },
  {
    "url": "https://www.akamaihawaii.org/interning/",
    "position": "Akamai Internship Program",
    "location": {
      "city": "",
      "state": "Hawaii",
      "country": "United States"
    },
    "description": "The Akamai Internship Program offers college students from Hawai‘i an opportunity to gain a summer work experience at an observatory, company or scientific/technical facility in Hawai‘i in an 8-week program. The program has placements for students from community colleges and four-year universities from a wide range of STEM majors. Akamai has provided 451 students internships in Hawaii since 2003. The program has helped more than 250 get STEM jobs–many in Hawaii–earning Akamai the highest U.S. award for STEM mentoring. Years of experience and large network of STEM employers who host interns make Akamai a valuable and rewarding internship experience. The 8-week program includes:\n\nStipend of $3300\nHousing provided if needed\nTravel from home island to internship site paid by program\n1-week preparatory course + 7-week project",
    "company": "Akamai, Inc.",
    "contact": "",
    "posted": "",
    "due": "2022-02-14",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  },
  {
    "url": "https://careers.bungie.com/jobs",
    "position": "Bungie Animation and Game Design Internships",
    "location": {
      "city": "",
      "state": "",
      "country": "United States"
    },
    "description": "Bungie has multiple internship positions open, including Activity Design Intern, Animation Intern, Audio Engineer Intern, Gameplay Intern, Production Engineering Intern, Technical Art Intern, and more.",
    "company": "Bungie, Inc.",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-10-28T22:47:41.575Z"
  }
]
